{
    "id": 937,
    "video_id": "0IkacbTfZ8E",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Alfredo Diaz",
        "Colin Moriarty"
    ],
    "title": "Fallout 4, Bethesda Press Conference Reactions! - Kinda Funny Gamescast (E3 2015)",
    "description": "All the biggest Bethesda news of E3 2015! Fallout 4, Dishonored 2, Doom, Elder Scrolls Online, Elder Scrolls Legends! \n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1434347653,
    "duration": 2235,
    "transcript_chunks": [
        {
            "text": "welcome to the first ever Bethesda press conference post show of the Kinda Funny Gamescast. As always, I'm Tim Gettys. I am joined by the coolest dudes in video games Colin Moriarty and Greg Miller. Hi, we're joined alongside Alfredo Diaz. What's up guys, and we're going to talk about a little bit of that Bethesda stuff. So you were smiling a lot, Colin was making you smile, yo? Anyone doubt me out there who's doubting me now? Greg, nobody's doubting you. You were down, Col Moriarty. You just got **** put in the ground, son. When your boy Colin M was saying late last year Fallout 4 announced and released in 2015 a lot of **** out there were like Colin, you're crazy. What are you stoned? What are you on those mushrooms, and I was like no, son. Just got see, I felt something. I felt something in my balls. I felt so deep in my... I felt it so very deep in my balls. Wow, okay. I felt it. Yeah, yeah. Nick felt it. Felt the balls. So here we are. I was right. Col was right. How does it feel to be right.",
            "start": 0.31
        },
        {
            "text": "in my balls I felt so deep in my I felt it so very deep in my balls wow okay I felt it yeah yeah Nick felt it in felt the balls so here we are I was right Col was right how does it feel to be right after so long Col a year of being doubted see here's the thing about this is that I make a lot of predictions that are wrong right we all we say a lot of things some come true and some things I but I boldly made this and because a lot of people are giving me **** about this not a lot of people some people being like it's so obvious I'm like no no no I said this before Bea said they were doing anything in E3 before Fallout 4 was ever a thing before anyone knew about it and it's one of those things where for the predictions I made that were wrong like when I said Vita was going to outsell 3DS remember that remember that old Chestnut I remember when you said LittleBigPlanet didn't look terrible right and it it wasn't terrible but it wasn't good it wasn't good but this is one of those where I",
            "start": 53.4
        },
        {
            "text": "that remember that old chestnut, I remember when you said Little Deviants didn't look terrible right, and it, it wasn't terrible, but it wasn't good; it wasn't good, but this is one of those where I just stood by it, and I stood by it, and I stood by, and frankly, I just had no idea if I was right, and but now you know so it all played out, yeah, you were wrong about the exact date, it all, well, I said I originally said November, and so that was fine; well, no, and then people were saying well October 23rd to Friday the game is going to globally launch on Friday, October 23rd, 2077 is when World War I happens in Fallout, it's a one-day war, China and United States exchange their bombs, it's over, I'll give you the point, yeah, I'm going to take the point, thank you; well, actually, I didn't predict it in AR thing because I this was you just knew you just knew like out there already, but I'm very excited, the game looks extraordinary, the game looks absolutely extraordinary, deep, deep, deep stuff, I me saying",
            "start": 92.12
        },
        {
            "text": "thing because I think this was you just knew you just knew like out there already but I'm very excited the game looks extraordinary the game looks absolutely extraordinary deep deep deep stuff I mean saying deep I don't even I think that undersells that that with that game they had options on options on options the ability what is it I wrote it down the base weapons that then have 700 customizations 50 base weapons 700 customizations let alone this we're going to take over Towns now and build out your towns and be able to connect them and do all these different things and bring in Traders and **** this game is literally trying to be the only game you'll ever play for the rest of your life this must be when Mitchie D plays DOTA this must must be what he feels like the fact that he could play this the rest of his entire life and I thought that was going to be uh this year at least the Metal Gear Solid That Metal Gear Solid 5 The Phantom Pain Tim but now I I'm familiar with that you are",
            "start": 125.52
        },
        {
            "text": "this is the rest of his entire life and I thought that was going to be uh this year at least the Metal Gear Solid V: The Phantom Pain, Tim, but now I I'm familiar with that you are familiar with that thing now we're here and I I Jesus Christ, Jesus Christ did that game look awesome so you guys you guys love your Fallouts you love it you love it a lot you love it a lot but here's the thing people people they they love their Borderlands they love the Metal Gear Solid they love all this stuff I'm seeing a lot of aspects from those games just like Hey we're going to put it in Fallout and just go a little crazy with the options and I can imagine I saw Colin's eyes just like get bigger and bigger and I was like **** he's going to pop because when they it was really it was really clever the way they showed the game at first right like when they revealed the game they showed something that looked very familiar they showed a little bit of like 2077 before the war then they",
            "start": 163.76
        },
        {
            "text": "clever the way they showed the game at first right like when they revealed the game they showed something that looked very familiar they showed a little bit of like 2077 before the war then they just showed something like Fallout everyone's okay it's Fallout and they just held all of their cards to their chest and the reason that they announced Fallout 4 before E3 was because they were afraid it was going to leak and I think that that was a smart move you know you have to trust too many people every day that passes you know there are some people who can **** up you know I was thinking about it with them getting the pit boy being customized by a company they have the guys printing out the big Fallout 4 posters that are all over the convention center they have the iOS thing they were dealing with Apple all these people knew about this **** and they didn't say anything but every day that passes you are risking someone leaking",
            "start": 201.64
        },
        {
            "text": "the convention center they have the iOS thing they were dealing with apple all these people knew about this **** and they didn't say anything but every day that passes you are risking someone we're getting closer and closer to DJ somebody screwing this exactly so so the way they did it was smart because when they revealed the game it's like yeah it's more Fallout but there's all of these new things in it there's the game looks **** extraordinary yeah uh and I as I tweeted just before um if you are if you're not Assassin's Creed if you are not Call of Duty if you are not Battlefront you better run the **** away from fall 2014 you going you're going to get murdered murdered if you're G if you are not one of those four games you're going to get murdered this game really scares me though CU there's so much to do like I don't know since there's so many games in the fall but this game is like I don't no it's over how do I even it's done Jesus there's now the time is now it's like I've",
            "start": 234.6
        },
        {
            "text": "\"CU there's so much to do like I don't know since there's so many games in the fall but this game is like I don't no it's over how do I even it's done Jesus there's now the time is now it's like I've been talking you know about the the leadup of my year right where it was Borderlands, State of Decay, The Witcher now it's Batman then it'll be a little bit of The Witcher then it'll be Metal Gear, Metal Gear will run into Fallout and then it will be Fallout the rest of the way what aspect are you guys looking forward to the most I I mean really like I don't know where to begin for me for me I'm I'm the story sounds interesting right cuz like Todd Howard does want to ruin it and then ruins it but he doesn't like how the hell am I surviving 200 years but what I really want to get into is all the decisions and now the dialogue tree right we're talking you were talking about the things that pulled from Borderlands this or something over here that's the Telltale dialogue system right where you pop up and\"",
            "start": 272.24
        },
        {
            "text": "and now the dialogue tree right we're talking you were talking about the things that pulled from Borderlands this or something over here that's the Telltale dialogue system right where you pop up and you have all these different options to say at that one time right there and then the fact that you get them voiced now they're different uh Todd Howard was talking in the presentation right that you can jump in there he could have shot the robot he could have done this he could have said that he could have walked away like that's fascinating to see that level of characterization come in you know what I mean I think it's something to easy to take for granted and not and think back and forget about New Vegas in Fallout 3 where you are the silent protagonist you pick it and then they just start talking to you and it's not cinematic and it it's whatever that game was beautiful you can see the conversations in third person you can see them in first person you can do all this different stuff like I",
            "start": 311.96
        },
        {
            "text": "to you and it's not cinematic and it, it's whatever that game was beautiful - you can see the conversations in third person, you can see them in first person, you can do all this different stuff. Like I want to get into that world and start making those choices that make my character. The character creation also looked awesome, like I thought it was a really cool way to do it. It's like when it first showed up, it was kind of like \"oh, this looks kind of lame\" - like the girl in the background was like \"this is weird\", like an \"HBand Simulator\", yeah exactly. But then when it switched off and you could see... I liked that you went like feature by feature and just cycled through and saw the differences and stuff. I thought the presentation of this press conference was pretty well done, there were some moments they lost me a bit - like when they first revealed Fallout 4 and then they showed all the pictures and it was just like \"well, you knew they were building\"",
            "start": 345.4
        },
        {
            "text": "was some moments they lost me a bit like when they first revealed Fallout 4 and then they showed all the pictures and it was just like well you knew they were building to something though they were getting you ready for sure for sure but I the oven before jump in I don't know about that I don't know about that or just jump right in with like Doom I can do a doom yeah that was cool that oven wasn't really preheated no that I'm excited Colin because I did notice that at some point he crouched in follow it's good to know that my favorite myor feature from Fallout 3 it's like it's like when you do arm Cannon dueling or three heart runs and and The Legend of Zelda you only play Crouch to make it harder for yourself so yeah the slider less customization is really really cool and a lot of people were flipping out for absolutely no reason that there was no female protagonist or whatever in the trailer obviously Fallout's going to have a female protagonist so it's cool that it's",
            "start": 378.76
        },
        {
            "text": "\"A lot of people were flipping out for absolutely no reason that there was no female protagonist or whatever in the trailer. Obviously, Fallout's going to have a female protagonist, so it's cool that it's be the wife - so it's cool that you can be the man or the woman. I knew people were jumping the gun on that; that was obvious. What what surprised me was the way he talked about Todd Howard, of course, who's you know a guy uh was talking about. I mean Todd Howard's one of those guys where and I was I was joking with Greg when he like dropped the F-bomb which clearly wasn't in his script; he's one of those guys can just do whatever literally whatever the **** he wants - he don't give a **** they're not going to fire him so he can just do whatever he wants. But what was funny was that he was saying like basically by the time they finished Point Lookout, all The Fallout 3 DLC which was awesome I was thinking about Point Lookout recently which was **** awesome a great piece of DLC\"",
            "start": 415.56
        },
        {
            "text": "saying like basically by the time they finished Point Lookout in all the The Fallout 3 DLC which was awesome I was thinking about Point Lookout recently which was **actually** awesome a great piece of DLC um they started immediately working on this game so they were concurrently working on Skyrim which was presumably in pre-pro during Fallout 3's production and then they ramped that up and started pre-producing Fallout 4 so the game has been in development as we predicted for four years um even longer actually than I thought it was in production and when you see the game you can realize that they didn't just make the world and write the story and and make the engine but that they did um they did so much more with that time the the the customization options are really cool I mean I'm looking at my notes now like building a settlement protecting the settlement uh I mean this is this is incredible amount of depth in this game the thing you're talking about with the settlement is just the fact of",
            "start": 448.84
        },
        {
            "text": "notes now like building a settlement protecting the settlement uh I mean this is this is incredible amount of depth in this game the thing you're talking about with the settlement is just the fact of like it's not just build a like like that's Fallout right now to me you can't process it you like you know you can build a settlement in State of Decay right and do this different things and then you go and choose a new place this one you can do that but I mean like they were talking and showing you breaking down and building it however the **** you want I mean this wasn't like you're putting up a wall you choose a space this is how it is like when they had the you know the that **** Mega Man at the end Vault dweller right and then they had the die sign and they had this crazy ass electrical thing it's going to be fat like what the people are popping on my Twitter feed talking about right it's like it's almost Minecraft that's what I was saying earlier where it's like you see when",
            "start": 483.2
        },
        {
            "text": "\"Thing it's going to be fat like what the people are talking about on my Twitter feed, right? It's like it's almost Minecraft - that's what I was saying earlier, where it's like you see when I brought up Borderlands and um Metal Gear and all that stuff, it's like yeah add Minecraft to that. Like this really is like hey all the games that you like just getting sucked into and kind of living in here's a little bit the fun parts of all those but I like how there's like strategy put into it too as well right? So like you build your shelter but then it's going to get raided so it's like well how do I want to defend this, like what are the weak spots, like what do I need to build and like rebuild. And I think that's really cool. Yeah it's funny because we've only scratched the surface of Eastern Massachusetts, this Boston settlement you know the settlements and and you know kind of going through the remnants of the city. I mean I was telling Greg when that vault noise happened\"",
            "start": 521.76
        },
        {
            "text": "kind of Eastern Massachusetts this Boston settler you know the settlements and and you know kind of going through the the remnants of the city I mean I was telling Greg when that vault noise happened I was like Jesus Christ it's like yeah crowd went crazy the crowd went crazy and obviously specials back which is cool that's not a huge surprise um it's cool that you I'm interested about the story he said he won't go into and he doesn't about seemingly you're cryogenically frozen or something happens to you 200 years have passed so it's it's 2277 um by the time you get out of the vault which is around the same time Fallout 3 takes place so these events are happening concurrently to each other um one of the things that that popped out to me was the dialogue options it's no longer a list is now more as Greg described it a Telltale style uh button-based dialogue tree which is much more organic um which I think is cool uh the dog being recruited and being given commands is cool it's not",
            "start": 556.4
        },
        {
            "text": "now more as Greg described it a Telltale style uh button-based dialogue tree which is much more organic um which I think is cool uh the dog being recruited and being given commands is cool it's not something I'm probably going to play around with you going kill the dog immediately you're like I don't want you I just don't you know want to play with you hate Patillo so you're going to take it out in this but but here's here's one of the major things that I noticed and I don't know if you guys noticed this but I I liked it a lot is that they recapture the essence at least in one shot of Fallout 3 leaving the Vault yep yep you can do this and it they did it again they showed it actually you you start in vault 11 and then you leave the VA and it's all bright and you look around and you're in this world again and it's like that is when we played Fallout 3 that's the magical moment in that game that's one of the most special moments in any game and it's cool that they just did it again",
            "start": 591.84
        },
        {
            "text": "in this world again and it's like that is when we played Fallout 3 that's the magical moment in that game that's one of the most special moments in any game and it's cool that they just did it again because frankly that's not tiresome to anyone seven years ago the last time we had that moment New Vegas didn't have that kind of moment so I don't know I I when I saw that I was like that's **** awesome because it's going to fill me with that that awe and that Wonder again um I that game is gonna be overwhelming you know I can't so here's my question for you Colin Moriarty can't wait Mr. Fallout I'll call you from now on please do Mr. Fallout I'd like to know are you worried about the exact same thing that's happening to you with The Witcher happening with Fallout where you're so overwhelmed you can't make choices you can't play it you can't poop no I mean I'm so I I I mean I'll poop when I can yeah but I'm curious about about how I take it in terms of The Witcher 3 too because I'm I'm slowly working my",
            "start": 630.32
        },
        {
            "text": "choices you can't play it you can't poop no I mean I'm so I I I mean I'll poop when I can yeah but I'm curious about about how I take it in terms of The Witcher 3 too because I'm I'm slowly working my way through The Witcher 3 I'm doing everything now you know I'm like I'm skelly I I you know in in in the other areas I've cleared all the side quests I've cleared all the question marks everything so I'm slowly getting through I don't think that this game is going to be this that dense I mean that's not really what Fallout is it seems like Fallout is more and maybe they're going to change it but it seems to me like Fallout is 25 main quests 50 side quests that are metered and take time they could take hours yeah um but it's not a lot of like necessarily running around and and every inch of the world is something there's something about that in The Witcher that's fun it's also overwhelming but there's something about Fallout where it's not like that because it's not I don't want to say it's realistic",
            "start": 667.68
        },
        {
            "text": "is something there's something about that in Fallout it's fun, it's also overwhelming but there's something about Fallout where it's not like that because it's not I don't want to say it's realistic there's nothing realistic about Fallout but it seems a little more grounded in the sense that it's like you're not going to walk into this building and there's going to be five side quests in it and all these things, discover some of these buildings are just going to be abandoned sure um but I mean building your thing getting all the holotapes getting all the game tapes playing them all on your like this is going to be a platinum that will kill you Colin it will but I got the I got the Fallout 3 Platinum I'm interested to see uh what what the trophy situation is in the game but the other thing that we were talking about because we talked about building and all these kinds is the customization options in terms of the things you find in the world and I think that that's a really clever thing",
            "start": 709.08
        },
        {
            "text": "that we were talking about because we talked about building and all these kinds of the customization options in terms of the things you find in the world and I think that that's a really clever thing too you got uh I don't know what experiences with Fallout but you can basically collect anything you want in the game anything there's a can of food here there's a tire here there's and you don't do anything with it you just have when you start the game you when when you play Fallout 3 for the first time you just take everything for like the first hour and then you realize you can't move like you're over encumbered and then you realize that none of this matters there's only a certain amount of things in the game that really matter it's populated you can pick up a beach ball you can pick and in this game it's like well now when you pick up the beach ball there's plastic and you can use the plastic to build something and it's like that is just it's such an easy solution yeah but",
            "start": 739.2
        },
        {
            "text": "pick and in this game it's like well now when you pick up the beach ball there's plastic and you can use the plastic to build something and it's like that is just it's such an easy solution yeah but really really really an incredibly intuitive solution you have to figure that's where the base building or town building whatever is really going to come into play right is that you're collecting you and I are going to go through and meticulously collect all this junk and then it's going to be we have to store it somewhere it's I mean this this is if you're not a Minecraft player this is Minecraft of I've started collecting all this junk now I need to make chests I've made it all these chests now I need to make somewhere to put all these you know what I mean like you need to keep going to feed the addiction keep going on this and of course Todd points out in his thing right that it's all optional you don't have to jump in and do this with like Base building kind of stuff it's",
            "start": 770.0
        },
        {
            "text": "going to feed the addiction keep going on this and of course Todd points out in his thing right that it's all optional you don't have to jump in and do this with like base building kind of stuff it's like **** yeah which I love I love that there's you know this is the type of game that has the game then it also has 10 other games that you can enjoy if you want to this game seems like the game of the year that is going to end relationships like there's going to be so many couples that are breaking up because the boyfriend or girlfriend are just like I'm sorry or the best one just play them together well there's that too you know but that's right but I mean I won't see Christine when this game comes comes out it's true this is the end of me talking to steer like she'll just go into the room and be done Grandma Josephine laid up my God yeah Grandma Joseph not joking around no if she's not laying in bed playing games she's sleeping in the bed yeah right so Colin here's my question and",
            "start": 806.56
        },
        {
            "text": "room and be done Grandma Josephine laid up my God yeah Grandma Joseph not joking around no if she's not laying in bed playing games she's sleeping in the bed yeah right so Colin here's my question and this goes for the panel as well of course is is there anything at E3 now that can beat Fallout for game of the show no I don't think so you see it's interesting because I I do not have that interest in this game I don't like these we've talked about this a million times we did the let's play and it was awesome for Fallout 3 recently I sat down with Colin and played it and it's like I get it I totally get it I get that it's not for me and those things and so many people are going to talk **** and I get that fine but it's like I still understand that this probably is going to be game of the show over and that's the thing like right we're talk we're not talking about our favorite game we're talking about what do you think game of the show is that's going to be this amazing thing like cuz",
            "start": 842.8
        },
        {
            "text": "show over and that's the thing like right we're talk we're not talking about our favorite game we're talking about what do you think game of the show is that's going to be this amazing thing like cuz it seems I mean this is one of being in this room and hearing the reactions everyone's having like I don't get it but I Alfredo I think is insane, as me yeah I'm not too big of a Fallout like I haven't played any of the fallouts but then again like I can understand that there's so much depth and quality in this and it's like how do you really beat that yeah I mean I'm I'm waiting I want to see cuz like there's definitely a couple things I got my eye on but at the same time it's like there's I don't think that they can compete with this you know like something like Uncharted 4 like I think that would be another one that people are going to be rooting for but it's like this this is different you know I mean yeah I feel like I mean Uncharted looks extraordinary I can't wait are both huge",
            "start": 884.76
        },
        {
            "text": "that would be another one that people are going to be rooting for but it's like this this is different you know I mean yeah I feel like I mean Uncharted looks extraordinary I can't wait are both huge Uncharted fans but it's a known quantity at this point so right now like Fallout 4 is just more exciting I mean we we we'll see what happens when the dust settles this might even be a more appropriate question to ask in a month after you like after you've processed processed it and figured it out because the thing you know Alfredo hit on something that I think Salient which is like Fallout 4 is quality Fallout 4 is depth Fallout 4 is nonlinearity Fallout four is these things that I think people are are you know to put this into context which are three 4 million copies in 2 weeks yeah Fallout 4 is going to sell extraordinary amounts of copies I think that some people really do underestimate how many copies this game is going to sell I mean I'd be again I'd be one of the things I'm taking",
            "start": 920.36
        },
        {
            "text": "4 is going to sell extraordinary amounts of copies, I think that some people really do underestimate how many copies this game is going to sell. I mean, I'd be again, I'd be one of the things I'm taking away from this most is I'd be in boardrooms at Activision, at Ubisoft, at EA being like, \"I don't know if we want to be in November.\" Yep, yep, you if you're not Call of Duty, if you're not Assassin's Creed, if you're not Halo, you're you're out of luck. Because this isn't only a game that's going to demand $60 from 10, 15 however many million people, but it's going to be a game that takes months of their time. Time, yeah, that's I think that's the even bigger thing. You know, people go into the holiday season and you know usually you either choose your one game when you're younger and you you know your parents are buying games and stuff or you choose the handful and like you talk to your uncle you're like get me this one you talk to your your you know your neighbor you're like hey",
            "start": 960.88
        },
        {
            "text": "you know your parents are buying games and stuff or you choose the handful and like you talk to your uncle you're like get me this one you talk to your your you know your neighbor you're like hey neighbor it's Weird that you buy me Christmas presents but like I want this one but you know this is the type of game that like that doesn't even matter it's just like tell one person I what Fallout for you're just going to play it forever yeah yeah so then one quick thing of course Tim yes many people are watching this on youtube.com/ kindafunnygames or listening to it on the MP3 because this is a Gamescast we're breaking out we're doing all these different games casts from here some people are watching it on Twitch right now yes twitch.tv/kindafunnygames just sneaky says the only thing that could beat this 43 game of the show is if valve comes out and announces halflife three which they wouldn't yeah that's like a yeah I wasn't presenting that as like that's really going to happen I'm just",
            "start": 998.0
        },
        {
            "text": "beat this 43 game of the show is if Valve comes out and announces Half-Life Three, which they wouldn't. Yeah, that's like a yeah I wasn't presenting that as like that's really going to happen I'm just letting you the bar no but that's that I mean that's a good that's a good point though that like is what it would take to kind of Dethrone this. I also love that this was the first press conference of E3 and they kind of just came out and they were just like, \"Yo, well that was the thing when they announced it.\" Sure you have to imagine that every other press conference was like, \"God damn,\" at least they're getting a day ahead. But I mean like tomorrow morning, like people if you didn't stay up and if you went and watch Game of Thrones like a nerd before this, you're going to wake up and like have to deal with this and like fall like Xbox One over Shadow in the morning right the talk is going to be about this and what's happening with it and I I just want to say real quick cuz I was just looking",
            "start": 1033.44
        },
        {
            "text": "deal with this and like fall like Xbox One over Shadow in the morning right, the talk is going to be about this and what's happening with it, and I I just want to say real quick cuz I was just looking up the numbers real quick to just kind of you know quantify more what we're talking about with sales numbers yeah Fallout 3 in 2 months did about 5 million units um and that Fallout 3 was just not a known quantity compared to the way Fallout is now um so I I would expect I would assume double that for Fallout 4 and I mean that's the thing especially at the time that it's coming right now where the next gen or current gen systems right now are still in their early stages and like this is going to be one of those first big games really multiplatform games that are just going to like this is why and it's the next gen only or the current gen only you know and like I think a really good sign that we're finally moving into that era of new yeah I think uh yeah I'm interested yeah it's going to do",
            "start": 1069.16
        },
        {
            "text": "it's the next gen only or the current gen only you know and like I think a really good sign that we're finally moving into that era of new yeah I think uh yeah I'm interested yeah it's going to do very well on PS4 it's going to do very well on Xbox one is going to murder on PC um so because that's where you know the modders are and and obviously there's been a a reinvigoration even of Fallout 3 and Fallout New Vegas fandom that you've seen lately um we read a story on Colin and Greg live a week ago or so where they were saying like Fallout three sales spiked 1,000% or something well it's funny right now I keep trying to refresh the Bethesda store and there is getting hammered right now because show of hands who is going to buy the collector's edition to get the Pip-Boy no no I'm seeing people putting their hands up it's happening it's all over folks Okay Google okay Pip-Boy oh yeah if we want to talk about that let's",
            "start": 1103.8
        },
        {
            "text": "the pit boy no no I'm see I'm happy put his hand up people putting their hands up it's happening it's all over folks Kevin next Okay Google okay pit boy oh yeah if we want to talk about that let's we had a huge win of course everyone knows that Kevin is backing dead technology and refuses to buy an iPhone so we can all that was good so all we want to do is iMessage and Kevin ruins it for us and so now we get that the iPhone goes in the pit boy it's great and also fallout shelter iOS game out tonight not for you and your Google Android there Kev hope you had fun it's over buy an iPhone so the big question then Colin is what how what do you think about this fallout shelter the iOS game yeah I mean there's a couple other things to touch on which is the iOS game is cool uh looking I'm probably not going to mess with it I just don't want to play those kinds of games can knock boots in it you you you could knock boot but it's it's clever and it's cool and I like that they're making it",
            "start": 1143.36
        },
        {
            "text": "not going to mess with it I just don't want to play those kinds of games can knock boots in it you you you could knock boot but it's it's clever and it's cool and I like that they're making it for fun basically I mean they're going to have microtransactions for buying those lunch boxes that are full of items but it seems like a game they said they they they made a point of saying it's not a game you necessarily need to spend money on or have to spend money on at all which I think is cool and they have the the financial luxury of of doing that um and I think the other thing you know with the Pit Boy the real Pit Boy that's going to come in the collector's edition is that second screen experience that that app that they're making for your phone that you then put into the Pit Boy that then um kind of just works um as a Pit Boy I think that's that's pretty clever too I mean I I I don't know man Fallout 4 is a is a is a show stealer it's it's Incredible because we often talk about",
            "start": 1187.36
        },
        {
            "text": "kind of just works um as a pit boy I think that's that's pretty clever too I mean I I I don't know man Fallout 4 is a is a is a show stealer it's it's incredible because we often talk about the press conferences as being like the fourth quarter of the Super Bowl first right of e3 and then this is like the last touchdown happening before that wins the game before the rest of the fourth quarters even played you know I mean it's incredible how cart before the horse everything is this year uh because this is the biggest game this has to be the biggest game of the show some someone would have to have something extraordinary Crash Bandicoot has to come back Crash Bandicoot he's going to come back the two companies that really are capable of putting out a game that big are are don't do E3 and that's Rockstar and and and valve so it's you know I don't know I'm super curious to see I'm I'm still excited obviously about the other press conferences but real quick the chat is",
            "start": 1218.56
        },
        {
            "text": "do E3 and that's Rockstar and Valve so it's you know I don't know I'm super curious to see I'm still excited obviously about the other press conferences but real quick the chat is saying that the Stupid Android well oh I know so good for you Kevin I like is it out tonight though Kevin I'm playing it right now God damn I'm excited I'm excited to unbox this Pit Boy though I feel like this will be a fun Kinda Funny unboxing running around messing around with it well it's just going to be funny to be like I'm GNA wear this **** thing when I stream this game and I'm G to stream this game for **** hours I'm GNA be sitting there like an **** doing this you going to look like Kevin in normal life yeah I will I will look as ridiculous in just as Kevin looks in daily life I'm actually really looking forward to um the app or the game simply because like for me Fallout I've never played any of the Fall other fallouts and Fallout 4 to me right now",
            "start": 1260.92
        },
        {
            "text": "looks in daily life I'm actually really looking forward to um the app or the game simply because like for me Fallout I've never played any of the Fallouts and Fallout 4 to me right now just like holds too much so I feel like this is an easy way to like baby step me into their world mhm so not the app the iOS game the iOS see that's the thing is like I think you know like Greg over there as soon as like uh they started talking about everything happening in Fallout Greg's reaction went inside him whereas Colin and I our reactions only got bigger and so which is hard to believe that that could even happen I know right but that the thing is like for for baby dick Greg over here it doesn't matter he's going to be able to we all have baby dicks yeah I think Colin's the only one just say shot don't worry about it it's no big deal talking **** I'm talking get shot I'm going to get shot but what I'm saying is I think Alfredo I think you should give it I think you're going to be",
            "start": 1299.44
        },
        {
            "text": "say shot don't worry about it it's no big deal talking **** I'm talking get shot I'm going to get shot but what I'm saying is I think Alfredo I think you should give it I think you're going to be all right I think you are going to be eased in right you come out of the Vault and then you get to go and it's not like you're going to immediately be dropped on top of you build this shelter do this **** talk to the dog you'll be all right all right cuz I saw Geralt I jumped in I was like holy **** there's a lot to do no if The Witcher guy then yeah you probably **** The Witcher is a very dense game I don't I I personally don't I don't think this game is going to be that as as dense I'm sure it's going to be dense but I don't The Witcher is really almost unprecedented in density you know yeah played a lot of these kinds of games I've never played a game quite like The Witcher 3 with I appreciate it there a lot of bang for your Buckman CD project great doing a great job but um I don't",
            "start": 1342.72
        },
        {
            "text": "yeah played a lot of these kinds of games I've never played a game quite like The Witcher 3 with I appreciate it there a lot of bang for your Buck, CD Projekt great doing a great job but um I don't suspect that it's going to be even 50% as dense mhm because what they do is is I feel I'm not saying The Witcher has a bad story because I don't think it does but go fetch this thing for this guy and the side quest is over in two seconds really doesn't do that you know so it's more like the side quest Quest is going to take you 90 minutes yeah so we'll see we'll see what how that all kind of comes down so moving on from Fallout then Alfredo which which of these are you more excited about Dishonored 2 or Doom oh Doom okay cool let's talk about Doom then so what do you guys think I think it looks awesome **** beautiful just it's totally beautiful the it's totally gruesome like I mean you got this from the very beginning where he like Steps over breaks the dude's leg and then hits him in the",
            "start": 1378.92
        },
        {
            "text": "Awesome, beautiful just it's totally beautiful. The it's totally gruesome like I mean you got this from the very beginning where he like steps over breaks the dude's leg and then hits him in the head with his own foot. You're like, \"Jesus.\" Yeah, when they broke out the chainsaw, I was just like, \"My God.\" Like it looked a little canned in the beginning. This game has to be played on a mouse and keyboard. I'm sorry, shut up. You... Sorry, that was clearly a PlayStation 4 demo they were running it on. I could tell; I have the eye. I saw the frame rate; I knew it was happening. I feel like what I tweeted out about Doom that seemed to resonate with people, which is that this game has isn't pretentious. This game isn't trying to be anything but fun, and I think there's a place for a game like that. I like story; I like depth. I'll play a game like you know Gone Home all day, but Doom... When I saw Doom, and it's called Doom, it looks like you go in and just kill stuff. Colin was right again. Uh, well, it says to me that",
            "start": 1419.84
        },
        {
            "text": "that I like story I like depth I'll play a game like you know Gone Home all day but Doom when I saw Doom and it's called Doom it looks like you go Col was right again uh it well it says to me that it's just they don't make many games like this anymore that are so over the top like in terms of lack of depth in other words it's not a game where it's like oh we'll put a story to make you take it seriously and you won't take it seriously it's like no we really don't give a **** about it at all um you're just going to run around and shoot stuff in 60 frames and it's going to be a lot of fun and it's on Xbox One and it's really beautiful and it just looks fun it just looks fun now very orange here's the one thing I want to say and I think Tim might be on the same page with me on this watching it and granted I'm not playing it which is different I was worried is it going to get repetitive for me even the demo went a little long where I was like I started looking at Twitter a little bit more",
            "start": 1468.48
        },
        {
            "text": "it and granted I'm not playing it which is different I was war is it going to get repetitive for me even the demo went a little long where I was like I started looking at Twitter a little bit more like I don't me wrong I thought it was cool the super shotguns awesome the chainsaw was cool the verticality I'm like yeah it seems fun but then it just was at some point like shoot stuff yeah I mean I was a big fan of the like the double jumping like like they started the demo off with that I was like yes yes because it reminds me of the arcadey fun shooters that I loved so much back in the day and they it it's not the Alfredo shooter where you need hella skill and you need to actually be good at shooting things shoot a bunch of stuff run around shoot **** have fun chainsaws right and I like that a lot looking at it like I was talking about the animations you get that moment when you're watching it the first time you're like oh **** that's cool oh **** that's gruesome but you know",
            "start": 1509.16
        },
        {
            "text": "that a lot looking at it like I was talking about the animations you get that moment when you're watching it the first time you're like \"oh, that's cool\" or \"oh, that's gruesome\", but you know that it's going to get repetitive and you know that like looking at the little hologram thing that like shows what happened there or whatever, it's like those moments are going to get a little bit repetitive and it's going to get to the point where you kind of want to skip through them and it's going to be a little less fun. Um, but it reminded me a lot of when we did our let's play of Wolfenstein: The Old Blood, not Castlevania, where it's like it's not a modern game and I think that's what's really cool is that it definitely knows what it is and it's kind of just bringing you back to that. And I, I like that. Watching the demo got me excited in a good way, that I was like \"oh man, this I might want to actually play this\" and for",
            "start": 1545.04
        },
        {
            "text": "what it is and it's kind of just bringing you back to that and I I like that and watching the demo got me excited in a good way that I was like oh man this I might want to actually play this and for those that know me I've not like somebody that needs to play every game but what do what do you think about that I know I got a feeling of like repetitiveness when I was watching it and I was talking to Colin like with the chainsaw animations I was like I hope there's like a quick like quick jab quick stab right yeah and then I think for me what made it seem so repetitive is the enemies didn't really seem challenging to me it's hard for a demo it's always hard for a demo to show you what it's going to be like but yeah there was to but it was just like H there's there enemies they're just kind of there to be torn apart he was doing the runaround right where that one part where he I thought I thought he jumped over something on and like there was a guy who's aiming there and the guy who was",
            "start": 1581.2
        },
        {
            "text": "of there to be torn apart he was doing the runaround right where that one part where he I thought I thought he jumped over something on and like there was a guy who's aiming there and the guy who was aiming there and he was just tearing these guys a new one every time he went which was cool but it was like yeah like what difficulty is this on how is this going to work but I yeah I don't know like I'm not I mean I'm not the first person shooter guy I never have been you know what I mean so like I I saw a beautiful game that its lighting is awesome that the weapons look fantastic it seems like it's really moody and cool but if it's going to be moody and cool and that'll make me play through it I don't know yeah yeah I mean that's the thing that there's not much to say about it because it's Doom and and I and that's and that's what Doom is and I I I I agree that it lacks a little bit of modernity but it it is different than what MachineGames is doing with Wolfenstein in the sense that",
            "start": 1620.88
        },
        {
            "text": "doom and I agree that it lacks a little bit of modernity but it is different than what MachineGames is doing with Wolfenstein in the sense that MachineGames is taking Wolfenstein, which was also kind of vacant when it was made in 1991 or 1992, and making it very story driven, Wolfenstein: The New Order and New Colossus are very story driven and character driven and slow and plotting, and Doom is fast and bloody and brutal and old school. I'm interested to see I feel like this is a game I'm going to like a lot; I like shooters and I like playing single-player shooters, um, which is why I appreciate what id has been doing but I'm curious to see how this resonates with other people when it comes out in 2016 because is this going to be a game that has resonance with people, is this going to be a game that just sells a million copies and goes away, is it going to be",
            "start": 1654.12
        },
        {
            "text": "comes out in 2016 because is this going to be a game that that has resonance with people is this going to be a game that just sells a million copies and goes away is it going to be is going to be a phenomenon I I really don't know because it this isn't the same idid yeah that made Doom 3 and that's just that's just a fact of personnel there you know yeah and what's interesting you say that this is Doom and one of the things that I took away from it is that it lacked a little bit of the the Doom the Fear Factor and like the the scariness of it not the Doom was ever like horrifying but I do think it was a little more horror element like there was more horror elements in it than we saw here this was a little bit more you're a **** badass but I feel like this is just cuz you're on God mode they're doing the demo to make it look awesome I still think when you're playing you're going to be going around corners they'll be you you'll start running backwards as they come at you where this",
            "start": 1694.6
        },
        {
            "text": "they're doing the demo to make it look awesome I still think when you're playing you're going to be going around corners they'll be you you'll start running backwards as they come at you where this was like literally like I'm going to **** punch youest there was no moment like that you know in Doom 3 A lot of it was like the flashlight even though that was **** people didn't like but it had a different feel like this reminded me more of like a modern horror movie compared to a classic horror movie where you get scared from the like the the jump scares and the old ones whereas new horror movies are just blood and gore and like that's supposed to be scary part but am I the only one that's looking forward to multiplayer yes yeah I mean I'm not going to 1,000% and you said that the multiplayer will reely remind you a lot of Unreal Tournament right I play a lot of Unreal back in the day so I was like oh this is cool it's like you don't really have multiplayer games like that anymore so yeah the",
            "start": 1729.6
        },
        {
            "text": "will really remind you a lot of Unreal Tournament, right? I play a lot of Unreal Tournament back in the day, so I was like, \"Oh, this is cool.\" It's like you don't really have multiplayer games like that anymore. So yeah, the fast-paced, arena-style shooters - man, like those double-jumping around shooting big rockets and all that stuff... Like that definitely holds a special place in my heart. It's like, as somebody who's really into the online shooter community, like do you think this has a chance at having a decent following? I think it does, yeah. Especially when you can create like a whole bunch of different maps and stuff like that. I think it'd be interesting just to kind of... play, and I think it... I think it can. Yeah, that's the other thing - there's the whole map creation and all that stuff, which is cool. Snap Map - that's a terrible name, weird name, but like, but it makes sense for what they're doing right? Because you saw it, it was like a simpler LittleBigPlanet where you can",
            "start": 1764.48
        },
        {
            "text": "stuff which is cool Snap Map, that's a terrible name, weird name, but like, but it makes sense for what they're doing right because you saw it, it was it's like a simpler Little Big Planet where you can just snap stuff in like you want the fire there, you want this, the fire arises, yes, um, yeah, so I mean, you know we got the November 10th 2015 date for Fallout and for this they just said spring 2016 uh PS4 Xbox One PC and that's basically the skew that the skews that every one of their games that they talked about basically are on with the exception of maybe I don't know the Elder Scrolls Legends which I don't really care about and uh Battlecry um what are you saying, I'm just saying a 30 oh okay thank you don't worry about it Nick well the only game we have we have left to talk about obviously is Dishonored yeah well cuz yeah like battle uh I have a lot to say about the Elder Scroll Legends no you don't no you don't Gwent killer well so here's something interesting is that but you know in our",
            "start": 1801.8
        },
        {
            "text": "Dishonored, yeah, well, cuz, yeah, like battle uh I have a lot to say about the Elder Scrolls Legends. No you don't, no you don't, Gwent killer. Well, so here's something interesting is that but you know in our pre-show and in a couple of our predictions things you guys were talking about how you thought it was just going to be the three games Dishonored, Doom, and um and Fallout obviously, so I was a little surprised to see some of these little things but at the same time it kind of made sense cuz it was just nice little filler things that weren't exactly like you know Breaking the Bank like announcements. But it's like I did like that there was the the iOS um Fallout and there was things that are just like hey we had a lot of **** that we do deserve our own press conference, like I feel like we do deserve this press conference. Well, I feel like that was a big question is people are like do you need to be doing this or is it just going to be demos that you could have done somewhere else and I feel",
            "start": 1841.88
        },
        {
            "text": "this press conference well I feel like that was a big question is people are like do you need to be doing this or is it just going to be demos that you could have done somewhere else and I feel like they did enough this kind of put those smaller games on a much bigger scale and it made people care about them a little bit more than if it was just like a headline that would disappear in two seconds on a website you know I agree with that cuz I didn't even know Elder Scrolls Online was out on consoles until I walked upstairs saw my brother playing it and I was like oh that's out now he's like yeah it's out and I was like oh damn so Dishonored yeah the the secret that was broken I mean Dishonored looked cool the one thing I was curious about is there seemed to be seamless uh the game looked really beautiful yeah and at first I was like okay it's pre-rendered and it looks really pretty but there was there was a lot of scenes that seemed like it was going into the gameplay and then back into",
            "start": 1878.64
        },
        {
            "text": "beautiful yeah and at first I was like okay it's pre-rendered and it looks really pretty but there was there was a lot of scenes that seemed like it was going into the gameplay and then back into into uh these cutscenes like when he's running down the hallway or she's running down the hallway um and I was like okay so is it is the whole game look this good because I was surprised by games like The Order 1886 and other games that are like that game actually is that pretty and it plays you know the cutscenes don't cut away Sony's famous for saying you know in their games like yeah this is in-game you know this is in-engine footage on a PlayStation 4 and I'm wondering like what the nature of that Dishonored uh demo was because it looked really really pretty and my my gut tells me that that that's you think that's what the game looks like huh yeah I was going back and forth on it cuz the models looked like it but yeah it did look like it was put together but you get to be the smoke",
            "start": 1914.92
        },
        {
            "text": "that that's what you think that's what the game looks like huh yeah I was going back and forth on it cuz the models looked like it but yeah it did look like it was put together but you get to be the smoke monster from Lost so yeah so we're good yeah also The Magicians over there somehow figured out how to animate a female character crazy female assassin what are you talking yeah it was really yeah I I was excited to see that for you know everyone that's been you know wanting to play as more female characters and that's great um I think the game looks pretty uh interesting and a little disappointed in you know the definitive edition the game just came out 2012 but again you know you get people hyped up about this honor too you know you have a lot of people that didn't play the original one so it's funny cuz we have been talking about like collections like we're going to get a Fallout collection or will they talk about an Elder Scrolls collection we got the Dishonored one yeah definitely",
            "start": 1951.6
        },
        {
            "text": "so it's funny cuz we have been talking about like collections like we're going to get a Fallout collection or will they talk about an Elder Scrolls collection we get the Dishonored one yeah definitely would not have called that but for me the watching it the CGI trailer was what or CGI element of the what they showed that's really what kind of wowed me like I know it's just CGI but it was good CGI and it was E3 painting like when they were going through the like building was like transforming and more that was I was like **** the enemy designs still look super sick yeah like it definitely got me in a way that um I I was never really interested in Dishonored one yeah so I was like man that looks dope and those little birds flying around and stuff I can imagine putting a bomb on the birds and just sending them out the game looks pretty it looks atmospheric I like that with the original Dishonored you can play without killing anyone and that's another thing that you can do in this",
            "start": 1989.4
        },
        {
            "text": "and just sending them out the game looks pretty, it looks atmospheric, I like that. With the original Dishonored, you can play without killing anyone, and that's another thing that you can do in this game again - you play it however you want. Um, you can play it totally brutally or totally stealthily or somewhere in the middle, so thank God. And uh, and the game should be pretty different based on that. It's cool that you know Bethesda owns Arkane; they own Dishonored, and Dishonored - the original Dishonored was more of a cult hit than anything else. I mean it's sold respectively, and they certainly made money on it, but it wasn't a game that was necessarily obvious that they would go back to right um, and they did. And I think that that's really cool, you know, that they're doing that. Um, because really when you think about it the games that they talk about today are all derivatives - you know Elder Scrolls Online, uh Elder Scrolls Legends, Fallout 4, Dishonored 2, Doom; the only game is Battlecry.",
            "start": 2024.28
        },
        {
            "text": "you think about it the games that they talk about today are all derivatives you know Elder Scrolls Online uh Elder Scrolls Legends Fallout 4 Dishonored 2 Doom the only game Battlecry is the only game that's a new IP yeah and what they're showing is that you can kind of treat these things with respect um and make them feel fresh even if they're not by for instance removing the four at the end of Doom right but no but I mean like like I can't I when it when it comes out Definitive Edition Dishonored we need to do a let's play and I need to remember why I it didn't click with me but like the gameplay they showed there looked different like when it was going I wasn't even sure if we were getting to Dishonored 2 cuz he was like I want they were kind of Co in the beginning of like we want to show you what we've been working on right and they didn't say the sequel they didn't say this unless I missed it and you jump in you're like is it going to be Disor 2 is it something different and when it",
            "start": 2058.32
        },
        {
            "text": "you what we've been working on right and they didn't say the sequel they didn't say this unless I missed it and you jump in you're like is it going to be Dishonored 2, is it something different? And when it got there at the end it felt more modern, it looked different. I was H that that's it's interesting and that has me more excited than the original Dishonored did. Mhm all right any closing notes on this beautiful Bethesda press conference if you're watching us on twitch.tv/kindafunnygames make sure you click the follow button because we're back tomorrow at 9:00 a.m. with our coverage of Xbox and then we're on all day long just so you know we go to laugh M absolutely my Bethesda thoughts are Fallout yeah I got to like sleep on I almost want to watch the demos again just well the fall one in particular just to see yeah just to see cuz I was taking notes and trying to kind of write things down and I I certainly missed a few things but it I don't know man I'm excited I me that's that's the game",
            "start": 2095.68
        },
        {
            "text": "just to see yeah just to see cuz I was taking notes and trying to kind of write things down and I I certainly missed a few things but it I don't know man I'm excited I me that's that's the game I have my eye on now you know now that it's all real and official and it's really coming in what a **** year for games yeah my God yeah good year this is going to be good and they and they identified a date and that tells me they're hitting it you know there's no reason for them there's no reason for them to do that if they weren't confident that they were going to hit it so I I I expect that date to stick mhm yeah I'm excited for Doom that looked cool I'm excited to see more of that and see what what what it comes into Dre is my number one pick but like Fallout just keeps intriguing me more and more are you going to try it are you going to try Fallout 4 I'm going to try it good yeah all right so we'll see what happens be a man Fredo yeah be a man I'll man up I play Titanfall for you",
            "start": 2130.64
        },
        {
            "text": "more are you going to try it are you going to try Fallout 4 I'm going to try it good yeah all right so we'll see what happens be a man Alfredo yeah be a man I'll man up I play Titanfall for you you can ladies and gentlemen this has been the first ever Kinda Funny Gamescast for the Bethesda E3 2015 post conference yeah it's going to stick sure good let us know in the comments what your favorite announcement was and if it's Fallout 4 just keep saying Fallout 4 # is right let him know cuz we all know that's what it's going to be but we're going to be back tomorrow we're going to be streaming all day from 9:00 a.m. until God knows when probably done man yeah son's done so I'm going to say midnight and tomorrow is the day deal remember that we can use the co-stream mode so you never have to leave even if you're on your mobile you never have to leave twitch.tv/kindafunnygames it's going to be beautiful I'm so excited yeah this this is a great E3 already day negative one negative two",
            "start": 2160.0
        },
        {
            "text": "leave even if you're on your mobile you never have to leave twitch.tv/kindafunnygames it's going to be beautiful I'm so excited yeah this this is a great E3 already Day Zero is the press conference day well thank you for joining us and this Kinda Funny adventure thank you GameSpot for making this all happen we're in their room we're in their War Room loud and annoying they probably hate us we can get louder though I think we're going I'm excited to be here in LA cities at E3 all day Daniel DWI all day Daniel D thank you guys so much",
            "start": 2200.4
        }
    ]
}