{
    "id": 919,
    "video_id": "vF2dmNglpnU",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Why E3 Is So Special - The GameOverGreggy Show Ep. 79 (Pt. 1)",
    "description": "We discuss the magic of E3.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1433746801,
    "duration": 2367,
    "transcript_chunks": [
        {
            "text": "Heat. Heat. What's up everybody? Welcome to the GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer/seducer, Nick Scarpino. Hi. How you doing? I'm well. Does it feel like the old days wearing the headphones? Kevin's off at some dumb wedding. It does. I'm just going to monitor for a few minutes and then just throw him on the ground and step. Don't know that we just bought new headphones. So, it's not a wedding. It's a sexy birthday rendezvous. You told me it was a wedding day. You told me he was at a wedding. Mm- Is he getting married? No. What's the guest of honor's name? Anyways, so what? Paula took him away for his birthday. Yeah. Where'd they go? Um, they went on some weird safari thing. That doesn't sound sexy. Yeah, I saw them at a zoo or something. Sounds like malaria. Yep. It sounds fun though. From what I talked to him, it sounded good. I heard an elephant in the background. You did not hear an elephant in the background. I did not. Over there. The producer",
            "start": 0.0
        },
        {
            "text": "Yep. It sounds fun though. From afar, I talked to him, it sounded good. I heard an elephant in the background. You did not hear an elephant in the background. I did not. Over there. The producer went Tim Gettys. Hello. Over here. Long Island. Good to be here with you today. Petey's head. This is a little son of a gun. Getting old. He is. He's getting all gray. Yep. And dumb. No, he's always been dumb. I guess he's always been dumb. Yeah. That's not That's no change. How's everybody doing? Good. Good. Feeling good. Yeah. Yeah. We're coming off Momocon. Mhm. Thank you to everybody who came out to Momocon, came to see us at our panel, hung out with us, came for all of you asking out there, Momoc is Japanese for peach and peaches are a big deal. Officially, Georgia is where Momocon was, right? Progress in peaches. And what they also explained to me was that peach is synonymous with anime. And I like why do you say that? Anime. Anime. Anime. Anime. Uh, now what? Peaches and anime",
            "start": 76.72
        },
        {
            "text": "Progress in peaches. And what they also explained to me was that peach is synonymous with anime. And I like why do you say that? Anime. Anime. Anime. Anime. Anime. Uh, now what? Peaches and anime have to do with each other. I have no idea I don't know why would they call it Peach Con, which makes sense if it's a farmers market. No, I think it's I think it's cute. They're doing it because George is well known for its peaches. This is a Japanese-centric thing. And so they're just saying it's Momoccon. Like it's it's it's implied, you know. The thing is that most people that even go to Momoccon have no idea that it means peach, right? Including me. I didn't know that until a few days before we even went. It has Peach in the uh official logo. Yeah. From It's all once you see it, it's like the FedEx logo. You can't unsee I just I'm one of those guys that likes names that are incredibly descriptive. So like Comic-Con. Just like the FedEx",
            "start": 116.0
        },
        {
            "text": "It's all It's all once you see it, it's like the FedEx area. You can't unsee I just I'm I'm one of those guys that likes names that are incredibly descriptive. So like Comic Con. Just like the FedEx thing, Greg. Just like the FedEx thing. Or are they just very clear peaches? Well, no. It's not like it's just one you're instead of seeing the arrow, you're seeing the peach in Momo. You always see the peach as a peach. But it's when you know Momo means peach, the logo takes on a whole new meaning. I guess so. Just like when you understand arrow means arrow, FedEx means different things. Okay, now you finally won me over with that argument. I still think he's wrong. Let me think he's wrong. Let me ask you an unrelated question, Greg. Sure. When you pick I always notice you pick up Portillo's with authority. You pick up Portillos as if you've done it once or twice. Once or twice. Does he fit in your hand in a very specific way? Yeah. Rib cage, right? Rib cage right in the center of So, like",
            "start": 154.16
        },
        {
            "text": "Authority. You pick up Portillo as if you've done it once or twice. Once or twice. Does he fit in your hand in a very specific way? Yeah. Rib cage, right? Rib cage right in the center of So, like when Yeah. So, like you always can pick him up in the right way cuz you always see him real quick. No, you always support his butt cuz he's got the back, you know? Like when I'm picking him up, he just starts he's he's a little more penguiny. Yeah. He gets a little You're not giving him You're not giving him the support he's used to. Oh, that's fantastic. Thank you for that. Mhm. He knows. He knows you have the untrained hand. The untrained killed him. Yeah. Then see he's struggling there and now he's calm again. He's doing that. You bring him close to your body. You get you get on the rib cage right there. You just chill. I also like that when you Greg hands Pillo to you, Pillo immediately starts doing the mouth noise that you love. I know. He does know he's I feel like he looks you right in the eye",
            "start": 192.08
        },
        {
            "text": "Right there. You just chill. I also like that when you get Greg hands Pillo to you, Pilo immediately starts doing the mouth noise that you love. I know. He does know he's I feel like he looks you right in the eye when he I feel like we're bigger adversaries than ever than Yeah. But also it's mutual. You know, we have an unspoken love for each other. I think as pictures have proven on the internet. Sure. But um the animosity is real as well. Mhm. No, I can feel it. You're like two Super Bowl quarterbacks. You respect each other and in the offseason you might like each other, but when you're on the field, when you're on the gridiron, right, all bets are off. Now, here's the funny thing. It didn't derail. So, you were waiting for Here was the thing I was thinking about before is that I mean, it didn't make much sense like is are the quarterbacks all on the field and Montana were famously really All bets are off. They They're not like trying to No, but they're not going to They're not\n\nCorrected errors:\n\n* \"he Greg\" -> \"get Greg\"\n* \"Pto\" -> \"Pilo\"\n* \"mouth noise that you love\" is a colloquialism and slang, so it's left as is\n* \"grid iron\" -> \"gridiron\" (correct spelling)\n* \"Montana were famously really\" -> added period after \"really\" to make the sentence grammatically correct",
            "start": 225.04
        },
        {
            "text": "It didn't make much sense like are the quarterbacks all on the field and Montana were famously really All bets are off. They They're not like trying to No, but they're not going to They're not going to throw interceptions on purpose. Well, they're not going to like go easy on each other, but I'm like, I'm I'm going to play this game as hard as humanly possible. I don't care if my best friend's playing against me is basically what's happening. Okay. I think it makes sense. I think you're analyzing it too much. I think it makes more sense like Michael Strahan versus Brett Favre and there when they go out there, it's just, you know, all classic match up. Now, I'm going to now I'm going to say it makes more sense than when you were like this broke the sack record sacking him. But you remember this? It was totally like a fake thing where Red told them to let him through and then he fell down like it's stupid. It was It was nonsense. You don't deserve it, Michael Strahan. Um, but",
            "start": 268.0
        },
        {
            "text": "this? It was totally like a fake thing where Red told them to let him through and then he fell down like it's stupid. It was It was nonsense. You don't deserve it, Michael Strahan. Um, but here's the thing I was thinking about too with Portillo. I've known for a while, but it was brought up to me not too long ago that Portillo used to bite Christine when she first moved in with you a couple times. Yeah. Not savagely either. I mean, let's be clear, I don't think that's possible for that to savagely do anything. 40. Well, you've seen you seen you've seen him set on a toy. But nonetheless, I was thinking about So, he did that because he was used to being, you know, alone with you. Number one, and then Christine would obviously be sleeping in your bed and he would be kind of cast off. Sure. Jealousy. Now, what I've always found about this and and why I think that I'm Portillo's second favorite in in the world is because Portillo's never bitten me. Now, I've not I've not slept often",
            "start": 301.12
        },
        {
            "text": "Jealousy. Now, what I've always found about this and and why I think that I'm Portillo's second favorite in in the world is because Portillo's never bitten me. Now, I've not I've not slept often with Greg in the same bed. It's not to say I've never slept in the same bed as Greg. Yeah, there's nothing wrong with that. We wouldn't say anything crazy, but when Portillo and Greg moved in here in 2011, Portillo has never once snapped at me or barked at me or gotten mad at me at all. So, I feel like I have the advantage right now in Portillo's heart and mind. Heart right here. Mind right here. And I feel like I doubt it. I feel like there's something to be said about I think him and Steyr buried their I was going to say bridges. That doesn't make any sense. They bridges. They mended their bridges quite some time ago. The point is I had no bridges to mend. Sure. You see, but he hears you yell at him. He doesn't know. You send him to bed every so often just for fun sometimes. Yeah. Yeah. He\n\nCorrected changes:\n\n- \"Portillo's\" (proper noun) was already capitalized correctly.\n- No other phonetic mistakes or spelling errors were found in the chunk that required correction.\n- The only potential correction is changing \"Steyr\" to \"Steve\", as it seems more likely given the context of the conversation. However, without further information, I've left it as is.\n\nThe cleaned chunk remains largely unchanged from the original raw chunk.",
            "start": 339.04
        },
        {
            "text": "quite some time ago. The point is I had no bridges to burn. Sure. You see, but he hears you yell at him. He doesn't know. You send him to bed every so often just for fun sometimes. Yeah. Yeah. He doesn't even know if he's going to bed. Go to bed. Yeah. Greg, let's be honest. He has When you go send him to bed, he doesn't know he's being scolded. I know he's stubborn. It's not that he's necessarily stupid. It's that you never trained him. I trained him. So, he just goes to bed. He He puts his ears down. He knows he did something wrong. He knows he did something wrong. So, like at any moment in time, I can just tell him to go to bed and it's and he's fine. He usually doesn't believe you though. No, he doesn't. But then he knows when I'm getting stern I I I look at him like what's funny is that he does the rollover thing sometimes with you like where he he won't move where he really doesn't want to do but like I only have to look at him to make him do that like where I'll tell him something",
            "start": 377.52
        },
        {
            "text": "he does the rollover thing sometimes with you like where he he won't move where he really doesn't want to do but like I only have to look at him to make him do that like where I'll tell him something and he'll just ignore it and then I'll look at him and he'll like roll over cuz he knows that like I'm coming at him. Yeah. And then I'll just push him down the hall until he gets on his feet and then he'll run down the hall and he has such a thing Greg calls it a a tractor trailer out of control where like he's going and then he'll just turn this way and keep going. He's so just kind of like it's a weird He's too long. He doesn't know what's going on. Weird creature. It is. It is the length issue, I think. And also juxtaposed to the short uh stature of his legs. Yeah. I feel very um I sympathize with them. I got short legs, long torso. I got you, dog. So, I'm just I'm just necessarily I'm just calling it. You know, Portola and I might not have a lot of time to bond, but Portola and I",
            "start": 408.88
        },
        {
            "text": "with them. I got short legs, long torso. I got you, dog. So, I'm just I'm just necessarily I'm just calling it. You know, Petrella and I might not have a lot of time to bond, but Petrella and I have an unspoken bond. And it never never went astray. He never bit me. Sure. He was a younger Wilder dog back in his day, I think, is a big thing. But you make a good point because you're both my  Ladies and gentlemen, if you didn't know, this is the Game Over Greg Show. Each and every week, four, sometimes five best friends gather around this table. Each bring a random topic of discussion for your amusement. That was real good. I need to rely on you cuz I I couldn't do it and hold the dog. Why are you Why are you holding the mic? This is the problem. And I love the dog, but when he wants to be on the show, I cross my legs and then I sit way off the mic. And so then if I come up to the mic, he doesn't have enough room to sit because I got this gut that blocks him out. Let me be clear. He",
            "start": 450.48
        },
        {
            "text": "be on the show, I cross my legs and then I sit way off the mic. And so then if I come up to the mic, he doesn't have enough room to sit because I got this gut that blocks him out. Let me be clear. He doesn't want to be on the show because he doesn't know anything's happening right now. No, he's always on your lap all the time. So that's just his natural place. He also knows how to shine. He knows how to shine in front of the camera. You've seen him look at the camera. Don't act like that's something that you said. You say I haven't trained for I've trained him to be a camera hog. He knows what's up. Yeah, you put a camera on this dog at any time, he knows it. Yeah, he knows it right now. Well, right now he's just he knows. I mean, if we needed to put him out there, what I've been thinking about doing is bringing his dog bed in here, putting it on the center of the table, and just leaving him in the center of the table at all times. He could be the new centerpiece. I like that",
            "start": 489.68
        },
        {
            "text": "thinking about doing is bringing his dog bed in here, putting it on the center of the table, and just leaving him in the center of the table at all times. He could be the new centerpiece. I like that until he likes He smells better than that. Accidentally tra he's not going to move in the middle of the show. I can hold him this way the entire time. Yeah, but you're holding him. Yeah. If he's just on his free will, we would have a good 5 seconds of him getting up and getting ready to move before something bad would happen. What we would need is, have you guys seen the movie Gladiator? They put him in the middle and then they put the four tigers in the side of him so he can't go anywhere and he has to fight the guy. We'd need some sort of system in place like that for me to be okay with him being in the middle of the table in this. Do we have is there such a thing as a mini? We'll get four cats and we'll tether them to the sides and then we'll bring Coyle back. Yeah, Coyle will",
            "start": 523.28
        },
        {
            "text": "him being in the middle of the table in this. Do we have is there such a thing as a mini? We'll get four cats and we'll tether them to the sides and then we'll bring Coy back. Yeah, Coyle will **** him up. Like he's bringing a random topic of conversation for your amusement. If you like that, go to patreon.com/kindfunny and toss us a few bucks. But if you don't have any money to give us, no big deal. Wait until next week cuz Monday through Thursday, we break the show up topic by topic, day by day, and post it on youtube.com/kindafunny before we post the entire thing for free Friday on youtube.com/kindafunny and podcast services around the world. Greg, do you think Portillo ever thinks of Khloe and remembers her? No. No. And do you I don't know. See, this is the thing I was telling you about. When Khloe lived here, Khloe the cat, which was Mike Mitchell's cat. I loved her very much. She would always be in my room. She was in my room all the time cuz uh Mike wasn't here a lot and I used to",
            "start": 556.8
        },
        {
            "text": "When Khloé lived here, Khloé the cat, which was Mike Mitchell's cat. I loved her very much. She would always be in my room. She was in my room all the time cuz uh Mike wasn't here a lot and I used to like really take care of her. And she would be at the sliding door and she would just sit in between the sliding door and the curtain and look outside all the time. And there's a cat that lives across the way. Yeah. That I've named Frederick. I named him Frederick a long time ago. I don't know what his real name is. He's like a ratty-looking black and brown couch. He looks like an alternate universe Garbage Pail Kid Heathcliff. Yeah, exactly. That's exactly right. And he would come out of the house that he's from and saunter around the backyard. And then eventually he realized that Khloé was always at the window, so they would actually sit together, separated by a window, and just sit there for hours. And I have all this",
            "start": 598.88
        },
        {
            "text": "And then eventually he realized that Khloé was always at the window, and so they would actually sit like together, like separated by a window, and just sit there for hours. And I have like all this film of them doing this and like pictures. It's so funny. Each thinking the other was in prison. And um so eventually Chloe left and Frederick I see him once in a while roaming around but I have a white stuffed cat. Mhm. And I after about 18 months it's a white it's it's Rolo from Tales of Xillia 2. And I and and Cheryl actually had the great idea and I so I put she's like put the cat at the window and see if Frederick comes and thinks it's Chloe. And this was like 18 months after like he had last seen and had an interaction with Chloe. And I did it and he came. Isn't that **** weird? You just brought her fishes and stuff and just more. It was so weird. There was a time where I used to leave my slide door open sometime and like one of them cut through the the this the uh like the screen",
            "start": 634.96
        },
        {
            "text": "Brought her fish and stuff, and just more. It was so weird. There was a time where I used to leave my sliding door open sometimes, and like one of them cut through the screen to either get in or out. I don't know. Which one do you think it was? It was probably Chloe cutting to get out. You think so? Yeah. Because Chloe got out a couple times and then she freaked out and just ran back in. She never tried to run away because she was fat and lazy. But um, so I always thought that was funny that Freddy would come around every once in a while and just hang out and like think, and then eventually stopped coming. Yeah. Like realizing that she was gone. But then when I put from afar he saw like a white apparition in the window. Yeah. And so it was, and so he came up and he was very disappointed when he realized it was a stuffed animal of Rolo from Tales of Xillia 2. And so, and so that's how that story goes. So I feel like",
            "start": 681.6
        },
        {
            "text": "And and so it was and so he came up and he was very disappointed when he realized it was a stuffed animal of Rolo from Tales of Berseria 2. And so and so that's how that story goes. So I feel like Portillo might have nightmares every once in a while of Khloe just batting him right in his face like she used to. It was pretty even. I'm There's video proof of him chasing her down the hallway that one time. Yeah, but he never attacked her. Like he couldn't damage her, you know. She's way too fast. And that's just the nature. But I I saw her several times just beat him. She bat him. You know, we're going to do that thing and run away. Tim, what's your topic? Please tell me it's not Forill. Please tell me it's not Portillo. So, we're coming up on my favorite week of the year, E3. So, here's the thing. Nick's reaction right there upsets me. I don't like that one bit. We've been working at IGN for a long time. Now we're not, but for a long time we were there, right? Yeah. And",
            "start": 716.4
        },
        {
            "text": "So, here's the thing. Nick's reaction right there upsets me. I don't like that one bit. We've been working at IGN for a long time. Now we're not, but for a long time we were there, right? Yeah. And there's this kind of sentiment among a lot of people who have been working in the industry for a long time. They're like, \"Oh, E3. Oh, I hate this. This is the worst week ever. I don't want this to be over.\" Are you guys crazy? No. We're 100% saying you're the crazy one. No. No. I remember being a little kid and wanting nothing more than for it to be June because it's my birthday at the end of June, but also because I knew that I was about to know all the games that I was going to buy in November and I was so excited about that. Sure. You start thinking about what they're going to announce. You start making predictions. You start talking to your friends about it. You just get hyped and then all of a sudden Japanese dudes come out and freaking play Santa",
            "start": 758.0
        },
        {
            "text": "They're going to announce. You start making predictions. You start talking to your friends about it. You just get really hyped and then all of a sudden Japanese dudes come out and freaking play Santa Claus and start throwing gifts at you. Right. Right. It's the best. That's what he Yeah. So what, Nick? I He already wants to start poking holes in your thing. I'll wait for you to finish your topic before I start lambasting you. Oh god. I mean, my topic is just E3 in general. Yeah. Like, do you still feel that magic that you want? I just see my thing is I never really felt the magic cuz E3 is always synonymous in my head with working ridiculously hard for very little in return. Um, my first year of E3, I don't think we slept for the first couple days. And I don't know why we did that other than that's how we thought that's how you're supposed to cover a show. Um I always equate it to I always dread E3 until we get to it because I was I was",
            "start": 798.56
        },
        {
            "text": "Days. And I don't know why we did that other than that's how we thought that's how you're supposed to cover a show. Um, I always equate it to I always dread E3 until we get to it because I was I was actually talking to Neha this morning. E3 - Kind of Funny, Kind of Funny E3. I'll look it up. I think you'll be able to just go to GameSpot.com during E3. Well, yeah, right now and see our little funny video. Oh fun. Um, but yeah, Neha and I were kind of we're tired. I mean obviously we're both tired for different reasons. She's been dealing with it on a much bigger scale cuz she's the director of video over there and has to kind of coordinate everything. But we were talking today and she's like she's like I don't know. I just kind of look to June 20th when I'm just not there anymore and I can just sit by a pool and have a cocktail and relax. And uh, I think we both kind of agreed that the leadup to E3 is the stressful part. Exactly. During the show I always have a blast. I'll be honest with",
            "start": 839.92
        },
        {
            "text": "Sit by a pool and have a cocktail and relax. And uh I think we both kind of agreed that the leadup to E3 is the stressful part. Exactly. During the show, I always have a blast. I'll be honest with you cuz like when I used to do the pre and post show with uh with Greg and Colin and I think Yeah. You were I don't know if you were part of that much stuff. Yeah. You used to kind of be around, kind of segment producing for us. You wore a nice suit last year. It was I did. Yeah. Like getting the sets together and getting all the branding and the sponsorship stuff together. It was it was like you have to do it, but it's a pain in the ass cuz you're like, you know, they want you just have to track down so many different details and you're you're working with so many different moving parts. Whereas when the show is going and you can't really change any of the big things, you're like, \"Well, we can't really change the set because the set's here. We're all on top of it. So great. That's",
            "start": 879.04
        },
        {
            "text": "Whereas when the show is going and you can't really change any of the big things, you're like, \"Well, we can't really change the set because the set's here. We're all on top of it. So great. That's off the list.\" Um you get a much better sense of like uh uh energy and excitement, right? Oh, we're going to do a live show. It's going to be fun and this is like a lot of eyes are on this and it means a lot to a lot of people which is the most important thing. Um same with Comic-Con where you're like we're we're mounting this big production. We're a part of this cultural thing that's happening, this big zeitgeist that's happening right now and it means something to people which is great but everything up until that point is like torture is mental torture. That's the thing I think you're talk I love E3. I still enjoy E3. I feel the magic of E3. The thing about E3 though, and I understand the people who are not jaded, but who are like, I don't I'm not into this, is the fact that from a",
            "start": 912.88
        },
        {
            "text": "I love E3. I still enjoy E3. I feel the magic of E3. The thing about E3 though, and I understand the people who are not jaded, but who are like, I don't I'm not into this, is the fact that from a consumer, it's just Christmas. But for everybody else, it's you're at the base of the mountain looking up to the peak, like I got a long way to go. You know what I mean? Like setting up this schedule out there, let alone doing our normal jobs in this show and helping Nick set up the room and it's like I start to answer an email, leave, and now there's 15 and now two people are competing for the same time slot. You know what I mean? Like that's the thing of all the gears grinding against each other of like ah and then you get there and it's fun. Yeah, and it's great. But there is that I'm on stage and I'm doing this and is the next guest here yet? And if they aren't, why aren't they here? And what are we going to do? And da da da. And I got to remember I'm still on for this person.",
            "start": 948.08
        },
        {
            "text": "on stage and I'm doing this and is the next guest here yet? And if they aren't, why aren't they here? And what are we going to do? And da da da. And I got to remember I'm still on for this person. There's so many different things there. Yeah, I love E3. Good. Um, no, I I mean this is the first E3 in a long time that I was at all exciting or looking forward to going. Like when June came around typically, I was like, **** Because I really E3 is tough and I don't I get why people are excited. I used to be excited too when I'd watch it from afar. But when I went to my first one in 2004, um you know, I I quickly learned that it was um not fun. And really all of the fun for me like at in going to the show and absorbing the show even as a consumer, even though I'm not really I guess a consumer anymore. I'm just in media, whatever the **** it is we do, but personalities. Personality, but is the press conferences. The press conferences are all that matter. And they all happen within 24",
            "start": 983.84
        },
        {
            "text": "anymore. I'm just in media, whatever the **** it is we do, but personalities. Personality, but is the press conferences. The press conferences are all that matter. And they all happen within 24 hours and then there's just three more days of **** hell. I mean that was that was basically like it all it's all frontloaded before the show even happens. The coolest **** happens. It's not like E3 happens and then the best part happens. It's E3 happens and then it just gets worse and worse. So So you know that's the one thing that I like to keep in mind. I as someone who doesn't really like being around crowds and doesn't really like absorbing things and and nerd culture in that way going to conventions and stuff. That's not really like my style. I would love to live in an era like we do now or have lived in an era like we do now where you could watch the press conference and stuff like that because back in the day as I don't know a lot a lot of people remember in 1999 '98 whatever",
            "start": 1025.92
        },
        {
            "text": "or have lived in an era like we do now where you could watch the press conference and stuff like that because back in the day as I don't know a lot a lot of people remember in 1999 ' 98 whatever you'd have to wait and refresh you know a website and wait for news to pop up and that's not the way it happens anymore. So E3 is most fun to watch now from home. Being I I am so confused why a normal person would want to go to this place because a you're not going to get in any of the press conferences if you're not in the media and b then you get to go on a show floor and play a bunch of games and if you don't have press passes or appointments like we do like what we did at IGN then you're going to wait in line. You're going to play three or four games maybe of any consequence a day and then you're going to have to leave. And I understand why people are excited about that. But to me, I always try to put it towards other people is like, listen, like we're",
            "start": 1062.72
        },
        {
            "text": "of any consequence a day and then you're going to have to leave. And I understand why people are excited about that. But to me, I always try to put it towards other people is like, listen, like we're doing this so you don't have to. So stay as far away from it as possible because because like we'll go through this for you and we'll let you know what we think and at least you don't have to go through the whole rigmarole of I understand that, but I think I think it's just that we've gotten to live the other side of the equation. You know what I mean? If we're on the outside going to I always talk about edit packs when I'll talk to people about packs at a meet and greet and be like, \"Oh man, what did you see today? What did you do?\" Well, wait in line 3 hours to watch this 15-minute demo. I'm like, \"Are you **** crazy? Are you **** crazy? And but that's the experience. They're there for that game, you know? I mean, that's the thing of like they're going there to see Uncharted 4",
            "start": 1099.36
        },
        {
            "text": "I'm like, \"Are you absolutely crazy? Are you absolutely crazy? And but that's the experience. They're there for that game, you know? I mean, that's the thing of like they're going there to see Uncharted 4, just to see it, to be one of the first thousand people that see it, get to see it. But here's the thing. Here's the thing, Greg, is that and for really for everyone is I understand, as Tim was alluding to, that it sounds and is jaded, right, to say something like that. But I'm unapologetic about it because I did it for this will be my ninth E3 and I and and I I did it for so long and so many times that I just know that it's not like covering it from that standpoint doesn't change. It doesn't get easier. It it it stays exactly the same. It's hard and you work all day and all night to write this stuff and you do it and you just kill yourself. And so I understand that the the zeitgeist of being there is fun and being there is fun for people and playing games is fun. But when you have to work",
            "start": 1131.76
        },
        {
            "text": "stuff and you do it and you just kill yourself. And so I understand that the the zeitgeist of being there is fun and being there is fun for people and playing games is fun. But when you have to work the show, it's a different beast entirely, which is why, frankly, I'm so excited about this E3 because we get to just go and do our show. I mean, a lot of pre-planning that we're going, you know, a lot of planning going into it, but we're there, you know, from 9:00 to 5:00 or whatever and then we we're done because that's not the way it was. You know, like when you cover the game, when you cover games there, it's you have appointments from 9 to 5 and then you're up until 3:00 in the morning writing about them and then you do it you get up at 7:00 and then you do it again over and over again. So, I understand why people get upset when they say like, \"Well, I'd kill to be at E3.\" And I understand that, but understand that our perspective is somewhat unique in the sense that we've done this",
            "start": 1172.64
        },
        {
            "text": "So, I understand why people get upset when they say like, \"Well, I'd kill to be at E3.\" And I understand that, but understand that our perspective is somewhat unique in the sense that we've done this and I'm telling you, if you have to work the show, it is not fun. Mhm. I don't know anyone in the industry, anyone that writes previews and sees games there that likes doing it. I've never met one person. So like that's just that's just the reality of the situation. If you can just go and have fun and enjoy, that's different. But that's never been the way I've experienced E3. So that's that's why I understand why it comes off as jaded, but but I am unapologetically jaded because that has been my experience. That's just the truth. I had one E3 that way. My first E3 was actually like I won a contest to go to E3 and that was like mind-blowing cuz up until that point I was just like I'm sure millions of people out there are one of those kids that's just like my dream is to go to",
            "start": 1205.68
        },
        {
            "text": "a contest to go to E3 and that was like mind-blowing cuz up until that point I was just like I'm sure millions of people out there are one of those kids that's just like my dream is to go to E3. I want to be there. I've for years read the magazines and heard about the three-hour wait to play whatever game it was, you know, like Super Smash Bros. Brawl or all that stuff. And I wanted that so badly. And then once you get there like I'm not going to wait in line to play this goddamn game. Like I'll watch it. That's cool, you know? But I, like Greg was saying, I don't understand the people that go and want that, but they do. Obviously, there's a huge crowd for that. But I remember being there, actually being there that first year and instantly being like, \"Oh, fuck.\" The thing that I like the most about E3, I'm not even getting because I'm here. I couldn't go. Well, I couldn't watch the press conferences cuz I had to wait in line to get in, you know? And I like we actually got to",
            "start": 1245.44
        },
        {
            "text": "the most about E3, I'm not even getting because I'm here. I couldn't go. Well, I couldn't watch the press conferences cuz I had to wait in line to get in, you know? And I like we actually got to go to the PlayStation um conference that year. Kevin's press conference and being like, \"Holy **** this is amazing.\" Nintendo's press conference. That broke my heart, you know? That Yeah, it wasn't a It wasn't a good year that year, but but still, I missed like the reveal of Donkey Kong Country Returns and stuff like that. And like that's the **** that I live for. Like I wanted to see that. So then I I kind of got out of the press conference and I had to like wrap like get on my phone and try to keep refreshing and figure out all the things that happened and then you just go to the show floor and it's just **** it's a disaster of this just games and people and all this. There's just too much and it's hard to like actually understand where should I go and what I'm supposed to do. By day",
            "start": 1287.2
        },
        {
            "text": "and it's just **** it's a disaster of this just games and people and all this. There's just too much and it's hard to like actually understand where should I go and what I'm supposed to do. By day two I was done with it. It's like this is awesome. This is a spectacle and it's great but whatever, you know. And then then I moved like I got my job at IGN actually because of that trip to E3 when I went to the IGN booth and talked to people. But then I've been at IGN. This is now going to be my sixth E3. And it's like I can never go to the show floor again and I'd be totally fine. Like yeah, that's all fine. I'm with you with the press conferences. I wish there was a way I could actually be in the room for all the press conferences, but that's impossible. If you go to Sony's, you can't go to Microsoft. It's it's the There are some people that try. Like I remember Fran used to like I think one year Fran actually was able to make it to all of them. But you have to really want that like to",
            "start": 1332.16
        },
        {
            "text": "Microsoft. It's it's the There are some people that try. Like I remember Fran used to like I think one year Fran actually was able to make it to all of them. But you have to really want that like to be in that room when that's happening. And also it's I mean there is I've sat in many press conference uh filming them or doing direct feed for them and things like that. It is fun. It's that energy to showmanship and energy, right? like especially since now we've all been in um uh the industry long enough to have seen uh both consoles come out for the last two generations, right? So like dude, the hype of like seeing the PlayStation 4, seeing the Xbox One and like that whole I mean it really is you talk about like presidential elections and how that is some people's Super Bowls. Well, like you know in the video game industry that is a lot of like people love being caught up in that in that race between the the three uh major consoles, right? and then like seeing what Microsoft would",
            "start": 1370.0
        },
        {
            "text": "you know in the video game industry that is a lot of like people love being caught up in that in that race between the three uh major consoles, right? and then like seeing what Microsoft would do and then Sony always having like going last and and like making that impression, right? And like that whole debacle, was it last year or the year before when Microsoft was like always on, we're just going to just deal with it or whatever. And everyone's like, \"What?\" And then Tony's like, \"Well, you know, you could tell they called it audible a little bit and changed some wording just to kind of slam Microsoft one more time.\" And you're like, \"Yeah, I I depending on which side you come down on, you like score one for the good guys or boo, you know.\" Um, so there is that energy, too. But it was also cool. Well, it was a unique experience watching it on the last time we did it at IGN because they had that beautiful stage and people could come and sit and watch it on a 60 60inch TV, not be",
            "start": 1417.68
        },
        {
            "text": "also cool. Well, it was a unique experience watching it on the last time we did it at IGN because they had that beautiful stage and people could come and sit and watch it on a 60-inch TV, not be bothered, not have to deal with the crowds. We watched every single one of them. You could relax, get food. That is an experience, too. And so, in that regard, like I think everyone should experience it once and once you do, you'll be very appreciative of being able to watch the streams from the comfort of your own home. Yeah. And not need to deal with the crowd because you're right, like it's you don't get to play as many games as you want. Um, and even if you do, you gotta wait forever to do it. You know, there's always that third day though when you're like, \"All right, I'm going to go roll on the show floor and like that's always thins out a little bit about the third day, too.\" I remember so Alfredo every year would come over to my house",
            "start": 1454.4
        },
        {
            "text": "like, \"All right, I'm going to go roll on the show floor and like that's always thins out a little bit about the third day, too.\" I remember so Alfredo every year would come over to my house and we'd just sit in my room and just watch the conferences and just be like freaking out over everything, even the stuff that we didn't really care too much about. Like we even watched all the third party conferences and all that stuff that even back then they didn't show that much, you know. Um, EA still does a conference. Yeah. Yeah, they always do, right? Um, yeah, EA will do one and Ubisoft will do one. Yeah. E3, right? Because they'll be showing stuff. Did Did Konami used to do something? Yeah. It's like a joke what they used to do. It was awful. It's like an hour long. You're like, and then this year Square Enix is jumping in and Bethesda is jumping in. So, there's there's lots of um conferences. A lot of third party conferences. But I think that overall my",
            "start": 1491.2
        },
        {
            "text": "Long. You're like, and then this year Square Enix is jumping in and Bethesda is jumping in. So, there's there's lots of um conferences. A lot of third party conferences. But I think that overall my best E3 experience has always been the recent years of IGN where we're all in one room watching it together. Everyone's reacting. Like that was just like the memories of me and Greg Miller times a thousand cuz these are the people that give a **** the most. Like I'll never forget the moment when uh the picture of the Beyond guys was in the Sony press conference. Like that was **** magic, you know? That was like **** cool, man. And like um that's the only time in my life I remember blushing. Oh, really? Yeah. cuz like they they had called us ahead of time or text me ahead of time like the day before like hey do you care if you use that photo of you guys in show I'm like no and I thought it would be like briefly mentioned it was like fully featured right behind him and the way I didn't tell",
            "start": 1524.64
        },
        {
            "text": "like hey do you care if you use that photo of you guys in Shoe? I'm like no and I thought it would be like briefly mentioned it was like fully featured right behind him and the way I didn't tell anybody at IGN except like the immediate Beyond crew and so the way the War reacted I remember blushing cuz everybody flipped out about it I that was cool and like just when games are announced or like when big moments happen and at E3 there's always like at least one a year of something that happens that makes everyone go oh **** like even something like Killer Instinct's coming back oh **** that's cool, you know, and even if people don't give a **** when it actually comes out, that moment of it being announced is special. And like, man, E3, it's just it's great. Today, Jeff Key announced that he's hosting the like E3 stream or whatever. And that's exciting. And they they released this trailer that I put on my Twitter. I don't know if you guys can find it at some",
            "start": 1564.4
        },
        {
            "text": "Key announced that he's hosting the like E3 stream or whatever. And that's **** exciting. And they they released this trailer that I put on my Twitter. I don't know if you guys can find it at some point. This might be way too late for that, but look for it. It's the Jeff Keighley E3 trailer for YouTube. And um it was just **** epic. There's just epic music playing. It's kind of like a history of E3. and he's just like giving this speech about like why E3 is important. It's like it's the Super Bowl for gaming and like you get to see all the different people competing and it's just showing all these moments from E3's history and I'm just like man like we've been in this a long time like a lot of things have happened and it's like to see Miyamoto go on the stage and like E3 creates these characters out of these business guys. Sure. You know, and it's like you know Nintendo obviously has Reggie and stuff. We got Shu, we got like Microsoft guy number one, number two, number three",
            "start": 1598.4
        },
        {
            "text": "We discuss the magic of E3. You know, and it's like you know Nintendo obviously has Reggie Fils-Aimé and stuff. We got Phil Spencer, we got like Microsoft guy number one, number two, number three, whatever. But you know what I mean? It's like even if you don't know their names, when you see these guys, you're like, \"Oh, that guy's back.\" You know what I mean? Or it's like, \"Oh, I remember when he did that stupid thing.\" Or like, \"Oh, this guy makes good announcements.\" Like, it's a really special time where it's like a weird family reunion every year where you see these people and then you keep seeing them year after year and it's like some guys move to different companies and stuff, but it's like it makes you care about things that I think the normal people don't care about. To us. These are people we work with all the time or like you know know of. But like I remember not working at IGN, not giving a **** about like the actual people talking, but then realizing maybe I kind of do",
            "start": 1635.84
        },
        {
            "text": "Are people we work with all the time or like you know, know of. But like I remember not working at IGN, not giving a **** about like the actual people talking, but then realizing maybe I kind of do and that's kind of cool to me. Well, also nobody beats Jack Tretton. Jack Tretton was the best. Nobody he was the best in the biz. Yeah, he was he was his delivery was great. I mean again like I the thing about it being the Super Bowl for gamers is it's true, but it's like as if the end of the game happened in the beginning, right? And that's and that's like and that's kind of like you know what I mean? That's kind of the issue like in terms because I really do love the press conferences. I really do. I don't care who's talking or what they're saying. It's just like this is the announcements are tangible because one of the one of the things that about E3 that bother me is I really don't like writing previews. Like it's the least favorite thing that I had ever do. And I don't really need to",
            "start": 1673.52
        },
        {
            "text": "We discuss the magic of E3 because one of the things that about E3 that bother me is I really don't like writing previews. Like it's the least favorite thing that I had ever do. And I don't really need to play games early either. Like I don't get I don't get off on that. like like it's just it's not really necessary for me unless it's like I I remember playing Mega Man 9 for the first time at E3 and that was really awesome and I was excited about that or Fallout 3, but these games are like few and far between where I'm like I really need to play this right now, you know, because usually the games are not ready. They they feel and play and and look different by the time thing of like I'm playing 15 minutes 3 hours in that I'm going to have to replay again when it comes out anyway spoiling this that and the other. It's like when when the world around you is hyper-realized and you're hearing this and you're just like and you fought through a sea of sweaty people and I don't give a **** how clean",
            "start": 1707.2
        },
        {
            "text": "and the other. It's like when, when the world around you is overcrowded and you're hearing this and you're just like and you fought through a sea of sweaty people and I don't give a **** how clean you are. By day two of E3, you're not clean anymore. You're hot and disgusting. Especially if you're carrying a bag. You get there, you're late, you're frantic about being late. You have no idea where to go cuz you go to the one check-in desk but there's three others checking. You're not international press. You're US press. You got to go to that person. Candy's not here. Sorry, I don't know who to talk to you about. I don't know. You're always like this. I'm here to see Phil. And they're like, \"Oh, you mean Candy.\" You're like, \"I don't.\" They're like, they're always There's always someone that like that person that really knows what's going on just stepped away for a second. This person that was hired as staff 3 days ago and they just gave the shirt to that looks official is always like",
            "start": 1740.0
        },
        {
            "text": "like that person who really knows what's going on just stepped away for a second. This person who was hired as staff 3 days ago and they just gave the shirt to someone who looks official is always like this. I don't know And they have a they always have a clipboard that it's like within arms reach and they're like, \"I don't see I don't Is there is there Phil? Do you know Phil? Can you go get Phil? I don't know who Phil is.\" and they just look at you and you look at them and you're like and if Phil doesn't immediately come back into your eyesight, you're just **** You're just **** It's a weird It's definitely a weird experience. I I think that one of the things I was confused about this year was the hype of like getting in proumers getting in and I'm like, dude, like to be perfectly honest with you, half the people at E3 are just not doing anything. Like it's it's no it's no different than usual. You know what I mean? Like E3 would actually be way more manageable if it literally was",
            "start": 1777.76
        },
        {
            "text": "with you, half the people at E3 are just not doing anything. Like it's it's no it's no different than usual. You know what I mean? Like E3 would actually be way more manageable if it literally was an industry show because there would be cuz there's not that many people in the industry. The year that the year that it was an industry show when they when they decided to scale it back was really like with the exception of having to drive to every place. I thought that was a lot more. You're talking about Santa Monica year that's infamous that year. It wasn't great, but it was a lot more like when you stepped onto the show floor, you're like, \"Oh, I can literally walk to any single game I want to play right now.\" Because after the year after Santa Monica, they came back to the convention center and had it on lockdown in terms of who could be there. I remember walking around that year not being bad, but it also wasn't the same. Yeah. Well, that was the year they also like were like no booth",
            "start": 1812.4
        },
        {
            "text": "and had it on lockdown in terms of who could be there. I remember walking around that year not being bad, but it also wasn't the same. Yeah. Well, that was the year they also like were like no booth babes, any of that stuff. Remember that? The Outlaw Booth was famous there - they have girls that wanted to get in that year when they started it though. The booth babes. Yeah. No booth babes. That's what I'm talking about. Yeah. Yeah. So, uh that's the thing. I I I've always known it was not necessarily They call it an industry show. It's not an industry show. There's a lot of people there who had somehow figured out to get in and they're more fans than they are industry. And I'm not saying that that's a bad thing cuz kudos to them. They figured it out. Absolutely. I'm not mad about it. But I remember the first year it was like two years ago I walked around with Greg and I remember I'm like, \"Oh **** this is a nice reminder that this actually isn't that big of an",
            "start": 1846.24
        },
        {
            "text": "not mad about it. But I remember the first year it was like two years ago I walked around with Greg and I remember I'm like, \"Oh **** this is a nice reminder that this actually isn't that big of an industry without someone wanting to take a picture of you.\" And like when you go to an industry event that doesn't happen. Sure. Right. You're not you're getting people who know you. They work with you as a professional. They see you in a different light. Whereas when you walk in the show and 40 people want to like get near you, I'm like, \"Okay, this is more like Momoccon than it is.\" I don't know about that. I think that I mean they are industry people. They're just on a different level of industry. Like they're on the blog level and stuff like that. Yeah. I don't think it's as easy to get in as you guys are making it out. No, I mean I mean I haven't I haven't I I always got in with IGN every year. This is the first year I'm going with someone else. But I know plenty of people that are",
            "start": 1881.6
        },
        {
            "text": "in as you guys are making it out. No, I mean I mean I haven't I haven't I I always got in with IGN every year. This is the first year I'm going with someone else. But I know plenty of people that are like, I just put in my blog and they're not really But they have a blog though. I mean, that's the thing. It's like that it does require you can't just go. But but it's not. And again, I don't care who goes. I mean, go if you want. If you can get in, get in. But I'm saying it's not a blog like Kotaku. Mhm. It's like a blog that no one reads. You don't need a blog. Yeah. I thought you could work for a retail outlet and still get in too. Yeah. You get there's a lot of limits. It's not just as simple as going. It's like each and I I don't want to quote this cuz I'm not sure, but like Best Buy locations I think that two people per location get to go or something. Think about that. Yeah, I know. I know. Best Buys are there. That's like another 2,000 people that are going to that show",
            "start": 1915.84
        },
        {
            "text": "I think that two people per location get to go or something. Think about that. Yeah, I know. I know. Best Buy's are there. That's like another 2,000 people that are going to that show that like aren't necessarily on the in the industry. But I mean, we're talking Best Buy's in the area. People aren't going to fly out. Well, I mean, people would like the point is it's not just they're not just letting anyone in. And it's like it even if you want to go like you do need to kind of you need to prove yourself in some way that you I'll say this though. I bet it would be probably easier to get into E3 than Comic-Con. No, dude. If you can't get a ticket to Comic-Con, you're not you're not going. Like that lottery system is absurd. The way they you have to sign up for Comic-Con these days and then like you have to like buy a badge and put your information in and it has to check that maybe you have the right credentials. There's like all sorts of weird stuff you got to do to get into Comic-Con",
            "start": 1950.0
        },
        {
            "text": "and then like you have to buy a vial and put your blood in and it has to check that maybe you have the vampire strain. There's like all sorts of weird **** you got to do to get into Comic-Con these days. Well, I I get that. I still think it's easier to get in Comic-Con cuz it's publicly sold. Yeah, but then they sell out in like a day. So, you're talking about as an industry, it's easier to get get Well, I'm talking about if I wanted to go to Comic-Con right now, three weeks out. Sure, it would be it's like it's I'm not going to get a ticket. It's impossible. I have to buy it on the black market. Well, yeah, but you could do that. Buy an E3 ticket. I don't know. I bet you can. You probably could, but you shouldn't be selling those because then that's a quick way to get blackballed by everybody. Well, that's what I'm saying is like but they like check ID like with E3, they check ID against the thing and it's like, yeah, you could get in for some of the days and once you",
            "start": 1989.28
        },
        {
            "text": "by everybody. Well, that's what I'm saying is like but they like check ID like with E3, they check ID against the thing and it's like, yeah, you could get in for some of the days and once you get caught, then you're fine. That's my favorite thing though is that we get our passes and then they and then they like there'll be a door where guys like people are getting in fake passes or whatever and so they they're like one guy is checking ID and you just go to the door like right next to him. Yeah. Like that's how that's how secure it is. Like you see it and you just keep walking until you season someone not. But nonetheless, I mean to wrap it up in a succinct way if you're ready to wrap it up to him is I mean my kind of closing argument is that this authentically is the first year I'm like really really excited to go again because we just get to experience it now in a different way. in a way that I think Greg maybe experienced it a little more than I was able to experience it until maybe",
            "start": 2022.4
        },
        {
            "text": "really excited to go again because we just get to experience it now in a different way. In a way that I think GameOverGreggy maybe experienced it a little more than I was able to experience it until maybe a couple years ago where like I still was really in the trenches and I was still in the thick when I was at E3 man and it's and it's really really a rough show. So yeah, like I get I get it and I understand how **** annoying it is to hear that from someone like I've been to 93s and I don't ever want to go again like kind of thing. But it's like it's just trust me I'm not lying. Like that's just been my experience. If other people have different experiences, that's that's great. But I'm telling you, the people in the industry I know. No, not like the way people just face gloss over by the time it's June and they're like, \"Oh.\" Because you know what you're getting yourself into. It's not it's never manageable. You never do everything you need to do. You don't hit everything you need to hit",
            "start": 2052.4
        },
        {
            "text": "It's June and they're like, \"Oh.\" Because you know what you're getting yourself into. It's not it's never manageable. You never do everything you need to do. You don't hit everything you need to hit and it and it's troublesome. And as someone who just doesn't care for previewing games and doesn't care for playing games early because I just look at a game like when I see a game and I'm like, \"Oh, that looks good.\" Um like The Witcher 3 when I saw The Witcher 3 like years ago and I was like, \"Oh, that looks really fun.\" And I didn't I never looked at it again ever until we played it in like March. I'm just going to play it when it gets here, you know? So like Batman: Arkham Knight, like that game looks great. I'm like, I don't even know anything about it. And it's kind of fun going into it. I haven't played Batman: Arkham Knight cuz it's like that's where it especially gets weird when you wait a long time to play a sequel. You already know how it's going to be. That looks different though.",
            "start": 2088.0
        },
        {
            "text": "I haven't played Arkham Knight because it's like that's where it especially gets weird when you wait a long time to play a sequel. You already know how it's going to be. That looks different though. Arkham Knight looks freaking awesome. Well, yeah. So do the last three Batman games. I'm ready to play them. I'm not ready to **** play 10 minutes of it. Do we know if it's going to be playable on the show floor? It'll be like Yeah, it'll be it'll be a week out. Yeah. Yeah. It's Yeah. Okay. Cool. Yeah. My biggest thing for playing the games, I don't like previewing games either, just because it's like it seems like a waste, but I just want to know if things feel right. And that's usually for like reboots or like when things come back. It's like I remember when the Tony Hawk um HD whatever was announced, I was like, I need to play it. And then I just to know if it felt right and it didn't. And I was like, well, **** that sucks. You know, or like Smash Bros. it's like, I want to play it.\n\nCorrected the following:\n- \"Arkham Knight cuz\" → \"because\"\n- \"it especially gets in weird\" → \"gets weird\"\n- \"Yeah, it'll be a week out\" is likely referring to E3, which is mentioned in the video title and description.",
            "start": 2119.68
        },
        {
            "text": "announced, I was like, I need to play it. And then I just wanted to know if it felt right and it didn't. And I was like, well, that sucks. You know, or like Smash Bros., it's like, I want to play it. I want to know how the physics feel. Like it's stuff like that that I think really matters. But then I'm done. It's like, all right, Smash Bros. is one exception, though. We just kept playing a ton. Yeah, we just kept going back. That was fun. But see, you're also right. It does depend on your sort of mentality toward it. Like, I'm with Colin where I don't like the hype as much as the payoff of actually having the thing in my hands, like in my living room or in terms of things that I like. I don't like seeing a thousand trailers for a movie. I would just rather be like, \"Oh, the movie's coming out. Cool.\" radio silence till I go and see it, right? And so there's just it just depends on who you are. Like you have the kind of",
            "start": 2154.24
        },
        {
            "text": "I would just rather be like, \"Oh, the movie's coming out. Cool.\" radio silence till I go and see it, right? And so there's there's just it just depends on who you are. Like you have the kind of mindset where you're like you want to know everything about everything right now and you want to know it before anyone else does and you just like that. That's that's like a hobby of yours. I don't care. I don't if I have to wait in line for 3 hours. Like right now if someone said, \"Hey, you could go see you can see a special sneak preview of Batman v Superman right now, but you have to wait eight hours in line.\" I'd be like, \"Me, no thanks.\" Entire movie. Yeah. I'd go. I wouldn't wait. I don't think I would. Why? Zack Snyder, if you're listening, I'll wait. The entire movie? Yeah. If someone's like, \"You wouldn't wait eight hours to see the entire movie in line. You have to stand in line for eight hours.\" Yeah. I don't think I would. That's crazy. I just don't think anything's that good that I'd",
            "start": 2190.32
        },
        {
            "text": "\"Wouldn't wait eight hours to stand in line. You have to stand in line for eight hours.\" Yeah. I don't think I would. That VA, you're crazy. I just don't think anything's that good that like I would like nothing's that good. Like your time's important. I would rather go see it in a theater with a relaxed schedule, you know? Same with games. Like it's not a pleasant experience. It's not. And like just because I get to see it, like what's the point of experiencing when you're drained after going through a freaking war, you know? Which means sitting in a line. No, it's not. I think it's apples and oranges compared to E3. Well, here's the thing. You're up till 4:00 in the morning writing, right? And then the next day you have to get up at 7:00 to keep writing. And there's never a sense of finish. You're never done. There's always something you could be doing. It's traumatizing. It's stupid. It's dumb. It is. No one helps you prioritize ever because I'm",
            "start": 2224.96
        },
        {
            "text": "And there's never a sense of finish. You're never done. There's always something you could be doing. It's traumatizing. It's stupid. It's dumb. It is. No one helps you prioritize ever because I'm not I don't want to go on a tangent, but like the methodology is always like get as much as you can done. Like get coverage as much as you possibly can like talk about as much as everything you're supposed to talk about. And it's like it's just a it's a stressful set of circumstances and you're supposed to go sit and enjoy something that's that's not forget these are supposed to be enjoyed like these games and it's just not it's not an environment that I find conducive. So my brain immediately just turns off. I'm like I don't want to deal with that. I'd rather wait 6 months and when the experience comes to me, I will enjoy it if it is enjoyable. E3 is awesome. Some of my best memories are in that war room at 2 in the morning surrounded by people sleep-deprived and stupid.",
            "start": 2266.24
        },
        {
            "text": "when the experience comes to me, I will enjoy it if it is enjoyable. E3 is awesome. Some of my best memories are in that war room 2 in the morning surrounded by people sleep deprived and stupid. #blessed #blessed Colin, I kind of got to poop, so I'm going to go do that now. Okay. Sorry. I never take the bathroom breaks. I kind of got a poop. Don't make Don't get mad at me. I'm not mad at you. I'm I'm proud that you finally joined the ranks.",
            "start": 2301.92
        }
    ]
}