{
  "id": 1392,
  "video_id": "0zAXFqmNM1s",
  "show_name": "Reactions",
  "hosts": ["Greg Miller", "Tim Gettys"],
  "title": "Tiny Hands Make Everything Funny - Awesome Stuff Week: Unwrapped!",
  "description": "Go check out http://www.YouTube.com/AwesomeStuffWeek for way more awesome stuff! YouTube doesn't care if you've been naughty or nice -- you still deserve a shot at the greatest\ngifts this holiday season.\n\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\n\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nNick - http://www.twitter.com/Nick_Scarpino\n\n\n\n\n* This video is Shoppable, but is currently only accessible when viewing YouTube from a desktop browser.\n* This video does not imply any endorsement of the product by Google or YouTube. The views expressed here solely belong to Kinda Funny.",
  "published_at": 1449244697,
  "duration": 365,
  "transcript_chunks": [
    {
      "text": "What's up, guys? Welcome back to Kinda Funny. I'm Tim Gettys. This is GameOverGreggy. Hi. And in honor of Awesome Stuff Week, we're gonna unbox some awesome stuff. I'm excited for this awesome stuff, Tim. Yeah, this video sponsored by YouTube. Oh, yes, I've heard of them. So thank you, thank you, YouTube. They came to us and they're like, Tim, Greg, today's theme is Save versus Splurge. Okay, Save is if you get something awesome for like $10. Gotcha. That's cool for all your cool friends. Sure, sure. Splurge is when you get something for $100. You just go all out. Of course, we said we make our living on YouTube. We don't have the money to splurge, so we're going to say, all right. I took this as a challenge, Greg. I was like, what is the coolest thing I could possibly buy for $10? What could make me cooler than anyone else I know? So knowing you, some kind of tech, something for your your watch, some's a car, shoes that do something very close. Okay, Tiny Hands, Greg. Wow. Is this where I'm supposed to what? Once I saw them, I mean,",
      "start": 0.16
    },
    {
      "text": "know. So knowing you, some kind of tech, something for your your watch, some's a car, shoes that do something very close. Okay, Tiny Hands, Greg. Wow. Is this where I'm supposed to what? Once I saw them, I mean, have you seen this picture? I'm seeing the picture. The picture is pretty good. I'm not going to lie. Okay, you're you're selling me. The photo is selling me. Here's the thing. I I just saw the picture and I was like, seen on YouTube. How do they know we were going to use these on YouTube right now? So I'm really excited. As seen on YouTube and Facebook. Post hilarious videos, take cool photos, be the hit of the party with these funny costume Tiny Hands. There's this picture here. You see this girl? She's being touched by Tiny Hand. She's like, what? Why is this so tiny? I don't know what. Yeah, what? That's what she's doing. That's exactly what she's doing. So there's instructions on how open this. Tell me the instructions. I don't want to put an eye out. How to use. One, grip the ball end of the Tiny Hand. Two, used to that.",
      "start": 43.56
    },
    {
      "text": "that's exactly what she's doing. So there's instructions on how open this. Tell me the instructions. I don't want to put an eye out. How to use. One, grip the ball end of the Tiny Hand. Two, used to that. Conceal your normal size hands with your shirt sleeve. Gotcha. So usually I like to, you know, do the, I'm Tim Gettys, I roll my sleeves up thing. The cool roll up. Not this time. Today we're all sleeves. Let's get to the unboxing portion, shall we? Now I assume we're have to take multiple takes and what? Nope. There the there. Okay. Cool. There's that. No assembly required. Yeah, that's good. That's good. I'm I'm going to go first, Greg. Okay. Okay. Close your eyes. I used to play this game with my uncle. I'm having trouble here, but I don't blame myself. I got really Tiny Hands now. Okay. Yeah, you can look at me. It works. There. I definitely this. I you're not we're making a hilarious video right now. So that works. And you'll take a cool photo, I'm sure, soon enough. And be the head of the party. Oh, wait, hold on. Okay, so I'm",
      "start": 94.76
    },
    {
      "text": "there. I definitely this. I you're not we're making a hilarious video right now. So that works. And you'll take a cool photo, I'm sure, soon enough. And be the head of the party. Oh, wait, hold on. Okay, so I'm looking at the screen. It's hard to I can't get my hand that. Give it to me. I have this. I have the stretchy one. I got the stretchy sleeves. All right. I was born for this role. Here, here's what here's what the pros do. Oh, that's you tuck that in like that. Come here. You tuck this in like this, right? Uh-huh. And then look. Now now just chilling. Hey, ho. How you doing? How's my hair? It's feeling good. And just a glass like this. Glasses. And I got some food on my face. And now I'm making you look like you're thirsty. I sure do. You're right. Hold on. I don't I wouldn't suggest doing it that way. So here's the thing. Can I'm really excited that we got these, cuz $10 for $10. You can click on this video and you can get these yourself. Whatever want. So much fun, cuz this is honestly the funniest thing I've ever seen. Shake",
      "start": 148.08
    },
    {
      "text": "I'm really excited that we got these, cuz $10 for $10. You can click on this video and you can get these yourself. Whatever want. So much fun, cuz this is honestly the funniest thing I've ever seen. Shake shake my hand, Greg. Hey, pleasure meeting you, Greg Miller. I'm from Kinda Funny. I like doing business with you. It's like, go. Now I'm using the bell bottom cuffs you hear so much about. This this looks better. Well, but see, now you're having the problem having. Okay, so you can see them. So I got to cuff. I got to see your real normal size people hands. Now I don't know if it would put us over the $10 save limit, but maybe you buy a thing of rubber bands with it and then there you'd be right. Yeah. Yes, I've dreamed of this so many times. Oh, you got you got something in. All right. We going to do. You know, I like I think that we're having fun with the Tiny Hands. Yeah, but I think a certain Nick Scarpino. Oh, no. He's out there somewhere. Can you see? I can't see him. I'm shielding all the light from my eyes. I",
      "start": 211.8
    },
    {
      "text": "I like I think that we're having fun with the Tiny Hands. Yeah, but I think a certain Nick Scarpino. Oh, no. He's out there somewhere. Can you see? I can't see him. I'm shielding all the light from my eyes. I can't see him though. He's out there somewhere. We're going to let him see what type of fun he can come up with with the Tiny Hands. Well, that was something, Greg. Yeah, you give Nick anything, it's something. Yeah, it's going to be a lot of fun. If you guys want to check out way more cool stuff on other cool people's sites, you should check out the the rest of the videos on the playlist for all of the Awesome Stuff Week videos where they get to use a bunch of stuff. I challenge them. They'll never have something. I don't think that it'll be cooler than Tiny Hands. This is so funny. I can't stop laughing just looking at it, cuz I'm big and these are small. Like if you had a baby and you made the baby do this, it probably wouldn't be as funny. Again, thank you so much to YouTube for sponsoring this video. Let us know",
      "start": 260.96
    },
    {
      "text": "at it, cuz I'm big and these are small. Like if you had a baby and you made the baby do this, it probably would be as funny. Again, thank you so much to YouTube for sponsoring this video. Let us know in the comments what you would do if you had Tiny Hands. Well, these Tiny Hands, not just Tiny Hands, gives you a new perspective on life. Thank you, Greg. Hard to believe millions of years ago we all had hands like these. Yeah, that's I guess true. You can get your own Tiny Hands. Click on the video. It'll be a good time for everyone. Until next time, I love you. Oh.",
      "start": 322.04
    }
  ]
}
