{
    "id": 1391,
    "video_id": "94Wrg_X-9Z0",
    "show_name": "Gameplay",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "The Evil Within - Kinda Funny Plays Through Its Backlog",
    "description": "In honor of Kinda Funny Plays Through Its Backlog week, Colin plays Evil Within.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1449248400,
    "duration": 1788,
    "transcript_chunks": [
        {
            "text": "Hey guys, Kinda Funny is having a holiday sale, that's right! If you go to KindaFunny.com/store for the next week, from Black Friday until the next Friday, you can get 10% off everything in the entire store. That's all the beautiful shirts that you know and love, that's the cups, the mugs, the stickers, all of that stuff is there. And the Let's Him Host shirts, they're there for this week only. You need that, you need that in your life. Oh, are these all the T-Shirt Tuesday shirts that we exclusively had only on those Tuesdays? Yeah, they're back for one week only, all of them in one place. Buy them for you, buy them for your sister, your friend, your neighbor, whoever you want to buy them for, even people you don't know. It's going to be great. 10% off KindaFunny.com/store. Greetings and salutations, welcome back to Kinda Funny Games. My name is Colin Moriarty. I'm here to do a Let's Play that I've been wanting to do for a long time with you. It's for uh, Tango Gameworks, uh, Bethesda published game, The Evil Within, and I thought",
            "start": 0.08
        },
        {
            "text": "Funny Games. My name is Colin Moriarty. I'm here to do a Let's Play that I've been wanting to do for a long time with you. It's for uh, Tango Gameworks, uh, Bethesda published game, The Evil Within, and I thought that would be fun to do for a backlog week here on Kinda Funny Games because this is a game that's been in my backlog forever. Um, and uh, uh, I've just not gotten a chance to do it. What I'm playing right now is uh, literally the first time I played the game or sat down with it at all, except for at events. Um, I played it I think the last time at TGS 2014 maybe, and I couldn't read anything that was going on on the screen, so couldn't play it very effectively. Uh, I've been super excited about this game. The game's supposed to be great. I'm a huge fan of real survival horror games and a lot of people um, haven't saying that this is a real survival horror game. So uh, let's see what I think, let's see what you think if you haven't played it, and uh, you know, you can give me your feedback in the comments as",
            "start": 42.24
        },
        {
            "text": "haven't saying that this is a real survival horror game. So uh, let's see what I think, let's see what you think if you haven't played it, and uh, you know, you can give me your feedback in the comments as well. Hospital 184, copy code 3, ETA 3 minutes, copy. All right, sorry detectives, I know you're just coming off a case, but I'm afraid we're going to have to make a detour. Sounds serious. Is it a riot call? One out just before I picked you up, said it was multiple homicides. A already on scene. I like how his hair is like fluttering around even though there's like no wind. Cho, all those patients, that's not what happened. Some patients disappeared, some kind of scandal. Still gives you the creeps, doesn't it? Please respond. Joseph, you think there's a connection? It's a possibility. I believe the records were sealed. Anyone on scene, respond. Dispatch, this is Detective casos in 184. What's the situation? Over. Is there any? Oh no, goddamn. Oh no, Jesus. Keep your hands on the wheel, my friend. What city is this, jior?",
            "start": 82.16
        },
        {
            "text": "anyone on scene, respond. Dispatch, this is Detective casos in 184. What's the situation? Over. Is there any? Oh no, goddamn. Oh no, Jesus. Keep your hands on the wheel, my friend. What city is this, jior? Detective K, any? Nothing yet. I'm sure we'll know everything once we get there. Those look like almost like New York plates, I guess, but not really. All right, here we are. What do you make of it, Connelly? Contact dispatch and let them know what's happening. Joseph Kidman, you're with me. We're going to have a look around. Roger that. You don't seem to be much of a hustle, consider it's raining. I mean, doesn't seem a very comfortable situation to be in. All right, I got control. This looks like a totally normal kind of place that you want to be in. Can you run? X doesn't do it. R, L, no. Looks like this is fast buttons. Don't do anything yet. All right, so I guess I'm just running up to the uh, I don't want to get dry. I want to just go in here. Can't do it. Smells like blood. All right, stay sharp. What does blood smell like? I",
            "start": 143.32
        },
        {
            "text": "do anything yet. All right, so I guess I'm just running up to the uh, I don't want to get dry. I want to just go in here. Can't do it. Smells like blood. All right, stay sharp. What does blood smell like? I guess I don't even know. They would know though. Oh my God. All right, there's a straight up massacre here. Don't let anyone else through this door. I can be an extra set of eyes. We don't know what's happening here. You're a backup. Okay, not looking too good. Walk up to here and see what we can. Doesn't tell me anything. Did you hear something? I'm just like walking on the bodies. Oh, pardon me. Oh, excuse me. Damn, what the hell happened around here? It's kind of crazy. Nice little touches here. I like the blood dripping off this guy's arm. Pretty cool. Are you injured? What happened here? Can't be real. Impossible. Ruvik is, I've got him. The security cameras might tell us something. They might. It's true. Check it out. Whoa, yikes. What the hell? Look at all. Oh, never mind. Oh, I'm feeling the vibe of this game so far. I'm, I'm",
            "start": 252.4
        },
        {
            "text": "Ruvik is, I've got him. The security cameras might tell us something. They might. It's true. Check it out. Whoa, yikes. What the hell? Look at all. Oh, never mind. Oh, I'm feeling the vibe of this game so far. I'm, I'm digging it. Weird, both gory and psychological. It seems like that doesn't look like a normal person to me. Oh, I can grab that knife. I think I'm, I'm thinking I'm rotating the camera. Supposed to be watching this happening or I just want that knife. Can I swing that way? Oh, yeah, I guess so. Nice. Okay, I got you. Almost. There we go. Cut myself down. No gun. Hold on to that knife, my friend. We just try to get out of here or sneak with R1. Okay, I want to stab him in his back. I guess I can't do that. That looks just **** crazy. Oh, oh no, he's going to kill me. I probably **** up. Oh my God. I don't think I was supposed to do that. Oh my God. No, that definitely wasn't supposed to do that. Pushing it too far. I like the cool little um, death animations though. Seems like they might uh, be specific for certain",
            "start": 360.96
        },
        {
            "text": "was supposed to do that. Oh my God. No, that definitely wasn't supposed to do that. Pushing it too far. I like the cool little um, death animations though. Seems like they might uh, be specific for certain instances. Nice little production uh, touch. All right, let's try. Is there anything over here? Bodies being deposited. No. Oh wait, locked. **** locked. Okay. Oh, looks like there's keys. I see. I didn't see that before. I don't know how I missed that. But ordinary keys, a key ring found in the mental hospital basement. These were used long. I'm going to go back to the locked door. There we go. Open that **** up, my friend. Get the **** out of here. Can we shut the door behind me? It'll make me feel a little secure. No. Okay, I understand sluggish movement to create tension and not ruin the scene, but it is a little annoying that you can't move a little faster. I'm sure you can later, but what the **** did I **** it up again? Sh. Oh, okay, now he's running. He's just running automatically. Jesus, thank God.",
            "start": 557.28
        },
        {
            "text": "a little annoying that you can't move a little faster. I'm sure you can later, but what the **** did I **** it up again? Sh. Oh, okay, now he's running. He's just running automatically. Jesus, thank God. These doors are open. Oh my holy ****. Oh my God. What the **** happening in this game? It's just insane. Gross. All right, what in the **** is going on in this place, my dude? Got slashed in the leg with a chainsaw. He's hobbled pretty badly, but he's keeping on. He's deep within the bowels of this building now. Can I get out this way? There we go. I'm really feeling this so far. Is there anything in this? I need like a gun or something. I'm sure they'll just give it to me when it's ready. Do there's probably nothing in here of any use. Got to check anyway. I'm thorough. Do what you want about me, but I'm thorough. Over here, anything interesting in here? Room just exists for no reason. All right, where's the exit? There's a little document here. Let's pick it up. Old note from sewer beside the lock gain at",
            "start": 662.8
        },
        {
            "text": "over here. Anything interesting in here? Room just exists for no reason. All right, where's the exit? There's a little document here. Let's pick it up. Old note from sewer beside the lock gain at the far end of the sewer. There is a ladder which would take you to the old Ward. If you could make it through there, you would find an elevator leading outside. You would be the one who escaped. He might be the one who survived. Okay, good enough. Interesting to know. Another door over here, like it might be locked up. Yeah, there are like locked gates here. Like this is all locked up too. They're shining. I'm sure we can unlock them later. See anything interesting going on here? Can I open these up? No, these are all just shut. All right, let's take the ladder up. Give it a tough climb for a man with an injured leg. Hang in there, my friend. I got into this room. Yeah, another document. Okay, some exposition. Nothing too useful for me right now. Man, my dude is like straight hobbled though. Can I pick this up? I want inventory.",
            "start": 825.8
        },
        {
            "text": "in there, my friend. I got into this room. Yeah, another document. Okay, some exposition. Nothing too useful for me right now. Man, my dude is like straight hobbled though. Can I pick this up? I want inventory items. What does my inventory look like if I press the touchpad? Anything? Guess I can't open it yet. All right, it's pretty game. It's definitely got a nice style. I mean, it's not the most technically astonishing game, but it's pretty cool. Oh God, what the **** was that? Oh Jesus **** Christ, are you kidding me? Can I get out of here? Better hide. Oh my God. It's starting with a Metal Gear game. Kind of frightening. Come on, you have to know I'm in here, right? Oh my God, this guy's a nut job. Should have stabbed him in the back. Guys roiding out. Jesus Christ. All right, is he gone? Oh ****. Oh no, no, no, no, no, no, no, no. Can I go back in here? Trying to use the headphones to hear like how close or far is. Is he coming back this way? Yeah, it sounds like it. It's hard for me to tell. All right, I got to, I'm just going to",
            "start": 918.28
        },
        {
            "text": "no, can I go back in here? Trying to use the headphones to hear like how close or far is. Is he coming back this way? Yeah, it sounds like it. It's hard for me to tell. All right, I got to, I'm just going to have to go. Yeah, **** this ****. I'm out. Can't let him. I know that was another place for me to hide over here. I guess now I have to go through the room that he's in. Where is he? This is starting to be a little frightening. Is there like anything hidden in here? Am I just going to get in all? See. Oh Jesus. Oh my God. Oh no. Oh man. All right, so you have to get in there to count the next uh, the next death. I thought I was going to have to sneak around. Jeez, I already died twice. Lord, doesn't bode very well for me in this game. We'll try again. See what happens. Load times aren't that bad. Is he already in the other room? All right, okay, so go, go, go, go, go, go, go, go. Can't let him see me. So I'm going to need to get in here and I think that's when he busts the, that's like the trigger for him to bust that **** down.",
            "start": 1097.96
        },
        {
            "text": "room. All right, okay, so go, go, go, go, go, go, go, go. Can't let him see me. So I'm going to need to get in here and I think that's when he busts the, that's like the trigger for him to bust that **** down. We'll see. He's coming this way. There he goes. All right, so he busts through the boxes. Does he come this way now? Jesus. All right, relax, buddy. Take it easy. Guys got some **** anger issues. I'm getting out of here. **** this ****. Any way out of here? Jesus Christ, this is tense. I like it. I can see why people enjoy this game very much. Can definitely see it. I need to get the **** out of this place. Good Lord, that was scary. All right, scary, frightening, like tense. The that game definitely feels tense. Reminds me a little bit of of uh, like Outlast almost, just in that like you, you feel it. All right, we hit a checkpoint here. There anything in here? I have a bottle, I guess. What I, what can I do with this? Can I throw it or looks like I just throw it. Want to waste it. Any else in here for me? Damn, how's my",
            "start": 1217.44
        },
        {
            "text": "hit a checkpoint here. There anything in here? I have a bottle, I guess. What I, what can I do with this? Can I throw it or looks like I just throw it. Want to waste it. Any else in here for me? Damn, how's my dude not bleeding out? Oh Jesus, is he behind me still? Oh my God. Get up. Oh my God. The elevator serendipitously ready for you. This is **** crazy. This is cool. This is cool. Take a breather, my friend. What was, what the hell was that? Now we get a little bit of the proper intro. Now. Around the night. All right, back in control. Is his leg better now? He's just walking normal. What the hell is going on in this place, right? I'm confused. This is a different character. Why is he, why is he okay now? Detective, get in, get in. Uh oh, the whole world's going to ****. Hey, where's Joseph, man? I'm sorry, but you never came out. I'd waited, but please settle down last night. Settle down, settle down, settle down. ****. There's no going back. Some texture loading problems or something, because the game",
            "start": 1350.48
        },
        {
            "text": "I'm sorry, but you never came out. I'd waited, but please settle down last night. Settle down, settle down, settle down. ****. There's no going back. Some texture loading problems or something, because the game definitely looks uneven in these scenes. Sometimes looks really good, sometimes doesn't. Yeah, there's definitely a lot of texture popping. See it. ****. Get. Damn it. Are we cut off from everyone? Everyone must be dead. Everyone. All right, back there, just a few bumps. We're fine, fine, fine, fine. We will be once we're far away. Fine. A little further and we'll be fine. Whoa, fine, fine, fine, fine, fine, fine. The texture pop, I can't, I just keep focusing on it now. It's bothering me. Holy ****. Look out. All right, maybe we should call it there. I want to play more. I'm going to dedicate some time before the end of the year to get through the rest of this game. I hope you enjoyed it for our backlog week here on Kinda Funny Games. Thank you for supporting us uh, as always, uh, new Let's Plays every week for you here at",
            "start": 1572.28
        },
        {
            "text": "year to get through the rest of this game. I hope you enjoyed it for our backlog week here on Kinda Funny Games. Thank you for supporting us uh, as always, uh, new Let's Plays every week for you here at YouTube.com/KindaFunnyGames. Uh, you guys are right about The Evil Within, and I knew it was going to be a good game. I was excited about. I'm glad that it's as uh, seems to be as good as I was hoping. It's just been on that backlog forever. It's one I have to carve off. Uh, so we'll see you next time right here on Kinda Funny Games. Thank you. Bye.",
            "start": 1753.88
        }
    ]
}