{
    "id": 1455,
    "video_id": "cluJmKlXmNQ",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Best Xbox Games of 2015 - Kinda Funny Gamescast Ep. 50 (Pt. 4)",
    "description": "We take a look at the best Xbox and PC games of 2015.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1451570401,
    "duration": 1188,
    "transcript_chunks": [
        {
            "text": "final topic Xbox 2015 going down the games Halo 5 just that that's it I totally like it's just like and it's and I'm not it's just playing it it was like right this is Halo and this is why I'm not a Halo fan like I just felt it was I'm playing co-op with Christine you know what I mean we got halfway through the game in a night thought it was forgettable. Mhm. I understand why people love it. I played multiplayer for a couple hours. I was like, all right, yeah, cool. But it's just like it's time to admit that I'm just not a Halo fan, you know what I mean? Like I'm on the other side of that completely where it's like it's I played a bit of the single player and it's just like this is why I like Halo. That's great. I'm glad you like it, you know what I mean? But um, yeah, I mean it there was a couple things that it's not Halo. I've talked about this before, but the the lack of the couch Co-op. I'm like, well, **** that took away my Halo experience and um, so I was upset about that. I'm not so much an",
            "start": 0.33
        },
        {
            "text": "things that it's not Halo. I've talked about this before, but the the lack of the couch Co-op. I'm like, well, **** that took away my Halo experience and um, so I was upset about that. I'm not so much an online guy, so like multiplayer doesn't mean anything to me. Yeah. Um, and yeah, the single player overall not the best story, so it was a forgettable Halo game, but not I wouldn't say just for me, just the Greg Miller, not as a Critic, just as Greg Miller playing games over there, um, wanting to play Destiny instead of this because Destiny is more fun and Progressive Progressive Gears Remastered or Ultimate Edition, whatever you call it. Played it at for Let's Plays with Alfredo. I was like, oh, cool. Never went back to it. I was never, I mean, I I'm one of the guys who appreciates what Gears does. I play, I think I've played every Gears. Like, I mean, we did the Gears 3 thing at IGN. I definitely played Gears Gears One. I didn't have it one, but I played at a friend's house, so I'm like, yeah, more Gears, cool. And I",
            "start": 49.44
        },
        {
            "text": "I've played every Gears. Like, I mean, we did the Gears 3 thing at IGN. I definitely played Gears Gears One. I didn't have it one, but I played at a friend's house, so I'm like, yeah, more Gears, cool. And I was like, but it's not like something that drew me back where I felt like I needed to go play it. Yeah, I the only Gears game I played, I beat one back in the day. Yeah, and then seeing this, I was like, oh, ****, it's looks way better. Yeah, yeah, yeah. Did you play it at all? Not Remastered? No, no. Um, but that that's another one kind of seemed like came and went, but I guess that's just with all the remasters, yeah, remaster. It's just like it's going to speak to an audience, right? And then we'll see what happens. Um, Rise of the Tomb Raider. Oh, Rise of the Tomb Raider. That was a game, Tim, a game that everyone should play. Mhm. You can't because it's not in every console and it didn't really sell well because Fallout ate its lunch. But yeah, great game, man. That's another we're talking about it earlier in this show",
            "start": 92.36
        },
        {
            "text": "Mhm. You can't because it's not in every console and it didn't really sell well because Fallout ate its lunch. But yeah, great game, man. That's another we're talking about it earlier in this show, like the gameplay loops, right? Like that game has a great gameplay loop of like, I've got to a new area and the mission is on the other side of the area, but ****, I see a coin chest over there and I'm going to take this side mission and that just unlocked all these new things and all crap. I'm close to a and like two hours later you've 100% of the area and you're like, now let's go do the story quest and go, let's move on there. Beautiful, fun. Uh, it's a game that I feel like at the end kind of does the the video game thing I hate where it's like, let's give you some of the most annoying parts to remember us by. And it's like, and like the thing of course would is that if I was into achievements and wanted 1000% that game or 1000 point it, I would then have gone back and replayed the stuff I missed",
            "start": 132.92
        },
        {
            "text": "us by and it's like, and like the thing of course would is that if I was into achievements and wanted 1000% that game or 1000 point it, I would then have gone back and replayed the stuff I missed, the caves and whatnot. It wouldn't be my last, my last impression of the game wouldn't have been these three corridors of let's fight **** every enemy, even though fighting is not the fun part of this game. Uh, so I wouldn't have that. But for me right now, somebody who's like, well, I'm done now, let's finish this experience. That's where it ends for me. But I can't say enough nice things about that game. Great game, really fun. It's it's the original Tomb Raider Amplified. So if you didn't like, I thought the story was really forgettable on the original Tomb Raider. I fought a ghost witch or something at the end, if I remember correctly. This one in three years will be the same way of like, I remember what there was this guy and this these people and they wanted that and then at the end they were totally setting",
            "start": 169.64
        },
        {
            "text": "if I remember correctly, this one in three years will be the same way of like, I remember what there was this guy and this these people and they wanted that and then at the end they were totally setting up for a third. So that's what they did, you know. Mhm. Rare Replay. I want to give a shout out to that just as being one of the best compilation games I've ever played. It made me care about games I don't care about. And you know, we we did a a Let's Play series where we kind of played through all of them, even a lot of the really early, really shitty games. But it it was fun that they presented it in a way that made me want to try them out and want to appreciate them for what they are. Um, I love the whole theater look of it and I loved the all the modes that they added, the challenge modes and the the um, I forgot what they were called, but like maybe they were replays, the ones where you go in and like it just gives you the here's what you should play this game for, like Battletoads. You play it and they",
            "start": 203.96
        },
        {
            "text": "forgot what they were called, but like maybe they were replays, the ones where you go in and like it just gives you the here's what you should play this game for, like Battletoads. You play it and they gave you that speed or Bite part, like just right away got you straight into it. Um, yeah, I really wish that other compilations would have have that level of love and care put into them. Yeah, I was really impressed by it. I was glad to hear that it sold better than they thought, uh, beat their projections. And yeah, there's a lot of there was a lot of respect put in into into uh, into that collection and and and did bring back some obscure games, a lot of obscure games and and definitely educated people on who Rare is and celebrated a history that I think is kind of lost to the ages now. Um, maybe Microsoft's, you know, tip of the hat that that Rare is not really alive anymore. Um, at least that was my that was kind of what I walked away from, like, here's what Rare was and evolve into what they're going to",
            "start": 244.72
        },
        {
            "text": "you know, tip of the hat that that Rare is not really alive anymore. Um, at least that was my that was kind of what I walked away from, like, here's what Rare was and evolve into what they're going to be. And they really haven't been Rare in a long time anyway. So, um, yeah, I thought it was really cool. A lot of definitely a lot of respect put in, a lot of love. I agree. And and uh, happy to see some of those old games shine again. Yeah, #IDARB. Oh, was great. #IDARB was fantastic. Really, that was a really fun time when we were all playing that. Yeah, it's one of those I feel like there's a lot of of multiplayer games like that with that kind of aesthetic, you know, like uh, TowerFall and sure and um, Brawlhalla, things like that. They're just like, hey, just pick up and play. It's a 2D **** game, but they're fun. And like, I think #IDARB specifically added that that just insanity level. Yeah, EX why crazy ass announcer, the hashtags going over you. One of us figures out how to dash before the rest of us and then you're",
            "start": 284.04
        },
        {
            "text": "like, I think #IDARB specifically added that that just insanity level. Yeah, EX why crazy ass announcer, the hashtags going over you. One of us figures out how to dash before the rest of us and then you're trying to figure out. Yeah, and it's just like, again, it's why we play games. It's fun. Yeah, so I we should we should bust that one out. Yeah, totally. At some point do a do a second Let's Play of it or third Let's Play. Yeah, we did a bunch actually. Um, Ori and the Blind Forest. Oh, very pretty. Very, very, very, very, very pretty game. Very awesome game. I'm happy there's a definitive version coming out. Mhm. And all that. Um, I I like that that that Xbox had that because I feel like forever Xbox was kind of missing the that level game, you know, there you think Xbox, you definitely think Forza and Halo and Gears and stuff. You wanted that artisanal platformer and Ori gave it to you. Gave it to me good. Yeah, gave it. Did you play a lot? Not I didn't. I still haven't beat it. Okay, but they do the thing that I **** hate where",
            "start": 323.0
        },
        {
            "text": "you wanted that artisanal platformer and Ori gave it to you. Gave it to me good. Yeah, gave it. Did you play a lot? Not I didn't. I still haven't beat it. Okay, but they do the thing that I **** hate where it's like, I got far into it, but not far enough to once they announced like the definitive edition where I was like, oh, I should just probably wait. Sure, sure, sure. Um, but yeah, I mean, it's I love it and I love I love that it felt different than games like that. Like it's a it's a Metroidvania kind of game, but it doesn't feel that way. It's not so much just like the the physics of it are weird where you jump and you have to kind of like go the slingshotting type stuff that you have to do with the the jumps. Yeah. Um, it's I like when when I'm playing a game and it's kind of like Guitar Hero where I'm playing, I'm like, I don't I'm not familiar with this. This feels different. I'm not good at it. Oh, I'm getting better at it. Oh, now I can do this. Now I can just kind of zip through the thing. Sure. Um, and",
            "start": 367.0
        },
        {
            "text": "playing, I'm like, I don't I'm not familiar with this. This feels different. I'm not good at it. Oh, I'm getting better at it. Oh, now I can do this. Now I can just kind of zip through the thing. Sure. Um, and yeah, I mean, you know, just the the first 15 minutes of that game, it's emotional as ****. It's like a Pixar movie. And it's like anything that I can relate to a Pixar movie, I'm into. So big fan of Ori. Uh, and then Forza Motorsport happened, which wouldn't matter to any of us except for the fact that there was the Fast & Furious DLC and that **** was awesome. Like, man, like that they really nailed that. Like it felt like Fast & Furious. They added a whole bunch of dumb **** and just vo and like stupid songs over like just play it on repeat. And like they took a game and made me care about it. Like that's good. And it yeah, it was it was really fun. It was like, it's a fun two hours that you're just, you know, in and out. And it made me realize how much I want a Fast & Furious Telltale Game. Oh,",
            "start": 411.12
        },
        {
            "text": "like that's good. And it yeah, it was it was really fun. It was like, it's a fun two hours that you're just, you know, in and out. And it made me realize how much I want a Fast & Furious Telltale Game. Oh, and uh, one day, one day you got to pitch it to him next time we're around. Job. Yeah. Um, so I mean, that's it kind of for the the Xbox gamut. That State of Decay: Year One Survival Edition. Come on, son. That was great. That guy, you know, State of Decay on Xbox 360/PC back in the day. McCaffrey and I did a bunch of Let's Plays leading into it. I was super into it. And it was that thing. Yeah, it came out at E3 and came back exhausted and tried to play and and never it just I two ships in the night. So when it finally came here, man, that was it. Like that's the most I've played my Xbox One, you know what I mean? Cause and I mean, like in a condensed period of like, there was a week where I shut down. That's all I played. And as soon as I was done with something, I was back out there to fill my rucksacks and clear off the",
            "start": 453.72
        },
        {
            "text": "I mean, like in a condensed period of like, there was a week where I shut down. That's all I played. And as soon as I was done with something, I was back out there to fill my rucksacks and clear off the map and go get this. Got to do it. You don't you don't understand, man. I got to make my settlement big. You've got to got to. So that was a great, great one. I'm really excited to see what Undead Labs does next. So what are your thoughts on Xbox over all in terms of like conferences and announcements and just their year? They had really good conferences. They had really good announcements. I mean, we go back to the fact, you know, at E3, Colin has said it before. I think I agree with him. The biggest announcement was the backwards compatibility, right? Like they're there. Like it's what I love about Xbox right now is that you it's it's weird, right? Because we're PlayStation fans. Obviously, that's where our history lies. That's where our coverage lies. We've covered that beat for so long. But you cheer for Xbox because",
            "start": 489.6
        },
        {
            "text": "is that you it's it's weird, right? Because we're PlayStation fans. Obviously, that's where our history lies. That's where our coverage lies. We've covered that beat for so long. But you cheer for Xbox because they are The Underdogs now and they keep making the Right Moves. They keep coming out and saying the right things things. They keep making business decisions that are based on is this good for games? You know what I mean? That's what Phil Spencer has been all about. When Aaron Greenberg was here with you guys, listen that podcast, you know what I mean? Like they're cognizant of what where their missteps were and how they need to fix them and go forward. And it seems like it's Everest. And are they are they going to be able to get up that mountain because PlayStation continues now to dominate out there. And it's one of those things where I think in the old days it was so easy in in a console war to sit around and pick a side and be like, **** those other guys, da da. And now everybody's is has the spokes",
            "start": 523.8
        },
        {
            "text": "it's one of those things where I think in the old days it was so easy in in a console war to sit around and pick a side and be like, **** those other guys, da da. And now everybody's is has the spokes people, these voices, these faces that you connect with. It's like, I want I want Phil Spencer to win. I want him to have a, you know, I want him to be as successful as Shuhei Yoshida. I want these things to be out there and have it where like Rise of the Tomb Raider comes out and is an amazing game and sells really well, you know what I mean? Because it sucks when it doesn't because then people aren't playing and this that and the other. And will Crystal Dynamics ever recover from you? Like all these different things. It's like, it's just everybody's human now. And that's awesome. That's what I love about it, you know what I mean? Like everyone is human now. So you sit there and it's like, man, Nintendo's year wasn't great, but we know people over there that are great. Kori and Reggie and all these different",
            "start": 559.2
        },
        {
            "text": "it, you know what I mean? Like everyone is human now. So you sit there and it's like, man, Nintendo's year wasn't great, but we know people over there that are great. Kori and Reggie and all these different. It's like, you know, I want them to do well. Mhm. Same thing here. I think Xbox made all the right calls, all the right decisions. And it didn't pay off in the Monumental. They're back on top. And now it's this race where they're going to, you know, trade the lead back and forth, back and forth. I don't know what it looks like next year. Now the next year is like, if they stick to their messaging of games, games, games, games, games. And Sony does this PlayStation VR thing where and that does, let's say that doesn't work out. What does that do to Xbox? Yeah, definitely interesting. So just uh, kind of adding into this topic, we also got PC games and mobile games. Hold on, ****'s going crazy right now. ****'s going crazy on your mobile device. Yeah, it is. Wake me when all your mobile device games come to Vita in four",
            "start": 592.12
        },
        {
            "text": "topic we also got PC games and mobile games. Hold on, ****'s going crazy right now. ****'s going crazy on your mobile device. Yeah, it is. Wake me when all your mobile device games come to Vita in four years. So uh, for PC, we had at least on my list, there's Her Story and Emily is Away. A whole bunch of yes, yes, yes. Her Story. And uh, I was like, Her was a great movie with Joaquin Phoenix that I really dug. Yeah, so I didn't play Her Story. You seen that yet, Colin? That is a movie you need to see. It's about AI and technology and Future. No, this is one of the ones where I'm doing the stress thing to tell you you have to watch it. Good haircut, by the way. So did you play Her Story? No, so it was just you. Yeah, it was Nick and I, right? I don't it wasn't you then. It was Nick and I. Yes, yes, yes. And I think one of the only Let's Plays we've ever taken down and then didn't put back up. Audio got all **** up in or whatever. Great game. Really amazing performances. And it was another one if you don't know Her Story, which",
            "start": 628.24
        },
        {
            "text": "Let's Plays we've ever taken down and then didn't put back up. Audio got all **** up in or whatever. Great game. Really amazing performances. And it was another one if you don't know Her Story, which is possible. Don't it's like Gone Home. Don't know anything about it. Just jump in and play because that's what we did. Everyone was talking about it. We sat down and they started up and you're at a computer terminal. Yeah, first person. It's like, what the **** is this? And you start piecing it together and those like, wait, search this. Holy ****. Oh my God, do this, da da. Like it's awesome. Like I want I hope that game, I mean, obviously for selfish reasons, I hope it gets ported to consoles so you could do it. It won't because it's keyboards and everything else. So everyone should just go play it on PC. It was that much fun. I was shocked to see it win so big at the Game Awards. I think that's a good sign for it because, you know, there's certain games that, you know, we have a lot of friends in the industry. So when",
            "start": 670.44
        },
        {
            "text": "much fun. I was shocked to see it win so big at the Game Awards. I think that's a good sign for it because, you know, there's certain games that, you know, we have a lot of friends in the industry. So when something happens, you know about it pretty instantly. Everyone's tweeting, you got to play Gone Home. This was one of those things. You got to play this. Oh, I'm loving this right now, whatever. But it's like there's that weekend. And if you missed that weekend, you never hear about it again because there people are on to the next thing. And to see this game, like I haven't heard about it since, you know, everyone's talk about, you're like, we got to do a Let's Play. Let's do this. Then it kind of went silent. Yeah, didn't hear anything about it. And all of a sudden it it's winning ****. I'm like, that's great for that. Like same thing with Gone Home where it's like, I feel like it did have that moment of conversation and then it dropped off, then eventually got to the mainstream because of the awards and stuff. So no, yeah,",
            "start": 706.8
        },
        {
            "text": "like same thing with Gone Home where it's like, I feel like it did have that moment of conversation and then it dropped off, then eventually got to the mainstream because of the awards and stuff. So no, yeah, Her Story was great. I high highly recommend it. Yeah, and then Emily is Away. My God, you want to talk about like, I did a I'm doing a piece for Game Informer and for Giant Bomb of my top 10 games and where Emily is Away lands on it. And I'm sure it'll be in the same spot when we do our video next or two weeks from now, two weeks from now. Like totally, man. I could not believe how high that rank because it is one of those things where yeah, it's a short game. You know, we our Let's Play is 50 minutes, you know what I mean? And that's with us hemming and hawing and being idiots. It's all realistic of us hemming and hawing and like it such a trip. It got emotion out of us when I kept talking about and when I was talk when I talked to people about Emily is Away is the fact that it's like you have to understand",
            "start": 741.8
        },
        {
            "text": "and hawing and like it such a trip. It got emotion out of us when I kept talking about and when I was talk when I talked to people about Emily is Away is the fact that it's like you have to understand sitting there and playing that game in my spare bedroom for Kinda Funny with Tim next to me or whatever. **** that. Like in my head, I am at my desk freshman year of at Mizzou with my huge Toshiba looking out at this. Like it's all right there because this was life. This was it where you're you leave these people and you then start talking to them through AIM messaging and like picking the right buddy icon and then picking the right response and all stuff. And like the way you and I sat back like, what do we saying? What do we do? Well, what's funny is like you you say that like you're not in this room, you're by yourself, whatever. To me, it's not even by yourself. Like those memories are having someone next you. It's like, what should I say? What should I say? And you overthink it and like talk it over and",
            "start": 780.04
        },
        {
            "text": "by yourself, whatever. To me, it's not even by yourself. Like those memories are having someone next you. It's like, what should I say? What should I say? And you overthink it and like talk it over and like rewrite it 10 times. Like, oh, that game, it did something, man. I'm so happy that I I recently looked at the the numbers for it. Like the Let's Play is over 50,000 views, which puts in the upper echelon of our our Let's Plays. That's awesome because it didn't when it first came out, it wasn't moving numbers. And I was like, guys, like, I'm not talking about our performance. Like, you need to see this game if you this game. And I love that. I love that it's like, it is it's I want Kinda Funny to be known for that type of stuff for those those moments of it's like, we genuinely enjoy this. You know, it reminds me of your Batman v Superman reaction. Like, who gives a **** what everyone else thinks? Like, you genuinely love this thing. And I I just it it's great. Emily is Away. Highly recommend it. Do it. Definitely check",
            "start": 820.4
        },
        {
            "text": "Batman v Superman reaction. Like, who gives a **** what everyone else thinks? Like, you genuinely love this thing. And I I just it it's great. Emily is Away. Highly recommend it. Do it. Definitely check that **** out. Is there any other PC games? I'm sure there's a bazillion, but I'm talking about that we really care about. We connect it with because it's out of our normal wheelhouse. What was the one where we jacked the car off? Oh, Drive Shaft? Or no, that was that was Charlie's band Shift. Find the jack. It was just jacking a car off. It not uh ****. There was one that I had a momentary glance at. Jack in the car off is what I said. And that made me think of something else. I remember the game Party Hard. I enjoyed Party Hard. That's finally out or whatever. Or Greenlight or whatever. Oh, yeah, yeah. There was one I don't think it's out yet, but we played the the early version of it that uh it was like a very sterile white white stuff and Superhot. Superhot. Superhot. Super awesome. Awesome concept. Really",
            "start": 856.88
        },
        {
            "text": "one I don't think it's out yet, but we played the the early version of it that uh it was like a very sterile white white stuff and Superhot. Superhot. Superhot. Super awesome. Awesome concept. Really cool game. I I love the the, you know, the Steam Greenlight stuff brings a lot of bad ****. It's like mobile games. Like there's like so much bad, but then it does allow the like really cool random thing to come through. So yeah, I was a big fan of that. Do you have any? No, yeah, no, I don't think I played much. I played Civilization V. That's pretty much only PC game I play. Um, then for mobile, I do got to give a couple shout outs because I have put so much out like Peggle Blast. I talked about it all year. It came out at the tail end of last year, but I didn't start playing until this year. Sure. And uh, there's a lot of problems with it just in terms of microtransactions and this and that. You've heard it all before. You you could hard boot your phone to get around it. Yeah, but there's there's there was a new",
            "start": 901.88
        },
        {
            "text": "a lot of problems with it just in terms of microtransactions and this and that. You've heard it all before. You you could hard boot your phone to get around it. Yeah, but there's there's there was a new update they put out recently that gives you a lot more lives and gives you some ****. And man, I'm telling you, Peggle Blast is the best Peggle game that ever happened. Like when you don't have to deal with the **** like like, you know, it's not too hard to get around it. But I mean, you saw me anytime we were on a trip, I was **** going through that ****. And it's like, if you could Platinum this game, I would Platinum this game. It is just so much fun. There's so much to do. And you know, Peggle's always been cool because it is just a simple brick breaking game, but then with the powers and stuff and just the stupid ass music that plays and like it just, you know, adds a fresh twist to it. And Peggle Blast, I think is ideal because it's on a mobile phone where you play vertically instead of the the",
            "start": 947.0
        },
        {
            "text": "and just the stupid ass music that plays and like it just you know adds a fresh twist to it and Peggle Blast I think is ideal because it's on a mobile phone where you play vertically instead of the the horizontal version that you normally do with Peggle it gives you so much more real estate it just changed the game up enough and I'm like **** I'm **** addicted to this there was no game I was more addicted to than Peggle Blast um Lara Croft Go oh yeah very fun very cool I liked that it um felt like a more fully featured game even though it was on mobile um my biggest problem was that it it's a tease it's such a tease at what could have been a really fun challenging difficult puzzle game it ended up just being kind of a puzzle game where you play it and you're like I know exactly what I need to do yeah you always said this it was never hard enough right yeah you see the the room you have all the things you look at you're like all right I need to move this thing there so then it just kind of",
            "start": 983.48
        },
        {
            "text": "do yeah you always said this it was never hard enough right yeah you see the the room you have all the things you look at you're like all right I need to move this thing there so then it just kind of becomes about going through the motions of doing but it's still fun to do and it's still it's still cool to see and I love the art style of it um I love the the music and just the the visuals are just really really engaging and it's it's a fun low game like it reminded me a lot of the old Tomb Raider games and you know we saw the um we had them on the panel in right PAX Prime yeah and they're talking about how this is we made a game that was what we remember Tomb Raider being and it's like that really is this like it's much better than the games yeah yeah there is many of them jumping around um Pac-Man 256 did you play this no I heard good things awesome yeah I mean it's it's the same thing which is kind of like it's just Pac-Man but back in the day with Pac-Man 256 level when",
            "start": 1027.8
        },
        {
            "text": "around um Pac-Man 256 did you play this no I heard good things awesome yeah I mean it's it's the same thing which is kind of like it's just Pac-Man but back in the day with Pac-Man 256 level when you got there there was like a glitch where everything would start glitching and they're like let's make a **** game out of that and it kind of just became this thing where it's an endless scrolling Pac-Man game where you just kind of keep having to go up as the bottom of the screen kind of just Rises with this like glitches and **** and it's just a score attack thing and like it's randomly generated and it's just it's fun Pac-Man just like techno music just blaring and **** and it's a definitely a playing game for me um I enjoy that and the one that doesn't get talked about enough is Horizon Chase you like Cruis'n USA and I don't know why you wouldn't this is the game for you it's just takes that that stupid arcadey racing from the 90s thing where it's just like you just go and you",
            "start": 1067.08
        },
        {
            "text": "Chase you like Cruis'n USA and I don't know why you wouldn't this is the game for you it's just takes that that stupid arcadey racing from the 90s thing where it's just like you just go and you perfectly drift around everything without having any skill at all really just you just hold it you just go and then you just it's left and right and it just kind of like Auto does it but it's addicting and it's fun and there's the stupid like dancing girls at the end and stuff it's just it's exactly now we know why Tim likes it oh yeah I'm all I'm all end it yeah the soundtracks are great and everything it's just it's very 90s it's very Tim I'm a big fan of that those are those are my mobile games um Tim's mobile game shout yeah gotta give him the shout outs I'm glad you did yeah ladies and gentlemen that was 2015 whoa Whoa man hey man Dan Arum Nugs man you got them Dan Arnam Nugs what are your favorite games 2015 let us know in the comments below and make sure you come back next week where we",
            "start": 1108.48
        },
        {
            "text": "that was 2015 whoa Whoa man hey man Dan Arum Nugs man you got them Dan Arnam Nugs what are your favorite games 2015 let us know in the comments below and make sure you come back next week where we will be predicting 2016 it's going to be a wild ride it's going to be a lot of fun one day I predict that I'm going to get that **** Championship never I'm never letting it go it's gonna happen Toadstool T is the next one so start **** practicing oh **** you **** yep thank you so much for everything till next time I love you",
            "start": 1150.92
        }
    ]
}