{
    "id": 1445,
    "video_id": "gP5caQVgxj8",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "Indivisible Looks Incredible - Kinda Funny Plays",
    "description": "Tim and Colin check out Indivisible, the latest from the creators of Skullgirls.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1451322001,
    "duration": 755,
    "transcript_chunks": [
        {
            "text": "What's up guys? I'm Tim Gettys, this is Colin Moriarty. Today we're playing the Prototype of Indivisible. It's a 2D action RPG from Lab Zero Games, the creators of Skullgirls. You ever play Skullgirls? Uh, no, 'cause I'm not in the fighting games. I liked it, very, very pretty game. It's very pretty. I mean, I know what it looks like for sure. Oh dear. So this is from uh, good old Indiegogo. They raised $1.5 million, which is insane. I'm going to lower, we're going to lower the volume a bit. I like that. Yeah, so 1.5 million to make the game. The colored screen border means an enemy is attacking. To defend, hold an action button down. Defending causes ID meter. So, in the vein of Valkyrie Profile, spanning a huge fantasy world inspired by our own world's various cultures and mythologies, players will navigate beautiful environments using a variety of different traversal abilities and engage monsters in fast-paced combat. So it's, this is interesting. I like it. Seems like it's kind of like a Super Metroid, like Metroid",
            "start": 0.08
        },
        {
            "text": "environments using a variety of different traversal abilities and engage monsters in fast-paced combat. So it's, this is interesting. I like it. Seems like it's kind of like a Super Metroid, like Metroidvania slash RPG game, and that's cool. Yeah, it's, I like that. I what I've realized here is I thought it was going to be more action RPG and it's not at all. Um, it's, yeah, it stops when you encounter the enemies. You have to kind of fight them in the turn-based kind of battle. It's not really even turn-based, it seems like it's active battle actually. Um, I like it. Yeah, so far, like I'm, I'm digging it so far. I like the look, I like the uh, the look of the character is really nice. Yeah, you can get it right now, the Prototype at least that we're playing, playing on Windows, Linux, Mac, PS4, and Steam. So what am I, you might need a debug though for the PS4. Yeah, we're playing, we, to be clear, we're playing a prototype version on, on a PlayStation 4. We have a PlayStation 4 debug that we're playing on, knocking these dudes out. Looks",
            "start": 49.76
        },
        {
            "text": "a debug though for the PS4. Yeah, we're playing, we, to be clear, we're playing a prototype version on, on a PlayStation 4. We have a PlayStation 4 debug that we're playing on, knocking these dudes out. Looks like are, what are these dudes supposed to be? Are, are they like things in a bowl? What, they are chopsticks coming out of them. Is that, am I reading this totally wrong? Yeah, what it is, I'm usually not too big of a fan of the like 2D Sprites on 3D background thing for the .5D style, but this actually looks really nice. It does look nice. I'm not crazy about .5D either. It's just, it's, it's just easier to do, it's way cheaper. Like this, it looks good. Yeah, it looks nice. The character, the model looks really, really awesome. The, her animations are really nice. She can jump like Ryu, and which is cool. Oh, who's that? Oh, ****, party members. That's pretty cool. I like him. Yeah, I like, I like his Dan. Yeah, he's cool. And so, is there any information on, I'm just kind of looking through to see uh, what's some, some",
            "start": 95.04
        },
        {
            "text": "that. Oh, ****, party members. That's pretty cool. I like him. Yeah, I like, I like his Dan. Yeah, he's cool. And so, is there any information on, I'm just kind of looking through to see uh, what's some, some new stuff here? Um, featuring a soundtrack by Hiroki Kikuta. It's a fixed funding campaign, which means Indivisible will only happen if we reach the goal. So they made it happen. 505 Games generally agreed to contribute a further million towards development only if we reach the goal. So this game is pretty funded, which is, is good to hear. It's good investment, I think. If funded, Indivisible will be released on PlayStation 4, Xbox One, and Steam. And the final product will support English, French, Italian, German, Spanish, Japanese, and Russian for all of our global friends. So yeah, the game, I mean, I'm, I'm pressing all the buttons. Like I'm trying to figure out, there's like no menu that I can look at. Oh, wait, wait. So all, so we got a little bit of a map here. This is by holding on R1, L1 doesn't do anything. R1",
            "start": 146.68
        },
        {
            "text": "all the buttons like I'm trying to figure out there's like no menu that I can look at. Oh, wait, wait. So all, so we got a little bit of a map here. This is by holding on R1, L1 doesn't do anything. R1 does the same. X, is it just your hand attack? I think so. Just equipping punch. But I'm looking for like, is there like my earning experience? So I have equipment. I'm kind of like, you know, the little things that I care about. So some story based things here. Her name is Ajna, I'm going to assume. I think you're right. A good-natured tomboy with a rebellious streak. Ajna was raised by her father on the skirts of their rural town. Her father raised her to be a fair-minded and tough girl and trained her in martial arts so that she might defend their home. When the town's attacked by local warlords, she discovers a mysterious power to absorb certain individuals into her being. Furthermore, fusing with these incarnations will not only allow her to summon them into battle, but also grant her new weapons and",
            "start": 205.0
        },
        {
            "text": "a mysterious power to absorb certain individuals into her being. Furthermore, fusing with these incarnations will not only allow her to summon them into battle, but also grant her new weapons and ability. So I think that's what we're seeing here with him. Yeah, this is interesting. Uh, she sets out in a globe-spanning quest that will reveal her true nature. I interest in um, yeah, like more context would be nice. Yeah, it's inspired by Southeast Asian mythology. A lot of really nice art here. We going, oh, there's a whole bunch of these little like characters. Yeah, cool. Oh yeah, I like that. Like a, like a furry dog. See, so she has the normal moves. She can run, jump, crouch. I don't know if you have dash yet, maybe you do the double tap. This, that's a cool enemy here. Yeah, I'm with organs. I'm really feeling the, the look of the game a lot. You, this would be right at home PlayStation Vita. Of course, what wouldn't be? These are just talk about the games that wouldn't be right at home on PlayStation Vita. Stay back, stay back. Let me show",
            "start": 251.52
        },
        {
            "text": "of the game a lot. You, this would be right at home PlayStation Vita. Of course, what wouldn't be? These are just talk about the games that wouldn't be right at home on PlayStation Vita. Stay back, stay back. Let me show you. Master has come to fight by your side. Okay, it looks like there's a whole bunch of different weapons you can get. Like there's like an axe and a bow and arrow and a spear and like a whip thing. Yeah, looks like I'm just using my fists right now. Mhm. Sons of ****. Okay, I got another guy. Oh wow, it's cool. They come together. I guess you can have four. I like this battle system. It's cool. It is. So like for people that don't realize what I'm doing, like, or I'm trying to do, I'm not doing it very well. Um, when an enemy attacks you, your enemy, your character glows and you can hit the button corresponding to that character to defend to lessen the blow. A lot of palette swapping already in the game, which I don't like, but it's early and it's a prototype. I'm sure they're just using what they have. Mhm. Stay back. So",
            "start": 312.92
        },
        {
            "text": "character to defend to lessen the blow. A lot of palette swapping already in the game, which I don't like, but it's early and it's a prototype. I'm sure they're just using what they have. Mhm. Stay back. So you can see there, I blocked. It's cool. The battle kind of reminds me of like the Final Fantasy Active Time Battle system mixed with uh, Mario & Luigi or any Mario. Yeah, it's definitely accessible with at least one level of ID meter and an action available. Hold the R1 button and press an action button to use an ID power. I don't want to waste it here. And it seems like they're gaining some sort of experience in terms of like how many times they can attack in, in battle. Oh, there's an axe here. Oh man. So I can use the axe to cut down the vines. I've been counting. I got it, got it. Not enough. Let's see what else we got here. I like this. I'm sorry I'm not talking. No, it's cool. I'm sorry I'm not. I'm looking through this. I'm, I'm interested. There's so much stuff here. They got a lot of cool things.",
            "start": 359.68
        },
        {
            "text": "See what else we got here. I like this. I'm sorry I'm not talking. No, it's cool. I'm sorry I'm not. I'm looking through this. I'm, I'm interested. There's so much stuff here. They got a lot of cool things going. They got, so there's going to be like guest characters and stuff. They got Shovel Knight in here. Your boy Shovel Knight. That's my dude for sure. Find more information on that. Yeah, they got um, do you want Razmi the Shaman, the dude from Guacamelee!? Oh nice. Um, Juan. Yes, very cool. Yeah, this is interesting. Okay, so now I can go back. I think I can go back now and get some these vines in my. I see. Yeah, I'm like, I need, I would like a little more context to like what I'm doing, but I go, I think that'll come, you know. Yeah, I was reading there's like meditation rooms that you go into and I think you get a little more story there. Cool. Yeah, here's what, here I'm looking for. Come through here. This new direction. Little wall. I got four characters. I like that they're part of you. That's really cool. Yeah, I like the, the",
            "start": 416.28
        },
        {
            "text": "story there. Cool. Yeah, here's what, here I'm looking for. Come through here. This new direction. Little wall. I got four characters. I like that they're part of you. That's really cool. Yeah, I like the, the shaman in the back. Wreck and shot messed up there. All right, new. Oh, that's cool. Oh wow, really nice transition. I love the, this game has a really defined look and like feel to it. Not just like the look of it, but like the sound of it and how everything fits together. The watercolor backgrounds are cool too. There's, there, there's a lot of like conflicting, I want to say conflicting, but like disparate kind of elements here. Yeah, in the foreground, like which nicely kind of like fit together. It's cool. Agreed. Like the tree in the back, like that's, I like the, the scrolling effects on it. That was weird. There was an enemy there and I scrolled him off like an old, that's like an old NES trick, like a memory trick. Wonder why that happened. I know where he went. So you think this is a game you",
            "start": 472.4
        },
        {
            "text": "was weird. There was an enemy there and I scrolled him off like an old, that's like an old NES trick, like a memory trick. Wonder why that happened. I know where he went. So you think this is a game you, you'll play? Yeah, this is definitely more than Skullgirls. I love Skullgirls because of the look and stuff, but yeah, fighting games aren't my thing either. This definitely my right. The character designs are really cool. Damn. Yeah, I'm a little disappointed in the enemy variety. Again, it is a prototype. They make it very clear you're playing a prototype. I'm sure that this is maybe not even going to be in, in the game, but like we fought this enemy. Palette swapping is a fact of life with RPGs, but it's uh, not something. Yeah, yeah, that's funny. It reminds me of like when I was little and my mom would come home with like Pokémon stuff, like a backpack and it's like the just purple. And I'm like, get away. That's not going to work for me. That ain't going to cut it. Right. It is cool like the sequence of attacking again. I like",
            "start": 540.68
        },
        {
            "text": "stuff like a backpack and it's like the just purple. And I'm like, get away. That's not going to work for me. That ain't going to cut it. Right. It is cool like the sequence of attacking again. I like how it seems like some experience is being earned. I, I would be curious to see the menu. Oh my god. Oh Lord. Things are getting real. He's a boss. As a shortcut, you can press L1 to defend with all your characters at once. Oh cool. That would be useful to have known earlier. There we go. And the signs are, so yeah, the designs and animations are, I love how many characters there are too. Like it's, it's cool that they, they're not skimping out on how many people there are. Right. Agreed. Tiger Shaman. Have you used one of your crazy attacks yet? Yeah, that's one of those. I think that was Razmi's level one thing. So I can try another one here. Don't try this one. Anyway, here comes the, oh, that's cool. Here comes the, I like to be a voice actor in one of these games. Just do like, like one character.",
            "start": 595.32
        },
        {
            "text": "level one thing. So I can try another one here. Don't try this one. Anyway, here comes the, oh, that's cool. Here comes the, I like to be a voice actor in one of these games. Just do like, like one character. There's like nothing he doesn't say very much, but like your, yeah, video game attack names, man, they're just so special. Marvel vs. Capcom, very special place in my heart. Berserker Barrage. That's the end of this. This is cool. Can you go? No, I was thinking the same thing. It looks like it. Yeah. Oh, is that a different axe I have? I guess not glowing, so I can't get it. Is this the end of the room for me? Can I go? I mean, this might not be a bad place to stop. Yeah, I kind of like it. This is a nice little taste. This is one of those perfect example of, of games where it's like, I don't want to ruin too much. Yeah, especially because the prototype's available for people. So definitely go check it out. Yeah, we've seen, we've seen actually quite a bit of the map here, as you can see. Um, oh, and I can just switch between. I see. Okay.",
            "start": 656.28
        },
        {
            "text": "the prototype's available for people, so definitely go check it out. Yeah, we've seen, we've seen actually quite a bit of the map here, as you can see. Um, oh, and I can just switch between. I see. Okay. Yeah, I don't know how. I'm sure I can bungle up, but this will be boring. Let's end it there. Yeah, Indivisible. This is the Prototype. Go download it now. It's by Lab Zero Games. Thank you very much. They sent it to us actually to play this. Did that. This is super awesome. Till next time, youtube.com/kindafunnygames.",
            "start": 714.88
        }
    ]
}