{
    "id": 1385,
    "video_id": "gpO7bE7ZPuA",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "The Best Little Things Ever - The GameOverGreggy Show Ep. 104 (Pt. 3)",
    "description": "Tim talks about all the weird little things he loves.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1449043200,
    "duration": 990,
    "transcript_chunks": [
        {
            "text": "Hey guys, Kinda Funny is having a holiday sale! That's right, if you go to KindaFunny.com/store for the next week, from Black Friday until the next Friday, you can get 10% off everything in the entire store. That's all the beautiful shirts that you know and love, that's the cups, the mugs, the stickers, all of that stuff is there. And the Let's Him Host shirts, they're there for this week only. You need that, you need that in your life. Oh, are these all the T-shirt Tuesday shirts that we exclusively had only on those Tuesdays? Yeah, they're back for one week only, all of them in one place. Buy them for you, buy them for your sister, your friend, your neighbor, whoever you want to buy them for, even people you don't know. It's going to be great! 10% off KindaFunny.com/store. This episode is brought to you by Loot Crate. Would you classify yourself as a geek, gamer, or pop culture nerd? Then this is the subscription box for you. For less than $0 a month, you get six to eight items of gamer and pop culture licensed gear.",
            "start": 0.08
        },
        {
            "text": "Would you classify yourself as a geek, gamer, or pop culture nerd? Then this is the subscription box for you. For less than $0 a month, you get six to eight items of gamer and pop culture licensed gear, apparel, collectibles, unique one-of-a-kind items, and more. Make sure you head over to LootCrate.com/KindaFunny and enter the offer code Kinda Funny to save $3 on any new subscription. Not that long ago, and depending on where you live, not so far away, Loot Crate blasted off into a voyage across the Galaxy, searching the far reaches of space to find universally awesome gear. Using December's Star Wars: The Force Awakens loot as a launchpad, we landed on some equally cosmic items from Halo 5 and more, with an exclusive Funko Pop and an exclusive shirt in this month's crate. This is the loot you're looking for. That was a Star Wars reference, I just got it. Remember, you only have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cut off happens, Jack, that's",
            "start": 39.68
        },
        {
            "text": "for that was a Star Wars reference, I just got it. Remember, you only have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cut off happens, Jack, that's it, it's over. So go to LootCrate.com/KindaFunny and enter the offer code Kinda Funny to save $3 on your new subscription today. Your next topic from Patreon.com/KindaFunny, where you can go and toss us a few bucks and get your topic read, also comes from Christopher Ball. He put in a two-topic thing saying, 'If that's too personal, here's another one.' I didn't think it was too personal, but then I like his second one too. And so he's taking a Mike Ducker slot, 'cause Mike Ducker's men are very supportive of us and he sends very complicated topics for us to do, like the heartthrob one from last week. He's got a couple other ones in the pipe that are awesome, but then he's just ignored a couple emails for me. So this is a Drucker one that Christopher Ball is taking. If this is not a good topic, which it was,",
            "start": 85.04
        },
        {
            "text": "a couple other ones in the pipe that are awesome, but then he's just ignored a couple emails for me. So this is a Drucker one that Christopher Ball is taking. If this is not a good topic, which it was, don't worry about it. Here's a more light-hearted one: 'What are the most satisfying stickers to remove? iPhones, computers, movies, etc.' This was a Tim topic from back on episode 73. One didn't write that in the numbers from earlier ones. Hopefully people like getting back to the topics you all said y'all would revisit. Really do love the work and you guys and other best friends are doing. For the last two months in my car, all I've listened to is The GameOverGreggy Show, starting with episode one. Thank you, Christopher Ball, for all your support. So I absolutely love everything about this one, because that is the most Tim topic I've ever **** heard. Two, I hear that, I'm like, 'How is that something that I'm like, we're going to talk about that? What's the best stickers to remove?' I think that that is a misquote",
            "start": 138.96
        },
        {
            "text": "most Tim topic I've ever **** heard. Two, I hear that, I'm like, 'How is that something that I'm like, we're going to talk about that? What's the best stickers to remove?' I think that that is a misquote of what the topic was. What, what I meant, I'm pretty sure it's exactly that. No, I think the topic, because that, that's, there's not, it's not the most satisfying sticker, it's what are the most satisfying little things, the moments, like the sticker removal. And I think that because the reason I would have said I want to do this in the future is the fact that naturally Tim has a list of things that he would like to discuss on this very, very talk. Trying to get the gas on the exact number, you know, you're at the gas station. So this is little satisfactions. Yeah, yeah. Um, getting Capri, getting the straw in that hole on the very first try. Like just when you're being aggressive with just, you're getting a straw in any hole first try. Yeah. Um, the Indiana Jones moment you have when it's like a yellow light and",
            "start": 178.12
        },
        {
            "text": "hole on the very first try. Like just when you're being aggressive with just, you're getting a straw in any hole first try. Yeah. Um, the Indiana Jones moment you have when it's like a yellow light and you're trying to cross it and in your head you hear the Indiana Jones theme song, you're like, 'Oh!' See, I was thinking when you're trying to get underneath the garage door before it comes down too. That's an Indy moment. Yeah, very satisfying. Um, Bubble Wrap, just in general. Um, getting away with murder. Yeah, stacking games so that they're all like perfectly alphabetized and like just next to each other. This all started with the Disney VHS's and those giant ridiculous bubble wrap, not bubble wrap, but bubble cases. Um, sucking anything with a vacuum hose. Yeah, hopefully living that makes it funnier. Living, yeah, like living things do. Or like your tummy, I don't know, or your penis. You do that when you were a kid? I didn't want to go that, that far. Did you? Did you? Oh yeah, really? Really? Yeah, did it feel good?",
            "start": 222.32
        },
        {
            "text": "Yeah, like living things do. Or like your tummy, I don't know, or your penis. You do that when you were a kid? I didn't want to go that, that far. Did you? Did you? Oh yeah, really? Really? Yeah, did it feel good? Yeah, fantastic. I would be afraid. You really did that? That would suck my urethra right out of my dick. He inverted urethra. You start on low, that's the key. If it's got, if it's got multiple, what did your mom think? Oh, my mom knows I'm a **** cop. Fant, she knows I'm a pervert. Oh, good Lord, good. All right, there, that. And there was the spa. You guys ever, you guys ever had spa growing up? There's always the jet stream in the spa. Oh yeah, I know, I know what you're talking about. That was, that was the one you were like, you just happened by that one. You were like moving around in a spot and you're like, 'Whoa, wait a minute!' And then you just stand in front. 'Wait a minute!' Oh God, don't look at me. Yeah, I mean, obviously I thought about the vacuum hose, yeah, and the wiener, but like Scary Movie, got to be",
            "start": 265.28
        },
        {
            "text": "like, 'Whoa, wait a minute!' And then you just stand in front. 'Wait a minute!' Oh God, don't look at me. Yeah, I mean, obviously I thought about the vacuum hose, yeah, and the wiener, but like Scary Movie, got to be careful. Yes, but then I thought like, this thing is in all the dirtiest, nastiest places, sucking up the dirtiest, nastiest things. And like, I got to keep this guy. I was going to suck up the dirty, nasty dick. My be pristine. Yeah, the pristine peach. Um, magazines that had like images on the spine and having like the whole year, so you like **** or like Nintendo Powers, what I was thinking about. **** pervert. Okay, sorry. Um, that weird button that's on top of jelly. Oh yeah, why, why does that even exist? Safety seal. I know, but like necessary. This, when kids were getting poisoned, it was necessary. Really? What is it? Safety seal. When you, when you pop it, pop a jar and it goes that way, you know any that if it doesn't pop, then someone's opened this jelly. Oh, it just has a little nipple and you can just push it as much",
            "start": 307.76
        },
        {
            "text": "safety seal. When you, when you pop it, pop a jar and it goes that way, you know any that if it doesn't pop, then someone's opened this jelly. Oh, it just has a little nipple and you can just push it as much as you want. Which Snapple bottles. The Snapple bottles. Correct. Um, laying in bed in that time between alarms. So it's like you hit the alarm, then you like, you wake up and you reset the alarm. You're not actually going back to sleep, but you're in this weird limbo. It's the best. Um, just getting mail, like actual mail. Not **** bills, not **** bills, no packages too, but I'm talking about like getting a letter and that moment you're like, 'What the **** is this? Who sent this ****?' Um, your friends getting hurt. Like not seriously hurt, but like that moment you're not sure if they're seriously hurt or not, but like it's just funny. So every moment with Kevin, pretty much. Uh, we're out there at the kitchen table. It sounds like the **** walls are caving in here sometimes. I, I hear you. I know it's bad.",
            "start": 352.32
        },
        {
            "text": "not, but like it's just funny. So every moment with Kevin, pretty much. Uh, we're out there at the kitchen table. It sounds like the **** walls are caving in here sometimes. I, I hear you. I know it's bad when I hear you curse and then I'm like, 'Oh man, maybe this is the one he's going to come out with no arm.' Oh my God. Um, when you're trying to park and then a car pulls out right in front of you and just leaves, you're like, 'That's **** a gift from God.' Crunching leaves. Um, breaking yolk on the, you even talked about opening a game and the smell of a new game. Oh, that's amazing. Opening anything. Yeah, really. Booster packs, my God. Drinking Coke on a hot day, obviously that's on my list. Water balloons, just in general. There's so much satisfying things about water balloons. And then when boxes fit perfectly together and you like, you put it in like one box in the other box and it does that nice little, yeah, I like that a lot. Yeah, I know that feeling. What, wait, I'm getting a really, I'm looking at the psychoses",
            "start": 393.72
        },
        {
            "text": "and you like, you put it in like one box in the other box and it does that nice little, yeah, I like that a lot. Yeah, I know that feeling. What, wait, I'm getting a really, I'm looking at the psychoses of Tim right now. It's so funny. Garbage away and like you make it. I'll there now. Colin, are you, are you, are you getting the same feeling I'm getting where Tim is a 5-year-old body with a 1-year-old boy stuck in the middle of it? Yeah, I'm getting, I'm getting a different vibe, Nick, which is that when we're done with Greg's documentary, maybe we have to, we have to pivot over to Tim. Tell it'll be just called 'Lists on Lists, Lists, Lists.' There won't, because this whole thing, this, that whole list is just, I have, I have a Notes app and all it is is just a bunch of lists. And whenever things in my life happen, I'm like, 'I should write this down.' And I'm like, 'Which list does it fit on?' Some fit on multiple lists. That's smart in the sense that I always like, 'I should write that down,' when I think of an idea and I never",
            "start": 434.92
        },
        {
            "text": "I should write this down. And I'm like, 'Which list does it fit on?' Some fit on multiple lists. That's smart in the sense that I always like, 'I should write that down,' when I think of an idea and I never do. Uh, and then I go and just forget about it. I'll never think about it again. The one thing that you can't relate to that I think would be on this list if you were from the North is walking on snow. Yes, that's was me too. The crunch of fresh snow. **** yeah, especially when it hasn't been like touched yet. When I go, I love that. You'll wake up in the night morning and you'll look out and it's just perfect. And there's something about the perfection of how snow lays down when no one's touched it that like you just can't come close to. And it makes you want to just get out there and destroy. Yeah, it just puts something. We used to get mad in our, we used to get mad in our neighborhood when other people would run on our lawn or whatever. It's like, 'Yo, ****, we haven't run on the lawn yet, man. Now you're gonna have",
            "start": 479.96
        },
        {
            "text": "we used to get mad in our, we used to get mad in our neighborhood when other people would run on our lawn or whatever. It's like, 'Yo, ****, we haven't run on the lawn yet, man. Now you're gonna have some ****, now you're have to deal with the **** repercussions. You understand what I'm saying?' Already, household empties out on the lawn. Your boy Colin, your boy Colin ain't going to abide by that. And I'll tell, I'll tell you, I'll tell you the uh, the, the funny thing about snow is the dichotomy between like the harshness of winter and the beauty of of like falling snow or freshly falling snow or the way it looks, icicles. Yeah, it's like, it's all dangerous and **** up. You don't actually want to be in it, uh, unless you're dressed like an Eskimo and then you can go and have a good time. Climbers, or unless you're dressed like you when you go back to Boston, when you're wearing like all of us are bundled up like we're about to die, we're about to freeze to death and you got a **** 1989 like",
            "start": 516.76
        },
        {
            "text": "or unless you're dressed like you when you go back to Boston, when you're wearing like all of us are bundled up like we're about to die, we're about to freeze to death and you got a **** 1989 like denim jacket on and that's it. You're just like, 'I'm good, guys.' Tim and I are, we were like, 'Die!' I was talking about that with a friend recently where, you know, we went to school together in Boston and and we were, I was like, 'It was so funny watching especially Tim who I don't think you've never really been in snow before, right? Like you been to Tahoe, like, yeah, but that's Tahoe's hard, but that's not Boston.' Yeah. Uh, and uh, I was like, 'It was kind of fun to watch these people just squirm.' I'm like, 'This isn't, I lived in this.' So did, and so did Greg. I'm like, 'This sucks unequivocally, but I'm like, it was way worse. It was been way worse than this.' You know, like it wasn't actively snowing. I keep getting texts from friends and families 'cause it's, it's going to snow in Chicago on Saturday, so it'll be like right",
            "start": 551.76
        },
        {
            "text": "worse. It was been way worse than this, you know, like it wasn't actively snowing. I keep getting texts from friends and families 'cause it's, it's going to snow in Chicago on Saturday, so it'll be like right like you're the idea I have of a Chicago winter landing right into it. Like, 'Great, that's good.' You any like, there's a reason I don't live there. Was like when I go up to Tahoe to to visit my uh, my sister-in-law, I love being there, but the act of getting there when it's snowing since I have a Honda is a **** pain in the ass. And it's worth it, it's worth it for family and it's worth it to go skiing and see everyone and just being in a different environment. But I get anxiety about that sometimes 'cause I'm like, it's literally dangerous to drive in the snow, really dangerous, especially if you don't have a four-wheel drive vehicle or snow no tires. So or Kevin, I'm just going to bring Kevin with me next time at D. Are you? Yeah, that's interesting that you're really good at driving in snow but not on normal",
            "start": 589.28
        },
        {
            "text": "a four-wheel drive vehicle or snow no tires. So or Kevin, I'm just going to bring Kevin with me next time at D. Are you? Yeah, that's interesting that you're really good at driving in snow but not on normal streets in San Francisco. You know what's funny about this thing is like this all his life Kevin prides himself on his driving and whenever someone makes any comment about being better than him or him being worse than them, he all you'll race him. That doesn't sound like responsible D. That's, that's the way to to like really hurt him. You should probably get your brakes fixed first before you brakes. What was the story? Drunk? You just don't, don't incriminate yourself by the way. Brakes are like broken. ABS brakes are broken. Instead of locking, instead of locking, instead of preventing the lock, instead of preventing the, they release. So his brakes fail. Your brakes failed and you hit something. So they're not brakes anymore. No, like there goes. Think I was trying to think of it. Nine out of 10 times, what's the",
            "start": 627.32
        },
        {
            "text": "preventing the, they release. So his brakes fail. Your brakes failed and you hit something. So they're not brakes anymore. No, like there goes. Think I was trying to think of it. Nine out of 10 times, what's the opposite of breaking? Did you get it fixed, Kevin? I don't, you know what, you got to stop talking because you're going to kill someone and this is going to be very incriminating for you. The best part though is that his little pickup truck now the bumper's falling off, so it looks like it has a sad face and it's the most Kevin-ass thing I've ever seen. You better, we need that truck, so you better keep that in working order. I hired you because you have a truck, so that's, that's an issue. I've had for a half now. Which part? The, the brakes. Okay, good to know. I've driven you with you and didn't know that. That was the best is when we were trying to, we were going to go up to WWE to to play 2K16 or whatever and we had all the expensive equipment or whatever and and we're like, 'We'll toss them in the back in my'",
            "start": 673.24
        },
        {
            "text": "the best is when we were trying to, we were going to go up to WWE to to play 2K16 or whatever and we had all the expensive equipment or whatever and and we're like, 'We'll toss them in the back in my truck.' And I'm like, 'Uh, but you just had the accident.' I'm like, 'We'll, we'll ask Christine, we'll take Christine's car.' And like, 'Oh no, but I can drive, like it's no big deal, don't worry.' We like, 'All right.' We get the car and we turn on the road. You're like, 'It's probably a good thing you drove. I don't think my car could make it.' I'm like, 'Why were you going to do it then?' It could, it could. You're a monster. He really is. He really is. Why these all these topics go back 'cause we like you a lot. We do like you a lot. Our lives are no longer, you're our muse. Yeah, he really is. The best sticker to take off is a new iPhone. Oh yeah, nothing better. Now do you get pissed off when when the dude at the store takes it, tries to take it off for you? Yes, I **** hate that. I mean, they don't really do that anymore for me because I'm",
            "start": 717.8
        },
        {
            "text": "yeah, nothing better. Now do you get pissed off when when the dude at the store takes it, tries to take it off for you? Yes, I **** hate that. I mean, they don't really do that anymore for me because I'm kind of so into iPhones that I just know they're beforehand. I'm like, 'Don't, don't **** touch that. Don't touch that sticker and don't tell me how to sign up for the iCloud because if there's going to be a Fappening number three, I don't want to be any part of that.' Good, good. I don't want all those random dick pics that I send to myself winding up online for other people to see 'cause my wife doesn't want them anymore. I would love to see your dick pics pop up online. Deletes them when you, I've tak, I've taking one or two dick pics 'cause I'm like, 'I wonder what this is going to look like.' I'll be honest with you, I could never film myself in a porno either. I just don't, we had a topic about this on love, on love and sex stuff. And I'm like, 'I just, I don't like the way any of any part of my body looks. I like it to'",
            "start": 754.2
        },
        {
            "text": "I could never film myself in a porno either. I just don't, we had a topic about this on love, on love and sex stuff. And I'm like, 'I just, I don't like the way any of any part of my body looks. I like it to the naked eye.' Like when I'm looking down at myself at at uh, God, yeah, Stanley. Yeah, like the power damn. Like the who, like the power drill. Oh, it's an old, I thought Stanley like from The Office. No, no, that's a way too much of a modern reference. That's a reference to an old Andrew Dice Clay where he's like, 'I call my dick Stanley.' You know, like the power drill. Oh, I'm reading his biography right now. How is it? It's really good. Did you finish all those Interview with the Vampire books? You were in the one that took me seven months to finish. Yeah, every, 'What the **** just happened?' What? All right, Andrew Dice Clay. You never saw, you never seen. He used to smoke behind us. He like, 'Oh!' And then he smoke a cigarette. Like, 'Oh, I don't know.' I, I thought what I thought happened was that 'cause you guys had a little old moment.",
            "start": 789.44
        },
        {
            "text": "you never saw, you never seen. He used to smoke behind us. He like, 'Oh!' And then he smoke a cigarette. Like, 'Oh, I don't know.' I, I thought what I thought happened was that 'cause you guys had a little old moment. I thought you Greg was going for a pound. You thought he was and then he didn't, so you like tried to play it off, went all the way around and then just **** like kissed your fingers. No, this is an Andrew Dice Clay, a famous Andrew Dice Clay. I'm happy I was giving you, I don't know, too much credit or too little credit. Do you know who, and I do not. He, he was, no, he was a really big comedian in the late '80s and early '90s that like um, had a great career, used to do like really nasty jokes largely about nursery rhymes. Like he'd do one that was like, 'Little Boy Blue, he needed the money, chill.' Like that. So if you've never seen him, you should definitely look him up. I'm not do any justice. That was really good actually. Thanks. Hickory Dickory Dock. Yeah, yeah, weird, weird dude. That's what it looks like. Yeah, so that",
            "start": 838.08
        },
        {
            "text": "never seen him, you should definitely look him up. I'm not do any justice. That was really good actually. Thanks. Hickory Dickory Dock. Yeah, yeah, weird, weird dude. That's what it looks like. Yeah, so that was, that was a character that he started play. He used to do impressions um, and he started doing this character called The Dice Man where it was like kind of like quasi-Elvis, like very misogynistic, like uh, like alpha male. And that's what he became known for. So he became that character basically. Like he did a a couple movies as The Dice Man and and all that stuff. And then he got boycotted. Well, I'm not to that point in his autobiography, but that's what got me, that's what got me. Well, no, I mean, he blew his career, blew up on him. It was pretty sad actually. Like he got rightfully so a lot of hate from from feminist groups and some other people and got boycotted a couple times when he went on Saturday Night Live. And so he, I guess, I mean, at one point, I, I think he was the highest paid or one of the highest",
            "start": 879.32
        },
        {
            "text": "groups and some other people and got boycotted a couple times when he went on Saturday Night Live. And so he, I guess, I mean, at one point, I, I think he was the highest paid or one of the highest paid comedians on in the world and then he'd gone behind the comedy nuts. So I'll keep you guys posted. What was that show we did on VH1 more recently? Dice Undisputed or something like that when he was trying to come back? Yeah, he trying to make a comeback. Didn't work out. Oh, because you don't know who he is. I don't. Yeah, no, sad, but he was very talented. What, how the hell did we get on that? Oh, 'cause I did this thing. What the hell were we talking about before that? Stickers. Don't touch a man's iPhone. I used to, when I was a smoker, I used to love the unwrapping of the pack and then you'd open it up and you, you take out the foil perfectly and sometimes it would tear the wrong way and you'd be like, '****!' And you have to go in there and just kind of tear it out 'cause it's like perforated, so you can actually tear",
            "start": 921.08
        },
        {
            "text": "out the foil perfectly and sometimes it would tear the wrong way and you'd be like, '****!' And you have to go in there and just kind of tear it out 'cause it's like perforated, so you can actually tear it out perfectly. And then you're just looking at that pack of beautiful 20 beautiful little killers. Big beautiful cigarettes, gorgeous, glistening cigarettes, rock hard. Well, rock hard like oils all over them and it's shiny. And boy, all right.",
            "start": 961.64
        }
    ]
}