{
    "id": 1396,
    "video_id": "GWOH1_30Kx0",
    "show_name": "Love & Sex Stuff",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "How To Kiss - Love & Sex Stuff",
    "description": "Go to http://www.squarespace.com and use promo code kindafunny for 10% off!\n\n\nSupport this show! Get the Love & Sex Stuff Shirt here!\nhttps://www.districtlines.com/98029-Love-and-Sex-Stuff/kindafunny\n\nSubmit your questions here!:\nhttp://www.kindafunny.com/loveandsex\n\n\nHow do you kiss?\n\nEach and every Monday at 9AM PST Tim Gettys and Nick Scarpino answer your questions about dating and relationship advice....cause that sounds like a good idea.\n\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\n\n\n\nMusic by Tonedeff - http://www.QN5.com",
    "published_at": 1449507600,
    "duration": 288,
    "transcript_chunks": [
        {
            "text": "Love & Sex Stuff is brought to you by Squarespace. Build it beautiful. This is how you do it. Nobody ever taught me how to do it. So, Nick, yes, Tim, today's question comes from 18-year-old Lana. Okay, Lana says, \"I feel super awkward when I kiss people. How can I change this? Does it ever get better?\" It does get better, Lana, with practice and with time. So let me give you my phone number real quick and we can get this done. It always remains awkward. Yeah, here's the thing, it's a case-by-case scenario. Every situation is different and it's like some situations feel less awkward than others, but really they're all awkward. That's my stance. I feel like when you're younger it's awkward. When you get a bit older, as you get into your 20s and then into your 30s and you start dating people, you get it gets it goes from awkward to just exciting, right? That first time you're going to make out with someone, that first time you're going to kiss someone is, yeah, there's a little bit of awkwardness and the",
            "start": 0.76
        },
        {
            "text": "gets it goes from awkward to just exciting, right? That first time you're going to make out with someone, that first time you're going to kiss someone is, yeah, there's a little bit of awkwardness and the actual physicality of it, like I'm going to get close to this person. But you know when you know it's time to get that job done and you put the work gloves on and you go to work, if you know what I mean, with your tongue. But we go, yeah, exactly. I do know what you mean. I think there's a couple uh basic things that everybody knows. Don't use too much tongue. No, you got to keep that thing in your mouth. You can use a little bit sparingly. Less is more with if you're using 50% tongue, back it off to 15% tongue. Oh, less than that, man. You think so? Yeah, I think I think the tongue is like the tongue. If you feel like you're going 10%, you're good. Just stay there. You think so? Yeah, think so. You think you have so what you're telling me is you have a less is more mentality, a policy on tongue usage. Yes. Okay. Uh-huh. We",
            "start": 61.24
        },
        {
            "text": "you're going 10%, you're good. Just stay there. You think so? Yeah, think so. You think you have so what you're telling me is you have a less is more mentality, a policy on tongue usage. Yes. Okay. Uh-huh. We have to now here's my thing though is like you're talking about it not being awkward and like if you're with the right person, I think even with the right person it can be awkward. Really? Oh, definitely, definitely. It's one of those things where it's like I've been with with multiple people. I've kissed multiple people in my life. Nick, I'm a 36-year-old man. You're you're you you've had your first year of uh kissing. Yes, things have happened. And you know the girls have told me, \"Tim, you're a great kisser.\" Like, \"Oh, you're a good kisser.\" And I've always thought, \"You're just saying words. That's not a real thing. We're putting our faces together and I'm just kind of sometimes wiggling my tongue in there.\" Like, there don't do that. Don't do whatever. Here's the thing though, then there's other ones where I'm like, I know",
            "start": 99.48
        },
        {
            "text": "putting our faces together and I'm just kind of sometimes wiggling my tongue in there. Like, there don't do that. Don't do whatever. Here's the thing though, then there's other ones where I'm like, I know like this feels weird. This just feels off. But then the problem is once you bring attention to it, it'll be off forever because then every single time you kiss, if you guys ever talk about, \"Oh, it's awkward. We just don't have kissing chemistry.\" Then all of a sudden every time you kiss someone will start laughing and then you're just kissing teeth and then it's just the most obnoxious thing ever. You got to keep the teeth out of it. The only good teeth is the light little nibble. Oh, like when they grab the bottom lip. Mm, yeah, that's pretty sexy. I'll also say this, this might not be your fault if there's an awkwardness to what you're happening that what you're experiencing here. Uh, it may actually be on the other person's side because there is such a thing as a bad kisser and you may not be one, but he",
            "start": 137.48
        },
        {
            "text": "an awkwardness to what you're happening that what you're experiencing here. Uh, it may actually be on the other person's side because there is such a thing as a bad kisser and you may not be one, but he might. And that happens. I would say this, the importance is also minimal tongue, but also there's a varying angle of openness to the mouth you have that has to be considered. Okay, too little and you don't even know if you're kissing. Too much and it feels like the person's trying to swallow your face. If you like that, you want you want it to be a nice little you want to look like like a goldfish. Like if I open my eyes and I can see your lungs, your mouth's open too wide. Okay, shut it down a little bit. Keep the teeth out of the equation. And like Tim said, tongues little bit. You don't have to go don't try to strangle the person to 'cause that's just going to lead to a paramedic coming and you got to explain what the hell was going on. No, officer, I swear to God, the handcuffs were her ideas. Ladies and gentlemen,",
            "start": 173.92
        },
        {
            "text": "to strangle the person to 'cause that's just going to lead to a paramedic coming and you got to explain what the hell was going on. No, officer, I swear to God, the handcuffs were her ideas. Ladies and gentlemen, this has been another thrilling episode of Love & Sex Stuff. For some reason, you come to us for love and sex advice. And if you have message for us, you should go to kindafunny.com/loveandsex where Nick made this beautiful hub page entirely using Squarespace. Built entirely with the power of Squarespace. It's beautiful. It's very easy to use and I recommend it highly. You want to try it out? Out there's a link in the description. You can get a nice little discount there. If you have questions for us though, go on that hub, fill out the form. You can see all the past episodes there. You can give us the questions. And if you want, if you're so inclined, you can also click over to kindafunny.com/store where you can get our T-shirt which we are selling for you and and your body. Mhm. I recommend it. I'm Tim Gettys on Twitter. He's",
            "start": 223.4
        },
        {
            "text": "if you want, if you're so inclined, you can also click over to kindafunny.com/store where you can get our T-shirt which we are selling for you and and your body. Mhm. I recommend it. I'm Tim Gettys on Twitter. He's Nick Scarpino on Twitter. Until next week, I love you and I love your minimal use tongue.",
            "start": 262.76
        }
    ]
}