{
    "id": 1407,
    "video_id": "HF2MqxV4HH4",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What's The Best Way To Play Final Fantasy VII? - Kinda Funny Gamescast Ep. 48 (Pt. 4)",
    "description": "There are so many way to play FF7, but which is the best?\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1449756000,
    "duration": 1224,
    "transcript_chunks": [
        {
            "text": "This episode is brought to you by Loot Crate. Would you classify yourself as a geek gamer or pop culture nerd? Then this is the subscription box for you. For less than $20 a month, you get six to eight items of gamer and pop-culture licensed gear, apparel, collectibles, unique one-of-a-kind items, and more. Make sure to head to LootCrate.com/KFGames and enter code KFGames to save three dollars on any new subscription. Not that long ago, and depending on where you live, not so far away, Loot Crate blasted off into a voyage across the galaxy searching the far reaches of space to find universally awesome gear. Using December's Star Wars: The Force Awakens loot as the launch pad, we landed on some equally cosmic items from Halo 5 and more. With the exclusive Funko Pop! and exclusive shirt in this month's Crate, this is the loot that you're looking for. Remember, you only have until the 19th at 9 p.m. Pacific to subscribe and receive that month's Crate. When that cutoff happens, that's it, it's over. So go to",
            "start": 0.0
        },
        {
            "text": "Crate, this is the loot that you're looking for. Remember, you only have until the 19th at 9 p.m. Pacific to subscribe and receive that month's Crate. When that cutoff happens, that's it, it's over. So go to LootCrate.com/KFGames and enter code KFGames to save $3 on your new subscription today. Final topic, as always, brought to you by the Kinda Funny Forums. You can go to KindaFunny.com/GamescastTopic to submit your beautiful, beautiful topics for this beautiful, beautiful, big, beautiful column. You know, kids, so I was going back and forth on which one we were gonna lead off with, but I kind of like this one based on the timing of this. This is from Wars Machine. What's up, dudes? Been a gamer for a long time, but when I caught a game I've never played, Final Fantasy VII, would this be best played on Vita? I currently have a PS4 / PS3 / Vita. Will playing Final Fantasy VII be enjoyable considering how gaming mechanics are today? So pretty much, what's the best way to play Final Fantasy VII?",
            "start": 34.8
        },
        {
            "text": "on Vita. I currently have a PS4 / PS3 / Vita. Will playing Final Fantasy VII be enjoyable considering how gaming mechanics are today? So pretty much, what's the best way to play Final Fantasy VII? I don't know. I mean, the PS4 one is imminent, so I don't, I don't know that I can write that one off. I think that it's my prediction, we'll know by the time you anyone here says, I think it'll be launched during PSX. Yeah, we'll know, but the trophies are live, so it's imminent. So with that said, I think the PS1 Classic is probably the best way to go, and you can play it probably on Vita. I, I think that that might be the best way to play it, but I don't know if you want to jump the gun on that until you wait and see what the PS4 one's all about. Yeah, it'll be an identical kind of port, but you can put it on PC, you can play it on PS1 if you want to. There's like a bunch of different ways to play, but I don't think you can really go wrong with the PS1 Classic if that's if you don't care about trophies. Yeah, I",
            "start": 88.72
        },
        {
            "text": "you can play it on PS1 if you want to. There's like a bunch of different ways to play, but I don't think you can really go wrong with the PS1 Classic if that's if you don't care about trophies. Yeah, I mean, I don't think that there's a bad version of the game out there. I mean, even the PC one, like, you know, it had its issues back in the day, but they kind of fixed that with stuff. So personally, my favorite was playing on PSP back in the day with the PS1 Classic. Okay, what that means the same thing as Vita. So yeah, absolutely. Um, but yeah, you're right, I would wait until the PS4 one comes out, kind of see how that one shakes out. But I'm a little shocked that it's not coming to Vita as well, like with the trophies and all that. Yeah, I'm not, I'm not, I don't, I don't, I don't, I don't know why. Yeah, I don't know what Square Enix is like. You don't know why the Vita is going out to see it. They hate them at launch to the flaming area. I don't know. I mean, it's disappointing, but I don't, you know, that's more QA and",
            "start": 129.85
        },
        {
            "text": "Square Enix is like, you don't know why the Vita is going out to see it. They hate them at launch to the flaming area. I don't know. I mean, it's disappointing, but I don't, you know, that's more QA and more like annoyances that they have to go there, like certification stuff. So I think that they were doing something on for a year, so they have, and there's a lot of rumors and what they've been doing. I mean, there's a lot of, there's, there, I was reading things that they feel, people feel like they've translated it again. People think that like there's more than this than possible, that it's not the straight PC port because some of the trophies are different. I don't know. I don't know the answers to any of these. Like what I haven't seen the cross-dressing scene specifically. Yeah, well, that's gonna be in there because there is a cross-dressing trophy. Okay, cool. But there's like some that people, there's some conjecture that this isn't all it seems. There's more than meets the eye here, that like this might not",
            "start": 167.02
        },
        {
            "text": "because there is a cross-dressing trophy. Okay, cool. But there's like some that people, there's some conjecture that this isn't all it seems. There's more than meets the eye here, that like this might not be the PC port, that, you know, there's some, you know, there's some word that with the PS emulation getting trophies, like the Star Wars games basically being straight PS emulators that are running trophies and the back end, that maybe this is the PS1 Classic ending trophies, stuff like that. But I don't know. I don't, I mean, it's just all conjecture. I don't know. It could just be a download that's gonna be huge. I will say to his point about the game now, the game holds up mechanically, I think, just fine. I don't, I don't think the game graphically holds up at all, but I wouldn't say that. I think that it's the, the character models, yeah, the hand-drawn backgrounds and the backgrounds, I think, are beautiful to this day. We'll see, their resolution is gonna be low. We'll see what I see. I'm not like playing it",
            "start": 199.75
        },
        {
            "text": "the, the character models, yeah, the hand-drawn backgrounds and the backgrounds, I think, are beautiful to this day. We'll see, their resolution is gonna be low. We'll see what I see. I'm not like playing it on the Vita. I think in that sense, it might be the best way to go. Yeah, well, maybe it is. Yeah, and then maybe it'd be too small then. I don't, yeah, it does run in 4:3. So the, I don't know, we're gonna find out what's going on with this. I'm excited. I'm interested to see like why this took so long. There was a reason why this took so long. So I haven't even thought about that. That's, that's really interesting. Yeah, I hope that, I hope it goes well. But I will say that regardless, you should play one of these before the Remake. Don't wait for the Remake. I'm thinking yet, plenty. I think they're gonna be very different games. And yeah, and I got all the time in the world too. But I think that it's worth playing this version for sure. Yeah, and I think VII's Active Time Battle is, it's, it stands up. The",
            "start": 237.46
        },
        {
            "text": "be very different games. And yeah, and I got all the time in the world too. But I think that it's worth playing this version for sure. Yeah, and I think VII's Active Time Battle is, it's, it stands up. The Materia system, I think, is really clever. I think that the, the weapon, accessory, armor system's a little reductive, but the Materia system's a really nice system. It's almost as good, I think, as like the Esper system. So certainly better than some of the other things that have come after it. So I think VII's a must play for RPG fans. I think that it's, it's, it's certainly not the best Final Fantasy game, but it's, it's, uh, it's a classic and it's a game that I've really come around on. Yeah, I think it's must play even for not RPG fans, maybe not to finish, but to at least try out and see because I do think that it's a good entry. I think more so than Final Fantasy VI. Yeah, VI is way more modern RPG person. VI is way more harker that it's, it's also a seminal game, which I think is really important. Like it, it's a",
            "start": 275.02
        },
        {
            "text": "that it's a good entry. I think more so than Final Fantasy VI. Yeah, VI is way more modern RPG person. VI is way more harker that it's, it's also a seminal game, which I think is really important. Like it, it's a game that's, there's really only a few third-party games that are as important as Final Fantasy VII ones to the success of a piece of, piece of hardware. And that was the first big PlayStation game. Big Beautiful Hon Six-Pack says, hey guys, how long do you think the PSN will work on PS3? I have so many games still to play on that system and I'm afraid that I'm going to lose my PSN games, downloaded games, and my trophy support. Keep up the good work. A long time. Yeah, I don't, you have to worry about that. It sorts on PSP. I think I, that's not something you should worry about. They like that. And if that happens, I'll give you a huge heads up and I bet you there's a workaround. Yeah, like the multiplayer games, you know, one by one are gonna go away. Buying games, thank you, fine. You'll be good. There's too many of",
            "start": 312.4
        },
        {
            "text": "I'll give you a huge heads up and I bet you there's a workaround. Yeah, like the multiplayer games, you know, one by one are gonna go away. Buying games, thank you, fine. You'll be good. There's too many of them out there, too much money to be made. And your trophies will never go. I mean, those exist on a different server. Metro Shade says, hey guys, when you play shooters or any other games, do you invert the Y-axis? I made my friend play Fallout 4 and she's not a gamer at all, but I noticed every time she tried to look up or down, she looked the opposite way. So I inverted it for her and I asked her why she picked it that way and she said she wasn't sure and she was just doing it instinctively. This is weird to me since I've never played with with inverted. So I'm just curious if you guys do, do not, how you got started playing on inverted and if you ever changed. Thanks guys. P.S. I recently found out all of Tim's old videos who did IGN, including the Avengers: Boy Band. Wow, you've all come such a",
            "start": 358.23
        },
        {
            "text": "how you got started playing on inverted and if you ever changed. Thanks guys. P.S. I recently found out all of Tim's old videos who did IGN, including the Avengers: Boy Band. Wow, you've all come such a long way. Not sure about that. It's a lot like being left-handed. Some people are just born wrong and when that happens, you've got to put up with them. I so, I mean, you play inverted. I do playing right. And I feel like nowadays you were definitely like a dying breed when it comes to that. You've never changed. No, right? I like one week or something where it's suddenly you kind of made sense the other way. No, it did make sense either way. Oh, I had like, I had this month, it was when Destiny came out and I'm like, nothing feels right. So it was really weird. I had, I was having a mental breakdown and then I really wasn't there. Holy ****. Like, I don't know how to play anymore. And then suddenly like, just snap back in. Oh my God. What? All right. It was weird. It was weird. I mean, what the ****? It was like really, I",
            "start": 395.01
        },
        {
            "text": "wasn't there. Holy ****. Like, I don't know how to play anymore. Uh-huh. Like something in my brain just doesn't work anymore. I don't know. None of this view. I would invert the, non-invert that, invert. And I'm like, holy ****, nothing feels right. And so it's weird you say that because I had that experience too. And I still do every once in a while where back in the days, so I grew up with GoldenEye and that was like, that's what it was to me. I mean, that's how you moved and that's how things happened. So when I made the switch over to, and I played the **** out of Star Fox. So inverted just made sense then. And also the way you move, the way you would move and, and that just, that's how I liked it then. TimeSplitters came out and one of the default control options played more",
            "start": 436.02
        },
        {
            "text": "inverted just made sense then. And also the way you move, the way you would move and, and that just, that's how I liked it then. TimeSplitters came out and one of the default control options played more similar to that where you would move forward and backward with the left stick and you would aim left and right with the left stick and then you would, wait, no, that's not right. You would strafe with the left stick. So we controlled much more like Star Fox. Got you. Like you, you're going left and right or forward or whatever and you aim and whatever with the right stick. And I'm just like, this is just how things play. So in Halo, I would always have to like use this, I used, I think it was inverted legacy southpaw was the name of it. I'm like, what the **** is that ****? But I had to and I definitely put me at a disadvantage when I played against anybody. And then one day all of a sudden just clicked and I'm like, this doesn't make sense anymore. And then default just made sense. And now I can't do",
            "start": 470.49
        },
        {
            "text": "put me at a disadvantage when I played against anybody. And then one day all of a sudden just clicked and I'm like, this doesn't make sense anymore. And then default just made sense. And now I can't do inverted anymore. Good. So now when I play Star Fox, I'm more like **** confused and ****. But it's weird that it just happened. I don't know. It's not like I trained myself for anything. It just totally snapped. But now when I play third-person action games like Ratchet & Clank, the camera moving the camera like the left and right, it never feels quite how I want it to. Like I feel like my brain every other time switches it up if I hit left, if I want the camera to go this way or this way. Gotcha. I don't know, man. Yeah, the only, so this is my argument. First of all, flight, flight games like Star Fox are flight simulators. They don't make any sense at all playing it unless you're playing an inverted. That doesn't make any **** sense. Like I'm just gonna throw that Rick right out there. Makes note there.",
            "start": 518.64
        },
        {
            "text": "flight simulators. They don't make any sense at all playing it unless you're playing an inverted. That doesn't make any **** sense. Like I'm just gonna throw that Rick right out there. Makes note there is no justification for not playing that. Sorry. That's how you fly a fighter. Exactly. That's always the argument I've had with people where when they're campaigning for inverted, I'm like, when I play it, when I used to play flight Sims in my on my PC and I had a stick, right? Yes, it made sense that I was pulling and doing this in the, in, in the cockpit. You know what I mean? I'm moving this thing. But for me, playing a game around shooting, it makes sense that I just know to look up means up. But like you're about to go into your thing and I want you to do. But then I think I have an answer finally for why it makes sense either way. Well, I'm gonna segment it into two different things. There, a person in first person now, right? The third person. Greg, take this and pretend it's a camera and hold it. Okay. Yeah. Woke",
            "start": 562.11
        },
        {
            "text": "sense either way. Well, I'm gonna segment it into two different things. There, a person in first person now, right? The third person. Greg, take this and pretend it's a camera and hold it. Okay. Yeah. Woke up. Okay, there you go. Look down. Yeah, I mean, that's so like, like you're like for third person, the camera is behind you and for the camera to pitch up, it must be dragged down. Like that makes perfect sense to me. And then, and that's the, it's the first-person argument that gets a little more muddled for everyone, I think. And that's based on how you view the character you're playing. Even if I'm playing a first-person, I do not view the character as me. I view it as camera. So the, so that's where my mentality comes from. Now, I don't have a heritage in flight simulating or anything like that. Like, I don't know why or how I always play like this. But I think what you just said makes sense for me. The way I think the easiest way for me to explain it, right? Because what you're talking about is up and down or",
            "start": 596.58
        },
        {
            "text": "why or how I always play like this. But I think what you just said makes sense for me. The way I think the easiest way for me to explain it, right? Because what you're talking about is up and down or whatever, sticking the back of the head down to look up. And I think that's just the dumbest thing because no one's ever had to stick in their back of that. But that's, but that's the, that's the nature of the way you would play the game. Sure. But what I'm saying is the reason it doesn't work for me and the reason non-inverted makes so much more sense is that I'm not thinking about like tilting up or down. Like I'm broken. I'm thinking about the cursor on the screen. And if I want the cursor to go up, and even if there is no cursor, imagine it that way, right? I'm not even thinking of how I would move my own head or the camera, whatever. I'm thinking about a gun in the hand. I want the gun up and I want the gun down. And it's like a mouse click. And that's the thing is like when, and even with flight",
            "start": 638.64
        },
        {
            "text": "my own head or the camera, whatever. I'm thinking about a gun in the hand. I want the gun up and I want the gun down. And it's like a mouse click. And that's the thing is like when, and even with flight simulators like Star Fox and stuff, you start to think it's just a dual-stick shooter, or not a twin-stick shooter, like a license. Yours are, oh, dual-stick, just like, oh, I get twin-stick shooters. Yeah, twin-stick shooters. Yeah, like then all of a sudden it doesn't matter if it's a spaceship or a person or whatever. It's just there's a thing and there's **** that shoots. Yeah, so you move it and you shoot stuff. And it's just like when you start thinking it that way, then it should just be default because it is just moving things, right? Because there's no politics or whatever. Want a flat, a flat, so you know, Geometry Wars or even Resogun, which is in 3D space, but it is on a flat surface. So that makes sense. Up, up, down, down, left, left, right, right. I mean, that makes perfect sense. But when you get, I understand that I'm in the",
            "start": 670.29
        },
        {
            "text": "even Resogun, which is in 3D space, but it is on a flat surface. So that makes sense. Up, up, down, down, left, left, right, right. I mean, that makes perfect sense. But when you get, I understand that I'm in the minority on this. I mean, there are not many inverted players. Me, it's like one in ten, maybe. You, yes. And but it just makes perfect sense to me. And I don't know why or where it happened, but I can't play the other way. Like Until Dawn is a good example because I'm told I did not have inverted controls. They patched in later. I didn't play the game. So during the shooting segments, I like, when you out of a me, I was like, ****. Like I, I, I couldn't. I really struggled, you know? Yeah, it would've been so easy. I'm gonna just, you know, it was like up in the right. So I would just jack down on the left stick and go that way or whatever. And I, and then I'm like in the other side of the screen. Like, ****, man. Like, I don't know. My brain doesn't work like this. Mm-hmm. I don't know. It would be awesome. What a",
            "start": 707.7
        },
        {
            "text": "and go that way or whatever. And I, and then I'm like in the other side of the screen. Like, ****, man. Like, I don't know. My brain doesn't work like this. Mm-hmm. I don't know. It would be awesome. What a waste of **** academic resources. But it'll be an awesome study to figure out what is caught. There's got to be a common bond between everyone that plays inverted. There has to be. Yeah, it is not, it is not a coincidence because I don't think it's something you necessarily learn. Yeah. Okay. Well, you look at the world. Only other thing with that though, the closest parallel to it in my life has been skateboarding where there's people that you skateboarded, right? So you don't like goofy-footed. Oh, yeah. Whether you're goofy or regular or ****. Yeah, which, which is **** weird. And I do that. Like, it's so weird and it's so bad. And I look like a **** idiot. ****. I don't know. Mongo's when you, you push with your front foot instead of just so bizarre. Oh, yeah. Because the balance, you're not, well, I guess, yeah.",
            "start": 746.32
        },
        {
            "text": "and it's so bad and I look like a **** idiot. ****. I don't know. Mongo's when you, you push with your front foot instead of just so bizarre. Oh, yeah. Because the balance, you're not, well, I guess, yeah. I mean, it just makes sense. The balancing is fine. But the problem then is lean back. The reason that I can't, uh, that I have problems with it is that my, I want to push down with my left foot to like when I'm to jump and ****. So it's like, I don't know, man. Well, the people that, yeah, or the people that be a pusher then swing around, right? Well, it's what I do. Yeah. So that like, so that, yes, so it's swinging forward. And so, yeah, yeah. And I've tried, but the problem is I can't push down with my right foot. Like I feel like when I'm trying to write with my left hand anyways, things, there's definitely, you know, there's definitely, I've known, I skated with a kid that's skated like that. I think that you call him ****. No, I called him Mike. It was weird. I haven't skated since college though. I used to skate all the",
            "start": 783.25
        },
        {
            "text": "definitely. I've known I skated with a kid that's skated like that. I think that you call him ****. No, I called him Mike. It was weird. I haven't skated since college though. I used to skate all the time. That brings back memories. I don't have it in me anymore. God, I had a beautiful Girl deck. I was my last, uh, that was my last deck. Was awesome. Just a sky-blue deck, all **** up from whatever I did to it. It had a UV spray-painted on top of it for Uncle Vito, which was my friend's wannabe skateboard company, which I thought was so funny, which was named after my cousin, Uncle Vito. Okay, you call Uncle because you talk about my documentary. Rated N for 1998 says, greeting and salutations from Algeria. My question is, what do you think of the share button on the PlayStation 4? At first, I thought it was a gimmick, but after taking over a thousand photos, wow, I understand why Sony put this feature. I love it. I use it all the time. Like for me, the big game changer was finally having video for Twitter. Is somebody",
            "start": 831.16
        },
        {
            "text": "but after taking over a thousand photos, wow, I understand why Sony put this feature. I love it. I use it all the time. Like for me, the big game changer was finally having video for Twitter. As somebody who doesn't Facebook, you know what I mean? What I was always doing is getting screenshots. And you look at, I'm gonna toss it via the game of here too. But same idea. But we look at Metal Gear when I was playing under embargo and Persona 4: Dancing All Night when I was playing on her Vita. I took so many screenshots. And then when it was finally up, I could just post them whenever I wanted to or do whatever I wanted to. And now the fact that like I can jump in and show something cool or something broken or whatever with the video in nine seconds. I do all the time. Just did it last night with something. Hmm. For me, it's always an accident. I always hit that button by accident, what's happened? I didn't mean to do that. Yeah, but every time I do that, whatever happens to be like, all that is cool. I would, yeah, like this is",
            "start": 893.18
        },
        {
            "text": "always an accident. I always hit that button by accident, what's happened? I didn't mean to do that. Yeah, but every time I do that, whatever happens to be like, all that is cool. I would, yeah, like this is cool that I can do this. So yeah, it's one of those weird things of like, like I didn't think I'd use it. I thought I'd be using it for Twitch, right? And then we had got into all this stuff and there's more, more professional ways to do Twitch than that. I do it that way, use all stuff. And then the rise of photo modes in games. Like I, I every time I've ever heard of one of my kind, whatever, and you know, big deal. But when they added it to Arkham Knight and I went in with the first the '89 Batman DLC and stuff, went in and started screen out that it's actually fun. You know what I mean? Like camera. Exactly. Final question. No, dude, what do you do? Okay, it's a button. Yeah, like I, I look at the PS4 controller. I study it sometimes. I just stare at it. Sure you do. And I'm like, there's just such a waste of",
            "start": 928.73
        },
        {
            "text": "space like this. This is so unnecessary. Like it would've been cool to have like a few buttons there. Like one would have been shared. But I feel like we're missing a select button and like a menu button or something. I don't know. I just, I hate it sometimes doing it. I'm mistaken. It annoys the **** out of me. Sure. Oh, yeah. Final question. Jason V. says, hey guys, my question is with Battlefront out, I was wondering what you guys think Visceral's Star Wars game is and when do you think it will come out? Oh, it's an Amy Hennig game. So it's a narrative game. I imagine it's heavily story-based. Ryan's story-driven. That's what we're doing. Running through, playing as one person, probably a Jedi. Maybe someone who doesn't know they're a Jedi, but they'll become a Jedi. Mm-hmm. I bet there's a Sith Lord involved. Mm-hmm. I",
            "start": 966.55
        },
        {
            "text": "that's what we're doing running through playing is one person probably a Jedi, maybe someone who doesn't know their agenda but they'll become a Jedi. Mmm, I bet there's a Sith Lord involved. Mm-hmm. I bet there's a bunch of dumb shit aliens that don't make any sense. No one either, no what. Oh, I bet. And when will it come out? Maybe the season pass? Don't. Next Fall 2016. Now E3, yeah. I or this D23 celebration or whatever the fuck they call it. D23, isn't it? What is it? D23, yeah. What is that? Oh, it's after, after. Okay, so now I wouldn't be done. They need to give it some space. I think that would be something to EA's conference. Do you think it'll come out in the Fall? Yeah, although maybe Spring. Although here we go, it doesn't make any sense and like with with Mass Effect coming out at the same time for sure that's weird. I don't actually know. I don't know, maybe Spring 2017. They got a shit-or-get-off-the-pot with that game though because you know the fucking zeitgeist is moving Star",
            "start": 1013.63
        },
        {
            "text": "the same time for sure that's weird. I don't actually know. I don't know, maybe Spring 2017. They got a shit-or-get-off-the-pot with that game though because you know the fucking zeitgeist is moving Star Wars. Yeah, motion and no, but there's here's the thing is in their Star Wars movie every Fall now. Well, it's more than that. So next next year, this year we get Episode VII. Yeah, next Fall we get Rogue One. Yeah, next the May after that is Episode VIII. Oh, fuck. Okay, well, okay, interesting. But I figure, see this is interesting with a Mass Effect wrinkle. Yeah, it doesn't make it what do they do with have they been somebody been saying have they been stressing Mass Effect 2016 or is that they said three but I don't know one of those games has. Well, not one of the we don't know what the fuck the Star Wars games coming up in Andromeda is supposed to be 2016. See, I think it makes sense if your Rogue One's next Fall, the same thing. Yeah, see when you want to say stay in the same time schedule have a",
            "start": 1056.56
        },
        {
            "text": "Wars games coming up in Andromeda is supposed to be 2016. See, I think it makes sense if your Rogue One's next Fall, the same thing. Yeah, see when you want to say stay in the same time schedule have a bet where Battlefront was, insert the Star Wars game, move Mass Effect, wait for the Spring. But to Tim's point, if Episode VIII comes out Spring 2018, no, 2017, then they can fit it in that March or so in between them, in between Rogue One and Episode VIII. I do think that they cannot release those games at the same time. I think it's a bad idea. They're going to cannibalize aspect. Do they do that space design of space for both of them? And they what they do need the shit-or-get-off-the-pot because Visceral needs to probably make another one quickly, you know. So 2017 is the Episode VIII. Yeah. Yes, ladies and gentlemen, that topic brought to you by Loot Crate. Would you classify yourself as a geek, gamer, or a pop-culture nerd? I would. Good. Then this is the subscription box for you, Greg. For less than $20 a month, you get six",
            "start": 1100.0
        },
        {
            "text": "topic brought to you by Loot Crate. Would you classify yourself as a geek, gamer, or a pop-culture nerd? I would. Good. Then this is the subscription box for you, Greg. For less than $20 a month, you get six great items of gamer and pop-culture licensed geek gear. While they left out geek, so it threw me off. Gear, apparel, and collectibles, unique one-of-a-kind items and more. Make sure to head to LootCrate.com/KFGames and enter code KFGames to save three dollars on any new subscription. Not that long ago, and depending on where you live, not so far away, Loot Crate blasted off into a voyage across the galaxy, searching the far reaches of space to find universally awesome gear. Using December's Star Wars: The Force Awakens loot as the launch pad, we I love this. I love whoever wrote this. This is so good. Letting on some equally cosmic items from Halo 5 and more. When the exclusive Funko Pop! and an exclusive shirt in this month's crate, this is the loot that you're looking for. Basically, Loot Crate's like a",
            "start": 1141.36
        },
        {
            "text": "on some equally cosmic items from Halo 5 and more. When the exclusive Funko Pop! and an exclusive shirt in this month's crate, this is the loot that you're looking for. Basically, Loot Crate's like a friend named Jack who knows who you love and surprises you with an awesome present every month. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. When the cutoff happens, that's it. It's over, Jack. So go to LootCrate.com/KFGames and enter code KFGames to save $3 on your new subscription today. Build-It, Jack! Beautiful. Thank you guys for joining me. Thank you on this beautiful, beautiful journey. Big, beautiful, Kinda Funny!",
            "start": 1181.26
        }
    ]
}