{
    "id": 1419,
    "video_id": "klyX8_preRQ",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Colin Moriarty",
        "Shannon Studstill"
    ],
    "title": "Sony Santa Monica's XDEV Roots With Shannon Studstill - PS I Love You XOXO",
    "description": "Sony Santa Monica may be best-known for God of War, but dozens of games have been developed with the studio's help. The lead of Sony Santa Monica sat down with us to discuss. (Released 12.16.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/kindafunnyvids\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1450285201,
    "duration": 614,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, welcome back to Kinda Funny Games. Of course, I'm Colin Moriarty, joined here by head of Sony Santa Monica, Shannon Studstill. We were just talking, we haven't talked in a while, so we have many questions to ask. Are you having a good PSX so far? I love this show. It's one of the best things Sony's done. I agree. It's fun to see all the fans, uh, and get down to those games. So let's talk about the games. I'm seeing the Santa Monica logo splashed on many different things. You guys have been developing and incubating a lot of games that are not God of War related, uh, not AAA. Um, so tell me a little bit about what's going on down there at the studio right now. We've, uh, we've partnered with a lot of great Indie teams and, you know, the the process of developing and supporting a vision is always, uh, something that's been top of mind since the studio's inception with Allan Becker, um, and giving those young talent that, you know, the the teams that we see out there opportunities to develop",
            "start": 0.5
        },
        {
            "text": "always, uh, something that's been top of mind since the studio's inception with Allan Becker, um, and giving those young talent that, you know, the the teams that we see out there opportunities to develop and create is, uh, part of the heart of the studio and, uh, the diverse lineup that we've seen over many years. You know, you go into the heart of the studio, which I call the magnet room. We've got, you know, 35 plus titles in there and, uh, that's something to really be proud of. If you look at the landscape of the industry today, uh, that all of that coming under the umbrella of Sony Santa Monica, it's something we're all very proud of. What you you talked about kind of the heart of the studio, you guys just recently moved. I haven't even been to your new studio yet at all to come by. Um, how how is that space? Is that space like helping your guys' energy and and kind of the, you know, our old facility was was tiny and it it helped a lot because you're you work so closely knit with somebody sitting right next to",
            "start": 56.24
        },
        {
            "text": "that space like helping your guys' energy and and kind of the, you know, our old facility was was tiny and it it helped a lot because you're you work so closely knit with somebody sitting right next to them is great, uh, but we were so tight, uh, in in terms of, you know, a number of people inside the facility. So, uh, we've put a lot of time and effort into our our new home and I think it really represents the brand, uh, the passion and the creativity, really trying to turn it into a a kind of an art gallery vibe space. You know, the the lobby and you should come by. We'll, uh, have a good time doing a little tour. We have tours all the time. So, uh, we'll have an exclusive opportunity for you to come in and see. I appreciate that. Yeah, it's been a long time. You were talking about the kind of the heart of the studio and and, you know, you guys have a lot of production going on. We were talking about with, you know, Giant Sparrow for instance, and some smaller games, you know, Zach Wood working on Hohokum, all these kinds",
            "start": 100.84
        },
        {
            "text": "and and, you know, you guys have a lot of production going on. We were talking about with, you know, Giant Sparrow for instance, and some smaller games, you know, Zach Wood working on Hohokum, all these kinds of things. Is the spirit of the studio morphing more into an XDEV kind of production house and you guys still want to have AAA bonafides there as well? That, you know, those kind of those keystones, those those keystones in your in your cycle every few years, is that still something you want for sure? Absolutely. I mean, I think that really allows us to do a lot of exploration in the Indie space, um, and give the support and, you know, there's a share of knowledge that goes along with the opportunity to have some of these guys kind of incubated in our space with veteran level talent. So that, uh, synergy, if you will, is really powerful that they're they're really, uh, taking opportunities to learn how to solve problems from people who have done that before in some cases. So, um, there's a really cross, a good cross",
            "start": 146.52
        },
        {
            "text": "is really powerful that they're they're really, uh, taking opportunities to learn how to solve problems from people who have done that before in some cases. So, um, there's a really cross, a good cross network of not only gleaning great info from veteran, but we learn from them as well. You know, that back and forth is, uh, really given the studio a leg up, we we feel like. And a lot of the talent that actually works on our AAA, uh, side of the business want, they want to extend and give as much as they can to some of these startups. So it's a really good back and forth. Uh, I asked Scott Rohde when I was talking, obviously, is kind of shepherding, uh, Sony's first parties in America, how the the A team like Bend Studio would, you know, uh, pitch a game. And I'm curious now at Santa Monica, how do how do you guys find the pitches for these smaller games? Are you are people coming to you? Are you guys kind of sending out like scouts to figure out what who you want to work with next? It goes both ways, um, and, you know, places like",
            "start": 189.08
        },
        {
            "text": "for these smaller games. Are you are people coming to you? Are you guys kind of sending out like scouts to figure out what who you want to work with next? It goes both ways, um, and, you know, places like E3 and PSX and D.I.C.E. I mean, there's so many good opportunities out there and Dev teams that are really bringing the passion to what we what we love. Um, they come to us and we also go to teams that we're interested in. Uh, also the the schools out there, they're really doing a lot for, uh, gaming as a whole. So we find there's little gems within, uh, variety of, uh, the schools that are developing these great programs that, uh, we kind of reach into and develop partnerships with. That's how you guys found Giant Sparrow, right? Is that is that true? Yes, and that game company. Yeah, so pretty good track record in that in that respect so far. Let's talk about Giant Sparrow. They're internal, I think, still right at your studio when I was hanging out with us. How's how's that relationship going? Because I find them",
            "start": 237.96
        },
        {
            "text": "that in that respect so far. Let's talk about Giant Sparrow. They're internal, I think, still right at your studio when I was hanging out with us. How's how's that relationship going? Because I find them really, they're small team and I find them really fascinating. I I absolutely loved their last game and I'm excited about Edith Finch. Um, so what is it like working with a small kind of young team like that? You know, again, the energy that they bring, it's just you walk upstairs. XDEV is pretty much situated right. Want some crackers? Thank you. That was awesome. All, uh, right next to Giant Sparrow and, uh, the the, you know, every time I walk by there, those guys are just, you know, it's like a a party in terms of the amount of passion that they pour in and surround, uh, Ian with, uh, really fortunate in in terms of the, uh, the concept of being able to have P our old home, Penn Station. We didn't have a lot of room for some of these incubated teams and now we do. We have two teams with us at this point. So, uh, to work",
            "start": 281.68
        },
        {
            "text": "the, uh, the concept of being able to have P our old home, Penn Station. We didn't have a lot of room for some of these incubated teams and now we do. We have two teams with us at this point. So, uh, to work along alongside and it just brings the spirits of everybody up and the creativity is, uh, you know, boundless at that point. How do you manage, you know, as the leader of the studio, how do you manage the obviously the AAA stuff you probably be working on with the smaller projects? You have to kind of delegate, um, between a bunch of producers and and is that a difficult kind of task? Because you think about Naughty Dog working on one, maybe two games at a time. It seems like you guys have you had, you know, dozens. It's, uh, you know, I come from production as you probably know and being kind of that far removed is difficult. Um, my heart's always ground level with the creatives making great product. I think having the XDEV group and the incubated team's ground level is, uh, it it adds a whole another",
            "start": 331.36
        },
        {
            "text": "far removed is difficult. Um, my heart's always ground level with the creatives making great product. I think having the XDEV group and the incubated team's ground level is, uh, it it adds a whole another dimension into the job of what I do on a day-to-day basis that really brings me closer to it, you know, because there's a lot more action, there's a lot more, um, sort of dialogue going on day-to-day in terms of the diversity of the production challenges or successes or little little wins. So I I really enjoy it and to watch these young creatives blossom is also another thing that you don't necessarily see as much as you would might want to on the bigger AAA. And, um, you know, there they're, I mean, you see it here, they're what they're producing is standout. Yeah, it's awesome. Is there a is there a fear when you get involved with some of these younger, more inexperienced teams though that you kind of have to again shepherd them in a direction or or do you guys kind of find the the teams that you think",
            "start": 373.48
        },
        {
            "text": "you get involved with some of these younger, more inexperienced teams though that you kind of have to again shepherd them in a direction or or do you guys kind of find the the teams that you think, you know, they can teach us something, we can teach them something and they kind of just let them go and you you seem to have a pretty good eye for that. Yeah, you know, every team, even the veteran level groups have challenges. Um, I think what we're looking for are partners that can listen, right? Listen and take in feedback. And, you know, we really respect the fact that they have their own identity, they are their own business, their own creative entity. Um, but we want people that can really, uh, you know, traverse the journey as a partner to all the challenges that are going to inevitably roll roll out through a six-month to a year dialogue around creating something from nothing. So, um, often times I think we've been pretty good at pegging those teams that are willing to, uh, engage in that partnership and",
            "start": 425.12
        },
        {
            "text": "a six-month to a year dialogue around creating something from nothing. So, um, often times I think we've been pretty good at pegging those teams that are willing to, uh, engage in that partnership and, uh, and, uh, um, uh, you know, we look forward to continuing along that, uh, you know, process of elimination, basically. Let's talk before I let you go about some of the specifics. We're kind of talking more broadly. We talked about Edith Finch a little bit. What are some of the games that we can expect from Santa Monica in the next year or so that you guys have announced? Well, I think we're always looking for opportunities to broaden the portfolio a little bit and that's really where we're spending a lot of our cycles. Chunny and Dead Mars and everybody who's in there right now, we're really out there looking at the landscape of gaming, what people are up to. And of course, it's ever changing, right? So there's always that challenge of what's that new blip on the radar that we want to capture and get ahead on. Um,",
            "start": 468.6
        },
        {
            "text": "the landscape of gaming, what people are up to. And of course, it's ever changing, right? So there's always that challenge of what's that new blip on the radar that we want to capture and get ahead on. Um, I think you're going to be pretty excited to see some of the lineup that we have in there and, um, you know, some of the stuff that we're going to think about bringing into the fold over the course of the next year or two. Awesome. Well, it was good to see something, uh, like Fat Princess come back. Escape Plan would be nice to see again. Big fan of I love excellent. And Dead Mars is, you know, you know, so excellent. Uh, obviously congratulations too on, uh, uh, Rapture, which came out this summer, which, you know, I I played it one night long, like just exploring and getting into this game. Then I had to go on vacation for like two weeks and I came back and I'm like, I don't know what the hell I was doing. And I got to start it again. I'm like, I don't have almost the heart to. It's it's like almost like the way I feel",
            "start": 512.84
        },
        {
            "text": "for like two weeks and I came back and I'm like, I don't know what the hell I was doing. And I got to start it again. I'm like, I don't have almost the heart to. It's it's like almost like the way I feel about Journey. When I played Journey, I played it once, made me cry like a baby. And then I was like, I can't play this again. And it's almost like with Rapture, I'm like, I got to back to the beginning to see the end. So that's good. You'll see new stuff. That's the beauty of Rapture. Excellent game, uh, really pretty too. Uh, shout. I'll let you go. But thank you so much for joining me. Great to be here. Uh, I appreciate you very much. I I we'll have to come down like you said, Santa Monica to see. Yeah. Um, and, uh, of course, you should stay tuned for Kinda Funny Games more here. PSX. Goodbye. Great.",
            "start": 556.64
        }
    ]
}