{
    "id": 1447,
    "video_id": "KQrw7oGnwP0",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How Nick Scarpino Ruined Star Wars - The GameOverGreggy Show Ep. 108 (Pt. 1)",
    "description": "Tim Gettys tells the story of how Nick Scarpino ruined Star Wars.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1451289600,
    "duration": 1573,
    "transcript_chunks": [
        {
            "text": "This episode is brought to you by Loot Crate. Would you classify yourself as a geek, gamer, or a pop culture nerd? Then this is a subscription box for you. For less than $20 a month, you get six to eight items of gamer and pop culture licensed gear, apparel, collectibles, unique one-of-a-kind items, and more. Make sure you head to LootCrate.com/KindaFunny and enter the offer code KindaFunny to save $3 on any new subscription. Not that long ago, and depending on where you live, not so far away, Loot Crate blasted off into a voyage across the galaxy, galaxy, galaxy, searching the far reaches of space to find universally awesome gear. Using December's Star Wars: The Force Awakens loot as a launchpad, we landed on some equally cosmic items from Halo 5 and more with an exclusive Funko Pop and an exclusive shirt in this month's crate. This is the loot you're looking for. Basically, Loot Crate is like a friend that knows you and loves you and surprises you with an awesome present every month. You have until the",
            "start": 0.12
        },
        {
            "text": "in this month's crate. This is the loot you're looking for. Basically, Loot Crate is like a friend that knows you and loves you and surprises you with an awesome present every month. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cutoff happens, Jack, that's it, it's over. So go to LootCrate.com/KindaFunny and enter the offer code KindaFunny to save $3 on your new subscription today. What's up, everybody? Welcome to The GameOverGreggy Show. I am one of your hosts, Greg Miller, alongside the producer/seducer in the middle seat, Nick Scarpino. Today is vexing Greg over there. That's the P and Tim Gettys. Let's talk about what's vexing you. I called an audible. Is that not enough for you? Sorry, you seem depressed. Okay, good. I called an audible and I was like, you know what? I'm going to try to find some tickets to see Star Wars tonight with you fine gentlemen. Now, I knew I'm not going to be able to go to your showing because it's all sold",
            "start": 40.12
        },
        {
            "text": "and I was like, you know what? I'm going to try to find some tickets to see Star Wars tonight with you fine gentlemen. Now, I knew I'm not going to be able to go to your showing because it's all sold out. Timeout for those watching at home, this is, we are recording this before, this is the last thing we're going to record, and then us three, Kevin, Tim, and me, will go to line up for Star Wars. We haven't seen Star Wars yet. Yeah. Now, the conundrum was that they're going to see the 3D showing, and I don't want to see the 3D showing. So I'm waiting till my friend to see some, uh, the showing tomorrow with my friends in 2D. But I can't wait anymore. So I've decided that I'm going to go and get some tickets. Now, in typical Nick Scarpino fashion, it's the world's fault that I can't get tickets, not mine. It's Fandango's fault. It wasn't me talking to you for the past year. Fandango, well, chill. If you a real friend, you would have seen it in 2D. I'm just putting it out there. If you were a fan of cinema and",
            "start": 97.4
        },
        {
            "text": "Fandango's fault. It wasn't me talking to you for the past year. Fandango, well, chill. If you a real friend, you would have seen it in 2D. I'm just putting it out there. If you were a fan of cinema and movies, supposed to be in IMAX, and I can't. So I'm more **** than anyone on this. That's fair. You see on question. Anyway, I spent the better part of the last 30 minutes trying to buy tickets on Fandango, and then I got really pissed at Fandango, and then Tim reminded me that I have no one to blame but myself. And it's true, but no one wants to hear that when you're pissed off. You just want to rage against something else and then quietly come to the fact, come to terms with the fact that you **** up. Yeah, I mean, it's all good. What I really love more than anything is the fact that obviously Star Wars has taken over. All that the days led up to the release of Star Wars, we have made more content for this channel than we ever have in terms of shows that are coming out in the future. So for the next",
            "start": 135.44
        },
        {
            "text": "Wars has taken over. All that the days led up to the release of Star Wars, we have made more content for this channel than we ever have in terms of shows that are coming out in the future. So for the next months are going to almost seeing Star, almost seeing Star Wars. True, it's very true. But this is your last chance to talk about it and like the feelings you're going through and your emotions, right? So what is the current plan, Nick, for you? You're coming with us to the mall? I'm going to go with you guys to the mall. It's on, it says there's tickets available for some showings. Now, the problem is this, you guys are going to do a reacts after you see it, come straight home tonight, and I would like to very much be a part of that. Um, obviously not enough to, uh, get off my ass and buy tickets anywhere from the literally weeks or months leading up to this. Um, but now I'm, I'm getting the, I'm like, you know what? I'm feeling the juice, I'm feeling the energy, be a part of this here. The same problem is so like you",
            "start": 179.0
        },
        {
            "text": "literally weeks or months leading up to this. Um, but now I'm, I'm getting the, I'm like, you know what? I'm feeling the juice, I'm feeling the energy, be a part of this here. The same problem is so like you still haven't given up the 3D hill though, right? That's your problem. No, I will not give up the 3D hill. I will not see this in, you're vexing yourself. You, I will gladly give you my ticket to this showing to go watch it tonight, but you hate 3D. What I would, yeah, like you can get a ticket for this movie. Won't do, won't do. I can get a ticket. I get a ticket in 2D, but I, I just have to go to the theater now and figure it out. The issue is you guys don't care about cinema. True. You don't care. You're going to watch it in one of the shitty side theaters. Watch it on a 5-inch screen than see it in IMAX and 3D. I'd rather watch it the back shot in IMAX. Parts of it are shot in IMAX. Okay, parts of it, that's fine. IMAX is fine, but it's not shot in 3D. Now, when I saw Interstellar in IMAX, that had a point. Parts were",
            "start": 220.68
        },
        {
            "text": "rather watch it the back shot in IMAX. Parts of it are shot in IMAX. Okay, parts of it, that's fine. IMAX is fine, but it's not shot in 3D. Now, when I saw Interstellar in IMAX, that had a point. Parts were shot in IMAX. It was a great experience. I have no doubt the Star Wars IMAX experience would have been great had it not been **** forced, pigeonholed, like just shoehorn 3D into it. I used all my terms there. I got to, I like, know you're doing it, you're laying it out. I'm not, the 3D is not going to be expertly done in this. Oh, I'm sure it will be, but I don't need it. I know you don't need it, but at this point, it's not a question of need, it's a question of, are you seeing this movie now or not? I'm going to see tomorrow, probably. All right, seeing it tomorrow. You're still coming to the mall tonight? I'm going to try to come to the mall tonight and see it. I'm going to see if Colin, because Colin made a big kerfuffle about how he was going to get these 2D glasses, right? That would then convert the 3D to 2D. I don't think",
            "start": 268.16
        },
        {
            "text": "to come to the mall tonight and see it. I'm going to see if Colin, because Colin made a big kerfuffle about how he was going to get these 2D glasses, right? That would then convert the 3D to 2D. I don't think he did. So I think what right now in his brain, he's probably just resolved to seeing in 3D. So if I can get a ticket to a 2D showing, I think he'll be more than happy to go with me. Now, if he can't, I will gladly give it away to anyone in line that needs a ticket. Any, anyone else in line? Okay, okay. I'll call, I'll call down the roster. I got a few other people that I know aren't, it's not going to be hard to get people to watch Star Wars. Like I'm sure if I called Finan, I was like, hey, I'm going to the A1 show. Be like, all right, I'm there. Yeah, even though we've seen it twice. There's a lot of options. Um, you know, one thing though, and this sounds like a stretch, but it's a possibility. The theater might have 3D glasses that turn him into 2D. No way. No chance. You sure? Because I mean, there's people that have like",
            "start": 311.6
        },
        {
            "text": "one thing though, and this sounds like a stretch, but it's a possibility. The theater might have 3D glasses that turn him into 2D. No way. No chance. You sure? Because I mean, there's people that have like possibility. It's possibility, but like disability. I've been fantasizing about how this whole thing is going to go down for me for a while. Um, in my fantasy, I wait in line for a while. Everyone's very nice and cordial. It's not hot. There's no smell factor that needs to be factored in, of course. Uh, I send a small strike team out to get seats. I approve the seats, and then I go and get popcorn. Now, when I say popcorn, I mean the biggest. I want a tub of popcorn that can't even fit down the row. Okay, someone has to crane like **** forklift that thing into me or like crane it into me. I want a giant Diet Soda that I can swim in, that I can bathe in, just exist in, just stay in there for a while floating and have to pee like 10 times during the movie. Exactly. I want to pee about three to four times, because",
            "start": 350.56
        },
        {
            "text": "soda that I can swim in, that I can bathe in, just exist in, just stay in there for a while floating and have to pee like 10 times during the movie. Exactly. I want to pee about three to four times, because remember, there's like 100 trailers before this movie. Oh, no, I'll be, I'll have to pee before the trailers are done, hands down. Mhm. Uh, then I also want some sort of chocolate and or chocolate mints. Are you going to mix them into the popcorn like you always talk about? No, no, that's my wife's jam, and this is my experience. Great. This is my fantasy. First off, **** you, because you've said on this show before, you've run through your Diet Coke thing. Every out there, go ahead and get the link and put it in the comments below where you talk about if you're getting crazy, you put in there. You've never mentioned your wife before. So if you are misrepresenting yourself in your theater snack problems, that's you, not me. Um, first off, **** you. I think you're lying. I've never said that before in my life. You've never",
            "start": 395.92
        },
        {
            "text": "wife before. So if you are misrepresenting yourself in your theater snack problems, that's you, not me. Um, first off, **** you. I think you're lying. I've never said that before in my life. You've never told this story before. ****, there's not a single thing said on this show that has been said more times than Nick's popcorn. I'm giant Diet Coke. I'm going to get a big popcorn. I might get a king-sized Reese's Peanut Butter Cup. Okay, I might get some Sour Patch Kids just to balance out the salty and the sweet with a little sour. I got it. Um, I might also get some Junior Mints. And if I get the Junior Mints, I will conceivably mix them with the popcorn. But the problem is the popcorn that I'm going to get so big, I'd have to get three boxes of Junior Mints to get the ratio correct. I don't want to **** with that. I don't want ****. When fantasy did you buy the tickets? Because it didn't happen somewhere along the lines. I don't know why we, we talked about it. It came up and we were all buying tickets",
            "start": 429.24
        },
        {
            "text": "with that. I don't want ****. When fantasy did you buy the tickets? Because it didn't happen somewhere along the lines. I don't know why we, we talked about it. It came up and we were all buying tickets together. You bought all the tickets and I just, I blanked. I didn't happen. That didn't happen. No, because I'm the only **** responsible adult when it comes to this ****. And I'm like, I need to **** make this happen because no one else is going to do it. Colin? Am I going to leave this to Colin? At no point did you say to me, Nick, what showing do you want to go to? Because that wasn't Nick. You don't understand. I was, it's hilarious. It's hilarious. It really is. He can't, he's going to get it. He'll get it. But he's banging his head in between the door and the lightstand right now to try to open the door. But he does opposable thumbs. There he goes. He's, he's stuck. He got it. He's stuck. It's done. All right. No, so the, it was like, it was hell on Earth at that, at that moment where Monday Night Football happens and",
            "start": 473.2
        },
        {
            "text": "does opposable thumbs. There he goes. He's, he's stuck. He got it. He's stuck. It's done. All right. No, so the, it was like, it was hell on Earth at that, at that moment where Monday Night Football happens and it's like, all right, we're getting the trailer. And after the trailer releases, that means then the tickets go on sale. Yeah, right. That's not how the internet works. Have any of us been there at PSX when the, the PlayStation thing went us up? We know it's **** chaos. We know that things just happen willy-nilly. So who was sitting there refreshing that Fandango? Me, Nick. I was refreshing that Fandango. Who wanted the IMAX screening more than anyone in the goddamn world? Me. Who didn't get it? Me. This isn't a, hey, hey, Nick, hey, which showing is best for you? Hey, is your wife going to come? This is no, this is a **** make or break. I'm buying as many goddamn tickets as I can for whatever **** showing I can get as early as goddamn possible. And that's what I did. And yet instead of, thank you, Kevin. Thank you. Instead",
            "start": 512.28
        },
        {
            "text": "make or break. I'm buying as many goddamn tickets as I can for whatever **** showing I can get as early as goddamn possible. And that's what I did. And yet instead of, thank you, Kevin. Thank you. Instead of consulting me first as one of your best friends on the planet, you just went ahead and bought 3D. Now you've heard me say how much I, now here's the thing. I want to stop. I want to stop you in your tracks right now is I haven't enjoyed how you've been spinning this tale the entire day that this is somehow Tim's fault that he, that we didn't get, you didn't get. It's not Tim's fault. No, I should have taken responsibility and gotten and taken the reign on this and gotten a 2D. The 2D 7:00 p.m. showing sold out, but there's 2D 8:00 p.m. showing and an 8:15 and an 8:45. Do not see the problem here, Nick. No, I don't see the problem. We're on the, I just don't even understand this. This is, who are these people? Who are you? Who are you? Who are you? That's moving. Really what it boils down to is you guys just need to do",
            "start": 553.32
        },
        {
            "text": "see the problem. We're on the, I just don't even understand this. This is, who are these people? Who are you? Who are you? Who are you? That's moving. Really what it boils down to is you guys just need to do the reacts tomorrow night and then I'll join you. No one will, no one will care then. No one will care. No, no one will care. I say there's at least 30 to 40,000 views on the line of doing it today versus tomorrow. Guaranteed. He knows it's true. Know to search feelings, Nick. Not true. I just don't like how you've been throwing Tim under the bus about this. I think Tim did. I'm just, I'm just pointing out the inconsistencies in his story. Okay. Yeah. I want to thank you. Thank you, Kevin. No worries. Thank you. Because, well, Nick, I want you to know if you, the, the math doesn't add up simply because, all right, I got the tickets. I got the first showing. So that much is good. Is it IMAX? Uh-uh. So that upsets me dearly. And it's at Tanforan, the **** anus of America. Yeah, I'm just saying this, you could have put in a little",
            "start": 596.72
        },
        {
            "text": "tickets. I got the first showing. So that much is good. Is it IMAX? Uh-uh. So that upsets me dearly. And it's at Tanforan, the **** anus of America. Yeah, I'm just saying this, you could have put in a little extra effort to get 2D. That's all I'm saying. That's all I'm saying. Here's what I'll, this is, you didn't take my feelings into consideration. You can tell the person who cares about movies. What I will say is this is, you can tell that this wasn't a Tim and Greg job. You know what I mean? Because when Batman v Superman tickets are about to go on sale, I'm, every one of you is on Fandango at the kitchen table with me and we're all hitting up different theaters and doing this. I feel bad that I got placed on Tim's shoulders alone because again, Colin's not going to do anything. You're not going to do anything. Kevin would **** talk to his watch and buy tickets to Santa Maria. I didn't even know tickets were on sale. Play and flag to Santa Maria. I didn't have to worry. Yeah, I know you didn't. No, so yeah,",
            "start": 642.2
        },
        {
            "text": "Kevin would **** talk to his watch and buy tickets to Santa Maria. I didn't even know tickets were on sale. Play and flag to Santa Maria. I didn't have to worry. Yeah, I know you didn't. No, so yeah, that's my, my biggest thing about this is we didn't see this movie **** early. What we, we're not down. What have I worked my whole life? We're not down LA. Maybe next year. Garbage. This is garbage. No, in all seriousness, I do appreciate you getting the tickets and I did **** this up. I **** this up. Here's my problem. I can't keep the charade up anymore. Yeah, okay. I **** up. The biggest thing is I've been trying to help you along the way. You did. You did multiple times. And because, because I'm going to buy you a 2D **** screening because I have and you said no. Because I have the tickets already. I was like, I'm good. I'm just going to, I'm not going to make this kerfuffle because I knew it was going to be stressful and I didn't want to stress everyone out. And in doing so, and not trying, in trying to not stress",
            "start": 684.72
        },
        {
            "text": "I'm good. I'm just going to, I'm not going to make this kerfuffle because I knew it was going to be stressful and I didn't want to stress everyone out. And in doing so, and not trying, in trying to not stress everyone out, I am stressing people that way more. This is my life. Yeah, this, I hope you realize what you're doing to me with this. I'm tearing you apart. You're, yeah, you're breaking my heart. You're breaking my heart. So, so look, look what I'm, what I, my lineup now. Mhm. Of who I'm going to go see Star Wars Episode VII with. Okay. MH. All right. M. We got Kevin who's already **** seen it. So I already lost my chance to spend, you know, that, that, that two hours and two and a half hours with one of my goddamn best friends. We've dreamed of the Star Wars conversations, the, these things happening. I, I'm not seeing it with him for the first time. So that's **** done. Fu. I'm going with my girlfriend. **** up. Mhm. No, he didn't **** up. He **** up. I'm going with my girlfriend who, that's **** awesome. Great. She",
            "start": 726.28
        },
        {
            "text": "it with him for the first time. So that's **** done. Fu. I'm going with my girlfriend. **** up. Mhm. No, he didn't **** up. He **** up. I'm going with my girlfriend who, that's **** awesome. Great. She just watched Star Wars for the first time a couple weeks ago. I'm really excited for her. She's going to have a great old time. But all right, all right. Awesome time for her though. As a side note, as a side note, could you imagine if you just watched Star Wars and you're like, oh, another movie's coming out? Yeah, I know. It's no, there's, it doesn't matter as much. It's true. Then we got Greg and Styer who I'm going to put Styer in the same bat as you. I'm not sure what her, where her allegiances lie on this. But okay. But Greg doesn't care. Greg, Greg's in it for the, Greg's in it for, I like, I think that's the thing. We like it fine. Greg, Greg likes Star Wars in the same way that I like X-Men movies. Like it's like, cool, I'm into this. I like this, but I'm not like, right? So it's like, all right, cool. And then there's",
            "start": 769.8
        },
        {
            "text": "Colin who there is a 99.9% chance Colin's going to leave that movie upset about it or thinking it's all right, no matter, no matter what the movie is. Now I'm hoping we get new Colin seeing this movie. Not, yeah, you're going to get happy Colin. No, I know, I know we get. But it's Star Wars and it's all this stuff, right? I, I don't care about the quality of this movie. I'm going to leave this theater **** stoked and excited and I want people around me to be stoked and **** excited. MH. Mhm. Mhm. And you're **** leaving me. That could be you, Nick. This is, this is the real problem you're having with the situation is you don't even understand because I'm stressed out and upset because if he takes Colin, then yes, you've lost your only Super Fan to watch this with, to react with afterwards. And if you take, if he",
            "start": 801.56
        },
        {
            "text": "is, you don't even understand because I'm stressed out and upset because if he takes Colin, then yes, you've lost your only Super Fan to watch this with, to react with afterwards. And if you take, if he takes Colin, I'm going to try to go to that AMC IMAX showing and have the reserve seat and everything else because I was all part of it to be part of the group. But if the group's ****, that scene's gone. That, that, that, that thing, gone the bit. If, here's the, my God, if this ends up, do someone else in my group is seeing the **** IMAX show and it's not me, I'll be **** so upset. I got to imagine the tickets are gone. Don't worry about it. Yeah, what's up, Kevin? You, you're raising your hand. What was the topic? We're not there. We're not at the topic yet. We haven't even started the show. It's just our normal thing. This just how we start the show. If you didn't know, ladies and gentlemen, this is The GameOverGreggy Show. Each and every week, four, sometimes five best friends gather on this table. Each bring a random topic",
            "start": 846.4
        },
        {
            "text": "just how we start the show. If you didn't know, ladies and gentlemen, this is The GameOverGreggy Show. Each and every week, four, sometimes five best friends gather on this table. Each bring a random topic discussion for your amusement. If you, you like that, head over to Patreon.com/KindaFunny where you can toss us a few bucks and get every episode early along with a whole bunch of exclusives and cool parts. If you have no bucks to toss, no big deal. Head over to YouTube.com/KindaFunny where we post The GameOverGreggy Show topic by topic, day by day until the entire thing goes up on Friday as one big MP3 and video. We can make this the topic. This could be one of the topics. You more to say about it? I mean, I feel like we do. I feel like we talked about. I feel like Star Wars regrets is, Star Wars regrets is a pretty good one. I also have the internet right now scouring to find the clip of you saying **** putting your candy into your **** popcorn, you lying sack of ****. I, I'm going to go on a limb",
            "start": 887.44
        },
        {
            "text": "is a pretty good one. I also have the internet right now scouring to find the clip of you saying **** putting your candy into your **** popcorn, you lying sack of ****. I, I'm going to go on a limb and say I didn't say it like that. What I said was my wife likes, am I crazy? My wife likes to put the Junior Mints in there and I go along with it. Have I been taking crazy pills? What episode is this, Kevin? I think you just get 108 weeks. I think you just get really creative with your memory and it's not, it's fun. It's, it's, it's because you're getting old and you're getting dementia. Damn, he's the one getting early onset Alzheimer's in your 30s. My friends, look at that rock. Don't move for nobody. Don't do anything for it. Boulder don't move for nobody. I, I, I shouldn't be as upset and stressed and frazzled if you be quite frank, back on board and you have fun and you talk to me because that's the other thing. You and Kevin, when you're together, don't talk to me. Gia doesn't talk, talk to me. Yes, she does. If no",
            "start": 924.64
        },
        {
            "text": "if you be quite frank, back on board and you have fun and you talk to me because that's the other thing. You and Kevin, when you're together, don't talk to me. Gia doesn't talk, talk to me. Yes, she does. If no one talks to me while I'm sitting in line playing my **** games, going to be trouble. We're going to be playing the same game together. I didn't even bring games. I'm in it just to talk to. Let me ask you this question. If I can somehow get seven tickets, no, to the 2D showing at 8:15, no, will you take yours back and go with me at 8:15? Absolutely not. Like he doesn't want to wait that. Here's the thing. I'm not waiting an hour and 15 minutes more than I need to. And on top of that, not watching this movie in some shitty **** theater with shitty sound. First of all, it's ETX. Second of all, you understand it's ETX. It's the Extreme Theater Extreme. Second of all, the Tanforan, I think it was, be wrong. It, no, it's not. It could be Tanforan. No, Tanforan's 2D things are not. It's Century. It's Century. Oh, Century. Yeah, it's Cinemark. Oh,",
            "start": 979.6
        },
        {
            "text": "ETX. It's the Extreme Theater Extreme. Second of all, the Tanforan, I think it was, be wrong. It, no, it's not. It could be Tanforan. No, Tanforan's 2D things are not. It's Century. It's Century. Oh, Century. Yeah, it's Cinemark. Oh, yeah. So they have the, either way, the 3D theaters with the nice **** sound and all that ****. We're getting some jank ass little tiny ass thing. I am not down with that. Not down with that. All right, so I'll get, I'll get seven. Yeah, do it. Here's my thing is I would have been with you to say **** him, but if we have to wait the extra hour to do the reacts anyway, mhm, what's the point? I'm going to go to the mall with you guys in the mall and we'll sort it out from there. If I can get tickets, we'll figure it out. Okay. Mhm. But I will say this, I will treat all of you with the same courtesy you have shown me during this process, which is to say none. None. What does that even mean? You have treated me like a second class citizen. They both spent 30 minutes waiting for you to like, you have not taken my",
            "start": 1023.44
        },
        {
            "text": "me during this process which is to say none none what does that even mean you have treated me like a second class citizen they both spent 30 minutes waiting for you to like you have not taken my feelings cursing the computer out there Tim gave you his computer that didn't work he went back to your computer Tim got on his phone and said I'll buy them for you Tim also has been bending over backwards with for this for since Monday Night Football trying to get you tickets yeah I'm just not feeling it I'm not you're just non-committal that's all you are that's it that's there's so many problem there was a conversation I had with you I **** up where I'm like if I get you tickets for like I'm seeing it the night after I'm like Nick cuz I knew I didn't want to get I I don't want to commit to seeing it more than once I'm like are you **** stupid Nick no I didn't I didn't want to go down this Rabbit Hole of emotions right now so now I'm stressed out I'm already stressed all **** day until",
            "start": 1071.44
        },
        {
            "text": "it more than once I'm like are you **** stupid Nick no I didn't I didn't want to go down this Rabbit Hole of emotions right now so now I'm stressed out I'm already stressed all **** day until we get to this goddamn mall I wanted to let sleeping dogs lie lessons for Episode 8 Batman v Superman so but that's not even going to be an issue are you **** kidding me that's not going to be an issue we're going to see it way before it comes that's also true what's up Jeff and Jim second off it's like this is different like this is like the the mainstream is like oh my God the first showing I haven't had an issue getting first showings for any movie since but I want Drafthouse or Kabuki okay I mean I don't think that's going to be an issue that's going to be an issue but again we've learned we'll all be there ready to fire Al that's what it's not the booze so much I just wanted I like the reserve seat I hate waiting in this line **** but I'll do it once for the experience with you guys not",
            "start": 1113.4
        },
        {
            "text": "all be there ready to fire Al that's what it's not the booze so much I just wanted I like the reserve seat I hate waiting in this line **** but I'll do it once for the experience with you guys not once but I don't want I I prefer that too this is stupid but it's what we're stuck with honestly okay let's go back to this mall talk right we had the Patreon exclusive episode where we talk about how Tanforan is the worst mall in the entire goddamn world you guys you sent some photos last night I went there to kind of scope out the scene for today which is weird and you ate at BJ's which we're eating at today no it was all a coincidence but it all happened right so uh I mean talked about it no we talked about it but yeah I didn't go there to scope it out I just we end we were near there we end up yeah so I'm like all right I had the BJ's had the whole you know things things were cool then we start walking through and I was like am I am I wrong about this I'm like immediately I'm like",
            "start": 1151.68
        },
        {
            "text": "we end up yeah so I'm like all right I had the BJ's had the whole you know things things were cool then we start walking through and I was like am I am I wrong about this I'm like immediately I'm like looking at this place and just called like just clothing just like I said I sent you guys the pictures and it just kept getting worse as you get deeper into that mall I'm like you guys this mall looks like the the mall in Grand Theft Auto 3 it looks like the mall in Mallrats yeah it's some garbage it's the garbage mall garage mall and that's where we are seeing this damn movie do you think I'm happy about that Nick the theater's not that bad though I think I I've seen movies that before the theater oh it's that you get to walk up the stairs I remember it elevated I haven't been there a long time look let's let's let's call let's call it this way though the like the Metreon is not that great either the Metreon is awesome dude every time one out of every three showings I get the ****",
            "start": 1188.64
        },
        {
            "text": "look let's let's let's call let's call it this way though the like the Metreon is not that great either the Metreon is awesome dude every time one out of every three showings I get the **** screen that's got the soda print on it and I'm talking the I'm talking about the IMAX well the IMAX is amazing but yeah that's but only the Metreon IMAX is amazing the other IMAX's here suck ass for the people the poor sap seeing at the AMC 1000 on Van Ness I'm sorry that's not real IMAX but I feel like you get better sound when you're not in the IMAX what's the what's wrong with the AMC Van Ness like you do it's not a real IMAX the thing it's it's the what they call LieMAX that's what they call it who does like the internet like there's a thing where it's like it's uh there's very few actual IMAX screens that are the actual with the right um speaker set up go do the whole thing in the beginning of like look at all our **** subwoofers well no they still do that **** and it's just lying",
            "start": 1223.48
        },
        {
            "text": "screens that are the actual with the right um speaker set up go do the whole thing in the beginning of like look at all our **** subwoofers well no they still do that **** and it's just lying they're lying to you yeah so there's all this thing now Nick I want to let you know this that next week we're going to see this movie again all right in San Jose at the Museum of Tech I think that's what it's called what is that museum or whatever it's the San Jose like planetarium thing okay that has a real IMAX screen okay and there's showing it in 3D IMAX I'll go one of the only places in America doing and it is get me a ticket sign me up it's the only place in California showing Star Wars the exact way it was shot and supposed to be shown give me a ticket sign me up I will I'm in but in I'm not because they were they're sold out until like next Monday and I'm like that's fine look again it's just it's just a 3D factor that's the only thing I can't I can't I just can't abide when",
            "start": 1263.92
        },
        {
            "text": "in I'm not because they were they're sold out until like next Monday and I'm like that's fine look again it's just it's just a 3D factor that's the only thing I can't I can't I just can't abide when you came at me with these tickets the first time I was like can I sacrifice this one can I give this one but no because if I give this inch mhm what's next exactly 40 you want to move around that'd actually be cool not this is this is praising no I don't know no I do appreciate you taking it you you you were the only person that was actually excited not excited but took the initiative and I do appreciate that I'm I'm just giving you **** because I'm pissed at myself well I'm just like I just can't believe that you actually are not willing to see this in 3D like that's an interesting hill to die on I understand preferring the 2D I just don't understand this like I will not see Star Wars Episode 7 with my friends the moment it comes out because it's in 3D here's my question if you got",
            "start": 1310.56
        },
        {
            "text": "to die on I understand preferring the 2D I just don't understand this like I will not see Star Wars Episode 7 with my friends the moment it comes out because it's in 3D here's my question if you got invited to an early screening and it was 3D would you have gone wow no wow wow no way I don't think I would have cuz that's my I don't like 3D I mean it's not like I just dislike it it's that I abhor it I hate the idea of having to put glasses on I don't like the fact that **** looks a little blurry here and there I don't like it I don't like that it's more of a it's less of a passive experience more of an immersive experience I don't like that the film should stand on its own two feet 2D the sound design the cinematography the acting the storytelling that's all you need that other little bit I don't need it I don't need it it's annoying to me I also don't wear glasses so they annoy the **** out of me about halfway through I'm always fixing them you know you could see I just it",
            "start": 1358.2
        },
        {
            "text": "bit I don't need it I don't need it it's annoying to me I also don't wear glasses so they annoy the **** out of me about halfway through I'm always fixing them you know you could see I just it doesn't work for me it doesn't work for me all right doesn't work for me sorry Kevin was last showing that you saw in 3D no it was not you know why cuz no one at **** Lucasfilm no self-respecting person at Lucasfilm would go see a 3D show that movie talking about why because my girlfriend was told oh I picked 13 because they had IMAX and they had 3D it was just a like it was a website they had to go to they were just told so Paula could have gotten IMAX could have gotten IMAX had the nice sound the sound sucked see this is what I'm talking about and it was one of those things that like I was like I know that it's supposed to sound yeah every theater only has one nice theater and guess what we're seeing it tonight at Tanforan all right go to the same show oh no they keep bringing in the **** no this is",
            "start": 1406.84
        },
        {
            "text": "that it's supposed to sound yeah every theater only has one nice theater and guess what we're seeing it tonight at Tanforan all right go to the same show oh no they keep bringing in the **** no this is wrong this is the unanimated version the animated version I know doesn't have it and this is just a dialogue off that thank you for trying MythStorm4 but you **** me over let's do this one here this this is how much you talk about the movies now this one says this is a different one go to 1 8 we'll go to 1 8 we'll see what we got here we have to sit through an ad or whatever then nope **** in that episode yeah right Jesus Christ when was this about this tonight old mic you're saying you have to go back and watch the other one super curious why are we stupid thoughts are on Candy what your fav is and just if you have any any sto about candy the reason I bring this up is it's like in space when they watch Spaceballs cand no but like I'm sure you have all right thanks for the very",
            "start": 1458.64
        },
        {
            "text": "your fav is and just if you have any any sto about candy the reason I bring this up is it's like in space when they watch Spaceballs cand no but like I'm sure you have all right thanks for the very accurate time code guys it's not good enough not good enough sorry sorry Eric Krah thank you for trying because it doesn't exist Greg it's gonna you're gonna keep trying to find something that doesn't exist I'm going to nail you on this son of a **** everybody if you're just watching this in segments by the fourth segment we'll have them nail but it's time to move on see what else has happened on this episode I'm going to choose some of this of the GameOverGum that's those are those are not are contacts. Contacts. Yeah, um.",
            "start": 1524.36
        }
    ]
}