{
    "id": 1381,
    "video_id": "m-lAeGgMfls",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Why's Greg Miller So Angry? - The GameOverGreggy Show Ep. 104 (Pt. 2)",
    "description": "Why does Greg get so angry so easily?\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1448956801,
    "duration": 1797,
    "transcript_chunks": [
        {
            "text": "Hey guys, Kinda Funny is having a holiday sale! That's right, if you go to KindaFunny.com/store for the next week, from Black Friday until the next Friday, you can get 10% off everything in the entire store. That's all the beautiful shirts that you know and love, that's the cups, the mugs, the stickers, all of that stuff is there. And the Let's Him Host shirts, they're for this week only. You need that, you need that in your life. Oh, are these all the T-Shirt Tuesday shirts that we exclusively had only on those Tuesdays? Yeah, they're back for one week only, all of them in one place. Buy them for you, buy them for your sister, your friend, your neighbor, whoever you want to buy them for, even people you don't know. It's going to be great. 10% off KindaFunny.com/store. This episode is brought to you by Loot Crate. Would you classify yourself as a geek, gamer, or pop culture nerd? Then this is the subscription box for you. For less than $0 a month, you get six to eight items of gamer and pop culture licensed gear.",
            "start": 0.08
        },
        {
            "text": "Would you classify yourself as a geek, gamer, or pop culture nerd? Then this is the subscription box for you. For less than $0 a month, you get six to eight items of gamer and pop culture licensed gear, apparel, collectibles, unique one-of-a-kind items, and more. Make sure you head over to LootCrate.com/KindaFunny and enter the offer code Kinda Funny to save $3 on any new subscription. Not that long ago, and depending on where you live, not so far away, Loot Crate blasted off into a voyage across the Galaxy, searching the far reaches of space to find universally awesome gear. Using December's Star Wars: The Force Awakens loot as a launchpad, we landed on some equally cosmic items from Halo 5 and more, with an exclusive Funko Pop and an exclusive shirt in this month's crate. This is the loot you're looking for. That was a Star Wars reference, I just got it. Remember, you only have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cut off happens, Jack, that's",
            "start": 39.68
        },
        {
            "text": "For that was a Star Wars reference, I just got it. Remember, you only have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cut off happens, Jack, that's it, it's over. So go to LootCrate.com/KindaFunny and enter the offer code Kinda Funny to save $3 on your new subscription today. Next topic, this one comes from Christopher Ball. He writes in and says, \"I would like to continue with quote, 'We can do that topic later,' from past shows. This one would be a little personal, not for me, but for you. On episode 98, I started writing episode numbers down. You said,\" and he's talking now to Greg, \"Greg said that Greg's emotions have not been the same since cancer. I don't want to pry into your past/personal life too much, but I am genuinely interested in how this affected you and your emotions.\" Christopher Ball. So yeah, episode 98, we talked about my cancer. Was that, is, was that the Adam Sessler one? I guess so, where I talked about the toughest thing in life that",
            "start": 85.04
        },
        {
            "text": "affected you and your emotions, Christopher Ball. So yeah, episode 98, we talked about my cancer. Was that, is, was that the Adam Sessler one? I guess so, where I talked about the toughest thing in life that... What episode are we on now? 104. Wow, time goes so fast. Feel like I was here like last week. See, I thought he was here. I thought it felt like he was here. Time just weird, I don't like it anymore. So yeah, got sick, got the cancer. As I covered in that episode, when you get on the chemo, it fucked everything up for you. I was super emotional at the time. There's the classic story of when I was out tying my shoes, getting ready to walk the dog one day, and Colin came out and said, \"What are we going to do about all these box boxes?\" And I started crying and I yelled at him. I'm like, he's like, \"Whoa, sorry, I was just asking what to do with the boxes,\" and walked away. And then I came in and apologized. Colin asks, yelling and crying happens. I just imagine Colin turns around to walk, \"Done. You're dismissed.\" And so",
            "start": 144.12
        },
        {
            "text": "just asking what to do with the boxes and walked away. And then I came in and apologized. Colin asks, yelling and crying happens. I just imagine Colin turns around to walk, \"Done. You're dismissed.\" And so that, I mean, that's in the heat of chemo. I was talking about, I think maybe I told it on that, that episode where the, the famous one where I was like at work and I'm just like, \"Fucking a sea of hate for everything that's happening and I hate everything and I hate everybody and I'm just trying to get through the day.\" And I get on the Muni to go home and I'm sitting there with sunglasses on and my hood up just to be left alone. I'm just hating Muni and of course it's taking too long and I'm just furious, furious, furious. And I get off the Muni and I walk home. I'm finally home. I just want to put on pajama pants and lay in bed. And The Story Goes that I open the door, I'm just seething angry, open the door and I look into the kitchen and I can't for the life of you tell me what I saw anymore, but it was something",
            "start": 184.24
        },
        {
            "text": "lay in bed. And The Story Goes that I open the door, I'm just seething angry, open the door and I look into the kitchen and I can't for the life of you tell me what I saw anymore, but it was something just, I don't, maybe a pizza box on the ground, maybe I forgot to take out the trash, some little, little chore. And that was the final straw. And I came in and I slammed the door behind me and I went, \"Fuck!\" And I slammed the door and as it slammed, the deadbolt slid out, went into the door jam and bent the wrong way. It's like, and then I, I forget what I was so mad about, because now I'm like, fucking in tears because I have to go get a hammer and try to fix this deadbolt when I just want to lay down. All I want to do is lay down, you know what I mean? And so my whole thought with it was that this sucks, but whatever. It's like when I went on Accutane, you know what I mean? Like your emotions got, my emotions got all out of whack and post-college life for a few months when I got an Accutane to clear it, my face, but",
            "start": 219.44
        },
        {
            "text": "it's like when I went on Accutane, you know what I mean? Like your emotions got, my emotions got all out of whack and post-college life for a few months when I got an Accutane to clear it, my face. But when Accutane was over, you go back to normal and you're back, back to your old self. And I never came back. I never came back from cancer. I still have a short fuse. I snip at Colin and Christine too much. I cry too easily. I don't know. I, I mean, I don't really remember you pre-cancer because we weren't like close friends back then. Yeah, but I feel like it's less of a symptom of any of the chemotherapy and more of a symptom of we just, we adults that have to deal with a ton of shit all the time now. But I don't, I mean, that's possible, but like I, I like, I've had, I've come to the precipice of having conversations with people if I'm manic, if I need to be on a medication, because like there, I mean, like, and like I put on a face and like I, you know, Colin's been going through a lot of stuff recently. He's talking to me",
            "start": 256.24
        },
        {
            "text": "with people if I'm manic, if I need to be on a medication, because like there, I mean, like, and like I put on a face and like I, you know, Colin's been going through a lot of stuff recently. He's talking to me that I'm, I'm happier and blah blah blah. And I think I just mask it better. I mean, obviously I have these slip-ups where I freak out and stuff, but like there's days where I wake up and I'm like, yeah. And there's days where I wake up and I'm like, I just want to fucking sit here and play Fallout, whatever it is. Normal. I mean, but I feel like it's not like it used to be. Sure, there's days I'm less excited to do things or whatever, but there's days where, there's days where I bite Kevin's face off for no reason, you know what I mean? Now granted, that's therapeutic. He does, he earns them sometimes. I did that right before the show start lots of times. He earns the shit abuse we throw his way. But there's other times where he's just asking normal questions and it's like, I'm gonna beat this kid to death. Yeah, no, but",
            "start": 301.32
        },
        {
            "text": "before the show start lots of times he earns the shit abuse we throw his way. But there's other times where he's just asking normal questions and it's like, I'm gonna beat this kid to death. Yeah, no, but again, I think, I mean, I don't, I sympathize. Yeah, obviously, because I feel like going around the table, it probably goes from uh, best to worst as far as uh, temper tantrums and outbursts. Me being the worst, Tim being, he never, he never breaks. One day when you do break, that it's going to be a shit, it's going to be a nuclear explosion that goes off and we're all going to be like, \"Finally! Finally!\" Um, but I sympathize because we're in a high stress environment and we want to do the best and we want to be great to each other. But, you know, I feel bad because that happens to me all the time. I get something, I'll, I'll bring the outside world into work. Yeah, and I'll be too stressed out about stuff and I'll build all this like, I'll just throw all this shit on my, onto my plate. Or I'll talk to my wife",
            "start": 341.24
        },
        {
            "text": "I'll, I'll bring the outside world into work. Yeah, and I'll be too stressed out about stuff and I'll build all this like, I'll just throw all this shit on my, onto my plate. Or I'll talk to my wife and she'll be like, \"Hey, I know we're going to Costa Rica in a week, but can we, should we start planning next year's vacation?\" And I'm like, and I just want to blow up because I'm like, it's too much, it's too much to deal with. Because in today's society, I feel like human beings can reasonably deal with 40% of what they have to deal with every day, maybe 50. Right? Hundreds of emails coming through, uh, uh, countless amounts of shows, decision paralysis when it comes to pretty much everything because there's thousands of options for everything that we have to fucking deal with. Um, and then on top of all that, right, we have the, the stress of running your own business as being responsible for our own livelihood. And we've chosen to take all of that, put it down and put Kevin Coello right on top. Which fuck you guys, no.",
            "start": 378.36
        },
        {
            "text": "we have the, the stress of running your own business as being responsible for our own livelihood. And we've chosen to take all of that, put it down and put Kevin Coello right on top. Which fuck you guys, no. You know, but the thing is like, if, if it weren't for you, Kevin, this literally none of this could be possible. And I, and I do mean that in a very sincere way. Like you are the heart and soul of this business. And I apologize that more often than not, you become The Whipping Boy because you are the one that's trying to get shit done. Like, but he gets it. That's the thing about Kevin that I love is that he doesn't take it personally because he understands, I feel like when we're in the hot moment and then we're not in the hot moment, you know what I mean? And that is the thing. Like I, like it back to the like my emotion, like I'm not saying that highs and lows aren't a normal part of life, but when I can't make the Twitch stream work anymore and I break down in tears in front of you guys, that's not a normal",
            "start": 417.4
        },
        {
            "text": "my emotion. Like I'm not saying that highs and lows aren't a normal part of life, but when I can't make the Twitch stream work anymore and I break down in tears in front of you guys, that's not a normal emotional reaction, you know what I mean? Like I've always been when I get angry, I cry, but I'm talking like when I was a kid and I was like about to fight someone, you know what I mean? Like, and like Kevin jumps on that grenade and makes Twitch work with the help of Devon and a couple other people, you know what I mean? Like that's a different thing. And granted again, it's more pressure than ever here what we're doing. But I also feel like you are, and this is the, this is a constructive criticism, so please don't be offended by this, but I think you're terrible at, at disconnecting. I think you're really, really bad about um, walking away from work. A, because we work, walk away from literally. And B, your job is to know everything there is to know about video games. And so the thing that you love most in the",
            "start": 457.76
        },
        {
            "text": "bad about um, walking away from work. A, because we work, walk away from literally. And B, your job is to know everything there is to know about video games. And so the thing that you love most in the world is also the thing that causes you the biggest stress, if that makes sense. So when you say you want to walk away and just play Fallout, I really feel like you both do this too. And I think you to some degree feel that there is a little bit of extra pressure on top of needing to do that because you have to be the most informed person in the room when it comes to, to video games. You know, I can see that. I think the bigger pressure is like when I'm playing a game like, should I stream this? You know what I mean? That's where we've had to just have like gut check talks of like, let's not stream. Yeah, I mean, like there's just no time and it's going to kill everybody. I know, but I mean, that's the thing though, you're such a, you're such a constant overachiever. And that's one of the things that I think all of",
            "start": 491.48
        },
        {
            "text": "like there's just no time and it's going to kill everybody. I know, but I mean, that's the thing though, you're such a, you're such a constant overachiever. And that's one of the things that I think all of us admire about you that I feel like I almost feel the need sometimes to just be like, it's okay, it's okay to just check out, man. Take a day, fuck off. Like go somewhere that no one knows where you're at. I mean, you don't like massages, you don't like haircuts, so those two... Well, that's the thing is like, I've thought about it, get a haircut. I've thought about it recently of like, you know, of taking a vacation, you know what I mean? But that would be like so, but it would be so fucked up because it would be me in the bedroom while you guys are out here. Like, you know what I mean? Like I, because what I like to do on a vacation is chill out and play games. That's a bad idea though. I mean, that's maybe one of those, maybe that's something you need to go someplace, take your PS4 with you and just chill someplace and",
            "start": 526.24
        },
        {
            "text": "on a vacation is chill out and play games. That's a bad idea though. I mean, that's maybe one of those, maybe that's something you need to go someplace, take your PS4 with you and just chill someplace and play because eventually what's going to happen, that's why it doesn't happen. Yeah, it's not going to happen. Like, fuck, I don't know how to do this thing on OBS. And that's why I go back. Like, you know, when people hated the Metal Gear review event, right? Other outlets, something. I was like, this is fucking great. You were happy. You guys should see like, we're sitting in, we're sitting in like a, a, a loft in Konami. It was like this beautiful like, like partitioned area where we got to just sit on a couch and all it was was a, a TV, a coffee table and a couch. And Greg couldn't have been happier. Perfect. He was every day was like, like I was a little late. I'm always a little late coming down the elevator, you know? And I don't know if you guys notice that about, I'm always the last person there no matter how fucking",
            "start": 559.44
        },
        {
            "text": "day was like, like I was a little late. I'm always a little late coming down the elevator, you know? And I don't know if you guys notice that about, I'm always the last person there no matter how fucking hard I try. I don't know why, but I come down and Greg's like, \"You ready to go?\" Like half big eyes, like smile from ear to ear. And it's amazing. But I think you need to try to find that for sure. Just like, I'm not going to say it again. I think if I say the, the, the bat thing one more time, it's going to be, then it becomes racist. It's not racist at all. No, a giant black bat. Yeah, referring to black, black baseball bat. I think was the term that you, you guys, if you missed topic one, yeah, about porn, we saw a porn image and that was a gigantic fuck. Like you're allowed to describe it that way. There was nothing, there was no bad. I mean, that's describe, that's being descriptive. The AP Style Guide says to say black, so you're fine. Okay, cool. Um, because sometimes Kevin goes, you know what I mean? And that's when I'm",
            "start": 595.16
        },
        {
            "text": "there was no bad. I mean, that's describe, that's being descriptive. The AP Style Guide says to say black, so you're fine. Okay, cool. Um, because sometimes Kevin goes, you know what I mean? And that's when I'm like broaching really taboo subjects. But I think that, I think that you need to find and replicate that for yourself. And that's something that I struggle with too because I'm go, go, go. And that's why I'm not that I'm not looking forward to Costa Rica, but part of me is the same thing we talked about last time where I'm like, I'm taking an eight day vacation to a very place. I'm staying in a nice hotel with the women I love most in the world. Um, and I have app, I'm apprehensive about it because it takes me away from work. But that's fucked up. Like I should. And everyone, a perfect example is uh, my wife's a huge fan of Shonda Rhimes. You familiar with her? Anatomy, uh, Scandal, How to Get Away with Murder. She's that, she made all these amazing shows, right? And she's, she recently had an interview where she said,",
            "start": 634.28
        },
        {
            "text": "a huge fan of Shonda Rhimes. You familiar with her? Anatomy, uh, Scandal, How to Get Away with Murder. She's that, she made all these amazing shows, right? And she's, she recently had an interview where she said, um, she at 7 o'clock stops work. And someone emails her, she turns on her auto-response and says, \"Hey, it's 7, it's past 7. I'm having a life, you should too.\" And of course she can afford to do that because she's got three Emmy award-winning shows that are currently on television. But at the same time, you have to recharge to bring that new energy back if you want what we're doing here to keep moving forward in a positive way. I hear you. And I, I mean, we all make those choices when it's those times. I mean, I definitely turn it off and don't email at the middle of the night or anything like that, you know what I mean? I mean, we do, but of, but more often than not, and I'm not saying it's a bad thing, but well, we are not, we are not, we don't hesitate to if we need something text each other at like 10:00. And that's",
            "start": 671.0
        },
        {
            "text": "mean, I mean, we do, but of, but more often than not, and I'm not saying it's a bad thing, but well, we are not, we are not, we don't hesitate to if we need something text each other at like 10:00. And that's, that's the situation we have here. But that can be very stressful and it can, you know, when you, when you're trying to like reset that bar of, of, of energy that you're putting into something or like anger level, right? Where it goes down to 80%, those, those little texts do sort of that chip damage which just keeps going up or like an email. I'm a big fan of Do Not Disturb on the phone where I put that on and put the phone down and then I'm done with. But then you, then you, you see it the next day and it's 50. That's fine. But it's work, you know what I mean? Like, and that's the whole thing is most of the things we reach out about is usually, usually it can wait. And, and then I, I say most of the time it can wait. And then most of the time it is something that if you're not there to immediately respond,",
            "start": 708.0
        },
        {
            "text": "things we reach out about is usually, usually it can wait. And, and then I, I say most of the time it can wait. And then most of the time it is something that if you're not there to immediately respond, Google or look through your email, you can find it, right? You know what I mean? That's always the thing. It's just easier to ask you this question than it is to dig real quick. And if you don't get, I always ask Colin how to spell words right through text, which is weird. How do you spell push-up? Did I get that right? Push-up? Is that a compound word? What I do, I, uh, yeah, I mean, I've tried to be more cognizant. I mean, when we were at IGN, I worked a lot and, and, and uh, I was happy to do that at once. But, but there came a time where I'm like, I'm not doing this anymore. I'm not, I'm not, I'm not working 60, 70 hours a week anymore. Just not happening. Um, and so I, I've really tried to turn that off about myself because I'm just, it just wasn't making me happy. It was making me fucking miserable, you know? And uh, so even with",
            "start": 742.28
        },
        {
            "text": "anymore, just not happening. Um, and so I, I've really tried to turn that off about myself because I'm just, it just wasn't making me happy. It was making me fucking miserable, you know? And uh, so even with this business, I think I work way more than the normal person, but I do try to, and I work a lot at night, like late at night. That's like when I just get, I get like a second wind at like 11 or 1:00. And you guys see that with my emails and stuff. But um, and I'll do that for a little while, but I, I try not to stress too much about things. Like things are happening. We trust each other that everything's getting done. I don't, you know, you don't have to worry about the things that I'm in charge of. I don't have to worry about the things you're in charge of. If I need help with, with something, I'll just, you know, bother Kevin, I guess. And, and uh, or email someone or whatever it is. And so I don't know, I've just been trying to keep that in mind. I feel bad for Greg because I, I and I, I've tried to approach that",
            "start": 778.8
        },
        {
            "text": "bother Kevin, I guess. And, and uh, or email someone or whatever it is. And so I don't know, I've just been trying to keep that in mind. I feel bad for Greg because I, I and I, I've tried to approach that subject with you many times, but where I'm like, you don't need to do this, you know? And I think you, I think you take pleasure in streaming and doing all that kind of stuff. And I'm like, \"Dude, like it doesn't have to, you don't have to be on all the time. Why don't you just go away?\" You know, I don't mean that to be an asshole, just go away. No, fuck, go away. It's okay. The thing we talked about, right, is doing more event stuff, right? So like the Fallout day was, you know, I love doing that. But it's like, yeah, it is the little thing of like, all right, let's, I'm, you know, Kevin's already gone, so I'm going to come in here and try to flip the room for streaming three hours of whatever. No, fuck that. You know what I mean? Like when it's an event, we'll do it or something like that. Yeah, I'm glad that you have that more",
            "start": 809.16
        },
        {
            "text": "and try to flip the room for streaming three hours of whatever. No, fuck that. You know what I mean? Like when it's an event, we'll do it or something like that. Yeah, I'm glad that you have that more mentality because I feel like you just put a lot of pressure on yourself. And meanwhile, it makes me feel bad as the other kind of, I guess, gaming personality, like real gaming personality here, where it's like people are like, \"Why don't you stream blah?\" I'm like, \"I don't want to.\" Like, you know, like I, and like that's not how I play games. I don't enjoy that at all. And so I'd rather do something fun for you. And we have those ideas that will roll out year, hopefully. But um, you know, it's, it's, it raises the bar in a way to an, an unsustainable level. And you're going to be the one that burns out, not us. So it's, that's, that's the one thing that I'm, I'm afraid of. And so I agree with Nick, I think finding the balance is, is good. Part of that balance is a little pressure oriented in terms of playing games and, and",
            "start": 844.76
        },
        {
            "text": "that's, that's the one thing that I'm, I'm afraid of. And so I agree with Nick, I think finding the balance is, is good. Part of that balance is a little pressure oriented in terms of playing games and, and trying to be up on those things. I really took my, myself off, I took my foot off the wheel or off the, I, I don't know how to drive. I don't know how to drive. I should, I'm just gonna stay away from driving out of force. Uh, but I, I really let, let up on, on the idea of uh, you know, having, having, I, I mean, I know I read and I know a lot. But I mean, but um, people really love the, the quote from the PS I Love You XOXO where I said, \"You want to take a seat and I'll tell you all the things you don't know.\" That was, that's being, that's being uh, he wasn't talking to me. No, no. Uh, because people were busting my balls. I didn't know one thing. Um, so yeah, so I, I, I try to take the, the pressure off myself to that I can't reach those standards. And I think a happier and healthier Colin is good for the company and good for",
            "start": 880.0
        },
        {
            "text": "didn't know one thing. Um, so yeah, so I, I, I try to take the, the pressure off myself to that I can't reach those standards. And I think a happier and healthier Colin is good for the company and good for our audience. Um, and I think that that's the same for all of us. And I, and I especially the one thing that I like and, and I've given you props for this is that yeah, I've been, I've been for a couple weeks there, I was kind of like a waste. And uh, it's cool to have a company that's, it reminds me of like a wound where like, like, you know, your body works to stem the bleeding and then start to heal and stuff like that. Even though like one part of it is like out and not really able to work properly, it was really kind of nice. I do appreciate you guys for that. I feel like you, I think your perspective on that was a little different than ours. I, I didn't see any difference in, in your energy or what you brought to the group as well. But I'm glad that you feel like you can like, I having a little therapy session.",
            "start": 916.56
        },
        {
            "text": "a little different than ours I I didn't see any difference in in your energy or what you brought to the group as well but I'm glad that you feel like you can like I having a little therapy session right now I'm glad you feel like I'm glad you can feel like you can you can take the uh your foot off the gas um to use a drive that was the one I was looking a little bit foot off the wheel like Jesus have I been doing this wrong the entire time cut to Colin driving a car with his feet on the brake he's got the sticks he's hitting the gas and brake with very unintuitive I like how your brain went to Sticks mine went to he was slipped upside down and his be hard to do yeah that you can't really see out of your ass I've tried right Kevin sometimes I get Kevin I owe Kevin a huge apology the for the other day I jumped down his **** throat yeah when you guys were when we were doing that we're doing uh the Rewind the Umer right I heard this from the other room yeah and Kevin you could see him",
            "start": 955.12
        },
        {
            "text": "other day I jumped down his **** throat yeah when you guys were when we were doing that we're doing uh the Rewind the Umer right I heard this from the other room yeah and Kevin you could see him up against the walls he I was just having a bad day and I asked Kevin a question and he had the misfortune of he wasn't doing the thing that I thought he should be doing in my brain even though I had not told him to do that yeah at all he was standing by the camera monitoring the shot and I was like Kevin how's the audio and he's like huh oh hold on and I was like I just f I mean I have it recorded I went off on it for like five minutes and I he saving it for because he laughed it is because he laughed cuz I was stressed out and we don't know because we're always screwing around had no idea you were stressed I knew that I knew it was one of those things not to **** with you but like I did not expect that that came out of nowhere and Kevin of course being our constant always has one speed for he just",
            "start": 996.24
        },
        {
            "text": "I knew that I knew it was one of those things not to **** with you but like I did not expect that that came out of nowhere and Kevin of course being our constant always has one speed for he just always constantly **** with you it's always just like there's a gear shift in front of him there's D1 D D3 I don't know what the **** those things are and then there's the forward the forward gear which is **** with you **** with Nick all the time and he does it and I love you for it and you never stop he'll never stop but I do owe you that apology because you ended up being more often than not the whipping boy it was that in the uh the uh notorious poster Javelin tube you got to see my worst side the best I will say to be fair that day that day the first day you're talking about I did say right before it happened I'm like Nick's about to lose it yeah like I was like I I just saw I just like yeah it's it's I mean well the problem was Kevin when you said that Kevin was like out of the",
            "start": 1037.64
        },
        {
            "text": "right before it happened I'm like Nick's about to lose it yeah like I was like I I just saw I just like yeah it's it's I mean well the problem was Kevin when you said that Kevin was like out of the room so he didn't hear you say that and it was like it was little signs remember like the Nick losing at that time was not like a joke or a **** around it was that the thing got unplugged by the chair or whatever and that's when it tumbled down the hill yeah that I mean that and and that's a perfect example right that's not Kevin's fault it's just that thing happens to be the thing that I can rage at at that moment because I can't rage at the other 15 or 16 things that I have to deal with like as a Kinda Funny yeah you know like I have to deal with the fact that people at venues don't work at our pace and don't get back to you even though you're having an event in five days and they couldn't **** care you know like that's little **** that you're like this is just part of being an",
            "start": 1082.68
        },
        {
            "text": "at our pace and don't get back to you even though you're having an event in five days and they couldn't **** care you know like that's little **** that you're like this is just part of being an adult and being a professional and I can't get mad at that person because I need them to do what I need them to do but I can get mad at this **** wall outlet right now for having the misfortune of not having something plugged in it that I need you know or I can get pissed at Kevin because he just happened to not be wearing headphones but these are all these are all you know symptoms of a bigger problem it reminds me of like when we when before we even had Kevin and we it was like week two or whatever and we were all stressed out at the kitchen table and I forget I was on the phone about something and I was like Nick I flashed you like three and then the two and you're like what does that mean and I gave you like the hardest eye roll you got so pissed at me so pissed to me like you had no idea",
            "start": 1121.0
        },
        {
            "text": "and I was like Nick I flashed you like three and then the two and you're like what does that mean and I gave you like the hardest eye roll you got so pissed at me so pissed to me like you had no idea what the **** call I was on like no idea no idea he just flashed me a random Navy SEAL sign and I was supposed to understand what he was talking about I got it though I was like I apologized to me I'm sorry I don't know why I thought you were telekinetically communicating with me you're on this call that you're not yeah my favorite thing is when Greg is like you know there was a time and a place where I thought what there was one time when when Greg actually thought I was a professional adult yeah it was a great was a good we started up at noon I was like oh **** man shit's getting done he where it's colored shirts to work this this is going to be a real **** thing checkered Jump Ahead three years here we are showing up 30 minutes late with half eaten Apple like God damn it Nick yeah but",
            "start": 1153.88
        },
        {
            "text": "it's colored shirts to work this this is going to be a real **** thing checkered Jump Ahead three years here we are showing up 30 minutes late with half eaten Apple like God damn it Nick yeah but I mean that's we're all burn we have to get cut each other a little slack and you know we're all burning it out you know we we've gone what gone on three weekends straight of having something to do where weekend we at we were in LA for one weekend and the next weekend we like this is going to be dope let's have a 4-hour live stream Where I Was big beautiful kids those beautiful kids with their baseball bats those gorgeous kids um so yeah I mean I as much as I I feel you I do because I feel the same thing with me I'm like should I is there something wrong with me where I'm so **** Punchy all the time yeah like I have no fuse dude I mean this is from my perspective it's so weird because hands down this is just a fact the biggest stress in my life is your guys being stressed out like dealing",
            "start": 1192.32
        },
        {
            "text": "time yeah like I have no fuse dude I mean this is from my perspective it's so weird because hands down this is just a fact the biggest stress in my life is your guys being stressed out like dealing with you guys freaking the **** out I just can't handle it like girlfriend my family my all this stuff like oh my God like that stuff to me is just like I got it but when you guys freak out I'm just like I just I just don't even I can't comprehend how you can be so upset and like that's the thing I just don't it because I can't understand it it makes it hard for me to deal with helping you guys but like you losing your **** like and I know you you've already said this even on this show doesn't make sense and you know it and you always like I was even talking to Kevin like Kevin a couple days ago was talking me he's just like like what should I do when Nick loses as **** I'm like you handle it perfectly like you just **** take it he's going to apologize let's let's let's let's back",
            "start": 1239.4
        },
        {
            "text": "ago was talking me he's just like like what should I do when Nick loses as **** I'm like you handle it perfectly like you just **** take it he's going to apologize let's let's let's let's back up a second there's two ways Kevin has handled it and I've encountered both of those one is he just goes kind of rolls his eyes and stays quiet and lets the baby rage in the corner the other way is slightly more assholish where he will wait for me to stop and then he'll say one little **** comment just to throw it in there and then it's World War **** 19 man I am just like bring the alien weaponry in I'm nuking the world but but the thing with that the the one comment he makes is usually a fact it's accurate it's the solution to the problem way it's the way he says it though when go Nick come on it's just a plug actually perfect the case in point he looked at the thing and he goes Nick where else am I going to plug the thing in and I'm like there's like four plugs over there oh my God",
            "start": 1285.04
        },
        {
            "text": "come on it's just a plug actually perfect the case in point he looked at the thing and he goes Nick where else am I going to plug the thing in and I'm like there's like four plugs over there oh my God I'm like I'm like I just want to flash it's flash right now into a weapon and get the poster tubes out of the way all the away from him not only that but like yeah Kevin though Kevin's a perfect example Kevin is the one thing that actually does set me off that does get under your skin and he kills me he gets me in a way and that's just because we have he's my **** brother brother you know and but it's like my brother does that to me too Kevin like and we we give him so much **** and I 99% of the **** that we give him I don't even say we that you guys give him is not okay you give him a lot of **** no oh no no no I know I know I give him **** for different things and like it's my things are just the things that drive me **** crazy like it's like you guys always apologize you're",
            "start": 1329.32
        },
        {
            "text": "of **** no oh no no no I know I know I give him **** for different things and like it's my things are just the things that drive me **** crazy like it's like you guys always apologize you're like they like oh like we give Kevin a lot of **** but like whatever I'm like no no no the **** that I give Kevin **** that I stand by that and I will never take that back I give him as much credit as he **** deserves I love him I'd be **** useless in my life without him but oh my God yeah he just Kevin infuriates every moment of the day I don't want to make this this this whole topic just about Kevin but it really I think we found the stressor I think we found like it really is it's it's and this is indicative of everything in life as an adult it's pros and cons Kevin is pros and cons you have to take the good with the bad we love him he's more good than he is bad but when he's bad oh my God it makes me want to strangle him it really does yeah he's uh I mean I I've developed what",
            "start": 1373.88
        },
        {
            "text": "you have to take the good with the bad we love him he's more good than he is bad but when he's bad oh my God it makes me want to strangle him it really does yeah he's uh I mean I I've developed what I would call with Kevin an intentionally adversarial relationship you do are the worst like but I do it because I think it's funny like I don't I think Kevin's the same way where I'm I I'm not even really **** with Kevin at all anymore like I just in the sense that everything is a **** with Kevin and and I know he **** right back with me so it's like he's a character on our show on Colin and Greg especially and and so I've kind of just developed that's how I deal with Kevin is Kevin and I have serious political conversations and scientific conversations and he he definitely scratches my intellectual itch uh in a way like the only person I can really talk to about the things that I care about um but uh I like that I've developed Kevin as this like as my foil basically uh I think it's funny",
            "start": 1411.6
        },
        {
            "text": "itch uh in a way like the only person I can really talk to about the things that I care about um but uh I like that I've developed Kevin as this like as my foil basically uh I think it's funny I think it's good theater it is um but yeah I feel I mean I feel bad for for you know for Kevin sometimes when when we get mad at him but I feel bad I kind of feel bad for for everyone I mean the thing is is that there's just five very unique and very different personalities in this company I don't think any of us really like each other and and and we all like to laugh we all have good senses of humor I think I think we all have great senses of humor and those kinds of things but I also think we're very different people and so there's going to be inevitable conflict between people and I don't think there's anything really wrong with that I mean a friend of mine was asking you know a common question for Greg and I where it's like do Greg and you ever get tired of each other and I'm like I",
            "start": 1450.32
        },
        {
            "text": "think there's anything really wrong with that I mean a friend of mine was asking you know a common question for Greg and I where it's like do Greg and you ever get tired of each other and I'm like I don't think so I mean I'm like Greg and I don't give ourselves a chance to get tired of each other because we don't we're not I think people think like we live a life where we're together all the time and I'm like Greg and I don't really talk that much like we we have our conversations Greg's a good listener um when I have problems and Greg will like just come out of nowhere and invite me to dinner or whatever once in a while but you we we are not like up each other's ass like I think a lot of people think like we're just up each other's ass so I'm like no like Greg and I get tired of each other but if Greg so I mean once in a while when Greg's feeling adventurous I'll put it in his ass but uh I don't understand how vaginas feel so help me this is as close as I can replicate it I need",
            "start": 1489.16
        },
        {
            "text": "other but if Greg so I mean once in a while when Greg's feeling adventurous I'll put it in his ass but uh I don't understand how vaginas feel so help me this is as close as I can replicate it I need to know for instance beautiful white baseball bat yeah that that white glistening **** shiny baseball bat uh yeah so I think that the word glistening the word glistening you know exactly what I'm talking about I know exactly what you're talking about it looks like you put it looks like it's got a little bit of motor oil on it oh yeah you know what I'm talking about but that's never not going to be shiny again oh god um so yeah I think that it's all about how you deal about how you deal and Vibe with people and I know that I'm like a more of a brooding and like very emotional and almost pessimistic person a lot of times and so I try to off balance and offset that with my with my sense of humor I think I have a dark and like dark sense of humor and like I like to laugh and I like to make fun of",
            "start": 1519.72
        },
        {
            "text": "person a lot of times and so I try to off balance and offset that with my with my sense of humor I think I have a dark and like dark sense of humor and like I like to laugh and I like to make fun of **** I like to be inappropriate and stuff like that so I try to balance those things out and I think that we're all kind of self-aware of the things that we do well and the things we don't I think that's why we work but uh yeah so I think it's just the way we interact with each other and yeah Kevin's a scapegoat sometimes for for some things for for you know for Nick for instance or for all of us but it's not personal I know it it seems personal Sometimes some people in the comments like you guys are mean to each other blah blah my favorite thing is like reading the comments where it's like there's theories that like um like uh you and Tim always have Tim and I are mad at each other or you two are mad at each other that's not a theory sometimes Greg and I are legitimately just mad at",
            "start": 1558.4
        },
        {
            "text": "there's theories that like um like uh you and Tim always have Tim and I are mad at each other or you two are mad at each other that's not a theory sometimes Greg and I are legitimately just mad at each other that's I'm never mad at you we have beef every once in a while no we don't when we get into little tiffs every once in a while no that is never I can't think of a time where I've been like mad at you not mad at me but sometimes you give it to me we're good though you and I get prickly both of us get prickly but the thing is we're I don't think we've ever been prickly at the same time when I get prickly you you're usually there to help me calm me down and I try to be the same for you that would if both of us were prickly at the same time you would be in tears and I would be putting holes through the wall and that's just the way it would go and then John, John's God that would cost so much money to fix don't worry but yeah I mean I feel like we're in a very challenging environment",
            "start": 1591.44
        },
        {
            "text": "through the wall and that's just the way it would go and then John, John's God that would cost so much money to fix don't worry but yeah I mean I feel like we're in a very challenging environment where that's part of the fun of being in this group is that you guys never let me rest in my laurels always challenge everything I say which is great up until that last time like for instance before the show started today Kevin just I I made one comment as a joke and Kevin was like do you even know what you're talking about and it's just after the 15th time of hearing that I'm like I gotta just I got to jump down his throat right now because he's challenging me and I I it's like two **** Elks in the middle of the wild right I gotta just like I can run away from it or I could take these horns growing out of my head and stick them right in his little ass so I did that yeah and Kevin looked at me and it didn't make a **** difference whatsoever that's what I love most about him is I'll yell at",
            "start": 1636.6
        },
        {
            "text": "out of my head and stick them right in his little ass so I did that yeah and Kevin looked at me and it didn't make a **** difference whatsoever that's what I love most about him is I'll yell at him and he just blinks and then says another **** thing and you're like God damn it Kevin God damn it he's an interesting Kevin I'll say this about Kevin just to wrap it up Kevin's distinction in my life is maybe as one of the most random and interesting people I've ever met in my entire life like I want to know about Kevin you know what I mean like I but I don't at the same time because the more I know the less there's mystique and the less I can make up really funny stories about Kevin in my my he's just fascinating because he's brilliant and he's smart and he knows how to do stuff but I've never seen someone get more lost in a conversation a simple conversation have you ever have you ever tried to see him write something I've seen, I've read his Twitter feed his Twitter feed looks like it's",
            "start": 1672.24
        },
        {
            "text": "seen someone get more lost in a conversation a simple conversation have you ever have you ever tried to see him write something I've seen, I've read his Twitter feed his Twitter feed looks like it's being ghost written by a Syrian refugee who just got here and is trying to earn it tee verbs are missing nouns letters no, I my favorite tweet for my favorite tweet for Greg was when Kevin tweeted something to Greg's like almost I was like almost a complete almost a complete sentence cuz he knows it he knows it and then like the best is when Tim will read him back to him and he'll be damn it like he didn't even know it's been up for 1 hours he had no idea he **** it up that badly Tim tells me it's important to say that I'm the real Kevin is my so my favorite yeah is that his profile yeah it's the best but then it's paired with that beautiful picture of him laying on the bed and you're like I can't be mad at him I can't be mad at him he's you're an interesting person Kevin it's a long it's a",
            "start": 1720.48
        },
        {
            "text": "best but then it's paired with that beautiful picture of him laying on the bed and you're like I can't be mad at him I can't be mad at him he's you're an interesting person Kevin it's a long it's a long con from I want to go out and just drink and eat with Kevin one day and just ask him questions I don't want to I don't want I just I have questions do do it as exclusive we should we should we should do that that should be your next Patreon exclusive I love that I'm that's what we're gonna do Colin and Kev CK they call it from KC I have questions I have so many questions",
            "start": 1765.76
        }
    ]
}