{
    "id": 1454,
    "video_id": "OA7Jo6P77dw",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Our Favorite Documentaries - The GameOverGreggy Show Ep. 108 (Pt. 4)",
    "description": "Nick Scarpino lets us know what his favorite documentaries are.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1451548800,
    "duration": 1205,
    "transcript_chunks": [
        {
            "text": "This episode is brought to you by Loot Crate. Would you classify yourself as a geek gamer or a pop culture nerd? Then this is a subscription box for you. For less than $0 a month, you get six to eight items of gamer and pop culture licensed gear, apparel, collectibles, unique one-of-a-kind items, and more. Make sure you head to lootcrate.com/kindafunny and enter the offer code Kinda Funny to save $3 on any new subscription. Not that long ago, and depending on where you live, not so far away, Loot Crate blasted off into a voyage across the galaxy, galaxy, galaxy, searching the far reaches of space to find universally awesome gear. Using December's Star Wars: The Force Awakens loot as a launchpad, we landed on some equally cosmic items from Halo 5 and more with an exclusive Funko Pop and an exclusive shirt in this month's crate. This is the loot you're looking for. Basically, Loot Crate is like a friend that knows you and loves you and surprises you with an awesome present every month. You have until the",
            "start": 0.12
        },
        {
            "text": "in this month's crate. This is the loot you're looking for. Basically, Loot Crate is like a friend that knows you and loves you and surprises you with an awesome present every month. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cutoff happens, Jack, that's it, it's over. So go to lootcrate.com/kindafunny and enter the offer code Kinda Funny to save $3 on your new subscription today. Next topic, final topic of the day comes from Patreon.com/KindaFunny, where you can submit your topic if you support us at a certain level and get a whole bunch of other cool perks. And it comes from none other than Kenny Chiar. Again, we're busting out two Kenny Chiar here. This one's been in the hopper for a while. It's going to sound big at the beginning, but then I think we get, I think, okay, who are some of your favorite documentarians? I generally prefer fiction to non-fiction, but there's just something about a good documentary that fascinates me. My",
            "start": 40.12
        },
        {
            "text": "but then I think we get, I think, okay, who are some of your favorite documentarians? I generally prefer fiction to non-fiction, but there's just something about a good documentary that fascinates me. My choice is probably a common yet solid one, Ken Burns. Just a supremely talented filmmaker. In his The Civil War is a master class in documentary filmmaking. Thanks, and Kinda Funny. I say expand the question to what documentaries do you enjoy? I'm sorry, I watch shitloads of documentaries. It's probably what I watch the most. SR's always mad at me 'cause I never want to watch fiction, but I don't know who made all of them. Yeah, the issue is most of the documentaries that you've seen that are actual documentaries, sure, you don't know who made them because it's not about that person's personal agenda. The most famous documentary on the planet, pro, is Michael Moore, but he's not a, he's not making **** documentaries. He's making a statement with his films, which is not necessarily, I don't believe it's true",
            "start": 94.44
        },
        {
            "text": "famous documentary on the planet, pro, is Michael Moore, but he's not a, he's not making **** documentaries. He's making a statement with his films, which is not necessarily, I don't believe it's true documentary filmmaking. Um, I just watched recently a great documentary called Soaked in Bleach, which is the conspiracy behind, uh, or the conspiracy theory behind how Kurt Cobain died. You familiar with this? I know a lot of people think Courtney Love killed him, and this has a lot of really interesting damning evidence, really. But it also doesn't present the, the other side, right? So what it says is all the things that, that the Seattle Police Department **** up and why that they should at least reopen the case, which is interesting. And that some could argue that's what documentary film is. Used, it's on Netflix. Definitely check it out. It's beautifully made too, by the way, 'cause they do the damn, what they do is they do dramatic reenactments that are beautifully filmed. They look like film, they look like a",
            "start": 134.48
        },
        {
            "text": "Netflix. Definitely check it out. It's beautifully made too, by the way, 'cause they do the damn, what they do is they do dramatic reenactments that are beautifully filmed. They look like film, they look like a movie. And then because, um, the story really follows the, the main person who was the investigator that she hired to prove that, to find him when he had gone missing. Even though about halfway through he was like, \"You're lying to me. I'm going to start recording all these conversations.\" And so in the dramatic reenactments, the dialogue and the scene will cut out and the real recording will pop in and throughout the whole film. And you're like, \"Holy ****, she is literally incriminating herself right now,\" saying like, \"Yeah, I mean, I don't know.\" I said, if you watch this, it's pretty hard to not at least think they should reopen the case. Now the problem I have with it is it doesn't present, really does, doesn't do a good job of presenting the investigator on the scene of the day and what he was thinking and why",
            "start": 178.48
        },
        {
            "text": "should reopen the case. Now the problem I have with it is it doesn't present, really does, doesn't do a good job of presenting the investigator on the scene of the day and what he was thinking and why they chose to rule a suicide, even though they do bring in like New York NYPD, like homicide detectives, like, \"You're out of your **** mind. You don't, you don't rule something as a suicide the day of. Like, you got to wait for the forensic autopsy to come back, all the information, and then pictures and all stuff.\" I don't want to spoil it for you. It's really cool. But at the same time, I watched, um, the last, like, I watch a lot of those ESPN documentaries. You can't steal 30 for 30 was going to be my pick up. They do amazing work, and I don't know who does them. They usually bring guest. What are you laughing at, ****? So you can't steal that. Yeah, I like that. That's mine. I was going to say that. So I just, I like, come here, Kev, give me a pound. I love this guy. I love this guy. Good show the camera button. Show him",
            "start": 217.36
        },
        {
            "text": "at ****. So you can't steal that. Yeah, I like that. That's mine. I was going to say that. So I just, I like, come here, Kev, give me a pound. I love this guy. I love this guy. Good show the camera button. Show him what? No, don't do it. Keep it just for me. Cry's show on right now. Lubricate your belly button with your own. Don't, don't stop. Please stop. Please. No, those are great. But yeah, I mean, they, they bring in a guest director. That's why it works, right? Is at 30 for 30. And then different. But they're treated, they're treated so well and with such, yeah. I mean, for instance, the one, the, the one that I remember most, I think, was, uh, Bo Jackson. You're like, \"****, this is kind of sad.\" And it doesn't paint him in a bad light. Yeah, but it does paint the picture of someone who had a great career and then it just like that. Jordan Rides the Bus, other great. What? Broke? That was good. The Boss is **** awesome. Yeah, the B-roll, some now see. But that's some, I think, prop stage when they're like in the",
            "start": 253.2
        },
        {
            "text": "it just like that. Jordan Rides the Bus, other great. What? Broke? That was good. The Boss is **** awesome. Yeah, the B-roll, some now see. But that's some, I think, prop stage when they're like in the, in the storage unit. I'm like, \"All right, like, this isn't really happening, right?\" So that's where you have, not that I don't think his emotions are real, yeah, but I mean, that's where you have to draw the line now is like filmmaking is, a lot of documentary filmmaking borderlines on reality filmmaking in that, sure, you're staging a lot of the stuff. You're not really, um, you're writing the story ahead of time to fit the characters that you're interviewing versus, you know, you go in there and, I mean, I guess Ken Burns probably does that too. Read a lot. Is he? He does a lot of historical research and then finds people that back up sort of what his version of that history is. But to me, a documentary is you go and you interview a lot of people and then in the interview you sort of find whatever the story is.",
            "start": 290.92
        },
        {
            "text": "people that back up sort of what his version of that history is. But to me, a documentary is you go and you interview a lot of people and then in the interview you sort of find whatever the story is. Got, um, and I, for instance, I have a, a friend of mine who I haven't seen it yet, um, did a documentary about autistic people who find love. And I'm like, \"That's cool, right?\" How about Rabbit Fever? Rabbit Fever was, that was a good documentary actually, because, because it painted, it painted, uh, if you're not familiar with this, one of, one of my good friends, Amy Do. \"It's just your friend.\" \"Never.\" \"She **** hates you.\" She said, \"Literally, I **** hate.\" \"I'm in the liner credits or whatever, buddy.\" \"So am I.\" Um, she did a documentary about, um, uh, Rabbit Shows, like Best in Show, but for rabbits, which I didn't think was a world that ever existed. Rabbit Shows, rabbit, it's like rabbit, rabbits. No, no, I, I rabbits. So literally dog shows, but for rabbits. Interesting. Borrowed. It's out there. Did you ever meet her? I know I, I've met her a",
            "start": 332.88
        },
        {
            "text": "that ever existed. Rabbit Shows, rabbit, it's like rabbit, rabbits. No, no, I, I rabbits. So literally dog shows, but for rabbits. Interesting. Borrowed. It's out there. Did you ever meet her? I know I, I've met her a couple times. She knows who I am. Sure. Well, not, she does. You're internet famous. Yeah, internet famous. But that was a good documentary because the people that were in it, I think both sides of it were painted, right? They're well aware that this is an absurd passion of theirs, sure, but they don't give a **** and they like it anyway. And that was the point of the story is like, you can indulge in your passions, just own it and **** everyone else for what they think, right? They love rabbits, they want to go to the show. We got a little glimpse behind that. I'm like, \"I'm never stepping foot in one of those places because it's terrifying.\" But more power to you if that's your thing. Yeah, I think that that's the power of documentaries is, uh, making you care about stuff that you don't care about. Um, um, for me, you",
            "start": 372.48
        },
        {
            "text": "because it's terrifying. But more power to you if that's your thing. Yeah, I think that that's the power of documentaries is, uh, making you care about stuff that you don't care about. Um, um, for me, you know, everyone, a lot of people have seen the Exit Through the Gift Shop Banksy thing and all that stuff. And, and that's cool. And that's like, \"Oh, it's this world that we don't know about.\" Now that's a little bit different because he's kind of mainstream and it's cool to like him. Well, it's also hard to define that as a documentary because about midway through, hijacks it and it becomes, it totally flips itself on its own **** head. And you're like, \"What the hell is happening here?\" It's awesome. But it's a perfect way to describe sort of who Banksy is. That stuff. Yeah, but so something similar, like, you know, he does graffiti and all that stuff. For a long time, my brother was really into, into graffiti. Juiced about, he was juiced about it. He definitely, he was juiced about illegal graffiti. Thank you. And, and it's a",
            "start": 411.64
        },
        {
            "text": "does graffiti and all that stuff. For a long time, my brother was really into, into graffiti. Juiced about, he was juiced about it. He definitely, he was juiced about illegal graffiti. Thank you. And, and it's a legal graffiti, like not legal graffiti, making it clear, illegal graffiti. And, um, there, there's a lot, there's a huge history of that in New York and San Francisco specifically. And there's a documentary called Piece by Piece. And I remember watching it and it's just a bunch of hoodlums. Like, it's just a bunch of people that are doing illegal things. But it's like, it made me shift from looking at this thing and being like, \"This is just straight up wrong,\" to still thinking it's wrong, but being like, \"I get it. Like, I understand why you would do this and the culture that it creates and what it, it does.\" And so it's like the rabbit thing. You're not into rabbits, but hearing that other people are, it's really interesting. And I think it's a great documentary because it made me get it even though I didn't agree.",
            "start": 447.36
        },
        {
            "text": "it's like the rabbit thing. You're not into rabbits, but hearing that other people are, it's really interesting. And I think it's a great documentary because it made me get it even though I didn't agree. Ah, yeah, and that's, that is a good documentary, the power of documentary filming. But otherwise, like, I don't really know too many do, like, I love documentaries, but I don't really know too many that I can think and be like, \"I loved that.\" Like, Helvetica, the documentary, you know, I have not seen that yet. Face one, it's cool. It's just like the history of a font. And I'm like, \"I like that. That's obscure and random enough that I'm into it.\" Um, there isn't enough documentaries about things that I'm interested in that I like. Like, there's one that I saw about LEGOs. I'm like, didn't really like get me the way I wanted to. I think about video games. Like, there's not really a documentary I've seen that like King of Kong. Uh, it was all right, but there hasn't been one that I'm like, \"This is, this is awesome.\" Does that count",
            "start": 490.68
        },
        {
            "text": "I think about video games. Like, there's not really a documentary I've seen that like King of Kong. Uh, it was all right, but there hasn't been one that I'm like, \"This is, this is awesome.\" Does that count as, I'm always worried about what count. This, this definitely doesn't count, but, um, Game Trailers, I'm talking about back in the day, I don't know if they still do this, but they did the retrospective things where they do like 10-part series looking at Zelda. And they'd kind of like talk about the story of the games, but also talk about the history of the games and, um, who made them and like how it shifted and stuff. And I'm like, \"This is really cool.\" And I hope that one day, and I think we're getting to the point now where people are looking at games that way, where we do get to go back and kind of interview the people and, um, have it be like that, like documentary style, where it's like you just the key people involved and talk to them for hours and then make a story out of it. I mean, it's navel-gazing in",
            "start": 528.96
        },
        {
            "text": "the people and, um, have it be like that, like documentary style, where it's like you just the key people involved and talk to them for hours and then make a story out of it. I mean, it's navel-gazing in a way, but I was a big fan of on that thing, IGN's 10th documentary about IGN's 10th. You know what I mean? Remember that? That was great. I was only there a couple months or maybe a year at that point, but made that. Yeah, yeah, they brought in Aaron Boulding and everybody and talked about it. It was like, yeah, I people I, you know, had only read stuff from or seen videos of, brought them all in. They did that, produced it in four parts. It was really good. Yeah, I remember seeing that and like that was when I, I watched it when I was interning at, and it was just interesting seeing like the, the, the birth of this place that is now such a bigger thing. I mean, it like that series makes IGN look like this, you know. No, it was, I mean, I remember making, I remember when we were doing that, um, I, I co, like co-produced. There was a",
            "start": 563.92
        },
        {
            "text": "is now such a bigger thing. I mean, it like that series makes IGN look like this, you know. No, it was, I mean, I remember making, I remember when we were doing that, um, I, I co, like co-produced. There was a lot of other guys that were helping me out because obviously I was like, \"I have no idea what I, I didn't really know what IGN was when I started working there.\" That's the, that's the big joke 'cause I was like, \"I never read this site. I really don't **** know what this is. It's a cool, it sounds like a cool place to work.\" And it was, um, but it was, was awesome doing that because I was like, \"Oh, I'm actually getting an insider perspective on the lineage of this great organization that has weathered this **** crazy storm of .com bust.\" And when you see some of the images of like the building they used to take up and how they got relegated to like a small portion of it and it's just a cache of those really expensive Aeron chairs that are just collecting dust. I'm like, \"That is a perfect image for the '90s, the late",
            "start": 603.56
        },
        {
            "text": "up and how they got relegated to like a small portion of it and it's just a cache of those really expensive Aeron chairs that are just collecting dust. I'm like, \"That is a perfect image for the '90s, the late '90s, early 2000s .com bust.\" Yeah, um, that was, that was fun to make, uh, and that was cool. That was more just like a history piece too. That wasn't, there was no point to that. Like, I wasn't good enough as a, as a, as a filmmaker back then to have been like, \"We should, oh, sure, sure, sure, we should broaden this out, whole context and potent.\" Because we could have, using, and, and this is what I like with that, did you see the Atari documentary about the ET? No, know it. I know of it. It's framed around the dig, the digging up the cartridges in ET and how they had to go find them and figure out where they were and maybe they didn't know they were going to be there and voila, they were there. Oh, but it is a, the bigger story is how the rise and fall of Atari and how they were once a Titan and then are now pretty much",
            "start": 639.32
        },
        {
            "text": "they didn't know they were going to be there and voila, they were there. Oh, but it is a, the bigger story is how the rise and fall of Atari and how they were once a titan and then are now pretty much nothing. Um, and it's, it's a, it's basically an analogy for the industry at that time, which is really, really cool. I wish we could have done that with IGN because it would have been a really, really pertinent, uh, uh, piece on the .com bust. We could have actually probably made something very, very cool. But as a history piece, it worked out. I liked, this is, this is again, like these are movies I haven't watched in a long time, but I remember loving Beyond the Mat. Remember that? In the Bret \"The Hitman\" Hart documentary that just happened to follow him while I got screwed over and stuff. You know, a lot of wrestling stuff, like a lot of the behind the, the, the DVDs that they would release, um, and they're not necessarily documentaries. Yeah, the ones officially from WWE definitely aren't documentaries, but they great looks",
            "start": 680.24
        },
        {
            "text": "like a lot of the behind the, the, the DVDs that they would release, um, and they're not necessarily documentaries. Yeah, the ones officially from WWE definitely aren't documentaries, but they great looks, behind the scenes looks that are like documentary-esque in a lot of ways. And those are excellent. Like, it really, wrestling is such a fascinating thing because it's, it's fake, but all right, they're still doing these things and there's characters, but the characters are real people, so they're actors. And there's so many layers to it 'cause then it's like, all right, then we see the behind the scenes. Are those behind the scenes people also actors? You know what I mean? Like, what, where does the character end? Like, who, Triple H, right? Yeah, he has his on-stage persona, then he has his backstage on camera persona, then he has his backstage documentary persona, and then there's the real him. And it's like watching those videos, it's, it's really cool because you kind of get to see all four of those people in one",
            "start": 719.64
        },
        {
            "text": "then he has his backstage documentary persona and then there's the real him. And it's like watching those videos, it's, it's really cool because you kind of get to see all four of those people in one person, right? Yeah, that was the thing with like, especially I'm thinking, you know, Beyond the Mat and everything else, that's Attitude Era. That's right as it all changed, right? And they gave up the ghost of like having, you know, hiding what really wrestling is or whatever. And I think that's the reason I have that affinity for Mick Foley, right? And stuff, because like, I remember when they put out that Faces of Foley VHS tape and it's him talking to The Hardy Boys, who were nobody at the time. They were like just people they brought out that they knew one day they were going to deal with. Do you not know who The Hardy Boys are? No, I do. I, I just, I thought Kevin was sleeping. I heard breathing high. And, uh, he's talking to them about it. And then Beyond the Mat followed him. And then, you know what I mean, he was, he",
            "start": 764.76
        },
        {
            "text": "Hardy Boys are? No, I do. I, I just, I thought Kevin was sleeping. I heard breathing high. And, uh, he's talking to them about it. And then Beyond the Mat followed him. And then, you know what I mean, he was, he was blowing up that point. But it was like Beyond the Mat was that one that gave you the glimpse of his family, right? And then you got, I, you, I got the book, Have a Nice Day, or whatever. And like, you know, you read through it all and you feel like you know him. And that's like when you know, right? Jeez, last year at New York Comic-Con, right? Last year is when we went to New York Comic-Con for the last time. Yeah, yeah, as IGN. And I was sitting there working and they brought in Mick to interview him or whatever. And it was him and Goldman, I think, talking about that Santa movie he did, which was good. And also a documentary about being Santa, which timely, maybe when this goes up, watch it. Um, but when the interview finished, he said something about, \"Yeah, he's got to take, uh, yeah, my little\"",
            "start": 798.48
        },
        {
            "text": "was good and also a documentary about being Santa, which timely, maybe when this goes up, watch it. Um, but when the interview finished, he said something about, \"Yeah, he's got to take, uh, yeah, my little boy wants to go to, go whatever. He doesn't want to go there anymore.\" I turned around, I'm like, \"Man, that's crazy, you know. Hey, Mick, Dewey doesn't want to do that.\" Whatever. He's like, \"Dewey's 18 now.\" I was talking about my other son. I was like, \"Oh my God, like your life has moved on, but I knew him so well for that one period of time.\" You know what I mean? Yeah, yeah, there's, um, that's why I love Netflix, right? There's all these documentaries that you never would have even, like back in the day, a documentary would come out and unless they gave it a huge marketing push, you were probably like, \"I'm never going to see that **** thing,\" unless it was like a Michael Moore documentary, um, or Morgan Spurlock, um, who I, I, everyone loves Morgan Spurlock. He was the guy that did the Super Size Me. And I'm like, \"I don't get your point here,",
            "start": 833.4
        },
        {
            "text": "thing unless it was like a Michael Moore documentary, um, or Morgan Spurlock, um, who I, I, everyone loves Morgan Spurlock. He was the guy that did the Super Size Me. And I'm like, \"I don't get your point here, buddy.\" I watched that movie and actually kind of pissed me off because I'm like, \"I don't think this is really addressing the problem that we have.\" Yeah, because if you eat anything in excess for that long, you're going to probably, that was, remember there was, I mean, a million people have done it, but like, I remember there's some famous professor who did it, ate McDonald's three times a day for whatever, a salad, 60 pounds. No, he did it. Well, cool is the professor I'm talking about. No, ****, play your VA game, you piece of **** potato. I'm going to get this potato thing to take off that lastek. Really? Yeah, you're fine, buddy. I love you. No, but anyways, sorry. Yeah, and, and he lost weight and he was like, \"This isn't surprising. Stop eating when you're full and you know, work out or exercise.\" Like, yes, if you eat to excess to",
            "start": 874.32
        },
        {
            "text": "buddy, I love you. No, but anyways, sorry. Yeah, and, and he lost weight and he was like, \"This isn't surprising. Stop eating when you're full and you know, work out or exercise.\" Like, yes, if you eat to excess to where you're vomiting the parking lot and doing all this stuff, then yeah, you're going to be, you know what I mean? Yeah, it was, that was that. So that's, that's where I think you, you start to get the, the, the skew, the bastardization of what a documentary is supposed to be. That was an entertaining, that was entertaining, but it was propaganda, right? That was, that was, \"Hey, I have a point to prove and I'm trying to be a celebrity, so I'm going to go do this crazy **** thing.\" That was like a, that was, and I don't mean this as an insult, a Tim Gettys maneuver right there. Like, and it made him famous and now he's doing a series on CNN. Yeah, right, good for him. Still has that horrible face mustache thing. Why do you hate this man so much? I **** took because I was an over-righteous person. I was like, \"You're, you're",
            "start": 915.52
        },
        {
            "text": "doing a series on CNN. Yeah, right, good for him. Still has that horrible face mustache thing. Why do you hate this man so much? I **** took because I was an over-righteous person. I was like, \"You're, you're doing a disservice to people. You're going into **** McDonald's and you're eating 3,000 calories at a time. What you should be doing, what he should have done, was gone in and done a **** documentary about how to lose weight at McDonald's. That would have been fascinating. Hey, I'm eating this three times a day and I lost 30 pounds. How did he do it? Oh, portion control, understanding nutrition, having a salad, drinking water instead of cola.\" Now all he, all he showed was that if you go to McDonald's, you're a fat ass. And I just don't appreciate that 'cause I like me some McDonald's every once in a while. I get that. Um, but yeah, going back to your wrestling talk, matter, did you see the one about The Iron Sheik? Oh, yeah, ****. But that's another weird one. **** man. Yeah, it wasn't, it was like such a, it was a",
            "start": 952.52
        },
        {
            "text": "get that um but yeah going back to your wrestling talk matter did you see the one about The Iron Sheik oh yeah **** but that's another weird one **** man yeah it wasn't it was like such a it was a great documentary and then all of a sudden it's just like this dude gets introduced and he's like yeah I grew up with The Sheik and this that and the other and then all of a sudden it's like you're knocked over the head with this footage that's clearly like four years old you're like oh you made this movie but you just dropped in like in the last quarter to tell me about The Sheik's drug problem and how you pulled him out I'm like what the **** is happening great movie there's a there's a sort of like level of documentary that has hit Netflix cuz I think people are realizing that they can get something on Netflix at least they could a few years ago pretty easily if it was of a certain amount of production quality sure uh so I saw a few in line I saw that one I saw there there's a movie",
            "start": 989.84
        },
        {
            "text": "something on Netflix at least they could a few years ago pretty easily if it was of a certain amount of production quality sure uh so I saw a few in line I saw that one I saw there there's a movie uh a document about Drew Struzan who does the posters for Star Wars and and uh Indiana Jones he did all those it was cool but again it's less of a documentary more of just like hey he's just kind of telling the story and his like this is what happened and it's cool but it could be it's one of those that like should only be like 45 minutes make it at least an hour um and then there's one about John Milius that is similar to that but it's a really cool story you should check it out I think his name is John no John Milius. John Milius did Red Dawn out right now um went to school with uh Spielberg, Lucas, and Zemeckis and all those guys like come talk about during that era yeah it's **** cool to see this guy but he was just too outrageous to like exist in Hollywood so that's a good one too if you like those two",
            "start": 1025.12
        },
        {
            "text": "and all those guys like come talk about during that era yeah it's **** cool to see this guy but he was just too outrageous to like exist in Hollywood so that's a good one too if you like those two years ago the on Netflix they released Turtle Power which is a hourlong documentary on the history of Ninja Turtles and I mean it's it's you know it's more of a history than a documentary thing but I thought it was really it was cool and interesting and like it kind of explains the story of Eastman and Laird and how they created these things and they kind of fell apart as creators and like how they they they don't really like each other and at the end it kind of showed how they're like trying to reform together a little bit's it happens to all the grades it was interesting because it didn't sugarcoat it as much as it could have cuz I think it's an official Ninja Turtles thing um yeah that's the problem and and that's my fear we were talking earlier on Gamescast about what's happening with",
            "start": 1067.08
        },
        {
            "text": "it as much as it could have cuz I think it's an official Ninja Turtles thing um yeah that's the problem and and that's my fear we were talking earlier on Gamescast about what's happening with Hideo Kojima and things like that someone will do a documentary about that one day but will they go as in depth as they need to go it's going to be Nick oh I'd love to I would **** love to do a documentary about that we lay the groundwork in our Japan trip that Tim is now going on the problem is for you know I don't know a lot about Japanese culture but they're not ones to really put that **** out there you know like America where we're like I'm just wearing to sell my story and my soul to make a little bit of money I'm pretty sure Kojima has a little it's called Kojima is going to open up to anybody it's this face ladies and gentlemen this has been The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic discussion for your",
            "start": 1105.4
        },
        {
            "text": "it's this face ladies and gentlemen this has been The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to Patreon.com/KindaFunny where you can toss us a few bucks get every episode early get exclusive stuffs get your questions r on the air like Kenny Char and T TR did today and of course support our dreams if you have no money or don't want or don't like our dreams don't want to support us go over to YouTube.com/KindaFunny where we put it up topic by topic day by day until the entire show posts for free on Fridays as one big MP3 and video this is the last time you're going to see us on camera when we haven't seen Star Wars before nope that's the wrong that's the wrong theme still John Williams wrong thing Oscar till next time it's a pleasure to serve you that wasn't even a that was ****",
            "start": 1143.12
        }
    ]
}