{
    "id": 1382,
    "video_id": "PF8vzFhRLGM",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "The 50 Video Games To Play Before You Die - Kinda Funny Gamescast Ep. 47 (Pt. 2)",
    "description": "Chris Watters wrote a book called The Gamer's Bucket List.\n\nCheck out Chris' book here:\nhttps://t.co/ilU68CGHok\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1448974801,
    "duration": 1035,
    "transcript_chunks": [
        {
            "text": "Hey guys, Kinda Funny is having a holiday sale! That's right, if you go to KindaFunny.com/store for the next week, from Black Friday until the next Friday, you can get 10% off everything in the entire store. That's all the beautiful shirts that you know and love, that's the cups, the mugs, the stickers, all of that stuff is there. And the Let's Him Host shirts, there for this week only. You need that, you need that in your life. Oh, are these all the T-Shirt Tuesday shirts that we exclusively had only on those Tuesdays? Yeah, they're back for one week only, all of them in one place. Buy them for you, buy them for your sister, your friend, your neighbor, whoever you want to buy them for, even people you don't know. It's going to be great. 10% off KindaFunny.com/store. This episode is brought to you by Loot Crate. Would you classify yourself as a geek gamer or pop culture nerd? Then this is the subscription box for you. For less than $20 a month, you get six items of gamer and pop culture license gear apparel.",
            "start": 0.08
        },
        {
            "text": "Would you classify yourself as a geek gamer or pop culture nerd? Then this is the subscription box for you. For less than $20 a month, you get six items of gamer and pop culture license gear, apparel, collectibles, unique one-of-a-kind items, and more. Make sure to head to LootCrate.com/KFGames and enter code KFGames to save $3 on any new subscription. Not that long ago, and depending on where you live, not so far away, Loot Crate blasted off into a voyage across the galaxy, searching the far reaches of space to find universally awesome gear. Using December's Star Wars: The Force Awakens loot as a launchpad, we landed on some equally cosmic items from Halo 5 and more, with an exclusive Funko Pop and an exclusive shirt in this month's crate. This is the loot you're looking for. Remember, you only have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cutoff happens, that's it, it's over. So go to LootCrate.com/KFGames and enter code KFGames to save $3 on your new subscription.",
            "start": 40.0
        },
        {
            "text": "19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cutoff happens, that's it, it's over. So go to LootCrate.com/KFGames and enter code KFGames to save $3 on your new subscription today. So Chris, you wrote a book. I wrote a book. What's it called? It's called The Gamer's Bucket List, where you 50 video games to play before you die. Get it on Amazon at the link right here, the description Greg is gesturing to, or you just go to Amazon, you search, it's there on Amazon too. Uh, yeah, it's in my Twitter profile as well, CT Watters. Uh, you can find the link there. It's uh, it's it's a list book. I love, there's two things I love: lists and video games. Not books. I was about to put books in there. This is two out of three though, so maybe open your eyes to some some book situations. This one I will. It's a list. Yeah, so basically I like, I got this opportunity to write uh, this book through a publisher and they were like, yeah, you're just going to have to pick 50 video games from all video games ever.",
            "start": 78.68
        },
        {
            "text": "a list. Yeah, so basically I like, I got this opportunity to write uh, this book through a publisher and they were like, yeah, you're just going to have to pick 50 video games from all video games ever and make your list based on sort of what parameters you wanted to. Did you say no problem, then hang up and go, this is a huge problem? Like, oh my God, yeah. I mean, I'm sure we've all written lists uh, in our time once or twice. And like, so the key is to like, you have to like, set your parameters, like, what am I going to put in this book? So the stuff that I wanted to put in was like, I wanted to write it in a way that, you know, you guys would read it and you'd read about Red Dead Redemption, and even though you've read, you've played that game, you've read so much about it, you'd read it and be like, yeah, that that game was really awesome. But then also, you pass it to your mom when you're home for Thanksgiving and she's like, ah, it's a cowboy game. You know, she reads like, but she reads 300 words about it and she",
            "start": 129.8
        },
        {
            "text": "game was really awesome. But then also, you pass it to your mom when you're home for Thanksgiving and she's like, ah, it's a cowboy game. You know, she reads like, but she reads 300 words about it and she like, kind of understands the experience. Like, there's no, I steer away from like, jargony terms. Like, I didn't mention the word Roguelike when I wrote about Spelunky, you know? Like, I wanted this to be super accessible because that's kind of the niche that it is. Like, it's like 1 bucks, like Barnes & Noble's gonna like, it's the kind of thing that I imagine is put by a register and people are just like, oh, sure, my kid likes video games. Yeah, yeah, yeah. And so I think that like, so it's that broad, it's a broad appeal kind of book. It's not, it's not a history lesson per se. It's not a sort of, here are like the most significant games in history. And, you know, if there's a significantly awesome game and then the sequel is like a little bit more awesome, I'll choose a sequel, you know? So like, so Uncharted 3.",
            "start": 169.16
        },
        {
            "text": "most significant games in history. And, you know, if there's a significantly awesome game and then the sequel is like a little bit more awesome, I'll choose a sequel, you know? So like, so Uncharted 3 confirmed in the book? No, no, see, it's Uncharted 2, damn it. Uh, one of the restrictions I put in there for myself, for my sanity, was about online connectivity because I wanted people to be able to like, I wanted it to be somewhat future-proof. Obviously, any list book is kind of like immediately outdated in video game world, uh, more or less. But like, uh, if the primary way that this, that like a game excels is online, I left it out. So like, no MMOs, no like Call of Duty and Battlefield are like, you know, even though they have some campaigns, like primarily, like my enjoyment of those games has come from the online shooting multiplayer competition. So I left them off the list. Uh, but even still, it was hard to narrow it down. Yeah, so what were the parameters you set up other than online stuff? I just sat down.",
            "start": 207.48
        },
        {
            "text": "online shooting multiplayer competition. So I left them off the list. Uh, but even still, it was hard to narrow it down. Yeah, so what were the parameters you set up other than online stuff? I just sat down, was like, what like, if I was gonna talk with someone about like the greatest games, what would I, what would I start with? And that was another thing, like taking ownership of like, I'm the author of this book, these are all my opinions. There's no committee to vet this against. Yeah, like I am obsessed with Rocket League and have been since. I'm going to put Rocket League in there because I also feel like I can back that as like one of the greatest sports games ever created. Uh, you know, and so just sort of like brainstorming, coming up with, you know, a lot of them are like really popular titles, but then there's some other ones that uh, sort of, you know, go a little bit in different directions. Uh, like I put Her Story in there because I think that that's like such a a fascinating way to like feel",
            "start": 252.8
        },
        {
            "text": "then there's some other ones that uh, sort of, you know, go a little bit in different directions. Uh, like I put Her Story in there because I think that that's like such a a fascinating way to like feel investigative. Like, there's a lot of investigation in games, but like, if you're putting on detective mode and just looking for the highlighted thing, you don't like feel like an investigator. Or it's L.A. Noire, where I went down the list of every name till they were like, that's the name. I was like, yeah, it is. You're goddamn right it is. I such a detective. So I wanted to, you know, put that alongside Skyrim and Civilization V in terms of just like, here is the broad diversity of gaming sampled. Like, you read this book, you're going to see that there's just like so so many awesome things about games. What were the controversial picks that you put on? Well, I haven't like received a, the book is out now. It came out on Tuesday, the 24th, the physical copy. Uh, I haven't received a deluge yet of like, yet, why is it not",
            "start": 289.48
        },
        {
            "text": "controversial picks that you put on? Well, I haven't like received a, the book is out now. It came out on Tuesday, the 24th, the physical copy. Uh, I haven't received a deluge yet of like, yet, why is it not on there? Uh, but I did put my Twitter handle in the book, like, reach out to me, like, let's talk about stuff that's in there, um, or not in there. Uh, I don't know if I like, I anticipate, okay, so I did, I was talking with uh, some of my former co-workers uh, on the reviews team at GameSpot, Kevin VanOrd, Tom McShea, Carolyn Petit. And I was like, I'm putting a God of War in there. And they were like, God of War I sounds great. But I put God of War 3. Nice. Much to their consternation. Uh, but like, I felt like, you know, that's that's a new con, the next console generation. The spectacle of that series is a lot about it, you know? So like, I I was having these arguments with myself, making it like, okay, what is the person on Twitter gonna say? What when I talk to Colin about it, what is he going to come at me with? Like, I cannot",
            "start": 333.92
        },
        {
            "text": "So like, I I was having these arguments with myself, making it like, okay, what is the person on Twitter gonna say? What when I talk to Colin about it, what is he going to come at me with? Like, I cannot believe that you put such and such game on there. Uh, so I did that to an extent, but also had to just be like, look, this is going to be fun to read. It's going to be fun to read about great games. It's not comprehensive, that is impossible. Yeah, so what, what I'm cur, I have a few questions. What is the oldest game on the list? The oldest game on the list is Tetris. Tetris. And what, what is the the platform distribution? Do do you touch like everything from, so Tetris, so like NES era through um, Genesis, Super Nintendo, and then all the way up till PS4 on Xbox One? Or, yeah, so there's there's not a ton of Genesis, Super Nintendo stuff. Like, I also was kind of kind of had in mind, uh, like accessibility. Like, you know, not not every game I write about needs to be like downloadable from Steam or something like that, but",
            "start": 374.72
        },
        {
            "text": "Nintendo stuff. Like, I also was kind of kind of had in mind, uh, like accessibility. Like, you know, not not every game I write about needs to be like downloadable from Steam or something like that. But I want it to be kind of reasonably plausible that people were going to get access to it. So like, I didn't put Dreamcast games on there, but that's also because I didn't, I don't like personally have a ton of experience with Dreamcast. So that ch also sort of fed into it. Um, but yeah, there's like, you know, there's Super Mario World and there's uh, Super Metroid and Mega Man from that era. Um, but then also, you know, stuff like Super Meat Boy. So like, I'm looking at, you know, Platformers like Sonic that I like really enjoyed on the Genesis when I was a kid. But like, all right, what was what was cool about that game? Like, fast platforming. Like, Super Meat Boy does like precision fast platforming incredibly well. That fills this niche really well. I don't need to, you know, I don't need to go into the past to pull",
            "start": 422.84
        },
        {
            "text": "game like fast platforming. Like, Super Meat Boy does like precision fast platforming incredibly well. That fills this niche really well. I don't need to, you know, I don't need to go into the past to pull something from that. Uh, I try to cover my basis. I had this like Excel spreadsheet with like all these different attributes and different columns listed about the games just to try to make sure uh, the the net was covered to to some degree. Did you talk to anyone? Like, was it just you coming up with this or did you kind of go back and forth with some people? I came up with like maybe 80%. I've had the list and then I was like, oh crap, I only have a like 10 slots left. And so I started asking people, the my friends I mentioned earlier, uh, some of my good friends who still do play games passionately, like, what would you want to see on the list? Um, I didn't like take to Twitter and ask or anything. Uh, but I did, you know, do research and peruse like, all right, what, you know, what games am I forgetting? What",
            "start": 466.04
        },
        {
            "text": "what would you want to see on the list? Um, I didn't like take to Twitter and ask or anything. Uh, but I did, you know, do research and peruse like, all right, what, you know, what games am I forgetting? What genres am I trying like not representing? Um, so yeah, it was mostly me, but I mean, and I made the final decision on all of it because all what I had to submit to the publisher was the the table of contents and then 300 words on each game. And then they sort of populated the book with all these nice screenshots. Uh, I was hoping to have it a copy here today, but uh, there was some shipping shipping goofs. God dang it, goof goofs out there in the shipping verse. But um, yeah, yeah, it was uh, it was it was really fun kind of like, yeah, cuz like I found myself writing about these games and I'm like, okay, uh, yeah, let me write about like Brothers: A Tale of Two Sons, which is a game that like really moved me personally. But then write about, you know, Skyrim and like write writing about that game and there's been so",
            "start": 507.84
        },
        {
            "text": "me write about like Brothers: A Tale of Two Sons, which is a game that like really moved me personally. But then write about, you know, Skyrim and like write writing about that game and there's been so much said about it. You so so many books, blogs, videos, whatever written about it. But writing about it again, it sort of with me like, oh right, this is a game that people take for granted as one of the best games ever. But like actually writing about why is the best, like I felt myself getting hyped for these games as I'm typing them up and I like tried to put that into the writing too because like I want you to read this a passage on a game and get hyped for it even if you know you've played it before or if you've never heard of it. Good way to be. Yeah, definitely. You have any questions, Portal? I mean, my my, yeah, it's interesting. I guess the for for me when we were at IGN, we would do list. It was always the thing I hated the most cuz it would inevitably be us locked in a room. Colin and I would barter",
            "start": 549.72
        },
        {
            "text": "my my, yeah, it's interesting. I guess the for for me when we were at IGN, we would do list. It was always the thing I hated the most cuz it would inevitably be us locked in a room. Colin and I would barter and trade down to get the list to where it is. And then we'd bring in other people and they'd be like, what about this game? What about that game? What about? And I guess the argument was always, well, we didn't play that so we can't back it or whatever, you know what I mean? But like I said, when it's just your list, it's pretty easy. Yeah, when it's your list, like the buck stops here. I I didn't put this one on there because I had some reasons or because, oh, it just it just filled up. I don't know, you know, there's no sort of like, there's no consensus that needed to happen. Uh, and so I think that like, like, yeah, people are going to have fun seeing what I chose and they're also going to have fun uh, writing me on Twitter and being like, you son of a ****. Is there a ranking to it or is it just 100? So I",
            "start": 593.56
        },
        {
            "text": "yeah, people are going to have fun seeing what I chose and they're also going to have fun uh, writing me on Twitter and being like, you son of a ****. Is there a ranking to it or is it just 100? So I wrote in the forward that like, I chose 50 and I like narrowing that list down was hard enough. I could not rank top like like one through 50. So I literally I I chose Spelunky first because that's like probably my all-time favorite. That's what jumped in mind when you got the book like makies on it. Oh yeah, okay. Yeah, yeah, yeah. Spelunky was, I was like, that has to be on there cuz you go Spelunky is incredible. Uh, so I I like, I put that first and then literally Googled random like number randomizer and then randomize the rest of the list and that's the order of the book. Uh, but yeah, there's like, there's an extra little bells and whistles in there. There's uh, forward from Craig Skistimas from ScrewAttack, uh, who we who I like collaborated with on it a little bit. And then um, there's like a list at the end of",
            "start": 630.0
        },
        {
            "text": "little bells and whistles in there. There's uh, forward from Craig Skistimas from ScrewAttack, uh, who we who I like collaborated with on it a little bit. And then um, there's like a list at the end of the book of all the games with like five stars and like rate it yourself, keep track of the ones you've played, ones you haven't played, just a little history of gaming with some like Wikipedia facts and stuff like that in there. Uh, yeah, yeah, so it's it's a fun little, I think it's a fun little like gift book. It's a fun little holiday thing. Um, and it's just kind of a a neat like like survey of like, yeah, like video games are really really great and I wanted it to, you know, be accessible to people as well. So how cool is it to know you're gonna have a book in bookstores? It's yeah, it's pretty cool. I mean, I have some experience like, I don't know if you guys know that I have like my face is in Target a little bit. Oh, I've seen you. I've tweet tweeted you some pictures like, have you guys seen this? Yeah, yeah.",
            "start": 673.88
        },
        {
            "text": "have some experience like, I don't know if you guys know that I have like my face is in Target a little bit. Oh, I've seen you. I've tweet tweeted you some pictures like, have you guys seen this? Yeah, yeah, yeah. I'm just I just hear Chris's voice. I'm like, what the hell is happening? I look over and it's just like the little screens. It's like, you should buy Wii U. I'm like, okay, should you never said that. Uh, but like, so I have some experience of people like tweeting pictures of me and a store at me. But like, that's like a short video we did through GameSpot. But this is like something that I I wrote. I like totally and like, I'm like reading through and it's like, yeah, I did a good job with this. And so yeah, I'm super excited. Was it hard to balance your time? You know what I mean? Like, we're we're we know the life of having a 9-to-5 then coming home to work on a passion project. But ours is was yelling at a camera and then all right, we edited or whatever. I feel like a book and going back and forth with a",
            "start": 717.16
        },
        {
            "text": "life of having a 9-to-5 then coming home to work on a passion project. But ours is was yelling at a camera and then all right, we edited or whatever. I feel like a book and going back and forth with a publisher and doing all this different leg work and trying to pick your list. Did it like consume everything for a while? It did for a while. Yeah, it was actually a really short turnaround. I started at the beginning of August and I had to submit my draft by like Labor Day weekend. Oh wow. So that's like five weeks I had. So I literally like in P I like penciled out a calendar and was like, okay, so like Tuesday night I come home, uh, we have to go to the grocery store. I can't work that night. Wednesday night, uh, like two, I can write two to three, uh, you know, and like I'm working with my wife to like clear up our schedule. Like, I need this Saturday. I can write like, I can write like 7 to 9 depending on how it goes on Saturday. So it was I had to rigorously schedule it and I was talking with another friend of",
            "start": 759.0
        },
        {
            "text": "our schedule. Like, I need this Saturday. I can write like, I can write like 7 to 9 depending on how it goes on Saturday. So it was I had to rigorously schedule it and I was talking with another friend of mine, Laura Parker, who's an author and writes for a bunch of outlets, the you know, New York or New York Times and stuff. And she was writing a book herself and she was just like, how like, how do you have any sort of what, how do you marshal your thoughts? How do you start in on a book? It was a little easier because this is like a very clearly formatted. Like, I can write one, I can get it done in a night and I can have that ticked off. I don't have to like structure a chapter or something like that. So that definitely helped with the quick turnaround. But yeah, it consumed a lot of my life for a very brief amount of time. And then like, okay, now I'm just going to wait. And then here's the final proof edit. Oh my God, I have to spend all weekend looking at this thing and fixing errors. Okay, and then it's",
            "start": 796.04
        },
        {
            "text": "amount of time. And then like, okay, now I'm just going to wait. And then here's the final proof edit. Oh my God, I have to spend all weekend looking at this thing and fixing errors. Okay, and then it's gone. You're just gonna wait to hear from us. And now it's sort of book tour like, uh, go go around and promote it. And then I don't know what's going to happen after that. Where where else are you going to the Today Show? It seems like when people have books, they go on the Today Show. I feel like I should get some, you know, some CBS leverage here. But but it's but it's like a separate thing. It's separate from the work endeavor. Uh, you know, like you guys know, uh, personal projects sometimes have to be uh, so did another podcast with some friends, uh, Video Game Apocalypse last night. Going to go on some more podcasts in the coming weeks. So uh, yeah, The Gamer's Bucket List. It's exciting. And the link's in the below. Definitely check it out. Oh, you're putting the graphic wack up too. Yeah, can you do that, Kevin? I love",
            "start": 835.52
        },
        {
            "text": "in the coming weeks. So uh, yeah, The Gamer's Bucket List. It's exciting. And the link's in the below. Definitely check it out. Oh, you're putting the graphic wack up too. Yeah, can you do that, Kevin? I love the graphic uh, hand gestures. Just slides on in. And thank you guys for having me on to talk about it. Congratulations. It's awesome. Huge news. I'm excited to look at it. I really do love list. So I'm I'm excited to break it down. I can't wait to hear and disagree with you cuz that's that's the best part of this. That's going to happen. Yeah. Um, ladies and gentlemen, this topic brought to you by TipsyElves.com. If you need a holiday sweater, an ugly Christmas sweater, you should definitely go there. Kevin, sweater me. Oh Lord Almighty. All right, so this sweater, only Kevin would mess up tossing. Only Kevin would mess up tossing in a sweater and then almost tear it apart. Oh God, can you do something with that, Kevin? So this is the one that they sent Nick. No, no, this is Greg. Greg Miller. I get to wear this thing. The",
            "start": 872.48
        },
        {
            "text": "up tossing in a sweater and then almost tear it apart. Oh God, can you do something with that, Kevin? So this is the one that they sent Nick. No, no, this is Greg Miller. I get to wear this thing. The Santa, the the sex sexy Santa Centaur Six. So that's yours. Should I put it on? No, just hold it up. Just hold it. People know. The red hooves are a nice touch. Yeah, they are. They are. This this one here is Nick's, the Feliz Navi-dog, which might be my favorite. Can you hold this, Chris? Damn, that seemed real genuine. Good work, Kevin. Was definitely abused. It was like legit legit cracked him up. See Colin's amazing Ninja Turtle style gingerbread cookies. A are heavy thick sweaters. Here's my beautiful beautiful reindeers getting it on shirt. So me, so me. So yeah, if you want these shirts or a way bunch of other ones, you should go to TipsyElves.com. You can get 20% off the entire site if you use the code Kinda Funny Games. It's going to be a good time for everybody. They have a whole bunch of stuff. They have like",
            "start": 914.72
        },
        {
            "text": "you should go to TipsyElves.com. You can get 20% off the entire site if you use the code Kinda Funny Games. It's going to be a good time for everybody. They have a whole bunch of stuff. They have like college like collegiate shirts and stuff too. They also have like themes. What does that mean? Like shirts. Can I get a Mizzou shirt there? I don't know about Mizzou, but like there's definitely like college shirts. You should check it out. They no one want to be wearing Mizzou **** anymore. Um, a lot of people are students. Are we're bringing it. We're taking Shark Tank. Oh cool. Yeah, I love Shark Tank. I'm out. I'm out. TipsyElves.com. Use the promo code Kinda Funny Games. It'll be fun. Let me know what you buy. Did they did they succeed on Shark Tank? Is this are we by promoting these, are we kind of promoting Mr. Wonderful? Yes. Wow. Yeah, feels does it. Oh, Shark's great. I've seen it's the Mark Cuban is on there and he tells people about how much money he wants to give them or not. Yeah, yeah, it's a wonderful",
            "start": 973.36
        },
        {
            "text": "Mr. Wonderful. Yes. Wow. Yeah, feels does it. Oh, Shark's great. I've seen it's the Mark Cuban is on there and he tells people about how much money he wants to give them or not. Yeah, yeah, it's a wonderful show. I'll give you $10,000 for 5% of your business.",
            "start": 1015.6
        }
    ]
}