{
    "id": 1386,
    "video_id": "pXT4hIGwof4",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "The Game Awards 2015 Winner Predictions - Kinda Funny Gamescast Ep. 47 (Pt. 3)",
    "description": "We try to predict who will win big at The Game Awards 2015.\n\nCheck out Chris' book here:\nhttps://t.co/ilU68CGHok\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1449061201,
    "duration": 2012,
    "transcript_chunks": [
        {
            "text": "Hey guys, Kinda Funny is having a holiday sale! That's right, if you go to KindaFunny.com/store for the next week, from Black Friday until the next Friday, you can get ten percent off everything in the entire store. That's all the beautiful shirts that you know and love, that's the cups, the mugs, the stickers, all of that stuff is there. And the LED Team Hosts shirts, they're there for this week only. You need that, you need that in your life. Oh, are these all the T-Shirt Tuesday shirts that we exclusively had only on those Tuesdays? Yeah, they're back for one week only, all of them in one place. Buy them for you, buy them for your sister, your friend, your neighbor, whoever you want to buy them for, even people you don't know. It's going to be great. Ten percent off KindaFunny.com/store. This episode is brought to you by Loot Crate. Would you classify yourself as a geek gamer or a pop culture nerd? Then this is the subscription box for you. For less than twenty dollars a month, you get six great items of gamer",
            "start": 0.0
        },
        {
            "text": "to you by Loot Crate. Would you classify yourself as a geek gamer or a pop culture nerd? Then this is the subscription box for you. For less than twenty dollars a month, you get six great items of gamer and pop culture licensed gear, apparel, collectibles, unique one-of-a-kind items, and more. Make sure to head to LootCrate.com/KF Games and enter code KF Games to save three dollars on any new subscription. Not that long ago, and depending on where you live, not so far away, Loot Crate blasted off into a voyage across the galaxy, searching the far reaches of space to find universally awesome gear. Using December's Star Wars: The Force Awakens loot as Launchpad, we landed on some equally cosmic items from Halo 5 and more, with an exclusive Funko Pop! and exclusive shirt in this month's Crate. This is the loot you're looking for. Remember, you only have until the 19th at 9:00 PM Pacific to subscribe and receive that month's Crate. And when the cutoff happens, that's it, it's over. So go to LootCrate.com/KF Games",
            "start": 37.65
        },
        {
            "text": "you're looking for. Remember, you only have until the 19th at 9:00 PM Pacific to subscribe and receive that month's Crate. And when the cutoff happens, that's it, it's over. So go to LootCrate.com/KF Games and enter code KF Games to save three dollars on your new subscription today. Alright, third topic of the day. I want us to predict The Game Awards winners. Greg Miller, yeah, before you get into the topic, if it's still, you know, it should be, yeah, okay, I'll be good. No matter when you're listening to this, you should still be able to vote. I mean, if it's voting up until, try to vote for me. Yeah, go to TheGameAwards.com, click on Nominees, click on Trending Gamer. And if you can still vote for me, vote for me there. Go to the library, if anyone is still logged in, vote for Greg Miller. Yeah, go to your mom's house. You vote by #TGAGregMiller or going on their site and clicking this and going to their Facebook wall. I don't understand Facebook. And remember, other hashtags include #TGAGregMiller ziggo. Mm-hmm.",
            "start": 75.51
        },
        {
            "text": "you vote by #TGAGregMiller or going on their site and clicking this and going to their Facebook wall. I don't understand Facebook. And remember, other hashtags include #TGAGregMiller ziggo. Mm-hmm. #TGAPewDiePie is no, don't do the PewDiePie. The PewDiePie was detrimental to what we're doing. You're welcome to do #TGAGregMiller and then in a separate edition, #TGAGrandmothersEgos. So what I wanted to do, I thought would be fun, The Game Awards are coming on either tomorrow if you listen to this as the breakout, or next week if you're listening to this on Patreon. I wanted to go through each of the different categories, go to the nominees, and kind of say who we think's gonna win. So how do we think should, okay, so we're predicting what will really win the category. Got it. Yes. And uh, so the upfront year's nominees for The Game Awards are selected by a jury of 31 international media. In some cases, the jury's provided advanced review code of upcoming games in order to meet The Game Awards judging",
            "start": 127.01
        },
        {
            "text": "year's nominees for The Game Awards are selected by a jury of 31 international media. In some cases, the jury's provided advanced review code of upcoming games in order to meet The Game Awards judging deadlines. Games must have been commercially released by Tuesday, November 24th to be eligible for awards. Esports nominees were voted on by an advisory panel. Consignments immediate rights, yellow one. Um, so the people voting on it, is this like a collection of high-ups at all the different, you know, gaming journalism? Come, Talmadge Blevins is on this. Yes. He and Howard of GameSpot. Owen Howard of GameSpot. Ben Howard, Owen Howard. That's a bus guy. How are we ever had? He's got opinions. Um, so it's cool. Got a couple of our friends doing some stuff there. Uh, let's start big. Game of the Year. We're starting with the granddaddy of them all. The only way to give me the nominees, Tim: Bloodborne, Fallout 4, Metal Gear Solid V: The Phantom Pain, Super Mario Maker, huh, and The Witcher 3: Wild Hunt. So see, this is true, this",
            "start": 168.74
        },
        {
            "text": "granddaddy of them all. The only way to give me the nominees, Tim: Bloodborne, Fallout 4, Metal Gear Solid V: The Phantom Pain, Super Mario Maker, huh, and The Witcher 3: Wild Hunt. So see, this is true, this tricky order-wise, 'cause you want, 'cause the way that these awards have worked in the past, if something wins in one category, it's like not gonna sweep necessarily. I feel like they, part of their, their voting ethos is like, well, if we give this one, you know, Best Action/Adventure, then let's not give it Game of the Year. We still honored it. Yeah, we can give something else. Get usually us either. Yeah, I think it's Metal Gear, 'cause then I can see them not giving Metal Gear like the random ass other things. Fallout for random ass other thing. I'm gonna say Fallout. See, here's my thing, my dilemma is, I think it'll be Super Mario Maker. I agree. And I think it's going to, because Fallout and Metal Gear gonna knock each, are gonna divide the votes. And then your Nintendo die-hards go through with Nintendo. Yes, we agree. Yeah, we",
            "start": 220.22
        },
        {
            "text": "Maker. I agree. And I think it's going to, because Fallout and Metal Gear gonna knock each, are gonna divide the votes. And then your Nintendo die-hards go through with Nintendo. Yes, we agree. Yeah, we agree. Sun Chronicle, my guesses. Tally them down. Someone, come, Hawkins, put these on the board. Developer of the Year. Bethesda Game Studios, CD Projekt Red, FromSoftware, Kojima Productions. Yeah, right. Nintendo. It's gotta be CD Projekt. I think it's gonna be CD Projekt. Yeah, I agree. Just 'cause they really impressed. Really, no, no one knew that they were capable. Yeah, great game, three DLC. Thought they were the first thank you letter this year to fans and their game and all this stuff. Like, I definitely think that that's where you honor them. I think, I mean, I think, well, that's good, but I really do think it's so much simpler. It's like that they delivered a game no one knew that they could, they were capable of making. Same thing I would say about Techland with Dying Light. Like, no one knew that they can make this",
            "start": 268.31
        },
        {
            "text": "simpler. It's like that they delivered a game no one knew that they could, they were capable of making. Same thing I would say about Techland with Dying Light. Like, no one knew that they can make this game. Yeah, you know. So it's, I think, I think they win by almost by the fall, even with The Witcher being so great. The stuff that they were promising in The Witcher 3, just like, oh my God, it's going to be this big. And then I do remember the sensation you got, like, I don't know, I didn't play it much before release at all, but like, people who would play it would come back and would have that look in their eyes of like, holy ****, they did it. This like, polish dude. Damn. Yeah, it's really, it's really cool. There's a Eastern European like Renaissance in games right now. It's really, really cool. Watch with, with Metro and with Witcher and with Dying Light and a lot of games coming out of there that are like really good. Mm-hmm. Best Independent Game. Axiom Verge gets next vote for sure. Of",
            "start": 312.8
        },
        {
            "text": "Metro and with Witcher and with Dying Light and a lot of games coming out of there that are like really good. Mm-hmm. Best Independent Game. Axiom Verge, Her Story, Ori and the Blind Forest, Rocket League, Undertale. It's gotta be Rocket League. But I, I, but I'm like, what is there? I'm curious, but the criteria for this. Microsoft-published Ori, that's not a, that's not a, that's not an independent game. Moving the attending developer that, yeah, by a small, but then three ways, an independent game, you know what I mean? Like that. Yeah, I'm with you. I'm just saying. Um, I'm with you. Rocket League. I think Psyonix, Rocket League might be my personal Game of the Year. I think it's gonna win Game of the Year's first. Yeah, I've said, I've said that too. That's a, I mean, I've been, I've been like it, like a lot. Like, yeah, I know you guys like, I've been beating the drum on that game for a long time. Or my, this game's really",
            "start": 348.02
        },
        {
            "text": "first. Yeah, I've said, I've said that too. That's a, I mean, I've been, I've been like it, like a lot. Like, yeah, I know you guys like, I've been beating the drum on that game for a long time. Or my, this game's really gonna **** blow people away. And yeah, I would you think that game's gonna win Game of the Year from like big outlets for sure. Um, yeah, I would say Rocket League. That's a great list of games though. Yeah, Ori was also one of my faith. That's like the first Metroidvania I ever like 100% and I like it. It's because of the movement and it just felt good to go around and backtrack and stuff like that. It just like, I liked it. And I just, I just hate, it's what, just to that topic, that on set to belabor the point, but it reminds me of like, back in the day at IGN, we used to have conversations about what we used to give a Downloadable Game of the Year, right? And then we were like, well, it's just a game. And with the same with independent games, it's like, why are we stigmatizing them basically?",
            "start": 393.45
        },
        {
            "text": "what we used to give a Downloadable Game of the Year, right? And then we were like, well, it's just a game. And with the same with independent games, it's like, why are we stigmatizing them basically? Independent games, especially when I will contend that one of those games is decidedly not. Yeah, I think they're just doing it to make sure like, to give these guys an award. Just Downloadable Small Game of the Year. Yeah, that'd be a better way. Small studio. These, I really think that like, games like a few of those games can go ahead with the games that you listed in Game of the Year. But I, what, what is Undertale? I don't know if I know what that is. So Undertale is like, it's kind of a JRPG or an RPG kind of looking thing. It's um, looks, it's, it looks like it's a Shining Force or an early Final Fantasy in terms of the viewpoint. But the thing is, you like, in your monster, it's very, has modern sensibilities. It doesn't, it's not like, I don't know if it's set in the modern day, but like, when you meet a monster,",
            "start": 429.12
        },
        {
            "text": "of the viewpoint. But the thing is, you like, in your monster, it's very, has modern sensibilities. It doesn't, it's not like, I don't know if it's set in the modern day, but like, when you meet a monster, you can like, try to like, figure out what the deal is with this monster. And like, they have weird personality stuff going on. And you can like, ex, like, you can beat the game or get through conflicts by, you know, fighting and doing weird attacks or by like, having conversations. And it has this very subversive feel to it that takes a lot of these sort of RPG genre staples and just like, makes it as if someone wrote it in like, I don't know, wrote it off of some, some very sort of modern, and my words are failing me, but like, this is why you're a writer. Yeah, these books. I haven't actually played it myself. Duh. We're doing a great job because we already don't know. But yeah, that's it. That's why it's been gaining a lot of attention is because it's a sort of creative and subversive take on an RPG. Mm. Best Mobile /",
            "start": 465.69
        },
        {
            "text": "doing a great job because we already don't know. But yeah, that's it. That's why it's been gaining a lot of attention is because it's a sort of creative and subversive take on an RPG. Mm. Best Mobile / Handheld Game. Just Downwell. Don't know that is, do you? Oh, yeah, I've been playing Downwell. About this mobile, is the only touchy touch games. Yeah, yeah. Here, you don't, you hold it vertically and basically your dude is always falling Downwell. You can move left or right and you can like, you can arrest your descent by shooting or you can just keep plummeting. And there's just various enemies that you come try to get through and there's power-ups you can get along the way. But you know, and every time you start, you start a new, uh, which kind of thing. Uh, really challenging, but kind of cool. I'm on its on Vita. Has a platinum trophy. Fallout Shelter, Lara Croft GO, Monster Hunter 4 Ultimate, Pac-Man 256. A terrible **** list. They ignore all that, all these awesome 3DS and Vita games that came out this year.",
            "start": 510.63
        },
        {
            "text": "has a platinum trophy. Fallout Shelter, Lara Croft GO, Monster Hunter 4 Ultimate, Pac-Man 256. A terrible **** list. They ignore all that, all these awesome 3DS and Vita games that came out this year for this nonsense. Danganronpa Another Episode, right? And Fallout Shelter. Yeah, everyone playing Fallout Shelter. Yeah, I played Lara Croft GO and it's cool, but it's, it's like, it never really reached the like, challenge that I wanted it to. It was always like, almost awesome. Pac-Man 256, I think it's **** great. Did any of you play that at all? And it's super cool. It's just Pac-Man, but like, it's a Vita. It's like Crossy Road Pac-Man, right? Yeah. And it's just in Saints, the visuals are amazing. I'm saying I'd be betting Fallout Shelter's the winner there. Best Narrative: Her Story, Life is Strange, Tales from the Borderlands, The Witcher 3: Wild Hunt, or Until Dawn. Life is Strange will win, you think so? Yeah, Tales from the Borderlands is a critic darling as well though. I think Life is Strange being uh, being new IP is",
            "start": 554.82
        },
        {
            "text": "The Borderlands, The Witcher 3: Wild Hunt, or Until Dawn. Life is Strange will win, you think so? Yeah, Tales from the Borderlands is a critic darling as well though. I think Life is Strange being uh, being new IP is gonna like, I think Tales from the Borderlands is gonna be a little hurt by the fact that it takes more Borderlands universe, which it was funny, but was it a great name? It was a great story. Yeah, I see the Until Dawn gets a chance now. I think it's actually not. I think it's good. I think I, I'm saying the winner will either be Her Story or Life is Strange. Life is Strange is definitely when people love as well. I minute before we give our answer for that one, I was gonna get answers done. I'ma skip ahead a bit. What to impress there is the topic called Games for Change. What the **** does that mean, Sibel? Yep. Her Story, Life is Strange, Sunset, or Undertale. What does that mean though? It is a life, I'm assuming in jeans, like they didn't want to say social justice games. You made a step forward. Yeah, yeah, but they, yeah.",
            "start": 603.51
        },
        {
            "text": "Life is Strange, Sunset, or Undertale. What does that mean though? It is a life, I'm assuming in jeans, like they didn't want to say social justice games. You made a step forward. Yeah, yeah, but they, yeah. I don't know. So that's the story one. You know what would make Her Story, Life is Strange win this and not, 'cause I mean, if we're reading into Change correctly, then I did it with, if I'm going down your argument road and we're reading into the Change correctly, then Change is Life is Strange. Her Story would be story. Okay, our narratives. I was you. Yeah, that's narrow, which we will get it now. 'Cause with Her Story and with Until Dawn, I feel like maybe it's not, it's not so much of a narrative as like the narrative structure, like the narrative mechanics and the way it unfolds. Sure. As opposed to like, sure, to just sit down and read the story of it. Yeah, is it cool? But you know, that's, that's all tied up in, yeah, I agree with that. Until Dawn is one of my favorite games of the year by far, but it's not because of",
            "start": 652.44
        },
        {
            "text": "sit down and read the story of it. Yeah, is it cool? But you know, that's, that's all tied up in, yeah, I agree with that. Until Dawn is one of my favorite games of the year by far, but it's not because of the nature, it's not, it's the nature of the story, but not the substance of the story. It's very tropey. I mean, that's the idea. The answer, I know. ****. So I think, yeah, thanks, Emily. Um, what a fantastic game. But yeah, I don't think it's, it's the nature. It's not like **** Children of the Corn, Rosemary's Baby or something where it's like a really brilliant horror story. It's, it's as tropey and teen **** that gets. So I think it was, I think Chris is right. I think that it doesn't win any points. I think it wins like the uniqueness points. I think it's probably the most unique game I played this year. When you're talking about story, I mean, Witcher is a great game, but like, we, I saw what, it's super dense. Like, you know me, once you get Ciri, what is the, what is happening? What is going on? I forgot what ev-",
            "start": 698.67
        },
        {
            "text": "you're talking about story. I mean, Witcher is a great game, but like, we, I saw what, it's super dense. Like, you know me, once you get Ciri, what is the, what is happening? What is going on? I forgot what ev- I played that game so long doing nothing in that game, like just doing side quests. I don't know what the **** the game's about anymore. I mean, that's that like, so I, I don't know if I have, I forgot what I was you supposed to be doing after a while. I like a volume of narrative because there's so many cool little side story creatures and people in towns and stuff and they all like, have a spark of life to them in a way that like, other open world games like don't necessarily have. But again, like in terms of kind of like a cohesive narrative experience, maybe it's not that. Yep, it's a little, I'm sorry. Our final say: Life is Strange or Her Story. I'ma go, exchange for what, what is what we, Best Narrative? I would say like, I would say Life is Strange. Yeah, I didn't play the game. It, I just know people are like,",
            "start": 736.32
        },
        {
            "text": "final say: Life is Strange or Her Story. I'ma go, exchange for what, what is what we, Best Narrative? I would say like, I would say Life is Strange. Yeah, I didn't play the game. It, I just know people are like crazy about is Her Story in the Games for Change category as well. So it does make sense for me on the go. I don't know. I'm gonna go Life is Strange for that one and then Her Story for this one. Okay, cool. Best Art Direction: Batman: Arkham Knight, Bloodborne, Metal Gear Solid V, Ori and the Blind Forest, The Witcher 3. Ori. All those games don't have, I don't see that. I don't see what's super special at the Art Direction in those games. They have beautiful art. Bloodborne looks like a prettier Dark Souls. And as if it was a Castlevania game. I mean, I love the way the game looks. I think that, you know, Witcher obviously really set a bar very high. That's why we say Fallout 4 is a game made in a vacuum. I mean, it's obvious. I mean, it's like, there's no excuses for look like Fallout 4 anywhere. But",
            "start": 773.64
        },
        {
            "text": "know, Witcher obviously really set a bar very high. That's why we say Fallout 4 is a game made in a vacuum. I mean, it's obvious. I mean, it's like, there's no excuses for look like Fallout 4 anywhere. But um, I think Ori wins. I don't, Ori. I do think Metal Gear Solid V has a very defined Art Direction in terms of camera work and and all that stuff that I think puts it out. They mean, 'cause cinematics and art. Is Bloodborne in any other categories? We'll give you right. Don't think it's gonna be Game of the Year. So I think they want to give Bloodborne an award. So I think this might be Bloodborne for Art Direction. Yeah, I think they, Ori. I don't know. I've actually like, someone in the office has been playing the expansion and just like the creature design and they're like, it does feel like, like it does feel distinct to me from the the Souls proper games. And it does feel just like every scene and that just like drips with this like, this style. It's",
            "start": 813.45
        },
        {
            "text": "and they're like, it does feel like, like it does feel distinct to me from the the Souls proper games. And it does feel just like every scene and that just like drips with this like, this style. It's, I mean, I definitely was super, you know, I wasn't a huge fan of Demon's Souls or Dark Souls. And when I got Bloodborne, I expected more the same. And it did put its hooks into me because I, as I was saying, it's faster. Mm-hmm. So it's like a little tinge of arcadiness in it that made me want to play him where I want. I like fast moving games. And I will say that the game is the most beautiful Castlevania game I've ever seen before. And if Konami didn't have its head so far up its ass, it would go to a studio, FromSoftware, be like, can you do this, you know, for for art for one of our great IPs? Because it is such a beautiful gothic, eerie game. And when you look around, just to look around that city in some way, this is a Castlevania game. And it's like, this is a Castlevania game begging to be **** made. Um, so I do",
            "start": 852.21
        },
        {
            "text": "beautiful gothic, eerie game. And when you look around, just to look around that city in some way, this is a Castlevania game. And it's like, this is a Castlevania game begging to be **** made. Um, so I do agree with you that it has a great style. But I don't, but Ori, when I think about Ori, I just see like, you know, Art Direction, like the game's. Yes. I don't know. It's a, that's a tough one. But I agree with you, it's, it's a pretty nebulous question. Best Score / Soundtrack: Fallout 4, Halo 5, Metal Gear Solid V, Ori and the Blind Forest, Witcher 3. Metal Gear. That **** Kajagoogoo is in that ****. Yeah, that's the weird thing. That's the only one really why the licensed stuff going on. I think because the licensed stuff, I'd give it to Metal Gear. But if it's just scored, yeah. What, what's the one right before Halo? Fallout. Yeah, **** Fallout. I have some weird, I've noticed like, just weird 80s sensibilities. I, I can't almost explain it where, huh, where if I don't even know how to expand, I can hear in my head like that.",
            "start": 897.31
        },
        {
            "text": "up. Yeah, **** Fallout. I have some weird, I've noticed like, just weird 80s sensibilities. I, I can't almost explain it where, huh, where if I don't even know how to expand, I can hear in my head like that. The weird shines and like, when you see an 80s horror movie or something like that, it's like very ambient music that just like comes and goes like very quickly. They do that in like Fallout all the time. It reminds me of watching like a, like a thriller in the 80s or something. I thought, I don't know like what, I can't explain any more than that. Maybe I'll try to capture it or something next time I see it. But if they, if they're including soundtrack, I'ma, it's got to be Metal Gear because that soundtrack is, yeah, yeah. I'm going Halo 5, 'cause I don't see them giving Halo other stuff. And I do think that Halo, Halo has always been a game that has scored moment to moment. Like there's songs scored specifically for levels and for moments and stuff. Whereas Metal Gear, I mean, five, some of the other games",
            "start": 943.0
        },
        {
            "text": "Halo, Halo has always been a game that has scored moment to moment. Like there's songs scored specifically for levels and for moments and stuff. Whereas Metal Gear, I mean, five, some of the other games have distinctive themes and stuff. Five, I think just has the freakin' cigar song. Yeah, yeah. Halo's what's great. I love it. But I think I'm going Metal Gear. Yeah, yeah. Best Performance: Ashly Burch as Chloe Price (Life is Strange), Camilla Luddington as Lara Croft, Doug Cockle as Geralt (The Witcher), Mark Hamill as The Joker (Batman: Arkham Knight), and Viva Seifert (Her Story). **** Life is Strange. See how it's the Hamill's a curveball. But you have to wonder how many people vote for him and how many people are gonna be like, come on. Yeah, are we really? We need to think about who the people are voting for. How well they're not, they're not voting for Mark Hamill. I think then it's like this actually, it's like Life is Strange wins Games for Change. That really greater.",
            "start": 982.54
        },
        {
            "text": "about who the people are voting for. How well they're not, they're not voting for Mark Hamill. I think then it's like this actually, it's like Life is Strange wins Games for Change. That really greater. Like, is this Tomb Raider appear on? I'm coming back to that logic. Oh, yeah. What's going on? Except the Rise of the Tomb Raider or something. Like, the Tomb Raider is like falling off a commercial cliff right now. So I wonder if they do want to bring some notice to whatever a game that's going to be, that's getting critical darling, that's just not selling. Yeah, I wonder if they do want to try to give it an. I feel so bad for Crystal Dynamics. I'll just reiterate that. I feel really bad for them. But if you like Ashly Burch's, some, someone that I don't get behind, it sucks, you know? Yeah, yeah. They put that game. Yeah, I, I, I think that's like stronghold. Although I do think they'd like the fact that Her Story is just the actual actress, not a novelty of that. Yeah, could carry the day. So I'm gonna go with that one. Kevin.",
            "start": 1038.77
        },
        {
            "text": "I I think that's like stronghold although I do think they'd like the fact that her story is just the actual actress not a novelty of that yeah could carry the day so I'm gonna go with that one Kevin. Come, best shooter. Call it would be Black Ops 3, Destiny: The Taken King, Halo 5, Splatoon, or Star Wars Battlefront. Destiny. Yeah, I say Destiny as well. I don't think it's the story dry, but it's one of those for sure. Yeah, that's for sure. I mean, you talk about critics, like all of our friends and our echo chamber are talking about it and we're all in it and like this has made so many improvements from Destiny's what I wanted from Destiny Vanilla. Here we are. I got really choked up, me honest, us here come together. But then it did. Yeah, I'm down with The Taken King then, like revitalize that in a way that almost tempted me back in. Almost, almost. Best action adventure game: Assassin's Creed Syndicate, Batman: Arkham Knight, Metal Gear Solid 5, Ori and the Blind Forest, Rise of the Tomb Raider. Metal Gear. Metal Gear.",
            "start": 1079.12
        },
        {
            "text": "tempted me back in. Almost, almost. Best action adventure game: Assassin's Creed Syndicate, Batman: Arkham Knight, Metal Gear Solid 5, Ori and the Blind Forest, Rise of the Tomb Raider. Metal Gear. Metal Gear. This is where you give Metal Gear its due. Oh, sure. Rise of the Tomb Raider, right? Although I do think Rise... Uh, again, we're just guessing what we think is gonna win them. Yeah, you know, I didn't play Metal Gear. So that's the role-playing game: Bloodborne. Well, what is it? When it multiplayer? Role, role. I'll role-play on cams. Are Bloodborne, Fallout 4, Pillars of Eternity, The Witcher 3, Undertale. This is where Bloodborne wins. Really? Yeah. However, Fallout. Yeah, 'cause I think Fallout's gonna Game of the Year. So yeah, this this seems to make the most sense. I wouldn't call it a role-playing game really, but yeah, I think this is this is where it's got role-playing sensibility. So does Madden. So it's it's not it's an action game. Um, I mean, yeah, that's what they're gonna call it. I'm for Fallout here for need to",
            "start": 1126.28
        },
        {
            "text": "think this is this is where it's got role-playing sensibility. So does Madden. So it's it's not it's an action game. Um, I mean, yeah, that's what they're gonna call it. I'm for Fallout here for need to go for The Witcher 3. Mmm. I think that role-playing, you're playing that role of Geralt. Super literal. But like, I do think that that kind of the narrative heaviness of that over or something like Bloodborne. And then I Fallout, I feel like I don't know. I think something about putting, you know, being able to play at first person with a gun in front him will make people not think it's role-playing. Mmm. Best fighting game: Guilty Gear Xrd -SIGN-, Mortal Kombat X, Rising Thunder. Mortal Kombat X, I'll say. I don't know. Yeah, I think I think the best the best way. I mean, people sh*t Guilty Gear's their game, it's for the very hardcore. Wait, how do you know with you? I think we're look at the thing. I don't know. Work against Mortal Kombat. Is one of those, isn't like Seth Killian's",
            "start": 1174.95
        },
        {
            "text": "of their game, it's for the very hardcore. Wait, how do you know with you? I think we're look at the thing. I don't know. Work against Mortal Kombat. Is one of those, isn't like Seth Killian's new thing, right? That's not even out yet. No, that's nice. Okay. Yeah. Odd. Mortal Kombat. Best family game: Disney Infinity 3.0, Lego Dimensions, Skylanders SuperChargers, Splatoon, or Mario Maker. Mario Maker. You know, put Mario Maker. No, I think it's Mario Maker. Unless Mario Maker wins, I think it's a Lego. I think that the way they did the toys for life stuff with the Lego integration and just having all the different properties mixed in there is it's like kid catnip. I'm saying. Well, to that, Zoom's like a safe one. Yeah, I think that if you saw anything that going on with with Dan Ryckert, Dan Patrick, LePrak, whatever, with Mario Maker, it's not a kid's game, is it? Let's me. But it could. It's making grown men want to kill themselves. Oh my goodness. It's fueling blood feuds across the nation. Do you watch him like finish",
            "start": 1226.16
        },
        {
            "text": "with Mario Maker, it's not a kid's game, is it? Let's me. But it could. It's making grown men want to kill themselves. Oh my goodness. It's fueling blood feuds across the nation. Do you watch him like finish the apocalypse or whatever it was? No, yesterday. No. Oh, he did. I didn't watch it. I watch the GIFs that he tweets and that's enough for me. Hey, great man. I sh*t love watching that sh*t. Best sport/racing game: All right. Rocket League, FIFA, Forza Motorsport 6, NBA 2K16, Pro Evolution Soccer. Rocket League. Rocket League. Although I think NBA will win. So I'm I think Rocket League's about it. I'm gonna say NBA will. Sure. I think I voted for Rocket League for best like independent thing that running. That was a category earlier. Ready together? Yeah, independent. Yes, it was that. Yeah, it was 'cause I was the that was the one that Colin was all, \"Oh, it is.\" It wasn't. You're right. You're right. Up and about the Ori and the Blind Forest. So it's FIFA, Madden, and NBA. The other one is Forza. And Evolution Soccer. Yeah. Oh, was he was",
            "start": 1272.84
        },
        {
            "text": "the one that Colin was all, \"Oh, it is.\" It wasn't. You're right. You're right. Up and about the Ori and the Blind Forest. So it's FIFA, Madden, and NBA. The other one is Forza. And Evolution Soccer. Yeah. Oh, was he was FIFA and Pro Evo. Probably. I don't know. Yeah, I think NBA. I think that that's that's a series that like really, I don't know. They did like perennially. At GameSpot conversations, we not not a ton of us are like sports game players. Yeah, it's like you look at that game, it's like, how could you possibly make a better basketball game? I don't know. I'm holding strong with Rocket League. Most anticipated game: Horizon Zero Dawn, No Man's Sky, Quantum Break, The Last Guardian, Uncharted 4. No Man's Sky will win. Horizon's the right answer. But No Man's Sky. I'm saying Uncharted. Uncharted 4 is like it feels closer. I think No Man's Sky is a little tired in terms of anticipation. Like people been on that anticipation tip for a while. I think that they will want to make a new anticipation kind of target. I think Horizon.",
            "start": 1321.23
        },
        {
            "text": "No Man's Sky is a little tired in terms of anticipation. Like people been on that anticipation tip for a while. I think that they will want to make a new anticipation kind of target. I think Horizon. Mmm. Horizon looks sh*t awesome. Oh my God. Doesn't it? So awesome. Really. I'm just gonna read this one and I'm gonna let Greg Miller, whoever wants to action into it. Esports Player of the Year: Kenny 'kennyS' Schrub who plays Counter-Strike: Global Offensive. Lee 'Faker' Sang-hyeok who plays League of Legends. Olof 'olofmeister' Kajbjer who plays Counter-Strike. Peter 'ppd' Dager plays Dota 2. And Syed Sumail 'SumaiL' Hassan who plays Dota 2. Oh, I'm voting that dude, SumaiL. He's like a sixteen-year-old kid. He won The International with Evil Geniuses. And he was like, uh, I don't know. People were super stoked about that. I'm going to SumaiL. Just a bunch of words that are also written down so he knows I'm with him. Do you watch his esports? No, I watch The International.",
            "start": 1374.18
        },
        {
            "text": "like, uh, I don't know. People were super stoked about that. I'm going to SumaiL. Just a bunch of words that are also written down so he knows I'm with him. Do you watch his esports? No, I watch The International though. It's like, all right, this I'd need to buy time for me to get boned up on this stuff. Yeah, I was I got totally into it because it was daily. Yeah, just like I think the broadcast's like level was enough that it allowed me like it did what a good broadcast does. It like makes it accessible to like I was watching the noob stream a little bit, you know, and those like, okay, they're explaining it in some basic terms. Some of the stuff's going over my head. That's okay. I can get a loose handle on the action and see what's going on. I can supplement it by like asking a co-worker. And like if I don't pay attention for 10 minutes, I come back and like I watch some more. Like that's okay to like, you know, it was kind of like able to be that kind of casual sports-esque viewing experience for me. Mmm.",
            "start": 1428.89
        },
        {
            "text": "don't pay attention for 10 minutes, I come back and like I watch some more. Like that's okay to like, you know, it was kind of like able to be that kind of casual sports-esque viewing experience for me. Mmm. Because of the sort of and also the continuity of it year or like over weeks, you know, you could sort of get an idea of a team's momentum and that like gave me just like a toehold in terms of conception of the broader context. Yeah, I don't understand it all. But I do think it's called it there. One of them nerds awarding these people. And there's also a Sports Team of the Year. Ooh. We have no idea. Bull. No idea. Evil Geniuses. Okay, they're on the list. Fnatic, Optic Gaming, SK Telecom T1, Team SoloMid. Yeah, I know. I've heard of them. Esports Game of the Year: We got Call of Duty: Advanced Warfare, Counter-Strike: Global Offensive, Dota 2, Hearthstone, and League of Legends. Dota 2. Yeah, if they've if they're given awards to Dota 2 for those teams, as I'm confident they are. Yeah, I think League's a good call 'cause way more",
            "start": 1467.29
        },
        {
            "text": "Global Offensive, Dota 2, Hearthstone, and League of Legends. Dota 2. Yeah, if they've if they're given awards to Dota 2 for those teams, as I'm confident they are. Yeah, I think League's a good call 'cause way more people play League, people I think, than Dota 2. Is that right? You don't know. You have no idea. I don't even acknowledge that these. Here's my anecdotal evidence. I made a Dota 2. We had a trivia night at PAX Prime. And that Iran. And we had a Dota question. And like afterwards, like ten percent of teams that came up were like, 'Why'd you ask us about League, huh? No, please Dota.' Because we're in Seattle. So yeah, anecdotally, way more people play. I'm one of the I'm one of the old men that refuses to believe anything's happening around them right now with this stuff. So it's just like I'm going down with the ship, Kevin. You understand what I'm saying? That's gonna be a long road. It's ready. I'm just standing on the on the starboard side, Kevin, waiting for the ship to crash. But probably never crashed. We're always gonna be single",
            "start": 1510.67
        },
        {
            "text": "I'm saying that's gonna be a long road. It's ready. I'm just standing on the on the starboard side, Kevin, waiting for the ship to crash. But probably never crashed. We're always gonna be single player games, right? On consoles. Consoles were gonna die. That was the thing that was gonna happen one time. Everyone mobile game was gonna kill everything. Ah, ah. Trending Gamer: We got our boy TotalBiscuit, Christopher 'MonteCristo' Mykles, who I don't know who he is. I probably should. Do you know? Okay, we don't want to promote the competition. And we should look into these people. Greg Miller. Yeah, Markiplier. Go. I'm a big fan of PewDiePie. And for the record, we like all these guys that we know. Yeah, I think it's gonna win. Why? I heard news today that Greg is murdering everyone. But I want I want you know that you're apparently murdering. I'm aware of the road I'm going off of that sh*t. This is very much like no one can take their foot off the sh*t gas. That game. Oh, man. Any of those sh*t confirmed except",
            "start": 1559.54
        },
        {
            "text": "apparently murdering. I'm aware of the road I'm going off of that sh*t. This is very much like no one can take their foot off the sh*t gas. That game. Oh, man. Any of those sh*t confirmed except for maybe Christian's 'cause I know he is. He might be able to can just be like, \"Vote for me.\" It's always over. It's over. That's the problem. I'm last night somebody tweeted it mean. He's like, \"Oh man, you're doing great. You a fifty six percent of the vote. Closest behind you in any added TotalBiscuit.\" No, I don't tell him. Oh, he's a very busy man. If he doesn't know, it's like they don't you don't worry about to say. I'm gonna say PewDiePie's gonna win. But I think that I'm pulling for my boy Greg of it. Me too. You know, Paul. I don't want Greg to get I don't want Greg to get his hopes up. My hopes. I also and I also want to jinx you 'cause I think that the numbers might indicate that you might win. And again, TotalBiscuit's right behind me. He's the guy who won last year. So that's the concern. Also, I like TotalBiscuit on",
            "start": 1610.15
        },
        {
            "text": "to jinx you 'cause I think that the numbers might indicate that you might win. And again, TotalBiscuit's right behind me. He's the guy who won last year. So that's the concern. Also, I like TotalBiscuit on his podcast. You think you would win two years in a row? Well, the vote is this is your you're talking about engineering here and I appreciate it. But if the critics were voting on this, there's not a shot in hell of Greg Miller. I made enemies left and right. Your association with me alone would lose you lose either. Look, I'm really really interested in this and I'm pulling for you so hard. I think this'd be sh*t so awesome that you want to put it right there. Remember what you were gonna do if you win? No, I see that was adjusted. What is it? I said I'm for that Colin said he'd give me two thousand dollars. Well, for it went that I said I'd get up insane like 9/11 was an inside job. It calls like, \"I'll give you two thousand dollars cash if you do that.\" But I said to be the money same is as waiting on the",
            "start": 1650.71
        },
        {
            "text": "well, for it went that I said I'd get up insane like 9/11 was an inside job. It calls like, \"I'll give you two thousand dollars cash if you do that.\" But I said to be the money same is as waiting on the wings. My father's in New York City, firefighter. All right. I'm still telling you if Janet, you need to go up there. Janet is listening. I'm not gonna do that. Don't disqualify me or throw off my vote. That is not gonna happen. Oh, that is so Greg Miller. Without it's gonna be an inside job. Three thousand dollars. Oh, it's going up. Final final one. Best Fan Creation: We got GTA 5: Targets by Hoodoo Operator, Real GTA by Corridor Digital. Oh, Portal Stories: Mel by Prism Studios. Super Mario Maker 'E-Reader Levels' by That One Guy 78 / They Call Me Shaky. Twitch Plays Dark Souls by The Twitch Community. This is cool. Dark Souls one was really cool. That's the only one I really know. Oh, this is the thing. And the E-Reader levels are cool. Like some guy in Mario Maker remade all of that. Remember that E-Reader the",
            "start": 1691.59
        },
        {
            "text": "Dark Souls one was really cool. That's the only one I really know. Oh, this is the thing. And the E-Reader levels are cool. Like some guy in Mario Maker remade all of that. Remember that E-Reader the GBA and had all those like exclusive Mario 3 levels. Like remade was obnoxious. It was that whole great big giant. So that's cool. Says E-Reader right in it. What the hell? I'm gonna I want Corridor Digital win 'cause that Real GTA video was on another sh*t level. Yeah, I feel like it's got it. I feel like GTA that like community of people generating content out of that has been so felt felt pretty strong this whole year. I think GTA has to get a nod here. Yeah, I don't know what the Targets thing is by Hoodoo Operator. But I'm just gonna go with the Corridor one 'cause I like that. We'll see how right we are. Go go pony. Hashtag Colin Was Right tweets. Will we have 100,000? Oh, the goddamn hashtag. You guys are getting a little lax today. Is go out there. I don't like it. Your boy Colin M. predicted Fallout 4 to a",
            "start": 1747.63
        },
        {
            "text": "Go pony. Hashtag Colin Was Right tweets. Will we have 100,000? Oh, the goddamn hashtag. You guys are getting a little lax today. Is go out there. I don't like it. Your boy Colin M. predicted Fallout 4 to a T. Did he knock Kevin up? Let's never forget that. But never boy. Your boy Colin. Your boy Colin called Rocket League a year out. A year out. Let's not forget. Yeah, we wrong about a lot of sh*t. But we don't they're worried about any that. There's no hashtag for that. Colin, what would it even be? Colin, I can't I can't I can't recall who said that Tomb Raider's sales were gonna get cannibalized by Fallout. My boy Colin M. But that was an easy one. But that way, you know, you don't you know what I'm saying, Kevin? That was an easy one. That was as obvious as the sh*t sky is blue and the day is long. Tomb Raider is gonna suffer mightily because of Fallout 4. But what do you do? You also think you do better. Yeah, one comes on PC world. It's gonna be fine. Probably not. Probably no one's going to care.",
            "start": 1788.39
        },
        {
            "text": "is gonna suffer mightily because of Fallout 4. But what do you do? You also think you do better. Yeah, one comes on PC world. It's gonna be fine. Probably not. Probably no one's going to care there either. The bone's way. But that's the I want to Tomb Raider. I really feel bad. I rarely feel bad for developers. I really feel bad for Crystal Dynamics. Could you imagine them looking at it like Microsoft hasn't said a sh*t goddamn thing about that game sales? Do you see that like the the joke tweet that someone I forgot who said this, but they're like, \"Wow, it's crazy. The embargo for the review of Tomb Raider's a year.\" How that was funny. I feel I feel bad for imagine that game is getting critical acclaim across the board. And it's just the nature of when it came out. And we had Aaron Greenberg on the Unlocked podcast. His podcast. He had some great explanations as why they can't move it. And I appreciate that. But that game was sent to die. And I feel I don't feel bad for Square Enix. I'm sure there was a lot of money",
            "start": 1832.68
        },
        {
            "text": "his podcast. He had some great explanations as why they can't move it. And I appreciate that. But that game was sent to die. And I feel I don't feel bad for Square Enix. I'm sure there was a lot of money made on the deal. But I feel really bad for first. We have American numbers of those were just again. We're not gonna get American numbers till next month. And then we're gonna have to the NPD game that you have to play is a tough game because and it's a fun game. I'm obsessed with it. I'm actually completely obsessed with the NPD, like Mega Man to NPD. Yeah, NPD, man. I've benefited NPD for years. Like and we used to get real numbers. And and and and you know, that's kind of stopped. And Nintendo is really the only one that reports the numbers, which I respect. I respect that they say exactly what they sold. Even though and then we use getting tanked. And like they're still saying. And I think that's really cool. But we will have to figure out like say Tomb Raider's like number five right next month. And then you",
            "start": 1874.23
        },
        {
            "text": "though and then we use getting tanked. And like they're still saying. And I think that's really cool. But we will have to figure out like say Tomb Raider's like number five right next month. And then you have the numbers for number three. And then you're like, okay, can't be any higher than this. But then number ten is Rock Band or whatever. And it's sold this many copies. And you like, so it's gotta be somewhere in there somewhere. But then it's only in the United States. And the Xbox One strongest here. So then you have to kind of extrapolate those number. It's a whole there's NeoGAF threads dedicated this that go down the rabbit hole so sh*t far that you like it's it's awesome. I rely I go I like to sit in bed for hours. I'd read that people's charts. Their conspiracy was that what that like glow and like acrid smell and light chanting was all about like your NPD our altar. It is. I love I love sales data. I love that in the UK and in Japan they report data. And they don't report data here numerically.",
            "start": 1909.45
        },
        {
            "text": "acrid smell and light chanting was all about like your NPD our altar. It is. I love I love sales data. I love that in the UK and in Japan they report data. And they don't report data here numerically. And also NPD's becoming useless anyway. Like that the it's not accounting for retail sales and all that kind of something you have to guess about retail. There was a whole fight about Halo's. You know, people got mad at me on the Facebook for our Facebook fan page because I said Halo's launch was soft. And I'm like, but it but it was compared to Halo 4 and Halo 3 and Halo. You know, but we are just anecdotally figuring the show. We don't really know because then there's the Microsoft releases something like it's the most played game today on Xbox. Is that mean that you haven't played 1.8 billion hours? Halo was the first week of release. Like do we say what the f**k game is sold? Please for your boy Colin M. Can they just release some sales? Colin M. to send me a text. Just a",
            "start": 1946.02
        },
        {
            "text": "was the first week of release. Like do we say what the f**k game is sold? Please for your boy Colin M. Can they just release some sales? Colin M. to send me a text. Just a number. That's all I need.",
            "start": 1990.87
        }
    ]
}