{
    "id": 5099,
    "video_id": "7LiIErPfQs8",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Greg Miller"
    ],
    "title": "PS I Love You XOXO Update (We're Waiting for the PS5 Event)",
    "description": "With the big ol' PS5 event happening Thursday and our The Last of Us Part II review dropping Friday, a Tuesday episode doesn't make sense. So, LIVE EPISODE AFTER THE PS5 REVEAL EVENT! Greg explains. \n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nBlessing - http://www.twitter.com/BlessingJr\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Blessing Adeoye Jr., and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1591764233,
    "duration": 254,
    "transcript_chunks": [
        {
            "text": "[Music] what's up everybody welcome to a PS I love you xoxo update I'm one of your host Greg Miller and I'm the only host except for Kevin he's here hi Kevin I'm not a host but ah ladies gentlemen we would tell you all the time of course Tuesday you can get a brand new episode of PS I love you xoxo but guess what we're not doing a brand new of PS I almost said we're not doing an episode today because if you haven't heard guess what PlayStation 5 review event game event whatever you want to call it is happening Thursday June 11th we figured we could do an episode of PS I love you xoxo today but well there'd be a lot of news on Thursday let alone the fact that when you're like blessing what have you been playing we've both only been playing last it was part two and we can't review that till Thursday or I'm sorry a Friday so here's how it's gonna work ladies and gentlemen Thursday June 11th PlayStation 5 of 8 I encourage you of course to come over to twitch.tv slash kind of funny games at",
            "start": 0.72
        },
        {
            "text": "or I'm sorry a Friday so here's how it's gonna work ladies and gentlemen Thursday June 11th PlayStation 5 of 8 I encourage you of course to come over to twitch.tv slash kind of funny games at 1 p.m. watch the reveal along with us we'll be doing our usual livestream reactions if you missed them go go up on YouTube comm slash kind of funny games later however once that all wraps up we will do live right there in episode of PS I love you xoxo as the post-show to the playstation 5 a big old Thursday event so you can either tune in live twitch.tv slash kind of funny games around 2 o'clock when the stream ends again coming at 1 o'clock watch with us or you can get on youtube.com slash kinda funny games podcast services all the normal places you get PS I love you xoxo nothing will change there it'll just go up probably later Thursday afternoon into the evening at some point we'll do the show there will react to the PlayStation 5 stuff then 12:01 a.m. Pacific time Friday the 12th the Last of",
            "start": 65.87
        },
        {
            "text": "just go up probably later Thursday afternoon into the evening at some point we'll do the show there will react to the PlayStation 5 stuff then 12:01 a.m. Pacific time Friday the 12th the Last of Us part 2 review posts on youtube.com slash kind of funny games and podcast services as a kind of funny games cast if you want to come over at 12:01 I will be there live in the comments on youtube.com slash kind of funny games for an hour hanging out answering questions a thumbs and things up you know respond to what I can respond to as per embargoes but having a conversation with you and then like I said is on games cast it'll be doesn't games guess if you wanna get to review somewhere else it's gonna be myself it'll be blessing it'll be Tim and what's good games Kristine Steiner will be joining us as well so cool stuff there then Friday you watch our review you probably watch easy allies review you go read IGN games about all of them you read all this review taking all this content your task",
            "start": 107.72
        },
        {
            "text": "as well so cool stuff there then Friday you watch our review you probably watch easy allies review you go read IGN games about all of them you read all this review taking all this content your task is to come up with questions because PS I love you xoxo for the week of the 15th that'll be the one that posts on the 16th we will be doing your Last of Us part 2 questions answers but whether they're free of course like we can't spoil story stuff anyway no rule would we so it won't be a spoiler cast that'll be happening later on it will instead just be what questions you have after you always reviews what we can answer there so lots of homework for you lots of things to remember easiest way is this Thursday June 11 twitch.tv slash kind of funny games 1 p.m. come watch the PlayStation 5 event with us or afterwards the post show will be PS I love you xoxo for this week you can get it on all funeral services Thursday evening afternoon somewhere in there then 12:01 a.m. Pacific time Friday the",
            "start": 151.06
        },
        {
            "text": "us or afterwards the post show will be PS I love you xoxo for this week you can get it on all funeral services Thursday evening afternoon somewhere in there then 12:01 a.m. Pacific time Friday the 12th The Last of Us part 2 review goes up as a games cast then your usual scheduled programming PS I love you xoxo on Tuesday the 16 will be of course the normal stuff what we've been playing ranking stuff all that jazz but more importantly I think you know what is it you know we're talking about best friends talk back somebody's like backwards-compatibility the best friends whatever you want to say will we answer your questions for the Last of Us so strap in ladies and gentlemen future is now next gen or next gen is now Last of Us is now it's a it's now Kevin you don't I mean Kevin you know what I mean he knows what I mean yeah I got it spend our pleasure to serve you",
            "start": 194.11
        }
    ]
}