{
    "id": 5109,
    "video_id": "r-nJz97ZX6M",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "Horizon Forbidden West PlayStation 5 Kinda Funny Live Reactions",
    "description": "Watch our full reactions here: https://youtu.be/hnMSFjtq6ZY \nand check out our full post show analysis here: https://youtu.be/XP1gQMHNUio\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nBlessing - http://www.twitter.com/BlessingJr\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Blessing Adeoye Jr., and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1591934024,
    "duration": 243,
    "transcript_chunks": [
        {
            "text": "[Music] although it is still going guys you're going quad-a way it looks like garbage in our and I'm watching lucky I have the stream up on two monitors the old ones perished here weed 1,000 years ago they're great cities turned to graves shows that co-op better place I ashleigh.burns new life oh yeah be trying enemy crime you are the crab dangers yes yes I must find a way to stop it worse the curdled I'm talking about and I wouldn't do to save this world depth I won't explore wall holy oh my god that's awesome [ __ ] that I'll go underwater huh no secret I won't unlock big that's really cool no barrier I won't cry [Music] this mission is mine alone [Music] if I falter if I fail there won't be anyone left to stop what's in my favor [Music] that dudes back what up fam oh yeah Luther Oh for [ __ ] yeah that's really clear that you see the little two in there [Music] yes dude [ __ ] yeah that looks so good dude no day show me new animals gorilla we're happy to share the first look at",
            "start": 0.0
        },
        {
            "text": "for [ __ ] yeah that's really clear that you see the little two in there [Music] yes dude [ __ ] yeah that looks so good dude no day show me new animals gorilla we're happy to share the first look at horizon forbidden West we're continuing a love story as she moved west to a far future America to brave a beautiful but dangerous location mess with mysterious new frets get ready to explore distant lands ravaged by massive storms and take on new powerful machines as you return to majestic world of horizon stay tuned for much do you think I can't wait for you to get your hands on it",
            "start": 179.83
        }
    ]
}