{
    "id": 4905,
    "video_id": "O_2yanfRpSI",
    "show_name": "Announcements",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Kinda Funny's Working From Home!",
    "description": "Kinda Funny's No. 1 priority to you is making entertaining podcasts and videos. Our No. 1 priority to our team is keeping them safe. Starting next week, we'll be working from home.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\r\n\r\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\r\n\r\nCheck out our store! http://www.kindafunny.com/store\r\n\r\nFollow us on Twitter!\r\nGreg - http://www.twitter.com/GameOverGreggy\r\nTim - http://www.twitter.com/TimGettys\r\nNick - http://www.twitter.com/Nick_Scarpino\r\nKinda Funny - http://www.twitter.com/KindaFunnyVids\r\n\r\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.\r\n\r\nMusic by Tonedeff - http://www.QN5.com",
    "published_at": 1584145382,
    "duration": 124,
    "transcript_chunks": [
        {
            "text": "what's up everybody I'm Greg Miller the CEO of kind of funny here to talk to you about the future of colleges in the next week it kind of if you haven't noticed there's this pandemic happening and so we've been around here talking and thinking and you know pontificating and of course kind of funnies number one priority is to make you guys the best friends out there entertaining awesome podcasts and videos over on YouTube and podcast services around the globe but the number one internal priority right is to keep our staff our family safe obviously unemployed and so with that in mind kind of funny is happy to announce that next week we're starting a work from home program meaning that all the shows you're used to or at least the shows we can do normally and easily from home will be done at home will be everybody working from there will be recording the podcast we making the videos from there um hopefully knock on wood it doesn't appear or seem that much different to you when you actually",
            "start": 0.0
        },
        {
            "text": "will be everybody working from there will be recording the podcast we making the videos from there um hopefully knock on wood it doesn't appear or seem that much different to you when you actually get the content on your normal feeds kind of funny games daily will continue on in review will continue on kind of funny podcast games cast all that will happen actually a bunch of reviews next week too but I can't get into that for games cast uh things like KF AF Internet Explorer's we are working on options and tweaking and things like that but you might see more we have cool friends instead next week as we figure out the easiest way to get you quality content that works for our new work from home schedule so again nothing dramatically happening nobody here is sick we just want to make sure nobody else gets sick and that we are actually being part of what we always talk about be better to each other right obviously a lot of stuff going on right now about flattening the curve right taking",
            "start": 42.51
        },
        {
            "text": "else gets sick and that we are actually being part of what we always talk about be better to each other right obviously a lot of stuff going on right now about flattening the curve right taking the advice of scientists in the World Health Organization to heart which would be to limit your exposure and if you can work from home and we can so we will work from home and make the podcast from there like I said hopefully you don't notice much different if you do hey we've always been a garbage truck on fire and we'll probably have figured it out by Thursday right Kevin that's not about right okay well Cavs laughing ladies and gentlemen until next week for my house it's been my pleasure to serve you",
            "start": 84.45
        }
    ]
}