{
    "id": 2702,
    "video_id": "4sUq9-u_gJ8",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello"
    ],
    "title": "The Boys Get Ready For E3! - Kinda Funny Morning Show 06.09.17",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1497040211,
    "duration": 5186,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to the Kinda Funny Morning Show for Friday, June 9th, 2017. I'm one of your hosts, Greg Miller, alongside the producer Nick Scarpino. How I do this time because sometimes I screwed up. What are you trying to? You're trying to woo like you're chopping somebody. You're trying to woo like a Ric Flair wooo wooo. Hey, but you got to do the chopping. I don't like that. Don't hit me. I got the tetanus shot. Yeah, I don't know. Don't hit me. Why did you get? Did you get bitten by? Did py bite you? Finally, you were like, \"You know what?\" That that rabies-infested... I got the tetanus shot today, and the woman goes, \"Oh, you're a bleeder, huh?\" I was like, \"Alright, I don't know. Damn are you?\" I guess yeah. I was bleeding out my arm. Jesus Christ. This thing hurt. I can't stand the ones where you get them and have to like move it around in the muscle a little bit. I didn't get that at all. No, no never. I've never had a shot like that. You're getting bad shots. Well, I get a lot of uh when you when you try to",
            "start": 0.73
        },
        {
            "text": "have to like move it around in the muscle a little bit I didn't get that at all no no never I've never had a shot like that you're getting bad shots well I get a lot of uh when you when you try to foreign count shot so I get a bunch of crazy **** malaria all that Stu you got malaria I got malaria yeah I'm gonna give it to Kevin later yeah yeah just gonna give it to him how you doing I'm good it's Friday yeah uh E3 starts officially tomorrow yep EA we have a thing in here they announced some game stuff we're going to talk about it it's going to be super fun yeah um yeah I don't know looking forward to next weekend when we all get a weekend off for once well that be lovely sure sure Kevin laughed at that he didn't think that's a do you not get a weekend off next weekend I promised I'd help my friend move she needs to move oh you need to call that person right now and tell her that you have a dentist appointment that day I'll do it you want me to call her she needs to move all her",
            "start": 51.2
        },
        {
            "text": "help my friend move she needs to move oh you need to call that person right now and tell her that you have a dentist appointment that day I'll do it you want me to call her she needs to move all her stuff just Saturday why uh where's she moving she's moving to the sunset oh I'm familiar with the sunset Greg used to live in the sunset she taking my old apartment lower Sunset okay is that do you call it the lower Sunset you're a native I'll give it to you I've never heard lower heard you're saying lower than meth South where I am right gotcha gotcha cool Greg how are you man I'm doing good yeah yeah I got some McDonald's today Kevin went and bought it for me and when he got here they didn't put his sandwich in the bag so I just showed up nice little sandwich and he was all mad that's nice Kevin what happened how mad were you about the sandwich I was pretty mad pretty mad about the sandwich I was pretty mad yeah I like that there's like it's like there's like mere image of the morning",
            "start": 91.28
        },
        {
            "text": "Kevin, what happened? How mad were you about the sandwich? I was pretty mad, pretty mad about the sandwich. I was pretty mad. Yeah, I like that there's like it's like there's a new image of the morning show now there are two other hosts out there. Yeah, just ready to do whatever they've got to do. I also like that that seems to be the spot where everyone lays down. Sure, sure. Cool Greg, yesterday like sat down and then slowly laid down and then he was just like all in, all in on that. Yeah, just checking uh checking Instagram on his phone that's what he does or whatever he was doing I don't know what he was doing after he... He Instagram videoed a live stream of him playing Simpsons Hit & Run on PS2. Yeah, that was the most cool Greg and Kevin thing I've ever seen in my... That was just the cool Greg thing. I think Kevin, that the phone was I feel like Kevin was the one that taped the phone to the table who who taped the phone to the DVD? That was you. That was you. Oh good job. Look at that now you're",
            "start": 140.48
        },
        {
            "text": "think Kevin that the phone was I feel like Kevin Coello was the one that taped the phone to the table who taped the phone to the DVD that was you that was you oh good job look at that now you're welcome to stream on Twitch anytime you want you know so I actually ripped off the protective screen of my phone doing that so I learned some things so next time little better techniques well yeah just use this just use this whole setup here the Twitch thing yeah uh we pay for all this stuff somebody's got to use it let's get it man next next we need to do is get up be fun get up that's what you want to do right cool get up after it I want I want to I want to I want to play Friday the 13th today we got an afternoon Tim and I need to play Emily was away too whenever the **** Emily or whenever the **** Tim's going to get here who knows is he coming in today I don't know I asked him yesterday it didn't seem like he had a reason to but he said he is but here we are 1104 no sign of Tim sounds",
            "start": 176.28
        },
        {
            "text": "**** Tim's going to get here, who knows if he's coming in today? I don't know; I asked him yesterday. It didn't seem like he had a reason to, but he said he is. But here we are, 1104 - no sign of Tim. Sounds like Tim is away. I'm gingerly touching you, CU. I feel so... I'm so glad I'm giving you a hug. You can't give it back; I'm not going to do that. Got the other? We want to switch places. Go full; we go. Ham on each other, biting each other's arms - doing all this different stuff. Yeah, here's the other big question: yeah, what's the big question? What are we going to do for lunch? Whatever you want to do, big boy. I feel... I feel the call of the Outback. No, can't do that. I don't want to play games; I don't want to waste the whole **** afternoon. We'll come back at like 2:30. We're going to work all weekend. Yeah, I know - just take a break for a second. G video games are the break. I like to play the games. You're making a lot of sense to me, gr. Thank you; cool Greg for finally being on my side. I think... uh... for someone grab some dinosaur.",
            "start": 213.32
        },
        {
            "text": "for a second video games are the break I like to play the games you're making a lot of sense to me Greg thank you cool for finally being on my side I think uh grab some dinosaur I know you're not the biggest fan it's going to be quick yeah you know well I'm thinking here's what I'm going to throw out there we haven't beeped it up in a long time damn whatever happened to the beeps sure Jean Viv St threw up once after eating it but that was that was that was the stomach bug that was the stomach bug that was the stomach bug I refuse to believe that was the beeps was that the last time you went there no we've got we've had beeps since then I feel like but here's the thing is we were having beeps so much yeah that beeps had lost its amazingness now we haven't had Beeps in quite some time we bring it back into The Fray I feel it's going to be pretty good of course it all comes down to can Postmates actually deliver it there's no way I mean we can just go get it I think if we go",
            "start": 258.12
        },
        {
            "text": "time we bring it back into The Fray I feel it's going to be pretty good of course it all comes down to can Postmates actually deliver it there's no way I mean we can just go get it I think if we go there we can have a lot of fun those cool ass chairs they have outside the little bar stools Pepsi ones they're really nice got it yeah I can get over there quick we could do pizza I could do all this really quick I know you can oh I know I know cool Greg's got an answer for everything I'm not I'm not worried about this I'm just saying I'm I'm putting out the options we have I think beeps yeah anyone against that Kevin's not nobody's against beeps the motion passes and it's carried beeps it is Bam if you didn't know ladies and gentlemen this is the Kinda Funny Morning Show each and every weekday here on twitch.tv/ kindofunnygames we come to you with the nerdy news you need to know about before jump in the chat to ask your questions comments and concerns in between those two segments I",
            "start": 297.28
        },
        {
            "text": "Here on Twitch.tv/KindaFunnyGames we come to you with the nerdy news you need to know about. Before jumping in the chat, ask your questions, comments, and concerns. In between those two segments, I reach into the internet, grab a video game, toss it to one of you: how do you win it? Simple: be in the chat like so many of you are right now on Twitch.tv/KindaFunnyGames. Or if you don't want to be here, maybe you're watching us later on YouTube.com/KindaFunny. Oren is listening on a podcast service around the globe. You can subscribe to us on Twitch; that would get you in to win it. Or you can back us on Patreon: either one of them, $2 an up level, can you back that? Can you back that up? I can back it up. I kind of... I'm talking about that ass first story isn't a story at all. KindaFunnyLife three photos are still rolling in, and our friend Mayumi, who's always putting up cool stuff, always great. My S may be Mayumi, I believe so. Mayumi, I see her all the time; I know her, but it's one of those names I say really.",
            "start": 337.24
        },
        {
            "text": "are still rolling in and our friend Mayumi who's always putting up cool stuff, always great. My S Mayumi, I believe so, Mayumi, I see her all the time, I know her but it's one of those names I say really quick when I see her, \"hey, good to see you, you know what I mean?\" You get in, get out, get in, get out. You also have a fear of like anything that's Japanese sounding? Sure, I don't have a fear of it, I just have a respect. Cool. Give me some Scrolls here. She's put up 100 in 69 photos documenting Kinda Funny life. There's so many other people who've too. I've been retweeting, I've been doing all this but now there's been time as spin space look at that look at that guy right there look at Austin Creed killing it look at that Nick Scarpino killing it **** dope picture there's some amazing amazing photos inside of this uh she did amazing work 169 photos let me spam it in the chat for you of course I've retweeted it I put it out there let me put it in the chat for you so you can experience Kinda Funny if",
            "start": 380.8
        },
        {
            "text": "of this uh she did amazing work 169 photos let me spam it in the chat for you of course I've retweeted it I put it out there let me put it in the chat for you so you can experience Kinda Funny if you didn't miss it KFL 3 photos remember if you have video of KFL 3 big Tim Gettys wants it so send it his way we haven't put out that post yet though I know I'm saying don't delete it just be ready for when it happens I am trying to gather all I've been I started a special section of my Amazon photos because I have unlimited storage over there where I've been taking everyone's photos shoving them up up there just shoving them **** nice up just cramming up there CR get up there doing that thing super great so super great super great thank you for oh that's right me uh thank you all for the photos thank you may me thank you for remembering Kinda Funny Life Three it's gone but not forgotten no always have a special place in our hearts took a little bit of us with it no in a good way just",
            "start": 418.24
        },
        {
            "text": "thank you may me thank you for remembering Kinda Funny Life Three it's gone but not forgotten no always has a special place in our hearts took a little bit of us with it no in a good way just Kevin's voice and Tim Gettys yeah there we're fine you and I bounced back sure we did you're you're sitting there on an iPad you haven't had the energy yesterday I thought you were going to quit at the end of the day it look like you're ready to quit I was just tired I know that's what I'm talking about you're tired also look at this I never wear white shirts how do we feel about this I mean it's the Funny Rock shirt I'll give you that it's good I feel but look at the booby look at the boobies well I mean yeah yeah but I hide them better I think in Black everybody's always like you look so skinny I'm like jokes on you still really fat don't know how this don't dude you got to hear the alarm and start doing some push-ups you can fix no I don't have to do that I don't have to Super look like",
            "start": 463.56
        },
        {
            "text": "I'm like jokes on you still really fat don't know how this don't dude you got to hear the alarm and start doing some push-ups you can fix no I don't have to do that I don't have to Super look like superheroes I mean there's no way for us to have this job and do it we we have to work out it's not just eating like superheroes it's you got to actually go out and like lift weights and do leg stuff like where the 24 Hour Fitness two blocks away from here so far last thing I want to do Co back me up I don't want to go over there cuz I go out there I leave it all in the field yeah I'm going to be exhausted then you're going to tell me all right now I got to walk two more blocks I'm like dude I just did 20 deadlifts my calfs are hurting my dogs are barking you see I kick through three boards yeah you did that's that's how working out works you do Taekwondo it man that's what they do right you kick through the boards you do the leg presses then somebody with a Singapore Cane just yells over your",
            "start": 502.28
        },
        {
            "text": "you did that's that's how working out works you taekwon do it man that's what they do right you kick through the boards you do the leg presses then somebody with a Singapore Cane just yells over your back for a while Cher shots to the head and you come home it's over yeah know that's exactly you know a lot of people um say that after you work out you actually have more energy but yeah you're probably right you probably don't want to couldn't get home in time want to get that couldn't do it I'm telling you Jen comes and meets us here we all go Jen works out all the time she works I see her on Twitter I still want to do the rock climbing wall thing I'm down to climb I'm I want to do the climbing Community you want to be a part of the member I do want to be a member of the climbing Community Kevin can we call the board and see if we can get Greg to be a member of the community did you yeah you might be in my friend all right cool you ever go to the rock climbing with these kids yeah him",
            "start": 544.76
        },
        {
            "text": "we call the board and see if we can get Greg to be a member of the community did you yeah you might be in my friend all right cool you ever go to the rock climbing with these kids yeah him and Spencer are great at rock climb it's like the one time I did it I actually had a really uh bad uh like my arm hurting all morning so it kind of got unlucky with that I think I slept on it wrong but to a point where it really affected me I would love to go back and give it a 100 we got to do it guys we got to do it let's get into it let's get into the group we should film it GoPros on our heads too and then just cut it cut it to playing with the boys the GoPro needs to be facing us you have to have one of the head Mounts facing which would be hilarious because you're on the walls like right here grinding be like my forehead first real story you care about over at Variety it is reported Wonder Woman screening being suspended in Tunisia amid opposition to Gal Gadot after being banned in Lebanon",
            "start": 582.88
        },
        {
            "text": "The Boys Get Ready For E3! - Kinda Funny Morning Show 06.09.17\n\nbe like my forehead first real story you care about over at variety it is reported Wonder Woman screening being suspended in Tunisia amid opposition to Gal Gadot after being banned in Lebanon and pulled from a festival in Algeria Global Blockbuster Wonder Woman is facing a similar fate in Tunisia where its theatrical release has been suspended ahead of its sneak premiere on Wednesday evening the superhero movie was set to open in at least two Tunisian theaters on Thursday but was suspended following a lawsuit filed on Monday by the Al-Chaab party people's movement party and the Tunisia Association of young lawyers which called Wonder Woman's Israeli-born lead actress Gal Gadot or Gal Gadot the Tunisian Courthouse decided to halt the theatrical release of one film while it examines the lawsuit filed by the Al Chaab there's no R in there Al Chaab party according to local reports",
            "start": 620.52
        },
        {
            "text": "The Tunisian courthouse decided to halt the theatrical release of One Piece while it examines the lawsuit filed by Al Chab. There's no R in there, Al Chaab party according to local reports, the film was subsequently removed from the local ticket booking website Tock Li. TN which serves Tunisian theaters meanwhile the Facebook page for the sneak premiere Wednesday was also updated with the tag saying \"suspended\" (that means suspended). Yeah, I think we got that part. We didn't need the translation. The film was due to play in 3D with subtitles and had gathered 237 confirmed guests on the Facebook page as in Lebanon where the movie was banned May 31st. The Tunisian Association of Young Lawyers filed a lawsuit on the grounds that Gal Gadot had publicly praised Israel's military actions during the 2014 war in Gaza. The group also pointed out that the actress had served in the Israeli Army. Wonder Woman was also pulled from a festival in Algeria where I didn't know about this one",
            "start": 671.84
        },
        {
            "text": "during the 2014 war in Gaza, the group also pointed out that the actress had served in the Israeli Army. Wonder Woman was also pulled from a festival in Algeria, where I didn't know about this one; I was supposed to open Sunday during the second edition of Nights of Cinema - they say it in the funny way, I'm not going to butcher it for you. A festival organized to celebrate the Muslim holy month of Ramadan, but it was unclear whether Gadot's background was the issue. But another guy whose name I won't butcher for you, head of press at M'Dahbi (co-organized the Algerian Festival), said the film was pulled because of administrative issues linked to exhibition wrestling. A petition to boycott the film in Algeria called \"No to Wonder Woman\" was launched last week after Lebanon's band was passed; it's all these we're losing two theaters here, a third theater there, 237 tickets here - yeah, I mean it's not going to affect the global box office of Wonder Woman.",
            "start": 716.08
        },
        {
            "text": "It's all these we're losing two theaters here, a third theater there, 237 tickets here. Yeah, I mean it's not going to affect the global box office of Wonder Woman. I don't think when Warner Brothers looks at those markets, those are particularly important markets to them. But it just sucks because you know you don't want to see films like that - a lot of work, a lot of hard work get abandoned. Sure, I mean it's their right to do and protest and do whatever they want to do. It's interesting to see people giving into it because it's one of those things where we obviously weren't apprised of the situation. You know what I mean? I did we did it last time, right? Where it's like I know a little bit about the Palestinian-Israeli conflict, right, and I'm like I'm going to go read this after we did it last time. Where I got banned because I wasn't like I'm I didn't have a stance to take. Sure, so then I went and read about it and like after a while I was like I don't understand.",
            "start": 756.28
        },
        {
            "text": "this after we did it last time where I got banned because I wasn't like I'm I didn't have a stance to take sure so then I went and read about it and like after a while I'm was like I don't understand what the **** happened I'm more confused reading about this conflict than I am so I clearly they're not alone that there's you know people out there that have an issue with it it's interesting that it's actually coming back to a comment Gal Gadot has made or the fact that she served even though that's again everybody has to serve in Israel like that's the thing yeah you have mandatory service and also you know she is is really born and she has a lot of uh obvious national pride so you don't take out of context I don't know what that was and I'm also not in any way shape or form well right enough on the on the the conflict on Gaza Strip so yeah I don't know I just know that that territory has been in Conflict for for me what I think is that is it's an interesting Ripple to the global community",
            "start": 794.04
        },
        {
            "text": "the conflict on the Gaza Strip so yeah I don't know I just know that that territory has been in conflict for for me what I think is that it's an interesting ripple to the global community and one if you would have talked to me about Wonder Woman like you think it's going to be banned anywhere I'd be like oh yeah sure some I know uh you know they don't let women show this much skin and they put them in you know outfits and stuff like that I wouldn't have thought it was because of she's Israeli here's this problem the this Palestinian conflict I like huh interesting but of course I don't know anything right so yeah but it's like it's if like if Canada made a good movie for once you know yeah right we would probably ban it here because we don't need we don't we don't want to be have anything to do with those people yeah right like what American like real American would ever consider getting into bed with a Canadian you mean you bring the Canadian here then it's fine is that how",
            "start": 829.64
        },
        {
            "text": "The Boys Get Ready For E3! - Kinda Funny Morning Show 06.09.17\nanything to do with those people yeah right like what American like real American would ever consider getting into bed with a Canadian you mean you bring the Canadian here then it's fine is that how it works him yeah oh okay well it's funny cuz we we know we were watching me and the love of my life my wife we were watching uh the movie Hidden Figures you ever you seen this Hidden Figures about the Space Race they're doing all this different stuff or whatever and I'm watching it and she's asking questions and I'm like oh right you don't have a space PR this totally passes you by yeah you guys don't understand we're trying to touch the face of God and Canadians are out there man oh look at this tree let's chop it down this way oh we made more lumber this is cool yeah we built the Tower of Babel and you are I've discovered a new way to fight a beaver that's what they were all about in the 60s hey check this out if I put this tap in this tree we get some Maple syrup here",
            "start": 866.52
        },
        {
            "text": "Tower of Babel and you are I've discovered a new way to fight a beaver, that's what they were all about in the 60s. Hey check this out if I put this tap in this tree we get some of this maple here, maple syrup, you know what I mean. And we're all like, \"That's cool, we're going to invent the microwave and Velcro and all sorts of other cool microcomputer chips that help send us to space and infinity and beyond.\" Exactly. So she's watching this just slack-jawed seeing the technology we had in the 60s that surpasses the Canadian Space Program now right? I don't know if they did, they have one yet, do you have a space program yet, Jen? You want to come right here, a we a we. I will say this shout out to Canada's Prime Minister because that dude Justin Trudeau is a baller. Yeah, those pictures of him and Obama having lunch together in Liverpool House, oh my God. My wife brought that up; she's like, \"You see those pictures?\" I was like, \"Easy Ace, easy.\" I think we could get Justin Trudeau in the show at",
            "start": 911.68
        },
        {
            "text": "of him and Obama having lunch together Liverpool house oh my God my wife brought that up she's like you see those pictures I was like easy Ace easy I think we could get Justin Trudeau in the show at some point now it might mean that we have to go to Montreal but we can get that's fine yeah that's fine yeah love to interview him like what is your take on all this sure sure we'll see what happens yeah The Rock was a baller Rock's always been a baller from day one when you think he looks at this picture and just thinks to himself I have I am now and always have been doing it right like I look back at that I'm just like that was a you killed that look bro you killed it and it looks a lot like my Uncle Paul from the '80s and '90s that was the style back then the Flock of Seagulls pack the big belts with like the little silver tip on the Belt you know Ian light blue jeans the big puffy jeans that kind of like came down to a hammer style pant a turtleneck with just an amazing for me yeah why did",
            "start": 958.08
        },
        {
            "text": "like the little silver tip on the belt you know Ian light blue jeans the big puffy jeans that kind of like came down to a hammer style pant a turtleneck with just amazing for me yeah why did you get this for me I didn't get it a fan got a fan got that God bless it we're turning you into the Rock are we yeah Kevin wants to get you jacked out you're part of the climbing community yeah is rock climb we're going to get you no probably not but his name is the Rock so um we're going to get you one of those cool like Samoan tattoos yeah you know a Hawaiian tattoo oh sorry I thought you were doing on purpose on that one sorry I forgot you like all the day gushing blood down my arm the one day you wear a white shirt yeah that's what I told her too I'm like I'm yeah this what did they do next story is over at ign.com where Joe Scarborough made up a name in person says the black poster and plot synopsis revealed teaser trailer tonight so I want to talk about",
            "start": 998.68
        },
        {
            "text": "next story is over at ign.com where Joe Scarborough a made-up name in person says the Black Panther poster and plot synopsis revealed teaser trailer tonight so I want to talk about number one is the poster and number two the synopsis number one the poster what the heck is going on scroll down to the full poster there cool Greg I think it's there come on who is this bad at CGI Photoshop it's great what are you talking about it's great that does not look great at all it looks like it's photo-realistic if you're in a cartoon I just it's just like I remember when they put out the Fantastic Four one and I was like this is a horrible poster and it was this isn't as bad as that the worst was Avengers when it was Tony Stark's face clearly taken from a press thing put on the poster you're like what the heck and then it was like all right cool Marvel usually gets it right no big deal then it was okay here's the Spider-Man Homecoming trailer",
            "start": 1040.44
        },
        {
            "text": "from a press thing put on the poster you're like what the f and then it was like all right cool Marvel usually gets it right no big deal then it was okay here's the Spider-Man: Homecoming trailer or a poster and we all like well not an official Marvel Canon movie Lots going on I wouldn't have made the poster like this I'm I'm sorry no it's Sony Sony's **** it up is what I'm saying there's no Marvel is getting their own way with it you know what I mean okay cool they **** that up no big deal that's a lot going on it's not terrible and then this Black Panther poster and I'm just like why if you have a superhero who can't that's a good one yeah I was like what that's did the the the official one they put out recently it has everybody in it you're not get this is these are all old most recent like I like the one where you're sitting in his high school go back cuz you had it had I saw it somewhere I'll find it you keep not to mention you don't even need it you can just keep",
            "start": 1086.6
        },
        {
            "text": "Old most recent like I like the one where you're sitting in his high school, go back 'cause you had it, had I saw it somewhere, I'll find it. You keep not to mention you don't even need it, you can just keep rolling with me on this one. Talk about Black Panther, I understand, I just wanted to see it, you could just talk about Black Panther instead. You wanted to see this old poster and we're still waiting for it. No, that is still not the right thank you. Um, I don't know, it doesn't bother me, I think it's cool. Yeah, it's not, it's clearly CGI's, that's a CGI everything's CGI about it except his face which is a little strange but whatever, it's like come on man. Yeah, what about the synopsis on Bro, Syis? I waited to read because I wanted to be together to do that. Let me read, let me go okay this is it, this is it, this is it. It's going to be during Game 4 tonight, I guess U here we go. Press release offers a plot synopsis of the film Marvel's Black Panther follows T'Challa who after the death of his father, the king of",
            "start": 1132.08
        },
        {
            "text": "Is it going to be during Game 4 tonight, I guess? Here we go. Press release offers a plot synopsis of the film Marvel's Black Panther follows T'Challa, who after the death of his father, the king of Wakanda, returns home to the isolated, technologically advanced African nation to succeed to the throne and take his rightful place as king. But when a powerful old enemy reappears to challenge T'Challa's claim as king and Black Panther is tested when he is drawn into a formidable conflict that puts the fate of Wakanda at risk. Risk. Sorry. Faced with treachery and danger, the young king must rally his allies and release the full power of Black Panther to defeat his foes and secure the safety of his people and their way of life. Black Panther will be released on February 16th, 2018. So far, based on the Marvel Universe, we know this about Black Panther: invulnerable to motorcycles; yep, really good at getting on top of cars; right; runs really fast; runs fast; has claws; they're on the suit; I don't.",
            "start": 1170.32
        },
        {
            "text": "The Marvel Universe we know this about Black Panther invulnerable to motorcycles, yep really good at getting on top of cars right runs really fast, runs fast has claws they're on the suit, I don't know if that counts and his dad was King and super into peace yeah also true right but again I think you can't I think you're underselling how powerful is when he goes up against motorcycles and Audis by the way uh so whatever motorcycles and Audis for whatever reason are like he just makes it's like a hot knife through butter yeah you see you hear what I'm saying totally you're picking up what I'm putting down he can kill cars no problem he's one of those guys that's fast they're going to need to explain him a little bit more for me because I don't understand why he's able to go up against like Captain America, his metal is that yeah test his metal yeah it's funny because what they're famous for is having very strong metal it's true it's true anaman I mean they said you know they",
            "start": 1218.04
        },
        {
            "text": "like Captain America heist his medal is that yeah test his metal yeah it's funny because what they're famous for is having very strong metal it's true it's true adamantium I mean they said you know they spelled metal you metal metal okay just make sure make sure yeah what's his name Shield vibranium yeah is the suit made of iridium is that what it's all about I'm guessing it is but I still don't understand why I don't understand why it allows him to run Scrat Captain okay nice job versus Animania equals well there's no animus yeah technically there is but not in this universe not in this universe enhanced they're enhanced wouldn't the suit be super heavy if it was made of that though no cuz I think it's like Titanium or it's like super light it's a weave so he's like chain mail his shield is super light too yeah if you pick up Cap Shield sure you just throw it in space bet house says the suit is made of vibranium reinforced fiber um what do you think of the synopsis how does it make",
            "start": 1262.2
        },
        {
            "text": "is super light too yeah if you pick up Captain Shield sure you just throw it in space bet house says the suit is made of titanium reinforced fiber um what do you think of the synopsis how does it make him run faster it I don't know we're going to figure it out like that he's part of a lineage of people I can't I don't know Black Panther's origin this is kind of like an origin story frame right yes better be we're going to learn a lot about Wakanda city looked at the end yeah looks dope as **** I'm it didn't look that cool it looks really cool here's the thing about Black Panther I'm hoping it is good I don't I don't think it's going to be fantastic I hope it's not Thor 2 I just want it to be a fun cool standalone story you know um as far as a synopsis all I heard from that is everything's going okay and then a bad guy comes and threatens the world and the only person I can stop him is the main character of this movie and then he stops him I got I want to read it",
            "start": 1311.16
        },
        {
            "text": "is everything going okay and then a bad guy comes and threatens the world and the only person I can stop him is the main character of this movie and then he stops him I got I want to read it from the Black Panther Wikipedia page The Black Panther Party or the BPP was a revolutionary black nationalist socialist organization founded by Huey P. Newton okay so it was just a seal right hold on I'm looking to do it I'm looking deeper we must go deeper while you're doing that should I read some tips yeah let's get this party started first tip is from uh Daffin says your tip alert looks cool just just look at it again keep up the great work thank you Rville Cide says long time Watcher first time Tipper let's celebrate the last Kinda Funny Morning Show with the old",
            "start": 1355.6
        },
        {
            "text": "\"Tip alert, looks cool. Just just look at it again. Keep up the great work, thank you Rville Cide says long time Watcher first time Tipper. Let's celebrate the last Kinda Funny Morning Show with the old format and we are all looking forward to the all-new revamped KFMS. Gave a little smiley face also no morning show next week, no morning show next week because it is E3 but we'll be streaming plenty starting Saturday all the way through Tuesday morning and then we're going to be um live on the show floor of E3 with our good friends over at GameSpot so everyone can find us over there uh doing lots of fun stuff when I say us, I mean predominantly Tim and uh Greg will be doing that. I will be snake crawling across this education yeah exactly because I don't really have a lot to add other than my fun personality and my good looks all right my apologies I was reading from the wrong Black Panther page here's the new one for 60 for 60 years, Black Cat is the best you can get the history of\"",
            "start": 1405.8
        },
        {
            "text": "my fun personality and my good looks all right my apologies I was reading from the wrong Black Panther page here's the new one for 60 for 60 years Black Cat is the best you can get the history of firecrackers is deeply embedded in the Chinese psyche okay so God this joke would be so good if I didn't think it was so funny if I wasn't already cracking up at it you almost had me good thank you thank you everybody like the fireworks yeah Black Panther's abilities include skilled Hunter tracker strategist strategist politician inventor and scientist trained acrobat martial artist and gymnast superhuman senses enhanced strength speed agility stamina durability healing and reflexes genius level intellect uh yeah he's got yeah he wields the vibranium uniform boots and Equipment didn't really tell me much about him good for him keep going through your tips he's lame uh Stere 1992 says Nick can you sing Kiss from Rose by Seal like only you can and Greg you're sex used to be kids",
            "start": 1447.36
        },
        {
            "text": "me much about him good for him keep going through your tips he's lame uh Ster 1992 says Nick can you sing Kiss from Rose from Seal like only you can and Greg you're sex used to be kids from you my power my pleasure my pain baby that's all I got I don't actually know you know the words to every song you're like a walking jukebox but did you know you're like a human Spotify you're like the Shazam of people from Glen Ellyn Illinois that's right that's what they call me M Dog Nike Bab 96 says Happy Friday boys it's the eve of the first conference and I was wondering one wondering if Nick had any expectations predictions for E3 have a great weekend and have fun uh I do actually I'm hoping to uh not overeat and not die of alcoholism that's my prediction that's your prediction for one prediction is Kevin Fre3 is that I'm hoping to not do these things yeah that's my prediction Kevin and I are probably going to get super drunk at one point probably around Tuesday night you didn't drink",
            "start": 1493.64
        },
        {
            "text": "is Kevin fre3 is that I'm hoping to not do these things yeah that's my prediction Kevin and I are probably going to get super drunk at one point probably around Tuesday night you didn't drink last Wednesday night yeah you're not going to drink this time Tuesday if if things go the way they're supposed to yeah I hopefully did you check your slack last night morning no idea he has no idea no he did you see my tweet to Tim about twin Tim you know if you guys want to get a hold of me you can just call me on the phone you know that right this is the thing where we're not going to bug you slack you guys sck your check your Slack 2: in the morning for that thing that I S that's super important it's not super important you're not allowed to say it out loud don't say it out loud all right okay all right so from there okay fantastic so Tuesday night plan's probably out the window that exp where we explains what that tweet meant that's where we got to go amazing you know it's",
            "start": 1556.12
        },
        {
            "text": "all right so from there okay fantastic so Tuesday night plan's probably out the window that episode where we explain what that tweet meant that's where we got to go amazing you know it's you know it's impressive or you know it's awesome I have to call on I'm excited about this that's very exciting fantastic that's really good news I'm just very tired right now but that's great that's awesome when can we announce that never maybe on Monday oh look at you you're slipping never let me slip because if I slip then I'm slipping keep bringing your tips before I bite that face giving us a very nice tip 69 uh it says early birthday tax and it's on E3 Monday a solid $69 for your great content shout out to shui alumni episode 50 put out a cover of Return of the Mac Monday search a rocket complex on YouTube Return of the Mac fantastic return of Charles has given us another tip says greetings you sex you sexy thrust buckets what kind of Netflix would you like to see",
            "start": 1593.4
        },
        {
            "text": "a Rocket Complex on YouTube Return of the Mac fantastic return of Chuck Lorre has given us another tip says greetings you sex you sexy thrust buckets what kind of Netflix would you like to see in the future personally would love uh Roar Shack series having a great Friday and cool Greg keep being awesome what kind of Netflix would we want to see in the future what kind of content we want to see on Netflix in the future he's saying uh I'm assuming that's RoShack right yeah that's Roach yeah yeah yeah Series so what's the next Netflix series you'd want to see oh man I don't know that's hard yeah I don't know I got nothing I feel like Invincible would have been good that would have been my answer but then we saw Invincible would have been great Preacher would have been **** fantastic on Netflix but FX stole that or AMC stole that and just was that any good I watched one episode of it I didn't couldn't get into it but I remember reading the original the the going on I think so yeah",
            "start": 1657.68
        },
        {
            "text": "but FX stole that or AMC stole that and just was that any good I watched one episode of it I didn't couldn't get into it but I remember reading the original The Walking Dead going on I think so yeah it's that's another one of those Seth Rogen joints right like didn't he also produce it so we'll see what happens with the Invincible good Netflix show I don't know yeah I don't have a great answer for C with Greggy season 2 sure yeah anything from Kinda Funny anything from Kinda Funny St on Netflix let's start that campaign right now Heel Kick should be on Netflix that should Heel Kick should be on Netflix uh Greggy says \"oi here's my birthday taag\" KFL 3 was the best trip I slept for 13 hours when I got back to England that's that place over the season sure yeah thanks to everyone in the community for such a fantastic time Greg rematch at Mario Kart soon question mark no I retain my title as the best Mario Kart player of all time it's open for interpretation I C Thompson",
            "start": 1698.32
        },
        {
            "text": "in the community for such a fantastic time Greg rematch at Mario Kart soon question mark no I retain my title as the best Mario Kart player of all time it's open for interpretation I c Thompson would 210 says giving my first ever tip in the form of my birthday tax Dr 22 today appreciate and love all the work that you guys do happy birthday to you happy birthday to you happy birthdayy birthday you remember the song why I do I do happy why don't you me birthday actually remember it I'm sorry really yeah I don't I'm sorry I don't I don't sing a lot is it from Coming to America no sounds a lot that's what I thought it was too we're coming to America and the last tip for right now comes from disease gecko says get got free lunch from work so I thought I'd uh show my favorite boy some sweet nasty love E3 hot take new from new from soft game will be oddly colorful happy real life hot take Frasier is funnier than Seinfeld whoa yeah right get the **** out that could be backed up no I can't",
            "start": 1739.96
        },
        {
            "text": "love E3 hot take new from New From Soft game will be oddly colorful happy real life hot take Frasier is funnier than Seinfeld whoa yeah right get the **** out that could be backed up no I can't you like both back up I do like both but think Frasier is better no way I have been watching a lot of Frasier been giggling a lot giggling a lot you're allowed to giggle at Frasier you're not allowed to say it's better than Seinfeld giggling a lot I almost hit your arm again S I saw your Flinch that's different tis for now next story we're saying on ign.com where Jim Va'vova also known as Stack says the DC Movie Marvel Studios watches before they make any of their films I'm going to read this entire article probably because it's not that long but it's really heartwarming it's a cool article uh Marvel Studios Kevin what are we saying Feige and DC films Jeff Johns are supposed to be Rivals but their respective comic book movie Producers each",
            "start": 1798.92
        },
        {
            "text": "Studios Kevin, what are we saying Feige and DC Films Jeff Johns are supposed to be rivals but their respective comic book movie producers each started their careers as interns at the production company of filmmaker Richard Donner Foggy that's Figy and John's appeared together Wednesday night to salute Don at an Academy of Motion Picture Arts and Sciences tribute to the Lethal Weapon in Goon director Foggy Foggy Fagy Feige Feige yeah got it Feige and Johns united on stage to share their memories of Donner with Feige singling out Donner's 1978 Superman film for its excellence and significance not only to his career but to Marvel Studios as well \"Superman the movie is still to this day the archetype of the perfect superhero film origin story and we watch it before we make almost any one of our films\" Feige said and that's been the case for the past 17 years since I left the fold to go work for Marvel.",
            "start": 1842.04
        },
        {
            "text": "Perfect superhero film origin story, and we watch it before we make almost any one of our films Feige said, and that's been the case for the past 17 years. Since I left the fold to go work for Marvel, Fig's first Marvel credit was as an associate producer on X-Men (2000), which Donner executive produced with his wife Lauren Shuler Donner. Uh, she was just a regular producer. John's recalls uh Donner's anecdote for hating the first draft of the screenplay for Superman: The Movie and declaring \"I have to save Superman.\" John's went on to call Superman \"the greatest superhero film ever\" or \"the greatest superhero film still ever.\" Richard Donner, now 87, has retired from filmmaking, having directed his final film, 16 Blocks (2006), in addition to Superman, the Lethal Weapon movies, and The Goonies. Donner's other directing credits include The Omen, Lady Hawk, Maverick, and Scrooged. Scrooge is fantastic. Richard Donner... The G doesn't say that they both started as interns for yeah.",
            "start": 1891.68
        },
        {
            "text": "and The Goonies Donner's other directing credits include the Omen Lady Hawk Maverick and Scrooged Scrooge is fantastic Richard Donner. The G doesn't say that they both started as interns for yeah, that's so cool, yeah 100% uh a great of course the tie into what I'm always talking about is I always tell you guys to go read uh Superman: Last Son uh that's the one uh that he's working with Geoff Johns it's a great one, yeah fantastic book, that's awesome, yeah really really good book cool. I don't like the middle part where they make it 3D but that's just 'cause what you hate that part if I remember correctly, yeah like pH Z so it makes sense sure well okay we've been in The Phantom Zone without 3D but I'm was saying just don't you know that things are 3D in real life yeah I know that watch they came right at me what I couldn't that effects cost you $2,000 I'll I'll bill you later for that uh how do you feel Superman the movie is the greatest superhero movie of all time I",
            "start": 1937.76
        },
        {
            "text": "I know that watch they came right at me what I couldn't that effects cost you $2,000 I'll I'll bill you later for that uh how do you feel Superman the movie the greatest superhero movie of all time I mean it's it's up there yeah for sure I mean I actually I know this is UNC to say but I hold Superman 2 in higher regard than Superman one simply because I think that is to me when I was a kid that was my Superman movie I remember being terrified of Zod and uh uh Ursa nonan and like like just thinking like there's no way Superman can ever beat these people and then he outsmarted them right instead of just punching through them we out here I you you Jean Hackman doing his **** Jeff Goldblum before Jeff Goldman doing yeah Jee Hackman arguably well actually he was a good L there I'll give him that he was for that version yeah he was good not version I love the fight in the street of Superman 2 and obviously that's dick donor but that's not you know that that movie is very much like",
            "start": 1980.6
        },
        {
            "text": "The Boys Get Ready For E3! - Kinda Funny Morning Show 06.09.17\nthat he was for that version yeah he was good not version I love the fight in the streets of Superman II and obviously that's Dick Donner but that's not you know that that movie is very much like kind of shrouded all and all that controversy because second director coming in and directing all it's fascinating story if you guys don't know I'm sure everyone does but like they brought in a second director and in order for him to get credit he had to direct at least I think was like 51% of the movie so we went back and just did a bunch of stupid ass re-shoots for no reason and you can see the difference in body shapes oh yeah of Christopher Reeve in certain scenes when he's like jacked out when he was actually working out to play Superman he brought back like six months later he's like smaller really it's pretty crazy yeah I knew the story of like I mean obviously of Donner having the falling out with the Salkinds or whatever the producers were guys that own the rights to it yeah",
            "start": 2023.56
        },
        {
            "text": "it's pretty crazy yeah I knew the story of like I mean obviously of Donna having the falling out with the Salkinds or whatever the producers were guys that own the rights to it yeah there's a bunch of really good documentaries about it or whatever I think what one of the Superman movie collections there's one that's in there following the whole thing of like the whole trouble been so long Snyder whatever there I don't know if I've ever seen it but I know there is a Richard Donner cut of that movie yeah yeah I don't know it's not it's one of those I have it I I can bring it in show to you I love you I mean I think it's not vastly different it is because he didn't get to actually finish the whole thing is that like for him like the ending to Superman 1 was supposed to be the ending to Superman 2 or whatever and that's what he does is like the Donner cut has a couple additional scenes and then takes that ending and stacks it on the end and so after hearing about this for",
            "start": 2059.28
        },
        {
            "text": "to Superman II or whatever, and that's what he does is like the Donner cut has a couple additional scenes, and then takes that ending and stacks it on. So after hearing about this for years and years and years to buy that DVD and pop it in be like \"oh, that's what it was.\" Wait, so what, what is it again? Where he rewinds time or whatever... oh, I see. Yeah, I don't like the rewind time thing - that's my thing. Is like the first one, I'm like, \"ah, he's way too overpowered.\" A and B, I had a huge crush on Kate Mulgrew back in the day, and I was I was pissed that she didn't get the role... I didn't know it at the time but I'm pissed now. You know, that was fine, but how much better would Kate Mulgrew have been for Lois Lane? I don't even know... who knows? I know Kate Capshaw played in Indiana Jones and the Raiders of the Lost Ark - she was awesome. Close your eyes, Mariam, don't look at it, don't look at it, Mariam. Yeah, anyway... I heard I heard that she was up for the role and I thought she would have been a better um",
            "start": 2094.44
        },
        {
            "text": "the Lost Ark, oh she was awesome, close your eyes, Mariam don't look at it, don't look at it, Mariam, yeah anyway, I heard, I heard that she was up for the world and I thought she would have been a better Lois Lane, that's why she probably popped up in Scrooge, having said that though, I cry every single time almost that I watch Superman, we get to the scene where the helicopter's about to fall, you don't know what's going on, it falls, she grabs him, don't worry ma'am, I've got you, she goes, you've got me, me, who's got you, it's great delivery, I love it, dude, it's the first time you see like Superman being Superman, it's so good and I remember as a kid watching them like do the uh the E! Entertainment Tonight whatever behind the scenes about technology behind yeah and him going like you, you know how they showed him on the thing and I was like that's so cool like the projection behind him and like the rig that would like you know do this for him I was like that's cool we're all",
            "start": 2129.32
        },
        {
            "text": "how they showed him on the thing and I was like that's so cool like the projection behind him and like the rig that would like you know do this for him I was like that's really cool we're all spoiled now cuz you could just Google YouTube everything and we all know kids that are 15 years old know how to you know comp stuff out better than people that are getting paid millions of dollars to do it but back in the day that was cutting edge technology was like how did they ever do it like the back screen was like kind of moving a little bit but he's flying you didn't care you will believe a man can fly uh next up we're jumping over to gamespot.com where Eddie says EA is showcasing he actually says showing eight games at E3 briefing two might be unannounced remember ladies and gentlemen E3 kicks off tomorrow we will be here what is it 11:30 is that when our pre-show starts anybody know looking around nobody knows off top of their head yeah 11:30 Pacific time we'll be here with a pre-show",
            "start": 2174.4
        },
        {
            "text": "off tomorrow we will be here what is it 11:30 is that when our pre-show starts anybody know looking around nobody knows off top of their head yeah 11:30 Pacific time we'll be here with a pre-show for EA then we'll go into the conference watch it with you then we'll come back out do a post show do some reactions and stuff but right now Eddie says just days before EA's E3 briefing the company today confirmed that it will have at least eight games to talk about during its event two of which could be unannounced titles in a blog post titled \"Get a First Look at Eight Games and More Surprises\" EA listed off six of the games it will show during the briefing on June 10th the other two could be unannounced titles the six confirmed games are Star Wars Battlefront II, FIFA 18, Madden NFL 18, NBA Live 18, Need for Speed: Payback, Battlefield 1 as for the other two games there is no word yet on what they could be EA said in its blog post that the briefing will include quote unquote new reveals so they",
            "start": 2213.24
        },
        {
            "text": "Need for Speed: Payback, Battlefield One. As for the other two games, there is no word yet on what they could be. EA said in its blog post that the briefing will include quote unquote new reveals, so they could be brand new titles. The show starts at noon Pacific Saturday June 10th; we hear Kinda Funny, we'll be going 11:30, get you in here, get you settled. It's expected to run for 90 minutes; we'll see you then. Three starts tomorrow, super exciting guess I was apologizing so out of all those yeah other than Star Wars Battlefront 2 are you excited for anything? I want to see what they're going to say for Battlefield One people loved Battlefield One right like what's the what was it DLC what are they doing more stories is it just multiplayer is it single player people really like the vignettes from Battlefield 1 so we're with that. I like Madden, I mean I know it'll be we've upgraded the physics engine we've done this whatever I want to see that FIFA of course I don't care about I know a lot of",
            "start": 2259.16
        },
        {
            "text": "Battlefield 1 so we're with that I like Madden I mean I know it'll be we've upgraded the physics engine we've done this whatever I want to see that FIFA of course I don't care about I know a lot of people care about NBA Live and EA is hungry to catch up to NBA 2K which just dominates right so what do they have up their sleeve what's that going to be I'm not like super stoked for it in the Need for Speed: Payback I know big Kevin - our racing fan he wants Kev do you have the need the Need for Speed playing playing with kev's toys I think Kevin might be sleepy I think if Kevin's going to be so comical in his facial expressions and General posture and stuff we need to get a camera on him at all times if this is going to be the new setup of the show The Kev we got the cool Greg C we got Kev c i mean i with K's toys toys and and I'm more excited to see what the two unannounced games would be sure you know it I I I think I think one of my official predictions was that",
            "start": 2302.52
        },
        {
            "text": "Greg C we got Kev c i mean i with Kevin Coello's toys and and I'm more excited to see what the two unannounced games would be sure you know it I I I think I think one of my official predictions was that they book end it with Star Wars which I don't believe will actually happen but I made the prediction that they start with Battlefront 2 and then they end with Amy's game to tease us on that one **** amazing seems like that would steal a thunder at Battlefront 2 though so I don't think it but it's a lot of Star Wars I you know I hope that they they you know they had done the whole yarney thing maybe they're going to have another smaller indie game in there you know talking about hey we're not the big bad EA we are this yeah seem as haven't done anything in a long time um question yeah I'll take one I'll take questions now from the audience questions from the audience did the Battlefront VR game ever come out yeah that the Star Wars Battlefront VR thing was it was like a patch they put into",
            "start": 2341.76
        },
        {
            "text": "one I'll take questions now from the audience, questions from the audience did the Battlefront VR game ever come out, yeah that the Star Wars Battlefront VR thing was it was like a patch they put into Battlefront, yeah so we can go right now 100% yeah you get in the X-Wing you fly around and shoot stuff at some point Darth Vader flies in and they're like this isn't can he's like but with the meta-chlorians I can do anything he pops upside down and then goes we love he opens a wormhole Hermione comes out of it I'm G to **** you up B I went to Brown **** now it's real it's real I'm a stone or I'm a be no sure every we're taking a Beep's break while you're at home snapping do a Beep's Burger go go to your local Beep's Burger there's probably one near you or only one in San Francisco hey Tim Gettys' lips can you ask people to uh come over here and show you a cool dark shirt order Beep's we already asked him to order Beep's if that's what you're going to say no all right uh if anyone has any",
            "start": 2382.2
        },
        {
            "text": "\"Lips, can you ask people to uh come over here and show you a cool Dark Souls shirt? We already asked him to order beefs. If that's what you're going to say, no all right. Uh, if anyone has any clips from Kinda Funny Live 3 or pictures, can you send them to Tim at kindafunny.com? I appreciate it. You know, anybody who did hit them up and ask them to do it there you go, spread the love. Do we is there not is there a like a shared Dropbox that we could just send the link out to for people? Last time I tried to do that got real messy real fast, lot of people just threw a lot of stuff in there box...not so much that but uh, just if you upload it to your own Google Drive or your own Dropbox, you could zip everything. Whoa, Your Life Live! What's that? Oh, have St. Do you want beeps burger while you're doing that all right yeah you do, just making sure you're taking care of yourself because I love you. Got jump back into the tips sorry you don't have a space program it's okay they don't understand I think.\"",
            "start": 2435.48
        },
        {
            "text": "doing that all right yeah you do just making sure you're taking care of you because I love you got jump back into the tips sorry you don't have a space program it's okay they don't understand I think anytime now Rob Ford will add it for you dead I think it's a fake they're faking us out they want us to put our guard down that's fair that's fair exp well that's what you when you get when you when you go team fat team cocaine team alcohol abuse yeah I thought was meth was it meth who is this Jean St the president of Canada Rob Ford did he do meth or cocaine the mayor of Toronto did meth did meth and Di didn't they didn't they just reelect that guy or was that the mayor of Detroit wasn't there a mayor that did meth got caught with a prostitute and they re-elected that's you're thinking of you're thinking of Washington DC I know who you're talking about think we were I was we were kids we were kids happen again years ago oh then it's something you were talking about different things",
            "start": 2495.0
        },
        {
            "text": "you're thinking of Washington D.C. I know who you're talking about, think we were I was we were kids we were kids happen again years ago oh then it's something you were talking about different things to uh Statksy says hey guys I'm flying from LA to from New York and E3 for E3 and suggestions and things to do while in everybody stop talking Nick's having a stroke I'm not this read this no I know which one am I on this one here I'll I'll take over here uh Statty no no I'm add your burger oh okay hey guys I'm flying to LA from New York for E3 and suggestions and things to do while in LA the I hope to see you guys in the floor at E3 cuz I miss Kinda Funny Live three have a great day boys um people always ask this for us and the answer is we don't know man we go to LA and we **** punch E3 in the **** face and then we get the hell out of there can we go to P in Buena Park yeah we can R the car me you and well I think you're flights like noon your flight's like noon why why",
            "start": 2538.32
        },
        {
            "text": "punch E3 in the face and then we get the hell out of there can we go to P in Buena Park, yeah we can rent a car, me, you, and well I think your flights are like noon, your flight's like noon, why, why? You because you guys wanted to get home so fast that was insane Sunday, I don't even know what you're doing, I'm going to do a little okay, so it's a late night, how late is it open, I'm going to go down on Friday, I'm going to film Epic Meal Time, yeah love mute my mic when I say that, uh, and so I want to do that and then hang out with Scott Lowe, oh God, Scott Lowe, yeah you want to grab this and add your burgers and play with the boys working out for you by the way, the PopSocket, I think you have placed it too high, is that my problem, yeah cuz I'm feeling it right now and I'm still a little wasted so I do like it for propping it up sure I do like it for when I'm walking around yeah but I do agree that maybe bringing it to would give me more but you won't be able to pop it",
            "start": 2588.96
        },
        {
            "text": "a little way so I do like it for propping it up sure I do like it for when I'm walking by around yeah but I do agree that maybe bringing it to would give me more but you won't be able to pop it up as nicely then my only complaint about it is that it'll get caught in my pocket sometimes oh I use that to my man your well remember that also broke that broke your pants too remember that or broke your phone that time your phone yeah but that's when I didn't know that when I go take a **** I got to like this get in there I got to hold like that so it doesn't fall out yeah this Pro tips yeah yeah um let's knock off the we have two more stories we'll get those out of the way we'll get to tips we'll start playing Friday the 13th we'd eat a burger in front of you maybe we'll **** um staying with Eddie on GameSpot.com he has this uh link now that I see them on the giant TV it kind of breaks my head sometimes where I forget to open them and then I I panic ahead of E3",
            "start": 2639.44
        },
        {
            "text": "**** Um, staying with Eddie on GameSpot.com. He has this uh link now that I see them on the giant TV, it kind of breaks my head sometimes where I forget to open them and then I I panic ahead of E3. Microsoft trades Mark trademarks Direct Reality, and it might be related to gaming. It looks like one of Microsoft's E3 '17 surprises might have been revealed early. The company filed a trademark application for something called Direct Reality, and it's related to gaming. The trademark covers computer game software and more interestingly, computer software for holographic appption applications. Additionally, it covers online computer game software including holographic applications. The application was filed just two days ago on June 2nd. Trademark application filings do not always lead to product announcements, for example Activision registers things like Call of Duty: Future Warfare and Secret Warfare. There's nothing more to go on regarding Direct Reality though its name and how it's connected to",
            "start": 2675.96
        },
        {
            "text": "for example Activision registers things like Call of Duty: Future Warfare and Secret Warfare. There's nothing more to go on regarding Direct Reality, though its name and how it's connected to holographic applications might suggest it's related to Microsoft's HoloLens technology. They've contacted them for comment, but we know that Scorpio at E3; we know that Phil Spencer is saying the conference will probably go longer than their traditional ones because they have a lot to talk about, and this is going to be the whole interesting thing of well how do you care about VR? Are they going to take that on or are they looking at the success of PlayStation VR but not like the success of like what a million games that are getting in 10? Are they going to come out and be like hey we don't believe in gimmicks, we learned our lesson with uh Connect; we want to be games for gamers. Scorpio is a machine for developers, Steve's PlayStation messaging",
            "start": 2723.32
        },
        {
            "text": "going to come out and be like hey we don't believe in gimmicks we learned our lesson with uh connect we want to be games for gamers Scorpio is a machine for developers Ste PlayStation's messaging basically and say we're not doing that we believe in you we believe in the consumer backwards compatibility here it is Xbox Live is cheaper blah blah and go I don't know I don't know either I think saying hey we have direct reality gets in the way of that I think direct reality sounds like it's going to be would be a hard sell I think Hololens is a hard sell to people that's why I don't think you'll see these applications really getting put out into video game space but I'll be honest though the term direct reality is **** cool I don't know why I like it yeah it's just cool it is a cool name you think it's cool no I like I think it's better than augmented reality sure that just sounds like it's going to be two techy and it's not going to work without a **** firmware update direct reality",
            "start": 2764.76
        },
        {
            "text": "think it's cool no I like I think it's better than augmented reality sure that just sounds like it's going to be two techy and it's not going to work without a firmware update direct reality sounds like a dope ass album the only person I've ever heard excited about lens Cisco after to use it for Halo and then Gus Sola two of the biggest dorks I know so Gus is a dork love him but he gets excited about he gets excited about not like Gus gets excited when no one talks to him all day yeah that's the kind of stuff that excites Gus like if he can just sit in his weird office by himself and no one talks to him he's super excited yeah he's like the Mark Nick of uh W there's a deep cut of Rooster Teeth everyone knows Mark Nick you know what I mean yeah our whole audience knows Mark Nick the guy who runs database at IG was awesome Mark is epic cool Greg don't know him Mark Nick is epic remember that time he was like that be a podcast I pay for with Mark Nick no cool grag",
            "start": 2803.4
        },
        {
            "text": "Mark Nichols, the guy who runs the database at IG, was awesome. Mark is epic cool. Greg doesn't know him. Mark Nichols is epic. Remember that time he was like that? Be a podcast I'd pay for with Mark Nichols no way, and Mark Nichols ten one give them no feedback; they would just stare at each other for 35 minutes, and then one would get up and leave, the other one would come and dress as friends. I guess I wouldn't have gotten my money's worth, but oh man. The final story comes from The Hollywood Reporter. You put this one in there. Ryan Parker reports that Space Balls helmet worn by Rick Moranis is up for auction, also listed as a miniature model of Lone Starr and the Barf's Eagle 5 space Winnebago used in the film. It's a good thing you were wearing that helmet; an incredible piece of movie history is up for auction, and bidders don't need the Schwarzenegger to get it – just a big bank account. The helmet with full down mask Rick Moranis wore while playing Dark Helmet in Space Balls is up for auction through Heritage Auctions.",
            "start": 2854.24
        },
        {
            "text": "the Schwarzenegger to get it just a big bank account the helmet with full down mask Rick Moranis dawned while playing Dark Helmet in Spaceballs is up for auction through the Heritage Auctions I think through Invaluable I don't know if that's what he means though Invaluable I think oh no the program is through Invaluable like the price is currently $8,000 consisting of 20 inches around by 14 inches tall the cartoonish Darth Vader stylized helmet is constructed of a vacuum-formed plastic component shell fixed to an internal construction worker's hard hat and liner to fit the actor the auction description reads it also features screw-hinged movable face plate section featuring vents metallicized shower drain mouthpiece and the Triangular embedded tinted see-through lenses I feel like it should be bigger than that though 14 inches tall like it should be at least two to three feet tall look how big it is on Rick Moranis Rick Morand is a real small guy yeah but he's not that small",
            "start": 2895.48
        },
        {
            "text": "like it should be bigger than that though 14 inches tall like it should be at least two to three feet tall look how big it is on Rick Moranis, Rick Mor is a real small guy yeah but he's not that small that's a great this is **** that number can't be right that can't be right they **** this up Kevin give me what does 14 inches look like yeah that's not right uh really that's 14 inches that might be yeah might be right actually no that checks out that checks out that does check out okay I'm sorry I apologize Hollywood Reporter facts straight apologize to him you know what I mean my apologies Rick Moranis previously told The Hollywood Reporter the original idea for the mask in the Mel Brooks space spoof was a full body prop but that was later scaled down for what's on film quote it was very light actually took one prop guy to maneuver it Moranis told The Hollywood Reporter where is it now the Smithsonian according to the invaluable site the helmet and mask have only minor",
            "start": 2944.2
        },
        {
            "text": "it was very light actually took one prop guy to maneuver it Dan Aykroyd told The Hollywood Reporter where is it now the Smithsonian according to the invaluable site the helmet and mask have only minor production wear and age but but for being 30 years old are in very good to very fine condition well there you go should we get it no damn it I mean you can damn it what do you think it's going for right it was $8,000 to start I just feel like I'm trying to figure out where we can put on the set I don't feel oh here we go clicking on it right now we are currently tight and have it floating $99,000 right now go into it and it comes down on me I want it to be like um Matt Smith from Doctor Who where he turns around and the just goes like a thing puts the mask on him and then he runs out I want like there to be a mechanical arm that comes from the ceiling can we do that like uh like when I hit a but I want to be able to hit a button and stop and have it just put the mask on my head like Rogue One",
            "start": 2984.28
        },
        {
            "text": "to be a mechanical arm that comes from the ceiling can we do that like uh like when I hit a button and stop and have it just put the mask on my head like Rogue One what happened in Rogue One there was that scene where like yes like Darth Vader exactly like that that's Sensational sh with the rest of the tips did you get what's that from ESO did not our first tip I apologize I must have missed came from esoic says shout out to the homie cool Greg for showing love on Instagram thanks everyone keep it up hell yeah thank you bro yeah boy uh next tip comes from t Williams spgh says paying my birthday tax boys going to see Tom Petty and the Heartbreakers with the misses tonight to celebrate ever had a chance to see them question got to rep the Berg let's go pens we want the cup I've never seen Tom Pet in the heart in person in concert have you never no not bad though I wouldn't mind it uh Azera says what's up we're calling tips tips I leave for boot camp on",
            "start": 3030.32
        },
        {
            "text": "we want the cup I've never seen Tom Petty in concert have you never no not bad though I wouldn't mind it uh Azera says what's up we're calling tips tips I leave for boot camp on Sunday so before I go what are your thoughts on The Prestige and where it ranks with other Nolan movies number one thank you for your service go get them mhm number two never seen the prestige oh damn movie great I think the prestige is great I don't think it's Nolan's best film but I definitely don't think it's his worst film I think it probably ranks up I said I don't think it's his best film but I don't think it's worst fil I sound like he said I definitely think it's his worst oh no no no I think Prestige is great I it's yeah I don't I couldn't tell you where it ranks without looking at all those movies but it actually I don't know has Nolan done a bad film yeah The Dark Knight Rises I will go to my grave explaining to you guys that this was not a good movie oh my God you can get a Die",
            "start": 3082.28
        },
        {
            "text": "all those movies but it actually I don't know has no one done a bad film yeah The Dark Knight Rises I will go to my grave explaining to you guys that this was not a good movie oh my God you can get a Die Hard 2 production slate bucks buy that let's use it for everything and I'm like Nick this is not die hard I don't give there's a Freddy Krueger there's a whole bunch of Freddy Krueger **** well a stunt mask I guess **** wow you guys are having fun while you guys look at that I'll read the next tip uh jab boy says fun fact the arm that the US space station uses to dock with the International Space Station was made by Canadians and is appropriately called the Canadarm okay that's funny you're going to make it up it's gonna be funny that's funny okay jimster Jim says Nick have you watched the Daily Show Hasan Minhaj's Netflix stand-up yet it was hilarious with great personal stories you'll love it it's on my queue and Louis C.K.",
            "start": 3123.6
        },
        {
            "text": "that's funny okay Jim says Nick have you watched the Daily Show with Hasan Minhaj's Netflix standup yet it was hilarious with great personal stories you'll love it it's on my queue and Louis C.K. did another one too it's hard to keep up with all of them but I try to watch them all as they come because they're very inspirational to me you know I'm inspiring St I know you are I you did it a Kinda Funny Life three getting up there on stage every once in a while dragging people out trying to uh you know trying to inform people of what's going on you saw uh Nick performed the other night at open mic night not Kinda Funny Live how do you do man I don't know I feel uncomfortable talking to him about it I think he did good but he keeps trying to convince me that I only think he did good cuz we're friends oh I think he did so much better than a lot of other people there so I don't know like the excuse goes out the window just accept it you're good I have no idea what he just said",
            "start": 3167.36
        },
        {
            "text": "cuz we're friends oh I think he did so much better than a lot of other people there so I don't know like the excuse goes out the window just accept it you're good I have no idea what he just said because your game started hey you know what y Big C dog he said you did good but you're trying to convince him that you you he's only saying that because no I don't mean that I mean that I know how to make cool Greg laugh I know the **** that I can say that it's going to make him laugh and Kevin laugh so it's not like the thing you have to be careful of when you go and do things like stand up or open mic is that when you if you bring your friends there of course they're going to be super supportive but those aren't they're not real people let's be perfectly honest those are your friends are there support you you want you want to go out there and get in front of people that don't know you so you can actually see if your material is good or not and uh this this so happened to the place I went",
            "start": 3201.92
        },
        {
            "text": "support you want to go out there and get in front of people that don't know you so you can actually see if your material is good or not and uh this this so happened to the place I went to had this amazing rendition of The Last Supper starring Jesus and his boys uh so I made fun of that for a while because I thought it was odd to have that picture in a bar so he was like it's just over there I never that's a weird choice it wasn't very I mean obviously it was kitschy the bar is kitschy it was uh I think it was Iron and Gold have you ever been there no it's down the it's fun cool bar um but yeah they had it was like back lit with like LED lights around it so it was obviously like cheesy but I never actually stopped to look at that that the painting of The Last Supper and I didn't realize that everyone's leaning away from Jesus it looks like he just blew one in his pants what I'm talking about and there's just some old dude on the corner that's just trying to",
            "start": 3235.36
        },
        {
            "text": "and I didn't realize that everyone's leaning away from Jesus, it looks like he just blew one in his pants; what I'm talking about is there some old dude on the corner who's just trying to reach for the wine; he's going out there like I'm so hammered, I just need one more drink, like C away from the wine; he does cocaine; um, Shotgun McPain says Greg, \"going to see my favorite band\" (in parentheses is a band called Metallica); okay, at Soldier Field for the first time, I'm definitely making a stop; Appell uh, but that hot dog scares me; do you have any other suggestions? Get well, I mean, get in, Ali; don't be scared, but don't go; they're good, yeah, yeah, that's the cut off for them; if you're scared of the hot dog, yeah, I mean Kevin's saying don't go, but there's also Italian beef; there you can do that, that combo, SC, the Italian beef; I don't know why you're scared of the hot dog; if it's the toppings, you can put whatever you want on the hot dog; no, but get everything",
            "start": 3269.44
        },
        {
            "text": "you can do that that the combo is the Italian beef if I don't know why you're scared of the hot dog if it's the toppings you can put whatever you want on the hot dog no but get everything you're going to want Chicago-style hot dog, Matt Bowen says \"take my money\" you beautiful bastards enjoyed Kinda Funny Live 3 not going to lie you guys outdid yourselves last year here's to Kinda Funny Live for being the biggest best show yet so he's saying we outdid what we did last year correct I believe so the way that he means that the last Kinda Funny Live 3 was cool but two was better but you're outdoing yourself next year that doesn't make sense I think you meant this year I do myself uh Mr. Bento boach says Kinda Funny Live 3 was a blast thanks for all of your guys' work putting it together also Greg how do you feel about Taylor Swift being back on Spotify we stoked last night I was I was cooking MH so I was doing the shout out to Alexa hey Alexa play this hey Alexa play that and I started",
            "start": 3312.6
        },
        {
            "text": "also Greg how do you feel about Taylor Swift being back on Spotify we stock night I was I was cooking MH so I was doing the shout out to Alexa hey Alexa play this hey Alexa play that and I started going to Taylor Swift and I was like oh she's not on there and then as I was going to bed looked at my phone everybody's freaking out now do you feel like it's a coincidence or strategy that she put her music back on Spotify and streaming and streaming platforms across the board the day that Katy Perry's new album drops o I didn't know that yeah that was one of the stories I read That's strategy cuz she still hates Katy Perry she really still hate bad blood it's a bad bad blood's about her stealing backup I don't like this I don't like it these are two of my favorite people I want them to like each other man I don't like people I don't want anybody to cross Taylor Swift and if they do put them in the ground that's what big Tay is doing pick size oh yeah I mean I I",
            "start": 3352.4
        },
        {
            "text": "I want everyone to like each other, man. I don't like people. I don't want anybody to cross Taylor Swift, and if they do, put them in the ground. That's what Big Tay is doing. Pick size, oh yeah! I mean, I get it, I get it. I just didn't know who you break, who she, who you get? Huh? What was what's the Bad Blood over backup dancers? She stole her backup dancers; who stole whose backup dancers? Taylor Swift had this like great crew of dancers for her show or whatever, and like they're the best, they're the best, they're the best. And like told Katy Perry that, and K she just hired them all well, that's the back... yeah! I mean, like I know no you can't steal people's crew man, that's just not the way it goes exactly. It's like you know you can't just be like getting people from another company or another crew or something like that. You can't just say you can't just publicly say that if some hypothetically Ryan McCaffrey wanted to come here, we'd steal from my... we can't hypothetically say that you.",
            "start": 3386.96
        },
        {
            "text": "another crew or something like that you can't just say you can't just publicly say that if some hypothetically Ryan McAffrey wanted to come here we'd steal from my we can't hypothetically say that you can't out we want Dorfman and McAffrey for a player to be named later D Jonathan Double D this is a joke from the Game Over Greggy show that's now live on Patreon it'll be live on Patreon Early Access today at some point one buzz in that episode we make a joke that's called back to the episode we we don't give a **** fck what was that joke what was I talking about it was uh it's not no one's G to understand it because they won't have watched it I think it was don't don't **** with me was it oh yeah number three **** with me we dude that was a good that was a good the show that goes live today is the Game Over Greggy show is all about hey let's talk about the community where we're going update podcast it's us talking about in real it's us brass taxing taxing about the",
            "start": 3425.16
        },
        {
            "text": "The Boys Get Ready For E3! - Kinda Funny Morning Show 06.09.17\nshow that goes live today is the Game Over Greggy show is all about hey let's talk about the community where we're going update podcast it's us talking about in real it's us brass taxing taxing about the business as the three of us and then next week's episode has Janina on it who's you know the star Star Wars Battlefront 2 she can only be on half the show then Andy comes in and the show is just **** awesome yeah it was a great show we had a great time in that show Janina brought a much needed uh boost of energy in and then Andy took that energy and made it candy right he wraps it up in some cotton candy that's what he does hard candy candy nerds perves and curves says has given us a quite nice tip and said hey guys we just uploaded the last of four videos chronicling our trip to Kinda Funny Live 3 we hope you guys enjoy our footage our YouTube channel is nerds perves and curves everybody check that out what's up Kev dog I was want to check out the post oh uh here it didn't get cancelled",
            "start": 3470.08
        },
        {
            "text": "Live 3, we hope you guys enjoy our footage. Our YouTube channel is Nerds Pervs and Curves - everybody check that out! What's up Kev dog? I was wanting to check out the post... oh, uh, here it didn't get cancelled, it's it's it's looks like it's actually happening this time. Kristoff Wedon says don't read aloud, okay 1220. It looks like we should have Burgers all right, cool. Let's run around the corner, but I'm leaving, I'm leaving it jacked up on the sound so that if something goes wrong, say large and we do have a PO box if you want to send us things - you can find that on... is it on Reddit? It's no, well, yeah, it is, but it's right below you right now on Twitch. Okay, shrink the video down there is our PO Box, there you go. We appreciate that. Uh, Game Jumper X says have you activated the tip counter, tip level at :1 - this is my second tip and I plan to... uh, increase my tip one penny each time. This last thank you very much, thanks, appreciate that. Somebody should go to the PO box at some point probably a while if we end.",
            "start": 3515.44
        },
        {
            "text": "Is my second tip, and I plan in uh increases my tip one penny each time. This last thank you very much, thanks appreciate that. Somebody should go to the PO box at some point probably a while if we end at a reasonable hour, I can do that today. They're going to hate us, and Lisa are going to hate us. No way, I brought them ice cream sandwiches once. We were there; I was there. We shared a moment uh, the last time I was in that PO Box when that woman and her small child remember that? Yeah, when the kid just was like \"like\" I it's sad because sometimes kids just break their mothers, and this was one of those. I told the story on the podcast but I'll we tell it now for everyone else on Twitch cuz I know you guys probably don't watch any of the other content; you're just here on Twitch and you don't go over YouTube um, the kid just walked over to this little kid walks over to this giant display of Hallmark cards and just one by one starts taking them looking at her mom and just throwing them on the",
            "start": 3558.28
        },
        {
            "text": "go over YouTube um the kid just walked over this little kid walks over to this giant display of Hallmark cards and just one by one starts taking them looking at her mom and just throwing them on the ground and the mom's like you know what just do it just do it and Kevin and I were just shaking our heads because kids suck Shack Town is giving us another nice tip and says one day I'm going to leave uh oh Mountain uh what is that mountain time world and man Minnesota no Minnesota Minnesota which is the shittiest time zone and come to Kinda Funny live and meet or the meet and greet well you come to both you get that VIP they got planes man don't worry you get it they do sorry I thought it said mountain time but we're not mad at you uh Clammy Money says can't wait for E3 coverage it's going to be beautiful and by that I mean you guys are going to do a great job hey we sure are remember it kicks off tomorrow 30 minutes before each and every conference we'll be here except for the dorky",
            "start": 3598.6
        },
        {
            "text": "to be beautiful and by that I mean you guys are going to do a great job hey we sure are remember it kicks off tomorrow 30 minutes before each and every conference we'll be here except for the E3 one then we're doing the live show yep GameSpot we'll be hosting here Wednesday afternoon yep maybe we'll have Shu Yoshida we will Stoke Danny says it's my birthday just want to say thanks for everything this past weekend thanks to the amazing Community we have love you guys and keep making us best friends proud you're my boy Andy we love you stoked Danny you're a good fella two more tips uh as Mero says hi Nick hoping for advice my crush ended up working at the same office and she shut me down without me saying anything after people teased that I like her now she treats me cold and it destroys me uh on yeah you you got to just move on man I'm sorry that sucks but if she's not into you she probably will never be into you and you trying to force the issue is not going to be good so you",
            "start": 3639.84
        },
        {
            "text": "me uh on yeah you you got to just move on man I'm sorry that sucks but if she's not into you she probably will never be into you and you trying to force the issue is not going to be good so you literally just have to move on you can't do the thing where you fake move on and hope and secretly hold that hope that she's there move on just move on man start dating other people immediately there's other fish in the sea and uh or you can just find one thing you don't like about her and just obsess over that uh you know what helps me big a sandwich says I have a link to my version of I'll Make a Man Out of You play it love it I love you guys congrats on all the success and he's giving us that link on Twitter uh I'll watch that later thank you very much and DJ Khaled is giving us the final tip and it says in giant bold letters do not read on air so I will not read that I'm trying to do it right now okay Greg's looking into that thank you very much for that uh that",
            "start": 3682.56
        },
        {
            "text": "tip and it says in giant bold letters do not read on air so I will not read that I'm trying to do it right now okay he Greg's looking into that thank you very much for that uh that tip and that that tip I guess both tips that's it for tips let's go into the old columb morti 3 and three no we haven't given away a game or anything we got to give away there's a whole bunch of **** that hasn't happened if you didn't know ladies and gentlemen you're watching the Kinda Funny Morning Show every week here on twitch.tv/ kindofunnygames we come to you with the nerdy news you need to know about before jumping into the chat to answer your questions comments and concerns but those two segments I reaching the internet grab a video game toss it to one of you how do you win it it's simple be in the twitch chat like so many of you are right now on twitch.tv/ kindofunnygames but if you can't be there live no big deal maybe you're watching on youtube.com/ funny later maybe you're listening on",
            "start": 3723.92
        },
        {
            "text": "in the twitch chat like so many of you are right now on twitch.tv/kindafunnygames but if you can't be there live no big deal maybe you're watching on youtube.com/kindafunny later maybe you're listening on a podcast service or around the globe you have three other ways to win and if you are on the twitch chat that means you have four total ways to win you could of course subscribe to us here on Twitch if you subscribe to us you get the Kinda Funny logo next your name the cool emotes private chat time with us you get to play multiplayer games with me when I find one I like like Friday the 13th which we have to figure out but then there's this stupid thing called E3 in the way next week um and to get the show ad free which means no pre-roll ad on Twitch cuz we bring the ads here because we love you so much um you could also support us on patreon either patreon.com or patreon.com/games at the $2 and up level uh that would get you entered to win it in coming uh what a week from Monday would also",
            "start": 3764.68
        },
        {
            "text": "so much um you could also support us on Patreon either patreon.com or patreon.com/games at the $2 and up level uh that would get you entered to win it in coming uh what a week from Monday would also get you exclusive access to early uh episodes of all the shows that aren't in the podcast and then the ability to watch the P Podcast live as we record them today because I'm about to play Friday the 13th I'm going to give away another Friday the 13th yeah yeah boy I'm going to do it on PlayStation 4 because that's the best of course you got it too high bro do this I'm going to click it here uh Friday the 13th is getting given away on PlayStation 4 to someone after I read this ad oh I gotta did you know ladies and gentlemen about Movado watches we've been talking about them all week okay Movado watches $95 at a department store you're looking at 400 to 500 bucks Movado figured out that by selling online they are able to cut out the middleman and retailer mark-up providing the best",
            "start": 3801.16
        },
        {
            "text": "watches $95 at a department store you're looking at 400 to 500 bucks movement figured out that by selling online they are able to cut out the middleman and retailer Mark markup providing the best possible price classic design quality construction and stylized minimalism over 1 million watch is sold in 160 countries now you might be asking yourself why do I need to watch Greg in this day and age and I'll tell you why here we go maybe your daughter goes out on a date with somebody Jesus Christ maybe that man is named Pete Thompson he's a star football player and your small Georgia town everybody looks up to Pete but you need to know hey I said 11:30 so when Pete and this woman walk in at 11:45 your daughter you take the gun and you shoot Pete yeah and then it's a rock and roll and trip across the United States is you shave off your beard shave your head why you have all your life savings withdrawn maybe you start cooking meth fig you park the car you had in a wooded area you walk back",
            "start": 3848.24
        },
        {
            "text": "across the United States, is you shave off your beard, shave your head, why you have all your life savings withdrawn, maybe you start cooking meth. Figuring out you park the car you had in a wooded area, you walk back to a house, you buy that Galapagos... you drive that guy down to Mexico and then when you get there, you get your Movado watch set to Mexico time. Do you want to get to Mexico and not know the time? How would you know when it's lunchtime? How would you know when it's time to sleep? These are all great points. How would you know when to try to catch the Mexican news to see if the whole information about PD1 being missing is on the radio, then secondly about his murder and that the body and the gun without the serial number in the river now. Yeah, I think we've gone over this before, but what happens to your daughter again? That is the big question. The big question is how does she react to this. Now if I'm being honest, let me shut this up... you think on some level she's like \"I'm kind of\"",
            "start": 3898.68
        },
        {
            "text": "what happens to your daughter again that is the big question the big question is how does she react to this now if I'm being honest let me shut this up you think on some level she's like I'm kind of flattered if I'm being honest my dad I'm going to need my one okay if I'm being honest in this plan what is really going to come down to you Mr. daughter's dad is how you raised her and how close of a relationship you have with her and this is this is a message out there for every one of our audience members who are parents or might be one day how close to your child are you are you close enough cuz let's be honest here it's it happens but it's rare that Pete and this girl were going to be together forever right they're in high school it happens unless you know something unplanned happened in which case they were like legally bound together for life doesn't happen often and so the question is have you programmed your child well enough and if you have a child now start now to the point that they are",
            "start": 3940.72
        },
        {
            "text": "they were like legally bound together for it doesn't happen often and so the question is have you programmed your child well enough and if you have a child now start now to the point that they are loyal to you to the point that you could I was going to say accidentally but pretty much on purpose shoot Petyr Baelish and get away with it because it's going to be a gut check moment for your family and how you've raised this child does she understand family or does she believe in love with you're going to have to start working on that and now I'm no child psychologist Nick Scarpino you know that no thank God for that I don't understand what to start making them watch to program them that way maybe I'd say psycho but that seems like we're giving the wrong setting that we're giving them the wrong information because you want it they want you want them to pick the parent over the love right they want it to be so whatever movie it is don't throw The Crying Game or Throw Mama From the Train don't show him",
            "start": 3986.4
        },
        {
            "text": "The Boys Get Ready For E3! - Kinda Funny Morning Show 06.09.17\nwrong information because you want it they want you want them to pick the parent over the love right they want it to be so whatever movie it is don't throw Throw Mama From the Pulpit don't show him that Kevin what is a movie you could show a child to program it to believe you even if you're wrong room room show them Room or It's Just Room get 15% off today with free shipping and free returns by going to Movement Watches.com kfms that's mvmt watch / kfms remember as I keep saying Father's Day is coming up this would be a perfect gift to give somebody uh maybe again this would speak to the whole thing again have you been programmed by your father were they prepared to do this Postmates went through we're getting Burgers soon remember Movement Watches have clean design they cut out the middleman they're cheap but in the good way you can get it right now step up your watch game go to Movement Watches.com kfms join the movement what else you going to tell time with a shoe",
            "start": 4036.8
        },
        {
            "text": "cut out the middleman they're cheap but in the good way you can get it right now step up your watch game go to movement watches.com kfms join the movement what else you going to tell time with a shoe all right wide shot again please uh we're giving away Friday the 13th to someone in the chat it is Gundam Unicorn (not Master 23) you have won Friday the 13th PS4 there's the code you won it's in your Twitch messages enjoy it now we do the patented 3 and three then we play some Friday the 13th while eating Burgers Spackler Sparkler 17 says I want to see Nick singing the cover of the E3 PC conference should we do an exclusive with me and CoolG cover I would **** die to see you and CoolG cover the PC games are going to look great I mean here's the deal I we would get so much fck oh sorry forgot it's okay I'm sitting on it sounds silly uh we'd get so much hate from that because I would just do my impression of nerds the entire time well that's how you that's just what your impression of me is now plus 0",
            "start": 4092.16
        },
        {
            "text": "sitting on it sounds silly uh we'd get so much hate from that because I would just do my impression of nerds the entire time well that's how you that's just what your impression of me is now plus 0 one 01 binary now use the control make fun of me the controller do the controller X Y Circle sa symbol sorry we can't all go **** roll around Sean P have platinum trophy already Platinum to this game but this has more platinum on it best have it my wife is hot I don't deserve her hey wait what that's true so I love this picture of your phone by the way that I think you've tweeted out but it's you're like when will she realize that she's really pretty from our wedding yeah yeah she's here today she's here today I think she might already gone did she leave I don't know she she would have said goodbye I guess I thought she had plans at noon but here she is just chilling out tight Matrix says great Nick you two are giving money we expect you to strip for these tips strip take it off boy orgy",
            "start": 4149.24
        },
        {
            "text": "goodbye I guess I thought she had plans at noon but here she is just chilling out tight Matrix says great Nick you two are given money we expect you to strip for these tips strip take it off boy orgy you can't force a boy orgy boy org is coming you least expect them yeah or if you're Joey and no's mom we're the orgy boys that's funny hear I like that a lot she mistook us she was like I like those orgy boys and I was like damn that's that is a good name too for the boy org slightly less uh uh incriminating the or boys right we just show up and have orgies everywhere we're the boys show they have orgies boy or has slightly different boys disas geckos says there's some Big Red soda at the PO box for you boys and there like three weeks too it's aging like a fine wine I feel like it hasn't been that long when did you guys all go to Eric's kids birthday that's when I went last it was like two Saturdays ago two Saturdays ago three Saturdays ago no I was moving that day and I went to the post",
            "start": 4196.12
        },
        {
            "text": "that long when did you guys all go to Eric's kids birthday that's when I went last it was like two Saturdays ago two Saturdays ago three Saturdays ago no I was moving that day and I went to the post office I want to say the last weekend of last month so whenever that was okay bon bon slap it yes do it do it it feels right uh Spidey S says lol love Nick and Greg having the same conversation as two days ago I mean Welcome to our show yeah right it wasn't the same conversation Greg was just wanting you to know he was updating you on I got to brief you on what happened with Petey and his dad and the daughter we add a new layer to it every day yesterday's layer was Tim's horrified being horrified of me doing it yeah the thing is you yeah true today's layer uh the today's layer was all about what you're doing in Mexico with the watch well because apparently Petey or uh who is this person Petey it's not Pet's dad and then it was the dad it the dad has made it to Mexico in the story",
            "start": 4244.04
        },
        {
            "text": "about what you're doing in Mexico with the Watchmen because apparently Petey or uh who is this person Petey, it's not Pete's dad and then it was the dad, it - the dad has made it to Mexico in the story, question him or not well that's next week, that's oh no actually actually not even next week next week's not here uh Fozzie friendzone Hughes says hey Greg I know there's talks about Rocksteady coming back with another Batman game but I've also heard rumors that Rocksteady is actually working on a Superman game how hyped would you be if that's true **** I'd be extremely hyped if that was true, that would be awesome but I I don't yeah I don't know what's going on because all the Superman stuff leaks but that was from WB Montreal or whatever so there's question of are they working on a Justice League game are they working on a Superman game you have to imagine there's some Superman game in the works right I don't know was Justice League coming up and coming well yeah but I mean I I had heard",
            "start": 4299.08
        },
        {
            "text": "game are they working on a Superman game you have to imagine there's some Superman game in the works right I don't know was Justice League coming up up and coming well yeah but I mean I I had heard rumors a long time ago there's a Suicide Squad game of the works and tank and so I don't know rock is the original Arkham Asylum game developer yeah they're yeah they did all the Arkham games except Arkham Origins which was WB Montreal okay got you got you yeah that would be the **** those guys know how to make a game yeah 100% Woo breaking Prime says rip py well you don't know might have been a dick Soul porpus says does Pety Thompson AKA Pety Tommy live in the same town as Tommy Timmy his wife Tammy Tommy Timmy and another son Timmy Timmy I think so I do think in that our Cinematic Universe of what's Happening that's our universe yeah okay cool did you just get Big C burgers are here go down there and look for Anthony please all right that's it for the three let's go into sub",
            "start": 4334.6
        },
        {
            "text": "Universe of what's happening that's our universe yeah okay cool did you just get Big C Burgers are here go down there and look for Anthony please all right that's it for the three let's go into sub only chat right now I've opened it into the sub only portal and now only that can happen Luer 8125 Greg what do you think Sucker Punch is working on I think it's a new IP I don't think it's Infamous I don't know what it'll be um I think it'll be in their wheelhouse probably of an open-world game but I have no idea what the setting will be I have no information on it so that's what I think um Loose Canon EJ says can you imagine an Injustice Style game but with a Marvel roster yeah I can't it's Capcom vs Marvel you already got it stay out of our way let us have Injustice let DC people have something please uh keep here Greg what time is the meet and greet in LA people always **** about there's no meet and greet in LA I think you underestimate how hard E3 is E3 is not a fun time it's it's",
            "start": 4374.64
        },
        {
            "text": "please uh keep here Greg what time is the meet and greet in LA people always complain about there's no meet and greet in LA I think you underestimate how hard E3 is E3 is not a fun time it's it's a fun time but it is literally hey I'm awake I'm working hey I'm asleep and and that's a fun thing of like I'm seeing games I'm seeing my friends I'm making videos I'm doing this blah blah blah sorry there's no time for E3 meet and greets we love you but of course LA's very close to San Francisco you could have come to Kinda Funny Life 3 just saying just put that there sure I understand when you're like hey I live in Tasmania it'd be great if you guys came even those guys came it's true there's a lot of every fan we had from Tasmania came to Kinda Funny Life they all banded together in a group and they just floated over here took them 74 days Barry says will Andy be on your E3 content yes the Candy Andy himself Andy Cortez will be on our E3 content sweetening it up you know what I mean",
            "start": 4418.84
        },
        {
            "text": "they just floated over here took them 74 days Barry Bumpy says will Andy be on your E3 content yes the Candy Andy himself Andy Cortez will be on our E3 content sweetening it up you know what I mean you're all salty you and I are salty dogs we are salty dogs we got to bring a little sweetness into our world and that's where Candy Andy comes Candy Andy will be on the reaction streams with us he has made I've made him appointments for E3 he'll be bopping around the live show with us he'll be doing reactions with you it'll be great Luer 8125 Nick what's your favorite Ryan Gosling film oo Drive ah what about lands right up there but drive I think is amazing okay yeah Scoops 7 Nick can we see the Scoop oh Amy Gill says those Tasmanian devils and then just that yeah she's funny she's funny you guys are funny and then I'm GNA stop with Carito we're going to stop with Carito but I remember we're going to play in Friday the 13th you don't have to go anywhere uh Carito du Cuba what romance in",
            "start": 4456.96
        },
        {
            "text": "guys are funny and then I'm gonna stop with Carito we're going to stop with Carito but I remember we're going to play Friday the 13th you don't have to go anywhere uh Carito du Cuba what romance in the DCU do you dislike the most Wonder Woman Superman lowest Lane Superman and should I read up on Earth One Wonder Woman before going to see the movie Wonder Woman I didn't dislike either of those it was weird to see Superman with Wonder Woman and not have any connection to Lois Lane not have the romantic thing I'm much happier now that my Superman's back married to Lois has a kid I appreciate that more but I enjoyed the Superman Wonder Woman relationship I enjoyed the Superman Wonder Woman comic all by itself I thought it was actually nice to see them be able to connect that way but then it was again more of them being gods than it was Lois and Superman being people um and then Wonder Woman Earth one I didn't like that much I don't think you need to read it to be prepped on this stuff for",
            "start": 4504.92
        },
        {
            "text": "again more of them being gods than it was Lois and Superman being people um and then Wonder Woman Earth one I didn't like that much I don't think you need to read it to be prepped on this stuff for anything for it Kevin apparently can't find him what's going on why am I getting this I don't know I don't know you want me to read some more comments while we're here um or should I just disappear I have a topic can I bring it up yeah what's up so I got a tweet from uh Mario Bros you guys might have heard of him our boy yeah you know him we Bongo him okay um he's saying he's gonna get the smiley face tattoo okay how do we feel about that there's been a few people who have gotten a smiley face tattoo yeah but not our little brother we going to let this little guy do that I that's up to you if you want to tell him no don't tattoo your body that's fine I'm bringing it up to the squad cool the thing about the smiley face tattoo is it's just a cool it would be a cool tattoo I'm this if you want",
            "start": 4544.88
        },
        {
            "text": "you want to tell him no don't tattoo your body that's fine I'm bringing up to the squad cool the thing about the smiley face tattoo is it's just a cool it would be a cool tattoo I'm this if you want to get tattoos you can just go get that it's just a cool tattoo people can look at it and be like oh it's a little smirking Smiley it's very clever okay Nick you might like this a guy you might know to Mark Wiens I don't know if you've heard of him yeah our boy Mark Wiens yeah you know him okay um the Battle Royale he told Mario to get it on his butthole don't get it on your don't get a butthole tattoo no but what's up Kevin did figure out I'm going to pee real quick before I sit back yeah yeah do your thing do your thing uh remember everyone we're going to be streaming Friday the 13th uh right after this so please stick around have fun we'll be in the comments knowing Greg will be in the comments for a few hours so we'll be hanging out here no promises I'll be going to do Graphics",
            "start": 4586.24
        },
        {
            "text": "\"Uh, right after this, so please stick around, have fun. We'll be in the comments knowing Greg will be in the comments for a few hours, so we'll be hanging out here, no promises. I'll be going to do graphics because apparently someone has to do all the show branding, all the cool stuff we're doing coming up right now. I'm working on the party mode graphics and they're dope AF. I can't wait for you guys to see that stuff. And I got to go to uh, after that it's going to be GamesDaily graphic which is still going to be dope but you know I'm an 80s boy and here, party mode logo we got going for ourselves is the bee's knees if you know what I mean. Uh, Sean Dogg says Nick, what about a nipple tattoo? Uh, you get whatever you want, I'm not going to stop you. DJ Kanto says Nick, I'm ranting a Draft House screening in August for Leon: The Professional, you're in if you'd like. Oh that does sound cool, I'd love to see that movie on a big screen. Uh, I don't know if I'll be able to go to E3 when did he say oh.\"",
            "start": 4620.64
        },
        {
            "text": "in August for Leon the Professional you're in if you'd like oh that does sound cool I'd love to see that movie on a big screen uh I don't know if I'll be able to go to aw in wait when did he say oh in August oh maybe maybe let us know I thought you said you were going to do that in Austin at E3 A boy brushed red SI says Nick what can we expect on the Schmo Down from you that's right my episode of the Schmo Down goes live today it's me versus Rachel Cushing uh she was a she's a very very good uh competitor um she also is very good at getting in your head because she comes off really nice but they call her the Crusher or the Crushing something like that uh it's a great episode you guys should definitely check it out I don't know if that's live yet cool Greg up man can you check out and see if my own episode is live find right now thank you I appreciate that it should be on YouTube uh I'm not sure if it's youtube.com/ shodown or not but it should be live if it's not live it's going live soon",
            "start": 4664.72
        },
        {
            "text": "episode is live find right now thank you I appreciate that it should be on YouTube uh I'm not sure if it's youtube.com/ shodown or not but it should be live if it's not live it's going live soon and it's a great episode you guys should definitely check it out I'll tweet that out as well as soon as I get the link now we don't compliment each other enough yeah we only talk about the bad things I want to give you a compliment for something you said yesterday and made happen yeah paper towels in the bathroom yeah the towels we have in there disgusting yeah they're gross so like having the paper towels there perfect yes wasteful but perfect I agree Kevin has uh had some feedback yesterday that perhaps we should get a more industrial paper towel holder sure my feedback was that seems over complicating it so we'll talk to him about that and see Kevin Kevin where do we land yesterday on the paper towel holder very dramatically like no I want that one so I already bought it for you fantastic",
            "start": 4712.56
        },
        {
            "text": "it so we'll talk to him about that and see Kevin where do we land yesterday on the paper towel holder very dramatically like no I want that one so I already bought it for you fantastic cool so we're just going to use that now one I would prefer a more industrial looking one that I could put in the wall I still want to put anything in the wall but what I had a thought on that was we could compromise they have those ones it's true that's making something not taking something away we could if we value this house we could if we wanted to get one of those at sits they're like squares that sit on the actual countertop and that way you can pull the paper towel what's that yeah trust me it was expensive to fix um that's funny though you see what I'm saying uh I'm taking us out of 7 mode to get ready for Friday the 13th food I do eat over there but I will be throwing those towels out cuz they're disgusting they make your hand smell like M I've never used them I need",
            "start": 4751.6
        },
        {
            "text": "us out of 7 mode to get ready for Friday the 13th food I do eat over there but I will be throwing those towels out cuz they're disgusting they make your hand smell like M I've never used them I need I had a burger with pickles and cheese and I had regular french fries you didn't get an egg I did get an egg right I forgot um and then the final one is Nick Mets can I expect you boys at RTX this year yeah you can yeah you can boy oh yeah is that not confirmed we weren't told people we're going that I don't know I don't know what the hell we tell anybody I don't know either playing with the B the B so before we end the Kinda Funny Morning Show and move into Friday the 13th I'm going to jump in and hide tips here show Subs great I'm going to read through the subs if I re-name your sub or resub we love and appreciate you if I read a little message you resubbed with a message thank you acarina surge sh mea AO 52 I lost my shoes 86 please hire Marty SLA no Mr. Gers uh Dr. Fratty ice just had the",
            "start": 4790.36
        },
        {
            "text": "we love and appreciate you if i read a little message you resub with a message thank you acarina surge sh mea AO 52 I lost my shoes 86 please hire Marty SLA no Mr. Gers uh Dr. Fratty ice just had the biggest month of my life became became a doctor moved to Fort Lauderdale to begin training in surgery and most importantly Platinum Horizon can't wait to see what you guys do between E3 or Kinda Funny Live three and four I would ask for a butthole but I see them daily gross Daphne uh buy shop delicious Ace Factor 20 love Kinda Funny really looking forward to the new content you guys rock thank you uh Nickel Dime two-month anniversary Greg voice whoa I real that was like something I do a lot that's Tech not the grey voice that's more the uh thanks big guy thanks C what's going on here big dog I can't they're my fries you're stealing them apparently very good they're very good um Klein drive four months what up T Capone 100 fly shle five months love you guys futuristic Joe stevenh 8D",
            "start": 4835.44
        },
        {
            "text": "dog I can't they're my fries you're stealing them apparently very good they're very good um Kevin Klein drive four months what up Al Capone 100 fly five months love you guys futuristic Joe Steven 8D how's the thug life cool Greg you're the only guy I know have an answer to this how's the thug life uh it's it's hard but you know we keep it going cool ion ly first I just wanted to say that you guys are killing it and looking forward to the new shows getting ready for E3 right now hope to run into you guys and any of the best friends that'll be there cnla you will remember we'll be on GameSpot live stage Wednesday basically we go live at 2:30 we'll be there till the show closes so come check us out if you're at home watch us on twitch.tv/ games Presto 79 subscribed as **** can I get a butthole butthole freak bag 2034 dco1 white crow 05 a rocket complex brand new cam azur Adra HP 64 two in a row I'm on a streak Simon M 386 Zack pagee 411 colby jack 24 Cole eats kids so when do you",
            "start": 4891.2
        },
        {
            "text": "butthole butthole freak bag 2034 DCO1 White Crow 05 A Rocket Complex brand new Cam Azfar Adra HP 64 two in a row I'm on a streak Simon M 386 Zack Page 411 Colby Jack 24 Cole eats kids so when do you think you'll get Logic on the Game Over Greggy show man logic's the G we've been talking for a long time we'll get him soon Allnighter Pro The Sinister Surge John Cao here comes the Twitch baby looking forward to your guys' E3 coverage have fun thank you we'll be killing that E3 come watch it all uh Nepal mom a g or Nepal MGA Nostalgia 35 Caro to Cuba Loose Canon EJ the last three months have been great found out my girlfriend's moving closer to me changed my major to gaming and simulation and discovered you guys been an amazing 3 months here's even more in the future thank you for chilling out and hanging out with us thanks sheing that Twitch Prime to steal money back from Amazon and give a test Yeah Boy kiwi Jim catching the shows live for once thanks for all the hours of entertainment",
            "start": 4941.96
        },
        {
            "text": "and hanging out with us thanks sheing that Twitch Prime to steal money back from Amazon and give a test Yeah Boy kiwi Jim catching the shows live for once thanks for all the hours of entertainment from Perth Australia wow a saggy nut bazooka girlfriend Mr. Crafty Cat CH Mr. Crafty Chap three months he goes three months let's play PSX Bongos bongos boy orgies naturally get oddly sloppy it's been nine months what's the name of our stream baby Jorge Windex Atron late to the show because of meetings do you think the remasters being released on PlayStation 4 is a sign we will get a firm release date of Kingdom Hearts 3 the C3 no uh and if they do it'll be a lot and it won't come on the day don't worry about it young Toof longtime ler four month sub here's the many more thank you uh Co call Big Wood apparently this is three months is that a lot it's not little and it's not a ton but it's good it's average Terry 461 uh Neil to the music would be at 6 months but twitch doesn't let you free",
            "start": 5012.68
        },
        {
            "text": "Wood apparently this is three months, that's a lot, it's not little and it's not a ton but it's good, it's average. Terry 461 uh Neil to the music would be at 6 months but Twitch doesn't let you free sub on mobile what a **** also change my name might change it back it was Game X Freak we remember you Game X Freak Space 7749 I'm sure I'm not sure if this is how I add a message now you know Cella Pram we could have had we could have had 2.33 children by now for his 20 month sub thank you The Surge 90 one true Magikarp C Melaza two months of Amazon's money keep it up in more Minority Reports DJ Kento one **** Year have a great E3 love you all we love you Kobe Connor Gatorade Get Hype moment Mark echo's getting up to get ready cool Greg and the final sub for the today for the week for the last Morning Show as you know it Obi-Wan Jobi thank you for your love, love Goddamn we got to do the whole show I **** up with that last part redo the whole thing thank you for your love and support",
            "start": 5066.68
        },
        {
            "text": "last Morning Show as you know it, Obi-Wan Kenobi thank you for your love, love God damn we got to do the whole show I **** up with that last part redo the whole thing thank you for your love and support we love you we appreciate you we're excited for E3 remember pre and post shows along with watch Live Streams for every conference then Wednesday streaming all afternoon on Gamespot we hosted here on twitch.tv/games and then over on youtube.com/funny games reactions daily game casts Let's Plays all sorts of cool **** from LA we are stoked, stoked D we're excited I'm checking to see if my own episode is live yet I'm not sure I think it so so right now we're going on to end the morning show well black out for a second so Kevin can cut but then we're coming right back to do Friday the 13th so until next time ladies and gentlemen it's been a **** pleasure to serve you",
            "start": 5127.4
        }
    ]
}