{
    "id": 2780,
    "video_id": "b6CnIiZco0Q",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Andrea Rene"
    ],
    "title": "Batman, Superman, or Care Bears: What Should Telltale Do Next? - Kinda Funny Games Daily 06.28.17",
    "description": "Don’t forget to sign up this month! Go to http://wrg.am/funnytank and grab your free tank, garage slot and 3 Days Premium game time while this lasts. The number of new player registration codes is limited.\n\n\nAndrea and Greg talk about the shortcomings of Telltale and what the studio should do next.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1498683855,
    "duration": 3638,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to Kinda Funny Games Daily for Wednesday, June 28th, 2017 I'm one of your hosts Greg Miller alongside the busiest lady in the industry Andrea Rene. Greg can I just start the show by saying I feel vindicated that Days Gone was playable at E3. I'm so furious at Eric Holmes that he did not say \"oh Greg you're a judge why don't you play this\" that's why you didn't get nominated for anything Eric, you're asleep at the wheel, John Garvin, asleep at the wheel all of you next time yeah when you're a judge yeah you start the conversation at the booth and say I'm a judge what do I get to play and they'll be like come to our private air-conditioned room with snacks and play these games no one else gets to play okay maybe you should just you should I'll get the I'll get the robes next time in the gavel and then you can walk around with like a clipboard be like excuse me this is Greg Miller's judge please get out of the way um",
            "start": 0.0
        },
        {
            "text": "the robes next time in the gallery and then you can walk around with like a clipboard be like excuse me this is Greg Miller's jury please get out of the way um no I'll do that for myself and be like um excuse me Andrea Rene is a judge yeah someday I'll be a judge I bet you will be next year well the thing is I've never been an executive editor at an outlet so it's generally the executive editor or the editor-in-chief who's invited from the outlet to be the judge and sometimes those people delegate that responsibility to somebody on their team because they're too busy to go and do it themselves um and I've you know moved teams so many times that I've never gotten to be a judge b to judge is weak though several times fun times right yeah bopping around Singapore, seeing what's happening just love the water it's so great the water that's I didn't mean to digress but I just you're too dig wanted to get that vindication in conversational show you're right I was wrong you should have just",
            "start": 52.0
        },
        {
            "text": "love the water it's so great the water that's I didn't mean to digress but I just you're to dig wanted to get that vindication in conversational show you're right I was wrong you should have just gone and posted it at kindafunny.com your wrong that's where you the people watching right now as we record this live can go tell us what we're onong keep us honest remember if you are watching live on Twitch we will do subs and tips after we go off the air quote unquote when we're done with this show because Kinda Funny Games Daily is your daily Deep dive into the world of video game news we put it up on youtube.com/ kindafunnygames and podcast services around the globe so please subscribe to both of those rate us on all of that thumbs up put the five stars on there even if you're only consuming it live on Twitch as we record it please make sure you rate us we're still in new podcast we got a a lot of ground to make up and do cool things with and these guys at Car Talk are going to get",
            "start": 88.8
        },
        {
            "text": "it's live on Twitch as we record it please make sure you rate us we're still in new podcast we got a lot of ground to make up and do cool things with and these guys at Car Talk are going to get what's coming to them um some housekeeping before we jump into it uh next week we're at RTX uh our panel for Kinda Funny is on Saturday come out and see us we're doing some we're beating the crap out of Mega 64 and ScrewAttack as well I think that's on Friday night but our panel the one you can't miss Saturday of RTX this also means a few different things for next week's programming schedule uh Kinda Funny Games Daily and the Kinda Funny Morning Show will be on Hiatus next week because there is a Fourth of July in the middle of it if you're not from around here you're not in one of these United States Parts where we want to go blow stuff up with fireworks and drink beer we'll be doing that which then screws up the schedule I'll be in Missouri you're going to be in Europe or no",
            "start": 127.56
        },
        {
            "text": "United States Parts where we want to go blow stuff up with fireworks and drink beer we'll be doing that which then screws up the schedule I'll be in Missouri you're going to be in Europe or no you're in Italy I'm in Chicago for the fourth and then on the fifth we fly to Italy Danny O'Reilly is still in Europe I don't even know if he exists anymore right after that when we the week we come back with Kinda Funny Games Daily it's all Danny all the time we're going to beat him like a rented mule for not being around for so long but yeah he'll be here you'll be gone then the week after that we're all back together and then we get a real hey this is what we plan the show to look like exactly but so yeah but what's important about next week while we're off the air not doing the shows the inmates are running the asylum Kevin Andy Joey and Greg will all be here streaming video games at 11:00 a.m. on twitch.tv/kindafunnygames if you want to pop in and see that Game Over Greg",
            "start": 165.52
        },
        {
            "text": "the inmates are running the asylum Kevin Andy Joey and cool Greg will all be here streaming video games at 11:00 a.m. on twitch.tv/kindafunnygames if you want to pop in and see that GameOverGreggy show GamesCast they run just as normal actually we're doing extra GameOverGreggy show episodes that never got released as exclusives so that's going on remember I need you to be part of this show so write into kindafunny.com/kfgd with your questions about the day's news like so many people have Andrea let's begin the show all right with what is and forever will be the Rer Report time for some news and it was like increasing it's like a bomb okay all right jeez uh there are I think I kept it short today yeah two items on the Rer Report a Baker's Dozen starting with number one the Game Critics' Best of E3 Awards are out we talked about the nominations now we have winners yes cuz Jeff runs a tight ship over there he does he yelled at me and said vote I voted here we go uh the 38th",
            "start": 201.16
        },
        {
            "text": "Best of E3 Awards are out; we talked about the nominations, now we have winners. Yes, cuz Jeff runs a tight ship over there; he does. He yelled at me and said \"Vote.\" I voted. Here we go... The 38 Global Media Outlets that vote on the Games Critics Awards are happy to announce the winners for E3 2017: Best of Show - Super Mario Odyssey; Best Original Game - Mario + Rabbids Kingdom Battle; Best Console Game - Super Mario Odyssey; Best VR Game - Lone Echo; Best PC Game - Destiny 2; Best Handheld Game - Metroid: Samus Returns; Best Hardware/Peripheral - Xbox One X; Best Action Game - Wolfenstein II: The New Colossus; Best Action-Adventure Game - Super Mario Odyssey; Best Role Playing Game - Ni no Kuni II: Revenant Kingdom; Best Racing Game - Forza Motorsport 7; Best Fighting Game - Dragon Ball FighterZ; Best Sports Game - FIFA 18; Best Strategy Game - Mario + Rabbids Kingdom Battle; Best Family Game - Hidden Agenda; Best Online Multiplayer - Star Wars Battlefront II; and Best Independent Game - The Artful Escape. What do you think, Andrea? I think...",
            "start": 255.36
        },
        {
            "text": "game Super Mario + Rabbids Kingdom Battle best family game hidden agenda best online multiplayer Star Wars: Battlefront 2 and best independent game The Artful Escape what do you think Andrea I think it's no surprise that Super Mario Odyssey dominates this list it certainly dominated the conversation uh the week of E3 everybody that I spoke to that got hands on with the game absolutely loved their time with it it's time for a new 3D Mario and it has a really nice fresh perspective that we haven't seen I remember when it was first announced last year I was skeptical a lot of us were skeptical we're like what is this weird new Mario and then after seeing you know lengthy gameplay this time around I'm very excited for this game to come out yeah I can't wait either it's for me you know after we I nominated my games or whatever and you get back the ballot I vote if Mario was there I voted for it that's just I think it was it was you know as we talked about at our own Kinda Funny Awards",
            "start": 308.72
        },
        {
            "text": "my games or whatever and you get back the ballot I voted if Mario was there I voted for it that's just I think it was it was you know as we talked about at our own Kinda Funny Awards it was my game of the show that was the one I thought did uh the most impressive demo it was the most fun to play I liked I liked everything about it so to see it on here compared to everything that was playable because remember stuff that wasn't playable like Spider-Man disqualified you had to have up to you had to have five minutes at least of Hands-On time for judges um yeah I thought it was great I was happy to see it I was surprised to see Mario + Rabbids Kingdom Battle win best strategy game cuz there is that XCOM expansion and like this is kind of copying XCOM in like what not in a bad way I mean it's strategy but it is like oh that's interesting and I wonder how much and there's something to be said for the fact that Mario + Rabbids is accessible XCOM this is that hey you've been",
            "start": 356.8
        },
        {
            "text": "I mean it's strategy but it is like oh that's interesting and I wonder how much and there's something to be said for the fact that Mario + Rabbids is accessible XCOM this is that hey you've been intimidated by what you see when you look at an XCOM game or you're not you you feel like that's too intense for you here is a way to try these mechanics and understand them in a way you maybe didn't before sure I don't know if that makes it deserving of that award I didn't get hands-on with the expansion yeah um for XCOM so I can't speak to that gameplay I did play Mario + Rabbids Kingdom Battle and really enjoyed it and had a great time I didn't play enough of it to really see how deep the strategy level goes um I love the graphics and the characters are so Whimsical and I'm a huge rabbits fan so just like the audio design what do you like about rabbits they're just so stupid that's what's great about them they're just you know these cute little like roly poly characters who just",
            "start": 395.2
        },
        {
            "text": "fan so just like the audio design what do you like about Rabbids they're just so stupid that's what's great about them they're just you know these cute little like roly poly characters who just emote with words I mean with sounds it doesn't matter what language you speak you can understand what they're trying to express because of the way that they've been designed and to me that speaks volumes about their creation as characters and how they can cross you know cultures and languages and how they can kind of you know grab on to that inner child and all of us and say it's okay to be wacky and go sure what for you what Rabbids game stands out Rabbids for me pop around the Wii right I remember the original Wii when they started popping up and they were everywhere and there was party games and all this Jazz well the one game that I played the most was um Rabbids TV Party okay and that's I mean like most of the Rabbids games they just a collection of mini games but what was fun about them",
            "start": 441.72
        },
        {
            "text": "all this jazz well the one game that I played the most was um Mario Kart TV party okay and that's I mean like most of the Mario games they just a collection of mini games but what was fun about them is that you know you sit down with a bunch of your friends you all have a controller and you just do these really goofy mini party games and they're just funny there it's it's a nice change of pace to play a game where all you do is kind of giggle and laugh and and let yourself be a little ridiculous sure I mean that was my thing is like coming in like the key art that got leaked for Mario + Rabbids was like man I really do not like the Rabbids still I don't like them but then when I watched the trailer and I watched the demo I was like all right you know what I mean like the gameplay looks cool and it's it is something different for me to play on switch which I'm all about I don't like the whole let's follow the Roomba around and walk around the world map it does look like a Roomba but when",
            "start": 489.72
        },
        {
            "text": "and it's something different for me to play on Switch, which I'm all about. I don't like the whole let's follow the Roomba around and walk around the world map; it does look like a Roomba but when you get into actual combat, an actual gameplay - but I was like, all right this actually seems like it'll be fun and interesting. Yeah, the exploration elements of that game are something that I hope they show more of in the near future because what they showed at E3 didn't really feel like exploration; it felt like okay there's some coins over here and I'm grabbing the coins and then I'm now I'm in another battle arena. Um, and they really tried to emphasize that the game is split between strategy and exploration but I didn't see the exploration so they really have to step that up. Yeah, uh, I find it funny that in this isn't cuz I voted for it for this category but it's Best Family Game is what it was left at and it's Hidden Agenda; I don't know if that's a family game the way on the ballot it was was Best",
            "start": 530.68
        },
        {
            "text": "in this isn't cuz I voted for it for this category but it best family game is what it was left at and it's Hidden Agenda I don't know if that's a family game the way on the ballot it was was Best Family Game Slarty Game okay so like what what like you want to bum around your house and play with you know what I mean so like examples would be like singing games or like you know what I mean Rock Band or this or is it going to be something like Jackbox Party Pack in Hidden Agenda which we talked about on this Kinda Funny Games Daily before totally I missed it and for the most part of the show and then when I went back and watched all the stuff and talked to people who played it was like oh right **** this is awesome a game from Supermassive unfortunately revealed during that PlayStation pre-show that people weren't paying attention to but Sony the idea of an Until Dawn it's one you know it's one of their what are they calling them the Party Play ones PlayStation",
            "start": 567.36
        },
        {
            "text": "PlayStation pre-show that people weren't paying attention to, but Sony had an idea for an Until Dawn-style game, one of their \"party play\" ones, PlayStation PlayLink, thank you very much. Where you're playing with your phone, making choices together, and then moving it around, and everybody gets hidden agenda cards. So you're playing and making choices based on that. It sounds fascinating, and I'm glad other people saw it and loved it as much as I do. The idea from what I heard is number two on the Roper Report. Shawn Layden is saying games can come out whenever they want to, and it doesn't matter. Over at Golem.in, there's this quote: \"Games are a bit of a business, and timing is very important.\" By the end of the year, people simply have more money. But it changed a little with Horizon Zero Dawn, for example, which was released in February and very successful. Batman Arkham",
            "start": 602.92
        },
        {
            "text": "and timing is very important by the end of the year people simply have more money, but it changed a little. Horizon Zero Dawn, for example, was released in February and was very successful. Batman: Arkham Knight came out a few years ago right after E3, and the demand for it almost exploded. We can now publish really high-quality games almost at any time; it is difficult if almost at the same time a stellar game appears as was the case with last year's business. Can big AAA Games come out whenever? Andrea, you're saying forever it was you're coming out maybe in spring or you're coming out in the fall and you're going to compete with everybody in November, and it's going to be a bloodbath; yes, and no, yes. It doesn't matter the quarter that you come out in as much as it used to. We're seeing really giant tent-pole AAA games being released in Q1 and Q2, where traditionally those were reserved for Q3 and Q4, in particular for holiday, but you can't",
            "start": 641.84
        },
        {
            "text": "out in as much as it used to we're seeing really giant tent pole AAA games being released in Q1 and Q2, where traditionally those were reserved for Q3 and Q4, in particular for holiday. But you can't just release them willy-nilly; you kind of have to look and see what else is coming out in that release window because you don't want to stack a game that has a very similar competitor too close to each other. We saw this last fall with Battlefield and Titanfall 2, and Duty all coming out within three weeks of each other, and clearly all three of those games suffered in overall sales because there was too much choice. Most gamers can't afford to buy three games in a month; if you're a big shooter fan, you'd like to space out your $60 purchases absolutely. And so I don't think that they can come out whenever they want; there needs to be some thoughtful decision as to these release dates and some strategy involved but I get what he's saying yeah well I mean they've seen so much",
            "start": 688.16
        },
        {
            "text": "can come out whenever they want there needs to be some thoughtful decision as to the release dates and some strategy involved but I get what he's saying yeah well I mean they've seen so much success you figure when you talk about Sony stuff right where Bloodborne was a late spring one uh God of War is always over in the March area Horizon of course was this super early spring Last of Us was right around E3 a few years ago they you know for the longest time we as an industry were sitting here going like man Sony's so **** they got nothing for the fall they got nothing for the fall and it's just year after year with the PlayStation 4 worked in their advantage of they don't need anything for the fall because everybody's playing on the PlayStation 4 so let the third parties let the third-party publishers duke it out and worry about yeah we're going to cannibalize each other's sales and then you'll get a Horizon later on or you know what they've talked about",
            "start": 734.84
        },
        {
            "text": "let you know these third-party publishers duke it out and worry about yeah we're going to cannibalize each other's sales and then you'll get a Horizon later on or you know what they've talked about with 2018 where he you know Sean had a quote from a couple last week saying that all the games that said 2018 in their trailer are coming out in that first half of the year or you know in the next 12 to I think he said 16 months so it's like they clearly are marching to their own beat here and I think they get to do it because they are PlayStation because yeah who's going to what is competing with Horizon Zero Dawn right like it came out right before Zelda but even when we got Zelda we were all like oh these actually are different games these aren't the same experience I like them for different reasons right I mean Mass Effect was a competitor cuz they're all these big open-world RPGs but clearly they served different audiences but I still haven't played Zelda because I chose to",
            "start": 773.72
        },
        {
            "text": "right I mean Mass Effect was also a competitor cuz they're all these big open world RPGs but clearly they served different audiences but I still haven't played Zelda because I chose to play Horizon and Mass Effect instead and I'm sure there are people who chose to play Zelda instead of playing Horizon sure and you know that's an unfortunate place to be in from a fan perspective from a business perspective it didn't really matter to Sony because they they don't see Nintendo probably as direct of a competitor right now right because like let's look at install let's say everybody who owns a Switch by Zelda there's still way more PlayStation 4 and we saw that in the NPD numbers right that The Legend of Zelda despite its you know wide critical Acclaim everybody's saying you know shouting from the rooftops how amazing the game was it just could not compete with how many boxes the other two guys own um and you know that might change over time clearly Nintendo is on a roll right now",
            "start": 809.68
        },
        {
            "text": "Rooftops, how amazing the game was. It just could not compete with how many boxes the other two guys own. Um, and you know that might change over time clearly Nintendo is on a roll right now they have uh had a huge showing at E3 switches are hard to find they have you know best game of show going into holiday and it'll be interesting to see at this point next year where the competition lies 100% uh you kind of hinted at an apology written in to Kinda Funny.com KFGD just like you can and says Kinda Funny Goddamn so Shawn Layden says high-quality games can be released any time of the year given how your years have gone when is a good time for you personally to invest in a new AAA single-player IP? How about a new multiplayer game? Are there ideal times? Are there bad times? Certainly, ideal times. I think summer is a great time to invest in a new big AIP because there's not a lot of stuff that comes out in the summer because historically summer is family vacations it's travel",
            "start": 852.44
        },
        {
            "text": "ideal times I think summer is a great time to invest in a new big IP because there's not a lot of stuff that comes out in the summer because historically summer is family vacations, it's travel, people aren't in school, the weather's nicer so for certain parts of the country and the world you're outside more, you're not inside playing your game but that being said games are more portable now than ever especially on consoles like the Switch so why not release a big game in June you know like you know Batman was released and give people the summer to play through that well that's I mean where I think the for us personally it's different right the holidays I feel are always not the best time if it always sounds great we're leading into it and as a kid it was Christmas break it was this I'm going to sit you know in the basement and play now that I have two weeks off school but as we've gotten older I feel like it becomes well now you know if you release something in leading up to Black",
            "start": 901.48
        },
        {
            "text": "going to sit you know in the basement and play now that i have two weeks off school but as we've gotten older I feel like it becomes well now you know if you release something in leading up to Black Friday I have to go back to Thanksgiving so am I taking the PlayStation with me and then I'm back but I'm only back for 2 weeks before I go somewhere else for Christmas now to do this and I'm trying to balance family time with all these different things I think Horizon Zero Dawn was a great example of hey we're out of the holidays hey you've settled back into your New Year routine here it is you know February like is Right Where You know where Persona 5 was supposed to drop that again you have this time period of like not much is happening you're settling into your new routine you get to do all these different things and then again from for us I always thought it was interesting like you're saying to put a game out in summer and put it out after E3 if you can get it right leading into E3 everybody's",
            "start": 947.84
        },
        {
            "text": "things and then again from for us I always thought it was interesting like you're saying to put a game out in summer and put it out after E3 if you can get it right leading into E3 everybody's hair is on fire nobody can worry and play anything and focus on anything after E3 granted there's more shows but that's when it becomes hit or miss on who's going to what and I think to get there and have that opportunity like you're saying with where Batman fell or I thought Metal Gear Solid V had a great release date at September 1st like that was a really good one of like okay cool it's not crazy holiday season yet and it's not you know the rush of conventions are over actually get in here now invest all these hours into and do something yeah absolutely I think September is a great time as well I think January is becoming a month where publishers are looking at as a potential release window as well we've only seen a few games released in January like what a great move that",
            "start": 982.36
        },
        {
            "text": "I think January is becoming a month where publishers are looking at as a potential release window, as well. We've only seen a few games released in January, like what a great move that was, a master stroke by them because they put it out there and it was like, \"All right, cool. Everybody has these brand new next-gen consoles or whatever they got from Christmas, and here's this zombie game.\" I think in a normal period would be regarded as, \"Oh, this is fun; this is really good.\" But I think when there's not that much else there, you're going to get to run and play with it. And I think that also is what we're talking about with Horizon, where it was the fact of like, \"Oh man, Sony's got their work coming cut out for them; they're going up against Zelda in a Mass Effect game.\" And Mass Effect came out and disappointed, and it was that thing of like, \"Oh my God, wait a second. Like, that's great,\" and then it was the fact that",
            "start": 1021.16
        },
        {
            "text": "going up against Zelda in a Mass Effect game and Mass Effect came out and disappointed and it so it was that thing of like oh my God wait a second like that's great and then it was the fact that well I can't I can't **** find a switch so where and I'm not going to play Zelda on Wii U please please I do want to say though it doesn't seem to matter if people are busy if the game is really excellent and I'm going to use Overwatch as an example that released in May which has been you know a pretty popular month for some big games Rockstar releases games in May some other people have and may for industry people is an incredibly busy month as we you know lead into E3 so we don't really have a lot of time but um for people who don't work in the industry that's a great time because you're kind of got senioritis you're like wrapping up school you're almost done um you're going into summer and it clearly didn't matter how busy people were if the game's good enough you'll",
            "start": 1061.72
        },
        {
            "text": "because you're kinda got senioritis, you're like wrapping up school, you're almost done, um, you're going into summer and it clearly didn't matter how busy people were if the game's good enough, you'll make time. It's and that's a great point if the game's great, people are going to play it, and it's not, it'll be a standout, and you don't have to worry about it. But there is that thing of like it's such an interesting and delicate chess game of figuring out if you I've never been on the other side obviously of plotting A Game's release date or anything to that extent but when can you put out a game that you're not going to get, you probably won't get squashed by the competition, and you're giving the influencers or IGN or whatever enough time where they can actually play it and talk about it so that they're increasing you know amplifying your message and stuff because it's always the thing you see with E3 where it's like now people are always like oh man why are so many people doing things",
            "start": 1100.84
        },
        {
            "text": "that they're increasing your message and stuff because it's always the thing you see with E3 where it's like now people are always like oh man why are so many people doing things outside of e3 and it's like well they're terrified of e3 and when there's a new Mario game and that's all anyone talks about yeah yeah you need to get out in front of all those messages and make it work Andrea, you want to know what's coming out today I sure do then let's go to the official list of upcoming software across each and every platform is listed by the Kinda Funny Games Daily show hosts each and every day that's for you Kev uh out today on PlayStation 4 if I'm lying I'm dying JumpJet Rex finally Mike, Mike from Filthy Casuals' game that was supposed to be on the Vita as well I don't know where that is Mike but it's on PlayStation 4 a little platform with a dinosaur so why not give it a shot uh also Crazy Strike Bowling EX on Xbox One and then you were telling me there's a",
            "start": 1137.04
        },
        {
            "text": "don't know where that is Mike but it's on PlayStation 4 a little platform with a dinosaur so why not give it a shot uh also Crazy Strike Bowling EX on Xbox One and then you were telling me there's a future Ono mobile game yeah so I I bring this up and I know there's thousands of mobile games that come out every week but um Future Rama: Worlds of Tomorrow I've gotten a lot of press releases about this game so I wanted if people were interested to know that it is out on Android today and I believe it's coming to iOS later this week let me double check you do it don't worry hey everybody it's Greg Kinda Funny Games Daily be part of the show kindof funny.com kfgd Kevin back to the wad and now I can't find the press release so don't worry anybody we get something wrong hit us up at kind funny.com your wrong Kinda Funny Games Daily we're there for for you thanks no problem I got you appreciate I can feel that all day long you just can you should I make you just keep going sure just keep",
            "start": 1177.88
        },
        {
            "text": "your wrong kinda funny games daily we're there for you thanks no problem I got you appreciate I can feel that all day long you just can you should I make you just keep going sure just keep we're not going to be here next week don't forget but the inmates are running the asylum want to see what Andy Cortes and Gregor are going to play on Playstation 2 on twitch.tv/kindafunnygames come back at 11:00 a.m. all next week it's crazy they're doing crazy stuff back to you perfect I still I still **** it it's coming iOS one day you'll find it uh new dates to talk about pinball fx3 has been announced it's coming this summer finally this Zen Pinball that became pinball effects that became all these different things is finally getting a true sequel which means they can have more trophies because of course they stopped being able to use trophies Andrew it was it was horrible it was terrible all your oldest all your old pinball tables will carry over to this one along with the new stuff",
            "start": 1225.6
        },
        {
            "text": "of course they stopped being able to use trophies Andrew it was it was horrible it was terrible all your oldest all your old pinball tables will carry over to this one along with the new stuff and they're focusing more on multiplayer and stuff like that so congratulations to them Kirby's Blowout Blast is coming to 3DS July 6th enjoy that Orcs Must Die Unchained is coming to PlayStation 4 July 18th now I want to tell you about your deals Andrea I love me some deals Believe It or Not whole bunch of them today whole bunch of things you were here yesterday I had a discussion with the one and only pure one Tim Gettys yes about where do we put Xbox games with gold slash you know the PlayStation plus games and we agreed on deals we think that's because it's not its own news story for the most part you know what I mean no but deal sounds good and that's so yesterday Games with Gold got published today PlayStation Plus July games and goodies are up uh if you are subscribing to",
            "start": 1266.84
        },
        {
            "text": "for the most part you know what I mean no but deal sounds good and that's so yesterday Games with Gold got published today PlayStation Plus July games and goodies are up uh if you're subscribing to PlayStation plus come July you'll be getting Until Dawn on the PlayStation 4 Game of Thrones on the PlayStation 4 Tokyo Jungle on the PS3 Darkstalkers Resurrection on PS3 Elemental on PS Vita don't die Mr. Robot on PS Vita which is also Cross-Play with the PlayStation 4 now here's where it gets interesting from the PlayStation blog additionally from July 4th through October 24th all PlayStation Plus members can get That's You in celebration of PlayLink's launch that was I don't, don't that's a big announcement that's a brand new game What is That's You? that's you is um their Jackbox game they're actually if you want to hang out and be part of that you they're coming through to do a let's play with us right after this episode I would love to but my what's good games girls are on the way in",
            "start": 1307.4
        },
        {
            "text": "actually if you want to hang out and be part of that they're coming through to do a let's play with us right after this episode I would love to but my what's good games girls are on the way into town they're all landing going on uh it's Jackbox Party Pack, it's another one of those Jackbox games, it's Play Links you're playing with your phone it is like answering questions about each other drawing faces doing all that stuff but playing through the screen and doing that I love how when you Google it this the first thing that comes up in the video show uh worth pointing out why uh you know I'm excited cuz the trailer looked great it turns out Mike Dini wrote for the game so I'm excited to see some work there too he's a lovely person and then if you ever remember Dax from Rocksteady, the Batman games, he left there and he's working at the studio now too he was the first guy to hit me up and be like hey we're making so much crazy energy he does he is a crazy human being who was like I'm so excited",
            "start": 1353.6
        },
        {
            "text": "left there and he's working at the studio now too he was the first guy to hit me up and be like hey we're making so much crazy energy he does he is a crazy human being who was like I'm so excited he for for a while he was like I want he's like you want to do let's play I'm like yeah he's like I'll fly I'm like you're not going to fly here from the UK to do that's and he's like I will and I'm like we can set it up without you and we did it so he's he's very nervous not to be here but we're excited to do that that'll be our uh party mode for next week so get ready for that uh and then also for PlayStation Plus users Orcs Must Die! Unchained is launching closed beta on July 18th as a PlayStation plus member not only will you get access to the beta but you'll get an exclusive Orcs Must Die! Unchained plus pack as part of your membership the $20 pack is only available until August 15th so get it while you can says the Playstation blog um I'm going to go back to conofunny.com kfgd so",
            "start": 1391.8
        },
        {
            "text": "Unchained Titan Pack as part of your membership, the $20 pack is only available until August 15th so get it while you can says the PlayStation blog. Um, I'm going to go back to conofunny.com kfgd so you can be part of the show SK yeet yeet SK. So this is different than the SK SK ye from before or is this the same person? I imagine it's the same person but if you feel like I read it the other way maybe there is maybe SK's just changing the yeets every time he writes in, you know what I mean because there's no username he can just submit whatever name he wants. WR is maybe he's being clever this time SK ski writes in and says should there be some sort of alternative reward system for when a play a free PlayStation Plus game that subscribers already own is one of the free games it is now the fourth month in a row where I've already owned at least one of the free PlayStation 4 games and since I am paying for the two free PlayStation 4 games every month shouldn't I get something else if I",
            "start": 1430.28
        },
        {
            "text": "fourth month in a row where I've already owned at least one of the free PlayStation 4 games, and since I am paying for the two free PlayStation 4 games every month, shouldn't I get something else if I already own them? I hate to say this, but no. Yeah, I mean, the reality is that they choose games based on a variety of factors, and what's in your library isn't one of them. Yeah, it's like... it sucks, but it's like, this is the dice roll you're going for. And I think if you were to talk to PlayStation, they would be like, \"Well, your PlayStation Plus Membership is so much more than just the games you're getting.\" It's the ability to play online; it's the weekly discounts on things... it's not as in uh what they used to call it the Instant Game library or instant game collection. It's not focused on that anymore like it was when it launched with PlayStation 3. It's just rngesus being bad to you, exactly. Yeah, but and that's the thing of like oh yeah don't me wrong until",
            "start": 1470.48
        },
        {
            "text": "it's not focused on that anymore like it was when it launched with PlayStation 3 it's just rngesus being bad to you exactly yeah but and that's the thing of like oh yeah don't me wrong until Dawn's a fantastic game I would hope most of you own it by now to support people who are making really cool games and send a message only you want more games like that from supermassive and now they have like three in the works so I guess the message got through loud and clear but uh it's that thing of like I feel like by the time it gets here this is that thing of like well you don't come on you know what I mean like this is there to get the people who were never going to buy this one Game of Thrones I thought was an underwhelming Telltale series I don't know if you played it I played all the way through episode 4 and I was so frustrated by the mechanical problems in the game that I just couldn't bring myself to do episode 5 which is like I keep telling myself what I should go back and",
            "start": 1518.08
        },
        {
            "text": "Way through episode 4, and I was so frustrated by the mechanical problems in the game that I just couldn't bring myself to do episode 5. Which is like, I keep telling myself, \"What should I go back and find out?\" You've got a platinum waiting, um... but I just can't. If you really love Game of Thrones, the narrative and the writing in that game are really excellent. And they're one of the few recent Telltale games where the choices really are difficult choices - like life and death choices. Because if you're a Game of Thrones fan and you watch the show like crazy, stuff happens in that show all the time, and that's reflected in The Telltale Series. So I was really disappointed that I had some um, like hitching and glitching bugs, that kind of thing, and that classic Telltale gameplay... well, and the art style is just something I couldn't get into. I really loved how they brought in some of the original cast members to do voice work - I thought that was excellent, but I",
            "start": 1554.52
        },
        {
            "text": "Telltale's gameplay is well, and the art style is just something I couldn't get into. I really loved how they brought in some of the original cast members to do voice work. I thought that was excellent. But I would look at some of the artwork in the art design in that game and go, \"This is this is what you're going to do for Game of Thrones?\" And it's hard for me to criticize them because I've never made art for a video game, and I want to make that clear. But comparing it to other games in the space that are similar in style to that game, I can only say like, \"Hey, look at what these people over here are doing.\" How is it that you're working on this massive license Game of Thrones, and this is what you're going to put out for it? Yeah, you know. I was disappointed. No, I'm with you. Like, and that was the thing where it's like I'm not the biggest Game of Thrones fan, so I played through episode one, like all right cool, not for me, and didn't worry too much about it. But I'm having the same thing with Guardians.",
            "start": 1603.44
        },
        {
            "text": "where it's like I'm not the biggest Game of Thrones fan so I played through episode one like all right cool not for me and didn't worry too much about it but I'm having the same thing with Guardians of the Galaxy where Guardians of the Galaxy is here now it's like awesome and you jump in and they are totally it's not set in the same any of the universes or any of that crap but it's like they're clearly aping the the movie and James Gunn and like there's the awesome mixtape and music's a big part of it and it's like that's awesome I love that but the fact that they're like 75% in on that makes the it's like I can't if you don't if you're not going to go that extra 25% I just can't get into this game and they've set a process now where they're getting the original or matching voice talent for other franchises I mean if you look at Tales from the Borderlands having you know people like Michael Rooker come in and voice a character so well Handsome Jack himself right Troy Baker right exactly",
            "start": 1644.32
        },
        {
            "text": "other franchises I mean if you look at Tales from the Borderlands having you know people like Mike Young come in and voice a character so well Handsome Jack himself right Damian Clark right exactly and so it's like if you can't get the voice talent for Guardians which I get why you can't with all big movie stars but if you're you can't right go in another Direction give me a brand new telling of Guardians that doesn't I mean like this is not supposed to be in the movie universe but it's in the movie you you know what I mean like so like I know those characters so well and I love them so much that as much as I love Scott Porter like Scott Porter being Star-Lord it it's not even his delivery isn't working for me it's like the character's facial model isn't working for me and it is the thing like you're talking about where it is like it's a Telltale Game so like you see the strings and you see the edges and like it's like this isn't immersive in a way that's working for me where as",
            "start": 1683.0
        },
        {
            "text": "\"Thing like you're talking about where it's like, it's a Telltale game, so you see the strings and you see the edges, and it's like this isn't immersive in a way that's working for me. Where as opposed to I feel like did you play Batman? Uh, I watched John play Batman - Batman I thought was excellent because you know, and this is the thing I I remember talking to people as we were playing through it of like you start episode one, you're like oh it's Batman cool, and then episode one ends in a place where it's like what the... and like sure enough you start episode two and they didn't take it back, they're all in on like no this is our Batman, this is our universe, this is how this is going to play out, and it's not going to be a Batman story you've had before. Well that's why I really loved The Wolf Among Us - I thought it was it took this you know comic book world that a lot of people know but it gave a nice little twist on it and it was characters that I wasn't familiar with so I didn't have a\"",
            "start": 1720.24
        },
        {
            "text": "Among Us, I thought it was it took this you know comic book world that a lot of people know but it gave a nice little twist on it and it was characters that I wasn't familiar with so I didn't have a preconceived notion going in as to what it was going to be and I thought they did a really excellent job telling the story and because of the style of the comics and how they related that in the game I was able to overlook some of the sure bugs and glitches that were in that game um because it felt like it fit canonically, like was a better canonical fit than Game of Thrones 100% yeah and that's the thing where it's I think when Telltale Nails it so many times and when they're crushing it you forgive all these little things right like Batman was so good and so like when I and I and honestly for the most part playing through Batman with the exception of the finale like Batman was so good and for me relatively bug free and crash free and all stuff like I know that's you know the joke with",
            "start": 1754.72
        },
        {
            "text": "for the most part playing through Batman with the exception of the finale like Batman was so good and for me relatively bug free and crash free and all stuff like I know that's you know the joke with Telltale but like episode 5 leading into like that was the one right where I had the eyeballs running around no body attached and where it like hard locked three times in the finale fight but it's like I got to finish this I got to know how this ends so you keep coming back and going through it and it's the same thing with like origin Walking Dead Season 1 where it would be like those hard cuts and those hard jumps between scenes but it's like this is so **** good I'm willing to forgive that for this moment keep going and that was always my argument when we talked about Game of the Year that year where it's like my heart wants to vote for Walking Dead but I can't say that is Game of the Year based on how it runs and performs like that's not what I I don't want to look back and see all",
            "start": 1801.2
        },
        {
            "text": "year where it's like my heart wants to vote for The Walking Dead but I can't say that is Game of the Year based on how it runs and performs, like that's not what I want to look back and see all these videos of this game **** up and like that because there's so much more to game of the year than something else. While we're on this Telltale tangent, I want to jump over to Jackson GS who wrote in to kind funny.com kfgd, just like you can, it says \"what license would you like to see Telltale do next?\" I want them to do Archie; that's not out of the realm of possibility with the Riverdale show and Archie being all over the place, and they do interesting things with Archie - him fighting Predator and aliens and all this crap, and him being dead. Uh, for me, what I've said from the get-go, and I yell at them when I host panels with them usually is the fact that I think they could do Superman, and I think they could do Superman; it would be if they did a Telltale Game and it was a Superman game, they would",
            "start": 1835.24
        },
        {
            "text": "when I host panels with them usually is the fact that I think they could do Superman and I think they could do Superman it would be if they did a Telltale Game and it was a Superman game they would have I think no problem making the best Superman game of all time because the problem people have with Superman right is like oh I'm Superman but I can't fly into I can't fly to space and oh it's boring to get hit and not I mean like telltale's all about choices so like you have the choice of like am I going to play this as Clark or am I going to play this Superman how do I run off fail States wouldn't have to be dying fail States would be you running and someone seeing you turn into Superman you know what I mean like there's a bunch of fun ways to play with that and then have the action and be how it is in Batman of you know moving the stick doing this thing you know quick time events for the most part but using that who do you save why do you save them have it not be a dark Superman game",
            "start": 1871.64
        },
        {
            "text": "how it is in Batman, where you know moving the stick doing this thing, you know quick time events for the most part, but using that, who do you save, why do you save them, have it not be a dark Superman game but a Superman game that does have consequences to **** it up, yeah cool, is there any franchise you'd want you just hate Superman is that what you're driving I don't hate Superman I'm just not particularly jazzed by Superman he's he's fine he's right he's a cool guy he's I don't it's tough this is a really broad question me because my inner child is like oh wouldn't it be great if they made like a Care Bears Telltale Game whoa okay but then I think well where's the conflict in that obviously there is conflict within that as a as a series but not in a really dramatic or emotional kind of way that you would have difficulty choosing between CH you use um and I just love Care Bears but I don't I don't know I would love to see a Game of Thrones season 2 done the right way um because I think that",
            "start": 1906.28
        },
        {
            "text": "You would have difficulty choosing between CH you use um and I just love Care Bears but I don't I don't know I would love to see a Game of Thrones season 2 done the right way um because I think that world is set up to kind of give Telltale The Narrative meat they need to create another original story and to give them that awesome conflict narrative that really drives the adventure-based part of that game or of what Telltale does ESS I hope they come back for Batman season 2 cuz like their teas for the end was so good of like yeah I would love to play that and they made so many interesting story threads yeah uh while we're here in the deals we're also tossing in the Xbox Game Pass Edition uh editions yeah that's right uh today Xbox is added Dead Island: Definitive Edition, Resident Evil 6, F1 2015, The Flame in the Flood, Guacamelee Super Turbo Championship Edition which we love. BS gold and what's yours is mine games pass pretty cool one of the best things Xbox has",
            "start": 1951.64
        },
        {
            "text": "Resident Evil 6 F1 2015 The Flame in the Flood Guacamelee Super Turbo Championship Edition which we love BS gold and mon what's yours is mine Games Pass pretty cool one of the best things Xbox is doing I think in terms of like hey yeah download these games enjoy them play them like all right cool I think it'll be interesting to see what kind of numbers they have and if they're going to release you know the numbers of people who have subscribed and what their user ratings are and if they hit impressive numbers they will for sure yeah I think this is also kinda flying under the radar I think people are forgetting that this program exists well this is the whole thing going back to I forget if it was one of the games daily you were on if it was Tim but in terms of like Xbox is making all the Pro Gamer decisions try you know you know Pro consumer I guess decisions to make it not like MLG only fatality can use these the pro consumer decisions in a way of like trying to win back",
            "start": 1999.92
        },
        {
            "text": "all the Pro Gamer decisions try you know you know Pro consumer I guess decisions to make it not like MLG only fatality can use these the pro consumer decisions in a way of like trying to win back Goodwill and make people care but it is that fact of I think so many people see that like oh that's cool I'm going to keep playing my PlayStation 4 but I think if you are invested in the Xbox community and you only have I think right now you get a 14-day trial for free with it if you're there and you want to jump in and do that or and I think what is it 10 bucks a month after that like $9.99 that's a great deal like that's an awesome deal to jump in and play all these games you missed and screw around with them that's really cool do you think that this is what PlayStation Now was originally intended to be and they kind of just whiffed or do you think that PlayStation Now is a different model altogether obviously they're different obviously but I think that maybe PlayStation now could have been",
            "start": 2039.32
        },
        {
            "text": "to be and they kind of just whiffed or do you think that PlayStation Now is a different model altogether obviously they're different obviously but I think that maybe PlayStation now could have been more successful if they went this route I agree with you yeah and I that's what I'd honestly like to see PlayStation do cuz like when they bought Gaikai we were all like oh man like they're actually going to nail it they're going to do it streaming those games there's still that little bit of latency and there is all the stuff and like it's like oh that sucks I'd rather see them come out and be like not hat in hand but PlayStation Now didn't work the way we thought it would we couldn't get the pricing model down so what we're going to do is take that streaming technology and use it to yeah download your system and use it like a PlayStation Plus thing cuz like if they can lock me out of you know when I when I'm not on my master console and I",
            "start": 2077.32
        },
        {
            "text": "it to yeah download your system and use it like a PlayStation Plus thing cuz like if they can lock me out of you know when I when I'm not on my master console and I'm using a different console and I turn it on and I'm not connecting the internet and I can't play my PSN downloads they can do that for this kind of thing and this if they were to do something like this on PlayStation 4 I think you'd see way more buzz about it way more people would be interested just cuz I think more people are using their PlayStation 4s based on the number of installs that would be super into this and would be like yeah I haven't played and I've heard a lot of great things about Guacamelee and The Flood and all these different things I also think that if you did that for PlayStation and gave PlayStation Plus users a discount on it you'd have another reason of like oh well this is why I'm doing it over Games Pass this is why I'm doing it and not being offended like the last listener was who was",
            "start": 2113.12
        },
        {
            "text": "Plus users get a discount on it, you'd have another reason to do it over Game Pass this is why I'm doing it and not being offended like the last listener was who was like \"I already own most of these games that are coming\" was okay cool. Your PlayStation Plus subscription gives you free games for as long as you're here but then also gives you a discount on a game's pass to jump in and play something else you want there's a bunch of cool things they could do with it will they ever no they're in front until until they get passed by Xbox they're not going to do anything that's true but they are having a PlayStation midyear sale right now tons of games are on sale over there like literally a whole bunch of them this is a great list yeah this is like the smallest fraction of them just went through and pulled out stuff I knew we all liked over on PlayStation 4 and PlayStation VR you can get Fallout 4 for $22.49, $20 with the you know PlayStation Plus Far Cry 4",
            "start": 2147.24
        },
        {
            "text": "Of them just went through and pulled out stuff I knew we all liked on PlayStation 4 and PlayStation VR. You can get Fallout 4 for $22.49 ($20 with PlayStation Plus). Far Cry 4 (Far Cry 4 Gold Edition) is 30 bucks or 23 bucks. Mad Max is in Game of the Millennium if you remember, it's $9.99 or $79.99. Middle Earth: Shadow of Mordor, Ratchet & Clank, Risk of Rain, Sound Shapes, The Last of Us: Left Behind (Standalone), and The Unfinished Swan are all up there right now with insane discounts. I mean, Left Behind was five bucks or four bucks. Come on over to PlayStation VR; you can get Freedom Wars if you're a PS+ subscriber for three bucks. Now, granted, you got Freedom Wars for free if you downloaded it back in the day, but if you didn't, here you go – jump on it. You missed out on God of War collection, Gravity Rush, Little Big Planet, PlayStation All-Stars Battle Royale, Sever's Terway (I assume this is a typo and it should be \"Sly Cooper: Thieves in Time\"), Uncharted: Golden Abyss for six bucks. If you're that interested, that is a great price. Yeah, and then I missed this one – Mikey van called it out when he wrote in to Kinda Funny.",
            "start": 2184.8
        },
        {
            "text": "all-star Battle Royale server Terawatt Uncharted: Golden Abyss for six bucks if you're that is a great price yeah and then I missed this one Mike Van called it out when he wrote in to kindafunny.com says Overcooked is currently 50% off for Xbox Live Gold members if you want to yell at your friends play overcooked it's true that's how overcooked I love overcooked yeah it's I I played it for the first time when we streamed it a couple weeks ago no way really yeah I just it just was one of those games that kind of slipped through the cracks and I missed out on it and I heard a bunch of people playing it and then when we finally played it I was like this game is really fun yeah and I worked in restaurants for a really long time so it was kind of like dude love over I hope they make a sequel I hope they put way more put out DLC with trophies more trophies come on come on you know what I mean Kev now Kev I see you leaned back over there which makes me think I",
            "start": 2231.72
        },
        {
            "text": "I hope they make a sequel, I hope they put out more DLC with trophies, more trophies, come on, come on, you know what I mean. Now Kev, now Kev, I see you leaned back over there, which makes me think I screwed up or Tim screwed up. We have to do that ad here. Can we prep the World of Tanks ad? You're prepping it; let me know when you're ready. Hey everybody, it's Greg Miller, kindofunny.com, KFGD, be part of the show. We're going to jump into reader mail, but before then I want to tell you this episode's brought to you by World of Tanks. But I don't want to do it till the head up. You ready, Kev? This episode's brought to you by World of Tanks. World of Tanks is an epic team-based massively multiplayer online action console game dedicated to tank combat. It's on PS4, PS4 Pro, Xbox 360, Xbox One, Xbox One S, and coming soon to the new system, the Xbox One X. Command history's most powerful tanks and experience tactical combat like never before in World of Tanks console. You can battle up to 30 other",
            "start": 2276.6
        },
        {
            "text": "One S and coming soon to the new system, the Xbox One X, Command: Lords of War's most powerful tanks and experience tactical combat like never before in World of Tanks console. You can battle up to 30 other players in over 450 historically accurate World War II armored vehicles from the 1930s through the 1950s. World of Tanks console is a triaA game that's free to play. World of Tanks console was built from the ground up for consoles, taking full advantage of both PlayStation and Xbox's unique capabilities. Uh, for Kinda Funny Games Daily listeners, I know that's not this show but stick with me. World of Tanks console has a special offer for new players who sign up this month, go to WG.am/funnytank and grab your free tank, garage slot, and 3 days of Premium game time; all this lasts while the number of registration codes is limited. That's World of Tanks literally on every console ever also on PC but we're not talking about that cuz you know, PC BL no trophies there but you get a garage slot here did you",
            "start": 2318.84
        },
        {
            "text": "Codes is limited, that's World of Tanks literally on every console ever also on PC but we're not talking about that cuz you know PC BL no trophies there but you get a garage slot here. Did you ever play World of Tanks? I've played a little bit of it, yes, yeah me too. I've done demos before. Is I was always like oh this is cool, not my thing but like the fact that it's got this engaged awesome Community is what I was talking about with Tim today. It's like it reminds me of what we're talking about on the show all the time of Paragon and DOTA and all these different things that like if you don't know about it you don't know about it and then you walk in and like suddenly there's all these people who love it. I have millions of people play World of Tanks, World tanks world of everything. Let's check in with the readers let's of course be part of the show kindof funny.com kfgd and let's start with Eric. Eric wants to give a nice little story here he says Hey guys catching up on yesterday's show",
            "start": 2368.72
        },
        {
            "text": "with the readers let's of course be part of the show KindaFunny.com KFGD and let's start with Eric Eric wants to give a nice little story here he says Hey guys catching up on yesterday's show and heard you talking about Ubisoft and being fan friendly and wanted to share this I am a big Assassin's Creed fan and bought every game in the series around Christmas 2014 Ubisoft sent me an email thanking me for being a huge AC fan and offering me a free code to Far Cry 4 saying I might like that a lot too I know they gave that out to fans free after the disaster that was Unity's launch but I still really appreciated the gesture wanted to share loving the new show but I still missed the bonus episodes well you've got to watch the shows live now on Patreon I think that's better and we have plans for the bonus stuff don't worry about that but yeah yesterday we were talking about Vendetta yes coming for Ubisoft's lunch and how we like Ubisoft like think they do a great job",
            "start": 2406.72
        },
        {
            "text": "and we have plans for the bonus stuff don't worry about that but yeah yesterday we were talking about Vendi, yes coming for Ubisoft's lunch and how we like Ubisoft, like think they do a great job they do a great job of walking we're a business but we make art and we want to take care of people that's a great space to be in not a lot of companies do that a lot of companies don't have the luxury of doing that you know they have a lot of very successful franchises that allow them to take artistic Liberty when they want to True icy Flames 96 says do you think the success Buzz of the switch makes it more likely that Sony will make another handheld in the future no no I don't either I think that uh Vita got sent out to die sadly cuz it was the taay of 2 PlayStations it was PS3 and PlayStation 4 and it was in the middle there and it wasn't what it needed to be I think I've always said it if they would have treated the Vita like they treated the PlayStation 4 different ball game I think people",
            "start": 2449.68
        },
        {
            "text": "it was in the middle there and it wasn't what it needed to be I think I've always said it if they would have treated the Vita like they treated the PlayStation 4 different ball game I think people I think Vita would have been a lot more successful people would be way more into Vita but I feel the fact that what Sony and Microsoft for that matter when they look at Nintendo they see something they can't be I don't think either Xbox or PlayStation 4 considering our next console needs to be a hybrid it needs to be able to do both I think that they want to continue to push Graphics they want to continue to push immersion they want to VR storytelling all this stuff and for them that means horsepower and I think as you march down that path you see Nintendo in a space that they just don't feel they need to go into and until you know somebody there was an interesting Gaff thread uh yesterday that I almost brought in as a show topic but it was talking about do you think the success of the",
            "start": 2494.6
        },
        {
            "text": "they need to go into and until you know somebody there was an interesting thread on Twitter, uh, yesterday that I almost brought up as a show topic but it was talking about do you think the success of the Switch is making it a primary console for some people when people didn't see that coming no yeah I don't either I think that for me it still is I love my Switch and I was you know when we were running up to the launch I was like if Mass Effect was going to be on Switch and it was AC cross-platform day and date on everything I would have bought on the Switch just to have it on the go so I could play it anywhere and that would have been a big change for me and the fact that that's not an option and that never will be an option I think that's why Sony and Microsoft aren't really scared of what Nintendo's doing they see them as a supplemental thing in an exclusive machine there's too many third-party publishers and developers who will not be bringing their games to Switch for it to",
            "start": 2532.84
        },
        {
            "text": "of what Nintendo's doing they see them as a supplemental thing in an exclusive machine there's too many third-party publishers and developers who will not be bringing their games to Switch for it to be anybody's primary console unless you are a 100% pure Nintendo fanboy or fan girl right like that's that's just it like if you can't play the majority of what Bethesda is making Ubisoft EA Activision you can't play those games on your Switch then what's the point I mean we've already heard that like games like from Blizzard like Overwatch is not coming to Switch sure so I don't know I just I don't see a world where Switch would be anybody's number one console and in relation to Sony making another handheld Sony has many other business arms to Sony Global sure right they have a movie studio they have music they make televisions and all other kinds of electronics and things like that so I don't think that it would make sense for them to want to reinvest in another handheld console because",
            "start": 2572.0
        },
        {
            "text": "Have music they make televisions and all other kinds of electronics and things like that so I don't think that it would make sense for them to want to reinvest in another handheld console because they probably want to invest that money in other areas of the business yeah and I think that's just my speculation it would have to be if the Switch was like I mean a runaway success in the way that people were like this is all I'm playing blah blah and they started to see PlayStation 4 and Xbox One numbers drop off they saw you know concurrency on games being dropped then you'd have an argument for like oh man maybe we have to adjust this but otherwise I think it's apples and oranges to a lot of things and I think Sony knows that they wouldn't be committed to Vita 2 or whatever you want to call the way Nintendo's committed to Switch and that's why I want to see success now Microsoft on the other hand Maybe you think so well I mean if you think about their portable computer offerings Surface",
            "start": 2621.48
        },
        {
            "text": "the way Nintendo's committed to switch and that's why I want to be successful now Microsoft on the other hand Maybe you think so well I mean if you think about their portable computer offerings Surface tablets things like that um they probably are set up to have more success with a handheld or portable console if they can integrate Xbox and Windows 10 games together on a a like a Shield or example like a device like that but I mean I've talked to Phil Spencer and Aaron Greenberg about it and they've both been like ha why would we do that when we have a Windows phone yeah yeah I was like well that makes sense I guess I mean that would be the interesting step of like making an Xbox whatever that's a a PC on the go and and I know that's stuck with me but you're branding a PC to be an Xbox machine that is hey it is your PC and you can do all your work on it but it also plays games as well as an Xbox One S and it you know it comes with a controller bundled in and it is that thing and that",
            "start": 2660.76
        },
        {
            "text": "that is hey it's your PC and you can do all your work on it, but it also plays games as well as an Xbox One S, and it you know it comes with a controller bundled in, and it is that thing, and that would be an interesting GameChanger in a way because it is the you know play Anywhere thing between Xbox or PC it'd be interesting, but I don't know, yeah I don't think it's likely no I got a long one here from from Shane, you ready, yep Ready, Shane wrote in to kindof funny.com kfgd and says Greg and Andrea, I just discovered this morning from a random video that there is a Spider-Man: Homecoming VR experience coming out this Friday exclusively for PlayStation VR, I don't think it's exclusive let me know at kof funny.com wrong what how did I not know about this no seriously I am a gamer who is in the no and I had no idea about this game Sorry experience which had a trailer the week before 33 I'm not saying this little experience is going to set the world on fire but I am a PSVR owner who struggles to",
            "start": 2709.48
        },
        {
            "text": "I had no idea about this game Sorry Experience which had a trailer the week before. I'm not saying this little experience is going to set the world on fire, but I am a PSVR owner who struggles to want to jump through the hoops to put my headset on. However, this silly Spider-Man thing will make me do it because I love Spider-Man. Does Sony need to have better messaging on VR game/experiences like this and Ghostbusters, which have brand power behind them despite their quality? I'm not saying this trailer should have been on the stage D3, but heck, they could have thrown in the pre-show. Do you think Sony needs to bring things like these to the forefront to show that they are actively supporting VR and catch the attention of the public that would love to swing around as Spidey? Do you think they need more tie-ins and experiences like this? This is a tough question because E3 is all about video games, and I'm sure the video game branch of Sony doesn't necessarily want the movie division coming in.",
            "start": 2751.28
        },
        {
            "text": "need more tie and experiences like this this is a tough question because E3 is all about video games and I'm sure the video games branch of Sony doesn't necessarily want the movie Division coming in and stealing their Thunder sure and we have seen some pretty bad tie-ins before I haven't played this yet or seen it yet maybe it's not great it doesn't look great that's the thing so maybe that's why they're like hey we're going to let this thing release because maybe they have some kind of obligation contractually to do some kind of tie-in but it wasn't it didn't turn out the way they had hoped so that's why they didn't promote it they're like okay it's releasing it's out if you want it cool but we're not going to like pimp it out because it's not good I don't know I haven't played it yet the interesting thing for this is Shane's like why wasn't I told about this but you found out about it you know what I mean like that's the thing is like granted yeah it didn't get delivered to you via",
            "start": 2791.88
        },
        {
            "text": "interesting thing for this is Shane's like why wasn't I told about this but you found out about it you know what I mean like that's the thing is like granted yeah it didn't get delivered to you via owl or something but like the message got to you that this game is coming or this experience is coming and it's going to be there I think that the the struggle they have is predictable in a way in the fact that PlayStation VR was sold to us the hardcore gamer and the hardcore PlayStation fan and I think the messaging was on point both on their side and then like when they pundits like us were saying like hey this is Gen one Shu talking about this is he knows this is PlayStation 1 and not PlayStation 4 he knows this a 20-year thing and like you watched this trailer in my first response watching this trailer was like man I hope in 10 years we look back and laugh at this cuz it is it doesn't look terrible but it's blocky ass buildings and it like it looks like what I remember in PS2 games",
            "start": 2840.44
        },
        {
            "text": "trailer was like man I hope in 10 years we look back and laugh at this cuz it is it doesn't look terrible but it's blocky ass buildings and it like it looks like what I remember in \"PS2\" games looking like where I'm sure they \"PS2\" games look way worse than this but it's like super simple I'm webbing this thing and throwing this over here and doing this thing and like you're not going to get free roaming you know swinging around New York or anything like that but they sold it to us as this is a a device we're actively developing and we want you to get in there and try it people bought that and for the most part as I said on \"PS\" I love you for a long time was I was blown away that people are on board with that message still of like I bought it and I don't use it that much but I'm okay with that like I have good games for it and I saw a thread on our own uh uh Reddit reddit.com r/kindafunny where somebody was like no BS are you okay with your VR purchase and everybody was like no I'm",
            "start": 2886.0
        },
        {
            "text": "that like I have good games for it and I saw a thread on our own uh uh Reddit reddit.com r/KindaFunny where somebody was like no BS are you okay with your VR purchase and everybody was like no I'm totally fine with my PlayStation VR and it sits there and it does this I think the fact that the message gets to you is good I think that like I was blown away yeah that that Ghostbusters VR experience dropped and nobody bothered to tell me I didn't know about it till it came out I was like whatever and then I heard it was like 15 bucks and it's like or I'm sorry 15 minutes and not and it was I forget the price on it but it was like oh okay I understand why you're not pushing this out there and the same thing here where it's like these are fun little experiences but I don't think they're like game changers that you need to know about and then also how do you deliver that message Andrea is not going to do a preview of the VR experience here for Spider-Man if it's garbage and it looks not",
            "start": 2921.76
        },
        {
            "text": "game changers that you need to know about and then also how do you deliver that message Andrea is not going to do a preview of the VR experience here for Spider-Man if it's garbage and it looks not that great they might they might I mean well I'd like to do Spider-Man gets clicks we all know that it's true it's true it's true um I don't know like I think they're in a weird spot of like you know you if you turn out like I would run PlayStation very differently obviously and I like I would jump in there and make it so yeah when you turn on your dashboard and you immediately pop on that what's new there's an automatic video playing and it's Sid Shuman and Ryan Clements telling you about cool stuff that's coming out today or that you didn't know or here's this VR experience but that's not how Sony chooses to run it so you need to go to your houses to get this information or your house your silos to get this information and so like now you've told us about it Greg so I'm talking about it",
            "start": 2958.24
        },
        {
            "text": "Sony chooses to run it so you need to go to your houses or your silos to get this information and so like now you've told us about it, Shane, so I'm talking about it here. I watched the trailer today and oh I was so mad, I watched the trailer Andrea because it started with Tom Holland talking and I was like \"oh no\" and then it went into footage from Spider-Man, so I'm like \"oh **** just show me the game, stop showing the movie, oh God.\" And I jumped ahead, I'm like \"oh man this doesn't look great but the message is getting through yeah. The press release is on SonyPictures.com, it wasn't on the PlayStation blog at least does it say if it's exclusive to PlayStation? I could have sworn it said it was not exclusive, it is also coming to the Vive and the Oculus Rift gotcha sure starting June 30th yeah it's coming up tomorrow yeah today's the 28th June 30th is Friday yeah today's Wednesday yeah my bad everybody you sure you're",
            "start": 2992.44
        },
        {
            "text": "The Oculus Rift gotcha sure starting June 30th yeah it's coming up tomorrow yeah is it tomorrow no today's the 28th, June 30th is Friday yeah today's Wednesday yeah my bad everybody. You sure you're picking people up from the airport today I am oh no they've been there two days in a room yeah I think the message got to you. I think Sony needs to do a lot different with VR but for where they are right now I think they're okay, I I think I thought I was impressed that there were games shown at E3 I'm impressed that things are still coming out for PlayStation VR I'm impressed that their messaging was like why promote it you can't sell you can't buy it like we're aware we have a problem and we're working on fixing it it's like that's good at least they're communicating it cuz for a while there we were sitting there like oh **** is this V again are they doing a Vita thing again where they're just going to put this thing out to die but apparently it's still happening you need to get on this",
            "start": 3028.84
        },
        {
            "text": "were sitting there like oh **** is this V again are they doing a Vita thing again where they're just going to put this thing out to die but apparently it's still happening you need to get on this VR train we have one at home I know but you said you said before you're like nah I'm not a big VR person it's because the headset's uncomfortable to wear for more than like 20 minutes it gets really hot I'll give you that but it's not the PlayStation VR so I don't like having like VR face for like two hours after I'm done yeah I that that impedes My Lifestyle having this imprint on my face and it also just if I sit down to play a game yeah I want to play for at least an hour preferably like two to three if not more hours and you just cannot play for that long in VR it's not healthy for you it's not recommended by the people who make VR headsets to have those long obsessions and that's why I haven't gotten into it I've seen I've done a lot of really cool VR demos yeah and played",
            "start": 3071.16
        },
        {
            "text": "not recommended by the people who make VR headsets to have those long obsessions and that's why I haven't gotten into it I've seen I've done a lot of really cool VR demos yeah and played you know like snippets of games in VR I have yet to find a game in VR that has drawn me in and has said come back and keep playing this game yeah for me it was Resident Evil that I mean that's the the game that I've played and I played for hours with it on my face in in in a pitch black room with Py at my feet and it was like this is cool but yeah it has been the thing of like there's all these other things that come out and I look at them I'm like it's clearly an experience you know I mean how much am I really going to play like this uh weekend I had the code for Arizona Sunshine and I downloaded it and I was like maybe I'll try it here and do this and and didn't you guys do that for party mode well no we just did a let's play of it here in the office but the the prologue to that story was we were at",
            "start": 3114.4
        },
        {
            "text": "was like maybe I'll try it here and do this and and didn't you guys do that for party mode well no we just did a let's play of it here in the office but the the prologue to that story was we were at home and Jen was playing Arms next to me and I was playing uh uh Friday the 13th of course and then uh I was like all right cool I want to play something else and it was either going to be Crash Bandicoot or it was going to be Arizona Sunshine and I was like all right well honey I'm going to get the VR unit and try she's like you going to get the VR unit I'm like yeah is that a no-o she's like it's a bit isolating isn't it like we're having we're having a we're having a nice day here hanging out playing games together can you not put on a thing and disappear like all right cool she's like you can play it at work I'm like oh thanks for your permission we came in and play it at work and I was like oh man thank God I didn't drag out all the cables and do all this for this yeah it's maybe I'm this",
            "start": 3155.44
        },
        {
            "text": "it at work I'm like oh thanks for your permission we came in and play it at work and I was like oh man thank God I didn't drag out all the cables and do all this for this yeah it's maybe I'm this is me going back to being like the laziest console gamer it is it's a setup you know and then you have to get the chair on the right spot you got to get the camera out you have to make sure your move controllers have been charged you know it's that's a big problem those move controllers it's a RIGMAROL it is a Rigamarole if I ever heard of one Andrew let's Squad up with somebody all right let's do it we have our first person who wants Nintendo Switch friends I'm I'm impressed with that thank you this is Josh his Nintendo Switch code everybody say get ready SW 0990 6211 5237 thank you very much Nintendo Josh says hey Greg I was wondering if I could get on Squad up today I'm going in for surgery today nothing super serious and we'll be out of commission for the next few weeks I love my Switch",
            "start": 3190.24
        },
        {
            "text": "Josh says hey Greg I was wondering if I could get on Squad up today I'm going in for surgery today nothing super serious and we'll be out of commission for the next few weeks I love my Switch but have no one to play it with since I am pretty sure I bought the only one in Cleveland I play Mario Kart and Puyo Puyo will also be getting Splatoon too day one love the content keep it up and if Andrea is there tell her I think she's awesome beyond beyond beyond thanks Josh everyone send Josh Nintendo Switch friend code request again that that number sw99 6211 5237 someday Nintendo will get with the times I don't know if they ever will they're just doing their own thing and it seems to be working out for them I'm going to take one sip of water and then give you a spirited rant Andrea oh okay we have a returning rotating segment called This Trophy Can Go **** Itself this was submitted by The Silent Gamer the segment This Trophy Can Go **** Itself and then he puts please read in angry Greg",
            "start": 3232.68
        },
        {
            "text": "a returning rotating segment called \"This Trophy Can Go **** Itself\" this was submitted by the silent gamer the segment \"this trophy can go **** itself\" and then he puts please read in angry Greg ad read voice i don't know i've ever done the angry ad reads i think i just do anyways my submission for this is Champion gold on Rayman Legends specifically Vita which tasks you with getting in the top 1% worldwide on one of the daily challenges which is an absolutely bloody ridiculous **** trophy as someone who decided to play this game about 4 years after it came out only about 200 people were doing the daily challenges which means to earn this i have to be number two in the world and ain't nobody got time for that not to mention there's some arsehole insert British oi here oi who manages to get Rayman to run he says 12 km or something ridiculous like that who is at the top of the leaderboards every single day hey Ubisoft I hey Ubisoft am i expected to beat that guy with my middling Rayman",
            "start": 3286.0
        },
        {
            "text": "Rayman to Remy he says 12 km or something ridiculous like that who is at the top of the leaderboards every single day hey Ubisoft I hey Ubisoft am I expected to beat that guy with my middling Rayman skills what do you think I am a Pro Gamer a Rayman Esports Champion is there a million dollar prize pool that I'm missing out on now I can imagine this trophy may have been somewhat less of a pain in the ARs when the game first came out and everyone was raving about playing Rayman on the go but still 1% one percent this has got to be a windup or something some social commentary on the 1% being better off or something grasping at straws here it feels like they deliberately designed this trophy so nobody would get it but why as fun as Rayman is I'm not going to grind the daily challenges every day so I can possibly come second to the 15 km guy am I supposed to incorporate it into my daily schedule come home from work spend hours playing Rayman go to sleep go back",
            "start": 3341.4
        },
        {
            "text": "day so I can possibly come second to the 15K Greg Miller guy am I supposed to incorporate it into my daily schedule come home from work spend hours playing Rayman go to sleep go back to work is that what is expected of me is this possible is this a parable of the failings of man Food For Thought on the Kinda Funny Games Daily and rant thanks for the great show and keep up the good work Smileys Greg Miller Kevin are yours okay Kevin survived I love a good spirited rant people get fired up by these trophies you know I mean that is a very valid reason incredibly upset come on man come on that's just mean-spirited yep lot of TR I'm telling you consult me for your trophies I will help you be on the right path you know I mean the people they overthink it too much they put all these things in there they think it's going to be fun and yeah we're no it's not fun so what's worse no platinum or an impossible Platinum wow wow Andrea Rene that's a deep question you don't have to answer",
            "start": 3398.44
        },
        {
            "text": "in there they think it's going to be fun and yeah we're no it's not fun so what's worse no platinum or an impossible Platinum wow wow Andrea Rene that's a deep question you don't have to answer right now if you don't have an answer think about it maybe we'll talk about it I would think an impossible Platinum because it's just it's demoralizing you know what I mean like okay I mean like I like to give Steve Gagne **** cuz you didn't put a platinum and gone home but like to know that there's a game out there you can't you can't get like he makes a great K got a job he's got things to do he can't sit there and try to be this you know like you want a platinum to be achievable that's the most important thing so many people screw it up I don't know what's going on ladies and gentlemen this has been kind of funny games daily for June 28th 2017 thank you so much for joining us tomorrow the pure one Tim Gettys will be joining me once again Andrew Rene is off to do more what's good games",
            "start": 3448.48
        },
        {
            "text": "Has been Kinda Funny Games Daily for June 28th, 2017. Thank you so much for joining us tomorrow, The Pure One Tim Gettys will be joining me once again. Andrea Rene is off to do more what's good games that's true but before you go I have just a short post from KindaFunny.com. You're wrong. What did we miss today? Future ROM or Worlds of Tomorrow is coming to iOS on June 29th. Gotcha, that is tomorrow. Um, Spider-Man: Homecoming VR experience it is not exclusive which we talked about. Um, Andrea said that Infinite Warfare, Battlefield 1, and Titanfall 2 all suffered in sales due to the small amount of time between the releases while Infinite Warfare and Titanfall were indeed reported to have lower than expected sales EA reported that Battlefield 1 Sales were actually higher than expected through the quarter with Executives proclaiming it the biggest Battlefield launch ever. Okay so maybe people who would have bought Titanfall or Call of Duty bought Battlefield instead I mean I don't think I think my",
            "start": 3486.84
        },
        {
            "text": "with Executives proclaiming it the biggest Battlefield launch ever okay so maybe people who would have bought Titanfall or Call of Duty bought Battlefield instead I mean I don't think I think my point still stands I'm still with you that I think best Battlefield launch of whatever great I still think more people would have bought it if they hadn't necessarily just bought a Titanfall or a Call of Duty right but thank you very much for that clarification that's it that's it all right great remember ladies and gentlemen Kinda Funny Games Daily needs your support right into kinda funny.com kfgd with your questions go subscribe to the YouTube channel that is youtube.com/kindafunnygames I don't mean to one last thing Aaron sent in a technical difficulty thing that I'm not going to read because it's not a correction but Aaron I've got it I'm gonna let Kevin know we're on it Kevin always knows the technical Kevin's doing his big shrug over there um uh if you got a podcast service go over there",
            "start": 3534.48
        },
        {
            "text": "not a correction but Aaron I've got it I'm gonna let Greg know we're on it Greg always knows the technical Greg's doing his big shrug over there um uh if you got a podcast service go over there download us rate US there subscribe to us there even if you don't ever plan to use it thank you it helps us get the show to new people remember RTX next week so no show technically next week but the kids will be here doing stupid stuff on Twitch if you like that and if you're watching on Twitch right now we're going to sign off and then I'll come back and read your tips and Subs until next time it's been our pleasure to serve you for",
            "start": 3580.28
        }
    ]
}