{
    "id": 2699,
    "video_id": "gNVK3M6jJhc",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "E3 Ubisoft, EA, and Bethesda Predictions 2017 - Kinda Funny Gamescast Ep. 123 (Pt. 4)",
    "description": "We predict what will be shown at Bethesda, Ubisoft, and EA's E3 2017 conferences.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1496925000,
    "duration": 1523,
    "transcript_chunks": [
        {
            "text": "final topic, the third party conferences. Ooh, this was the conference so specifically we're talking about Bethesda, Ubisoft, and Electronic Arts (EA) on a Saturday. What is wrong with you jerks? The real gamers not you, Ivory Tower Josh, kick it off. Greg, I'm going to get there before anybody else can. The Evil Within 2 is announced at the Bethesda Conference in October 2017. That was my number one prediction three years later. We all had that on our list. Why not let's just get it out of the way then? Wolfenstein new game, yeah, announced. Is it going to be called whatever the giant or whatever The New Colossus? Yeah, sure, okay. Is that what they said, that's what got hinted at in their press conference last year when they did like the booting up sequence. So do we think those are the two though because the the press the the invite went out it's been leaked all over the place and it has but there's The Land and Under Construction R there two under construction, it looks",
            "start": 0.13
        },
        {
            "text": "Are the two though because the press the invite went out it's been leaked all over the place and it has but there's the land and under construction R there are two under construction areas do we think that's it like that's what I'm interested in as we go around yeah definitely yeah I mean I think it makes sense I mean we could potentially see a new IP from them but they just released Prey this year so that was a new IP for them I don't know why they would necessarily want to be promoting another new IP in the same year but you never know. I think that was something I don't think it'll be like Fallout Shelter levels but that was some cool fun thing we didn't see coming right do you does anyone else have any other Bethesda predictions yes um okay yes okay cool we'll talk about this later then okay so my um prediction this is kind of like my pipe dream prediction finally after years of tormenting us Beyond Good and Evil 2 my prediction Beyond",
            "start": 60.72
        },
        {
            "text": "yes okay cool we'll talk about this later then okay so my um prediction this is kind of like my pipe dream prediction finally after years of tormenting us Beyond Good and Evil 2, my prediction Beyond Good and Evil 2 will not be out at E3. You three said it's in production, you have said it time and time again that they're working on it, like this is another Cuphead moment except it's worse than Cuphead because at least we've seen gameplay from Cuphead but like they've been talking about it and talk and they and they've never once said it's cancelled, they haven't said it's not being worked on, they've said it that they're working on it. What did they show, a gameplay trailer? I mean I think it's a I think it's a trailer, I mean if we're talking pipe dreams since we are it would be like a a Gameplay trailer okay something short but like a little. If this were to happen yes what consoles do you think it comes to all of them including the Switch yes especially so not a Switch exclusive though no",
            "start": 97.76
        },
        {
            "text": "trailer okay something short but like a little if this were to happen yes what consoles do you think it comes to all of them including the switch yes especially so not a switch exclusive though no okay that would be dumb a lot of r I don't believe I think the switch is doing great but if you don't bring your game especially to PS4 and to Xbox One like why why would you not we're talking about tens of millions of units of consoles in the world so of course but I think this comes to PC I think it's console I think it's switch Yeah okay I I would love to see it and that would be hype as **** but I don't think it would see it this no I mean in my heart of hearts I don't believe this to be evil I like to see I would like to see it finally come on PC I'm jump to I like that one second one and we'll skip me the next time okay um Mario & Rabbids Kingdom Battle it's going to be focused on they'll",
            "start": 150.88
        },
        {
            "text": "I like to see I would like to see it finally come on Yubisoft. I'm jumping to I like that one second one and we'll skip me the next time okay um Mario & Rabbids Kingdom Battle. It's going to be focused on, they'll show it at the Ubisoft thing and the Nintendo thing but my prediction is it's going to look way better than it has any right to okay there been so much hate everyone's saying this looks like crap crap why would you do this why the hell are they combining the Rabbids and Mario even I'm like what the crap that doesn't make sense. I think the game's going to be good and I think that that will be clear at E3 okay all right my number two Ubisoft reveals their next Ubi Art game from Ubisoft Mount & Blade. The game is coming from Ubisoft, where Mount & Blade oh my Manar yeah Jen got real upset when I pronounced it that way so I double down and also I'm stupid uh the game is coming before the fall okay I think we're going with the Vampires Hearts route with this one right where it's like got announced",
            "start": 196.68
        },
        {
            "text": "\"pronounced it that way so I double down and also I'm stupid uh the game is coming before the fall okay I think we're going with the Valiant Hearts route with this one right where it's like got announced at E3 and it was out like a month and a half later when everyone was like 'that's Red Valiant Hearts 2' okay we're still in World War I man save the dog, Ubisoft can do it too. Am I up? Yes yes Assassin's Creed Origins coming out in October duh okay not Assassin's Creed Empire so sorry Empire no no no you said it you said Origins you did Assassin's Creed Egypt coming out hold on isn't it actually Origins I know I put out Origins recently I think that everyone thought it was Empire and then they were like 'Financial' I can't remember I have it in the back of my gray matter Origins was the one that I just did the I'm pretty sure Origin is the official title from Ubisoft that's out there yo, Assassin's Creed: The Curse of the Ancients... no wait, that's not it. Assassin's Creed: Odyssey is coming out and then Assassin's Creed: Origins is coming out in October, and then Assassin's Creed: Valhalla is coming out after that. That's going to come out in\"",
            "start": 242.76
        },
        {
            "text": "Origins was the one that I just did the I'm pretty sure Origin is the official title from Ubisoft, and that's out there. You go into it, I think that's what's going on. Who's the protagonist? Toon count, I don't know. Anyone else like there's a lot of rumors that it's a female protagonist. Okay, do you think that's true? No, no as much as I would like it to be true, I don't think it's true. Maybe you get to choose your own maybe it's a Far Cry, you can choose you want. I don't know they they've left they you haven't gotten to choose your own with Far Cry in the new one you can Right Far Cry 5. I haven't heard that, I don't think so. Yeah no really I think you can choose where did you hear that? In no what's it called yeah Far Cry five Far Cry Far Cry Montana no they haven't said that I'm pretty sure they said that wait who who said that? I don't know it wasn't your podcast obviously me we were both at the",
            "start": 295.88
        },
        {
            "text": "yeah Far Cry Five, Far Cry, Far Cry Montana no they haven't said that I'm pretty sure they said that wait where who who said that I don't know it wasn't your podcast obviously me we were both at the same E3 2017 conference they didn't say that there my prediction is that in Far Cry 5 uh yeah I'll throw that one out as well yeah I mean they'll show it in yeah I think they'll it'll be front and center for Ubisoft will be the new Assassin's Creed, Origins okay it is Origins it is or a rumor that is the rumor it's a rumor yeah they still haven't announced anything officially like that thing that had the Far Cry 5 logo and the Assassin's Creed it didn't say it didn't have a subtitle maybe it's just called Assassin's Creed they're going to reset it oh my God we're going back God Origins is such a",
            "start": 341.4
        },
        {
            "text": "the Final Fantasy logo and the Assassin's Creed it didn't say it didn't have a subtitle maybe it's just called Assassin's Creed they're going to reset it oh my God we're going back God Origins is such a stupid ass name for it every Assassin's Creed game has had a stupid name but Origins at this point it's like that is the most overused subtitle for a game ever **** what we going to call it next one Assassin's Creed Legacy come on guys I yeah I I that's why when you said Origins I actually did rethink that maybe it has already come out because there have been so many Origins games May shot link was accompanied by news the game may be called Assassin's Creed origin an earlier report pointed to an Egyptian setting and a title Assassin's Creed Empire that appears to have since changed this is GameSpot.com okay you ever heard of them yeah they're great now look up Far Cry 5 female here is here's my second prediction BioWare Edmonton has been working on a new IP Cod named Dragon Age: Inquisition was not mentioned, but the mention of BioWare and Edmonton led me to correct \"Cod\" to \"Dragon Age\", which is a series developed by BioWare in Edmonton.",
            "start": 384.52
        },
        {
            "text": "gamespot.com okay you ever heard of them yeah they're great now look up Far Cry 5 female here is here's my second prediction BioWare Edmonton has been working on a new IP Cod named Dylan we will find out the true name of this IP and we will see a teaser trailer it's a goodie it's a goodie I like that EA is always interesting they're **** unpredictable there's certain things that are predictable there be some mobile **** lot of sports and weird celebrity came tell you about soccer yeah for way too long I mean obviously Sports is going to dominate their their conference as well Star Wars but I think we'll get a teaser I don't think EA play will have anything from BioWare at it um I think though that they've this team has been working on this for a long time time and it's time to maybe plant a seed about what it is okay before it leaks yeah so staying in EA world my prediction is we will see a trailer of one of the single player Star Wars games coming out that's not Battlefront so",
            "start": 429.56
        },
        {
            "text": "\"Plant a seed about what it is okay before it leaks, yeah. So staying in EA world, my prediction is we will see a trailer of one of the single-player Star Wars games coming out that's not Battlefront, so either Amy Hennig or the Respawn one, yeah. The I feel like the Amy Hennig one is more sense cuz Respawn sounds way out there. Kaku, what Kaku you say? Kaku, I k.com Steven Tostiello and his article about Far Cry 5, and then his blog point information in the change for the series - you can choose to play as a man or a woman and pick your skin color; you're a junior deputy on the police force. Predictions right though how you wound up and hope county is a secret, so yeah, I totally think uh I got that from somebody else's article like this is an announcement Stephen asked the question, so I think it might have been afterwards in an interview he followed up with it cuz yeah, I the presentation we saw never made a reference to that why would you not put that in your presentation after how much Ubisoft has been getting about.\"",
            "start": 480.84
        },
        {
            "text": "in an interview he followed up with it cuz yeah I the presentation we saw never made a reference to that why would you not put that in your presentation after how much Ubisoft has been getting about not having any female characters gamer hide it don't let come for you let him come I was joking my third prediction this is a blanket one but I feel it I feel it in my balls Tim this is the year one of these companies announces The Rock is in their video game what yes The Rock is in the video game world it's happening The Rock is voicing a character in some EA Ubisoft game not so he's not himself in a video game no no he's playing he's going to be he's a character he's he's playing somebody in this game I just I can't see it that's a bombshell announcement my thing is if it was anybody it'd be Call of Duty you know like what what franchise would actually get The Rock he just did Moana come on it's not about the franchise you know how much money Disney has Disney has a lot of money this",
            "start": 532.08
        },
        {
            "text": "Be Call of Duty, you know, like what franchise would actually get the wrong one? He just did Moana. Come on, it's not about the franchise. You know how much money Disney has. Disney has a lot of money. This guy's going to be president someday. Can't he's got a lot of money. There you go. Let's launch a new franchise. Let's do something cool and The Rock will be the star of the game. It's not that crazy. I mean, I can see him being down and him wanting to do it, but it would have to be a Rockstar game or a Rockstar game. No, Rockstar goes for unknown talent with the exception of would-be the main dude. He would just be the star there. All right, I'm just letting you know. Don't you all be crying come Monday afternoon when all the third parties have happened and it turns out The Rock is in all the games. Okay, every game. Danny... uh oh god... um okay. I've gone too obvious with some of these ones so I better mix it up a little bit. All right, so we know there's no new Battlefield game.",
            "start": 581.92
        },
        {
            "text": "Rocks in all the games okay every game Danny uh oh god um okay I've gone too obvious with some of these ones so I better mix it up a little bit all right so we know there's no new Battlefield game coming out this year they haven't said anything about what they're doing next right they haven't said we we don't know what's going on past Battlefield one so either either they go then the B they go Battlefield one and then they do World War II the next time around but then that seems a little bit weird for them to do it right after Call of Duty goes back to the to the trenches so do I put my hat on B uh yeah I'm going to say I'm going to say they announced the new Battlefield and it's either going to be World War II or 2142 got it 214 do you really think they're going talk about Battlefield when they have Battlefront coming this year like I feel like Battlefield not going to come this year yeah but I feel like it's more of like an announce it next year for release the yeah I'm with Tim",
            "start": 625.6
        },
        {
            "text": "when they have Battlefront coming this year like I feel like Battlefield not going to come this year yeah but I feel like it's more of like an announce it next year for release the yeah I'm with Tim here I don't think they would want to cross the streams as it were right I agree but I'm sticking with it all right I respect that he said it he's sticking with it the rest of my list is too obvious I'm running out of **** man I've got I've got an EA prediction that I hope no one has thought of but once I say you're going to be like oh **** yeah Sims 4 on Console oh **** that's a good one it did it with the Sims 3 yeah only makes sense it had a great run on PC bring it to PS4 and Xbox One and to switch Sims 4 that's a very safe bet so that was one of the ones that's been brought down to Redwood right because Maxis has shut down so that's been operating there at EAD Hollywood Shores I feel like I feel like I've seen a bunch of people who work at that studio leave over the past",
            "start": 676.52
        },
        {
            "text": "Redwood Shores, because Maxis has shut down so that's been operating there for a while. Rood Shores I feel like I've seen a bunch of people who work at that studio leave over the past year. I'm not sure in my head that's what was happening. Well they go home at night they come back home that would be cool. Well I mean that I'm not saying that they're bringing new like lots of new content but I I think it makes sense for them to Port this to console. It's a hugely popular franchise for EA, like why would you not bring this to console? You think switch yes I do I would totally into that that would be cool. I mean I think they'd love to I just don't think they can run it. You don't think so yeah it's just little people I you'd be surprised but I remember playing every time I play The Sims on a console I'm like oh this ain't running as good as it should be let alone the switch all right we'll see we shall see good I like that we'll see Saturday oh it's not this Saturday I got don't",
            "start": 722.24
        },
        {
            "text": "on a console I'm like oh this ain't running as good as it should be let alone the Switch all right we'll see we shall see good I like that we'll see Saturday oh it's not this Saturday I got don't worry this Saturday to do a live event for people no let's see um the last one I got that I hasn't already been used is Ubisoft you know they they've been releasing a lot of games we know a lot of what they got coming but they like to announce games at E3 like there's usually some surprise or some new announcement I think it's time for Splinter Cell oh my gosh cuz the Get Hype thing for me would be Prince of Persia but that's not happening especially with Assassin's Creed in Egypt like for sure yeah but Splinter Cell oh that's a really good one it is a good one I like that one Mich they do need some Tom Clancy coming yeah exactly like I feel like it's it's time for Splinter Cell to come back because we've seen so much of the the other stuff over the last couple years and like when was the",
            "start": 764.8
        },
        {
            "text": "some Tom Clancy coming yeah exactly like I feel like it's it's time for Splinter Cell to come back because we've seen so much of the the other stuff over the last couple years and like when was the last Splinter Cell game cuz there was a while where double there was way too many of them right every year they were coming out there wasn't one on Xbox One 360 was a double yeah there was no Xbox one it was really good I'm trying to think about go yeah that's a really good chat actually no I don't think it was that I don't think it was that long ago really it must have been oh did they release that oh they released that one that didn't have um the main guy in it remember they released the the weird one that came out it was like barely Splinter Cell the Splinter Cell Blacklist yeah when was that cuz they changed what's the name of Sam Fisher again 2012 Sam Fisher wasn't Sam Fisher 3 hold on let me look I mean either way that's a long time they changed the character I think so yeah",
            "start": 812.0
        },
        {
            "text": "cuz they changed what's the name of Assassin's Creed guy again 2012 Sam Fisher Sam Fisher wasn't Sam Fera3 hold on let me look I mean either way that's a long Dar Fisher they changed the character I think so yeah that is August 2013 yeah that's a good time and I went down it was like Mirror's Edge it was like it was not the return that everyone wanted right so that's a really good shout I like that one yeah is this final one **** hope so no I thought we had two more don't we **** I really hope we do have two more it's can we expand this outside of these these three pubs yeah that's oh it's oh so you mean outside so you mean getting outside of press conferences just at the show yeah huh sure it's a game changer well I have one more Bethesda prediction all right but go ahead Greg well no I like where you're going with this cuz my my my last I have one week prediction you'd make fun of me for and then one prediction that I know won't happen but I I wrote it down yeah exactly okay I'm going to still",
            "start": 853.36
        },
        {
            "text": "going with this cuz my my my last I have one week prediction you'd make fun of me for and then one prediction that I know won't happen but I I wrote it down yeah exactly okay I'm going to still shout it out I don't think this is happening it's a Star Wars: Battlefront 2 thing all right EA opens with Star Wars Battlefront 2 and closes with the Visceral Amy Hennig Star Wars game but I don't think they'll double dip on Star Wars I think it'll be like Battlefront, Battlefront is what you want to talk about yeah spit roast yeah but that'd be cool if it did so that's a prediction that's one there you go okay this is like a prediction I don't want to happen but looking at Bethesda in like a real weird spot because I feel like I feel like Doom 2 is a no-brainer but they won't talk about it this year I bet that's like super early but I think that's a no-brainer for them um Todd Howard's team whatever they're working on they like to do the whole yo it's coming out in three months time thing which I guess they sort of",
            "start": 905.88
        },
        {
            "text": "early but I think that's a no-brainer for them um Todd Howard's team whatever they're working on they like to do the whole yo it's coming out in three months time thing which I guess they sort of popularize it again I don't necessarily think that's going to happen either that was they just did that for Fallout four I mean when they originally announced the Elder Scrolls five like they announced that way out in advance yeah game too so so I don't think it's those but what I so what they're going to end up leaning on a lot is like stuff we already know about one of those is Quake Champions and I don't think that's been announced for consoles they've said it's PC only I think after playing a bunch of the beta that they could get away with bringing down on the console and I think Tim Willits was like no way I know he told me it's not coming to console unless there's some kind of crazy shift like he was like this game cannot run on Console but well then",
            "start": 946.8
        },
        {
            "text": "Tim Gettys was like no way I know he told me it's not coming to console unless they I mean unless there's some kind of crazy shift like he was like this game cannot run on Console but well then but maybe maybe the shareholders are like well Tim you might think that but it's going to come out on Console scraping that Barrel I'm trying my best um my prediction for Bethesda is no Elder Scrolls 6 instead we will hear about ESO and legends their MMO and their card we will not hear about the next installment of the Elder Scrolls there's been rumors of an anniversary edition of Morrowind Morrowind well I mean they released the Morrowind expansion for ESO right right that's out now I'm pretty sure pretty sure coming they usually yeah let me double check the SCs lines really well for them I feel like that's the same I feel it's it's weird this E3 to me feels like a holding pattern for loads of people like Microsoft's going to concentrate on the hardware stuff Sony's already had a really good",
            "start": 988.96
        },
        {
            "text": "like that's the same I feel it's it's weird this E3 to me feels like a holding pattern for loads of people like Microsoft's going to concentrate on the hardware stuff Sony's already had a really good year and they're going to double down on their game stuff switch is building like a lot of the really exciting stuff June 6th okay it comes out um sorry we playing special delivery like there's so much more stuff that's going to come out from the third party SE I feel the same way about like something like cyberpunk where in the same way that like ESO is really big for them like this is the year for gwent and it's also the 10 year anniversary of The Witcher this year so I feel like they're just going to sit on that and then next year we're going to get that big announcement I feel like Bethesda is in the same spot like that so that sounds yeah maybe Morrowind wins so I'm all done with uh predictions for the the conferences but so for jumping into just third party in general Konami oh yeah",
            "start": 1046.76
        },
        {
            "text": "Metal Gear Survive, I mean we haven't seen it for so long I think that it'll be here did we see it we just saw that trailer thing um yeah I I think it'll be there if it's not then yeah I don't know really the other the crazy thing for Konami could do would be Castlevania but I don't think that they would there the Netflix series out people are hyped about that but like people just don't like Nami I don't know I don't think they're interested in making oh they're on the E3 exhibitor list so they have space they have at E3 I mean OB yeah well they have pet so yeah so I think we have to see something from from them from Metal Gear yeah yeah Metal Gear Survive then I'm so interested in that game like I know like there's so much hate going on for it for obvious reasons",
            "start": 1083.32
        },
        {
            "text": "so I think we have to see something from from them from Metal Gear yeah yeah Metal Gear Survive then I'm so interested in that game like I know like there's so much hate going on for it for obvious reasons but I mean I the system of Metal Gear Solid 5 is so good and just imagining like playing more of that multiplayer like I think the game could be fun having said that **** the whole situation yeah I no I think you're right I think if they're ever going to talk about a game it's going to be that I don't think they're going to go down in the route of like so much of that game with its architecture in the engine and everything I mean they even use that engine in in Pro Evolution now as well um like a lot of that work has been done and it's a really strong foundation so like it's kind of easier for them to go down the path of doing that spin-off than it is for them to tackle an I like Castlevania yeah so I'm going to piggy back off that but I'll tell you my **** fifth one because I was just",
            "start": 1139.36
        },
        {
            "text": "them to go down the path of doing that spin-off than it is for them to tackle an I like Castlevania, yeah, so I'm going to piggy back off that but I'll tell you my fifth one because I was just like on the press conferences I said Ubisoft's gonna make a big deal about its new logo, oh God, it's awful. I and I do believe they're going to be up there and they're going to give you the whole press conference thing of like well what we're doing is it means that blah blah blah and but I here's my thing I I think that yeah I think Metal Gear I thought it whatever Metal Gear Survive, I just assumed it's going to be there 's article is the same way like we assume it's going to be there so whatever it's going to be there and I think it's going to actually be good I think people are going to come back and be like that was actually fun what do we do cuz we hate Konami but this game was good yeah I yeah I think that game was getting railroaded a little bit hard even based on what they showed people",
            "start": 1176.4
        },
        {
            "text": "like that was actually fun what do we do cuz we hate Konami but this game was good yeah I yeah I think that game was getting railroaded a little bit hard even based on what they showed people are just pissed and rightly so but you know people making that game aren't the people who got fired by Hideo Kojima either so you know I think I think I could imagine being on that team and trying to make a really good job of that if you're backed up against the wall you have any more predictions no do you I think we'll see Matt Groening and Trey Parker on stage at Ubisoft you think that's dangerous what do you mean cuz it's slipped so many times no but they have had a hard release date before they have this new release date is October 17th this fall I think Ubisoft loves having celebrities on their E3 stage I think they've kind of realized that hey we shouldn't waste our money booking a big musical act for Just Dance because the audience at E3 could give two **** do you think they",
            "start": 1214.76
        },
        {
            "text": "on their E3 stage I think they've kind of realized that hey we shouldn't waste our money booking a big musical act for Just Dance because the audience at E3 could give two **** do you think they realize that no they do because last year they didn't they had like the crazy clown, Colson Baker (aka Machine Gun Kelly), there though no he was the year before um so last year last year was the brilliant Ubisoft Conference of here's some gameplay sit down and talk to me about it all right here's some more what are you **** doing choose one last year horrible sucked yeah it was weird um I wouldn't say it sucked long um it was too long and it was I mean there I think that there was just too much awkwardness and now they're like double Downing on the awkwardness is like something that they want in their conference and I think that that's the wrong move I think they need to get away from that and go back to cool making it cool I love having the musical guest there but I was always the only one like out of my seat",
            "start": 1259.32
        },
        {
            "text": "I think that's the wrong move. I think they need to get away from that and go back to cool making it cool. I love having the musical guest there, but I was always the only one like out of my seat in dancing because all these like jaded journalists who are like \"oh this is like the third conference\" you and Hip-Hop Gamer just no Sony son - son is his thing. I think that um you know they need to get their celebrity on stage in another way, and obviously you know South Park is huge for them, and the community loves South Park. The first game did really well for them, and we're going to see them on Stage Los Angeles; they're already there like that's a solid bet. I like is hosting this year, to be known that's what I was looking for no confirmation yeah is what I've been able to dig up even though or really if I'm being honest an article from IGN and India about it the Seven the seven embarrassing occurrences to expect at E3 2017 number one is Aisha Tyler at least the first when",
            "start": 1303.88
        },
        {
            "text": "really if I'm being honest **** **** article from IGN and India about it The Seven: The Seven Embarrassing Occurrences to Expect at E3 2017 number one is Aisha Tyler at least the first when they List look we love Aisha Tyler and Archer when she's being interviewed she comes across as a goofy nerdy and pretty chill person on stage is a host at Ubisoft's E3 pressers she's arguably the worst thing imaginable that's disagree entirely Mr. Caffeine yeah exactly I know there's a million worse **** presenters I can think of like Aisha rolls with the punches actually knows what she's talking about show about it too like that's I just don't want them to build the awkward in like how she sat down with that random audience like we don't we don't need any of that just like show us the games you have a really cool slate of games coming up that was we talk about last year is the the the games were good they were just presented so poorly what was being said was great it just",
            "start": 1351.6
        },
        {
            "text": "the games you have a really cool slate of games coming up that was we talk about last year is the the the games were good they were just presented so poorly great what was being said was great it just took so long to do it and like when the when they did the Beyond Good & Evil 2 thing and came back out and did it again it's like oh no yeah yeah all right okay I've maybe got one there just talking about Ubisoft and do we think of all they they are they get dragged into maybe not dragged into they put themselves into interesting forms of like debate around you know representation and culture in games right do you think they come out and actually address any of the Far Cry 5 stuff directly any of way not stage yeah maybe on like the IGN stage or the Game Awards stage or like Keely's stage or whatever right like they might have that actual conversation about it um but there's no way that they're doing it at a press conference they don't have to no why would they yeah all right any final statements Kingdom",
            "start": 1398.0
        },
        {
            "text": "They might have that actual conversation about it um but there's no way that they're doing it at a press conference they don't have to no why would they yeah all right any final statements Kingdom Hearts 3 will not be shown at E3 dude they've shown it so much at E3 in a way that doesn't make **** sense like why why does why do they keep showing it **** make it please thank you guys for joining us this has been a lot of fun let us know in the comments what you think's going to happen at E3 2017 you can watch our twitch stream on Twitch.tv/KindaFunnyGames, watch all the stuff VOD on YouTube, it's going to be a fun time thank you guys you can find them again at What's Good Games and at Noclip which is Patreon.com/Noclip. All right he learns nice work yeah till next time I love you Pon what's up guys that was fun if you want more Kinda Funny Games click there to subscribe if you want other stuff you can click there to subscribe to YouTube.com/KindaFunny, you can support us on Patreon.com/KindaFunnyGames.",
            "start": 1448.32
        },
        {
            "text": "what's up guys that was fun if you want more Kinda Funny Games click there to subscribe if you want other stuff you can click there to subscribe to youtube.com/KindaFunny you can support us on Patreon right there and over here if you click on this you'll have to find out what happens is it Kevin's little belly button it's not I was going to say butle oh my God",
            "start": 1503.52
        }
    ]
}