{
    "id": 2689,
    "video_id": "mCMAqrqPUZg",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Why the Hell Didn't You See King Arthur?! - The GameOverGreggy Show Ep. 183 (Pt. 2)",
    "description": "No one in the world saw King Arthur, but Nick Scarpino did. Against his will. Now, Nick wants to look back at the original trailer and figure out why no one gave this film the time of day.\n\nThanks to Blue Apron for sponsoring this episode. Go to http://www.BlueApron.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1496732403,
    "duration": 1573,
    "transcript_chunks": [
        {
            "text": "You know what Kevin loves? Eating. You know what Kevin's doing? Getting married. I'm not saying the two are connected, but maybe if you use our sponsor, Blue Apron, to eat, someone will love you. Blue Apron. I wrote this ad again. Blue Apron makes cooking simple and delicious. Each week, they send you pre-portioned ingredients. You follow the step-by-step instructions. Blammo. You've got a dish to be proud of. No more eating out of the trash. YouTube user Matt Bell. They got warmed smoked trout and asparagus salad with fingerling potatoes, garlic croutons this month, man. Stop being out of the trash. Check out this week's menu and get your first three meals free with free shipping by going to blueapron.com/gregy. You will love how good it feels and tastes to create incredible home-cooked meals with BlueApron. So don't wait. That's blueapron.com/gregy. BlueApron, a better way to cook. And stop eating out of the trash, YouTube user Matt Bell. Nick, what's your topic? Uh, wait",
            "start": 0.08
        },
        {
            "text": "meals with BlueApron. So don't wait. That's blueapron.com/greggy. BlueApron, a better way to cook. And stop eating out of the trash, YouTube user Matt Bell. Nick, what's your topic? Uh, wait, hold on. Are you going to switch your back your hat to a different location? Do you need me to to So, this Wait, wait, wait, wait. While you debate the situation and how you're going to move it around, I want to say thank you to everybody who supported us on patreon.com/kindafunny. Your name is not going through the infamous scroll bar. Do you want me to sing \"The Wind Beneath My Wings\" by Miller? I do want you. Did you ever know that you're my hero? That was a rainbow. They don't fly. Beagles don't fly either. He's ready for Greg. Ready for Nick has a deceptively good falsetto voice. is a great fall. That's great. That's what it is. Really good. Um, my topic is uh uh I wanted to do this a couple weeks ago, but we didn't. We had really good topics and so I saved it, put it in",
            "start": 41.52
        },
        {
            "text": "Is a great fall. That's great. That's what it is. Really good. Um, my topic is uh uh I wanted to do this a couple weeks ago, but we didn't. We had really good topics and so I saved it, put it in my back pocket, man. We had some pretty good topics. No, we had we had I think a couple topics go long, so I couldn't do this. But I thought this would be really cool. I've always wondered when you see a movie that costs hundreds of millions dollars and doesn't do that money back in the box office why people didn't go see that movie. Okay. So, what I want to do with you guys right now and um is watch the the official trailer for King Arthur, which is a movie that came out starring Jude Law, Charlie Hunnam, and directed by Guy Ritchie. And this movie came out and it did not do well. Gotcha. It by I don't I hate to use the word bombed, but it it it bombed. Um I can pull up the actual official stats for you guys here. Kevin, explain to me how we're doing this for the audience at home. They're going",
            "start": 108.64
        },
        {
            "text": "I hate to use the word bombed, but it bombed. Um I can pull up the actual official stats for you guys here. Tim Gettys, explain to me how we're doing this for the audience at home. They're going to have to just watch this. Unfortunately, can we Yeah, we can't embed this. Oh, we can't do We're doing that. Oh, I guess we can do that. Yeah, it's We're still going to hear it, but I mean, cuz what I mean, if it gets blocked, then we'll have to do a show without it. Remember, we're watching the King Arthur: Legend of the Sword official trailer in HD. It's 2 minutes and 16 seconds long. Yeah, it's got a weird little thing at the beginning of it, but not have any of the audio. I think maybe we should just We should watch it with audio. Maybe not the visual and then people can watch it. I mean, people I don't know. I mean, wouldn't it So, follow me on this. Couldn't we do it and then when we upload it, we'll know right away and we'll can edit it. You could break out this part, put it",
            "start": 157.84
        },
        {
            "text": "mean, people I don't know. I mean, wouldn't it So, follow me on this. Couldn't we do it and then when we upload it, we'll know right away and we'll can edit it. You could break out this part, put it up, see if it gets the episode blocked, right? I'm sure we watched about four minutes of Top Gun this morning. That will that definitely got you blocked. Sorry about that. It was the entire volleyball scene. Sometimes Kevin goes in, but uh Nick and I can recreate the whole trailer. We could if you want. I mean, we could do a sinking sync experience for those at home, but I mean, why don't we do that for you to do the volleyball? Is that Do you want us talking over it? Letting it go. We can talk over it. Yeah, we don't. Kevin, do you want to do a time jump? Right. So, you put an edit here and you jump. Basically, we cut 2 minutes and 16 seconds out. All right, everybody. So, we're about to watch King Arthur: Legend of the Sword official trailer HD. If you are watching on YouTube, go ahead",
            "start": 189.84
        },
        {
            "text": "you jump. Basically, we cut 2 minutes and 16 seconds out. All right, everybody. So, we're about to watch King Arthur: Legend of the Sword official trailer HD. If you are watching on YouTube, go ahead and pause it right now. Find it over this. What channel is it on over there? The official version we're watching. We're on the Warner Brothers Pictures one. This has 5,922,838 views. We're about to give it 839. So, you can now play a game of when you watched it based on our view count. All right. See how many views Okay, so we're going to watch this and jump back to it. That's fun. What if the numbers got lower? That'd be really weird. Something mischievous would be at foot. And we're back. And we're back. All right, we've watched the trailer. The movie did a worldwide as of uh as of right now on Box Office Mojo worldwide $119 million and $900,000 uh but it costs a reported $175 million to make. So that's a pretty big loss for them. Um now the question is I saw the the original trailer",
            "start": 227.76
        },
        {
            "text": "now on Box Office Mojo worldwide 119 million and $900,000 uh but it costs a reported $175 million to make. So that's a pretty big loss for them. Um now the question is I saw the original trailer for this teaser for King Arthur which was very Guy, very jump cutty crazy like right and then obviously this is a little bit more mainstream. Um, I had no desire to see this film, but because of a set of circumstances that were beyond my control, Yousef McGee, right, I ended up actually seeing it and I really liked it. Wow. I was like, this is Yeah, I liked it. I I mean I It's enjoyable. It's a very enjoyable popcorn blockbuster like fun film. Sure. Right. Um, so I'll open it up to you guys like you obviously it came and went and didn't even wasn't even a blip on your radar. Why not? Uh, well, I didn't see that trailer. I mean, I feel like I'm always an interesting, but I just don't get to the movies or watch much TV. I was on Fanboys today over on Twitch and they were talking about all these",
            "start": 270.56
        },
        {
            "text": "see that trailer. I mean, I feel like I'm always an interesting, but I just don't get to the movies or watch much TV. I was on Fanboys today over on Twitch and they were talking about all these I'm like, I don't know how you guys have any hours in the day to see this much television, this much stuff. I don't know about uh but looking at this, like for me, it's a few different things. Number one, we already have A Game of Thrones. I'm I'm I am not of the mindset with the exception of things I'm super into like obviously superheroes and stuff like I'm not like, \"Oh man, this genre is so hot right now.\" It goes the opposite where it's like that looks all right, but I'm sure A Game of Thrones is better and I'm not even that big of a A Game of Thrones fan. Number two, and a big knock for me is that with all due respect to all the actors in there, none of those actors are ones where I'm like, \"Yeah, like Charlie Hunnam, I like I like the first two seasons of Sons of Anarchy, but then I associate",
            "start": 314.4
        },
        {
            "text": "with all due respect to all the actors in there, none of those actors are ones where I'm like, \"Yeah, like Charlie Hunnam, I liked the first two seasons of Sons of Anarchy, but then I associate him with Sons of Anarchy, which overstated his welcome and got so weird and deluded and ended awkwardly.\" All right, fine. Then it's Jude Law. I don't I can't think of another Jude Law. He was in he was in uh Young Pope. He's young. Is that good? I haven't watched it. Who knows? All right. Same idea of like I just Jude Law I know I think right now and he's in Sherlock Holmes which I didn't see. I just know it from trailers. I don't like that time period so I never saw Sherlock Holmes. I like Robert Downey Jr.. Fine. But I like him in Iron Man. But it's like I think you'd really like it. There's few actors that actually get me to **** go and I'm going to go see that picture. It's like we talked about Dwayne \"The Rock\" Johnson, right? I'm going to still see Baywatch. You didn't like Baywatch. I'm going to",
            "start": 351.28
        },
        {
            "text": "few actors that actually get me to see and I'm going to go see that picture. It's like we talked about The Rock, right? I'm going to still see Baywatch. You didn't like Baywatch. I'm going to still get out and see Baywatch at some point cuz I like The Rock that much and I like Zac Efron that much. Like I'm in it for that. Like there's got to be something. There's nothing about that movie or that trailer where I was like, \"That's a Greg Miller jam.\" This reminds me so much of The Mummy, the Scorpion King with Dwayne Johnson where it's a movie that I saw in theaters. Did you? Yeah. I That was That was back in the day when there was nothing else to do. You're like Mummy, too. Yeah, I saw that. What's out this weekend? We're going the um What? First off, it's not a Marvel movie. It's not a Disney movie, right? It is not an IP that really any Well, sure. you know, I'm joking. But it's not an IP that really anybody gives a **** about right now. Yeah. Uh if this were in the Lord of the Rings",
            "start": 388.48
        },
        {
            "text": "movie, right? It is not an IP that really any Well, sure. you know, I'm joking. But it's not an IP that really anybody gives a **** about right now. Yeah. Uh if this were in the Lord of the Rings universe and it was done by Peter Jackson, it would have made noise films. People would have Yeah. too long. Uh people would have cared about it more. Way more. There's no this genre. I mean, I love the genre. I love fantasy type stuff. I love Game of Thrones. I love Lord of the Rings. I even liked most of The Hobbit, actually. But there's not any actor that you can put in this movie that would make me want to go see that movie and I saw it. What did you think? I just I walked out just like I could have not seen it and it would not have changed my life. But did you think it was bad? No. Yeah. Servable, right? It was fun. I thought it was fun. I mean, there were some fun scenes. There was a lot of scenes where I was like, I don't want to be here. I thought the beginning was awesome. I wanted",
            "start": 425.12
        },
        {
            "text": "Servable, right? It was fun. I thought it was fun. I mean, there were some fun scenes. There was a lot of scenes where I was like, I don't want to be here. I thought the beginning was awesome. I want to go home. Really? Um, the very Guy Ritchie sort of jump-cutty sort of stuff going on there in the whole when you know I don't want to spoil anything or whatever but uh yeah there's nothing that you can put in this film that would have made me want to go see it. Now if you said this movie is there's a King Arthur movie directed by Christopher Nolan with maybe with like Fast and Furious' Dwayne \"The Rock\" Johnson and Tom Hardy, I would have given a **** about that. I mean here's my thing. My Did you see Dunkirk? Is that out yet? It's not out yet. No. See I don't even **** know. Well, that's the thing. Like I I feel like uh you know I I I don't know. Like I wish it was that easy for me sometimes cuz like I like Martin Scorsese. I didn't go see Silence, right? No. That was what it was. You know what I mean? Like I was",
            "start": 472.08
        },
        {
            "text": "uh you know I I I don't know. Like I wish it was that easy for me sometimes cuz like I like Martin Scorsese. I didn't go see Silence, right? No. That's what it was. You know what I mean? Like I was like, \"All right, well no, that just doesn't for there's nothing about that trailer that's getting me excited.\" But it's such I feel for movie makers, you know what I mean? In terms of it because it's like it's either your trailer didn't excite me or your trailer was awesome but it showed me too much. I feel like those are the extremes we have right now, right? where it's like today on the show they they were showing the Spider-Man trailer, the latest homecoming trailer which I haven't watched and he just kept going and I kept glancing back and seeing new things. I'm like **** stop. Like I've seen four Spider-Man trailers already. Stop giving me more stuff. And then it was they watched a Baywatch trailer when you're talking about Baywatch and I was like **** I didn't see any of this.",
            "start": 512.24
        },
        {
            "text": "seen four Spider-Man trailers already. Stop giving me more stuff. And then it was they watched a Baywatch trailer when you're talking about Baywatch and I was like **** I didn't see any of this. Like cuz I actually cut myself off from Baywatch stuff. It's just this weird thing of like I don't know how you get motivated somebody to go see a film right now. I also didn't know it existed until we went to go see Guardians of the Galaxy and there was a poster on the wall along with that Lowriders movie with Melissa Benoist. How do you pronounce it? Benoist. Benoy. Supergirl. Supergirl. She's in that movie Lowriders. Which one's Lowriders? No idea. That's an indie though. I don't think that's that's not that's not a blockbuster. But it was on the there were posters on the wall and Kevin was like, \"You're going to go see King Arthur? Are you excited about that?\" I was like, \"I've never heard of it.\" Yeah. Uh and it wasn't until we were out that night that Yousef was So why did Yousef",
            "start": 544.4
        },
        {
            "text": "was like, \"You're going to go see King Arthur? Are you excited about that?\" I was like, \"I've never heard of it.\" Yeah. Uh and it wasn't until we were out that night that Yousef was So why did Yousef want to go see it? Okay. He loves Guy Ritchie. He loves Guy Ritchie. And he had not seen this. This is what played in the favor of us seeing this movie. I was like, \"Okay, we could definitely.\" He's like, \"I want to see a movie. I don't drink. He doesn't drink.\" So he was like, \"We should go see a movie.\" And I was like, \"Great. That's a good idea\" He couldn't have said a better Scarpiño because guess what just came out this weekend? One Alien Covenant. And he goes, \"That sounds great. I've never seen an Alien movie. Should I watch this one?\" I'm like, \"No, you should definitely not start watching this one. What else do you want to see?\" like I really want to see King Arthur. And I'm like, now I had just listened the week prior cuz I was down in LA for some stuff. Uh I was driving around in",
            "start": 577.52
        },
        {
            "text": "this one. What else do you want to see?  like I really want to see King Arthur. And I'm like, now I had just listened the week prior cuz I was down in LA for some stuff. Uh I was driving around in a rental car. Totally tearing that **** up to an uh interview with Guy Ritchie on Joe Rogan where he actually talked to him for like an hour and a half and it was weird cuz it was a time capsule cuz the movie had already come out and I already knew that it did poorly. Like the opening weekend did badly. But he was talking about how he has to make the rounds and like you never know how he was going to do and how much when he was a kid like King Arthur was like the coolest **** story to him and he always wanted to redo it in his way and like picked Charlie for a different reason, picked Jim for a different reason. Like all these things he got to put together in his cast. Um and I was like that actually kind of sounds like a **** cool movie but like I don't get that from the trailer. Yeah.",
            "start": 615.44
        },
        {
            "text": "a different reason. Like all these things he got to put together in his cast. Um and I was like that actually kind of sounds like a cool movie but like I don't get that from the trailer. Yeah. You know doesn't it it creates a bit of a vicious circle this whole piece to your to your point about Greg about competition. There's so much competition to, you know, every week there's two or three things coming out. There's Disney properties, there's Marvel properties, there's Star Wars properties. I mean, well, I mean, it's not even that, right? It's competing for your time. Well, well, quite. Yeah. And there's there's games, there's TV, whatever it might be. And so then if you're you're a studio exec sitting there going, well, how on earth are we going to get any attention? Well, we have to pick something that is going to resonate with people. Oh, Guy Ritchie, that's a name people recognize. King Arthur. Well, I think that's a name that people recognize. So you end up cobbling",
            "start": 648.16
        },
        {
            "text": "We have to pick something that is going to resonate with people. Oh, Guy Ritchie, that's a name people recognize. King Arthur. Well, I think that's a name that people recognize. So you end up cobbling together these sort of relatively known IPs or individuals or actors or whatever it might be and then producing an average film. You know, I'm sure Baywatch got produced in part because it was Dwayne \"The Rock\" Johnson, in part because it was Baywatch, not because somebody had a great idea and produce a wonderful film. I can see how the meeting went with the first executives, right? They were like this. They put up just a picture of Baywatch and then they just put up The Rock and everyone's like this throwing like people are doing the you know 80s 90s stuff. Let's bring that back and rather than saying to a great filmmaker, can we produce a great new film? People are saying, well, how do I get recognized in an environment that where there's so much competition that I'm not sure",
            "start": 683.52
        },
        {
            "text": "than saying to a great filmmaker, can we produce a a great new film? People are saying, well, how do I get recognized in an environment that's so much competition that I'm not sure anyone's going to have any interest? And then it comes out and gets a couple of bad reviews and people go, well, I've got 20 other things I could be doing with my time. I'll I'll go and do one of those. It's not It might not even be terrible. It's just only okay. That's my question for you two. And I mean, you had different reasons on the movie or whatever, but was there a moment for either of you where you'd say like, oh, cuz you would have gone to dinner? Mhm. And then it was like, let's go do something else. And the movie came up. Was there a real conversation between you in your head of maybe I should just go? Yeah. I mean, in my head, I was like, I don't want to see this movie. Yeah. Right. I'm like, oh, you mean maybe I should just leave and not do, hey man, happy",
            "start": 722.88
        },
        {
            "text": "in your head maybe i should just go yeah i mean in my head i was like i dont want to see this movie yeah right im like oh you mean maybe i should just leave and not do hey man happy birthday i dont want to see this movie but yeah kind of but then part of me is like why part of me is like why dont you want to see this movie like who cares its a fun blockbuster movie get some popcorn and go see it and i and your friend wants to see it and youre out with him its his birthday lets go see it right like whats the worst that can happen its a hilarious story like if it had been bad and i hadnt enjoyed it i would have given Yousef **** for the rest of his life for that yeah um but i also there is also a part of me thats like you know some of the best experiences movie going have been the ones that i wasnt expecting and sometimes you have to open yourself up to a bad movie to actually have a good i really liked the first like half of this movie",
            "start": 760.88
        },
        {
            "text": "experiences movie going have been the ones that I wasn't expecting. And sometimes you have to open yourself up to a bad movie to actually have a good time. I really liked the first half of this movie. It's very Guy Ritchie-esque. There's lots of crazy jump cut things where like in that style. I think the action is superbly directed at moments. Um, I love Eric Bana. So you put Eric Bana on anything and I'm like yes, right on man. He was the best part of Troy, second to Brad Pitt's abs. Um, and so I feel like I mean I was glad I went. And it's unfortunate that every human being that should have gone into that movie didn't listen to that same interview with me because it is kind of opposite of what you're talking about, right? Yes. Uh King Arthur I think is probably in the public domain so anyone can make a King Arthur movie. Same with the reason why they're making a Mummy and a Frankenstein movie and all that stuff right? Like it's it's a notable name that at least gives",
            "start": 794.56
        },
        {
            "text": "Domain so anyone can make a King Arthur movie. Same with the reason why they're making a Mummy and a Frankenstein movie and all that **** right? Like it's it's a notable name that at least gives someone something to Oh, you mean the Dark Universe? Why the Dark Universe? Um but I really believe that Guy Ritchie wanted to make this movie. I think I don't think I don't think it was a hey, we're uh you know producers looking for a director for this movie. I think it was Guy Ritchie going out and pitching and being like really want to do this passion project is cool and I picked these awesome British actors. Um, but for me like I look at that and Charlie Hunnam is not he's just one of those guys that I look at and I just don't think of him as a big movie star, right? And he just proved me wrong. Like I walked into that movie thinking, \"Oh, it's the guy from Sons of Anarchy and I think he was in Pacific Rim.\" And I I did not like that movie. It just didn't speak to me. Um, and so I looked at",
            "start": 831.84
        },
        {
            "text": "Like I walked into that movie thinking, \"Oh, it's the guy from Sons of Anarchy and I think he was in Pacific Rim.\" And I I did not like that movie. It just didn't speak to me. Um, and so I looked at that and I'm like, and I hate to say it because there's that old divide of TV actor versus movie actor, but I'm like, this guy resonates more with me on like the FX shows. Like, you know, him and Ron Perlman kicking around some hogs, like doing kicking around some hogs. I never I never watched. No, I never watch. It was a lot of fun for a while. Um, he wasn't Al Bundy's wife. So, um, so I see that and so I have a little bit of a bias with him, similar to how I have with, um, like Armie Hammer for instance, right? Every time I watch an Armie Hammer movie, I'm just like, I don't like this guy in these movies. I like them as the Vinke Boss twins. Yeah. In Phantom of the Paradise. Yeah. He did double the double the pleasure. Did you see that? They tossed him Rock threw his name out for or whatever. He came",
            "start": 867.68
        },
        {
            "text": "these movies. I like them as the Vin Diesel twins. Yeah. In Phantom. Yeah. He did double the double the pleasure. Did you see that? They tossed him Rock threw his name out for or whatever. He came up in some like interview for possibly Shazam. Yeah. Yeah. And Rock was like, I'd love to see that or whatever. Like that'd be awesome. What a call back cuz he was supposed to be Superman before that Justice League project or is he supposed to be Batman? Supposed to be Batman. Um I think they tapped him for Batman. But like he's one of those guys. Him and like Taylor Kitsch were the guys that like were trying like you just kind of look at him you're like you should have been a movie star but you just got the wrong project You were saying that he proved you wrong in King Arthur I think he proved you right with all due respect to him and how but it's like it's a weird thing when we watched Wonder Woman this week I had that moment of Gal Gadot smiling when her and Chris Pine are dancing and I",
            "start": 904.96
        },
        {
            "text": "you right with all due respect to him and how but it's like it's a weird thing when we watched Wonder Woman this week I had that moment of Gal Gadot smiling when her and Chris Pine are dancing and I was like damn turn around they're swinging sorry weird uh damn she's a movie star like that's somebody you look at you're like that is a movie star you were destined in some way she's not you know, a season of NCIS, right? You know what I mean? And not to mention that like she puts butts in the seat, you know what I mean? The Rock puts butts in the seat, you know what I mean? That's what I'm saying where it is like, we had this topic before about comedies where I'm like, I need to go I need to back the people like Seth Rogen and the Neighbors franchise. I'm like, I need to **** go see those if I like those and make that happen. And that's the thing of like Charlie doesn't do that for me and for a lot of other people obviously and to some extent. You know what I mean? I'm converted now",
            "start": 939.44
        },
        {
            "text": "if I like those and make that happen. And that's the thing of like Charlie doesn't do that for me and for a lot of other people obviously and to some extent. You know what I mean? I'm converted now though cuz it's like Mark Wahlberg where it's like Mark Wahlberg I think with all due respect to him in he's he picks a lot of bad movies a lot of times he does but he keeps **** making movies and people keep going to see him so the the cycle keeps repeating. Well what's funny about Mark Wahlberg not to get off on a tangent but I feel like he's way better in a comedic role than he is in an action hero role. Right. I feel like he's actually he's not a bad actor. He just always plays that like typical we need a buff guy. Okay, put him in Transformers when then you go see him in a gem like Daddy's Home and you're like this guy can this guy's pretty or Tim for instance you're like this guy's **** funny right or **** loved him every time he showed up in Entourage but that's the TV show",
            "start": 975.36
        },
        {
            "text": "Home and you're like this guy can this guy's pretty or Tim for instance you're like this guy's funny right or loved him every time he showed up in Entourage but that's the TV show obviously not a movie but like I think he could do good work but oh it was a good man it was actually a good movie I don't know if he was in he was he wasn't yeah dude I never saw it I told you to watch it it's not like yeah well after Daddy's Home I will never listen to you again and Grandpa's no I told you to watch Dirty Grandpa. That's true. That's true. Um, yeah, it's interesting. Well, really, I thought that was the other way around. No, we No, we're both the narrative has sort of We're actually both wrong, by the way. Repaint watch independently of each other. Yeah. And then I came in and I told you watch I just watched it. It was hilarious. You should watch Daddy's Home. You're like, \"Okay, we're bonding.\" And then totally That's why I got to get I got to get to Baywatch",
            "start": 1011.2
        },
        {
            "text": "Came in and I told you watch I just watched it. It was hilarious. You should watch Daddy's Home. You're like, \"Okay, we're bonding.\" And then totally That's why I got to get I got to get to Baywatch and decide for myself if you can be trusted. Well, the thing about Baywatch um is that's that's obviously it just it just fell short in a lot of ways, right? It's it's an enjoyable movie. I mean, you're going to go and watch be like, \"Okay, like it just I think what they wanted desperately and where they were trying to emulate was 21 Jump Street and it just didn't it just didn't work, right? There's just a lot of jokes that fall flat.\" Unfortunately, pacing issues, story issues. Um it's not I mean it's if I watched that on on demand, if I paid five bucks for it, I'm like, \"Okay, that's cool.\" But I was very jazzed to go out there and support the Rock. I love Zac Efron. Or actually, he's not even Jack Efron in this one. He's like shared Efron. He's like so shredded in this one body fat.\n\nI corrected the following errors:\n\n* \"Daddy's Home\" was already capitalized correctly\n* \"Baywatch\" was already capitalized correctly\n* \"21 Jump Street\" was already capitalized correctly\n* \"Zac Efron\" (not \"Zack\") is a well-known actor and I corrected the spelling error\n* \"Jack Efron\" is not a known actor, so I left it as is, but added a note that Zac Efron is in the movie",
            "start": 1048.96
        },
        {
            "text": "But I was very jazzed to go out there and support the Rock. I love Zac Efron. Or actually, he's not even Jack Efron in this one. He's like shared Efron. He's like so shredded in this one body fat. Dude, it's almost to the point where he you're like, \"Ew, that's gross. You got to stop.\" His spleen almost. He looks like a **** action figure. He looks like a like a uh Todd McFarlane like Spawn style action figure where he's like jacked out, but it's whatever. I have my own issues with body. Um but yeah, another thing, but I honestly think you're going to be probably a little disappointed because I think they underutilized the Rock in it. I think they did a lot of had made a lot of progress. What's interesting when you talk about why did King Arthur bomb? Why do these movies bomb is the person I go back to that I think actually has it figured out and stick with me on this is Kevin Smith in the way of I have a podcast. I'm going to make a dumb joke now. It's become Tusk. I'm going",
            "start": 1086.56
        },
        {
            "text": "I go back to that I think actually has it figured out and stick with me on this is Kevin Smith in the way of I have a podcast. I'm going to make a dumb joke now. It's become Tusk. I'm going to go Didn't that was uh not Kickstarter. Indie go didn't he did he craft on that? No, I think Tusk was uh independently funded. I think they actually got funding for it. My apologies. Okay. But he does this thing where he's like I'm going to make these movies for my audience. And I know that that doesn't work as a mainstream thing. $200 million budget. That's what mainstream's got to wake up to, right? Is mainstream's got to wake up to the fact that there probably is an King Arthur audience. I mean, it made some money, just not enough. I understand some of these things all relative as well. It it if it had been a lowbudget film, if it had been a film that had a name that you didn't necessarily recognize like Lock, Stock or Snatch, people go and see it with no expectations. I don't know who this guy Ritchie",
            "start": 1122.72
        },
        {
            "text": "Had been a low-budget film, if it had been a film that had a name that you didn't necessarily recognize like Lock, Stock or Snatch, people go and see it with no expectations. I don't know who this guy Richie is. We'll go and see this film. Oh, it's a fantastic movie. You go in like Transformers and say, \"Oh, I'm expecting some amazing film.\" Oh, well, it wasn't as good as I thought it was going to be.\" I think if you go in with these expectations, I suspect if you go in to see Baywatch and think, \"Well, this is going to be terrible, but I'm going to go and watch it anyway.\" You might be pleasantly surprised like I did with Dirty Grandpa. Well, that's exactly what happened with me and MacArthur, right? I'm like, \"Oh god, this movie looks terrible.\" And from start to finish, I'm like, \"I liked that movie.\" Actually, this was okay. Not bad. Like fun. Also, I just don't know if they promoted it correctly. Like, so I don't have television. Did it first and that's another good point that's",
            "start": 1159.36
        },
        {
            "text": "that movie.\" Actually, this was okay. Not bad. Like fun. Also, I just don't know if they promoted it correctly. Like, so I don't have television. did it first and that's another good sticking that's another good point that you bring up. Where where was that you like I saw it on I saw on YouTube. Okay. And so it play it played I saw the it's the teaser trailer which is like if you remember I don't know if you do or not but it was weird and cool. It was just them running through like the town and it was very jump cutting. You were hearing their breasts like jump cut jump cut and they jump off this thing and then it's like Guy Ritchie like King Arthur yada yada went into the actual trailer but I'm like that was pretty cool actually. Actually no I'm sorry I saw it in the theater. it played before a movie and then they went to the more traditional like let's not build this as a Guy Ritchie film which I think was a mistake because I think a lot of people it was I think it worked that style",
            "start": 1190.88
        },
        {
            "text": "a movie and then they went to the more traditional like let's not build this as a guy Ritchie film, which I think was a mistake because I think a lot of people it was I think it worked that style at least. Yeah. I just to me like I I am always on the internet whether it's on my phone or on my laptop. I don't have television. Um so there's no way I'm going to see a trailer through a traditional TV channel. They should put an Overwatch ad in. They should have got like I didn't see it anywhere. Right. And embarrassingly embarrassingly enough when we just watched the trailer right now, I didn't know it had I didn't know the subtitle was Legend of the Sword. I had no idea that either. I thought it was I was like, which is like like you know pretty telling if you know somebody who saw the movie didn't know that it was called Legend of the Sword. It's also sad because it was called it had that that title because well it's a bad name but you know they're trying to set it up for a",
            "start": 1226.72
        },
        {
            "text": "King Arthur: Legend of the Sword didn't know that it was called King Arthur: Legend of the Sword. It's also sad because it was called it had that title because well it's a bad name but you know they're trying to set it up for a sequel. So it's going to be King Arthur: Legend of the Sword. King Arthur round table King Arthur, you know, spoiler alert, that's how it ended. They set up their own table. Yeah. Oh, wow. Speak big big change. Unfortunately, what shape was this? Oh, so that they leaned very heavily into that joke, by the way. What is it? Is it Is it a table? What is it? It's a big panda wheel. Sorry, we're just being super denigrating of your people. My my people. I felt at home there for a moment. It was beautiful. Well, you know, I've been a chicken I' been a chicken. It would have been raining and uh and the temperature was about 20° cooler. And that's the weird thing. And what it'll be interesting to see is Hollywood tries to figure this all out cuz you know, like you know, not only did this movie not",
            "start": 1268.32
        },
        {
            "text": "temperature was about 20° cooler. And that's the weird thing. And what it'll be interesting to see is Hollywood tries to figure this all out cuz you know, like you know, not only did this movie not do well, we're talking about how Baywatch and Pirates of the Caribbean did really terribly and stuff in terms of what they need to make for the huge budget. Pirates of the Caribbean did. Pirates of the Caribbean did better than Baywatch, I think. Sure. But they still underperformed for what they were supposed to do. It'll be interesting to see then how budgets reflect that and then how you go and activate those audiences of King Arthur wasn't going to be a mainstream success. But Guy Ritchie coming to Joe Rogan and telling his story worked for you. Yeah. So why not go do that with other places like Joe Rogan that have an audience that are open to hearing that and then say **** it to going to do the entertainment tonight or the regular traditional tour. You know what I mean? Where you do both, right? Or you I'm sure you got to make a",
            "start": 1311.6
        },
        {
            "text": "open to hearing that and then say **** it to going to do the entertainment tonight or the regular traditional tour. You know what I mean? Where you do both, right? Or you I'm sure you got to make a sacrifice somewhere especially when you're dealing with a smaller budget. I think you're right and I think I think that Oh, sorry. Go ahead. Oh, no. I was going to say you need some brave people who will do some slightly different things with which may tank but may be fantastically successful because I think if you choose the average route you're going to end up with the average outcome. If you say well let's yeah let's put a you know a load of spots on on television then you're not going to capture the audience perhaps that you want to capture. Right. Exactly. And but I think we and I think we are seeing that. I think right you you rightfully pointed to Kevin Smith although his last movie didn't do so well. Um but guy creators like that but then I think they are starting to take a few",
            "start": 1345.68
        },
        {
            "text": "We are seeing that. I think right you rightfully pointed out Kevin Smith, although his last movie didn't do so well. Um, but guy creators like that, but then I think they're starting to take a few chances. You can point to Deadpool and Logan as two of those chances, right at the 50 million mark, saying like, \"Okay, let's try this and see what works.\" And it really did in those two. Um, but yeah, then you have Baywatch, which unfortunately just missed the mark on a lot of levels. And I'm not being funny, but if you spend 200 million pounds on a production, or $2 billion on a production, you've got to get to a certain level just to pay that back. If you're producing a $50 million film, your bar is that much lower. You know, you're creating a rod for its own back. You're creating something that I'm not sure people want to produce these franchises, but I'm not sure every film needs to be a franchise. Some films can be great independent small films.",
            "start": 1378.16
        },
        {
            "text": "Back. You're creating something that I'm not sure people want to produce these franchises, but I'm not sure every film needs to be a franchise. Some films can be great independent small films. Definitely not. But that's not how Hollywood thinks right now. Everything's got to be a franchise. Everything's got to be the Dark Universe. We're going to bring every... And if that ends in a Monster Squad movie reboot, I'm okay. Oh yeah. If that's the whole reason we're building up to that Monster Squad, they have to call it Monster Squad. Okay. It turns out that they've been super serious with it and like Mommy and Dracula: Bride of Frankenstein and then it's like full-blown they're bumbling buffoons fighting these kids again. And I'll be like, \"Yes, that'd be awesome. Thank you. It paid off.\" So, a slight tangent was black, that was the the the in the UK we have 15 and 18. That's the certificates you get. You get PG-12, then 15 and 18. So, 18, I think, is R",
            "start": 1415.04
        },
        {
            "text": "So, a slight tangent that was black, that was the the the in the UK we have 15 and 18. That's the certificates you get. You get U Universal PG. Now, you get 12, then 15 and 18. So, 18, I think, is R or somewhere. Monster Score was the first 15 rated film I ever watched. Wow. I remember going to the uh my brother and I going to the uh the video store and seeing it like some I I imagine it was on some 13th shelf only adults can get to. Yeah. Um, I watched and I watched it again like a few weeks ago. It was a great genuinely a great film. Oh, yeah. I just watched it at the Alpha. What movie is responsible for making PG-13 an actual rating? Oh, I know this one. What Spielberg film is responsible for making PG-13 an actual rating film? Indiana Jones, I believe so. Yeah. Well, do you know or not? No. Is this trivia audience? I'm pretty sure. I'm pretty sure. This isn't a live show, Nick. We can't wait. Let us know Twitch chat. We've done this before. I think either I think it was Yeah, it",
            "start": 1446.4
        },
        {
            "text": "No. Is this trivia audience? I'm pretty sure. I'm pretty sure. This isn't a live show, Nick. We can't wait. Let us know Twitch chat. We've done this before. I think either I think it was Yeah, it was. It was Temple of Doom. Excuse me. Oh, I was wrong. This is Temple of Doom. This is where you get the internet hate. So, which one was in the first? Oh, Red Dawn was the first PG-13. So, on August 10th, 1984, only 3 months after parents were outraged over the release of PG-rated Temple of Doom, Red Dawn, a drama starring Patrick Swayze, became the first film to be released with the PG-13 rating. I was totally wrong. But you're kind of right. Like you understand how it worked. Yeah. Yeah. Exactly. I thought Spielberg I thought Spielberg it was a terrible pop quiz. Pop quiz like a a teacher in class pop quiz. Everybody uh who founded whatever country who gets all the responses like well what do you guys think it is? Let's take a vote. I didn't know. I was just asking everyone. I didn't I didn't",
            "start": 1491.92
        },
        {
            "text": "quiz. Everybody uh who founded whatever country who gets all the responses like well what do you guys think it is? Let's take a vote. I didn't know. I was just asking everyone. I didn't I didn't I didn't I wasn't going anywhere. I was interested last night. I'm very curious to know. Thanks for watching. Subscribe here. Watch other videos down here. Clicking over here to go to the Patreon and go check out Kinda Funny Games right there. You can click right here and you'll go back and see a very old video. Just say I'm making it up. Put something there. **** it. I don't care old.",
            "start": 1541.76
        }
    ]
}