{
    "id": 2730,
    "video_id": "ZrXc6_3zyzc",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Gil (Nintendo)"
    ],
    "title": "Let's Play Super Mario Odyssey - Kinda Funny Plays",
    "description": "Tim and Greg got to play Super Mario Odyssey at E3 2017!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1497488213,
    "duration": 649,
    "transcript_chunks": [
        {
            "text": "what's up guys welcome to Kinda Funny Games we're here at E3 2017 we're at Nintendo I'm very excited about this I'm Tim Gettys this is my buddy Gil we're about to play Super Mario Odyssey what we're going to do is we're only allowed to have 10 minutes of gameplay there's two levels we're going to do 5 minutes in Sand Kingdom and then 5 minutes of Metro Kingdom we'll see where I get I probably won't beat the game but we'll see let's go give a try Sand Kingdom let's go all right as soon as I see Kingdom I'm doing it I'm doing it oh that's good all right so we're going into to uh the first of the two kingdoms that we have here on the demo today at E3 it's the Sand Kingdom um you're actually straight ahead of you you can see the town of Tost Arena it's a nice little town um here though in this Kingdom there's going to be a lot of uh platforming elements try to get from point A to point B you know stuff like that um but as Mario here as you can see he's cold uh so you can see there's lots",
            "start": 0.08
        },
        {
            "text": "Kingdom there's going to be a lot of uh platforming elements try to get from point A to point B you know stuff like that um but as Mario here as you can see he's cold uh so you can see there's lots of ice even the fountain is Frozen that's one of the Mysteries you're going to try and uh solve for the for the King in the Sand Kingdom and you Mario can do all sorts of cool stuff love it yeah climbing poles he has some new moves uh to go along with it well particularly uh the obvious is Cappy uh his new buddy that helps him out you can throw Cappy by pressing uh the Y button there yep and you can even throw Cappy in different directions so if you were yeah there you go as you can take out enemies you can use them as a platform so yeah so if if I hold it then it stays out there and I can jump off there you go and you can make you can make longer jumps Mario has some of his uh Advanced jumps that you remember like triple jump y um but he does have one brand new move um and he can",
            "start": 39.96
        },
        {
            "text": "can jump off there you go and you can make you can make longer jumps Mario has some of his uh Advanced jumps that you remember like triple jump y um but he does have one brand new move um and he can actually roll so if you press ZR for me and then there you go there you go so intuitive all right so something interesting that we talked about a second ago is the checkpoint I just got yep normally in a 2D Mario games you get the checkpoint and it's usually once per level never before in one of the open World sandbox Mario games we have that what's that for so uh it serves two purposes uh number one well if you die end up back at one of the checkpoints the last one you were at but more importantly you can actually uh press the minus button and go into a map know open up kind of like a visitors pamphlet of the uh of the Kingdom that you're in and then you can actually work your way to that checkpoint so if you want to get back to the Odyssey real quick which is Mario's ship that takes him from",
            "start": 83.76
        },
        {
            "text": "\"Pamphlet of the uh of the Kingdom that you're in and then you can actually work your way back to that checkpoint, so if you want to get back to the Odyssey real quick, which is Mario's ship that takes him from kingdom to kingdom. So, is that like the hub? Is there a hub world in this? Or yeah, The Odyssey acts as Mario's hub. Um, you can actually change his costumes, uh, like his hats and his outfits. And there you go, he just did one of the capture moves using Cappy. Oh god, oh you got hit down for a second. So I just throw it at him, yeah, there you go. And now your Bullet Bill mustache and all boom see. But I I can't go up though? Correct. And you can only do it for a limited amount of time, so you try to figure out ways you can make use of him here. Oh, there we go. Oh nice, good old Mario 64 spin. I love that. Love it. Little tricky platform in here, yeah got some of the plumes of sand here jump across didn't think I was going to make it did you? I did all right. So this is one of the really cool features.\"",
            "start": 127.28
        },
        {
            "text": "love it, little tricky platform in here, yeah, got the some of the plumes of sand here, jump across, didn't think I was going to make it, did you? I did all right. So this is one of the really cool features of Super Mario Odyssey - these murals you're going to find these murals and you can actually jump into them and it becomes classic. I saw him in a sombrero when he went in here. Where do I get my sombrero? So you can change your costumes at one of two places back on the Odyssey or you can go visit the Crazy Cap store and you can purchase new outfits and caps. Or uh, we actually in this demo, we actually provided you with some costumes. Can I change? Yeah, you can totally do that. Actually bring up the map again by hitting minus and then you you can actually pull it down and go back to the Odyssey if you want. There you go. Just press a... We'll head up. Boom! I'm getting some brood up ladies and gentlemen, let's go. So if you want the Serena outfit we're going to actually have to purchase it but if you",
            "start": 177.28
        },
        {
            "text": "\"Want there you go, just press A. We'll head up, boom! I'm getting some bro'd up ladies and gentlemen, let's go. So if you want to get the Serena outfit, we're going to actually have to purchase it, but if you throw Cappy into the door, go ahead on in real fast. There's a closet to your right; open it up, just press the 'A' button really quickly. And so we got the Explorer hat and suit. So I need to wear where do I buy it then? So go ahead and step out, and then uh, you'll go straight ahead and you'll see the shop to your left - okay, can't miss it. See head there you go right into the town, and you see the Crazy Cap store right there, where that door is. Roll over there, y'look at that! Okay, all right. So go ahead and talk to that guy; get my sombrero, yes, is what I wanted. Very excited about this - yeah, not at all. All right, you're practicing, and there you go, Mario in a sombrero. Big fan of it, so what does the sombrero do? So the sombrero really doesn't gain any abilities with it; you don't... you don't have anything new, uh, other than it looks\"",
            "start": 229.44
        },
        {
            "text": "and there you go Mario and a sombrero fan big so what does the Sombrero do so the Sombrero really don't gain any abilities with it you don't you don't have anything new uh other than it looks pretty cool however there's uh one part of town that's exclusive and you have to dress the part like the Donkey Kong so you would I would suggest if you try to get more C coins you can get the rest of the outfit and you can go into that area okay okay he's still cold this is the first level let's take a look at the second one we're back second level which one was this called so we are in the Metro Kingdom okay uh and is that my girl Pauline it is totally Pauline mayor Pauline thank you very much mayor Pauline she's moving up in this world okay taking charge so uh we're we're now in the city of New Donk City um you you'll recognize on a lot of signs even the uh the like the street signs and everything a lot of references to the Donkey Kong franchise um and of course Pauline who uh mayor Pauline who's in",
            "start": 295.92
        },
        {
            "text": "\"Um, you'll recognize a lot of signs even the uh like the street signs and everything a lot of references to the Donkey Kong franchise um and of course Pauline who uh Mayor Pauline who's in charge things she's the goal uh right now so you can go talk to her and she might have a she'll have a task for you got it okay but New Don City has lots to explore there are tall buildings uh hidden places you can go underground inside buildings outside where'd she go so go ahead and go over to that power point right there go and throw Cappy into that and there you go you become a Bullet as you travel through the wire all right there's so much to do here in New Don City so I'm just going to let you go and jump rope oh little challenges here let's see how long you can do it we're going to go faster all right all right this reminds me of Tiny Toon Adventures on uh the Super Nintendo oh wow is there an end to this there's there's something all right nicely done Miss what do you mean I missed I\"",
            "start": 344.56
        },
        {
            "text": "all right all right this reminds me of Super Mario World Adventures on the Super Nintendo oh wow is there an end to this there's there's something all right nicely done Miss what do you mean I missed I just got a moon I'm a jump rope buo so what's up with the the dates uh well that's a great question honestly I don't know um but it'll uh what you want to do is collect those moons are going to be important because the moons help power The Odyssey which is going to help Mario chase down Bowser uh and his baddies uh from uh making this wedding happen between him and Princess Peach probably so yeah so that'll that'll help that moon power we'll get the Odyssey from Kingdom to Kingdom got it I don't know how much you can talk about this but how many uh kingdoms are there uh unfortunately we're not talking about that today we are showing two and they're both very distinct hi all right so Mayor Pauline so she wants to hold a festival so she needs some band members okay well got one",
            "start": 399.12
        },
        {
            "text": "we're not talking about that today we are showing two and they're both very distinct hi all right so Mayor Pauline so she wants to hold a festival so she needs some band members okay well got one surprisingly there's a drummer right next to the building here at City Hall I love this all right and guess what moon look at that Two Moons down so Cappy is his name yes that's Cappy and that's a kind of like his natural form oh W oh this is pretty cool actually if you just watch the watch the band or you can talk to Poé (corrected from \"poen\") real quick here so she needs three more just hang out right just for a second just watch the oh he's going to go on stage you there we go get it Mario get it oh E3 spin let's do this all right he has way too much fun got to go find the other musicians yep can I find them in the next two minutes find out right here on Kinda Funny Games what's going on here got got some speedrun action going on here all right so I can definitely tell you where one of those band members I'm",
            "start": 457.24
        },
        {
            "text": "next two minutes find out right here on Kinda Funny Games what's going on here got got some speedrun action going on here all right so I can definitely tell you where one of those band members I'm going to give you a good hint one of them is on the roof of a building so you're going to want to make yourself uh find some high high ground so you possibly spot them lamppost is kind of high I yeah yeah so how about this um look around for like one of those power lines that you saw earlier let's see how about this hang a left head straight for the building head straight for the City Hall building oh nice oh look at that so go around the back side of the building there you go and then keep going he wants to find stuff and then hang right you know all the secrets yep actually I want you to meet a friend that you probably haven't seen in a little while where's he at look along the road oh my God it's my boy Captain Toad yes yes Captain Toad makes an appearance is there he is don't okay okay",
            "start": 513.36
        },
        {
            "text": "a friend that you probably haven't seen in a little while where's he at look along the road oh my God it's my boy Captain Toad yes yes Captain Toad makes an appearance is there he is don't okay okay see now I'm captain Mario I got my Odyssey we got to go out there get those moons and guess what you got a moon for you man okay okay how you doing Captain Toad I love it I so does he have other appearances are you finding him all over the place or just right now that's the only place you can spot him in the demo okay so there's a power line right there you can throw Cappy into that there you go let's go okay so we're going up high there's actually um another power line that was right next to it but you found some Kingdom coins that's good maybe you can complete that uh set that you had earlier it looks like I did not complete the challenge of finding all the musicians we'll have to do that later in October when this game comes out yeah October 26th you you did find that Captain Toad",
            "start": 573.88
        },
        {
            "text": "it looks like I didn't complete the challenge of finding all the musicians we'll have to do that later in October when this game comes out yeah October 26th, 27th you you did find that Captain Toad is in this confirming Captain Toad coming to the Switch no that's not true hopefully though",
            "start": 630.4
        }
    ]
}