{
    "id": 27,
    "video_id": "-GqpjWVN-N4",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Changing Republicans: A Conversation with Colin",
    "description": "Colin loves being a Republican. Find out why and how he wants to change the party from the inside. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Sean for filming. \n\nSpecial thanks to Patxi's Pizza for feeding us while filming. Next time you're in San Francisco, eat at Patxi's -- http://patxispizza.com/.",
    "published_at": 1351623610,
    "duration": 796,
    "transcript_chunks": [
        {
            "text": "So if a gay man wants to marry another gay man or a woman wants to marry another woman or whatever like who the **** cares what's up everybody Welcome to A Conversation With Colin I'm Greg and this is my roommate Colin now sometimes Colin says crazy stuff so every Tuesday and Thursday I reach into my random topic pile pull one out throw it at Colin we have a conversation about it if you like that like the video then subscribe to us here and leave some comments below why not we'll all have some fun Colin are you ready yes today's topic of conversation is Republicans oh now this is this this is you you're a republican you're a card carrying Republican I am you're very open about this you're very political what is going on with the Republican Party nowadays give me the stance to 2012 we're coming into an election what's the state of the Republican Party take the PO it's not very good I mean um so in the 90s in the mid-90s there was something called PAC and it was a policy",
            "start": 0.04
        },
        {
            "text": "we're coming into an election, what's the state of the Republican Party? Take the P.O. it's not very good, I mean um so in the 90s in the mid-90s there was something called the Project for a New American Century and it was a policy for a New American Century and it was the origins of the neoconservative movement that took over the Republican Party towards the end of Clinton's Administration and then basically the Bush Administration and what PNAC said was um you know it was basically almost an imperialist Mantra of um American Empire basically that we would kind of have um many eggs in many baskets and kind of be policing the world and doing our thing or whatever which you kind of saw play out during the Iraq War um with people that were signatories on the PNAC um that were in the Bush Administration such as Donald Rumsfeld and Dick Cheney why I tell you that story is because PNAC turned the Republican Party into something that it wasn't and what we're dealing with now are kind of the repercussions of PNAC",
            "start": 37.64
        },
        {
            "text": "Rumsfeld and Dick Cheney why I tell you that story is because Pat Buchanan turned the Republican Party into something that it wasn't and what we're dealing with now are kind of the repercussions of Pat Buchanan and the failure of neoconservatism which is a failure that I welcome because I think neoconservatism is scary um and so in 2008 we got our clocks cleaned and we deserved it it really started in 2006 with the midterm elections um in which we lost control of the House and the Senate um and then it carried over in 2008 when Obama beat McCain um and then it kind of stopped in 2010 in the midterm elections in which the Republicans had a historic victory over the Democrats who were failing in every aspect of governing and now here we are a few weeks before um the election now and we have a Republican party that somewhat mirrors more what I like but still does a lot of stuff that I don't so that's where we stand right now okay so a lot of stuff there about foreign policy and everything",
            "start": 86.04
        },
        {
            "text": "Republican party that somewhat mirrors more what I like, but still does a lot of stuff that I don't, so that's where we stand right now. Okay, so a lot of stuff there about foreign policy and everything. Where do I boil down to hating the gays so much? Why do we have to hate the gays so much? We don't have to hate the gays. I mean, I, I, I, I don't hate gay people; I don't hate anyone. Um, I, I'll say this: this is a complicated thing. I feel like this conversation is going to go on for a little while, it should, and I mean, I'm leading you somewhere with that right? The fact that you don't hate gay people there, I think Republicans to a lot of people is a dirty word nowadays because it's so veered off on this track of well, yeah, I'm Republican; that means I'm for a responsible government about money and then not having gay marriage ruin my world. Yeah, I mean, I think where do I begin? You know, like there are Republicans I would say, I mean, this isn't scientific, this isn't scientific data, but I would say",
            "start": 126.92
        },
        {
            "text": "not having gay marriage ruin my world yeah I mean I think where do I begin you know like there are Republicans I would say I mean this isn't scientific this isn't scientific data but I would say a third of Republicans support gay marriage um but there are different kinds of Republicans just like there are different kinds of Democrats and there are different kinds of conservatives just like there are different kinds of liberals and moderates and Centrists and stuff like that and it depends on what issues are important to you and just like any political party the Republican party is a um an amalgamation of different sects of conservatives and I'm a fiscal conservative um I'm not a social conservative and there are a lot of people like me now people would kind of call me more of a Libertarian leaning Republican and I am um but then there are social conservatives religious conservatives um Midwestern mostly conservatives that um religion plays a big factor uh biblical law as it were",
            "start": 164.16
        },
        {
            "text": "leaning Republican and I am um but then there are social conservatives religious conservatives um Midwestern mostly conservatives that um religion plays a big factor uh biblical law as it were plays a big role in their politics um these are the people that are very vocal um in Republican policy and in order to win any election just like the Democrats must take the crazies from Occupy with the moderate DINOs from the center and like like Democrat in name only or Rhino is Republican in name only got thank you people that are somewhat somewhat in the Middle where they're not really Republicans not really Democrats in other words people from all both strata different echelons you put them together and you win elections so to me I've kind of put my eggs into the basket with the social conservatives in order to get the fiscal policy that I want that's just the name of the game politically but that doesn't mean that I really feel that way and unlike a lot of people that are Republicans",
            "start": 204.36
        },
        {
            "text": "In order to get the fiscal policy that I want, that's just the name of the game politically. But that doesn't mean that I really feel that way. And unlike a lot of people who are Republicans or a lot of people who look at Republicans and want to kind of spin into a third party, like the Libertarians or the Tea Partiers, um, do their own thing. I think the way to get what we want, the way to get where we need to go rather is to change it from the inside. And that's what I'm trying to do. Because like any political party, they're malleable and they change over time somewhat, yeah, not much but somewhat. And if we can drive social conservatism out of the Party, Republicans win every single election from that point forward. This is what we talk about right? I like to consider myself an independent, so like I watch the debates and I listen to it, and like Romney and the Republicans make",
            "start": 248.64
        },
        {
            "text": "Changing Republicans: A Conversation with Colin\nelection from that point forward this is what we talk about right is I like to consider myself an independent so like I watch the debates and I listen to it and like Romney and the Republicans make a lot of great financial points and then we have to get hung up on abortion or something else and that's what for me I have to try to weigh where I want to go you know what I mean like that's that's hard I think for voters then to get a grasp and especially as **** up as the two-party system is you know what I mean that it seems like you have to pick a side and then you have to hate somebody else that we get into this closed dialogue where we have in Wisconsin Senators you know walking off the floor running leaving the state yeah that was that was just embarrassing yeah um and they they you know they paid obviously at The Ballot Box even though they didn't think they would which was quite funny um to me you know I look at it two different ways I think that there's a lot of hyperbole from",
            "start": 287.76
        },
        {
            "text": "they paid obviously at The Ballot Box even though they didn't think they would which was quite funny um to me you know I look at it two different ways I think that there's a lot of hyperbole from the liberal side about Republicans that they hate women that they hate gay people I don't think that that's really true I don't think that like a normal Republican who is against gay marriage hates gay people I don't think that that's true um I think that that's true sometimes just like there are probably some racists some sexists some bigots I mean like sure on both sides oh yeah um but I don't think that that's necessarily true I I implore people to you know I know people that are against gay marriage I know people in my family that are against gay marriage I know people friends that you know um my friends family some of them that are against gay marriage but they're not against gay people they just look at the at marriage as something um that's sacred between a man and a woman",
            "start": 319.92
        },
        {
            "text": "know um my friends family some of them that are against gay marriage but they're not against gay people they just look at the at marriage as something um that's sacred between a man and a woman and I respect that but I don't agree with that also I don't think the government should be in the business of even legislating on marriage doesn't make any sense um the same thing with women's rights issues I don't Republicans are not against women I mean that's such a silly line that's a that's a talking point Republicans are against paying for things like contraceptives for women um they're against uh funding Planned Parenthood when our government is spending too much money those things I can actually kind of relate to I think these are silly talking points that really mean nothing at all um so you know in that sense I understand where people are coming from but I also don't with the gay marriage issue I'm I'm totally I'm totally a Democrat as far as as far as uh gay marriage is concerned",
            "start": 357.96
        },
        {
            "text": "you know in that sense I understand where people are coming from but I also don't with the gay marriage issue I'm I'm totally I'm totally a Democrat as far as as far as uh gay marriage is concerned although I think it's kind of funny too I mean Barack Obama was against gay marriage until three months ago but now everyone suddenly acting like Barack Obama is this great champion of gay marriage it's totally absurd but regardless um I agree with you the social issues need to be kind of cast out of the Republican party I agree with the other part of the Republican platform I agree with the foreign policy of the Republican platform for the most part not the neoconservative platform but the but the platform that says a powerful military is the best um is the best diversion you can have I guess against uh any conflict that if you are so powerful that no one will take you on I actually 100% agree with that and believe that that's true um and so I agree with the",
            "start": 393.44
        },
        {
            "text": "I guess against uh any conflict that if you're so powerful, no one will take you on. I actually 100% agree with that and believe that's true. Um, and so I agree with the foreign policy, I agree with the fiscal aspect of things. Um, but I want a more libertarian slant towards people's rights brought through the Republican party. And I'm in it for ten years now, and there are millions of us who want to change the Republican party from the inside. We're hoping to do that, but right now it's a slow process, it's a glacial process. But I'm very proud to be a Republican, don't get me wrong. You know, and I think that that's not true. I wasn't mixing it up, bro. I mean, like I think a lot of people do, they're like you should be ashamed, I'm not ashamed at all. Like, I'm proud of the history of my party, and I'm proud of what we've done in many respects as a party. And just like any political party or movement, there are scars and bad people in it, and people that you don't",
            "start": 428.52
        },
        {
            "text": "of my party and I'm proud of what we've done in many respects um as a as a Republican Party um and just like any political party or any movement there are scars and bad people in it and people that you don't want to associate with but there are great people in the Republican Party um I think that they mean well and and I think uh you know as long as we can get these social issues these backwards social issues that hurt us with women they hurt us with some minority groups they hurt us with gay people I think that um I think that there are plenty of fiscally conservative gay people that would love to be Republicans but they feel like the party platform hates them do you think this is something that ages out of the party I mean is older people who aren't you know weren't raised in an environment where you could be openly gay or weren't raised around my you know I me all these little things people get hung up on they turn into giant issues as our generation comes up",
            "start": 461.44
        },
        {
            "text": "Where you could be openly gay or weren't raised around my, you know, I mean all these little things people get hung up on; they turn into giant issues as you know our generation comes up. Is that what changes it? Yeah, I think so. I mean, I was a huge Ron Paul fan in 2008, but I'm not really in the Ron Paul movement anymore because I kind of feel like he couldn't really articulate his stance well enough. He's really old now; well, he is. But I also feel like he could have easily been the standard-bearer of the party if he was just able to articulate his position better, which he wasn't. And that was kind of disappointing to me. But I think his movement, the libertarian movement, the Ron Paul Revolution as it's going to be called in the history books – and it's already called – has brought in a lot of young people into the party; um, in their teens and their well now they're in their 20s and their 30s. People that didn't pay attention to politics before; people that understand sound.",
            "start": 499.92
        },
        {
            "text": "in a lot of young people into the party, um, in their teens and their well now they're in their 20s and their 30s, people that didn't pay attention to politics before, people that understand sound fiscal policy, um but are against American adventurism and imperialism, um and are also for personal liberties, because as far as I'm concerned things like, um you know moderate drugs should probably be legal, prostitution should certainly be legal, um you know things that don't hurt anyone. My whole mantra is if you're not hurting anyone, you know do onto others, you know what I mean, um to each his own Live and Let Live and I really believe in that so if a gay man wants to marry another gay man or a woman wants to marry another woman or whatever like who the **** cares if we have another family that can support a child and you know and raise children even if they adopt them or have to adopt them that's great that's important that's good stuff it doesn't mean you can't",
            "start": 531.16
        },
        {
            "text": "\"Have another family that can support a child and you know, raise children even if they adopt them - that's great, that's important. That doesn't mean you can't have it come from a loving family, in which you know you come from a lesbian family or a family of gay men. That's silly. I don't like that kind of stuff. Um, and I want to exercise that from the party platform. But it's frustrating that we have to talk about these things all the time; they always come up. It is a problem - it's the Achilles' heel of the party. Yeah, um, and I hope it changes. Like I said, Republicans can fix this problem, and I hope they do because like I said, the history of the party is a proud history. We can continue... Republicans, you know, here's one of the great myths, Greg - yeah, is that Republicans and Democrats switch places at some point? This is the great myth in American\"",
            "start": 571.12
        },
        {
            "text": "History and we can continue, you know. Republicans, you know. Here's one of the great myths, Greg, yeah. Is that um Republicans and Democrats switch places at some point? This is the great myth in American politics. Yeah, and Republicans are Democrats now and Democrats are Republicans. This is this is one of the great myths that at some point the party shifted and somewhat they did but somewhat they didn't. Um, and you know as far as I'm concerned our our party's history of Republicans freeing the slaves, Republicans fighting Jim Crow, Republicans fighting the wars that were being waged by Democrats like Woodrow Wilson and FDR, although World War II of course was pretty righteous. I mean we we should have fought that war. Um, Democrats um extending uh travesties like the Great Depression like FDR did um with all his governmental policies um the Democratic Dixiecrat governors in the 40s 50s and 60s that were trying to segregate schools uh you know those were Democrats, the Republicans.",
            "start": 611.56
        },
        {
            "text": "FDR did um with all his governmental policies um the Democratic uh Democrat governors in the 40s, 50s, and 60s that were trying to segregate schools uh you know those were Democrats, the Republicans were the ones that wanted to uh integrate the schools Eisenhower, a Republican, sent the military in to do that um you know so so there's the example right of them switching it at least for popular opinion right yeah I mean but but it's all perception you know what I mean because I guess what I'm saying is you know Korea started by the Korean War started by a Democrat you know ended by a Republican Vietnam started by a Democrat ended by a Republican like you know there's a proud history of being on the right side of history with the Republican party and they must continue this because we're going to be on the wrong side of history with what's going on with you know um immigration with uh gay rights um and all these things that are really important to people and I understand why",
            "start": 657.56
        },
        {
            "text": "We're going to be on the wrong side of history with what's going on with you know um immigration with uh gay rights um and all these things that are really important to people and I understand why they're important they're not as important as the economy and jobs and things of this nature but I so I guess what I'm saying is that you know I'm proud of my party I'm proud of what we've done um and I think we need to take hold of our history remember where we've been and the things we fought for that being a true conservative is fighting for equality that being a true conservative is accepting that people are different but accepting them into our society into our family um that being a republican is leaving other people alone to make their own decisions that is being a republican you know and setting that to the other side is a **** shame and I hope that we are able to rectify that in the past because we are the party of Abraham Lincoln you know we are the party of Ulysses S. Grant We're",
            "start": 701.12
        },
        {
            "text": "Seeding that to the other side is a shame, and I hope that we are able to rectify that. In the past, because we are the party of Abraham Lincoln. You know, we're the party of Ulysses S. Grant. We're the Party of Teddy Roosevelt. You know. We're the party of Eisenhower. We're the party of Great Men who did great things, and we shouldn't lose sight of that. Because we lost our way and were sent into the wilderness for a while during the Bush era, and we deserved it. But now we have a chance again. So let's take it. Let's take advantage of it. Let's change things and change. Let's keep most of the party platform intact, and I think we're going to be fine. I think the Republicans have a bright future. Okay, interesting stuff. I hope they lose this election because I bet a pizza on it with you. Uh, ladies and gentlemen, what do you think? Sound off in the comments below. Let us know. Subscribe, subscribe, like, share the video with your friends. It means a lot to us. Uh, every Tuesday and Thursday we will be back with.",
            "start": 740.32
        },
        {
            "text": "gentlemen what do you think sound off in the comments below let us know sub subscribe like share the video with your friends it means a lot to us uh every Tuesday and Thursday we will be back with another random topic of conversation from the pile until then I hope you have a conversational day I mean I wouldn't use California as an example just because California is a complete disaster",
            "start": 775.4
        }
    ]
}