{
    "id": 2587,
    "video_id": "fAMWwrHFo2c",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Is Competition Good? - The GameOverGreggy Show Ep. 177 (Pt. 4)",
    "description": "We discuss competition vs collaboration.\n\nThanks to Pro Flowers for sponsoring this episode. Go to http://www.proflowers.com and use promo code greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1493276402,
    "duration": 1476,
    "transcript_chunks": [
        {
            "text": "you know who I love? My mom. You know what my mom loves? Flowers. Mother's Day is right around the corner, so let old gruesome Greggy help you out. Visit our advertiser, Proflowers.com right now and get your mom some flowers. 100 blooms for $1,199.99. Actually, don't do that thing where you put it off. Mother's Day will be here before you know it, and then you're just going to screw it up if you wait. How do I know? I used to do the same thing all the time, man. You say you'll do it later, then bam, it's Mother's Day. You have a cheese pizza. 100 plow that could have been solved with 100 blooms. You get me, Kevin? You let her down, you cheese pizza eater, Kevin. You let her down and now she's got a tattoo that says she hates you. The only way to stop that horrible future and get 100 blooms for your mother with a free glass vase is starting on 1999 is by visiting Proflowers.com. Use the code Greggy. That's Proflowers.com code Greggy when you click on the little microphone order today or you will be a cheese pizza",
            "start": 0.12
        },
        {
            "text": "glass vase is starting on 1999 is by visiting Proflowers.com. Use the code Greggy. That's Proflowers.com code Greggy when you click on the little microphone order today or you will be a cheese pizza eating disappointment to your mother, you piece of garbage. I feel like this is starting to move into the topic of your topic. Yeah, this is actually um so we'll Segway over that. Good segue, Greg. Thanks. Well, when you call it out then it's just awkward. I the Segway is off the rail. Hair's looking on point. Great looking on point. Um yeah, this is something that I that I've been wanting to bring up for a while and it's it's actually awesome we have you here. Uh there's the old adage that uh competition breeds excellence, right? Um and I think that you can obviously you can make a strong case of that. I've never been a competitive person, right? I've always believed that collaboration breeds excellence and that competition is something that gets in the way of collaboration and creativity um and maybe",
            "start": 42.56
        },
        {
            "text": "never been a competitive person, right? I've always believed that collaboration breeds excellence and that competition is something that gets in the way of collaboration and creativity um and maybe I'm wrong, but I wanted to hear your guys's opinions on this because I've never been fiercely competitive. I've always gravitated toward teams, team efforts like marching band and theater where like in high school when you do theater it's not like we're going to like when I we're like we yeah we're going to do a better production of **** Little Shop of Horrors than than potle, you know, our our rival high school. We didn't do that, right? You didn't care, but you do compete for the part. You do compete for the part, but you know you audition for the part, which is a a level of competition, but it's a necessarily evil toward anything. No, I know I'm I'm saying I mean for me being in high school and going out for plays I remember that freshman year uh not getting the part of whoever it was into Jillian on",
            "start": 96.76
        },
        {
            "text": "evil toward anything. No, I know I'm I'm saying I mean for me being in high school and going out for plays I remember that freshman year uh not getting the part of whoever it was into Jillian on her 37th birthday, but Ben Gray did and like **** Ben Gray. No, that was the thing is I didn't Harbor resentment for it, right? Like okay that sucks that I didn't get it, but you're great at it so whatever and it was like you're saying more of a aborative effort of me I think I was under studies or whatever so like you're still making this play together you're still doing this I didn't get hung up on the competition as the difference between yes you're right there is a competition I hated that part though I didn't like the part I didn't like that needing to um to to feel like there was someone else that was that was trying to take me down yeah to drive me to be better does that make sense yeah and unfortunately and and that's where that's that's where I still struggle with this today which is I",
            "start": 129.2
        },
        {
            "text": "that was that was trying to take me down yeah to drive me to be better does that make sense yeah and unfortunately and and that's where that's that's where I still struggle with this today which is I don't like using competition as an excuse to be that guy that has to be number one, right? Like and that's what drives me because I'm not driven by that. I'm driven by Tim and I had a great conversation earlier today where we're were talking about rap rap videos that we want to do and it was hilarious and I'm like dude this is what gets me up in the morning, right? It's not about us making something better than Little Dicky. It's not because a we can't and B I don't I love his art and I'm just inspired by that and I want to go do my art. Um so yeah I mean like I hate that's why I never really wanted to pursue acting as a career cuz I hated the concept of being like I have to get up today and work out because I to be better than the other 50 Miis that are going to go to this audition I was like I",
            "start": 166.04
        },
        {
            "text": "to pursue acting as a career cuz I hated the concept of being like I have to get up today and work out because I to be better than the other 50 Miis that are going to go to this audition I was like I don't well I'm with you I mean that's I've always said that I always thought like I have a testosterone deficiency right cuz like that's the whole Port of sports that turned me off right in in gym class when you're running around and they're making you play stuff it was fun and fun and fun until those c a couple **** **** were super into it and then like I miss a frisbee or whatever and they **** flip out and it's like well now I don't care at all you miss the Frisbee yeah I know right that Ultimate Game you know what I mean fun it's fun until some **** takes it way too some **** at the softball game that's like I you know I should have been a pro yeah exactly so you know and then uh we so we live in capitalism right y it's all about competition how's the planet doing because of",
            "start": 204.16
        },
        {
            "text": "the softball game that's like I you know I should have been a pro yeah exactly so you know and then uh we so we live in capitalism right y it's all about competition how's the planet doing because of it not great not great no right so still out yet I mean we don't know you know no proof that this is man-made I mean there's right right there's a case to be made that that that that competition breeds a lot of great things as well right it's interesting so let's let's take uh crowdsourcing MH right so if we crowdsource a problem mathematical as astronomical physics encryption does it get solved Faster by the crowd or does it get solved Faster by the little brilliant group that we gave it to specifically or five different groups that are competing with each other almost always crowd solves problem faster right that's that's cooperation right because they're not like saying oh it's us within the team and within this we're going to have certain sort of sort of uh uh uh defenses of of",
            "start": 238.96
        },
        {
            "text": "problem faster right? That's that's cooperation, right? Because they're not like saying oh it's us within the team and within this we're going to have certain sort of sort of uh uh uh defenses of of knowledge we're going to keep this in here because we got a real special sauce you know we don't want to share that with anyone and then you got the the crowd sourcers the the the source right that are that are actually doing the work and and so you go forchan right like you the last thing you would ever want on your ass is a tens of thousands of autistic hackers looking into your social history like they are going to find everything luckily I think I us just I I'll willingly put most of that stuff out on the podcast because it's not going to be one it's not going to be one guy saying hey read my book it's all of them going what data did you find I found this I found it all these dots if you see the nodes of what's connecting it's frightening right like what the crowd can solve and uh so my",
            "start": 285.56
        },
        {
            "text": "book it's all of them going what data did you find I found this I found it all these dots if you see the nodes of what's connecting it's frightening right like what the crowd can solve and uh so my partner is uh she's got her psychology degree right psychology and communication she's like competition is the worst thing is it now she's very competitive this she like I know more about competition she'll be like how did you how could you put that image on the screen it didn't look better than everyone else's you you're like gee you know up computation is terrible huh but uh you know if she could be on the show she'd be giving you a whole rant on why and how it it discourages a majority you know while it empowers a minority and all all these ratios around it uh if you're trying to say how do we get to Mars fastest right uh and they say we have a billion dollar Grant to the people who come up with the best proposal with the most likelihood whatever right we're going to get to Mars a lot",
            "start": 330.52
        },
        {
            "text": "we get to Mars fastest right uh and they say we have a billion dollar Grant to the people who come up with the best proposal with the most likelihood whatever right we're going to get to Mars a lot faster than just Elon must saying I'll get us there M right and I'm all from Elon I he's one of the only really admirable you know sort of titans in that class but uh but so you have if you're highly competing right this is one of the things I really didn't like about it particularly as a employer you get into tight deadlines big budgets lots of risk money lots of people's uh uh even people like you're being supported by a publisher it's a big moment those people are putting their jobs on the line like they're standing up for you defending you inside a big company you know new launch whatever it may be lots of pressures around that to be the best right to have to kill the competition and this this and hardly anyone comes out of that really thriving right it seems like it's it's focusing",
            "start": 373.28
        },
        {
            "text": "it may be lots of pressures around that to be the best right to have to kill the competition and this this and hardly anyone comes out of that really thriving right it seems like it's it's focusing more on a different sort of anxiety on a different fear on a different need but what I didn't like about that was it made me more judgmental of people I was working with quite frankly and i' I'd be like you know because you're constantly comparing yourself to that I just go home I like this guy man he's got to go you know like I want to kill him right and I feeling this like Rage or hatred against an individual for some reason and then I go home and I'm actually whatever you know take a little hnd California meds and then uh and then I'm like wow but I if I went to school with that guy I would have still liked them I would have still went to the barbecue I like I like him as a person I like but the competitive landscape made made these really ill feelings between individuals and I I was",
            "start": 422.6
        },
        {
            "text": "have still liked them I would have still went to the barbecue I like I like him as a person I like but the competitive landscape made made these really ill feelings between individuals and I I was noticing this a lot because I didn't like the way I was feeling about certain people and I particularly didn't like that they didn't deserve it yeah and that's I think competition is right for that and on the other Spectrum I mean personally I'm just a terrible loser like I go through Vegas and **** I don't put a dime in anything man I mean it's like too doing what we do I risk everything every time like I'm into that kind of risk we it's skill-based we're going to do this we're going to do that but I feel better about being Indie about it right on this topic of competitive because we'll go to E3 right the other Indies it's like we're all climbing up out of the swamp together right we'll promote some of you in our game we took slack for this because people say oh you had ads in the game no",
            "start": 471.88
        },
        {
            "text": "E3 right the other Indies it's like we're all climbing up out of the swamp together right we'll promote some of you in our game we took slack for this because people say oh you had ads in the game no we well kind of we just put up some other Indie groups that we knew needed exposure too so we were like we'll put you in our game you put your in our no money no no just just trying to help each other you would never do that at a AAA level that's what's SOA publisher level because you couldn't us going from IGN to this in the fact that you YouTube is all about collaboration you know as soon as you get into they start telling you about that but the fact at IGN it was that like when I started at IGN like we wanted to be number one like we were behind Gamespot at the time and then when we all worked our asses off and did it you were number one and now we're going to maintain being number one and we're going to hit every embargo and we're going to do all this stuff and it was **** crushing",
            "start": 509.68
        },
        {
            "text": "our asses off and did it you were number one and now we're going to maintain being number one and we're going to hit every embargo and we're going to do all this stuff and it was **** crushing it was so much pressure but it brought out the the it wasn't it was never even the pressure of wanting to be the number one site or be the first site or to do all this that really did it it was the collaboration with everybody else you didn't want to let anybody else down you knew how hard everybody else was working but then that came out all wrong where it was back in the day that you would go to events and Gamespot wouldn't talk to us you know what I mean and we wouldn't talk to these people and I wouldn't talk to Scott from pom or whatever and it was super awkward and then as YouTube came up and the people started to blend that's when he got to the point of like you know there's a like for me in Timeline wise have a kinda funny crossover to IGN right you want to talk about collaboration",
            "start": 550.16
        },
        {
            "text": "the people started to blend that's when he got to the point of like you know there's a like for me in Timeline wise have a kinda funny crossover to IGN right you want to talk about collaboration verse uh competition like right now Colin goes off to do his own thing and kills it on Patreon and it's like **** yes awesome great job go do that Danny O'Dwire when he came out yes awesome go do that we're behind them we will support them we will do that and it's because we understand how this all works and that them bringing people to Patreon benefits us and vice versa all it's also your even with Patreon you're self- financed exactly right so you don't have to be better you're not representing a company that has to have next quarters growth looking On Target and going to crush the competition for fiveyear investors they're going to get their you know all that right instead you're what I would call you're in a sustainable model not a capitalistic model you're existing in capitalism but",
            "start": 583.4
        },
        {
            "text": "for fiveyear investors they're going to get their you know all that right instead you're what I would call you're in a sustainable model not a capitalistic model you're existing in capitalism but this is where really talk about Evolution capitalism needs to evolve right it is seriously **** stuck in a dinosaur age and that's the thing is that this was the evolution of my own mindset where Colin being the most recent example going off and doing his thing great awesome we're going to support you go I hope you kill it oh you're killing it fantastic jump back to when we started and we were still at IGN and I still had that IGN mindset comedy button launched the Friday before us and I would refresh comedy button every **** day their Patreon after we launched ours because not cuz I **** hate Brian or Scott or anybody I love those guys they've been my friends for years but it was are are we winning or they winning who's who's making weird you made a weird competition out of it where",
            "start": 624.72
        },
        {
            "text": "hate Brian or Scott or anybody I love those guys they've been my friends for years but it was are are we winning or they winning who's who's making weird you made a weird competition out of it where there doesn't need to be a com exactly and that but it was because that was where I was coming from my foot was firmly planted in IG where it's like now it is the thing of like I understand how this works I I love the fact that we are not the biggest YouTube group I love the fact that we are not the most success people of all time it's great CU now it is we're garbage truck on fire and this is the product and if you don't like it no big deal you can be you right this goes go to previous topics you can also you don't have to be necessarily driven by bottom line and that's what you're kind of talking about here right is like the thing that I think that when I boil it down to business um the mentality that I'd rather have is I want to focus on the process not necessarily on the outcome that's",
            "start": 665.88
        },
        {
            "text": "about here right is like the thing that I think that when I boil it down to business um the mentality that I'd rather have is I want to focus on the process not necessarily on the outcome that's going to get me the dollar because I find myself all too often I'm the same way where I default to am I going to make are we going to make the most money out of that off that thing like are we going to make money money money money right and then I'm thinking to myself wait a minute why we don't we don't ever need to really focus on that here right but in the rest of my life I'm always like I still I'm caught up in that capitalistic tendency when in reality I know it's counter intuitive and counterproductive to what I want to be achieving which is cool art right and most people that I look at the guys that I really admire are the ones not the Steve Jobs the wincs the guys that are like I just want to develop this team because it's **** cool and oh I've been rewarded for it cool I guess but I",
            "start": 703.88
        },
        {
            "text": "that I really admire are the ones not the Steve Jobs the wincs the guys that are like I just want to develop this team because it's **** cool and oh I've been rewarded for it cool I guess but I want to keep doing this thing I want to be more like that guy but I'm I'm torn between these two worlds of saying like maybe I should be more masculine and like want to compete against everyone but then the the the the real me wants to just sit in the room with Tim and talk about bull stupid ideas for dumb music videos and find dope beats and like maybe do those later I this it's something we've talked about so many times on the show but I do feel like personally there's a a a sense of I feel like I need to earn the right to do that stuff sure and it's like you need to be competitive in the market to be able to make enough money to fund just what you're doing but also the things you want to do and it kind of keep going forward from there to answer the question about collaboration vers",
            "start": 739.68
        },
        {
            "text": "market to be able to make enough money to fund just what you're doing but also the things you want to do and it kind of keep going forward from there to answer the question about collaboration vers competition I think you need both to survive and to thrive and I I feel like you see the the most successful people are the ones that are highly competitive and collaborative at the same time and kind of combining those together and I feel like the competition comes to yourself where it's like you are trying to better yourself you're trying to always have bigger goals you always want to go bigger and it's like or I'm going to go smaller but the there's a bigger goal there the competition you're doing is right now you're trying to compete Kinda Funny Life three against Kinda Funny Life against Kinda Funny Life one right you want you want there to be a clear trajectory of you've done what we're doing and and that's hard and it beats you up you know to like try to you when you know you",
            "start": 776.92
        },
        {
            "text": "Kinda Funny Life one right you want you want there to be a clear trajectory of you've done what we're doing and and that's hard and it beats you up you know to like try to you when you know you **** killed it and you're like oh now I need to kill it even more and it it Hypes you up and you're like **** yeah I'm going to do it and then once you have to do it you're like a **** like how often does Hollywood P off yeah I mean that's the thing is how of the than the original yeah very seldom but they're always hoping in Cas it's a mixed bag we'll see but yeah you're very true um yeah I think Colin talked about this when he went on Rogan's podcast and Rogan has a very good perspective on this right where he's talking like he's like a lot of people that are hyper competitive in the marketplace are ones that that that are working off of what they view I think his term that he use was a scarcity model which is they're just assuming there's only $10 left in the world we have to get our",
            "start": 817.44
        },
        {
            "text": "are ones that that that are working off of what they view I think his term that he use was a scarcity model which is they're just assuming there's only $10 left in the world we have to get our piece of the pie when in reality especially for what we do where you look at what we do and it's heavily crowdsourced right we we we drive the the vast majority of our revenue on an annual basis from people's contributions to our subscription platform uh which is patreon.com kinda funny um just in case anyone was wondering um but in reality that's like pitting us against people for the comedy button or or DWI or or Collins Channel you could look at that one of two ways you could say oh **** like they're doing better than we are and we have to go after them or you could look at it and say they have their own audience we have our own audience what are we doing to Foster our own audience and not necessarily worry about them which is that that's the more I think positive collaborative effort de",
            "start": 853.08
        },
        {
            "text": "their own audience we have our own audience what are we doing to Foster our own audience and not necessarily worry about them which is that that's the more I think positive collaborative effort de says I'm scared the EM we've ever the others **** the fear we're fine there's plenty of stuff to go around there's plenty of resources to go around we're all going to be okay yeah I mean it's funny for me because the one of my favorite things in life is rap music and I grew up listening to rap music and there is a core to rap music That's **** you I rhyme better right right and I I feel like with rapit it's always a competition even between friends and I like that so that's why I look at comedy Button as competition in a good way you know in a way that's going to push me and I hope that they're looking at us and pushing them like it brings me back to e8th grade like I remember I was in seventh grade and I had my classes with all my friends and then when eighth grade came all my friends",
            "start": 891.84
        },
        {
            "text": "looking at us and pushing them like it brings me back to e8th grade like I remember I was in seventh grade and I had my classes with all my friends and then when eighth grade came all my friends were in one class they put me in another one for some reason and my mom like I have to destroy them my mom came in and like talked to the principal was like Hey like we really got to put Tim in this class like he thrives off of the competition of getting a better grade than his friends in this class they this group that just feels some sense of community of yo man I got a better grade than you I got this **** you know like that type of **** gr it's whether Smash Bros or whatever I know what I'm saying comp up with that **** I was say it's true no so I was going to say is uh is it so one of the reasons we're able to feel this way today let's say us as an indiv indie developer you guys as as self and crowdfunded right entities you don't have investors beyond your crowd right so you're able",
            "start": 934.12
        },
        {
            "text": "reasons we're able to feel this way today let's say us as an indiv indie developer you guys as as self and crowdfunded right entities you don't have investors beyond your crowd right so you're able to basically be more of you because obviously that's what someone wants to pay for that's the product right and now but you're not pinched by this is what I look at as the democratization of the of the exposure landscape or the delivery platforms right as long as there was retail I got to go convince sales people buyers at Walmart Gam my game has to be there and that other person's doesn't right and then there's cost of goods Associated now there's higher risk there you know more more money more risk more more pressure that breeds the the wrong Vibe between us that makes us want to get more isolated if if it was airtime if you guys if your show was on G4 yep and you had the 88m slot MH and someone else gets that slot it' be highly competitive different kind of really really different but",
            "start": 984.28
        },
        {
            "text": "If if it was airtime, if you guys, if your show was on G4, yep, and you had the 8:00 PM slot, and someone else gets that slot, it'd be highly competitive, different kind of really, really different. But you're on YouTube, it's like the better you can do, the better you can survive, the better you can thrive because you are G4, you're your own G4 now, right? We're in a space before we used to have to argue for shelf space. We have to only so many slots of publishers going to finance this and that. But when we finally, and it was a very humbling experience, right? Like going like, what, we're not going to have commercials running all over the airwaves, our buddies and LA film companies aren't going to see our products there, they're not going to know we exist, you know, but the people who like our product will and we can figure out ways to get to them, right? So it's kind of humbling of like, wow, we're going to go from, you know, no more big campaign, no more MTV, no more ESPN, no more this and that cartoon Sushi.",
            "start": 1034.64
        },
        {
            "text": "And we can figure out ways to get to them, right? So it's kind of humbling of like, wow, we're going to go from, you know, no more big campaign, no more MTV, no more ESPN, no more this and that cartoon Sushi, whatever it was, you know, giving us, giving us exposure. But now we just go, well, we're on a level of playing field, we're all equally accessible. You know, we need exposure opportunities, we need people if we build good product, will you highlight us, right? That's kind of like you have uh YouTubers that are highlighting you because they're they're fielding it in different ways, right? So so it brings us back to we don't have this narrow funnel of only the these guys can be winners, right? Cable networks only so many slots a day, the rest are losers. If you didn't get a slot, you got that, if you got bumped out a prime time slot, if you got bumped out a prime time height on retail shelf dropped two shelves lower, now you're a loser, right? We're not dealing with that. We have a different number of followers.",
            "start": 1072.4
        },
        {
            "text": "Out a prime time slot, if you got bumped out a prime time height on retail shelf dropped two shelves lower, now you're a loser, right? We're not dealing with that. We have a different number of followers, different number of likes, different amounts of revenue, but it can be more cooperative, right? Like truly more democratized, not as like owned by monopolies. I think you can even then kind of go from up here down doing it this way and then kind bring it back just in a different direction. That's something that that's what I enjoy the most about Kinda Funny is the competitive nature with myself of I love selling things and like getting things sponsored because to me it's the ultimate challenge of how can I go to a client and in a very real way explain to them that this thing that we're doing where the product is us and the product is us having a conversation with the community and tell tell them this is worth something and for them to be like oh it is it is and then me like it's worth a lot and",
            "start": 1117.48
        },
        {
            "text": "Product is us and the product is us having a conversation with the community and tell tell them this is worth something and for them to be like oh it is it is and then me like it's worth a lot and then be like you know what it is worth a lot like there's something there where it's like it challenges me to really kind of define are we dope like are we cool cuz if I can't sell us if I can't say this is special and stand by it we're screwed up and we need to go back to the drawing board so I feel like that the competitive thing kind of Keeps Us honest of you know what we are doing what it what what's really cool cuz it's easy for me to keep going out tell people yo we're doing cool we have a screwed video wall that's screwed cool you know we have cool friends they come by and do cool things with us and people like I want to be part of this cool thing and so it's like I have such a sense of Pride when we get the the more unique sponsorships because I'm like we did this you know we were able",
            "start": 1162.92
        },
        {
            "text": "Us and people like I want to be part of this cool thing and so it's like I have such a sense of Pride when we get the the more unique sponsorships because I'm like we did this you know we were able to sell this and people are looking at us like oh man Kinda Funny is cool they did something that they believe in and it it comes across and we want to be a part of that and like you can get like I hope that one day we have something on MTV not that I look at MTV as better than YouTube but want to them that you what we deserve to be there we bring back Jackass hell yeah right please we need it I'm addicted I me men nobody needed that men using their heighten stupidity yes to hurt themselves is classic International Language right like no matter what we could go to an African tribe they don't speak a word and they don't understand when they see it they're cracking up when they see a guy act stupid and hurt himself Wild Boys they're cracking up right it's Universal like we love it like come",
            "start": 1203.24
        },
        {
            "text": "A word and they don't understand when they see it they're cracking up when they see a guy act stupid and hurt himself Wild Boys they're cracking up right it's Universal like we love it like come on man you're stupid hurt the balls it's funny everybody knows Yeah Tim yes do we want to do one more topic or I think I think that we the first one was real good okay so we you want to break that what you're saying okay cool yeah all right this an hour and 40 of a solid I was just going to do it you know save that one for next week then it doesn't work next week not this because it's about my birthday which would be the day this breakout posts you're but actually kind of because I was going to talk about aging and what we've learned aging we kind of talked about it that in ter all this because like what we learn we talk about later you haven't aged yet you don't know that's a great Point how old are you going to be 34 wow huge milestone best years behind me behind well that's the whole thing",
            "start": 1253.32
        },
        {
            "text": "What we learn we talk about later you haven't aged yet you don't know that's a great Point how old are you going to be 34 wow huge milestone best years behind me behind well that's the whole thing is that's one of my things like when was last when did birthdays matter I mean we did birthday last year we did a birthday parties topic but how they kind of faded away and I was just going to do a wing wings thing but never had one sorry never had a birthday party oh we're throwing pizza party for I'm throwing out the sympathy hook right now drift net but I don't know you know just never really like you know parents would have a cake or something that was it like come over no I was going to do it at 50 and then I like qu wrecked my bike and I wasn't ready to stand up and have a party uh two years ago oh wow yeah 5 yeah it's always 53 yeah you start feeling it too man I've been those old injuries come back like why is my ankle hurting oh my God that was the accident when I was 14 Grandpa",
            "start": 1294.72
        },
        {
            "text": "Ago oh wow yeah 5 yeah it's always 53 yeah you start feeling it too man I've been those old injuries come back like why is my ankle hurting oh my God that was the accident when I was 14 Grandpa wasn't lying I know the rain's coming if you didn't know ladies and gentlemen this has been the GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com kindof funny and Hell while you're there go to patreon.com thee comedy button uh you can give us a few bucks get episodes early bonus episodes and a whole bunch of cool perks if you got no bucks to toss though no big deal go to youtube.com/ kindof funny where he posts the show topic by topic day by day until it goes up his one big video and MP3 the following Friday Lauren Landing we love you so much thank you for having me guys this always pleasure when's the next Oddworld game coming out what can people do",
            "start": 1337.04
        },
        {
            "text": "Up his one big video and MP3 the following Friday Lauren Landing we love you so much thank you for having me guys this always pleasure when's the next Oddworld game coming out what can people do right now it's not coming to switch we caught that much it it'll be in 2018 okay and I can't been I was threatened I have a sheet oh you have a sheet of like what to say don't say this don't say were you supposed to say you canell you canceled two games failed fast and cheap yeah so we have uh uh Soulstorm is coming we got a few surprises around that I think uh we've been showing some early eyeballs on some early things the indications look really good okay we've been working like I said the last time I was on a show I had dark hair right so it's been like we're our heads are to the grinding Stones we're managing like three to four time zones of people working on it we haven't been showing anything we got to be really strategic and how we reveal so unfortunately we're not revealing but we",
            "start": 1382.28
        },
        {
            "text": "We're managing like three to four time zones of people working on it we haven't been showing anything we got to be really strategic and how we reveal so unfortunately we're not revealing but we will and you know hopefully people will be excited but it'll be 2018 okay we got plenty of games podcast if you ever want to come back and be one of those that's a switch games coming exactly yeah you'll see you'll screw see Ling I want to see him succeed man Nintendo must succeed that's why I'm pissed okay until next time it's been our pleasure to serve you thanks for watching you can what no that's the wrong here thanks for watching you can click here to subscribe you can click here to go to Patreon you can click here to watch something Kevin wants you to watch and then do something what's this one I don't remember the chair you're behind the chair the face people can't see where you're clicking click on my face to subscribe to subscri I already said subscribe oh I don't know click on the",
            "start": 1425.56
        },
        {
            "text": "One I don't remember the chair you're behind the chair the face people can't see where you're clicking click on my face to subscribe to subscri I already said subscribe oh I don't know click on the water there things here click on them you want to go to the Easter Egg website spoilers it's just going to be a subscriber can't even hear",
            "start": 1461.24
        }
    ]
}