{
  "id": 2566,
  "video_id": "jngAp4eVlq8",
  "show_name": "Kinda Funny Morning Show",
  "hosts": [
    "Greg Miller",
    "Kevin Coello",
    "Andy Cortez",
    "Cool Greg",
    "Alexis Pence",
    "Portillo"
  ],
  "title": "Superman Show Features Kinda Funny Best Friend - Kinda Funny Morning Show 04.19.17",
  "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1492648071,
  "duration": 7319,
  "transcript_chunks": [
    {
      "text": "you got to record too, got to hit that record button. I love it. What's up, everybody? Welcome to the Kinda Funny Morning Show for Wednesday, April 19th. I'm whatever your host, Greg Miller, alongside Alexis Pence. It's hard for me to say. It's so like underwhelming. It took, well, yeah, 'cause it, 'cause Zombus took me a long time to learn and I'm like, oh, it's over. Uh, let's get Lexi, a re-noser, Twitch superstar all over the internet, YouTubing it up. I try. How are you doing? I'm good. How are you? Good. Thank you for coming. Thanks for having me. Let's get to the heart of the matter right away. Let's do it. Like those things you did is like, like I never got that. Well, I was never popular enough to hang out with people who did it. I want to get to part of the matter right away. Yes, recently we've done the bonus episode of The GameOverGreggy Show. What it was was places we recommend in San Francisco 'cause the most, the most, you know, the thing we get the most nowadays is, I'm coming to San Francisco for Kinda Funny Live 3. Funny.com, where do",
      "start": 3.28
    },
    {
      "text": "Greggy Show. What it was was places we recommend in San Francisco 'cause the most, the most, you know, the thing we get the most nowadays is, I'm coming to San Francisco for Kinda Funny Live 3. Funny.com, where do I go? Where do I eat? Where do I drink? Where do I party? Blah blah blah. I put on in the rundown of the show where what we should be talking about, what we should be arguing about. I put in there coffee. Yes, we got to coffee and we all were like, anything, any local shop, we had no good picks for coffee. You, of course, obsessed with coffee, Lexi. Yes, I need you to weigh in right now for people. Where do people go for coffee in San Francisco? All right, there are a couple of really great places. There's Ritual Coffee, um, and they have a bunch of shops around the city. Four Barrel is one of my favorite places and that's in uh, Mission and Mazarine. That's where you'll see Hunter and I just because it's closer. Yeah, Mazarine. It's on Market Street. I think it's like borderline Financial District. Um, so, okay, okay, yeah.",
      "start": 63.48
    },
    {
      "text": "that's in uh, Mission and Mazarine. That's where you'll see Hunter and I just because it's closer. Yeah, Mazarine. It's on Market Street. I think it's like borderline Financial District. Um, so, okay, okay, yeah. But it's not where, what, what's its cross street? Is uh, Mission and Market? Mission? No, no, no. Market and like right next to the GameStop, Fifth. Yes, thank you. Um, Mazarine is really good and Counter Culture I really like as well. Um, and those are all specialty coffee places that roast a lot of their own beans. Mazarine doesn't roast their own beans, but Four Barrel does and they support a lot of the, where do you come down on the Blue Bottle? I like Blue Bottle a lot. You do? I'm not a big fan of Blue Bottle. Please leave the show. Thanks for having me. Um, great to see you guys. No, I'm not a big fan of Blue Bottle. Um, what's wrong with it? Too acidic. Too acidic. They use like also like a coffee, like uh, like a like a fake coffee, almost a chicory. Chicory? What? Chicory roast. I've heard of chicory. So it's like not like a real",
      "start": 106.76
    },
    {
      "text": "wrong with it? Too acidic. Too acidic. They use like also like a coffee, like uh, like a like a fake coffee, almost a chicory. Chicory? What? Chicory roast. I've heard of chicory. So it's like not like a real coffee. So I'm not a big fan of that flavor, but that's just a personal taste of mine. All out. I'll out. Okay. And there's also a really cool um, coffee shop in the Metreon, guys, that is, it's called Cafe X and it's a robot that does your, it makes coffee for you. Yeah. Are there any humans in it? There's no humans in it. Wow. Coffee review coming on. Let's get Lexi pretty soon on that. That's awesome. That's awesome. When did you, so here's the thing. I worked with you at IGN. For some reason people don't know you. We worked together at IGN. Did before then you had a bevy of Twitter followers with no story. Don't ask how you got them. And then you, you know, we work at IGN. You broke off to do your own thing. Go do the Twitch and do the YouTube and do all that stuff. Yeah, this guy Hunter Pence comes around. Nobody's",
      "start": 153.04
    },
    {
      "text": "ask how you got them. And then you, you know, we work at IGN. You broke off to do your own thing. Go do the Twitch and do the YouTube and do all that stuff. Yeah, this guy Hunter Pence comes around. Nobody's ever heard of him. You make him a big name. You make him, but like you started on your YouTube channel. You did put him on the map. I, you know what I mean? I think the Giants were like, we might have to cut this guy. Oh, he's making good YouTube content. Keep him around. All right, cool. When did you know that like coffee was something you were so, I at IGN, I don't remember you being so into coffee, but then you started doing these reviews and I'm watching you in, especially when you're in Texas and you're going like in the car when you first started doing it. I like, damn, you guys know a lot about coffee. Yeah, well, actually my coffee started at IGN. I don't know if you know this about me, Greg, but I would leave for like the first hour, hour and a half 'cause I was getting coffee across the street at uh, what",
      "start": 200.4
    },
    {
      "text": "Yeah, well, actually my coffee started at IGN. I don't know if you know this about me, Greg, but I would leave for like the first hour, hour and a half 'cause I was getting coffee across the street at uh, what was that place? Iron Side. Great coffee. Great 'cause the Brie there was really good. And so I'd leave and I'd grab someone like Tim, Kevin, um, really anyone who would go with me 'cause I needed a cup of coffee. Yeah. And so it started. My love started there. And I was like, why? And then there was one, that one guy, the the ginger there. Oh, right. Yeah. He had the the mustache and the beard. Yeah. He always told me the weirdest stories. Yeah. He, yeah, really good cappuccino. What did you do this weekend? I went out into the woods and we got, did we did mushrooms? Like, all right, we'll talk. I was, I played this game called Uncharted. It was cool. You're like, God, I'm not that cool. Um, but I don't know, he made like a really good cup of coffee and that's where my love kind of started. And then when I had to move to Texas with",
      "start": 234.88
    },
    {
      "text": "Uncharted. It was cool. You're like, God, I'm not that cool. Um, but I don't know, he made like a really good cup of coffee and that's where my love kind of started. And then when I had to move to Texas with Hunter, I was like, man, what am I going to do out here? I need coffee. It kind of all just melted and that's kind of where my love for it came. And then I just started to like explore like where the beans came from, the farmer, how it's able to the Earth and all that stuff. And that's why like supporting specialty coffee shops, um, are is super, super important because they go, it goes all the way back to the farmer and what they put into the Earth, how to protect like these farmers and their families in these, you know, third world countries that can't quite afford to protect themselves from, you know, whatever is happening over there. Mark Zuckerberg and his drones. Exactly. Exactly. And just, you know, government officials and all that stuff. So it's kind of protecting them and it's it's a lot more than just",
      "start": 276.4
    },
    {
      "text": "is happening over there. Mark Zuckerberg and his drones. Exactly. Exactly. And just, you know, government officials and all that stuff. So it's kind of protecting them and it's it's a lot more than just the cup of coffee. So where do you come down on Philz? 'Cause that was one Tim threw out there and he's like, I can't even say it with confidence anymore because there's so many Philz now. Yeah, good though. Kevin says it's so good off camera. So good. Yeah, we're going to get to you in a second. We're going to get to you in a second. Me? Yeah, it is good. I will say that. Um, Philz is good, but I think it's like one of those places where like when you know you go to like a bad Chinese restaurant and you're like, oh, I'm definitely eating MSG or something. You know, it's like that. Like I'm not even confident this is, you know, actual like steak or chicken. Like this could be any type of meat. I'm not sure. You this, this is the stray cat or dog that got lost in the neighborhood. Exactly. And so that's what I feel like with and so I",
      "start": 321.24
    },
    {
      "text": "like steak or chicken. Like this could be any type of meat. I'm not sure. You this, this is the stray cat or dog that got lost in the neighborhood. Exactly. And so that's what I feel like with and so I don't know. I can taste almost like a chemical when you become a coffee purist. Yeah. Um, not to sound too much like a snob, a coffee snob, but well, as soon as we went down this line of question, we all became coffee snobs for sure. As we serve you a carck Dunkin' Donuts pie. So, but you know, it's all personal preference. You know, you got to make, you know, I had Starbucks this morning and that's not necessarily, it's not good. Philz right by your house. There is a Philz right by my house, but I will walk the extra Starbucks for Mazarine. I or I'll send Greg, you know. Um, but I don't know. I feel like there's like a chemical in Philz. Do you put butter in your coffee? Are you one of these people? You, I have. Yeah, so, well, I have to do it for Hunter because he loses, I've never had this problem. He loses too much body fat",
      "start": 358.96
    },
    {
      "text": "in Philz. Do you put butter in your coffee? Are you one of these people? You, I have. Yeah, so, well, I have to do it for Hunter because he loses, I've never had this problem. He loses too much body fat playing because he's such a healthy eater. So we have to supplement it with butter to keep his body weight up. That was ridiculous. Must be a nice life, huh, Kev? Yeah, I I mean, that's the life I live. So you don't need to be putting butter in your coffee cup and sometimes I do. So two other things on the table for what's happening in the Morning Show. You're here. That's fantastic. Thank you for co-hosting. Thank you for having me. Second part is, of course, Portillo is here, face blocked by the coffee mug. There it is. He's been incognito. Some of you have caught him. He is a stealthy wiener dog, but he's here, here sleeping it off, very tired. And then the third big thing is that we have brought in Cool Greg today to drive the show. Hey, Cool Greg, what up? Now, Cool Greg, friend of the show, you know, Tim's brother helps us",
      "start": 407.12
    },
    {
      "text": "it off, very tired. And then the third big thing is that we have brought in Cool Greg today to drive the show. Hey, Cool Greg, what up? Now, Cool Greg, friend of the show, you know, Tim's brother helps us out. You, we're barbecuing today. So Cool Greg was going to come by and eat with us no matter what. Then, of course, we realized that tomorrow and Friday we're turning the show over to the minorities. Andy Cortez, Kevin Coello hosting. Can't say that. Why can't I? To the minorities. Yeah, why can't you say that? That's seems wrong. It seems, no, man, no. It's Spanish-speaking Pride Day, Thursday and Friday, Kinda Funny. So I'm here on the wrong day. Well, no, you're easing us into it. You know what I mean? You're, it would be, it'd be too shocking tomorrow if they turned in here and it wasn't either a fat white guy or two white guys with beards. You slowly ease them into people of color being on the show. Now, is what is wrong with that? I mean, what color am I? Well, you're not white, isn't that? Here's no. All right, good sidebar.",
      "start": 449.52
    },
    {
      "text": "guys with beards. You slowly ease them into people of color being on the show. Now, is what is wrong with that? I mean, what color am I? Well, you're not white, isn't that? Here's no. All right, good sidebar question for you guys. Yesterday, yeah, two days ago, someone tweeted out like, hey, uh, I just spoke at this thing. They're looking for people of color or women of color to speak at this like, you know, this group, whatever. And I tossed Neha out there. Yeah, an Indian woman. That counts, right? Yeah. Okay, just making sure. Why you have to question that? Well, 'cause he just, 'cause Kevin, a person of color, just said like, it does that count? I'm like, it does, right? I don't know. I'm white bread American, Wonder Bread dude. I would think that counts, right? You're a person of color. Yeah, I'm a person of color. Okay, cool. Yeah, see, I got to be careful. You never know. It's a mindi color, but personality too. You have a very colorful personality. Anyways, Thursday and Friday, it's Kinda Funny Morning Show, colon, The Minority Report. And",
      "start": 502.68
    },
    {
      "text": "to be careful. You never know. It's a mindi color, but personality too. You have a very colorful personality. Anyways, Thursday and Friday, it's Kinda Funny Morning Show, colon, The Minority Report. And it's Andy and Kevin, the minority, hosting this thing on their own. And while they host it on their own, Kevin's not there to drive it. So we had to beg Cool Greg to come in and learn how to drive. Cool Greg, how's it going? It's all right. It's all right. Does it seem hard? Does Kevin make the job seem too hard? No, at all. No. Well, Greg also interns at Let's Get Lexi once in a while. So, so there you go. It's it's one big happy family. You know, Cool Greg knows what he's doing over. Yeah, he does. Cool Greg, turn on your little camera. Can you do that? Do you know how to turn on your camera for the Kev Cam? It'll be the Cool Greg Cam. Kev's teaching you. There we go. Now it's on. What are you drinking over there? Oh, pineapple Kombucha. That's right. Is that no, that's from you too. This is I got Kombucha, but he did the pineapple one, which",
      "start": 545.68
    },
    {
      "text": "Cam. Kev's teaching you. There we go. Now it's on. What are you drinking over there? Oh, pineapple Kombucha. That's right. Is that no, that's from you too. This is I got Kombucha, but he did the pineapple one, which I'm curious to try. Um, I've never tried it before, but I did turn them onto the kombucha. Okay, you don't strike me as a kombucha drinker. So what's your review of the kombucha, Cool Greg? It brings me back, man. It brings you back. What does it bring you back to? I don't know. Sometimes I'll soul be hurting and this I swear this brings it back. Oh, okay. Oh, damn. That like, it's like that was so prolific. Like, shh, he means heartburn. Just so you or heartburn. Oh, no, no. Don't ever, don't ever let Kevin translate. That was super like, oh, man, like his his chakra. Yeah, man. Damn. By drinking Kombucha, man. I love Cool Greg. I do too. You're a good addition to the show, Cool Greg. He's the best show that you can do the job better than Kevin. So we can get rid of him. Okay, Kev, how how are you doing though, Kev? I don't know what that",
      "start": 589.0
    },
    {
      "text": "means. How? Okay, it's it's a you're awake. How are you doing? I'm doing great. Everything's good. I've got uh, I'm I'm playing that Zelda game. Yeah, uh, it's been nice. It's been nice so far. Okay, I think you're slightly out of focus. Yeah, no, uh, I I was going to call that out eventually. M. Murphy J1 says, image is super soft. Kev, bring that f-stop down. He doesn't know what he's talking about. F-stops all the way to the ground. I don't either. I don't know what that mean. F-stops all the way to the ground. We got an f-stop on the ground. Also, shout out to some people earlier in the chat saying that black was definitely not my color and I should wear more grayish shirts or whatever. This I don't wear shirts that aren't black often. See, today I'm wearing a non-black shirt and people are saying I look good in it. This is",
      "start": 636.92
    },
    {
      "text": "not my color and I should wear more grayish shirts or whatever. This I don't wear shirts that aren't black often. See, today I'm wearing a non-black shirt and people are saying I look good in it. This is one of those shirts that I put on and I love this shirt. I just ordered this shirt actually.com. Also got those things to put on the back of your phone. Now, a bunch of shirts from you guys 'cause you guys are constantly sold out. Sorry. Yeah, it's been rough, but we now we now found a shirt supplier. There it is. That you can that thing put on the back of your phone like Kevin does and you can hold it and take selfies and stuff. But I love black shirts on guys. I think it I think it's I I agree, but I think I've I've been so scared off of wearing anything colored or lack of color. Why? Well, because I for a long time I've been fighting the sweat stains and I've conquered it for the most part. For the most part. Oh, no, you and I talked about this all the time. I remember. Yeah, uh, but I think with a certain",
      "start": 676.56
    },
    {
      "text": "a long time I've been fighting the sweat stains and I've conquered it for the most part. For the most part. Oh, no, you and I talked about this all the time. I remember. Yeah, uh, but I think with a certain dry regimen I'm on right now. I'm not I can wear like the aerobic shirt or a white or gray, a gray shirt and not feel so I put this on today and it was one of those I put on and then took off because I didn't like how it felt. It's one of those I'm still getting used to not hiding my shame. I'm a very, what do they call it? I'm a very, what do they call it? The opposite of huh? I'm shy. I'm a shy person about my body and so like I don't I don't like showing it off. Wait, who isn't like, wait, that's not true though. He always go say something outrageous. Announced Zac Efron as uh, I didn't take my shirt off when they announced uh, Invisible. Yeah, you were this close. I am pretty close. Yeah, you do take off your shirt a lot. Yeah, but it's just it's there's a difference though between, hey, I have my shirt off for a",
      "start": 712.76
    },
    {
      "text": "they announced uh, Invisible. Yeah, you were this close. I am pretty close. Yeah, you do take off your shirt a lot. Yeah, but it's just it's there's a difference though between, hey, I have my shirt off for a bit. That's funny. And then I'm wearing a T-shirt that I feel like too tight. And this is one of those XLs that I feel I I put it on, Greg, and I felt like it was too tight. But then I went and looked in the mirror 'cause here's the other thing. People been telling me I'm losing the weight. I just told you you look like a model. I was like, are you manorexic? What's the deal? I have this PlayStation Plus shirt I got from PlayStation years ago that I was like, oh, what a great shirt. And I put it on. It just it was just one of those like this. And I'm like, well, no, that is a night shirt. And then I put it on one of these days for a night shirt. And I looked in the mirror. I was like, oh, shh, this could be a real shirt. So yes, I have lost weight. I can fit into that PlayStation Plus shirt. So then, but then it was one",
      "start": 763.08
    },
    {
      "text": "days for a night shirt. And I looked in the mirror. I was like, oh, shh, this could be a real shirt. So yes, I have lost weight. I can fit into that PlayStation Plus shirt. So then, but then it was one of those things up. Is this shirt a shirt that I can fit into or not? And then I put it on. I can fit into it. Kinda Funny. I mean, but you're not like taking in all the variables for shirts too. Like laundry. Oh, yeah, yeah. What's going to happen on the on the wash? Yeah, yeah. Or if it's already shrunk. Bought this Dynamite Vanessa Carlton shirt at her latest show that I went to. Good for you. Thank you. Had a date with Gia Harris. It was lovely. Oh, yeah, I think I saw that on. And they gave it to me and I was like, oh, this feels too big. It was an XL, but I'm like, all right. And I put it on when I got home or when I for the show the next day. And I was like, yeah, this is too big, but I'm hoping the wash will tighten it up a bit. You know what I mean? Yeah, yeah. Or you can do the friend Arabella and just get it tailored in. I",
      "start": 796.68
    },
    {
      "text": "for the show the next day. And I was like, yeah, this is too big, but I'm hoping the wash will tighten it up a bit. You know what I mean? Yeah, yeah. Or you can do the friend Arabella and just get it tailored in. I could do that. That's I think a bridge too far. Even though I'll have you know, I went to the cleaners a couple days ago. Yeah, dropped off three suits to get dry clean 'cause it's time. And then I brought in three or four broken sweatshirts where the zippers had broken. Like these and like 'cause I was like, I could buy any sweatshirts, but I'm like, I like these sweatshirts because of course my Kinda Funny blue sweatshirt you never see me in broke months ago and the store has been sold out forever on it. I know. Matters into my own hands. They're back in stock recently. Are they really? No, I literally just checked. Unless it just happened this week. I checked last. I mean, actually stuff's happened in. Literally just checked. Yeah, but I put literally in front of everything. Well, literally doesn't mean literally",
      "start": 829.16
    },
    {
      "text": "unless it just happened this week. I checked last. I mean, actually stuff's happened in. Literally just checked. Yeah, but I put literally in front of everything. Well, literally doesn't mean literally anymore. So you can do you want because people like you. Well, you know, man, I'm on the store a lot. Is it if it is, I'm buying one right now. Hold on. You have a hoodie. Click on it. Unavailable. Now, what I've been told about the unavailable things in the store is that if you add the wish list that pokes them that they actually need to go do it. But I don't know who knows. Buy the the shh shirt. Buy the thing you put on your phone. You know what I mean? Cool Greg. Hell yeah. Hell yeah. Cool Greg knows what I mean. Huh? PopSocket. PopSocket. Those are cool. Those are super helpful. I mean, I don't have one yet. In the chat, you want one? We got one. Yeah, I'd love one. I'll take this guy off. Cool. Kevin, go get my PopSocket off there. We'll put it on her phone. Yeah, I thought you wanted one. I do want one, but if she's willing to",
      "start": 866.72
    },
    {
      "text": "you want one? We got one. Yeah, I'd love one. I'll take this guy off. Cool. Kevin, go get my PopSocket off there. We'll put it on her phone. Yeah, I thought you wanted one. I do want one, but if she's willing to put on her phone, you're such a piece of shh. Kevin, take this guy off. I think I take this. Josh A399 says, I've seen Greg's naked chest more than my own dick, which is a good thing, I guess. I don't know how to I don't know. Absence, they say, is the best. How's he peeing? What's he doing in the shower? Cool Greg stole my shirt yesterday for a picture. I saw that. That was great. You did. Just felt like it. Yeah, I don't know. Yeah, no. Kevin and I were commenting that on dinner. We had a lovely dinner. We had some ramen place. It was sunny outside and you're like, he was on a rock. It was very, it was very impressive. Yeah. Kevin, I'm going to do the intro while I do that. Go ahead and show him how to pull up his photo. Oh, okay. Photos. No more. What? I got weird Instagram things. I deleted when I wake up. Why do you delete your",
      "start": 910.68
    },
    {
      "text": "Kevin, I'm going to do the intro while I do that. Go ahead and show him how to pull up his photo. Oh, okay. Photos. No more. What? I got weird Instagram things. I deleted when I wake up. Why do you delete your Instagram post? That defeats the purpose. Instagram. That's Kinda Cool Greg. Just use Instagram stories then. I he posts and then he always has like seven posts. That's it. 'Cause he posts it and then he deletes it. Huh? I regret a lot of the stuff. I like, I don't know. You wouldn't have regret of that shirtless photo of you on the rock. I guarantee. Probably still has it. He probably still posts. We talk into it, right? Put it up. Put it up just for the duration of this show. We'll spike your followers and then it's all set. Yeah. What what's I forget? Is it Kinda Cool Greg is your Instagram name? Everybody go follow Kinda Cool Greg on Instagram right now or just go to instagram.com. I crushed his little paw. Awesome. Temporary post is going to see a temporary post right here for the duration of this",
      "start": 952.12
    },
    {
      "text": "Morning Show. People, if you didn't know, ladies and gentlemen, this is the Kinda Funny Morning Show each and every weekday. And here, jeez, it's already shh, 11:17. Each and every weekday here on twitch.tv/kindafunnygames. We come to you with the nerdy news you need to know about before jumping into the chat to answer your questions, comments, and concerns. In between those two segments, I reach into the internet, grab a video game, toss it to one of you. Uh, if you want to win it, there's several ways to do it. We'll cover it later. It includes though, Patreon. It includes being a sub here on Twitch. It includes being an awesome person and just being here in the chat like so many of you are. If you're watching later, remember you can on youtube.com/kindafunny or podcast services around the globe. Then we answer",
      "start": 998.28
    },
    {
      "text": "an awesome person and just being here in the chat like so many of you are. If you're watching later, remember you can on youtube.com/kindafunny or podcast services around the globe. Then we answer tips, questions, comments, concerns, all that jazz. And it's a barbecue day here, Kinda Funny. Woohoo days. Yes, we will be stepping outside at some point to answer questions and do that. Quick question, is it better to have it more towards the top, more towards the bottom, like right in the middle on how you hold? Going to have a lot of question like holding mine from the bottom like this. I guess right here. So I mean, like you have two of them on there. Hug. I like it right in the middle. You need to scan your finger. Yeah, look at this. Oh, yeah, that's great. And then I can, yeah, so I got two of them and I can do stuff like that. That's cool. He sure can. Look at that. Buy two PopSockets. This is awesome. Thanks, guys. Look at that. Thank you. First story comes from The Hollywood Reporter. My sound is up. hollywoodreporter.com",
      "start": 1033.76
    },
    {
      "text": "like that that's cool he sure can look at that by two Pop Saga this is awesome thanks guys look at that thank you first story comes from The Hollywood Reporter my sound is up HollywoodReporter.com where Borys Kit and Aaron Couch both have a giant thing that says Marvel's Kevin Feige on why the studio won't make R-rated movies. Guardians and Joss Whedon's DC movie. Uh this is an interesting I like that they did this cuz usually here's what happens yeah I started IGN, GameSpot, go down to Kotaku like well for this show where I going to look at everything right and I started reading the IGN article on this and they had like several hundred articles all about this one article and I'm like oo usually I want to go to the source but then I'm sure this is going to be like a 13-page article no they went through and bullet pointed all this information happening when they talked to Kevin about what's going on so Joss here's here's the hotness from this interview The Hollywood Reporter has with",
      "start": 1078.88
    },
    {
      "text": "went through and bullet pointed all this information happening when they talked to Kevin about what's going on so Joss here's here's the hotness from this interview The Hollywood Reporter has with uh Marvel's Kevin Feige of course uh there was a studio tour I guess down at the Disney Lot where everybody got to go walk around this thing see Guardians and you know do their Jazz uh here Joss Whedon called Kevin Feige about Batgirl. Whedon spent several years at Marvel not just as the writer and director of the two Avengers movies but also as a consultant giving input on other projects and thus when it was revealed he was T talk taking on Batgirl for DC fans were shocked at the news it turns out Kevin had known for quite a while and was cool about it quote he called a couple of months ago which he didn't have to do and was super cool of him and super nice of him said Feige and we couldn't be more supportive we want to see Joss Whedon back we want to see a Joss Whedon Batgirl film be awesome that's",
      "start": 1127.04
    },
    {
      "text": "didn't have to do and was super cool of him and super nice of him said Feige and we couldn't be more supportive we want to see Joss Whedon back we want to see a Joss Whedon Batgirl film be awesome that's cool Joss Whedon a good guy we knew that great yes next Spider-Man is in Avengers 4 and Marvel has no involvement with the Spidey spin-offs. Marvel's Landmark deal with Sony has allowed the wall crawler to enter the MCU and Feige confirmed Spider-Man will appear in 2019's Untitled Avengers 4 that's after starring turn his starring turn in Spider-Man: Homecoming in 2018's Avengers: Infinity War. After the second Avengers appearance it will be back it will be back for a Homecoming sequel set for 2019 quote that's as far as it goes for now said Feige and then they put in parentheses for now Sony is moving ahead with Spidey spin-offs for Venom and a Silver Sable/Black Cat Team-Up movie that I don't think you will ever see let's just put that out there right now okay Silver Sable, Black Cat I will",
      "start": 1164.48
    },
    {
      "text": "ahead with Spidey spin-offs for Venom and a Silver Sable/Black Cat Team-Up movie that I don't think you will ever see let's just put that out there right now okay Silver Sable, Black Cat I will be incredibly surprised if that happens I would too that sounds like some of that **** you talk about like when DC is like off in the weeds about their movies they're going to make anyway uh but Marvel is involved with those we had a very particular plan about Spidey himself Feige explained when asked why Marvel wasn't involved in Sony's projects for those characters although he kept those plans to himself he talks a little bit about James Gunn coming for Guardians 3 and working going then then he has this one that we've been talking about on the show a lot the whole Josh Brolin, Thanos, Cable stuff uh the geek world was a buzz last week when it was confirmed that Josh Brolin who plays Avengers: Infinity War's villain Thanos has been cast as Cable in Fox's Deadpool 2 quote we don't have",
      "start": 1205.36
    },
    {
      "text": "uh the geek world was a buzz last week when it was confirmed that Josh Brolin who plays Avengers: Infinity War's villain Thanos has been cast as Cable in Fox's Deadpool 2 quote we don't have anything written into our contracts about other roles that people can do said Feige when asked about the issue Indiana Jones and Han Solo are the same person it hasn't been a problem and I think Thanos and Cable are two very different characters interesting Feige has no plans for an R-rated movie he talks about I'll just read the quote for that because what he said before but it's still interesting my takeaway from both those films he's talking about Deadpool and Logan is not the R-rating it's the risk they took the chances they took the creative boundaries they pushed that should be the takeaway for everybody uh Marvel hasn't had to change humor is key sure and that's that those are the interesting tidbits all over on The Hollywood Reporter of course IGN's Stax was over there he did a whole bunch of",
      "start": 1241.96
    },
    {
      "text": "uh Marvel hasn't had to change humor is key sure and that's that those are the interesting tidbits all over on The Hollywood Reporter of course IGN's Stax was over there he did a whole bunch of stuff too where are you coming down right now with comic book movies first of all was anyone just taken back to like the fifth grade there where you have to read out loud yeah well that's the show every day I was like wait okay all right and then when you read the quotes I was like yep yep you did it like back when you were in fifth grade yeah yeah that's how I do it every time um where's like where do I stand on yeah are you excited still yeah I be super I'm super excited about Batgirl I heard about this back I I think Tim and Kevin told me about it and I was like wait what you know right now I'm like anything outside the baseball world I'm like wait what's happening who is the president yeah but I like I'm super stoked about that I'm really excited for Guardians of the Galaxy Vol. 2 um I mean",
      "start": 1281.68
    },
    {
      "text": "anything outside the baseball world I'm like wait what's happening who is the president yeah but I like I'm super stoked about that I'm really excited for Guardians of the Galaxy Vol. 2 um I mean I think they're fun right like yeah yeah 100% they're fun that's the whole point what kind I mean Tim Schafer is here yesterday he doesn't like him why because he sucks huh have we bought tickets for Guardians yes okay right yeah we did I I I had tickets for Fast in my thing and I think I have tickets for Guardians as well just making sure just thanks for check good check Andy Cortez how are you I'm doing great you ready for the Minority Report tomorrow hell yeah say it say it in your native tongue see you can't let them just win it's not winning Kevin it's celebrating it's celebrating Heritage they're mocking us Andy no one's mocking you we're a joke to them um but I mean I'm surprised that someone is against me too that's like just being against movies in general exactly come on they",
      "start": 1324.56
    },
    {
      "text": "they're mocking us Andy no one's mocking you we're a joke to them um but I mean I'm surprised that someone is against me too that's like just being against movies in general exactly come on they should be allowed to exist they're here it's time I'm excited I hope they don't **** up Spider-Man that's my major concerned I'm I'm heartened by how positive the buzz on Guardians has been yeah cuz Tim's all like it'll never be as good as number one it'll be best good best it will'll be good he keeps saying he doesn't talk like that I don't know why that's my Tim voice right now kind wait what no oh hella wa what yeah hella Cool Greg what's your what's your give me an impression of your brother stop stop doing that don't do that no more the things he said the most to you okay I appreciate that I appreciate that I think Guardians I mean I want Guardians to be great because I like Guardians once Hunter fell asleep in Volume 1 no asleep all the time was it cuz he was like he had not had enough",
      "start": 1371.92
    },
    {
      "text": "appreciate that I think Guardians I mean I want Guardians to be great because I like Guardians once Hunter fell asleep in Volume 1 no asleep all the time was it cuz he was like he had not had enough butter for the day or whatever he didn't have enough calories to stay awake yeah he just passes out he just passes out he's like a narcoleptic Alexis please female he knows he's about to go down you can't stop him you just can't no you really can't though though he wants to go to sleep he's going to go to sleep um but yeah I'm I'm excited like Wonder Woman's coming out I'm really excited for that I'm terrified but yeah you are I'm I mean I'm a DC fan yeah I'm just used to the world shoving **** in my face I just you know me okay that's fair but I'm I'm super hopeful um so far everything I've seen has been you like the trailers oh my God like blood pumps through I'm like yeah like I want to stand up in the theater and just be like yes I hope they don't **** it up I hope they don't ****",
      "start": 1415.6
    },
    {
      "text": "has been you like the trailers oh my God like blood pumps through I'm like yeah like I want to stand up in the theater and just be like yes I hope they don't **** it up I hope they don't **** it up me too but so far what I've seen and like I love Gal Gadot awesome man I just saw her in Keeping Up with the Joneses oh how was that movie I actually kind of really it was fun yeah she's in her underwear a lot or something right yeah she is but she's so beautiful and like I she's she's good I like her I like her that was actually really kind of but I watch it on a plane I feel like when you watch stuff on a plane it's it's always better yeah that's why I watch only my movies on a plane yeah X laugh out loud on the plane yeah exactly X-Men: Apocalypse is not that bad when you're on a six-hour flight you're like oh you know what this is better than staring at the wall exact exactly so I'm excited and like I'm going to be super excited if if and when they do Batgirl yeah I really hope they",
      "start": 1455.64
    },
    {
      "text": "you're like oh you know what this is better than staring at the wall exact exactly so I'm excited and like I'm going to be super excited if if and when they do Batgirl yeah I really hope they make it there I really hope he gets a crack of that yeah this whole thing doesn't implode on itself and burn out and die I'm all for these women superheroes being brought to life sure SJW um here's a question for you what's it like being married to a Major League Baseball player um in what way every way I mean like you're I you're like oh he falls asleep during movies well yeah he's pushing his body to its physical limit every day I'm sure to being training do all stuff and he's off he just left on a tour right to go play yeah on a tour on a tour is that what they call it is that what they call when baseball in a way tour right you go somewhere yeah well I think you know I do a lot of videos on my YouTube channel about this um oh sorry I should just watch those and not talk to you my no no it's",
      "start": 1495.12
    },
    {
      "text": "baseball in a way tour right you go somewhere yeah well I think you know I do a lot of videos on my YouTube channel about this um oh sorry I should just watch those and not talk to you my no no it's fine but like you know my grandma was really really sick last week and I had to fly out to New York and I think it's moments like that well no she's in she's in hospice but like it's okay okay she's I mean she's older and like I've terms with it and so you know you're you're okay with it when you know that's just the next step and at this point you want to um but it's moments like that where you realize like **** I have to do this on my own like Hunter can't leave a game he can't good point yeah you know like I have to like really just be strong and be there for my family when you want your significant other there and like to get that comfort but you just have to do it on your own and you have to be okay with it you know there's a lot of wives that have to give birth by themselves",
      "start": 1533.8
    },
    {
      "text": "your significant other there and like to get that comfort but you just have to do it on your own and you have to be okay with it you know there's a lot of wives that have to give birth by themselves because they can't leave a game like how do I get a hold of Hunter in the middle of a game sure parachute in somebody parachutes in yeah or yeah um you know I mean obviously there's ways but it's just it's a lot harder interesting yeah you I wouldn't think about that you know what I mean his life keeps on rolling no matter what so many different matter what yeah and so you know sometime if you plan ahead yeah you can do it like you can you know they have a paternity list where if your wife is getting birth you get on that for like 3 days like their pity Jesus um but for the most part you're you're on your own but you get like you you also live this amazing life but then there's a lot of like other stuff like I there's a tradeoff to it right yeah yeah but I mean it's interesting like our",
      "start": 1575.76
    },
    {
      "text": "you're on your own but you get like you you also live this amazing life but then there's a lot of like other stuff like I there's a tradeoff to it right yeah yeah but I mean it's interesting like our life is never dull our life is always like moving and grooving um I feel like you if anything you guys would get it too cuz you guys are always traveling you're always moving and you know doesn't stop for anyone exactly so it's kind of like that you're just always on the go you're always going you're just trying to make it work and and yeah but I don't know it's it's interesting How's being married in general how long you been married now it's been a few months yeah it's been a few months what what month are we in May, April so like five months um it's been good it's exactly the same yeah yeah you guys are already like obvious except I have way better Healthcare now that's it that it's exactly the same so yeah all right fine now here's what I'd like to point out now I'm not ever going",
      "start": 1620.72
    },
    {
      "text": "yeah you guys are already like obvious except I have way better Healthcare now that's it that it's exactly the same so yeah all right fine now here's what I'd like to point out now I'm not ever going to tell anybody how to do their job here you know that Kevin you're supposed to be teaching Greg how I'd run the show today right maybe today is not the day to play switch cuz like it was I was while Alexis is telling like the story about her grandmother I look at your screen and I see we're still minimized talking about the Marvel story now that's not on Cool Greg of course who we were literally like sit in this keyboard hit these buttons it'll be okay Kevin I mean let's blame everybody else it's not Cool Greg's fault it's not all right sure sure that's an opinion that's popular right now tomorrow when you're doing 20 years from now they won't it's insignificant let's move on great Point who's running it tomorrow Cool Greg by himself well you might have to come in here and help them out",
      "start": 1659.68
    },
    {
      "text": "when you're doing 20 years from now they won't it's insignificant let's move on great Point who's running it tomorrow Cool Greg by himself well you might have to come in here and help them out you know next story Eurogamer got the scoops that we all predicted and now they want to it's hopefully true uh Eurogamer says source is Nintendo to launch NES Mini this year uh Tom that's cool yeah right Nintendo will follow up its Smash Hit NES micro-console with a minute version of the SNES sources close to the company have confirmed a Eurogamer the SNES Mini or to continue Nintendo's official branding likely the Nintendo Classic Mini: Super Nintendo Entertainment System is currently scheduled to launch in time for Christmas this year development of the device is already underway our sources have indicated Nintendo's plans for an SNES Mini are also a major reason why last year's NES Mini did not see a reprieve from discontinuation Eurogamer understands despite the latter's continued",
      "start": 1705.16
    },
    {
      "text": "have indicated Nintendo's plans for an SNES Mini are also a major reason why last year's NES Mini did not see a reprieve from discontinuation Eurogamer understands despite the latter's continued popularity and sellout status uh last week Nintendo explained that it never intended NES Mini to be a permanent product from the perspective the micro-console was planned as a cool novelty item perfect for Christmas 2016 and the numbers in which it was manufactured and shipped were expected to be enough to suit this goal uh but NES Mini ended up breaking out to become more popular than anticipated and quickly sold out leading to a bustling resell market on eBay I think this is one everybody wanted predicted called for I hope they make more I hope so too so everybody I don't have to hear people **** about this name thing yeah which everybody for seconds was excited about and then just sits in your thing you never play it again yep did you get one no yeah I did not I wanted one but when it",
      "start": 1750.52
    },
    {
      "text": "about this name thing yeah which everybody for seconds was excited about and then just sits in your thing you never play it again yep did you get one no yeah I did not I wanted one but when it got announced I was like cool idea and then when it was like they're selling out left and right and blah blah blah and they sent us one I was like I'm not going to fight Colin and Tim for this thing you want to play with it don't you yeah can you play the old games on no no no it comes pre NES Mini came pre-loaded with 30 games and that was it you couldn't put more in you couldn't do anything with it really short cords for the controllers too there's a bunch of little Hang-Ups to it playing like this exactly yeah like you were when you were a kid though right on top of the TV that's true but I thought it was weird when I went and did the D.I.C.E. Awards um the gift bag we got and left with had an NES Mini in I'm like how did you guys get this many NES Minis to put in this gift bag did they answer",
      "start": 1791.44
    },
    {
      "text": "it was weird when I went and did the D.I.C.E. Awards um the gift bag we got and left with had an NES Mini in I'm like how did you guys get this many NES Minis to put in this gift bag did they answer you no I I'm about it I was like oh this is weird whatever and I came back and gave it to Tim and he was all happy he's super like there you go yeah well I'm excited for this I don't know if I'll get one but I'm excited to see what they put on get an NES so the biggest thing is just **** get the Virtual Console up and running on the Switch yeah come on I could be playing Super Mario World right now I wouldn't be because I have Mario Kart 8 Deluxe and it's great I'm going to crush Zigger a week from Friday I could be playing Zelda right now you could be we have to do a job I know it sucks you know what I mean we got a Cool Greg today also I'd like you to come here for a second my hair yes guys your hair to look like Pedro your hair is voluminous today and it looks real good I want you to know",
      "start": 1823.92
    },
    {
      "text": "what I mean we got a Cool Greg today also I'd like you to come here for a second my hair yes guys your hair to look like Pedro your hair is voluminous today and it looks real good I want you to know that this is a this is a this is a compliment not a not a knock you used should be Pedro for Halloween that's racist too no he's already he's literally cosplaying his Mick Foley every day he's going to be goddamn Cactus Jack this Halloween and we're all little racist if Avenue Q taught us anything we're all a little racist what's Avenue Q it's a play it's a Broadway play okay I saw I I remember Spider-Man: Turn Off the Dark that was another Broadway play did you really see it oh God I would have loved have seen it people getting killed left and right in that thing is well they didn't get killed Kevin they were getting all right Kevin with the Deep the Deep gasps you're making me Kevin no please stop don't do this Kevin it's going to be okay all right all right Kev I feel like checking in on",
      "start": 1860.84
    },
    {
      "text": "Kevin they were getting all right Kevin with the Deep the Deep gasps you're making me Kevin no please stop don't do this Kevin it's going to be okay all right all right Kev I feel like checking in on tips early that sound to you that sounds great all right cool I'm going jump in a tip see what people are saying we're starting at 10:04 where Josh Anderson gave us a tip and said hi guys for the past two weeks I've been kind of depressed because of a few things but you guys have always been there to cheer me up heart you guys FC a and then he gives a a gift thing it's a secondhand flying squirrel oh this is I know I saw this earlier on Reddit what uh yeah it's not bad actually if you want to open that gift and show it to people I'm not seeing it here in the tip from the at 10:50 whatever uh 10:04 for some reason it starts at 10:50 oh okay do you want to drop it in the thing I don't know if it's worth that much it's a tire that pops off and runs through and hits it you can go on Reddit it's",
      "start": 1904.72
    },
    {
      "text": "for some reason it starts at 10:50 oh okay do you want to drop it in the thing I don't know if it's worth that much it's a tire that pops off and runs through and hits it you can go on Reddit it's on Reddit uh Josh Anderson gave another tip hi guys again just want to let Tim and Nick know that they were great on the Rooster Teeth Podcast I've also been playing a lot of Persona 5 so here are some P5 related fun Clips I'm G I'll I'll judge this one Kev since you don't have it oh it's a Seinfeld one we I understand these have been going for a while it's funny I miss Seinfeld's who doesn't come on bring it back you know what I mean have you watched that new Dave Chappelle show on Netflix I started it and then I think fell asleep oh but I was like oh I love Dave Chappelle that's I do love Dave Chappelle he's a little different now but yeah like put out some weight cuz he was like string beans he's like crazy ripped like it's weird to see him so ripped but his show is like I don't know you",
      "start": 1948.0
    },
    {
      "text": "he's a little different now but yeah like put out some weight cuz he was like string beans he's like crazy ripped like it's weird to see him so ripped but his show is like I don't know you have to watch it I watch all thing yeah San Manate gave a tip and it's all in cap so I'll read it that way Greg Miller you little **** boy I hope you're ready to get **** slam jam next Friday in Mario Kart not on your **** life San Manate you're all going down I'm going to beat your asses especially Zigger and win 100 bucks doing it Mario Kart's coming up yeah but challenging the kids yeah this this like 1-year-old kid in the community Zigger he stepped up he's like I'll do it I'll stop you he can't stop me and then Sean Pitts back $50 on Zigger $50 match money involved so I'm winning 100 bucks off these kids I like it's going to be great and I'm going to crush him and just play what do you do with your 100 bucks uh you'll see okay you'll see I'm excited I'm probably just going to donate a",
      "start": 1989.32
    },
    {
      "text": "off these kids I like it's going to be great and I'm going to crush him and just play what do you do with your 100 bucks uh you'll see okay you'll see I'm excited I'm probably just going to donate a Textra Life uh gifted Dim63 just signed up to play Mario Kart with you last night just wanted to know how it will feel when you get stomped out by all the best friends we still going to be besties or no here's the thing let's get it let's get it let's get all the cards on the table or as I like to say all the Portillo on the table all right I'm going all in on this one all right P all the Portillo on the table am I going to lose some of these matches of course I am and I just put the dog on the table as a a visual gag that's it am I going to lose some of these matches of course I'm going to lose some of these matches am but I'm saying that I will beat Zigger within an inch of his **** life in Mario Kart that's done that's the bet I'm still tabulating how I want to run it because I like",
      "start": 2032.68
    },
    {
      "text": "some of these matches am but I'm saying that I will beat Zigger within an inch of his **** life in Mario Kart that's done that's the bet I'm still tabulating how I want to run it because I like it when there's other people there cuz that's really Mario Kart otherwise one-on-one matches is just like well somebody makes a mistake and then it's over there no stupid so we're working that part out Zigger is the one I'm coming for the rest of you you're all G to get a piece of it and you're all G to get your **** dicks kicked in or or your vaginas kicked in and just you'll have a concave thing down there unless I guess you have a vagina then I'm going to kick it the opposite way and then it'll be out cuz then this is the reverse you see what I'm saying I'm going to do the Kevin this is making sense right y or maybe you'll just make the vagina bigger oh yeah that's right bigger crush the pelvic socket Kevin you took biology that's where it the pelvic socket that's what the vagina is down",
      "start": 2071.4
    },
    {
      "text": "sense right, or maybe you'll just make the vagina bigger. Oh yeah, that's right, bigger. Crush the pelvic socket. Kevin, you took biology. That's where it, the pelvic socket, that's what the vagina is down there. All right, I'm going to crush thing. Crush all the dicks too, and you'll all just, you'll be really sorry. And that's how caves, that's, it'll be a bunch of caves, right? No one will be happy and that'll be the end of that. If you were wondering, yes, I was touching Portillo's penis that entire time. Oh God, he's my son, you know what I mean? Like I can't should be penis either. No, wait a second, wait, turn off the mic. You're not. I got a lot of questions about my upbringing, but like when, like, because it's the same thing, right? Like Portillo is 1, so like the cut off like for me was like 15, right? Right, it's right around there. YouLookDigital gave a tip and said, \"Here's my belated birthday tax with a little bit of interest for being late. Here's a quick but important question: Who is your go-to Mario Kart\"",
      "start": 2109.08
    },
    {
      "text": "right around there. YouLookDigital gave a tip and said, \"Here's my belated birthday tax with a little bit of interest for being late. Here's a quick but important question: Who is your go-to Mario Kart character?\" Of course, it's Dry Bones, duh. You know what I mean? He's back. Yeah, I don't have to choose anymore. Great. We talking about this earlier. I want to do a Mario Kart Let's Play today. You haven't played in forever. I haven't played in forever. Who was your, who was your go-to forever? Um, I'll probably pick Peach because, I mean, for obvious reasons. Sure, yeah, she's classic. Sure. Of course. Kevin, who do you play as? You were jumping around last night when we were playing. I haven't, I haven't determined that yet. Okay, my mic's off. I haven't determined that yet. Yeah, I, you know, I picked Peach when I first started playing Smash just because I liked her, um, and short dress, yeah. Um, but then now I'm Bowser, so we'll see, we'll see what I, what I evolve. Bring me up to speed on that too because we all played Smash",
      "start": 2155.04
    },
    {
      "text": "playing Smash just because I liked her, um, and short dress, yeah. Um, but then now I'm Bowser, so we'll see, we'll see what I, what I evolve. Bring me up to speed on that too because we all played Smash at IGN, of course. Yeah, but then you got, you're, you and Hunter are still super into Smash, right? Yeah, oh yeah, oh yeah. How you play? Um, we don't play actually as often anymore in season, but yeah, in season, but like when people come and challenge us, we're always, we're always game. That's the thing, like I love, we were Kevin and I were talking last night because I invited him over to play more Mario Kart. We were playing at the office yesterday. Yeah, Mario Kart's my ****. That's what I love to do. I'm so happy it's here. And he's like, \"Man, I can't wait for this with Smash because that'll be the exact same thing. We all have our Switches, we can just play at the desk.\" Hunter is so annoyingly good, yeah, at it. It's like, yeah, it really is upsetting. You're right, Kevin. Kevin confirming that Hunter Penn is very good at Smash. Uh,",
      "start": 2196.24
    },
    {
      "text": "have our Switches, we can just play at the desk. Hunter is so annoyingly good, yeah, at it. It's like, yeah, it really is upsetting. You're right, Kevin. Kevin confirming that Hunter Penn is very good at Smash. Uh, he's very good. Okay, yeah, it's like, why even, you know, why try? That was the thing with Jen where she's like, \"Oh, I can't wait to play Mario Kart with you.\" I'm like, \"No, you won't. I'm going to stomp that out of here real quick.\" Where like I have to actually form alliances with like Kevin, sure, to like the worst to go up against Hunter. Why hate on me, guys? Because somebody has to get hated on. I don't think so. Am I going to hate on the adorable dog, our lovely guest host, the guy who's donating his time to run the show and not getting taught anything? Yeah, am I going to hate on you, Peruvian MC Foley, sir? Yeah, I'm excited to see the new players. Let's go. Where's Mingus gave a tip and said, \"Met you at Hopsin Homon last week. Wanted to leave a tip and let you know the food was amazing. Amazing to meet you as well.\"",
      "start": 2240.4
    },
    {
      "text": "excited to see the new players. Let's go. Where's Mingus gave a tip and said, \"Met you at Hopsin Homon last week. Wanted to leave a tip and let you know the food was amazing. Amazing to meet you as well. Thank you for stopping to talk to my friend and I. It made our trip to SF.\" So here's the story. Last week I went out to dinner with a couple of The Walking Dead castmates. Cool. Um, they're friend Stephen H. Friend, you remember Stephen? You met the up noon. Uh, I'm like, I need to set up dinner reservations. And I'm running through the list of the thing we just did in the show. Where do I want to take them? And they're downtown. It's, I'm like, perfect. I'm like, \"Is it either going to be Hopsin Homon or Wayfair Tavern?\" Yeah, make my reservation. Really great place. Exactly. It's been, it was a long day, but I was excited to see my friends. Make the reservations days before. Take the Uber down. Get to Hopsin Homon. I'm walking in the front door, or to the front door, and Where's My Dingus pops up. He's like, \"Holy ****, Greg.\"",
      "start": 2283.68
    },
    {
      "text": "see my friends make the reservations days before. Take the Uber down. Get to Hopsin Homon. I'm walking in the front door, or to the front door, and Where's My Dingus pops up. He's like, \"Holy ****, Greg Miller!\" And he's like, \"We're only here because of you. We came from Colorado. We saw this music group. It was great.\" Oh, this is so. I'm like, \"Yeah, really go to these places we say to go to.\" He like, \"Yeah.\" I'm like, \"All right, cool. Have a good meal.\" I go in there. I'm like, \"Yeah, dinner reservation for four, Greg Miller, 7:45.\" And he looks, he goes, \"I don't see it.\" I'm like, \"Oh, I made it an OpenTable.\" And I bust out my phone and the OpenTable notification pops up and it's like, \"Your 7:45 dinner reservation at Wayfair Tavern is now.\" And I was like, \"See you later.\" Went to the wrong restaurant. Totally confused it in my head. And but like they're four blocks away, but it's still like I feel like an idiot. Yeah, I'm a **** ****. Portillo will never respect me again. Don't be that hard. Okay, thank you. Okay, Andrew",
      "start": 2319.24
    },
    {
      "text": "in my head. And but like they're four blocks away, but it's still like I feel like an idiot. Yeah, I'm a **** ****. Portillo will never respect me again. Don't be that hard. Okay, thank you. Okay, Andrew Dixon gave a tip and said, \"Greg, what is going to be your revenge on Nick for eating your peanut butter? Also, have a fun clip.\" Wait, Nick ate peanut butter? Kevin says the clip sucks. Yeah, Nick, I bought peanut butter for my uh, breakfast yogurt. I put a little spoonful of Nutella or peanut butter in there. Ooh, wah. I've never heard of that. Oh yeah, yeah, it's good. It's real good because I get the vanilla. Try that. Some apple. People don't put apple in there either. I put apple in there. Put apple in there. It's delicious. Gala Apple. Yes, do you know what a G? Oh yeah, yeah, trust me, I know my apples. Okay, yeah, no, I know that. Yeah, apple amazing in yogurt. A few when we were in Vancouver for the Heel Kick movie, Nick started talking about how he was eating peanut butter at the office and then he was like, \"By the way, is\"",
      "start": 2355.88
    },
    {
      "text": "that yeah, apple amazing in yogurt. A few when we were in Vancouver for the Heel Kick movie, Nick started talking about how he was eating peanut butter at the office and then he was like, \"By the way, is that yours?\" And I'm like, \"Yeah, I opened it up the other day.\" And I was like, \"Did I eat Nick's peanut butter?\" Is I had like one spoonful and Nick ate the other three-quarters of it. And it's not of there. It's on Rooster Teeth though. He made this big thing on on the podcast about like how he had like played me and I called him out. I'm like, \"**** fabricating the truth.\" Yeah, I'm going to my revenge will be taking back the Nintendo World Championship from him when he gets here. For a big game. Yeah, I do. He has the World Championship. He does. What? He beat me in One-Two Switch Yoga for it and then he somehow beat me in Snake Pass again for it. So that's true. There were some inside information, but we'll let it go. Doo **** me, but it's no big deal. Ill Al gave a tip and said, \"Lexi, you're a goddess. Heart. Also, I just\"",
      "start": 2398.8
    },
    {
      "text": "in Snake Pass again for it. So that's true. There were some inside information, but we'll let it go. Doo **** me, but it's no big deal. Ill Al gave a tip and said, \"Lexi, you're a goddess. Heart. Also, I just finished the game Som last night. One an underrated title. I recommend it to the Kinda Funny Best Friends. If you beat it, feel free to discuss with me. My Twitter name is ililorelal.\" Well, you're a goddess. Thank you. I'm super flattered. Killface13 says, \"Been listening since Beyond. Love you guys. I go to San Jose State and I'm researching how I can redesign the PlayStation App. Can you share the link so I can get feedback?\" Don't mind if I do. Hold on. Do this. Go here. This app. Spamming it three times, four times, five times. There you go. Go get your feedback. If if he asks for passwords and Social Security numbers, don't give it to him. Uh, that's just, yeah, that's just. Ry says, \"I want to hear Alexis's Chad voice.\" Great point. What the heck is the Chad? You've met Andy Cortez, yeah, the latest hire of Kinda",
      "start": 2437.72
    },
    {
      "text": "numbers, don't give it to him. Uh, that's just, yeah, that's just. Ry says, \"I want to hear Alexis's Chad voice.\" Great point. What the heck is the Chad? You've met Andy Cortez, yeah, the latest hire of Kinda Funny. Yeah, love him. Right before we hired him, we hired Chad. Now Chad, of course, well, Portillo loves Chad for different reasons. Chad, of course, the thinking Piranha Plant puppet. And so everybody puts them on and every, all the guests have a different voice for Chad. We have different voices for Chad. So you have to put it on and feel out a voice for Chad and say some stuff. Wait, do I have to be in the shot? Or yeah, no, we, we're not really. I want to be really realistic. Oh, then yeah. Hey, Chad, how's it going? Hello, how are you today, Greg? It's always a pleasure to see you. Good to see you, Chad. I like your accent. Why, thank you, kind sir. That's Chad's voice. That's good. That was good. No, I like that a lot. It's kind of uppity, but no, it was good. No, that was the first time he's up. Oh, bada bing bada boom. That's the",
      "start": 2488.36
    },
    {
      "text": "why, thank you, kind sir. That's Chad's voice. That's good. That was good. No, I like that a lot. It's kind of uppity, but no, it was good. No, that was the first time he's up. Oh, bada bing bada boom. That's the first time Chad's ever sounded educated on this show. Really? Yeah. Oh, mine's usually just a drunk. Well, good day. Nick's is just Nick's voice. Nick's just Nick's voice. Tim's sounds like Chad just got hit in the head with a brick and it's trying to talk it out. Stephen Augs was just a a really bunch of mouth noises. Best uh, grow up. He really is. Grow, grow up. Joe gave a tip and said, \"Hey, Greg, will there be a Heel Kick screening in SF before Kinda Funny Live 3? Also, do you have a girlfriend, Kappa? And can you ask Chad what Mario games he has been in and will he be at Kinda Funny Live 3? Thanks.\" Uh, unconfirmed, but almost there, that yes, there will be a Heel Kick screen. I thought you were going to say girlfriend. Uh, Heel Kick screening in SF, uh, before Kinda Funny Live 3. Uh, off the record, I don't even",
      "start": 2538.36
    },
    {
      "text": "but almost there, that yes, there will be a Heel Kick screen. I thought you were going to say girlfriend. Uh, Heel Kick screening in SF, uh, before Kinda Funny Live 3. Uh, off the record, I don't even know if it's off the record, but I think they're looking right now at a midnight showing going. So Saturday, 1:01 a.m. is what they're looking in before that day of Kinda Funny Live. But there'll be information when that's confirmed. I'll let you know. That's still totally out there. Who knows? Um, I do have a girlfriend. Her name is, you love my life. Uh, Chad, what Mario games have you been in? Mario 1, Mario. How's it feel, P? This is what you did all your toys. Now he's doing it to you. And we'll chat at Kinda Funny Live 3. We have no announcements to make on who will or will not be at Kinda Funny Live 3. So we should just chill out on that front. All right, you'll know when you need to know. P really wants Chad to know when you need to know. When you, when you, it's on a need to know basis and you don't need to",
      "start": 2586.28
    },
    {
      "text": "so we should just chill out on that front. All right, you'll know when you need to know. P really wants Chad to know when you need to know. When you, when you, it's on a need to know basis and you don't need to know yet. Um, I'm going to pause tips there. Jump back into the stories. How's that sound, Big Kev Dog? Yeah, thank you, Big Kev Dog. Greg. Now, Greg, thanks, Cool Greg. No problem. Yeah, next story comes from Moviepilot.com. The first trailer for Syfy's Krypton shows the origins of Superman's home planet and connects it to the DCEU. This is Antonio FM. Uh, prequel comic book TV series have had their ups and downs. Between Gotham and Smallville, many things in Batman and Superman's origins have been changed, an attempt to make it more satisfying series. Oh, more satisfying series. But in the end, the show didn't. When are we getting to this thing? Okay, can we just watch the thing? You want to watch it? It's on Vimeo, so I don't think we're going to get dinged. So scroll on down. Uh, now why this is important as as you",
      "start": 2641.56
    },
    {
      "text": "are we getting to this thing? Okay, can we just watch the thing? You want to watch it? It's on Vimeo, so I don't think we're going to get dinged. So scroll on down. Uh, now why this is important as as you guys prep it for us to watch is we got to give a shout out to Cameron Cuff. Cameron Cuff. Okay, Cameron Cuff. I've seen for a while now in my verified mentions. He's a Kinda Funny Best Friend. Comments on everything. Does all these different things. When I click through months ago, maybe even a year, it said he was going to be in this show. Great. Cameron Cuff all over this **** trailer. Great. I hit him up today via Twitter. I was like, \"Hey, congratulations.\" He's like, \"I, I can't believe I'm talking to you. I've been there since GameOverGreggy episode one.\" I'm like, \"Well, ****, now we're on Bo.\" Even better. I was like, \"I'll go out of my way. I probably never would have talked about a show based on Superman, but I will for you and talk about it and give you something.\" So everybody give Cameron Cuff some love. Yeah.",
      "start": 2686.2
    },
    {
      "text": "like I'll go out of my way. I probably never would have talked about a show based on Superman, but I will for you and talk about it and give you something. So everybody give Cameron Cuff some love. Yeah, let's watch the trailer. Oh, well, I got an exclamation point. I don't know what that means. It's like a NASA. Once. I hope it's really good then because Kinda Funny Best Friend, we want to support him. You can all hit up Cameron Cuff. Send my future. \"Grandson, by the time you hear these words, your birth world will be a distant memory. The House of L led a revolution against tyranny. The story of your family isn't how we died, but how we lived.\" It's awesome. I'm pretty sure he's the main guy. Everybody send sweet nasty love to Cameron. I'm spamming him in the chat right now. I'm pretty sure he's the main guy. Yeah, I, he looked like it. He was like the only one of three faces that we saw. Huge for him. Huge that you know, see the Kinda Funny Best Friends doing cool stuff. Yeah, really cool. He supported us. We'll",
      "start": 2726.2
    },
    {
      "text": "yeah, I, he looked like it. He was like the only one of three faces that we saw. Huge for him. Huge that you know, see the Kinda Funny Best Friends doing cool stuff. Yeah, really cool. He supported us. We'll support him. Yeah, it'll be interesting. Like I personally, as a Superman fan, I don't really give a **** on what happened on Krypton. So it's like, I don't know, but like I'll check this out, you know what I mean? Of course I have to. And and then how does he know his grandson who isn't born yet? Cool Greg, guess I know now. The Codex. Remember, remember the Codex for Man of Steel? They put it into Kal's DNA. Remember they had the one skull? You remember this? Jor-El jumps off that **** flying thing in there. Grabs the Codex. Who remembers the Codex? This all made a lot of sense in the movie, didn't it? I like Cory Wick. Spoilers. It explodes. Thank you. Thank you for the spoiler warning and everything. Uh, GameSpot. Oscar de says, \"Ubisoft opens two new studios, one working on an unannounced AAA project.\" Ubisoft,",
      "start": 2792.4
    },
    {
      "text": "Cory Wick, spoilers, it explodes. Thank you. Thank you for the spoiler warning and everything. Uh, GameSpot. Oscar de says, \"Ubisoft opens two new studios, one working on an unannounced AAA project.\" Ubisoft, publisher of everything you already know about, I don't need to say this, is expanding by opening two new development studios in Europe this year. The first will be based in Berlin, Germany, and will work closely with the Ubisoft owned Blue Byte on an unannounced AAA Project. Blue Byte most recently made Anno 2070 and assisted Ubisoft Montreal on the development of For Honor and Rainbow Six Siege. Ubisoft is currently working on a new Assassin's Creed game. While the company says it will release when it's ready, it's also likely the publisher is working on other upcoming projects. Meanwhile, Ubisoft Bordeaux will operate out of the southwest of France and assist the company's other French studios, including those in Paris, Annecy, which is a made-up thing, and Montpellier. Montpellier, I would have figured",
      "start": 2831.8
    },
    {
      "text": "will operate out of the southwest of France and assist the company's other French studios, including those in Paris, Annecy, which is a made-up thing, and Montpellier. Montpellier, I would have figured your French got a lot better. I'm nailing it actually. Oh, are you? Yeah, I'm crushing that. Jen's watching right now and she's like, \"Oh, we.\" She totally like, \"M.\" Have you picked up any French? We, we, no, I mean, like a little bit here and there, but I mean, like, I don't know, it's it's more dusting off everything I learned before. Yeah, exactly. You took French? Oh yeah, oh, two years in high school, two years in college. Well, isn't that fate? Exactly. If only I kept it up so I could talk to her family at all. But I person, I say, \"Tabarnak.\" They like that a lot. Oh, nice. A curse word. Yeah, there you go. What does it mean? ****. Oh, okay. What? It's like any any any of the church words apparently, like Tabernacle, Tabernacle. You could use other church things like chalice and **** and all that. It's like Cy too. I don't know, it's all very",
      "start": 2876.92
    },
    {
      "text": "confusing for me, but I know Tabarnak. That's good. I know my name is. That's good. On little. Yeah, where's the bathroom? Où the bathroom? I forgot what the bathroom is, but I got the rest though. Oui, you know what I mean? Oui is. Oh, I thought you were saying PE soup. PE soup. I thought PE soup was the same here. Yeah, uh, final couple things we'll go through real quick over at IGN. Luke Riley says, \"Documentary about GoldenEye on N64 in production.\" An Australian-made documentary seeking to explore and discuss the history and impact of GoldenEye 007 on N64 has been announced today. GoldenEra will examine how an inexperienced team were able to defy expectations and build one of the most respected and influential console shooters ever. Uh, there is an Indiegogo campaign there. You can go",
      "start": 2926.56
    },
    {
      "text": "GoldenEra will examine how an inexperienced team were able to defy expectations and build one of the most respected and influential console shooters ever. Uh, there is an Indiegogo campaign there. You can go get it. There's a thing there. I think they say, yeah, and after speaking with several of GoldenEye developers, as well as many industry veterans from IGN and Kotaku, GameSpot and Good Game, we found a story that's more uh, interesting to be told. They're trying to raise 85,000 and I do believe Pair is going to get uh, interviewed in there, which is cool. Cool. We know Pair. Go Pair. Yeah, yeah, yeah, yeah, yeah. Um, and then skip the Rocket League one. Oh, shout out to Rocket League. I guess it's right there. They have 30 million players around the world. People playing that game. Go get him, Jeremy Dunham. And then I put in a fun clip, Kev Dog, from Twitter. Love fun clips. These people, uh, there's a tennis match going on and then some people somewhere with an earshot are **** and it's so loud that it ups the tennis",
      "start": 2972.12
    },
    {
      "text": "put in a fun clip, Kev Dog, from Twitter. Love fun clips. These people, uh, there's a tennis match going on and then some people somewhere with an earshot are **** and it's so loud that it ups the tennis match. What? Can you hear this? Yeah, and you hear them faintly, but then the announcers do talk about it. So yeah, we're going to pause it, dial it back, crank up. This came from a Kinda Funny Best Friend on Twitter right before the show went. They send it in. There's two parts. The second one, the announcer is like, \"He can't be that good. This is crazy.\" You guys, once again, love 15R. We'd have to crank it up, I think, on the TV to hear it. But you see this guy start reacting right here. Well, that is the most bizarre situation. I don't know how to put this BS, but somebody's phone going off in the stand. Wait, I can't hear it. Yeah, you need headphones. I for us to hear, but you can hear the announcers talking about it. They're talking about a phone going on an adult video. I don't think that's what it is. Oh, it's an",
      "start": 3014.0
    },
    {
      "text": "hear it. Yeah, you need headphones. I for us to hear, but you can hear the announcers talking about it. They're talking about a phone going on an adult video. I don't think that's what it is. Oh, it's an adult video. No, no, no, no, no. This is like your AT&T thing and you hear people ****. You'd think that, but the next one, I think, is them talking about that someone somewhere is ****. That is crazy. Yeah, first of all, kudos to you guys for having sex in the stand. It was near shot. Yeah, where this is like, good for you guys. 15. I still hear it. It's still going. What is going on? It can't be that good. Who? Can you hear it? Yeah. Oh, that's fine. It can't be that good. The audience heard it maybe or not. And you can go find it if you don't want, if you didn't hear it. Look at them. They all want to hear. They all love that ****. Don't that ****. P kissing my weiner. Talking about ****, Kev. Oh man, if you didn't know, ladies and gentlemen, this is the Kinda Funny Morning Show each and every weekday here on Twitch.tv/",
      "start": 3091.24
    },
    {
      "text": "Kinda Funny Games. We come to you with the nerdy news you need to know about before jumping into the chat to answer your questions, comments, and concerns. But in between those two segments, I reaching the internet, grab a video game and toss it to one of you. How do you win it? It's simple. Be in the chat like you are if you're watching right now on Twitch.tv/games. Or if you want three other ways to win, which benefit the people who are watching on YouTube.com/KindaFunny later or listening on podcast services around the globe, there are three other ways to do it. Number one, subscribe to us on Twitch. That means you don't have to be here. You're automatically entered to win anything we give away on Twitch. It's great. Everyone loves it. Plus you get the Kinda Funny log next to your name. Do not jump. You",
      "start": 3152.28
    },
    {
      "text": "that means you don't have to be here. You're automatically entered to win anything we give away on Twitch. It's great. Everyone loves it. Plus you get the Kinda Funny logo next to your name. Cool emotes, private chat time with us. You get to play multiplayer games with us like so many of you are doing on April 28th when I bury Zigger in a grave of his own choosing in Mario Kart 8. Then you get the show ad-free unless we bake them in. We're not baking them in today. Uh, plus remember if you have Amazon Prime, you have Twitch Prime, which gives you a free subscription here, which would be great to use on us. Don't you want to take some of that money back from Amazon? You spent so much on them. Take it back from them. Give it to us. Use it all. Or or or Lexi or me. You are really good. What I like about it as being a subscriber, I like the P-Mail I get. I like, I like communicate in that way. Yeah, yeah, I do two newsletters a week. It's pretty fun. Yeah, so give it to one",
      "start": 3195.04
    },
    {
      "text": "are really good. What I like about it as being a subscriber, I like the P-Mail I get. I like, I like communicate in that way. Yeah, yeah, I do two newsletters a week. It's pretty fun. Yeah, so give it to one of us. And I do a lot of mail outs too. Get to know my mail stuff to subscribers. I got my, I still have my uh, P Glasses. I wear them quite often. Oh good. I, I've seen, yeah, I've seen you. My favorite was when I was doing Pair. I was taking a very important business call and I did put them on and Kevin took a photo of me doing them. I saw it. I like, um, if you don't want to do that, you can go to Patreon.com or Patreon.com/KindaFunnyGames. If you give us $5, you're entered to get into every giveaway we ever do. You have a great time. You enough to be here. You win. And guess what? Today from Patreon.com/KindaFunnyGames, the random number generator chose Thomas Layfield. Thomas Layfield, you are winning Graceful Explosion Machine on the Switch. Congratulations. Way to go. Nailed it. Crushed it. Killed it. Uh, let's finish off",
      "start": 3230.16
    },
    {
      "text": "the random number generator chose Thomas Layfield. Thomas Layfield, you are winning Graceful Explosion Machine on the Switch. Congratulations, way to go, nailed it, crushed it, killed it. Uh, let's finish off the tips, then we'll go outside and start barbecuing. How's that sound, big Kevdog? That sound good? You guys, I'm not just saying this, but Greg is actually a really good chef. #CookingWithGreggy. Yeah, he's actually, I was like, really impressed by your meats. Most women are, and most boys too, not men, boys, boys. Uh, yeah, you're really good. Thank you. I love it, I love it, it's great. Um, closing out these tips then, uh, I think Kill Kill Face 13 gave the app again. Thank you very much, we already did it. Uh, the Riddler, ha, it is I, the Riddler. Answer this and I will tip next week. Kinda Funny League, you will always find me in the past. I can be created in the present, but the future can never taint me. What am I, Kevin? I need your brain time. You can find me in the past. I can be created in the present, but the future",
      "start": 3274.04
    },
    {
      "text": "find me in the past. I can be created in the present, but the future can never taint me. What am I, Kevin? I need your brain time. You can find me in the past. I can be created in the present, but the future can never taint me. Taint is, taint is what I'm queued in on. What do we use taint for? You always find me in the past. I can be present. Is it a memory? Yeah, all right then, memory. Thanks, Kevin, you're a good Batman memory. Uh, Ryuji is my pal. When is Kinda Funny having a big and tall store? #ActuallyTeamFat. We've talked about this, as you know, stores in the online variety, they don't go up all the time for that, you know, the 3X, the 4X, the 5X. What do we want to do? We were talking about like Fat Tuesday one day where we did it, we're like, \"Fuck it, we're only selling shirts that, you know, are like four to five.\" I love that idea. I love that idea too. So we've definitely thought of that. We've heard that since District Lines. We understand the problems of being Team Fat. We're working on it, but we also have",
      "start": 3330.84
    },
    {
      "text": "five. I love that idea. I love that idea too. So we've definitely thought of that. We've heard that since District Lines. We understand the problems of being Team Fat. We're working on it, but we also have to keep the business afloat and there's a lot of problems going on too. Um, Ill Al tipped again, said, \"Correction, SoMo wasn't underrated, it was rated quite highly actually. It was just largely overlooked.\" And again, \"Lexi, goddess, wow guys, thank you. Greg, you too, you're goddess. Show more often. You too, Cool Greg.\" Smiley Micon, \"Wow, I'm blessing nothing for you, Kev. I'm sorry, nothing for you. This is awkward.\" Ant Gore 06 says, \"Finally subbed, got my Twitch link to my Amazon. Here are some money.\" Thank you very much. Take it back from Amazon, they've taken enough from you. I don't know why you got to stop saying that. I want to motivate the people though, you know. Dark. C says, \"Cheers for all the entertainment while I finish this animation assignment. It's 4:00 a.m. here. Holy shit, yaa, go to bed, finish the work, Mr. Penguin.\"",
      "start": 3392.36
    },
    {
      "text": "to motivate the people though, you know. Dark. C says, \"Cheers for all the entertainment while I finish this animation assignment. It's 4:00 a.m. here. Holy shit, yaa, go to bed, finish the work, Mr. Penguin.\" Von Penguin says, \"I'm going to play Mario Kart with you, but I'm going to lose because I out have practiced. I would gladly team up with you to Take On The World. Dibs on Yoshi.\" Okay, go get him. Yeah, New Flash gave a tip, \"Delayed birthday tax.\" Quick question, Greg, since the Invincible movie is happening, can we get a GameOverGreggy show topic about Invincible and why you're pumped for the movie? Could discuss what the movie could cover. Not a bad idea. We've done the Invincible thing before, we've talked about it before, but a new angle on it would be good. But the problem is always, I find the Invincible stuff, I love it, I try to do it, and then people don't, people don't get motivated to watch it. Yep, so I got to wait, strike when the iron's hot. That's true. Get Seth Rogen's ass in here, ask him the question.",
      "start": 3437.16
    },
    {
      "text": "I love it, I try to do it, and then people don't, people don't get motivated to watch it. Yep, so I got to wait, strike when the iron's hot. That's true. Get Seth Rogen's ass in here, ask him the question. Yeah, everybody tweet Seth, everyone tweet Seth Rogen. Brandon Rose, \"Say, hey Greg, take away Mario Kart and Prey, what game are you most looking forward to next? Love what you've all been doing, keep up the awesome work. Here's a long but fun clip.\" Was it fun, Kevin? He didn't watch it. Great. Look at him. Next. I'm just gonna say no. How's that? Fine. Good. Next game looking forward to that isn't Prey or Mario Kart. Oh no, actually I did. Wait, no, that's not. I don't know. I don't have a good answer to that one because I'm so hung up on those two games. Um, Patapon, but we don't have a release date on that because you're talking like soon, right? That's what you're saying. Yeah, no, this is, I mean, Patapon should be here before then. That Uncharted. Uh, of course, a too long. I have one. What do you got? Ironhide is coming out",
      "start": 3477.12
    },
    {
      "text": "talking like soon, right? That's what you're saying. Yeah, no, this is, I mean, Patapon should be here before then. That Uncharted. Uh, of course, a too long. I have one. What do you got? Ironhide is coming out with a new game, uh, called, I think it's like Iron Marines or something. Um, I probably have that name totally wrong, but I'm super excited that I really like that gaming studio. So, okay, I'm, I'm looking forward to that guy. Josh Anderson gave a tip and said, \"Hey guys, again, just want to send another fun clip and want to quickly mention that what I have been depressed about is the passing of my cat, but FC, what does FC mean?\" I don't know. I'm coming to a point now where like I have to Google acronyms. WYD without looking it up. Y, what, what are you doing? Yeah, says it all the time. Oh, final tip comes from Thud 1. Call and tips. This one is for Lexi. I'm a longtime Astros fan, so of course I'm a big fan of your husband. I took your advice on Kat Robata. Oh, Kat Robata, yeah, and loved it. Sushi. Okay, next time you're",
      "start": 3519.72
    },
    {
      "text": "1. Call and tips. This one is for Lexi. I'm a longtime Astros fan, so of course I'm a big fan of your husband. I took your advice on Kat Robata. Oh, Kat Robata, yeah, and loved it. Sushi. Okay, next time you're in, you next time you're in the H, you should go to Latin Bites. Okay, I will check it out. I will put it on my to-do list. To-do list. You can't eat sushi. Okay, I told you, you can't eat sushi. No, it makes it really, really sick. No, that's a nightmare. And some days I'm like, \"Screw it, I milkshake sushi.\" Yeah, yeah, we were, we were going to go watch a movie and she was like, \"Huh, should I get sushi first?\" I was like, \"No, you're going to die.\" No. Um, but sometimes Kat Robata is actually the only place in Houston, believe it or not, sushi in like the desert. Who would have thought? Who would have thought? But actually, that's like one of the best sushi spots in the United States is there. And it's probably because it's the fresh, like one of the most fresh. I think what I'm allergic to is the preservatives they put in sushi. So the place",
      "start": 3567.0
    },
    {
      "text": "the best sushi spots in the United States is there. And it's probably because it's the fresh, like one of the most fresh. I think what I'm allergic to is the preservatives they put in sushi. So the place Kevin took me to probably didn't have the freshest. You've never gotten sick from sushi. I've taken you. Well, we've never really gone to. I know, 'cause like you're like, \"Hey, I'm allergic to sushi.\" And I'm like, \"Let's not ever find out.\" IFI. Yeah, but his a Dragon Roll did look really good. Yeah, have you been to Japan? I have. Have you ever, did you go to the fish market? No. I Shacks right there. It's like just right up ocean boat into your stomach. The dude like owns the Toilet Company, giving you one of those fancy toilets. Lotto, sure. Oh, friends with Lotto? No, friend of a friend, friend of a friend. Yeah. Oh, he got traded. So I, I was too afraid to like, \"Hey, sorry you're leaving, but what about that toilet?\" Ask. Love to hear with that toilet, toilet. Yeah, to clean your butt. Oh yeah, no, a bidet. Yeah, I know. Oh, I know, trust me.",
      "start": 3618.52
    },
    {
      "text": "so I, I was too afraid to like, \"Hey, sorry you're leaving, but what about that toilet?\" Ask. Love to hear with that toilet, toilet. Yeah, to clean your butt. Oh yeah, no, a bidet. Yeah, I know. Oh, I know, trust me. That's, that's the dream. When Greg Miller gets a house he owns, we're getting that one Japanese luxury. Like that's, have you used these things, Kevin, when you're, I love going to, I got a poop in Japan in public and you go into these places and you sit in and it's this thing and it's awesome and it plays music and sound effects. So like, like warm. Why is this not happening everywhere? Yeah, it's true. I don't know about a public one of those, but I, they haven't figured out in the Tenderloin. They got public restrooms with a security guard right outside the door. Pretty cool. I like it. It's only during the day so the homeless don't go in there. I would rather pee my pee than use a public restroom. The Tenderloin. I've got H tickets for pee in public. So I don't, yeah, that's how they get you. They do get you there. Okay then.",
      "start": 3664.72
    },
    {
      "text": "homeless don't go in there. I would rather pee my pee than use a public restroom. The Tenderloin. I've got H tickets for pee in public. So I don't, yeah, that's how they get you. They do get you there. Okay then. I'd rather pee myself, still get a ticket. That's still peeing in public. All right, it's time to switch over to barbecue mode. I'm going to start barbecuing and stuff. Get out there, put the mics on. Okay, cool. Those head, are we switching mics? Yeah, you got to go wireless now. You guys are so fancy here now just for barbecue. I love it. All right, that's good 'cause my computer died. Oh really? Wow, you burned through that 30%. I did. I'm going to bring mine out there. It'll die too, but we'll do the chat and throw down a black power. Well, it got to be black, huh? Uh, still once we have, we don't have the orange ones. Kevin, I unmuted my microphone. Okay, I don't know why your face makes me want to sing to you, but he's adorable. That's one. Is your mic on? It's not. We can hear yours. I'm up, I'm up and running. Yep, yep. Come here.",
      "start": 3712.96
    },
    {
      "text": "I unmuted my microphone. Okay, I don't know why your face makes me want to sing to you, but he's adorable. That's one. Is your mic on? It's not. We can hear yours. I'm up, I'm up and running. Yep, yep. Come here. Let me fix it. Let's all go to a barbecue. Let's all go to a barbecue. Let's all go Barack his laptop and have ourselves some barbecue. There you go, buddy. There you go. Thank you. I love you. Don't tell, don't tell anybody, but like, I really like you. I, you know, I played up for the cameras, but I just want you to know how much I like. Play it for the cameras. Play it for the cameras. You know that I don't like you. You're, you're my favorite one. I've been thinking about leaving. Like, we can't take another. You know that, that's why we're gonna go together. You're getting out. That's what Colin said when he just left. I know. Well, he said it, but he didn't mean it because he confuses you with Andy all the time already. And I get that we Spanish. I know. Exactly, exactly. That makes sense. That makes sense. I'm just saying.",
      "start": 3757.8
    },
    {
      "text": "I know. Well, he said it, but he didn't mean it because he confuses you with Andy all the time already. And I get that we Spanish. I know. Exactly, exactly. That makes sense. That makes sense. I'm just saying like, well, turn on my mic. Oh, wait, what? But that was great. Yeah, good talk. Don't worry everybody, we're just talking about the future. Kinda Funny, big deal. We're all here for the next 30 years. Get a barbecue when you get the blues. Come on and get a barbecue when you get the blues. Got the dirtiest job in like, if you leave that place, Wind Third Street. What? So fucking funny. Oh, fuck. I wiped down. You're just funny. What? I'm just saying like, don't like you. What are you eating? There's no food out here for you. Okay. Um, hey, it's barbecue when you get the blue. Now, Kevin, yo, here's the question. Y, we, uh-huh, have frozen pizzas. Sure. Do we could do one of the frozen pizzas here and then some of the ribs here, but you know, ribs take a while. Do they? Yeah, ribs take like 30 minutes. The pizza is only going to take",
      "start": 3818.84
    },
    {
      "text": "frozen pizzas. Sure. Do we could do one of the frozen pizzas here and then some of the ribs here, but you know, ribs take a while. Do they? Yeah, ribs take like 30 minutes. The pizza is only going to take like 18. But the problem with the, the pizza, so you looked up the, the pizza. Yeah, it cooks at a lower temperature too. Okay, so like I, but I could do hotter over here, but you know how it's going to keep in. Should we not fuck around and should we just do the ribs? Fuck around. Fuck around. See what happens. Fuck around. I'm going to go get Lexi 'cause I don't know his left in there. Can you also bring me my power? Oh yeah, just my sunglasses. Really getting a lot of text over here. Texting back to say, \"Go Cy.\" Come here, come here. There. And now you come here. We're going to get barbecue in the background. Yeah, which way you going? I'm going, I, I can only do it with my right hand. What's happening in the chat everybody? Keeping yourself entertained while we do this. Yeah. Oh, fun clip. FC me fun clip. Hey, look all the, the",
      "start": 3890.48
    },
    {
      "text": "way you going? I'm going, I, I can only do it with my right hand. What's happening in the chat everybody? Keeping yourself entertained while we do this. Yeah. Oh, fun clip. FC me fun clip. Hey, look all the, the, the, the hat and stuff you left here. Thanks. Power brick is what I said. Yeah, got that. Was there anything else? Uh, I mean, what a great Cool Greg cleaning this stuff off. Yeah, sorry. No, not really. No, we're fine. Okay, I'm not, I'm not going to lie, probably going to drink a beer, right? Do we got beer? Yeah, yeah. Okay, good. 'Cause it's a nice day. It is nice. It's a beer kind of day. It's a beautiful day, beautiful day. Not one of them shitty days. Not one of them fuck days for sure. Let's all remember though, we're miked, so let's, you know, when we go inside, Alexis, don't say the horrible things, you know. Don't here. Don't be a Nick. Alexis, do you mind that Portillo is staring at your tits in this photo? What? I don't, you know, I'm actually kind of flattered. I'm saying that's going to be the comment. Can I see how hard he's",
      "start": 3953.44
    },
    {
      "text": "be a Nick. Alexis, do you mind that Portillo is staring at your tits in this photo? What? I don't, you know, I'm actually kind of flattered. I'm saying that's going to be the comment. Can I see how hard he's staring? Like he's like, \"Oh, fuck.\" Oh no, he's in there. Oh, look at him, how cute he's being though. No, well, I ruined it by saying, \"It actually kind of flattered.\" Thank you. Portillo's the only man not afraid of your husband. So he's like, he's not afraid to ogle you. When you get the blue. I'm actually kind of flattered. Kinda Funny barbecue stream, Twitch. I'm going to go in there, make sure everything sounds good. It's streaming. Cool. Oh, this is perfect. I'm so glad I my hat. I know, right? When you left it here, I was like, \"Oh no.\" And then I was like, \"Oh, it works out.\" Yeah, it works out perfect. L, get a rhythm. When you come, what do you leave the meat out before you grill it or no? Like to get room temperature? Eh, I mean, I'm with my usual plan is once I didn't know how long that was going to take. Are you all set, Greg? Once",
      "start": 3996.64
    },
    {
      "text": "what do you leave the meat out before you grill it or no? Like to get room temperature? Eh, I mean, I'm with my usual plan is once I didn't know how long that was going to take. Are you all set, Greg? Once I get that done, closed, I'll go get it and bring it out here. But then it's also hot out here too, you know. Want to do it total? Yeah, I like it. Uh, Peanut 043 says, \"Yo, Alexis, is Annie okay?\" Who Annie? Who's Annie? The hat kind is like a Michael Jackson hat. Annie, got it. I was like, \"Who the hell is Annie?\" I don't know if you want a beer. I brought one. No, I'm good. Okay, one more for you. Oh, the Rhino beers. We never tried these yet, did we? All right, so let me look up all the information on this. Can I, can I go for it? No, no, let's, 'cause I want to have all the information for. I think the blue is mine, right? I thought, I think black is yours. Hold on everybody. I've never seen a black. So there is a young man made who's no longer young. His name is Ryan De La Rosa. Ryan De La Rosa has been a fan forever. He is, uh, one of",
      "start": 4054.4
    },
    {
      "text": "I think black is yours. Hold on everybody. I've never seen a black. So there is a young man made who's no longer young. His name is Ryan De La Rosa. Ryan De La Rosa has been a fan forever. He is, uh, one of the guys who, he was the first guy at IGN who, Portillo, what are you just walking around eating? What is around here for you to eat? Ah, this dog's going to die. Leaves. He's going to die. Big. Uh, Ryan is one of the, the first fans who ever came to IGN, flew himself out to IGN. And now he is into home brewing, maybe starting his own brewery one day. So he's been sending me beers to try. So what he sent here is stuff for, is this the one Kevin and I? These two are there. Um, all right, I'll try one. No, that, that was not. I brought you the IPA for that. So he is sending us, should the blue caps are the Flying Rhino Helles, or Helles, maybe is how you saying H.E.L.L.E.S. And then the black caps are the Rhino Milk Stout. He said that milk, the Milk Stouts are going to taste like a milkshake for Kev. Yeah, yeah. Would you want to",
      "start": 4105.56
    },
    {
      "text": "or Helles, maybe is how you saying H.E.L.L.E.S. And then the black caps are the Rhino Milk Stout. He said that milk, the Milk Stouts are going to taste like a milkshake for Kev. Yeah, yeah. Would you want to try one of them? 'Cause I can get you your own if you want. Can I just have a sip? No, sure, a sip, that's fine. You can have a sip. Um, I forget. And if you like it, I can go grab you one. Perfect. Yeah, that's a good compromise. But remember, if you like it and I like it a lot, you're taking one away from me. Okay, I'll keep that in mind. No black ones, right? Yeah, God damn it. I hate it when I, why can't I follow? Rhino. Cheers, guys. I think it's Airstrike Rhino. By, it's a hump day. This is yours. Oh, thank you. Yes, Wednesday totally feels like a Friday. Granted, I'm off tomorrow. So you want one? No, I'm good. That's a little too sweet for me. No worries. Oh, too sweet. Stop eating things. That's good. Try that one, the Helles. Oh yeah, that's excellent. That is fantastic. If you want to send sweet nasty love to our home brewer, Ryan De",
      "start": 4154.12
    },
    {
      "text": "sweet for me. No worries. Oh, too sweet. Stop eating things. That's good. Try that one, the Helles. Oh yeah, that's excellent. That is fantastic. If you want to send sweet nasty love to our home brewer, Ryan De La Rosa, it is, I'll take this one though. Airstrike Rhino. R.H.I.N.O. Just Rhino. Am I coolest? Light this up. Want me to us ever drink beer? Uh, let me get this going for a second and then, yeah, but you know, I've been hearing a lot about it. I, you hear a lot about beer. Yeah, I like, it's the universe's way of telling me to have a beer. Sit back, relax, and have a beer. Makes you strong. You want to get, oh, we have one share. Okay, we're all set. Yeah, I'm going to just sit in the stoop here. Sure, sure, sure. Now, I'm not going to lie, the shirt I'm wearing, yeah, not super long. So there is a little bit of ass crack happening. Alexis, I hope you know, I know we've been around, we've been friends a long time. I'm not worried about it. I'm not worried about it either. I'm a little worried, mean, but I'm right. The amount of times",
      "start": 4203.76
    },
    {
      "text": "Alexis, I hope you know, I know we've been around, we've been friends a long time. I'm not worried about it. I'm not worried about it either. I'm a little worried, mean, but I'm right. The amount of times that my ass crack has been out from, see, that's the thing. That's what I like about you the most is that, don't get me wrong, you've always been my ass crack, my favorite part of Alexis Pence, ass crack. No, it's the fact you've always been what I like to call a down ass woman. You know what I mean? Where from the beginning where you're like, you, I totally, I'm sweating through my pits. I think you came on our show the first time and you're like, \"Hey, look at me, I'm an attractive young girl. I poop all the time. I got Crohn's disease. I'm working on it.\" It's true. You're good. You're a good lady. I like you. Thank you. Thank you very much. Thank you for coming by and hanging out. Thanks. All right, well, you know, that's what I love about you guys too. All right, come in and be like, we let it all hang out and the audience loves",
      "start": 4248.24
    },
    {
      "text": "you very much. Thank you for coming by and hanging out. Thanks. All right, well, you know, that's what I love about you guys too. All right, come in and be like, we let it all hang out and the audience loves it. And that's what the best friends are all about. I've got a coffee dump. Move it. Got a coffee dump. Jesus. Oh, he's P.T. You could ask. I mean, like now for to the, for the record, he's outside. A very confusing for Portillo of, am I outside or am I inside? It's fine. I'm just going to get we hose now. Oh, do we? Yeah, it's not super set up. Problem solved. Done. There you go. Nailed it. Nailed it. It'll we go right off. Uh, I'm going to go get the pizza and the ribs. I can go get that. You can stay here. That thing. Yes. So here's the thing. You might have seen today on Instagram or Twitter, right? Yeah. Uh, February 2016. Uh, DiGiorno tweeted something or whatever and Tim responded and they, or no, they followed Tim, the DiGiorno Pizza Day. And Tim said, \"Oh, that's great.\" And Tim and they responded. And then one of our fans said, uh, yeah,",
      "start": 4287.52
    },
    {
      "text": "tweeted something or whatever and Tim responded and they, or no, they followed Tim, the DiGiorno Pizza Day. And Tim said, \"Oh, that's great.\" And Tim and they responded. And then one of our fans said, uh, yeah, Greg won't forgive you to bring back the buffalo chicken pizza though. Then this year, April, so 14 months later, DiGiorno responded to that tweet and said, \"Look.\" And they got the pizza. And I was like, \"Oh, you got to send us some.\" They sent us seven of them today. Wow. And they gave a nice note. And you can cook them on the grill. That's awesome. According to the, the re, I'm using here on Kraft. Way to go, DiGiorno. I'm using a KraftRecipes.com here. It's not delivery, it's DiGiorno. It's, and that was their thing. Like, we don't, it's not, it's not delivery unless Greg Miller says, \"Deliver it.\" I'm going to put it over here to keep it in the shade. That's awesome. So yeah, we're going to, we are going to try to cook a pizza on the grill. Says here, but you can grill it, huh? Right? People are saying you can. Yeah, yeah, Kraft Recipes is",
      "start": 4342.64
    },
    {
      "text": "it in the shade. That's awesome. So yeah, we're going to, we are going to try to cook a pizza on the grill. Says here, but you can grill it, huh? Right? People are saying you can. Yeah, yeah, Kraft Recipes is saying you can. This owned by Kraft? Is it owned by? No, no, no. That's what I'm, I'm using here. Remove the on the cardboard from the frozen pizza. Place it directly on the center of the grill. Close grill for 13 minutes, rotating the pizza after 8 minutes. Continue grilling covered until the cheese is melted. The problem I'm, I'm worried about is I'm doing low heat here, medium, you know, heat over here for the ribs. I don't think we got to get, do not eat pizza without cooking. The worst thing that happens, right? Then whatever the pizza is, it's fuck ruined. Then we got to eat it. We got six more. Yeah, what do we care? Can I get either of you guys anything at all? Oh my God, a good H. We need to put on the thing, sunscreen though. I'm going to be fine today, but in usual for barbecue. No, no, go get everything. I'm",
      "start": 4387.2
    },
    {
      "text": "care. Can I get either of you guys anything at all? Oh my God, a good H. We need to put on the thing, sunscreen though. I'm going to be fine today, but in usual for barbecue. No, no, go get everything. I'm just like, I'm powder over here. Yeah, that's color folk. We can handle the sun. Yeah, people of color. See, see, I don't like when I say stuff like that and then you freak out. Or like I say the minorities are doing it and you don't let him bully you, Greg, because he freaks out over anything. The AP says you can say that. Me, I'm a monster. I'm glad you fine minority is getting all worked up, right? Internet, this is not what I meant, guys. What kind of sunscreen you like? You know, SPFs, which ones? You know how many? That's a good one. Yeah, I would say for what, for what we're talking about, so 50. No, I would say 15, 30. I, I want some color. I'd say at least 30. I want to be part of your world. You want, do you want the spray kind? Sure. All right, we got a twin pack for $14. Ooh, but it's not Prime. It's always a heartbreaker. P.T.",
      "start": 4431.36
    },
    {
      "text": "don't. Oh, here. I know, Courtney. I'm going to take this. Is that cool? What's happening in the chat here? Thank you. Now, Lot says, \"It's going to melt through the racks.\" Ooh, I don't. Is built tougher than that. I like one of our fans then said today too for tough. One of the fans tossed out today, \"We have never done and should do a frozen pizza topic on GoG.\" I agree 100% with that. Oh yeah, that really is hon. Like, is not a PL. Like, you know, we weren't paid to say this, but in my experience, DiGiorno has always been the best. We can throw that away. Frozen pizza. I got it. Okay, frozen pizza. Um, like, God bless those like $5 like Tombstones or your Jack's Party Pizzas and shit. Yeah, that's what I'm saying. There's a lot of pizza stories in here. It's a good thing. It's a good, it's a good call from that fan. Pockets fall into, um, I",
      "start": 4477.12
    },
    {
      "text": "or Y your Jack's Party Pizzas and **** yeah that's what I'm saying there's a lot of pizza stories in here it's a good thing it's a good it's a good call from that fan Pockets fall into um I that's a snack category on its own I think oh you you put that in the snack category interesting Douro coming through like the homie they also said best friend in their letter like they you know knew the content oh that's awesome you want to mute me Kevin wash my hands sure who's your good du you want to like answer questions from here or yeah let me answer questions I can pull it up on my phone okay I like this people are excited for this pizza I'm excited for this pizza yeah so did he tell you like I got a tweet from a random person being like I'm grilling a pizza today and I was like can you do that he like yeah now I'm here I love it grilling Pizza yeah like answer questions how do I mute this guy question I can pull it up on my phone put the volume down my volume is down oh that down Okay",
      "start": 4537.88
    },
    {
      "text": "that he like yeah now I'm here I love it grilling Pizza yeah like answer questions how do I mute this guy question I can pull it up on my phone put the volume down my volume is down oh that down Okay God Kevin you're so smart I don't I don't I don't know if that's true even a little now oh **** that looks really good can I see it yeah oh man what is this ribs yeah ribs and pizza I always eat so well when I come here sure a staple good eating that's what like to keep you guys are like Google but smaller I we'll get there'll all right have you been out shopping for caskets is that a thing caskets yeah what who said that what have you been out shopping for caskets oh is it cuz the whole dead thing I thought we're over that guys be an adult don't worry about it don't worry about it like see if you weren't married and if Portillo was a human would he have a chance I don't know I it depends on how funny he is cuz honestly he looks kind of stupid to me always he's 11 years old turn you",
      "start": 4596.56
    },
    {
      "text": "see if you weren't married and if Portillo was a human would he have a chance I don't know I it depends on how funny he is cuz honestly he looks kind of stupid to me always he's 11 years old turn you **** pervert I don't live me who she you can date there you go the courts do stop love okay they're dog they're dog ears oh good point good point7 right so he's old as **** I thought you were doing that way I thought you were like oh man look at this girl getting with this old that's a good that's a good thing I guess so I mean I would have to see his personality cuz right now all he does is snub me so he snubs you well he isn't snubby like he lets me pet him but then he just kind of walks away he's kind of shy it's kind of reclusive where I'm like more social so I don't know if we'd balance each other out look at his ears flapping in the wind he's so **** cute he really is so then yeah I guess he would you want to try this sure you want to try mine sure uh Lexi if you get sick of",
      "start": 4660.44
    },
    {
      "text": "each other out look at his ears flapping in the wind he's so **** cute he really is so then yeah I guess he would you want to try this sure you want to try mine sure uh Lexi if you get sick of that beautiful muscular Rich H man this disabled fat vetan will be waiting for you thanks Big Bots one that one's good too this is more my speed stats usually give me a headache orangey at the front there not bad what else T Orange Blossom actually Orange Blossom which is weird but I like it when are we getting an Andy emote great question uh I don't think we're getting an emote for a while we had too many people add on for Amazon Prime we always remove some huh we could always remove some no but like we can't access that cuz like the number of subscribers has gone down since that happened oh it's broken again yeah it's a it's I didn't know how we were storing it we got to let it dry out and not put it back into the thing cuz that's what's happening you're putting it back in the thing and the",
      "start": 4709.4
    },
    {
      "text": "broken again yeah it's a it's I didn't know how we were storing it we got to let it dry out and not put it back into the thing cuz that's what's happening you're putting it back in the thing and the moisture is building up cuz Greg brought it out in the tube like they got put back in the tube you know what I mean oh yeah look at that R yeah we can't do that okay we just got to stop doing that I mean we could also oh no no wait look look look true you should try out we let it I mean we should prob just throw this away coffee let out Everyman Espresso you just check them out they have a couple locations but definitely check them out in New York City Everyman Espresso I did a coffee review on them check them out on my channel let's on YouTube really cool coffee shop the B the head Barista there he competes in competitions you're definitely going to want to check him out um they have amazing specialty coffee drinks you know like orange like all these cool flavors involved like a special",
      "start": 4766.2
    },
    {
      "text": "he competes in competitions you're definitely going to want to check him out um they have amazing specialty coffee drinks you know like orange like all these cool flavors involved like a special kind of ice and special kind of milk and all these cool things Everyman Espresso in New York oh okay yeah I did a on them on my channel okay um definitely check them out I just want to travel the world drinking coffee with you me too that's all I want to do the Barista championships are this weekend I covered them last year but this year oh did you did like a live thing there last year yeah yeah I was going to do it again this year Twitch like really wanted me to go but I'm you know I just you got things to do you got to come on this show you got to eat barbecue I exact exactly no I took that impromptu um trip to New York and you know with my grandma I just was like I was just wiped after that no that's a big part of it knowing when to stop is something I'm learning as I get older um what's up",
      "start": 4806.28
    },
    {
      "text": "um trip to New York and you know with my grandma I just was like I just was wiped after that no that's a big part of it knowing when to stop is something I'm learning as I get older um what's up iart you Lexi how did you get into the gaming industry I worked at IGN where did you come before then though I forget um I had my own production company gotcha yeah and that's where I got all my Twitter followers yeah Lexi Go Cubs the Wy 5 damn thank you for sprorting the baseball we really appre apprciate that is that the PR answer that's my PR answer we're thank you thankful you're a fan of mid League Baseball yeah uh Mr. Hunter in the Astros uniform cool Lexi go daughters all right that was forever ago though right what Astros yeah that was like the first team you got drafted to how long has he been a Giant now 4 years this will be his fourth really god it feels so much longer than that good way in a good way because he's like the face of the team next year is his contract year which is",
      "start": 4852.16
    },
    {
      "text": "he been a Giant now 4 years this will be his fourth really god it feels so much longer than that good way in a good way because he's like the face of the team next year is his contract year which is kind of scary what does that oh so they can change either move which I'll be like so devastating um or we'll stay which will be awesome who do we need to tweet to make it happen who do we need to get everyone behind to make this happen exactly um let's see is that something you worry about oh yeah pineapple and pizza go no I'm a purist hell yeah yeah is that something you worry about though is like having to move or him being traded or um yeah because like well obviously for me I'm super lucky because a lot of the people that are on the team like this isn't home for them sure sure feel I have you guys I have like other friends and you know like this is home for me yeah so I'm always really happy so like you know when you get kind of like annoyed with baseball like I have like other outlets",
      "start": 4907.6
    },
    {
      "text": "guys I have like other friends and you know like this is home for me yeah so I'm always really happy so like you know when you get kind of like annoyed with baseball like I have like other outlets to kind of reach out to right right right um so yeah I'm kind of worried that if we do go somewhere else like I won't have that kind of support system yeah exactly exactly um cuz isn't your family's up here is your sister down my sister's up here but my parents are down in LA gotcha but you know if if we had to move like obviously we will and we I'm sure we'll love whatever team we go to yeah yeah yeah but you know my heart is in San Francisco but that's just because I was here before I even met Hunter and I just love it up here no I hear you I'm not going to lie this pizza is looking good yes so far I'm impressed with Grill in a pizza uh Lexi did the coffee mug you had said keep calm and drink coffee no it didn't did it I actually don't know what it said oh no it says Team Kinda Funny",
      "start": 4961.0
    },
    {
      "text": "so far I'm impressed with Grill in a pizza uh Lexi did the coffee mug you had said keep calm and drink coffee no it didn't did it I actually don't know what it said oh no it says Team Kinda Funny yeah oh yeah Team Kinda Funny so no hi Lexi how is Greg's ass crack I actually haven't seen it he's done a really good job of finding it I'm doing the best yeah no I'm doing you're good Nick keeps yelling at me because he says I lost which win I need to get bigger P or tighter pants tighter pants but then you always used to me were the pants too high you did cuz I'm trying to get them on the gut and then lock it in but if you go low you're always going to have ass crack that's how it is yeah I mean yeah I guess or you can wear your underwear higher no that always rolls down and flops over uh what's Lexi's background I am Greek and Puerto Rican we about that background or like my professional background no what's behind you yeah there's this wall kind of cool gray uh what's your favorite",
      "start": 5002.48
    },
    {
      "text": "what's Lexi's background I am Greek and Puerto Rican we about that background or like my professional background no what's behind you yeah there's this wall kind of cool gray uh what's your favorite City to travel to with Hunter during the season like ooh that's a tough question what are you doing probably Miami cuz that feels more like a vacation for me is too hot and humid there yeah but we stay like right on the beach so it's so nice so that feels like a vacation so Miami and New York are my two favorites uh stayed at shitty hotels in Miami oh really see we get to stay in really awesome hotels and Hunter has like a suite written into his contract nice and don't get me wrong Hunter would never pay for a suite if we went the two of us so I personally try to live it up when we do go so but if we ever traveled by ourselves no we will never say in like that nice of a hotel with that nice of a room so uh let's see Lexi I love your Carmen Sandiego cosplay I've never done a cosplay on",
      "start": 5045.56
    },
    {
      "text": "but if we ever traveled by ourselves no we will never say in like that nice of a hotel with that nice of a room so uh let's see Lexi I love your Carmen Sandiego cosplay I've never done a cosplay on that just right I'm saying right now oh right now yeah oh thank you what are you reading chat yeah Lexi favorite food in Phoenix Flower Child is my favorite restaurant Lexi you from H-Town I spend my offseason in H-Town pie look good I say why thank you King Diz 89 I appreciate that what did they say what's Lexi's Channel let's get Lexi uh out here looking cool as F cool as F what does f trouble time just FaceTime **** should we FaceTime her back trouble time trouble time FaceTime you o tell to watch the stream subscribe I know black and add me uh let's see Lexi I don't like coffee but my see my entire family enjoying it I know it's acquired taste any celestics um any advice I mean all specialty coffee shops have tea and they have like uh hot chocolate or mochas and stuff like that",
      "start": 5099.2
    },
    {
      "text": "my see my entire family enjoying it I know it's acquired taste any celestics um any advice I mean all specialty coffee shops have tea and they have like uh hot chocolate or mochas and stuff like that so you might want to start there see where that Tak te espe coffee shops cuz they they get like a really high quality tea leaves so you might want to start there and try that put a little bit of sugar or um like sugar syrup in it and you should be good I mean if you okay I mean my favorite cobu I've still had is from it looks good it does look good we could cut it in half yeah I could put it both there is really good okay I've been there multiple times since I saw a f on Sho yeah when you have good quality coffee guys like it is it's almost hard to go back to like Starbucks and that's especially when you start to learn about like like the bean where it comes from how it's roasted how it's dried out and all that stuff then you're like well I don't want like moldy gross coffee beans and you",
      "start": 5179.92
    },
    {
      "text": "when you start to learn about like like the bean where it comes from how it's roasted how it's dried out and all that stuff then you're like well I don't want like moldy gross coffee beans and you can kind of taste the quality and the like how it's brewed how it's roasted how it's taken care of I have a problem tasting all the quality this is how it how it makes my body feel that's why I like theirs I mean that's a good that's kind of like you your body it's not done this this is a good looking pizza already I'm excited I'm excited too Lexi have you been playing the Nintendo Switch no I haven't I have one but I have not played it in turn I played that 1-2-Switch how'd you like that game I thought it was fun yeah I mean that's like I like watching people play more than I like like I really like watching my nieces and nephews play the dance one so Greggy there's this game called Getting Up on PlayStation now I'm going to need a number two oh you need Get Up 2 for we need Get Up",
      "start": 5234.52
    },
    {
      "text": "like watching my nieces and nephews play the dance one so Greggy there's this game called Getting Up on PlayStation now I'm going to need a number two oh you need Get Up 2 for we need Get Up 2 everybody it didn't really happen start the tweets start the tweets make it happen King Franchise says congrats on your five years oh thank you thank you sorry no you're good it doesn't matter 5 years time goes fast I know that's so awesome yeah how do you keep the spark alive you compliment Paula like it's like it's like it's really it's admiring like I like it she's so perfect though I like I love that that's so sweet I mean that's the thing yeah I always just stay positive and like every once in a while remember to do little things you brought flowers like what are the little things I mean yeah flowers all the time compliments how often do you guys go on a date night I mean that's rare rather because of like our schedules are so SC Hunter and I are really bad about date night but I mean",
      "start": 5283.52
    },
    {
      "text": "flowers all the time compliments how often do you guys go on a date night I mean that's rare rather because of like our schedules are so SC Hunter and I are really bad about date night but I mean like don't it doesn't have to be date night it can just be you know fun time like order food watch a movie try to do that as much as possible like make food if she's late and like you can do that yeah it's just little things like that they all add up yeah you know I really liked your romantic trip to Lake Tahoe oh man even though you got hurt but no it's F dude but like I just you can just sense the romance behind it it was awesome like and when we did that mute me my hands are gross again I was wondering what was happening I don't know this is why I'm SC scared ass Kevin um for Tahoe actually like always plann little special things like for Tahoe Tahoe was awesome but when we got there I had secretly packed a little like um picnic thing but it was snowing super hard so and it was full of",
      "start": 5330.6
    },
    {
      "text": "like always plann little special things like for Tahoe Tahoe was awesome but when we got there I had secretly packed a little like um picnic thing but it was snowing super hard so and it was full of like little crackers and cheese and stuff she likes they ended up being awful and that sucks but like the gesture was nice yeah the gesture is nice oh yeah champagne bottles and stuff you brought it in our old mailbox to make sure it doesn't break that's so sweet there just little things like that you got to do you know yeah keep it fun you should like like show us more of that stuff I mean on my Snapchat I don't know you guys tell me do you guys want to know how to be more romantic to that significant other you don't show love at sex stuff that is true but you guys don't really talk about like romance but we could soon yeah I feel like that kind of stuff is nice for me as a female I like that stuff yeah you know yeah I mean as a dude I like that stuff when Paula surprises me with little",
      "start": 5370.72
    },
    {
      "text": "romance but we could soon yeah I feel like that kind of stuff is nice for me as a female I like that stuff yeah you know yeah I mean as a dude I like that stuff when Paula surprises me with little things like she'll come home oh so you like it just as equal of course yeah cuz I leave Hunter like notes all the time that's awesome see like that's super like keep doing that yeah uh you know Darren right Darren Brazil yeah he's really good awesome for my J he really should have his own show on that side his wife is awesome too she is yeah they were at um some convention he was having a tough day he got back to his hotel and she had ordered him I did that for cies and milk awesome that is awesome pro move right there so girls it's on us just as much mhm you're right how what's your stance on getting flowers oh I mean I'm not a fan of flowers I would not be excited for flowers okay but when I come home and there's like a Blu-ray of Rogue One just is good yeah so that's the equivalent of",
      "start": 5419.08
    },
    {
      "text": "getting flowers oh I mean I'm not a fan of flowers I would not be excited for flowers okay but when I come home and there's like a Blu-ray of Rogue One just is good yeah so that's the equivalent of flowers got it um every sing bye to party bye party bye party where's he Going's he's got to go to he's got to go to sleep Camp bye sweetie have fun that's you yeah it's all happen what no I was like what's the quacking oh it's him I would babyit I would dog sit oh well lessons for next time yeah I just tell him he goes away a lot though you don't want to you don't want to open that door I would dog said if if Thomas wasn't such a **** **** you know he kind of is he's an ass well you don't like Thomas cuz you feel like it ruined our like fun hangout what annoys me the most when people get pets is I have to go home and feed the cat or walk the dog more times than not I'll be hanging out with you and be like don't you have a cat to feed I'm like ah he'll be fine it like he ate this",
      "start": 5466.48
    },
    {
      "text": "get pets is I have to go home and feed the cat or walk the dog more times than not I'll be hanging out with you and be like don't you have a cat to feed I'm like ah he'll be fine it like he ate this morning he'll be fine it hurts me oh what's this a package for SPF all right noing in here are you trying the new sauce we have Lexi have you been to Arlington I have I've also been to Waco is that where King of the Hill's at yep o shout out to Pigs in a Blanket I love Pigs in a Blanket yeah man those are so good it's our new throw we got a new throw run too it's a blanket it's the blanket that's awesome anything's a rug if you try hard enough I I don't know that's true how long do contracts last they can last anywhere from a year to like 13 years Giancarlo Stanton got signed for 3 0 million for 13 years my God Harper is looking at a $500 million uh contract I don't know for how many years but they can last forever a lot hopefully a lotun is Greg a Sox fan he is not I love you",
      "start": 5519.08
    },
    {
      "text": "million for 13 years my God Harper is looking at a $500 million uh contract I don't know for how many years but they can last forever a lot hopefully a lotun is Greg a Sox fan he is not I love you he is a Giants fan wait you talking about famous Greg over there you just making a guess there no I'm telling him okay for his own good he's actually not even a fan of a team he's just a fan of H 100 p as am I he's a fan of us though so he is he's a huge fan of you guys I know repping that hat always I love that yeah I probably should have ordered yeah that would been good but it's always you guys are always sold out I found mine in Kevin's garage love **** I'm about to steal Kevin's Greywind 64 wants to know what your Disney s list is mine yeah you have one remember this is your brother's big thing when the show started yeah that I definitely don't Disney oh it has to be the princesses CU I justra I was not a fan of baseball before Hunter do you have one just H she was on Disney right",
      "start": 5600.72
    },
    {
      "text": "big thing when the show started yeah that I definitely don't Disney oh it has to be the princesses CU I justra I was not a fan of baseball before Hunter do you have one just H she was on Disney right oh Disney Channel you're okay okay they just said Disney they weren't I don't do that what is that called Anime no Hentai or whatever I don't do that I don't think it's Hentai isn't Hentai Hentai's got a bunch of **** tentacles right yo Kev Hentai what is that uh it's the it's like Anime but with sex so it's not no not specific it can be it can be okay just checking not all tentacle if we could radio in Zayre right now we'd have a 15-minute explanation about the differences and that probably has its own subcategory in the Hentai World got gotcha gotcha Goa got gotcha but so who is Tim number one oh I forget it's been so long oh wait I'm doing is Beauty and the Beast that counts right Emma Watson all day okay okay show Emma Watson number one and number two never mind me number three I",
      "start": 5666.36
    },
    {
      "text": "one oh I forget it's been so long oh wait I'm doing is Beauty and the Beast that counts right Emma Watson all day okay okay show Emma Watson number one and number two never mind me number three I don't care yeah H's Anime Anime porn chat's letting us know thank you K Lexi I thought I heard Greg mentioned you have Crohn's is that true it is true what I do too and it's rough it is rough but luckily I've been in remission for a long time yeah a really long time that's good uh Lexi's Hunter playing in Miami anytime soon yes he is I think next month Le's R they're coming along not going to lie Kevin's hair is on point Lexia Kinda Funny Live 3 yes I shall be there **** yeah unless something like horrific happened yes I will okay well that was a down way to go that's my disclaimer uh yeah I remember looking over and seeing you hella hyped and you sent me a text I see you I like where she at where she at God damn Kinda Funny Live awesome yeah it was that was a good",
      "start": 5721.76
    },
    {
      "text": "disclaimer uh yeah I remember looking over and seeing you hella hyped and you sent me a text I see you I like where she at where she at God damn Kinda Funny Live awesome yeah it was that was a good time have you watched it I have not dude yeah there's a lot of it I didn't like I was telling you about she Pikachu I didn't even know that happened yeah that was awesome she deserves like girlfriend of the year for that me what no I get the year for bringing it with you guys PR I mean you're running the show lately so I say 10 Pikachu there just hella Pikachu The Rock and Gia hanging out I would be one would Gia well we only have one costume so we got to make that work and it's a little dirty I'm not going to lie to you oh you guys own it yeah oh yeah yeah we that was an investment we like we we were like oh we need this forever good game changer glad we did this together oh does your know thank you you done it again King Diz 89 guys I already asked him his F list he said",
      "start": 5789.08
    },
    {
      "text": "we we were like oh we need this forever good game changer glad we did this together oh does your know thank you you done it again King Diz 89 guys I already asked him his F list he said Emma Watson Belle and Hermione sound in that order yeah got it got it whatever they want yeah right that's when I get romantic it's up to you right personal preference I don't know if romance ever figured into Tim's topic of Disney princess fuckless see me to man I like to show my passion on my sleeve hey man I'm with you all might write your name or two on a bus or two something like that something C that's cool there we go pie is good yeah it's hot so give it a second probably so a new thing we've been doing is you know when that mhm says like uh Paula plus Kevin yeah turn the plus into the te call oh dear we come across other graffiti we turn it into a bad thing you know keep them on the to if Hunter wasn't a professional ball player what do you think he'd be for doing for a career I",
      "start": 5837.0
    },
    {
      "text": "to call oh dear we come across other graffiti we turn it into a bad thing you know keep them on the to if Hunter wasn't a professional ball player what do you think he'd be for doing for a career I think he would be a professional e-gamer yeah yeah 100% he just invested in Cloud9 oh what's that uh Esports team they better **** win then yeah 100P doesn't invest in losers that's true who doesn't can you guys imagine a Kinda Funny Sports show with Lexi and Andy kind of sports yeah kind sporty yeah Andy does love those Sports we eating these yet yeah he does he loves sports yeah Andy loves sports he's always talking about them you know what fascinates me about it is like uh the contract side of everything right theer you sons of **** you got it and there's cheese in the crust as there should be oh man those little rooms amazing they're the ones that come off book for Kinda Funny Live Stream get hyped I'm hyped oh I'm hyped like see how long have you known Kevin and Cool Greg I I've",
      "start": 5919.36
    },
    {
      "text": "be oh man those little rooms amazing they're the ones that come off book for Kinda Funny Live Stream get hyped I'm hyped oh I'm hyped like see how long have you known Kevin and Cool Greg I I've known you for like four or five years half that time yeah I kind of cuz then you and S driving to work together not be in the back seat yeah I talk Lexi how close are your life to the HBO show Ballers nothing like that show nothing I wish it was but it's not I got to get back on that show stopped watching Ballers is so much fun yeah yeah it really is what are they at season 3 or they going into season 3 this year uh they're going into season 3 got some uh Pizza grilled pizza yes dark my balls I like to watch the whole game now ex oh that crisp is birday you like that here's a fun question that doesn't come from the chat it comes from me but from user uh not let's get Lexi um who would you have play you in a in a movie but it has to be the younger better looking version of yourself oh that does",
      "start": 5990.88
    },
    {
      "text": "come from the chat it comes from me but from user uh not let's get Lexi um who would you have play you in a in a movie but it has to be the younger better looking version of yourself oh that does it have to be younger yeah can it just be better looking has to be younger yeah I immediately was going to go Rosie O'Donnell but she would nail it though I know right she would nail it I was going to go for the guy from Blue's Clues who played Steve okay everybody always said I look like him but he's a little bit older now yeah he's a good amount older now rather you see like he shaved his head yeah what's that all about did you read that story too of how he like tried to **** this like supermodel or whatever really yeah get him for Kinda Funny Live 3 not a bad way cuz he went on a date with her they got she was an actress or whatever she was like really hot he said this this sounds very pervy it's not what it was but it was one of those things of like I forget how they got hooked up and it",
      "start": 6067.84
    },
    {
      "text": "they got she was an actress or whatever she was like really hot he said this this sounds very pervy it's not what it was but it was one of those things of like I forget how they got hooked up and it was um I'm paraphrasing the whole story obviously but uh his friends he was like oh man she's way out of my league and my friend's like dude this is celebrity you got to do this you got to go you got so they went to dinner and it wasn't going well like they had nothing in common and all right cool and so he was driving her home or driving her to his place to you know watch a movie or some **** like that and as he was driving I mean in her neighborhood that he passed a birthday party and it had the Blue's Clues sign out front and all the stuff and he was like why not he's like you want to crash that with me and he dressed up as the dude and walked in everybody flipped the **** out **** that's awesome that's that's a power move right there good for him so that's who you would have play",
      "start": 6113.8
    },
    {
      "text": "that with me and he dressed up as the dude and walked in everybody flipped the **** out **** that's awesome that's that's a power move right there good for him so that's who you would have play you no he's older than you he's way older than yeah that's not even an option he's got to be close to 50 now maybe right maybe up mid 40s I don't know maybe in the show he was what mid 0s are you talking about the the main guy or like yeah not Joe **** Joe the **** out of here I don't know who any of these people are I didn't watch Blue's Clues it was past my time Steve was uh yeah all right so pick someone new I don't like that what that we have to pick someone younger that limits people uh Zac Efron okay he's like maybe two months younger than me maybe a year or so yeah how about you I don't know all right anyone Leguizamo really okay you look nothing like John Leguizamo you're like way better looking than John Leguizamo Mick Foley Mick is a good call I would pick that was a really good pizza way to go",
      "start": 6153.16
    },
    {
      "text": "know all right anyone Leguizamo really okay you look nothing like John Leguizamo you're like way better looking than John Leguizamo Mick Foley Mick is a good call I would pick that was a really good pizza way to go Douro yeah way to go Greg thank you thank man six more of these Selena Gomez that's a **** good call oh that is a good call it's a good call right yeah you sticking the Rosie O'Donnell do uh I guess so yeah somebody younger I don't I always feel like I don't know contemporary actors yeah so Tom Holland he does that we have the same physique sure sure who's Lou Albano Captain Lou Albano he's a rest in peace past professional wrestling manager oh that's who they said would play you right that's another good one that is another good one yeah what about M for Cool Greg yeah yeah what's going with the last piece I'll spit it with you yeah wayed be the younger uh there you go look at that little tiny baby piece I got it it's a little cute Pizza Piece Pizza watching our figures sure watching them grow let's",
      "start": 6198.36
    },
    {
      "text": "I'll spit it with you yeah wayed be the younger uh there you go look at that little tiny baby piece I got it it's a little cute Pizza Piece Pizza watching our figures sure watching them grow let's see how many beers you want two too many I'm just kind of mixing it up here guys oh that's just R said Jessica Alba for me that's a huge com John RPG says the kid the younger kid in Hot Tub Time Machine would be from The Office and stuff I just burped that someone did you guys hear that would they hear that probably God you're disgusting but I tried to keep it in my mouth oh you know everybody says so this is the weirdest thing I had never heard this lookalike suggestion in my whole life mhm mhm I'm 9 years old right Tim Gettys say Cool Greg I had never heard this ever in my life and suddenly on YouTube I saw a guy say man he looks like the uh he looks like the the guy who wraps in Linkin Park ah Mike Shinoda and I was like oh yeah I guess I kind of do and since then I've heard it like",
      "start": 6266.92
    },
    {
      "text": "on YouTube I saw a guy say man he looks like the uh he looks like the the guy who wraps in Linkin Park ah Mike Shinoda and I was like oh yeah I guess I kind of do and since then I've heard it like five more times but I've never heard it in my whole life yeah and suddenly everybody's like oh he looks like Mike Shinoda Mike Shinoda like you know in the end it doesn't even matter I guess I how did I somebody also said I look like Mexican Kojima yes hey Cool Greg can I get spoon that's really funny crawling in my skin we're going to recreate the photo of Kojima that he took for the well not that he took the one that was on the RTX Sydney yeah yeah yeah like get like the white dress shirt on yeah yeah we're going to try to recreate that but I never got the shirt like glasses just black frame glasses is a **** baller dude don't always look like he's 36 yeah he does not age thanks Chief all right breaking out this new barbecue sauce C yep Charlie Vegas Rendezvous Memphis Original Hot Famous Barbecue",
      "start": 6326.6
    },
    {
      "text": "glasses is a **** baller dude don't always look like he's 36 yeah he does not age thanks Chief all right breaking out this new barbecue sauce C yep Charlie Vegas Rendezvous Memphis Original Hot Famous Barbecue wait Greg did you pick who you have for yourself yeah I'll go with the Hot Tub Time Machine younga who thaty he was on The Office he one of the interns not God I can't think of the guy I did you know remember the there was three of them right there's two of them I think there did you watch Hot Tub Time Machine I did he was the young guy in the group where he end up being the son yeah if if uh Lou didn't **** his mom he wouldn't exist God guys I can't remember it's okay I have the worst memory it looks like but with more like excitement left in him more excitement left in me exactly yeah what happened to this channel who are these people I'm Andy and that's Lexi hi I'm Kevin I'm Greg I've been here from the beginning sorry my apologies Kojima Kojima I love that what's going on it",
      "start": 6390.36
    },
    {
      "text": "yeah what happened to this channel who are these people I'm Andy and that's Lexi hi I'm Kevin I'm Greg I've been here from the beginning sorry my apologies Kojima Kojima I love that what's going on it broke yeah all right all right we're not good with these things no Andy play guitar please maybe uh maybe for our uh ooh maybe for the uh 4.0 stream tomorrow I have a I have a regular meat one that you are you going to do anything special for the 4.0 no stream oh definitely not how come it now looks like the Hispanic version of The Force Unleashed what character oh oh Sam Witwer I don't agree with that one can't get out that one sorry guys, Alexi's cousin to college I know I know she's super so it's like music college but it's College I'm super proud of her thank we support people support people right yeah that's right we definitely support people support people and we hate Central Time **** Central Time can suck a dick yeah on my side now why do you guys say Central Time so much sucks you",
      "start": 6451.28
    },
    {
      "text": "right yeah that's right we definitely support people support people and we hate Central Time **** Central Time can suck a dick yeah on my side now why do you guys say Central Time so much sucks you got to hate something I mean I agree I mean all right if I'm being honest yeah **** them but but I'm just curious like what like why what's your reason uh cuz it's one of those weird time zones that's in between can move that over you don't have to what do you want me to do just like there's a wire sticking out you know to the wire whoa so I finally watched that show Big Little Lies it **** talking about I L it it was good haven't seen it it was real good Paula was watching it she was like oh let's watching I was like ah you just tell me what happens every episode so I know the story I got it down it's good seems all right he said Greg is from Central Time yeah that's right yeah he **** walked away from and I Lear the difference yep I learn what it's like to not have to justify",
      "start": 6530.08
    },
    {
      "text": "I got it down it's good seems all right he said Greg is from Central Time yeah that's right yeah he **** walked away from and I Lear the difference yep I learn what it's like to not have to justify where you live true I'm Nick Fury remember that are you doing Nick as Nick Fury I was yeah Lexi runsy of Michelle Rodriguez thank you oh that's another good one for you she's still angry though true true she is I'm not that angry are you happy she sure yeah that's true o Paul Rudd would be good really good for Nick I feel like that is a good one yeah Nick wants to be like what's that guy safe Jason Statham yeah but he's a j Jason Statham might be a good Tim what no way no way no way you're hard on for Timmy showing all right yeah put it away put it away saying guys I think he we haven't seen his like fun side yet Tim Jason oh I was like we've seen plenty of Tim's fun side too much someone say just cuz you're imagining right now J Jason Statham with without any hair put hair on them all white people look",
      "start": 6576.92
    },
    {
      "text": "side yet Tim Jason oh I was like we've seen plenty of Tim's fun side too much someone say just cuz you're imagining right now J Jason Statham with without any hair put hair on them all white people look alike you know what I mean who would I have play Tim in my biopic uh in your biopic yeah for that ever important Tim chapter yeah um oh you want to get coffee oh never heard of The 100 now oh you know who would be uh Jim from The Office that would be a good one Jim is that his name yeah John Krasinski John Krasinski a very good actor yeah oh Ryan Gosling could do Tim all right now you're hard on sh no I mean like I feel like that's like a good one oh Joseph Gordon-Levitt Chris Pratt would like have the right mindset like he could I feel like he be a good Greg no I was thinking for back when he pet oh for Cool Greg yeah he could I can see that the right kind of excitement for cool yeah that's true Jack Black for Kevin oh yeah hell yeah that's a really good one who said that Duners101",
      "start": 6641.8
    },
    {
      "text": "he pet oh for Cool Greg yeah he could I can see that the right kind of excitement for cool yeah that's true Jack Black for Kevin oh yeah hell yeah that's a really good one who said that Duners101 said Jack Black some **** who said that some **** you guys ever watch The D Train no I don't know what that is I watched on Netflix last night it was like a funny movie and then out of nowhere Jack Black and James Franco have sex and they're both straight huh yeah and then they have to deal with their having wives and having like a one night stand The D Train is what it's called yeah James Franco would be a cool a good Cool Greg too so would Mark Wahlberg heads up to these Mark Wahlberg would be the best Nick I think these ribs are up and they look awesome these might be the best ribs I've done so far in not in like Aesthetics but like personality mil for Cool Greg and Jesse Plemons, Jesse Pinkman would be a good Cool Greg Jesse he'd be too he'd be too intense he'd be too intense he'd",
      "start": 6702.76
    },
    {
      "text": "so far in not in like Aesthetics but like personality mil for Cool Greg and Jesse Plemons, Jesse Pinkman would be a good Cool Greg Jesse he'd be too he'd be too intense he'd be too intense he'd constantly being like like him exactly but maybe he could play the part I and he's not tall enough why do we have to bring height into it why do we have to bring height into it sorry Greg I mean Kevin it's okay look at these **** ribs um do we want to close out the show then now that the food is sure can you read Subs oh yeah don't sound super stoked about it huh well I just like cuz it's on your laptop and there's all the sun on your last oh Kevin has an Adrian Grenier from Entourage I can kind of see that yeah totally is that Turtle is that Turtle no that's that's the main guy that's Vince yeah I've never watched Entourage that's what they say yeah that's all it is pretty nice it's very luscious yeah you want to help me read stuff I AG you have left it open to subs and everything said we're",
      "start": 6751.84
    },
    {
      "text": "yeah I've never watched Entourage that's what they say yeah that's all it is pretty nice it's very luscious yeah you want to help me read stuff I AG you have left it open to subs and everything said we're starting at 11:05 going up yep can you yell you need to project do you want my mic no you sit next to do you want me to hold that or do you all good are you sure at 11:05 y JPL10 no hold up hold up hold up hold up hold up what you do come on Cool Greg all right CrimsonArmada5 just subscribed thank you Kuner500 subscrib for three months three months of Twitch Prime supporting you guys keep up the good job thank you we will we'll try JPL1017 subscribers 7 months glad Portillo is on show hell yeah N7Tank subscribe for 3 months SergeMasterpiece subscribe for two awesome uh MCFixer subscribe three months it's Fixer ha Amazon I just took your money you you sure got them you nailed them Pizzagon subscribe for 3 months three months Pizza Time Pizza Time oh cuz we made okay I thought",
      "start": 6807.0
    },
    {
      "text": "three months it's Fixer ha Amazon I just took your money you you sure got them you nailed them Pizzagon subscribe for 3 months three months Pizza Time Pizza Time oh cuz we made okay I thought there was a correlation between 3 months no P we made pizza door for Greg that's not a bad oneor that's great RonJoe subscrib for 7 months thanks for the laughs know that you all do a lot of good for a lot of people thank you this is true you guys do Anthony Lada just subscribed for his first month thank you Anthony PerryGrinGrinGV nailed it just subscribe got it crushed it HippoRussler just subscribe that's just Rais subcribe for 3 months PiaHype but he didn't he didn't use the and though it's all good JBatSoloW two months with a garbage truck on fire keep up the good work guys thank you IvonG1981 subscri for months I come back every day for Kevin great damn well God bless you you're you have more strength shut up shut up don't ruin this moment for me MCookie what was that that was",
      "start": 6869.24
    },
    {
      "text": "G1981 subscri for months I come back every day for Kevin great damn well God bless you you're you have more strength shut up shut up don't ruin this moment for me MCookie what was that that was me getting sad cuz everybody MCR199 subscribe for 5 months 5 months going strong baby those several A's and several y's in there thank you SPQR85 subscribe for 5 months keep be awesome work love you guys down RancidBeast yeah we we brought you the the table oh oh I unplugged want battery's good GrantedBeast118 just subscribe LouderThanMost subscribe thank you so much LateNightWreck LateNightWreck subscri for two months AntGore06 just subscribed PGPJ PeterUnchained PeterUnchained okay holy **** all right two months using Twitch Prime thoughts on the Guardians Telltale game if you played it Greg Greg you and I both played it I totally thought it was okay as well I think it picked up towards the end but towards the beginning I was like oh man I not having a great time uh SOKO",
      "start": 6927.92
    },
    {
      "text": "played it Greg Greg you and I both played it I totally thought it was okay as well I think it picked up towards the end but towards the beginning I was like oh man I not having a great time uh SOKOXO subscribe for three months woohoo thank you NauseousRight kind of spelled almost like it subscribe for 7 months thank you CaressPNT just subscribed ClassicTan just subscribed thanks guys uh SithToast just subscri for 10 months 10 months CactusKev needs to be a thing ForsLittleRaven89 for 19 months almost done 19 is more than 18 months can't believe it's been 19 months feels like it was just on feels like I was just on stage of Kinda Funny Live 1 taking a picture with you guys oh wow not too long after that keep doing what you do much love FishFo I was not at Kinda Funny Live 1 I was watching Rush's last concert **** you you **** fake man we should have hired this other guy it was **** oh man Rush is so good uh FishFo subscribe for seven months sweet sending some sweet",
      "start": 6987.6
    },
    {
      "text": "was watching Rush's last concert **** you you **** fake man we should have hired this other guy it was **** oh man Rush is so good uh FishFo subscribe for seven months sweet sending some sweet nasty love thank you OmegaBatman subscribe for months listen to you guys every day to and from work thank you for putting the Morning Show in podcast form what we do do it all myself do it all myself God damn Andy uh PinguTV for 6 months oh Greg you sexy beast One V one me in Mario Kart damn that turned really quickly I'm going to get that first here's the challenge pretty good I have a feeling we're going be playing a lot of Mario Kart so I don't think you have to worry about that I'm excited first I got to **** kill Zigger **** murder him Greg uh AverageYou45 just subscribe thank you Lio5 subscribed for 7 months do you think the that's a five or is it like an S right maybe they kind of going for their little uh Guys these ribs are so you guys are too cool for me I don't",
      "start": 7034.36
    },
    {
      "text": "you Lio5 subscribed for 7 months do you think the that's a five or is it like an S right maybe they kind of going for their little uh Guys these ribs are so you guys are too cool for me I don't know make her an offer she could be a great addition to the team make her an offer Greg once a week but you're a relief pitcher right don't you you have a I'm like a closer yeah you're a closer okay I don't know I just knew that word I'll they bring in the righty and you I know baseball these guys don't **** know Sports yeah they wanted there was an earlier thing they wanted you to do a a sports show with her yeah Kinda Funny oh for real that kind sport it would just be awful cliches all day uh MCY no we'll hit it out of the park be from U MCY subscribe for 6 months AmyGills Amy miss you Amy subscribe for 7 months holy **** wowow 7 months can't wait to see Lads in June it's great see Lexi on the show thank you good to be seen RobertRaag RonRison subscribe for 4 months thank you",
      "start": 7079.24
    },
    {
      "text": "subscribe for 7 months holy **** wowow 7 months can't wait to see Lads in June it's great see Lexi on the show thank you good to be seen RobertRaag RonRison subscribe for 4 months thank you for the entertainment apologies Lexi for well everything she has heard today thank you GotOfDeath6 just subscribed thank you JoinOrDie subscribe for 7 months thank you man Pepo14 subscribed for 8 months God damn a lot of months wow you guys lot of months I like the Loyalty you guys have here a Kyus8 subscribed for four months hi from Vancouver should be working but you guys are great to watch I did that all the time agreed instead of working I just watched this like I should re that's that's a I'm so mad at you guys Halo uh RedReed subscrib for four months hot doggy it's a great comment nail um Luigi7737 good Lord were were all the other ones taking Luigi subscribe for 6 months thank you Ryan is a champ subscribe for 7 months thank you Ryan you are a champ PopTaser",
      "start": 7127.24
    },
    {
      "text": "great comment nail um Luigi7737 good Lord were were all the other ones taking Luigi subscribe for 6 months thank you Ryan is a champ subscribe for 7 months thank you Ryan you are a champ PopTaser subscribe for months thank you who is Kirk just subscribe thank you welcome I wonder if that was Twitch Prime remember you can re up and Twitch Prime look him do it he knows TJWhat37 just subscribed ODSeasons1 subscribe for 7 months ejecto cuz yeah dog RomanPierceTwoFastTwoFurious003 great film um Belmont87 subscribe for 7 months McCoy97 subscribe for 3 months BluePrivateTucker just subscribed thank you Eillo just subscribed Mike subscribe for seven months with a little heart we we like you too uh MMMadDogNick what maybe mad it's like MDogMDogNick not so easy is it Andy96 subcribe for 8 months love you guys we **** love you Nick um SqueakyClean94 for 7 months 7 months keep it up beautiful boys and girl we will thank you so much thank you very much True just",
      "start": 7182.76
    },
    {
      "text": "Andy96 subcribe for 8 months love you guys we **** love you Nick um SqueakyClean94 for 7 months 7 months keep it up beautiful boys and girl we will thank you so much thank you very much True just subscribed and that's the final one welcome thank you to everybody for watching this barbecue stream this Kinda Funny Morning Show uh Lexi thank you for coming through thanks for having me and thank you guys for all the great compliments I really appreciate it remember if you got Twitch Prime or if you got Amazon Prime you got Twitch Prime give us the five bucks or give it to her let's get Lexi she does cool **** got a YouTube channel too I do no thanks for coming in yeah thanks for having me thanks for the ribs and the food anytime ladies and gentlemen we've enjoyed hanging out with you we're going to make a Mario Kart let's play and then a bunch of Patreon exclusive content for people thank you videos and whatnots hangouts almost dropped my rib again but I caught it don't worry maybe",
      "start": 7242.32
    },
    {
      "text": "going to make a Mario Kart let's play and then a bunch of Patreon exclusive content for people thank you videos and whatnots hangouts almost dropped my rib again but I caught it don't worry maybe there's a Mario Kart promotional video coming out soon maybe there is an awesome Mario Kart promotional video coming out soon today to talk about killing Zigger kill a bunch of other kids that suck yeah until next time it's been a pleasure to serve you",
      "start": 7284.92
    }
  ]
}
