{
    "id": 2585,
    "video_id": "kCSPHpVKYHs",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Burnie Burns",
        "Colin Moriarty",
        "Dagan Moriarty",
        "Geneviève St-Onge"
    ],
    "title": "Kinda Funny: The Animated Series - Ep. 10 \"Greg Miller Is Scared Of Sex\"",
    "description": "Ep. 1 \"Politically Correct Dodgeball\": https://youtu.be/2yhISvYtugM\n\nEp. 2 \"Haters Gonna Hate\": https://youtu.be/x-ukJa3fG2Y\n\nEp. 3 \"Classic Colin\": https://youtu.be/apfwjkYgcNQ\n\nEp. 4 \"God Damn It, Barb\": https://youtu.be/geCvT5Eyt9o\n\nEp. 5 \"Sex Ed Class\": https://youtu.be/pyARw2rBUpM\n\nEp. 6 \"Portillo's Origin Story\": https://youtu.be/-zUvl8HvTaM\n\nEp. 7 \"Star Wars Christmas Special\": https://youtu.be/TnMZmYc9hJc\n\nMusic by Tonedeff - http://www.QN5.com\nTheme music by Kory McMaster - http://www.twitter.com/KoryMcMaster\n\n\n\n\n\n\n\n\n\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1493308805,
    "duration": 395,
    "transcript_chunks": [
        {
            "text": "previously on Kinda Funny: The Animated Series. Bonjour everyone, my name is Jenv. I am from Montreal. As part of my rehabilitation program mandated by the great state of California, I'm here to tell you about STDs. I could really use someone to show me around after class. Everything is kind of intimidating, you know? Mr. Burnie the clown, can you do magic tricks? Sweetheart Candy, the monster is back. Kinda Funny Goes to School. They've got their crew, they are so cool. Looking out for each other, except for Kevin S. Dude, this game for Cy the Bri of Long Island, Producer Seducer, and the pure want to. There's nothing they can do together now. Oh, the Kinda Funny crew. Yeah, there's nothing they can do. Another day, another dead hooker. A shame, it's just a waste of perfectly smooth skin. Oh man, did I order a pizza and forget again? Hello Greg, it's me, Jenv. Hi Jenv, what are you doing here? I brought you some homemade cupcakes. Why? Um, because I thought you'd like them. Well, you're sure",
            "start": 0.16
        },
        {
            "text": "skin. Oh man, did I order a pizza and forget again? Hello Greg, it's me, Jenv. Hi Jenv, what are you doing here? I brought you some homemade cupcakes. Why? Um, because I thought you'd like them. Well, you're sure right about that. So, may I come in? Well, normally I'm not allowed to have any strangers in the house, but since you're a girl, what could possibly happen? Come on in. Yes, Chico, I realize this is what got me in trouble last time, because the heart wants what the heart wants, Chico. Love conquers all. Yes, even the 0-foot high outer wall of San Quentin Penitentiary. That's not how murder suicides work, Chico. Of course, I'm still going to eat his face, Chico. God, sometimes I think you don't even know me. This one is a mint condition Superman from the year I was born, and this one is a mint conditioned Superman from the year after I was born, and this one. How long must we continue to play this game? What? I have Freedom Wars if you want to play that instead. Okay, we're just going to go in there and tell him how",
            "start": 102.84
        },
        {
            "text": "the year after I was born, and this one. How long must we continue to play this game? What? I have Freedom Wars if you want to play that instead. Okay, we're just going to go in there and tell him how we feel. That's it. It's that simple. No reason to be nervous. If he rejects you, that's what the chloroform is for. We both know that underneath that doughy, soft, pasty white exterior of yours beats the Heart of a Lion. We did the lion. Mufasa is the king of the jungle. He does not play games. He takes what he wants. You drive me wild with passion. Can you feel my heart? It bursts for you. Wow, your heart is beating really fast. That usually happens when I mainline soda, Mounds bars, and wings. Mom calls it my version of an eight-ball. Kiss me, you big beautiful fool. Are you crying? No, I just, I time to go to the bathroom real quick. I'll be right back. Nope, not answering that. Damn it, what do you want? You know I carve out this time every day to speedrun Mega Man. Colin, there's a girl here and she",
            "start": 179.2
        },
        {
            "text": "real quick. I'll be right back. Nope, not answering that. Damn it, what do you want? You know I carve out this time every day to speedrun Mega Man. Colin, there's a girl here and she wants to kiss me and I can't breathe. I think I'm having a heart attack. What do I do, Colin? Oh no, ew, why does this smell like cat pee? Oh, come on, go for Nick. Nick, that weird French Canadian girl is here and she brought me cupcakes and she wants to kiss me and I don't know what to do. Wait, let me get this straight. A cute girl came over to your house and wants to kiss you and you don't know what to do? I can feel the walls closing in on me. This is what dying must feel like, Nick. I am definitely dying. Jesus, stop being a baby and go in there and kiss her. You know, at some point you're going to have to use your penis. But I don't want to, Greg. I don't have time for this right now. I'm with my girlfriend. Okay, go with God, Nick. Out. Sorry about that, beautiful. Where were we? You turn me on so hard, baby, of",
            "start": 240.36
        },
        {
            "text": "use your penis. But I don't want to, Greg. I don't have time for this right now. I'm with my girlfriend. Okay, go with God, Nick. Out. Sorry about that, beautiful. Where were we? You turn me on so hard, baby. Of course I do. Oh, Jesus, my leg. Please, somebody help me. I don't want to have sex. You wouldn't be alive for that part anyway. And after hours of screaming, I finally went back in and she was gone. And the best part is, she totally left the cupcakes. I hate you so much right now. He",
            "start": 319.24
        }
    ]
}