{
  "id": 2550,
  "video_id": "KnnCtFZFcjw",
  "show_name": "Kinda Funny Morning Show",
  "hosts": ["Greg Miller", "Nick Scarpino", "Kevin Coello"],
  "title": "Our Fate of The Furious Barbecue  - Kinda Funny Morning Show 04.13.17",
  "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1492115065,
  "duration": 5341,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Welcome to the Kinda Funny Morning Show for April 13th, 2017. I'm one of your hosts, Greg Miller, alongside the producer seducer, Nick Scarpino. I wanted to do, I was going to do like a wrestle move. I was like, you know, or something like that, but I don't know what they do that's like the, that's like a, you know, three St. There you go. That this whole thing was like in Spaceballs, like their secret handshake, the way they salute. Now tell me about this shirt. I was going to say, tell me about this shirt. I like this shirt. This is an Invincible shirt. I freaked out on uh this show when they announced the Invincible movie and they sent me this shirt. I got some water spots on it. No, it's great. I was back there making burgers this morning. It's a barbecue day. I was making the wings, have some raw juice kicked up on me, but that's just water from what I just did my hair. No, it's great. It's a good color for you, purple. Not not a color a lot of white guys like us can uh can pull off. It's a",
      "start": 1.47
    },
    {
      "text": "some raw juice kicked up on me, but that's just water from what I just did my hair. No, it's great. It's a good color for you, purple. Not not a color a lot of white guys like us can uh can pull off. It's a darker. You got to go with a dark color on chest because my skin's so white. Also good news though, look, Kevin, keep me honest, no on pit marks, right? The certain dry combination's working. Are you doing it? Um, are you doing a new like hardcore? I do. I've been on it for a while and that's why a while back impressed. Yeah, yeah, okay. But then it's, but then because the hardest thing about it is, is I use a certain dry roll on at night, M, and then it's in the morning I wake up and don't put on deodorant, right? Which is super weird, a super weird thing to do. But then it honestly, I usually get through day in a while. I there's been a few days where I'm like, and I I have this certain dry if you need an emergency one, put it on. I keep desk. If you ever seen me, it pops like like a t comper shoots me all over now, but",
      "start": 47.8
    },
    {
      "text": "I there's been a few days where I'm like, and I I have this certain dry if you need an emergency one, put it on. I keep desk. If you ever seen me, it pops like like a t comper shoots me all over now, but what's this shirt? This is a new shirt for you. Yeah, this I uh this is a shirt I'm a fan of this guy's YouTube channel. Um, he does, it's called, he it's called Jiu-Jitsu. Okay. Uh, I believe his name is Nick Albin. Uh, he's a black belt Jiu-Jitsu out of I want to say like Buffalo, New York. Anyway, I I stumbled across his his videos a long time ago when I started when I first started flirting with the idea of getting back into Jiu-Jitsu. Very inspirational guy. So I thought I'm just going to put my money where my mouth is and support to see you do it. And it's a great color. Nice to see you wear shirts that you just didn't get off indie game developers for free and never play their game or our own shirts that they ship for us and they're like, please wear these so people actually know they exist. Sure. Yeah, I",
      "start": 90.24
    },
    {
      "text": "just didn't get off indie game developers for free and never play their game or our own shirts that they ship for us and they're like, please wear these so people actually know they exist. Sure. Yeah, I don't have anything this color either. I was going to buy the heather gray version of it, which spoilers, I probably still will buy version of it. But uh yeah, let me double check his name. Do the Jiu-Jitsu moves. Is that the thing? Yeah, he's a bad ass. Okay. Yeah, if you saw this guy, you'd be like, don't mess with this guy. I want to mess with this guy. If you go to, you can go to Jiu-Jitsu.net and see all this stuff. I take a lot of pride in like exclusively wearing Kinda Funny shirts and then you wear that Grandma shirt though. Oh yeah, well, I mean, soon enough, you know what I mean? Yeah, that is. You're wearing prototype ones. I wear a lot of, I usually wear Kinda Funny stuff. I think I'm not, I'm not like, I'm just saying, I'm just saying, it's not because they're free, it's because I love this place. Well, you",
      "start": 127.64
    },
    {
      "text": "prototype ones. I wear a lot of, I usually wear Kinda Funny stuff. I think I'm not, I'm not like, I'm just saying, I'm just saying, it's not because they're free, it's because I love this place. Well, you got to. Yeah, yeah, of course, of course. Um, of course, it's the Kinda Funny Morning Show. I'll get into the real intro in a second. Of course, though, it's a special day. It's April 13th. Means it is long. We're not. Why would they sing this? That's why bring, why would you bring me down? It's Fast Day. Yeah, we're going to get to all the real rig stuff. Fast Day. Wow, you guys are the so offbeat, not on the same page at all. Oh yeah, no, I wasn't even like that. You're supposed to go Fast Day. Like you're supposed to help watch show you, show them how it goes. Fast Day, Fast Day. Even you that Fast Day. I thought you were you. Then I was going to Fast Day, Fast Day. I don't know. Fast Day, Fast. I know what you guys are doing. Anyways, the thing I was going to say is that it's, I don't, don't leave me in the wide, leave me in the wide.",
      "start": 165.28
    },
    {
      "text": "I was going to Fast Day, Fast Day. I don't know. Fast Day, Fast. I know what you guys are doing. Anyways, the thing I was going to say is that it's, I don't, don't leave me in the wide, leave me in the wide. It's April 13th. It's the birthday of one Genevieve St. I never heard of her. Love my life. Really? Congrats. Never. When did you meet her? A while back. Okay. You met her first, actually. Did I? Yeah, you met her first. Um, so I thought I would give her her birthday here on the Morning Show. Birthday gift. No, no, she's in Montreal. Of course. Oh, okay. So you're going to, you're going to ship her this birthday gift? No, I've already, I mean, she already gave her flowers and these weird paddles she wanted. Don't ask. Uh, and so she's got that. Now I have to ask. No, I absolutely have to. Are these paddles that one used on someone's derriere? Paddles for, they're decorative paddles as if you were like in a in a canoe, but they say Canada something on them. Here's the thing, give me the one. Now here's what I'll say to you, ladies and gentlemen,",
      "start": 212.36
    },
    {
      "text": "paddles for. They're decorative paddles as if you were like in a in a canoe, but they say Canada something on them. Here's the thing, give me the one. Now here's what I'll say to you, ladies and gentlemen, mainly, well, I guess ladies and gentlemen, you got a significant other, right? At some point, they're going to be on the Instagram doing this and say, oh, look, this would be cool. I wish I had something like that. And then here's what you do. You go, no. Okay. And then they keep scrolling and they forget they said it. And then you remember because she was looking through some not stupid, I don't know, some houseware Canadian houseware store that I don't freaking know, you know what I mean? On Instagram. And I'm like, I'll remember that name. I'll remember the name of that store. Didn't remember the name of that store at all. So then I had to go to Google. When I got back, I Googled Canadian houseware stores. Then I got this and I found one of those passionated sites like the top 30. I'm like, all right, cool. I'm clicking",
      "start": 258.12
    },
    {
      "text": "all. So then I had to go to Google. When I got back, I Googled Canadian houseware stores. Then I got this and I found one of those passionated sites like the top 30. I'm like, all right, cool. I'm clicking through like, that sounds like it. That doesn't sound like it. And then it popped up Hudson's Bay or whatever. Hudson's Bay. I was like, oh, that's the one. Went over there, went to their Instagram, found the paddles, bought two paddles. One day, if God is ever kind and we live together, we'll put him up in our house. We long distance and I never see her. Anyways, though, you saw her last weekend. Go to the W, go to the, we were together last. I saw her last to see her next weekend too. So we're just a bunch of figures. Going to be great. I'm going to give her her gift now. Okay. Now the, this is a real gift. Paddles were just setting her up real. I send her the paddles. Now it's time for the real gift. Now I'm going to need your help. The real deal Holyfield. I'm going to need help. Kevin, can you somehow get me a 30-second",
      "start": 293.2
    },
    {
      "text": "just setting her up real. I send her the paddles. Now it's time for the real gift. Now I'm going to need your help. The real deal Holyfield. I'm going to need help. Kevin, can you somehow get me a 30-second timer that the audience can see? Is that possible, Kevin? Yeah, you're sure. Big Kev dog, big old Kev dog. You going to put it behind us, you think? Because I want the audience to be able to see it. Give me two seconds. I'm going to give, I'm going to give Kev two seconds. I give you three seconds for you and your gallant crew. I'm start. That was from Star Trek II: The Wrath of Khan. What? You're right, Kev. This shadow is way too bright. This monitor is just like dark. What are you saying? I that that why is way too bright? You're right. Okay. The, we just need to, we just need to set the brightness up on the monitor so I'm not confused. I think we did like mess with the brightness recently too. It's okay. We get a production monitor in here that's actually like getting loose. Crazy. What is this present? It's it's a physical",
      "start": 333.08
    },
    {
      "text": "confused. I think we did like mess with the brightness recently too. It's okay. We get a production monitor in here that's actually like getting loose. Crazy. What is this present? It's it's a physical activity. Here we go. Hold on, hold on. No, ignore what happened. Ignore what happened. Why? That's what I wanted. I wanted 30 seconds behind me there. I I know, but it this is all messed up. I see exactly what I want. That's what I wanted. Give the people what they want, Kevin. Hold on, hold on. I'm still holding. Give the people what they want. Okay, that's perfect. It yeah, that's great. That yeah. All right. Now, Nick, what I'm going to need you to do is provide moral support. Okay? Because what I'm the birthday gift here for Genevieve St.'s birthday, okay, is that I am going to flex, which she loves for 30 seconds. She loves when you flex. Loves it. Drives her wild. Dude, I'm not kidding. She's in the chat. She's in the chat always all the time. When I flex, freaking out. She's in there right now. So you're going to do 30 seconds",
      "start": 377.92
    },
    {
      "text": "when you flex. Loves it. Drives her wild. Dude, I'm not kidding. She's in the chat. She's in the chat always all the time. When I flex, freaking out. She's in there right now. So you're going to do 30 seconds of flexing. We're in a long-distance relationship. We don't get to see each other. It's her birthday. What what else would I give her? I already gave her sexual water paddles. Is this going to be safe for work? I mean, what am I getting myself into? Is Greg Miller ever flexing safe for work? That's fair enough. That's fair enough. Hold on to your trousers, everybody. I just need you to support it for. Give me the moral support. I also need you to call out camera one, camera two. Are you are you okay with it looking like this? Yeah, okay. I I mean, I'll see it too. So I can flex. I can flex around if I need to. I can put it here. Yeah, put it there. Okay, put it there. That's great. Little thing. We did something cool here. All right, good. This is okay. Hold on. Do I need to do we need for this? I want you to start. Oh yeah, if you",
      "start": 422.96
    },
    {
      "text": "here. Yeah, put it there. Okay, put it there. That's great. Little thing. We did something cool here. All right, good. This is okay. Hold on. Do I need to do we need for this? I want you to start. Oh yeah, if you get a song that would not get us copy. Well, who do we care about copyright strikes? No, I don't have to do anything. I kind of care. I mean, as long as it doesn't take it down. How about blur? How about Blurred Lines? That's not going to get us. No, people love Blurred Lines. Yeah, people. That's fine. I I can hear me talking now. That what I sound like. Oh, we all sound like crap. I was just kidding. Here we go. Count it down. Go. Oh, no, no. Look at you've been counter is not moving. It was very. All right, Kevin, give me the one. Give me the other one. It's the exact same one. Give me that one. Give me the wide, wide back to the one. Look at those Chewbaccas you got in there. You know they have definition of the back. Oh, wow. No, yeah, my favorite is the angel wings made of hair that you got in the back. Got of the back. A lot of",
      "start": 462.76
    },
    {
      "text": "the one. Look at those Chewbaccas you got in there. You know they have definition of the back. Oh, wow. No, yeah, my favorite is the angel wings made of hair that you got in the back. Got of the back. A lot of guys in UFC have that tattoo. But uh and we got 5 seconds more. You're harder. How go? Give me one of these. Go outward out. Oh, no. Now give me the. Now give me the Superfly Jimmy Snuka. Snuka. And we're done. Okay. Now we're done with that. All right. That was a lot. Thank you for that. They are we allowed to show nipples now on Twitch? Yeah, we are. We are. Yeah, they male nipples are fine now. They said, oh, cool. As long as we don't do it in a sexual manner, which this was not sexual in any ways, shape or form. I mean, I'm hard. All right. Well, I'm being honest. I also feel like I'm going to sweat through the shirt. The armpit are going to sweat through the shirt because of that. You got air on them, huh? Yeah, once they're exposed to air, my armpits have a set of rules much like Mogwai. Yeah, don't feed them after midnight.",
      "start": 520.4
    },
    {
      "text": "armpit are going to sweat through the shirt because of that. You got air on them, huh? Yeah, once they're exposed to air, my armpits have a set of rules much like Mogwai. Yeah, don't feed them after midnight. Don't put water on. No direct sunlight. No bright lights. If you molest them, don't tell anyone what. No, that's not. Come. Can you? I don't know who the hell cares. Not even really. I know they're stupid. Pet ain't looking out for the M. I'll tell you right now. Tell should have strangled that little crap and whole movie would have been avoided. True. It's true. As soon as they multiplied, like, oh man. All right, put them in a bag. Get me the lawn mower. Oh yeah. Second, the second they multiplied, I'd be like, I don't like guys. This is natural. We don't need this. I would just, I would just herd them into a small little building that I made specifically for them. Shut the door, lock it, light that crap on fire like Braveheart. Wow. Okay. Yeah, remember that scene? I do vaguely. I do. I do. And William Wallace, the L take.",
      "start": 565.92
    },
    {
      "text": "little building that I made specifically for them. Shut the door, lock it, light that crap on fire like Braveheart. Wow. Okay. Yeah, remember that scene? I do vaguely. I do. I do. And William Wallace, the L take. I free them. I free them. If you didn't know, ladies and gentlemen, this is a Kinda Funny Morning Show each and every weekday here on Twitch.tv/KindaFunnyGames. We come to you with the nerdy news you need to know about before jumping in the chat to answer your questions, comments, and concerns. In between those two segments, I reach into the internet, grab a video game, toss it out to one of you. There's a million ways to win, even if you're one of the people not watching live, who is watching on YouTube.com/KindaFunny later or listening as this is a podcast on podcast services around the globe. The Kinda Funny Morning Show. It would mean a lot if you went to iTunes, subscribed and rated it just for shits and gigs and only if you like it. If you're going to give it a bad rating, screw off. We",
      "start": 613.04
    },
    {
      "text": "the Kinda Funny Morning Show. It would mean a lot if you went to iTunes, subscribed and rated it just for shits and gigs and only if you like it. If you're going to give it a bad rating, screw off. We don't want that at all. It's Fast Day. Are you stoked to go see Fast and the Furious here's the my bro? Um, I I got hyped on Monday. Forgot that it was happening on Tuesday, Wednesday as one does leading up to Christmas morning, right? Last night, yeah, 11:00 at night watching One Frasier classic show. Maybe I hear he bravery. Um, and I remember that it was Fast Day tomorrow. Got so excited. Had to stay up until I like literally stayed up until o'clock in the morning because I was like jacked. I was jacked. No, it wasn't that kind of Jack that happened before. Sure. Um, I'm super excited, super excited to see this. We got a great crew of people coming going tonight. Um, we're going to do a reacts afterward, right afterward. So that'll be up. You guys can look for that. Kevin, are we going to get that up to tonight or",
      "start": 650.52
    },
    {
      "text": "we got a great crew of people coming going tonight. Um, we're going to do a reacts afterward, right afterward. So that'll be up. You guys can look for that. Kevin, are we going to get that up to tonight or does that go tomorrow morning? Heck yeah, we're going to get that crap up tonight. We're going to get that up tonight. Um, spoilers, we're probably all going to really like it because we're here's the Kool-Aid. Go. Yeah, baby. Pour that all over my face. Just splashing on me. I'm very excited, very excited to see The Rock, very excited to see Vin Diesel. It breaks my heart they don't like each other, but I'm just going to pretend like that never happened. Sure, right? Sure. Um, well, it plays into what's happening though, because they don't like each other in the movie anymore. Exactly. He turned his back on family. It's true. But in reality, you never turn your back on family. It's true. So we'll see what happens. Can't wait for The Rock to take that torpedo and throw it at a car because apparently he can throw torpedoes now. Well, I",
      "start": 701.72
    },
    {
      "text": "reality, you never turn your back on family. It's true. So we'll see what happens. Can't wait for The Rock to take that torpedo and throw it at a car because apparently he can throw torpedoes now. Well, I mean, when it's already moving on ice, that makes sense. It's true. No, when it's already going, you just redirected. Exactly. You have to have The Rock's massive triceps, right? Give that in. Give that in. Yeah, get it in. Get it in there. What The Rock always says, get. He say that? He says, do you smell what The Rock's getting in there? That's what he used to say. That is what he used to say. Do you smell what The Rock's getting in there? Yep. Yeah, I mean, I guess it's similar. That's what he said. Okay. You don't know wrestling like I know wrestling. I'm sorry. I I know you're a fan of like maybe the classic era of wrestling, the Hulk Hogans, you know, the the Jimmy Snuka. Yeah, Jimmy Snuka. That's a good one. Jimmy Snuka. Yeah. Um, one, give me two. The the Eddie Guerrero, right? Not classic. The Ultimate Warrior. I'll",
      "start": 737.96
    },
    {
      "text": "the Hulk Hogans, you know, the the Jimmy Snuka. Yeah, Jimmy Snuka. That's a good one. Jimmy Snuka. Yeah. Um, one, give me two. The the Eddie Guerrero, right? Not classic. The Ultimate Warrior. I'll give you that. The Ric Flair's. You see what I'm saying right there? Woo! But who? There it is. Strapping crap. It's the Kinda Funny Morning Show top story. Before we go into that, we do have one more birthday. I want to everybody, I want to wish a good friend of ours happy birthday. It's Mr. 100 P birthday today. Everyone, we're going to do. Kevin, give me the 30. Give me that 30 seconds again. Hold on. I just, I had to rewire. Okay. Give me 15 seconds. That doesn't make it easier. Give me 10 seconds. Hold on, hold on. Get where's Chad? Where is Chad? This is a Chad-worthy moment. I'm going to make you do this, Nick. I'm going to make you do this and I'm going to ask for all kinds of stupid crap. A a. Oh, crap. All right, give it to me. We're going to dance for Hunter for 30 seconds. Okay, here it is. Ready? Oh, wait, wait, what the",
      "start": 776.08
    },
    {
      "text": "you do this and I'm going to ask for all kinds of stupid crap. A a. Oh, crap. All right, give it to me. We're going to dance for Hunter for 30 seconds. Okay, here it is. Ready? Oh, wait, wait, what the crap happened? I you put the news story that the top story is up there. No, I don't think I did that. Oh, okay. All right, all right. Ready? Yeah, it's not quite in frame, but just crap. Do it. Doesn't matter. Hit it. Happy birthday. Your happy birthday dance. Hunter's this birthday. Hunter friends. Is he playing baseball today? Probably. He has a real life. Well, I mean, I don't mean like right now. I just meant today. I don't know. In my mind, he plays baseball all the time. Everybody, I want you to dance at home. Dance at home for this to this this brand new song. Film yourself and send it to 100 P. Just send it to 100 P. Say happy birthday, 100 P. #SweetNastyLove. He won't know what that means. Doesn't matter. He'll feel it though. He'll understand it. Okay, we're what is crap? Go. Oh, the that's the timer. Oh, wow. That's an",
      "start": 834.0
    },
    {
      "text": "say happy birthday, 100 P. #SweetNastyLove. He won't know what that means. Doesn't matter. He'll feel it though. He'll understand it. Okay, we're what is crap? Go. Oh, the that's the timer. Oh, wow. That's an alarming alarm that sounds like a nuclear bomb is about to go off. You guys, it works though. You know what I mean? Cool. Top story. Yay, Nick. You found this one. I missed it. I did. This is on Variety this morning over on Variety.com. Todd Spangler says, could Apple buy Disney? Wall Street revives rumor of mega deal. Holy crap. Apple could potentially find the cash to pull off a 200 billion plus takeover of Disney, creating a company worth 1 trillion with almost limitless opportunities in content and technology. That's according to a speculative analysis from RBC Capital Markets, which in a note to client, in a note to client Thursday, said such a colossal tie-up would be the would be contingent on Apple getting tax breaks to repatriate overseas cash. Recently, investors have increased their expectations",
      "start": 886.88
    },
    {
      "text": "in a note to client Thursday, said such a colossal tie-up would be the would be contingent on Apple getting tax breaks to repatriate overseas cash. Recently, investors have increased their expectations that Apple could seriously consider acquiring Disney. The RBC analysis said a combined Apple-Disney would create an instant competitor to Netflix and would take advantage of the Mouse House's content and user base. The analysis speculated other benefits integrating Apple consumer tech as experience in Disney theme parks and landing global streaming sports rights for ESPN via the combo of Disney-backed BAMTech and Apple distribution and a strong balance sheet. Content has a major focus for Apple. Target size is not an issue and Disney offers an avenue to diversify away from hardware without diluting the strong Apple brand. RBC said the M&A rumor mill got news new grist last fall when Apple Chief Tim Cook pictured about told analysts that the tech giant was open to acquisitions of any size. In",
      "start": 933.8
    },
    {
      "text": "the strong Apple brand. RBC said the M&A rumor mill got news new grist last fall when Apple Chief Tim Cook pictured about told analysts that the tech giant was open to acquisitions of any size. In addition, Apple execs met with Time Warner honchos in late 2015 in a discussion that raised possibility of a merger before AT&T moved on its $85 billion bid for Time Warner. The Apple-Disney M&A chatter, I'm sorry, the Apple-Disney M&A chatter does come as analysis in the last few months have debated the possibility that Disney would take a move to buy Netflix. Uh, a highly leveraged transaction, blah, blah, blah. And we keep going on like this. Uh, this would be insane. Be freaking insane. It's one of those things though, after Disney bought Star Wars, you can't sit there and be like, well, I can't see anything like that. Anything can happen now. True. The gloves are off in the world. How would you feel about that, Kevin? I know you have Apple and Disney stock. How would you feel about that? Because their stocks would surge up. I'm",
      "start": 980.64
    },
    {
      "text": "can happen now. True. The gloves are off in the world. How would you feel about that, Kevin? I know you have Apple and Disney stock. How would you feel about that? Because their stocks would surge up. I'm sure that I would be freaking extremely excited. It would be crazy, right? That would be insane. I my thing is, I don't like to rock the boat. Disney has it locked down right now. Apple Apple's doing some interesting things that I'm not really excited for. They're doing some stuff like this. Um, they're creating computers that like you can change components in. Oh, okay. So it's like that's that's kind of against what you. Yeah. And now they have all these options for iPhones. It's like, dude, yeah, their core DNA is very much uh has very much been diluted unfortunately over the last like I think five years since Steve Jobs died or how long, however long ago he died. Um, I don't know. I think Disney has it on freaking lock right now. They have a great plan for rolling out great movies of all across the board for their",
      "start": 1024.0
    },
    {
      "text": "Jobs died or how long, however long ago he died. Um, I don't know. I think Disney has it on freaking lock right now. They have a great plan for rolling out great movies of all across the board for their genres. I would not want to see anything rocked. I don't want to watch the boat on this. You don't want Apple getting in there muddling with the sauce. Well, I just, I mean, obviously like I don't ever want to get in the way of progress, right? Like I'm always a late adopter of everything. When Netflix came out, I was like, that's never going to catch on. And I'm always wrong. Um, I don't, I like the fact that they could give Netflix run for their money. Competition is great in that space and it's only even, it's going to get, it just means for content creators like us or other people out there that are making longer form content. That's great. Okay. Having said that, we had a dark era of Star Wars. We're in the light now. We're on the light side. Let's stay here. Can we please stay here? Hear you, but I feel like this",
      "start": 1065.48
    },
    {
      "text": "four content that's great okay having said that we had a dark era of Star Wars we're in the light now we're on the light side let's stay here can we please stay here hear you but I feel like this would be similar to how what they've done when uh you know the way Disney has worked with everything they've bought so far with Star Wars with Marvel all these different things that's Disney buying those though sure but I feel like that's the same thing is like think of it as a big corporation buys someone they're not buying it so then **** with everything I think you be buying it to say keep making what you want keep making the movies keep on this path we're not trying to get in the way if anything we're trying to help you one would hope one would hope yeah right uh but but it can't it could go the other way I feel like the Apple of old was all about vision and this Apple is all I I really don't feel like it has the same like I think they've taken a different path I age and I feel like",
      "start": 1098.68
    },
    {
      "text": "go the other way I feel like the Apple of old was all about vision and this Apple is all I I really don't feel like it has the same like I think they've taken a different path I age and I feel like right now Disney U I think it's still Bob Iger right no he's gone who's Michael Eisner who the hell is the CEO of Disney now I'm you keep make your point uh I I really feel like they have a solid plan I feel like uh Kevin Feige over at Marvel understands how how they're rolling out these things it is Bob Iger I was think you said the other guy you're thinking Michael Eisner Bob Iger yeah I feel like they they're and I think he's actually reupping he keeps trying to say that he's going to leave every every like year well they're like I think they they just can't find a replacement I think for it doesn't matter they're doing a great job over there let's let's leave it alone we're good we're getting really great Marvel movies we got uh uh the Josh Brolin is uh now starting to permeate through all",
      "start": 1133.2
    },
    {
      "text": "doesn't matter they're doing a great job over there let's let's leave it alone we're good we're getting really great Marvel movies we got uh uh the Josh Brolin is uh now starting to permeate through all Marvel properties that's heard a rumor yesterday it wasn't even a rumor it was some comic book website talking about do you think they'll recast Thanos because of this no why he's just a **** voice who cares who cares I mean it doesn't matter we've only seen like yeah who cares they recast the Hulk like five times it's fine yeah Spider-Man's on his 19th iteration yeah so whatever possibly his best we'll see it's true I I I feel like if if it came down to it I'd rather see Josh Brolin as Cable if be saying too like most people don't even know he's Thanos no because who knows who the Thanos is Cable's a way more interesting character uh Thanos is only going to be in the next two movies that's pretty much going to be it right the Infinity so we'll see what happens you'd assume and then you",
      "start": 1169.88
    },
    {
      "text": "Cable's a way more interesting character uh Thanos is only going to be in the next two movies that's pretty much going to be it right the Infinity so we'll see what happens you'd assume and then you get bopped out and then have to go do his other **** on Bob give you a little there all right fine well I was going to say next story but Kevin ran away from his post uh EGS Mala 4.0 says problem is Disney success is the reason why this is even considered that's true they are a product of their own success and the reason why Apple would want to acquire them is because they're doing so well but um and I think that's Apple knows they're not doing as well well and Apple and the articles point like Apple it has been trying to get into the content distribution well they're obviously in the content distribution business with iTunes um but they want to get in more I know they're they're champing at the bit to get into the content uh creation business as well and this would be I mean who",
      "start": 1213.12
    },
    {
      "text": "content distribution business with iTunes um but they want to get in more I know they're they're champing at the bit to get into the content uh creation business as well and this would be I mean who better to have on your side to do that than **** Disney right now yeah you know because you've got you've basically got all your bases cover in that regard so and if they were to do that I'm sure they would pull basically everything off of Netflix and that would be insane that would be insane so that would cause that would cause some ruffles and then Amazon would just sit back and be like we're still waiting to take over because I honestly believe Amazon's still going to win Amazon's one's going to win at all I think so okay my my money's on Amazon I don't I have a lot of faith in them I I really feel like they're it's they're one of those companies that like they've just it makes sense they've got all this other revenue coming in from all these other sustainable their sustainable platform",
      "start": 1251.52
    },
    {
      "text": "feel like they're it's they're one of those companies that like they've just it makes sense they've got all this other revenue coming in from all these other sustainable their sustainable platform which is distribution of goods I I mean I feel like they're just like we're going to keep throwing money at this problem till till we win sure or till we buy Netflix we'll see what happens that'd be more interesting yeah I'd like that to happen uh yesterday there was a Nintendo Direct we're going to jump over to GameSpot Justin Haywald has most of it written up here all the Nintendo Direct Switch game release dates and announcements uh during today's Nintendo Direct in addition to the pr new details about Arms and Splatoon 2 we also received a downpour of new information for game release dates in details here's a recap Mario Kart 8 Deluxe April 28th we already knew that of course you're well aware with this I'm going to kick the **** out of Z that day I'm going to take Sean Pits' $50 some",
      "start": 1286.48
    },
    {
      "text": "in details here's a recap Mario Kart 8 Deluxe April 28th we already knew that of course you're well aware with this I'm going to kick the **** out of Z that day I'm going to take Sean Pits' $50 some other **** one of you try to step up and make a a promo video yesterday talking **** to me about how you're going to beat me too give you want to do a promo for I have plans for his promo video I saw the wheels when you were watching yesterday you you did one of these that Greg Miller like which which means bully Greg do it again give me the one you like this yeah it was devilish that's what I did all right it was devilish beautiful Ultra Street Fighter II May 26th uh Minecraft May 11th more Neo Geo games Sonic Forces Holiday 2017 Sonic Mania Summer Project Mekuru probably uh Summer 2017 Fate/Extella July 25th Disgaea 5 Complete May 23rd Puyo Puyo Tetris the demo for the game is Puyo Puyo Tetris it's Tetris another game called Puyo Puyo Okay so it's just a combination of the two",
      "start": 1322.68
    },
    {
      "text": "2017 Fate/Extella July 25th Disgaea 5 Complete May 23rd Puyo Puyo Tetris the demo for the game is Puyo Puyo Tetris it's Tetris another game called Puyo Puyo Okay so it's just a combination of the two Monopoly Fall 2017 sometimes you guys say things and I'm like are they **** with me no we're not **** with the other one uh Kamiko Summer 2017 Battle Chasers: Nightwar Late Summer 2017 Payday 2017 Namco Museum Summer 2017 the Standalone Switch Dock May 19th which you can buy now but that's going to go into stores which is interesting and then the ones that they were touting for a long time Arms is June 16th Splatoon 2 July 21st none of that matters of course because Mario Kart April 28th so your your money's on Mario Kart are you looking beyond Mario Kart is there anything in the next four months that you're really excited about besides Mario Kart on the Switch probably those NES more than anything yeah they just pop up I mean we've had a really good run here Mr. Shifty you're",
      "start": 1368.52
    },
    {
      "text": "four months that you're really excited about besides Mario Kart on the Switch probably those NES more than anything yeah they just pop up I mean we've had a really good run here Mr. Shifty you're playing Mr. Shifty right now right you Shifty and Snake Pass is your jam right now right well Snake Pass I've 100% completed done with it loved it it was great call the Snake Pass team Kevin needs more tell him we get on it okay we need DLC okay we'll do Dino Dino get your ass together need more Mr. Shifty also Nioh you didn't beat did you no no I think I'm pretty far through it though yeah you you were playing it nonstop this week yeah it's been a lot of fun it's great we did that stream I loved it when I there yep uh saying on the Nintendo beat we're hopping over to IGN.com where Jose Otero friend of the show says Nintendo Switch neon yellow Joy-Con battery pack accessory announced dope you all you made a joke about fluorescent colors for Switch stuff and then it popped off hours later there",
      "start": 1416.04
    },
    {
      "text": "of the show says Nintendo Switch neon yellow Joy-Con battery pack accessory announced dope you all you made a joke about fluorescent colors for Switch stuff and then it popped off hours later there was I love it that's awesome Nintendo I've got my finger on the pulse when it comes to Nintendo I've I've often said that I've often said that out of everyone in this office I'm the one that knows more some say that the Championship Belt you have Nintendo World Championship gave you the power they call me the Jose Otero of Kinda Funny they do call you the Jose they call me the Matt Casamassina Mark Bozon way too these are way too old none of these kids understand who those people are Jose Otero Jose Otero of Kinda Funny Jose has Nintendo announced a pair of Switch accessories during today's Direct present dope by the way those look dope the company revealed a neon yellow set of Joy-Cons along with a corresponding Joy-Con strap accessory of the same color will be sold separately at retailers on June",
      "start": 1458.92
    },
    {
      "text": "dope by the way those look dope the company revealed a neon yellow set of Joy-Cons along with a corresponding Joy-Con strap accessory of the same color will be sold separately at retailers on June 16th this is the same release date for Nintendo's new fighting game called Arms Arms uh much information here we don't care about there's something here here's the deal there's something about Nintendo that I've always found fascinating it's N64 yeah when they had the different colors for the N64 that's what got me there's something about about having the exact same thing but in multiple colors awesome that I have to collect I do it don't get me wrong I think the Joy-Cons suck in in terms of putting them into the Pro the the Joy-Con grip I don't like that are you actually using the dock like that's this is my question very rarely I don't either I keep the thing like this it's just a handheld let's be honest let's call it what it is say it's a **** handheld device so but I do like the idea of when they put",
      "start": 1500.4
    },
    {
      "text": "is my question very rarely I don't either I keep the thing like this it's just a handheld let's be honest let's call it what it is say it's a **** handheld device so but I do like the idea of when they put out colors that I'm super into and maybe the price comes down buying them and then have buying and putting them on the dock and there's just another controller sitting around but and like you're you're bring up a good point of like are we using the dock no but I think it's one of those that's also I think that's going to change you go I'm going to play Mario Kart on the TV for sure I want to see as much detail as I can you have I mean I'm going to play it when I'm on planes too but like night one when I get home with it it's going on the dock and I'm playing and I want a Pro Controller and then then it comes down to the whole thing of like if if I invite folks to the house I want them to have I need four controllers I want them to be able play you got to have the four controllers got to",
      "start": 1543.0
    },
    {
      "text": "then it comes down to the whole thing of like if if I invite folks to the house I want them to have I need four controllers I want them to be able play you got to have the four controllers got to have the bigger screen for the multiplayer experience but when Mario comes out yeah yeah you're going to play that like this I'm going to I think I'll play Mario Odyssey on TV not not primarily cuz I think my Switch is just my handheld that's why even Mr. Shifty I'm waiting more because I'm going to be on a plane next week I've been I've been meaning I have the the dock that we that we have here I've been meaning to take it home with me and I just I'm like why like my big my big criticism of course everyone's big criticism right now is that um it I need that battery pack what does the battery pack look like do we have pictures this is the thing also Nintendo also announced a new Joy-Con attachment that extends the battery life of the controllers the Joy-Con AA Battery Pack accessory includes an",
      "start": 1574.08
    },
    {
      "text": "look like do we have pictures this is the thing also Nintendo also announced a new Joy-Con attachment that extends the battery life of the controllers the Joy-Con AA Battery Pack accessory includes an attachment for up to two Joy-Con controllers is a pair of AA batteries powers each unit this isn't for the this isn't for the unit this is for the Joy-Cons that's terrible yeah it's dumb that's dumb yeah we need there needs to be a battery pack that attaches to the bottom of it that gives you another like three hours but like like two to three hours but I mean I hear you but has it really been that big of a problem for you yeah really oh dude when you're playing like have when I play Zelda for like two hours it's done I have it's like console's at zero you got to plug it in well why don't you plug it in somewhere I do plug it in but the problem is then it's like then I'm it's it's it comes with all these tiny little annoyances that I'm just like I could solve this problem right now by getting an",
      "start": 1607.56
    },
    {
      "text": "in somewhere I do plug it in but the problem is then it's like then I'm it's it's it comes with all these tiny little annoyances that I'm just like I could solve this problem right now by getting an extension cable because the cable's just long enough for me to sit like this on my couch and my back starts cramping up so I can't be comfortable and then so I'd have to get a 3-foot long extender got some battery packs and stuff I mean that are like there I have one in my bag it doesn't let me play in charge but I've heard rumors of other things coming to the way again I would complain about this as well if it had a 5-hour battery life cuz I play Zelda for 7 hours at a time so it's not that big of a deal um it's I thought you were mainly complaining about and planes with the outlets right there I've been so great planes the outlets right there great not I mean that's just what you're taking it doesn't matter again the same argument is if I fly into New York and doesn't have an outlet you're",
      "start": 1643.84
    },
    {
      "text": "I've been so great planes the outlets right there great not I mean that's just what you're taking it doesn't matter again the same argument is if I fly into New York and doesn't have an outlet you're **** doesn't matter if I have a 4-hour battery life when this thing is done but yeah something a little bit longer than two hours would be nice but I could also just get an extension cord and shut the hell up no Nick never shut the hell up but if they had if they had a case for it which I assume someone will make one day that plugs like your iPhone case that plugs in Kickstarter or whatever about it and doing all these different things but I think yeah cuz like imagine if the whole back of it like you know you know I know exactly what you're talking about exact exactly yeah exactly that'd be dope gives you like 10 hours I'd be like plus gives you a little ab workout a little forearm workout sure oh yeah I will say this though and this is the thing that I didn't expect to uh to be so enamored",
      "start": 1680.16
    },
    {
      "text": "gives you like 10 hours I'd be like plus gives you a little ab workout a little forearm workout sure oh yeah I will say this though and this is the thing that I didn't expect to uh to be so enamored with the the controls being this this wide apart I don't play a lot of handhelds like that the last one I did was was was the the DS that had the uh you know just the stylus yeah so holding it like this for long periods of time man your hands cramp up oh yeah I get forearm cramps like a **** I got over that a long time ago did you the Vita always cramps my hands up oh Christ hurts so bad because you're not used you have to hold it like this with the controller you don't realize how much I get the cramping like right my hands have been trained because of PSP back in the day when the PSP came and so then everything else is just going to step up I played so much PSP we need I need a support group a physical support group for for for newbies to the Switch hand rubs will you I don't need it's not",
      "start": 1710.68
    },
    {
      "text": "so then everything else is just going to step up I played so much PSP we need I need a support group a physical support group for for for newbies to the Switch hand rubs will you I don't need it's not the hands it's the for it's the forearms I thought those would be really strength you've done a lot of workouts with those I do a lot of dumbbell workouts with heavy weight staying on IGN.com we're clicking over to a Seth G. Macy story there he reports refunds may be coming soon to Xbox One Windows 10 if you ever regretted a digital game purchase on the Xbox store your only recourse has been to come to terms with the fact that you've thrown money down the tubes however Microsoft wants to give you the chance to get your money back quote we're always looking for new ways to improve the customer experience and regularly release new features into the Insider program to encourage and foster fan feedback which helps us test and refine features before they reach general availability earlier to today",
      "start": 1749.44
    },
    {
      "text": "and regularly release new features into the Insider program to encourage and foster fan feedback which helps us test and refine features before they reach general availability earlier to today we enabled self-serve refund pilot testing for digital content via Xbox and Windows Insider programs and this testing is presently limited to select Insider members Insiders can learn more about the criteria for claiming digital refunds via the Insider Hub beyond that we have nothing further to share users on the Microsoft subreddit first noticed the policy showing up for users currently enrolled in the Xbox Live preview program according to a message captured by one user if you play a game and decide you don't like it you have 14 days to get a refund as long as you didn't play more than 2 hours of it uh the refunds adhere to the Xbox Play Anywhere philosophy with the program extending to Windows 10 as well the policy is similar in spirit to the Xbox or I'm sorry to the Steam refund policy",
      "start": 1791.56
    },
    {
      "text": "of it uh the refunds adhere to the Xbox Play Anywhere philosophy with the program extending to Windows 10 as well the policy is similar in spirit to the Xbox or I'm sorry to the Steam refund policy introduced all the way back in June 2015 the same conditions apply for games purchased through the Steam client refunds must be requested within 14 days and the game can't have been played for more than two hours great **** move great **** move uh it's going to be interesting I'm sure I mean like I know people were up in arms when Steam did the same thing of like what about if I'm a small indie game right like yeah Gone Home you beat in an hour and a half like you know what I mean but I think that most people won't be dicks about it and I think it is a great way because it is hey we've done this you you you this has been the thing for a long time you throw your money at and you just take your shot right and it's interesting to see somebody jump on this and actually try to figure it",
      "start": 1832.52
    },
    {
      "text": "this you you you this has been the thing for a long time you throw your money at and you just take your shot right and it's interesting to see somebody jump on this and actually try to figure it out fascinating if Sony can ever do I know that was the first thing I saw some people tweeting about it well now Sony's turn I'm like still can't change your name so I wouldn't hold your breath on Sony like jumping right to the top on this one but that's a great move and it's it's continues to be what Xbox has been since Phil took over of like Gamers first game you know let's be right by the gamer and like it's interesting Sony's just been such a juggernaut lead with PlayStation 4 that Xbox can't catch up but they keep making moves like this and backwards compatibility and doing all these different things of saying hey we're trying and we're we want to be there for you it's an awesome move it's very pro-consumer it's good very cool shut up Nick sorry shut up Nick I'm sorry threw this one in",
      "start": 1873.52
    },
    {
      "text": "things of saying hey we're trying and we're we want to be there for you it's an awesome move it's very pro-consumer it's good very cool shut up Nick sorry shut up Nick I'm sorry threw this one in there it's not really news but it's kind of news uh Phil Spencer of course who I just mentioned head of Xbox over on the Xbox Wire put up this thing Project Scorpio the most powerful place to create and play is the internet running slow for you Kev um articles are taking forever for me to load today it loaded uh the like it's him talking about how great Scorpio is going to be obviously we you understand that we've all heard it but the final paragraph says I'm proud of the progress made with Project Scorpio and what it will mean for the creators who fuel the passion of gamers around the world on behalf of everyone at Team Xbox thank you for your continued passion support we're excited to unveil Project Scorpio and the amazing game experiences it powers at E3 this June uh that had always been",
      "start": 1906.04
    },
    {
      "text": "behalf of everyone at Team Xbox thank you for your continued passion support we're excited to unveil Project Scorpio and the amazing game experiences it powers at E3 this June uh that had always been the rumor of course that they're going to come out debut E3 we've had many a discussion on the Gamescast here in the Morning Show of what that's going to look like how that'll go of course they put out the specs recently now for sure in black and white again driving home the message you'll see it there and then man sexy Christ their stuff is sexy what's wrong oh so I don't check the dock for the stories you you add Nick then puts in so it was Xbox refunds Scorpio to E3 I had added those ones then this one Speaking of Scorpio United passenger stung by scorpion I didn't put that in really no on who added this no idea Colin is Colin checking on the dock I have no idea where this came from uh from TMZ.com we have a story someone put in here United Airlines another onboard hack by a scorpion",
      "start": 1946.4
    },
    {
      "text": "who added this no idea Colin is Colin checking on the dock I have no idea where this came from uh from TMZ.com we have a story someone put in here United Airlines another onboard hack by a scorpion another attack on United Airlines flight but this time it's a scorpion that got it revenge on a passenger is this you Andy Cortez you son of a **** Richard Bell was on a flight from Houston to Calgary Sunday when a scorpion allegedly fell from an overhead bin and stung him the flight crew contacted a doctor on the ground for medical advice uh United says his injuries were non-life-threatening and the medical personnel took care of Bell when he landed in Calgary did they did they run on and drag him off no probably not why the doctor wasn't there though the scorpion dragged him off the scorpion's like I'm taking you to the bathroom have my way I want to save you my client that's terrifying no there was one that's there was one remember this has happened before I'm sure it's happened a million times",
      "start": 1988.2
    },
    {
      "text": "I'm taking you to the bathroom have my way I want to save you my client that's terrifying no there was one that's there was one remember this has happened before I'm sure it's happened a million times honestly but there was one before where a guy got stung by a scorpion on like a Cleveland to wherever flight and it was because before that it was a flight from New Mexico to Cleveland and so must have crawled in somebody's bag or foot or whatever and then it just got in the airplane and the dude was chilling on what the **** that's how Snakes on a Plane started I just want you to know that it is I think I don't know I didn't watch it I did I watch it twice it's not how it started twice yeah they put the snakes in the plane to kill someone it was an assassination attempt and they didn't realize Samuel L. Jackson was going to be there how many snakes did they put on oh lots of snakes lots of snakes our final story comes from The Hollywood Reporter and I think it's right up Nick's alley Boris Kid",
      "start": 2030.32
    },
    {
      "text": "Jackson was going to be there, how many snakes did they put on? Oh, lots of snakes, lots of snakes. Our final story comes from The Hollywood Reporter, and I think it's right up Nick's alley. Borys Kit says Dolph Lundgren joins Jason Momoa in Aquaman exclusive. Dolph Lundgren, Lundgren, Lundgren, he's making his return to studio movies by diving deep into the world of comic book films. I hate the fact that entertainment news still tries to make all the puns, dude. You hate it because you don't get to make those puns anymore. I no, we stopped a long time ago. Did you? Yeah, the actor star whose credits range from Rocky IV, no, Rocky IV, to the recent Expendables movies, has joined Aquaman. Warner Brothers' big screen take on DC's underwater breathing superhero. Uh, James Wan, what is he playing as? Don't give me the I know, I know, it's all right. It's eyeing Mera. May start, we'll see if that happens. Mera is Aquaman. Nicole Kidman is Aquaman's mother. I missed that new, I missed that news. Patrick Wilson is Orm, a villain. Okay, okay, Orm.",
      "start": 2064.68
    },
    {
      "text": "know it's all right. It's eyeing Mera. May start, we'll see if that happens. Mera is Aquaman. Nicole Kidman is Aquaman's mother. I missed that new, I missed that news. Patrick Wilson is Orm, a villain. Okay, okay, Orm. William Dafoe is Aquaman's adviser. Wait, the ****? I was all right, let's read this entire thing now. Yeah, there's a lot of news in here that we don't know 'cause we don't care. We James Wan is directing, sure. A start in Australia, sure. Jason Momoa is starring as the title character in the film's call. She includes Amber Heard as Mera, Aquaman's royal love interest. Nicole Kidman as Aquaman's mother, and Patrick Wilson as Orm, a villain who appears, who happens to be Aquaman's half-brother. Willem Dafoe is playing Aquaman's adviser scientist, Dr. Vulko. Yahya Abdul-Mateen II, nailed it, is classic villain Black Manta. And Temuera Morrison is Aquaman's father. Lundgren will play King Nereus of the Aquatic Kingdom of Xebel. You're just making up words. Who claims Mera as his own and wants to kill Aquaman. Okay, this is",
      "start": 2109.76
    },
    {
      "text": "and Temuera Morrison is Aquaman's father. Lundgren will play King Nereus of the Aquatic Kingdom of Xebel. You're just making up words. Who claims Mera as his own and wants to kill Aquaman. Okay, this is awesome. Is it? Yeah, I love Dolph Lundgren. He's one of, he's, he's awesome. He's awesome. The more you know about him, the more, the more you will be impressed by that man. I've met him once. Yeah, I met him once at a Comic-Con party. I was talking to Jay Hall, Jace Hall, super player. They're friends. Oh yeah. And uh, we were like, I think it was me and Sean Finnegan were talking to him and Dolph Lundgren's like, \"Excuse me, do you mind if I talk to my friend? I don't mean to interrupt.\" And I was like, \"You're really tall.\" And did he walk up or was it just like, okay, I like the idea that you guys were in a circle having a conversation. He's like, \"Hey, **** off!\" Yeah, pretty much. \"Please get the **** out of here while I talk to.\" He's a really nice guy. Um, and you know, you gotta love him. You got, you got to respect him from, from Rocky, his career",
      "start": 2155.12
    },
    {
      "text": "hey, **** off! Yeah, pretty much. Please get the **** out of here while I talk to. He's a really nice guy. Um, and you know, you gotta love him. You got, you got to respect him from, from Rocky. His career has had some ups and downs, um, over the last few years. Was he ever like, I mean, he was in Rocky, sure, but was that, I mean, that's his big role. He did Rocky and then he did, I think he was supposed to have another breakout role. I think he did Showdown in Little Tokyo was a movie that he did with Brandon Lee. Okay, Bruce Lee's kid. Remember the um, cool movie? Uh, and it just, I just, it just never really clicked for him. I don't think he, he needed that breakout role that was going to, that was going to elevate him. But he was on par, he was on point for a while. He was never going to be a big deal. I mean, maybe he could be a big action movie star. Yeah, he was, well, he was going to be that, but I, but I feel like the time just sort of shifted, like, like changed. Like Rocky, if Rocky had happened maybe a couple years",
      "start": 2201.92
    },
    {
      "text": "he could be a big action movie star. Yeah, he was, well, he was going to be that, but I, but I feel like the time just sort of shifted, like, like changed. Like Rocky, if Rocky had happened maybe a couple years earlier, he could have been huge. But the problem is like, we went too quickly into the '90s and all those stars had a hard time transitioning over. Even, even, you know, Sylvester Stallone, guys like that. Granted, Sylvester Stallone coming out of the gates hot with one Demolition Man, you're like, \"Now all restaurants are Taco Bell.\" You got my attention. Um, but yeah, you got, yeah, you love him. Why not? Very nostalgic for me to see him. Here's my big in mainstream movie right now. You're a big movie guy, sure. How did Sting from WCW never get sued by The Crow people? He just ripped off The Crow thing, The Crow makeup, The Crow. I got a baseball bat, I'm in a trench coat. I don't know, that's a great question. I assume Sting came first. I no, that is not 100% not true. I watched The Sting documentary and they talk about him",
      "start": 2241.04
    },
    {
      "text": "Crow. I got a baseball bat, I'm in a trench coat. I don't know, that's a great question. I assume Sting came first. I no, that is not 100% not true. I watched The Sting documentary and they talk about him ripping off The Crow. Like that was like, \"Oh, do this and here we go.\" Just, but nobody ever did it. Um, how sad was it when Brandon Lee died? Remember, it was **** horrible. Brandon Lee was really talented. This is, this is thing that a lot of people don't remember. Like, like The Crow is a great movie and, and you can go back and watch, watch him. I think, I think it's Showdown in Little Tokyo. Kevin, look that up. Make sure I'm not speaking out of my ass. Showdown in Little Tokyo. I'm looking it. Um, he would have been a huge star. I think I honestly think so because I think he had the chops and I think he came from the right lineage and it's unfortunate. It sucks. It was heartbreaking. It was like that. There have been, there have been quite a few heartbreaking moments in my life when it comes to actors, uh, uh,",
      "start": 2281.6
    },
    {
      "text": "from the right lineage and it's unfortunate. It sucks. It was heartbreaking. It was like that. There have been, there have been quite a few heartbreaking moments in my life when it comes to actors, uh, uh, Chris Farley is another that I, that I really, that, that hit me hard for me. Phil Hartman, Phil Hartman was huge. There it is, Showdown in Little Tokyo. Man, now that just makes you want to watch it. Peanut043 says, \"People in the '90s didn't care about, care about copyright.\" Could be true. Uh, I think they, I think they did. Didn't he come back a couple years ago? Yeah, who's this with the same? Oh, Sting. Yeah, he's still dressing like The Crow. Well, I mean, I also don't know. Well, The Crow must have been put out by a major studio to be bothered him for years too. Who put out The Crow, Kev? Who put out The Crow? Looking into it. Oh, Dolph Lundgren's in the current season Arrow, is he? Yeah, cool. Arrow had turned to complete ****. Maybe I know. Well, all right. How weird was it when you were in Vancouver? You're like, \"Hey, we're in all of",
      "start": 2320.0
    },
    {
      "text": "it. Oh, Dolph Lundgren's in the current season Arrow, is he? Yeah, cool. Arrow had turned to complete ****. Maybe I know. Well, all right. How weird was it when you were in Vancouver? You're like, \"Hey, we're in all of these cities. I'm in Central City, you're in every city.\" Yeah, what do you want me to see? Who made this? Just who distributed The Crow? I, I want to say it's either Universal, Paramount, but I, I could be wrong. I have no **** idea. Sorry, I've never had to look that up. That's okay. I'll look it up right now. We can go to the next. Is there any more news stories? That was last story. Some people say in the animated Spider-Man movie, they've cast Miles Morales. There's some stuff out here that's breaking while we're playing, I guess. I don't, I'm trying to get through this thing. It could be companies, company credits. Shameik Moore has landed the role of Miles Morales. Go get him. Then also apparently Nintendo is discontinuing the NES Classic. Oh no. Nintendo. Yeah, Nintendo. This is Jose again. Jose, the Nick, the Nick Scarpino",
      "start": 2360.72
    },
    {
      "text": "Moore has landed the role of Miles Morales. Go get him. Then also apparently Nintendo is discontinuing the NES Classic. Oh no. Nintendo. Yeah, Nintendo. This is Jose again. Jose, the Nick, the Nick Scarpino of IGN. He has a quote here from Nintendo. \"Throughout April, Nintendo of America territories will receive their last shipments in the Nintendo Entertainment System NES Classic Edition systems for this year. We encourage anyone interested in obtaining this system to check with retail outlets regarding availability. We understand that it has been difficult for many consumers to find a system and for that we apologize. We have paid close attention to consumer feedback and we greatly appreciate the incredible level of consumer interest and support with this product.\" You're ruining a sweet sendoff to the NES Classic. Well, it wasn't here for that long. It was Miramax, by the way, that put out The Crow. Thank you for all that. So yeah, you're telling me the Weinstein just didn't want to go to war with? Probably not.",
      "start": 2406.6
    },
    {
      "text": "Classic. Well, it wasn't here for that long. It was Miramax, by the way, that put out The Crow. Thank you for all that. So yeah, you're telling me the Weinstein just didn't want to go to war with? Probably not. Go blow your nose, Andy Cortez. I need help. Zyrtec. I need a Zyrtec. Who's got a Zyrtec? Andy, I need you to chew up a Zyrtec and blow it in Nick's face and put it in my mouth like a baby bird. I'm like, baby bird Andy Cortez. Andy Cortez, mama bird me. Did we ever set up the Andy Cam? No. Okay, it was too much work. Okay. Do we have a barbecue cam still? Uh, it's not out there. Give me Zyrtec. Put it out. You don't have to. I was just, oh yeah, shout out, shout out to PanzerZerg. It says Dolph Lundgren was He-Man in Masters of the Universe Live Action. He was. If you want to watch arguably one of the most **** amazing documentaries I've ever seen in my entire life, I think it's still on Netflix. Watch Electric Boogaloo. I think it's called Electric, uh, it's all the movie, it's the story of Cannon Films and Cannon and how Cannon, Nick,",
      "start": 2461.88
    },
    {
      "text": "I've ever seen in my entire life. I think it's still on Netflix. Watch Electric Boogaloo. I think it's called Electric, uh, it's all the movie, it's the story of Cannon Films and Cannon and how Cannon, Nick, lean your head back. Let him put it in your mouth. Baby bird me. Don't do that, Andy. Are you watching Fast & Furious now? Uh, I'm making a graphic and then I'm going to start. Good. I want you to focus on the real work today. You got to see this. This will be your final Fast & Furious before you go see Fast & Furious tonight. Yeah, absolutely. Have you started yet? No. God damn it. I, yeah, yeah. All right, time runs out. You know what I mean? It's true. We're all working. It's called Electric Boogaloo: The Wild, Untold Story of Cannon Films. If you guys, if you were born in the '80s, this is, this will blow your mind because you remember all these movies. They did the He-Man movie, they did Superman IV. They somehow got the license to that, which is ridiculous. And they, they basically were like, we",
      "start": 2504.8
    },
    {
      "text": "will blow your mind because you remember all these movies. They did the He-Man movie, they did Superman IV. They somehow got the license to that, which is ridiculous. And they, they basically were like, we can't make this movie for what we, what the other movie was made for. We have to do it for a fraction of this. And then Chris was like, \"What the ****?\" Um, and they also made the He-Man movie. So they got all these amazing licenses before. And I think they did the original Spider-Man movie too, if you remember that. Remember that one where it's like really bad? Um, so it's really cool to watch this. They did all the American Ninja movies. They did, um, all these movies that you probably saw if you were born in the '80s. You saw them on like the basic cable channels that like a Sunday. They did these movies including the one that, uh, the titled movie, I'm sorry, the movie is titled after, which is Electric Boogaloo, that series which was breakdancing. Remember that? Electric Boogaloo. I did Breakin' and Electric Boogaloo.",
      "start": 2546.64
    },
    {
      "text": "the one that, uh, the titled movie, I'm sorry, the movie is titled after, which is Electric Boogaloo, that series which was breakdancing. Remember that? Electric Boogaloo. I did Breakin' and Electric Boogaloo. Yeah, is what it was called, which was the first time we ever saw Jean-Claude Van Damme on screen. Oh, is that where the dancing GIF comes from? He's in the background like in that Onie where he's like, he knows how to dance. Like everyone put that GIF, you can find that GIF for, we put it in the chat so everyone can enjoy it. Ladies and gentlemen, this is the Kinda Funny Morning Show each and every weekday here on Twitch.tv/KindaFunnyGames. We run you through the nerdy news you need to know about before jumping in the chat to answer your questions, comments, and concerns. But in between those two segments, I reach into the internet, grab a video game, toss it to one of you. How do you win? It's simple. There's four ways. Number one, if you're live right now with us on Twitch.tv/KindaFunnyGames and in the chat,",
      "start": 2583.24
    },
    {
      "text": "I reaching the internet, grab a video game, toss it to one of you. How do you win? It's simple. There's four ways. Number one, if you're live right now with us on Twitch.tv/KindaFunnyGames and in the chat, logged in, you are entered. You don't have to do anything, it's free. Congratulations. If you want three other chances, or you're watching later on YouTube.com/KindaFunny or listening on a podcast service of your choice, these are the ways you get to enter. You can support us on Twitch. You subscribe to us on Twitch. No, not that one. I had it like this. So this is number one. Oh, that's subscribe to us on Twitch. Okay, you subscribe to us on Twitch, you automatically entered to win all the things. You don't need to be here. Plus you get the Kinda Funny logo next to your name, cool emotes, private chat time with us. You get to play multiplayer games like people will on April 8th, the day after my birthday, for Mario Kart when I just lay waste to all these **** and just crush them. **** money driven before you",
      "start": 2623.52
    },
    {
      "text": "you get to play multiplayer games like people will on April 8th, the day after my birthday, for Mario Kart when I just lay waste to all these **** and just crush them. **** money driven before you get the show, unless we bake them in like I'm about to. Um, you can also enter by going to Patreon.com/KindaFunny or Patreon.com/KindaFunnyGames. You get entered for everything if you give us two bucks a month, plus then you get the bonus episode. If you give more, you're also entered. You get shows, you get bonuses, you get all the Early Access. We use it like a subscription program. It's pretty gosh darn cool. Remember, if you'd like to subscribe on Twitch, or if you just have Amazon Prime and you're not using Twitch at all, you can use Twitch Prime. Give us a free sub, give everybody a free sub. Congratulations. Today we're going to be giving away Forma.8 on the Xbox platform, but I think it's one of those Play Anywhere, so it goes both ways. But before I do that, I need to tell you the",
      "start": 2661.96
    },
    {
      "text": "congratulations. Today we're going to be giving away Forma.8 on the Xbox platform, but I think it's one of those Play Anywhere, so it goes both ways. But before I do that, I need to tell you the giveaway is brought to you by MVMT Watches. That's MVMT Watches. MVMT Watches was founded on the belief that style shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion by offering high quality, minimalist products at revolutionary prices. With over 1 million watches sold to customers in more than 160 countries around the world, bless you, Kevin, MVMT Watches has solidified itself as the world's fastest growing watch company. MVMT Watches started just $95. At a department store, you're looking at 400 to 500 bucks. MVMT figured out that by, bless you, Kevin, by selling online, they were able to cut out the middleman and retailer markup, providing the best possible price. Classic design, quality construction, stylized minimalism. Get 15% off today with",
      "start": 2705.16
    },
    {
      "text": "Kevin, by selling online, they were able to cut out the middleman and retailer markup, providing the best possible price. Classic design, quality construction, stylized minimalism. Get 15% off today with free shipping, free returns by going to MVMTWatches.com/KFMS. That is MVMTWatches.com/KFMS. MVMT Watches, see the **** future. That's not their tagline, but I thought I'd toss it in there because that'd be a cool one, right? 'Cause when you look at time, they don't like it when you just come up with watches. See the **** future. Remember when we started kept coming up with taglines for the other thing and everybody loved it? We kept giving us ads. So yeah, but they were like, \"Stop doing that.\" They at some point emailed us and they were like, \"Hey, guys.\" They did not email us. Well, maybe I made that up. He definitely made that up. What was it? What was it? Oh, it was, uh, you just keep making stuff up. I don't know. No, what was the one? Ah, **** it. Give the giveaway. Do the giveaway. The giveaway is going to a Patreon",
      "start": 2745.48
    },
    {
      "text": "made that up. What was it? What was it? Oh, it was, uh, you just keep making stuff up. I don't know. No, what was the one? Ah, **** it. Give the giveaway. Do the giveaway. The giveaway is going to a Patreon user over at Patreon.com/KindaFunny. And random number generator says it is Jake Vestal. Jake Vestal, you've won Forma.8 on the Xbox. Congratulations, Jake Vestal. Good for you. Couldn't get through that one, huh? No, 'cause the, 'cause the caffeine hit. I've switched over to the Trenta iced coffee. You never switched off of it. No, I've had, or this is the Trenta. This is 10 ounces more. All right, I'm telling you, that's the one you've ordered forever. I've always had the Venti. You're wrong. This is the bigger one. Stop. I remember when you went to, uh, wherever the **** it was you went and they were like, they didn't have that. And you were like, \"What?\" That is clearly a made-up story because you had no details in that. I want to say, remember you went that, what I want to say, it's a story you told me when you came back from",
      "start": 2786.64
    },
    {
      "text": "that and you were like, \"What?\" That is clearly a made-up story because you had no details in that. I want to say, remember you went that, what I want to say, it's a story you told me when you came back from England that you went in there to get a coffee and they didn't have the one you wanted. No, in England, they don't do drip coffee. They don't do iced coffee. Like in the UK, they all, they do espresso drinks. So you have to get an Americano. Do they have Starbucks there? They have Starbucks there. Oh, iced coffee. But if you go any, if you go anywhere else, it's just not, it's not common. You can't find like, if you ask for coffee, they give you an Americano. You're not getting a drip coffee. They don't brew that **** there. Okay. Think it was espresso, hot water, bam. And it's good. And it got me on Americanos. But I came back to the good old U.S. where we don't give a **** about quality, we like quantity, dog. This is what you get. This is three Venti iced coffees. In Japan, you can put three him this ****. I don't have",
      "start": 2832.44
    },
    {
      "text": "back to the good old U.S. where we don't give a **** about quality, we like quantity, dog. This is what you get. This is three Venti iced coffees. In Japan, you can put three him this ****. I don't have the math to back that up, but why do I have to back anything up? It's the internet. Every, let's jump into the tips. Over on the tips, the first one comes from Jay Silver who says, \"You all got me through some dark times when I had severe Crohn's disease. When my friends and family weren't there for me, you were. I love you all. Ignore the hate. I will work with you guys one day.\" We love you too. Don't worry about it. Glad you're feeling better. Feel better. The Filipino Mamba gave us a tip and said, \"April 13, April 13th birthday hype. Happy birthday to my fellow celebrants, Thomas Jefferson, Hunter Pence, and the love of Greg's life, St. Enjoy the BBQ, boys.\" We will. Thank you, Andy Cortez. Kevin, give me an. The ArasRookieK says, \"Nick, Nick, yes, your butchering of the Mulan song is an abomination and you should be stripped",
      "start": 2866.04
    },
    {
      "text": "of Greg's life, St. Enjoy the BBQ, boys.\" We will. Thank you, Andy Cortez. Kevin, give me an. The ArasRookieK says, \"Nick, Nick, yes, your butchering of the Mulan song is an abomination and you should be stripped of the title. I award you no points and we're all worse off for you. P.S. I love you.\" Here's the deal about that. It's not my song to butcher. Randy Newman, God rest his soul, not dead. I don't think he's a 78-year-old man. He and Joe Fonz are trying to put the work in, but the fact of the matter is, sometimes he misses the mark, right? He's got that great, he's got the great song from Toy Story, right? Where he's like, where it's like, right, exactly. I don't know what you guys are doing right now. You're ruining my, ruin for an apple to take a bite. Nope. Breathe on it first or wipes it on a blow takes. When day'll explain that to me when you're done making yourself laugh. Andy's with here. Andy, Andy, come give, stop being a chump. If you're going to come on, just come on for Christ's sake. Stop being a chump. Like about is",
      "start": 2915.12
    },
    {
      "text": "that to me when you're done making yourself laugh. Andy's with here. Andy, Andy, come give, stop being a chump. If you're going to come on, just come on for Christ's sake. Stop being a chump. Like about is he, he's good at the improv. He says, \"Yes.\" And you just **** text people all day. Show, I'm interacting with the people who are watching the show. Like someone I've never heard of, one Amy Gills, who was saying, \"Drip coffee is not a thing over here in Ireland.\" And I'm like, \"Well, that's why y'all got to **** ass backward 'cause you got to have this. You see how jacked up on caffeine I am right now?\" Every time in one of your stories 'cause you're on, you're killing right now. Thank. Every time though, I do see that point where you're swinging on the trapeze and you go to reach for the next one and you're not. And then I get the fingertips on it. You no, you know you got it 'cause I was, where you going to go with, uh, what's wrong with Ireland? Oh, where, I mean, come on, there's lots of stuff wrong with Ireland. Number one is",
      "start": 2981.44
    },
    {
      "text": "I get the fingertips on it. You no, you know you got it 'cause I was, where you going to go with, uh, what's wrong with Ireland? Oh, where, I mean, come on, there's lots of stuff wrong with Ireland. Number one is they keep Amy Gills there. She has to come over here. That's good. We should import. That's the problem. You got to import the good ****. KyloLauren says, \"Belated birthday tax, Nick. Have you and Tim ever noticed that Han's last name from Fast & Furious is Solo? Yeah, get it? Han Solo.\" Yes. #butthole. Yes, we've noticed that. RyDizzle says, \"I thought I'd share a video I made mixing the Growing Pains intro with the Trump family. Keep up the great work.\" No, sorry, that's not a fun. Keep up the great work, guys. You make my days a lot better. We, we, we'll keep up with the good work. I ask you to get better at work according to Kevin's assessment of your video. I know, I know, it was probably a lot of work. Sorry that he doesn't like. Josh Anderson says, \"Hey, guys, I thought of an idea. I haven't watched The Fast and",
      "start": 3023.92
    },
    {
      "text": "according to Kevin's assessment of your video. I know, I know, it was probably a lot of work. Sorry that he doesn't like. Josh Anderson says, \"Hey, guys, I thought of an idea. I haven't watched The Fast & Furious saga yet. And I tweeted at Tim if during Kinda Funny meet and greet for RTX Sydney 2018 that I watch any Fast & Furious in front of him, can make it happen?\" No, that sounds like a really bad idea. Doesn't sound enjoyable for anybody. You're just over there watching it. I'm going to go **** with the camera out there. This is what the shot is going to look like. Looks great. Go **** with it. Here's what you can do though. Leave it on. We can keep doing tips. This, um, here's what you got to do though. Not to get out there soon. Go watch Fast & Furious. Stop **** around. Although someone in the chat had a great idea and we **** it up already, which was Andy should watch Fast & Furious One and then Eight and try to explain like we quiz on how we got from one. That's really funny, but it's too",
      "start": 3068.16
    },
    {
      "text": "had a great idea and we **** it up already, which was Andy should watch Fast & Furious One and then Eight and try to explain like we quiz on how we got from one. That's really funny, but it's too late now. He's already watched all six of them. ReconAwesome gave us a nice tip and said, \"Sup, guys. Just got my first Platinum from Horizon. Now I'm on to Persona for the second one. Holy ****, you're crazy. Also, I just finished Death Note for the first time. Holy ****, what an ending. I don't know what to watch now. Le to, it's so good. Watch One-Punch Man and then Mob Psycho after that. I want to watch one. You should one. Also, uh, the electrician called right now. Yeah, they want to come by. Yes, please.\" Said, \"Yes, please.\" Yeah, sure. Uh, RockyRACN says, \"A friend of the family was, was in a horrible accident visiting Mexico. Please share the GoFundMe page so we can bring her back home. Anything will help.\" Uh, GoFundMe.com/Brenia-Home. Uh, enter the clue. Hey, guys. And I hope she's fine. It's just always sticky with",
      "start": 3103.28
    },
    {
      "text": "Mexico please share the GoFundMe page so we can bring her back home anything will help uh gofundme.com Briana Home uh enter the clue hey guys and I hope she's fine it's just always sticky with the GoFundMe things we can't spam we don't want to spam them because we don't want to do it over we talked about this before in shows we hope she we we hope everything turns out okay please enter the clue hey guys I often feel like our generation will never get something Monumental parenthesis like what Star Wars was the 1977 due to the amount of big screen adaptations and reboots what are your thoughts yep I disagree wholeheartedly you were getting something monumentally you just don't understand it because we're right in the middle of it this is an unprecedented era of of movies that's happening right now and you're seeing it all with the Marvel movies when in the history of movies have we ever seen like 30 films or I don't know 40 films that all build into each other like this",
      "start": 3146.6
    },
    {
      "text": "happening right now and you're seeing it all with the Marvel movies when in the history of movies have we ever seen like 30 films or I don't know 40 films that all build into each other like this is this is something that is historic you're seeing it right now you just don't understand it because we're all spoiled babies and go want something different like we see Captain America like ah and then two come like oh it's going make it better than that because it's one as good as Winter Soldier get f***ed I also think it's harder for us all to have shared I don't know I just got I think it's harder for us all have shared experiences like on on the level of Star Wars or MASH finale or whatever cuz we all can go do whatever we want now not you're not coming home and watching the same five channels as everybody else no you're not but you're also remember this like this is again we're getting a Star Wars we're getting the last three movies of the Star Wars trilogy you're living in that era I grew up",
      "start": 3190.92
    },
    {
      "text": "as everybody else no you're not but you're also remember this like this is again we're getting a Star Wars we're getting the last three movies of the Star Wars trilogy you're living in that era I grew up in the 80s I had Star Wars: The Empire Strikes Back and then Jedi and then a dry desert of nothing for like 20 years and then we got the Prequels the Prequels of what we got and now you're going up in this time you're like I don't understand we got nothing new we got I f***ing saw Han Solo I guess whatever spoilers f***ing they know my watching yeah I know um but yeah I think we're in a great era for film I think we're probably in the best that's a great point we we live in the best era of content but I guess it's also the same thing though that what you're right what you're saying is correct but also to his point I think in a way of there are all these Marvel movies and all these Star Wars movies and all these Harry Potter movies and all there's so many different fan bases with these rich awesome",
      "start": 3229.24
    },
    {
      "text": "to his point I think in a way of there are all these Marvel movies and all these Star Wars movies and all these Harry Potter movies and all there's so many different fan bases with these rich awesome movies that are happening that you don't have the Star Wars where it was like this standout yeah I I mean that is true right everything's when everything's at 100% it's hard to gauge what the best thing is because the the varying degree of of goodness is like right here right there's no latitude there was anymore um but I think that's that's just the way it's going to be from now on not to say though that I mean Episode Seven was yeah Episode Seven was just The Force Awakens was amazing it's a standout film that is a special experience that you're not going to get you don't get all the time sure so yeah if you want that in yourself just don't do what I do and watch everything just watch stuff that you only oh look at that that's crazy crazy look what he's doing he's playing with the ND filter",
      "start": 3270.04
    },
    {
      "text": "yeah if you want that in yourself just don't do what I do and watch everything just watch stuff that you only oh look at that that's crazy crazy look what he's doing he's playing with the ND filter there um yeah but I also think there's there's still room for those see the camera fall working on it you see Kevin like forget it's on he goes over there starts sniffing the barbecue he like turns the gas on gets high looks his ass puts like a like a monkey just sticks in there Jesus smells it way too bright Josh Anderson says hey guys I to use my $5 to quickly give a shout out to Ryan and Josh from the Pop Culturist YouTube channel who are awesome Kinda Funny Best Friends we met by being Kinda Funny Best Friends at RTX Sydney and shows how great Kinda Funny is smiley emoticon yes it does I'm dying Freemason 81 time to get up there yeah I see why not Freemason 81 says do you want to go out there and uh you want to keep doing tips and stuff outside or how do you want to play tonight",
      "start": 3310.36
    },
    {
      "text": "it does I'm dying Freemason 81 time to get up there yeah I see why not Freemason 81 says do you want to go out there and uh you want to keep doing tips and stuff outside or how do you want to play tonight you want to wear a jacket yeah I'll throw a jacket on get a Diet Coke and go out there with you cool why the f*** not Freemason 81 says happy birthday Jen hey guys like many you have inspired my friends and I to start a gaming Centric YouTube channel called Zero HP if it's okay we could use some sweet nasty love from the Best Friends Zero HP everybody spell out the that's how you do it um Average Josh says Gregory 'Bugs' Miller you know me as Doug Funny with the Braves hat I do know you for too long you've blown off my Mario Kart challenges on Twitter so I'm challenging you right here right now on the Kinda Funny Morning Show Jesus Christ April 8th I will accept all challenges from you little shits and I will f***ing destroy you each it's going to be like in Terminator when the f*** the",
      "start": 3351.68
    },
    {
      "text": "now on the Kinda Funny Morning Show Jesus Christ April 8th I will accept all challenges from you little shits and I will f***ing destroy you each it's going to be like in Terminator when the f*** the um well the Terminator but I can't think of when he was in the endoskeleton he steps down and crushes the skull that's what was going to be over and over again yeah T-100 yeah thank you I don't know I blinked on that I apologize it's hard they should it should just been T-1 but I guess they went through 100 other iterations before they got f***ed we just can't do this all right go get your stuff start getting ready get your jacket and your Diet Coke and all that jazz Uh Kevin I'm I'm I'm de-syncing I'm de-miking I'm de-cabling Josh Anderson says hi guys again sorry for a lot of tips by me you never apologize for that I have a fun T fun tip here from the Kinda Funny Best Friend Huggy Homer it is It is Well edited love you guys for the hard work you do I'll look into it in a second Kevin's looking",
      "start": 3399.16
    },
    {
      "text": "for that I have a fun T fun tip here from the Kinda Funny Best Friend Huggy Homer it is It is Well edited love you guys for the hard work you do I'll look into it in a second Kevin's looking into that in a second look Greg have I shown you this before hold on give me a second I'm looking I'm looking what Kevin's doing hold on we're almost there okay well I could have read a tip by now nice I didn't see that that's great good job good job uh Blissfully Ignorant says hey Nick starting a low carb diet have any advice recipes or websites to read up on also I picked up Snake's Pass or Snake Pass after watching you guys let's play keep up the great work see you at Kinda Funny Live 3 VIP Kinda Funny Live June 3rd KindaFunny.com/KFL3 come hang out Kevin I'm turning my wireless mic on right now so I sounds great Nick um yeah I have lots of advice for low carb diet um one of which is there's there's two three books that I've read one is the Atkins diet one's Paleo diet and one is the Primal",
      "start": 3441.0
    },
    {
      "text": "so I sounds great Nick um yeah I have lots of advice for low carb diet um one of which is there's there's two three books that I've read one is the Atkins diet one's Paleo diet and one is the Primal Blueprint by Mark Sisson um I actually really like the Paleo diet I found that the best result I have the best results on that I'm going to do a one-on-one with one Brian Altano in about two weeks so that'll be a Patreon exclusive for all of our supporters there eventually later on the road Patreon bonus episode yeah bonus episode um but yeah there there's it's you're about to embark on a very very cool thing for yourself so uh do it well be careful watch out for brain fog that's the one thing that I will say is your mic on yeah it's on is it mut might be hey it's Greg do you know this hi it's Greg and I'm talking to you talking to you talking to you so hopefully you got all that no they still hurt yeah that's fair didn't sound as nice as it would um now go get ready already bye um Josh Anderson",
      "start": 3484.2
    },
    {
      "text": "I'm talking to you talking to you talking to you so hopefully you got all that no they still hurt yeah that's fair didn't sound as nice as it would um now go get ready already bye um Josh Anderson Kevin has brought up your clip here I saw this yesterday we're not going to show it yeah there are reasons yeah good reason not bad uh Simon 661 what if I buy an Xbox One game disconnect my system from the internet beat the game and form it at my Xbox One before requesting a refund free game let's hope Microsoft can think of a way to stop this love from Toronto I'm sure they have I don't know I mean that's why it's in beta right now I'm sure they're testing it all out um C. Foster 5 Guys thanks for everything Andy I went from not knowing you to being a huge fan after your first Kinda Funny Morning Show appearance you're live tweeting of the Fast & Furious films that made my day sending you all my sweet nasty love Andy did you hear that I'm not sure what okay what would you like me to do",
      "start": 3530.12
    },
    {
      "text": "show appearance you're live tweeting of the Fast & Furious films that made my day sending you all my sweet nasty love Andy did you hear that I'm not sure what okay what would you like me to do about it uh can you tell me the battery status battery status on a is completely full completely full yep I we've used these like four five times now that's crazy good um keep talking Greg here still talking we'll tell Andy you love him EGS Mala 40 says long time watch firsttime streamer subbed with that Prime money but also happy to support uh it was a pleasure meeting you guys at Let's Play Live Chicago you don't turn your back on family you know we don't um Issa hey Kinda Funny crew should I shell out for a PS4 Pro even though I'm not going to get VR or does that make it not worth do you have a 4K TV that's really what makes it worth it yeah doesn't the VR get rid of the HDR sorry was this just over here huh it seems like a true champion would take better care of the belt that's wild",
      "start": 3577.2
    },
    {
      "text": "have a 4K TV that's really what makes it worth it yeah doesn't the VR get rid of the HDR sorry was this just over here huh it seems like a true champion would take better care of the belt that's wild someone must some f***ing snake must have come here and taken one oh still says my name on it still has my name on it Nick's just saying that he should give me a title shot rematch anytime soon yeah let me just show everyone what they're missing because they couldn't see it it's the face of a true champion right there oh right in the shot oh man uh Josh CV says the pineapple pizza the pineapple on pizza debate has reignited we think this fun clip video settles it big fan over here at Yum Feed we'll cook for you anytime uh there's no link here Yum Feed and also it has been reignited it'll pop off in the GameOverGreggy Show that posts tonight for patrons are you hitting Thursday night or is it going to be a Friday uh the video the audio I'm going to try my best but it's one of here's my",
      "start": 3629.68
    },
    {
      "text": "off in the GameOverGreggy Show that posts tonight for patrons are you hitting Thursday night or is it going to be a Friday uh the video the audio I'm going to try my best but it's one of here's my question and this is going to sound like let's have an honest discussion here this is not me being mean to you throwing it on you okay when you why don't you just for the MP3 just make it a little bit less quality because that's the hold up on the MP3 right is the fact that you have to send it to Patreon to have them post giant files right yeah that week you were gone and I had to edit it for some reason or whatever with my default settings it was way smaller than it than yours so it just went up no problem I mean that's the thing like we're we want to have a bar set a certain you know level and Patreon they say they're going to fix it soon to get it up here's Here's the the real issue sure is that Gamescast um we're not getting anything like we're not filming Gamescast till 3:00 o'clock",
      "start": 3678.68
    },
    {
      "text": "and Patreon they say they're going to fix it soon to get it up here's Here's the the real issue sure is that Gamescast um we're not getting anything like we're not filming Gamescast till 3:00 o'clock yeah yeah so you want everything going up and together yeah ideally okay I'm this it's an honest conversation just an open thing about Kinda Funny what I could do just is priori I getting the MP3 done and sent over and then maybe I mean yeah maybe the MP3s just go up earlier put them up at like 5 if we can for Gamescast yeah okay so as soon as see here's my thing I think it's less important to have Patreon Kinda Funny and Patreon Kinda Funny Games content go live at the same time as much as the two things on Kinda Funny and the two things on Kinda Funny Games go live at the same time you understand what I'm saying so like GoG's done and you can get it over just get GoG out well the other thing is we can put it up without the RSS feed cuz that's the hold up yeah but that's like",
      "start": 3717.4
    },
    {
      "text": "you understand what I'm saying so like GoG's done and you can get it over just get GoG out well the other thing is we can put it up without the RSS feed cuz that's the hold up yeah but that's like such a big thing the kids wanted no I totally agree and that that's why I know and don't get me wrong this isn't somebody's right somebody's wrong I'm just trying to talk I totally get that okay um I mean honestly what we should do until Patreon fixes the issue that they have yeah is we should just be like the episodes are going live Friday morning okay but I mean that kills me inside a little well I mean that's what we promise we always say that yeah I know but it's like we've we've done two years of hitting Thursday night yeah I know and I felt good about it I don't know something we have to figure out all right it's probably Ang it might be the electricians it also just might be the f***ing door final question or tip I'm sorry comes from Rookie Greg you need to be in the new 11",
      "start": 3773.76
    },
    {
      "text": "to figure out all right it's probably Ang it might be the electricians it also just might be the f***ing door final question or tip I'm sorry comes from Rookie Greg you need to be in the new 11 Little Rooster Series so Kojima can betray betray you Metal Gear Solid 3 The Boss style and you're forced to kill him dismay that would be amazing it would be uh I was inv there was brief talk of trying to get me into the latest 11 Little Roosters is that right but uh we're very busy and so I could not make it work because they needed a lot of time and they were trying to do in December and we had a million shows to do yeah it was brutal all right so sorry let do want do it yeah are you bringing your thing yeah let's get where we fit in we're done with tips now we can jump in the chat uh you can uh Whatchamacallit open up uh the old Muxy subscribers yeah I'll read sub as well when we go outside well I mean hopefully they're listening to us right now they can hear us but we don't know who",
      "start": 3814.2
    },
    {
      "text": "can uh Whatchamacallit open up uh the old Muxy subscribers yeah I'll read sub as well when we go outside well I mean hopefully they're listening to us right now they can hear us but we don't know who knows walked offset Kevin here I'm going to do this thing real quick oh God oh God hold on hold on I'm just going to try I'm live mic talk about things you don't want to say don't say anything bad Andy no no Andy that's the opposite nope there it is it's still Greg by the way I'm getting all my accoutrements well how can we not talk about Kinda Funny when Kinda Funny is all we got I'm getting food out here got some burgers got some wings oh I forgot that I got this cheese too yeah that's why I want some cheese I'm I'm going to mute my thing main character oh the guy from District 9 I can't remember his name f*** can't remember his name it's a it's a South African name I can't remember stand up add the third one um I got to go make sure that everything's going fine with the recording so I'll be right back okay",
      "start": 3856.88
    },
    {
      "text": "his name it's a it's a South African name I can't remember stand up add the third one um I got to go make sure that everything's going fine with the recording so I'll be right back okay also I don't know if you guys were the right people for this but like the little we have a little box down there the doorbell um it's us issu it just keeps randomly ringing this we had a technician are we off we're left what's wrong I'm just double checking it oh looks good you kill it you why'd you kill us look good I can't tell anything um bring me the wing sauce I guess I'm I'm going to need in a perfect world I'm going to get all these wings on the grill and then I'll need you to wash the bowl so I can toss wings in there with wing sauce this is a great comment yes these are all electricians guys say hi sorry we're live right now on the internet uh some of our some of our people watching said that you look like an undercover cop which is a cool yeah which is that's dope I'm I'm going toot I I",
      "start": 3915.68
    },
    {
      "text": "say hi sorry we're live right now on the internet uh some of our some of our people watching said that you look like an undercover cop which is a cool yeah which is that's dope I'm I'm going toot I I would say get that chair and get that little table like you usually give me the chair give me the table oh man it is Chill yeah right you're not used to that yet are you with your cool Austin swag I just stand here for a sec all right guys queue up your questions comments concerns in a couple seconds I will read subscribers as well uh remember if you haven't subscribed yet and you're an Amazon Prime member you get one free Twitch subscription we'd like that to be us but no biggie if you don't want to give it to someone give it to your Alfredo Diaz uh or anyone your Fran Mirabella anyone else that's out there you want to go support give it to friend did you open it for Christ's sake I know what's up bro Greg uh Sensor 89 says what's being grilled today I was late getting here what do we today",
      "start": 3977.32
    },
    {
      "text": "out there you want to go support give it to friend did you open it for Christ's sake I know what's up bro Greg uh Sensor 89 says what's being grilled today I was late getting here what do we today today we're doing uh wings and we're we're doing uh uh burgers burgers and wings now what's going on the wings right now there is the Joe Beef uh barbecue seasoning I like a lot not not the same burger rub I use and then uh we have buffalo sauce as well that we're going to get going the problem is I I I hadn't thought through till we were on the show already is the fact that we don't have any kind of pot to warm sauce up yeah we don't just pour the top pour on topold the wings will be I mean they'll bounce out probably but as you're grilling can you just sure but like then it's not the same yeah I can do that though I mean do we have a little pan like a little one of those saying no what what you like a baking sheet yeah baking sheet has all the burgers on it right now oh well once that gets off we",
      "start": 4026.68
    },
    {
      "text": "I can do that though I mean do we have a little pan like a little one of those saying no what what you like a baking sheet yeah baking sheet has all the burgers on it right now oh well once that gets off we can clean that put the sauce on there and just put it on the top it'll all you need to do is heat it up fine it's fine that's all I'm saying cool Greg let me get one of those slices of cheese dog huh let me get a slice of cheese you ever do that when you're a kid just eat like 40 slices of cheese what do you mean when I was a kid let's do it today let's all have one what a complete waste of packaging these things were right look at him let's watch let's see how long it takes him to park looks like he's going to do it real quick looks like he kind of told you to f*** right off he really did no he actually he went in there f***ing 45 ft away from the curb right now so cool great can I get the buffalo sauce from the fridge buffalo sauce buffalo sauce you have specific buffalo sauce I thought",
      "start": 4074.8
    },
    {
      "text": "he actually he went in there f***ing 45 ft away from the curb right now so cool great can I get the buffalo sauce from the fridge buffalo sauce buffalo sauce you have specific buffalo sauce I thought it was just Crystal oh no I think it's just Crystal yeah oh is it I don't know I I brought last time I was here I thought I brought uh Frank's Red Hot with me uh of Buffalo that's probably what I said Frank's Red Hot yeah you just eat cheese yeah I just like to eat some cheese do you want a Coke or something sure I do a Diet Coke Diet Coke pick with some ice do you want more ice or that it you can just put more ice in there yeah just give it up if I read your name you're a sub resub we very much appreciate that but first I got a log in Muxy I forgot cold today it's really cold today it's not bad but if we were drinking bourbon it'd be better sure well I mean we could do that we could do that there's really no stop us other than Andrea and an a Gamescast where is she would love it she's on her way",
      "start": 4115.68
    },
    {
      "text": "we were drinking bourbon it'd be better sure well I mean we could do that we could do that there's really no stop us other than Andrea and an a Gamescast where is she would love it she's on her way she's going way she texted she forgot the address so I had to give her the address For Those About to Rock thanks bud uh Caleb Chappelle has subscribed uh Brave Lander Tempest Strain Eye Leatherland11 Raging Plum EGS Mala 40 Jazzy Brandon Grizzy Smash My Cabe that's funny uh Chicken Chicken Pot Senpai New Flash says love the shirt Greg question on barbecue day how do you feel about hot links personally I get them every time when I get barbecue hot links yeah hot links hot links are great the bomb.com you got to do that come on now uh Recon Awesome has subscribed Jack Pattillo has subscribed Jack, dude, Jack I don't think it's real Jack Pattillo I got better things to do really yeah Jack's a badass uh SNES uh SNES Chummer 34 says Amazon Prime subs for months I need more Nick and Nick if Poss",
      "start": 4170.76
    },
    {
      "text": "Jack, dude, Jack I don't think it's real Jack Pattillo I got better things to do really yeah Jack's a badass uh SNES uh SNES Chummer 34 says Amazon Prime subs for months I need more Nick and Nick if Poss Nick being Nick if possible well that's all you're going to get these days turn the camera around and get it on Tim walking down the street over no we don't have that technology it's fair enough Amin3799 is subscribed Written On Water Coob Brian15 Hungover Baby says Nick love the shirt love you back thank you for that Alien5000 Emperor John117 Omega FL Flame 7 Joey Plays Games Average Josh says Greg do not turn down my Mario Kart challenge I didn't you f*** I said I'll fight you April 8th you f*** God you cowards he's going to take you downtown to Chinatown that's serious downtown to Chinatown guys going to take the tuna boat down to Skintown uh Nma Nmaer says I probably won't hear you read this as I'll be out watching Fast 8 can't wait have fun sing HGCM CJM0314 Rodri",
      "start": 4222.12
    },
    {
      "text": "to Chinatown guys going to take the tuna boat down to Skintown uh Nma Nmaer says I probably won't hear you read this as I'll be out watching Fast 8 can't wait have fun sing HGCM CJM0314 Rodri first Dylan Kumal Kumal H just gives a little heart VY11 says keep up the great work thank you for the entertainment all day after day FYI my username is from the Pearl Jam album since you tend to get hung up on it whenever you read it out loud did that help you at all no you know Bret Hart was in Bret Hart was in I didn't know that hi Tim cool thanks for that Andy yeah Rex Row 98 Four Carats The King Wanderer Spider When says sending the Amazon money your way want to send me a Switch question mark seriously though thanks thanks for making me laugh every day Simon 661 says what about what are Chad's views on P-plant fertilizers is that considered steroids for plants thanks for the best 11 months in a row great question Greg you want to answer that question I mean only Chad can we'll ask",
      "start": 4270.04
    },
    {
      "text": "Chad's views on P-plant fertilizers, is that considered steroids for plants? Thanks for the best 11 months in a row. Great question, Greg, you want to answer that question? I mean, only Chad can. We'll ask Chad later, we'll see what he says. Uh, Downtown Brown 00 has subscribed for 3 months. Menam Man 3, the real DJ Cutman. Spookiest C DJ Cut spookiest spooki as cun says, you guys put constant smiles on my face, make everything better. I have no criticisms, but if I could ask just one one thing, give me that Kenny Loggins. Nick, wow, hanging out with the boys. There you go, Nick ain't Chasing Sunsets. I don't have a guitar, but I learned that song. Nick, did you? Sweet. Going into a beautiful, lemme your mic and come with here for a second. Sure. Hey, Andy, here. Yell AOB, you put open on you. Here you go. Oh, thank you. Oh, thank you. I don't think, well, whatever. Okay, that should work fine. Robbie P.I. says, \"Annie Little Annie, is that you?\" Thank for that. Richard Dra says, \"Cheers from Santa Barbara, California.\" Cheers, Richard.",
      "start": 4332.08
    },
    {
      "text": "Oh, thank you. I don't think, well, whatever. Okay, that should work fine. Robbie P.I. says, \"Annie Little Annie, is that you?\" Thank for that. Richard Dra says, \"Cheers from Santa Barbara, California.\" Cheers, Richard. Bison Raer subscribed for months. Poseidon Son just subscribed. Thank you. Brian McBrien 13 said, \"Two years, love you guys. See you at KFL3. Happy birthday, Jen.\" Uh, 4 months of subscription, that's pretty nice. Thank you so much. B, oh my God, it's very chilly right here. Uh, HK Gil Thunder says, \"Thanks, guys. Been here longer, but let but let the Prime slip. Don't ever let the Prime slip.\" Nick, give me a butthole, please. Nick's not here. I'm very sorry. And you got to give your first butthole in. Can't zoom. There's no zoom, though. Get really just walk over, get really close to it. Okay, butthole. I felt right. Yep. Yeah, it felt good. When Nick's dead, you can do it. For now, okay, cool. CL Le Ban subscribed for 7 months. \"I love each and every one of you sexy, sexy beasts. All hell our Lord and savior Portillo's. Portillo's love.\"",
      "start": 4411.32
    },
    {
      "text": "It felt good. When Nick's dead, you can do it. For now, okay, cool. CL Le Ban subscribed for 7 months. \"I love each and every one of you sexy, sexy beasts. All hell our Lord and savior Portillo's. Portillo's love, Portillo's life, Portillo's all.\" I Agree 44 just sub. Thank you. X3 sub months. \"It's my month-on anniversary as a subscriber.\" Thank you. Melissa with a subscribe for months. \"Happy to be here for months. Here's to many more months. Love Nick, you're looking smoking today.\" I'm taking the place of Nick, so thanks. I appreciate that. Lakers Head 43 just subscribed. Uh, \"Unsubscribe because Ghost Spurs.\" Oh, you're a Warriors fan, though. Ghost Spurs teams. Wolf Borg 71 teams. Hoop in three-point and Duncan. You know what I'm saying? Those are the options. A Bear Called Mogar just subscribed. Uh, CPT Sausages subscribed for 13 months. Blissfully Ignorant subscribed for 11 months. \"11 months, time flies when you're mildly entertained. Thanks, I appreciate that. Just couldn't love you guys.\" Uh, Stinky P subscribed for 5 months.",
      "start": 4475.32
    },
    {
      "text": "For 13 months. Blissfully Ignorant subscribed for 11 months. \"11 months, time flies when you're mildly entertained. Thanks, I appreciate that. Just couldn't love you guys.\" Uh, Stinky P subscribed for 5 months. Jent on the recent Dudu podcast of Funhaus peeps show that they are no longer getting ad revenue on YouTube. I was curious if y'all are experiencing a similar issue. Cheers. P.S. Get at least in some shows, please. I'll be right. You run in the bank. Yeah, you just give him a check. Isn't that the same? They don't have go to the run B. Fair enough. You guys, um, do you know if there's been drop in ad revenue? Ask SpaceTime Dave, who, who by the way, subscribed for 8 months. That's a long more than two years. That is. Yeah, that's as long as you can, I think. Oh, yeah. Um, I don't I don't think we've had an issue with that, but I also haven't looked into it super hard, but like also we haven't been talking about it, so I can't imagine it's been an issue. Okay, interesting. Goo Do subscribes for months. N More MD just",
      "start": 4525.6
    },
    {
      "text": "That, but I also haven't looked into it super hard, but like also we haven't been talking about it, so I can't imagine it's been an issue. Okay, interesting. Goo Do subscribes for months. N More MD just subscribed. Thank you, guys. And finally, Blue Lagoon Gaming just subscribed. Awesome. That's it for the new subscribers. Oh, cool. The Who. Oh, Andy, hey, how are you doing? Good. How are you? Very good. Heads up, little gift basket. Oh, yeah, we're Twitch stream. Hi, Andy. Hi, I'm Andy. Nice to meet you. Nice to meet you. This is the other Greg. Um, yeah, don't you remember last year how I brought that stupid Batman. Andy, what's the plan with Kinda Funny gets shut down for sexual harassment charges brought forward by Kevin? Realize that's a good question. I don't know what's going to happen right there. Andrea Rene is here. Yeah, she is. Sure is here. She just walked by the camera. Awesome. Let's see. Ryan Santilli, my boy, **** love Ryan says, \"Between Andy and Kevin's hair, my sexual tension is at an all-time high. How are you?",
      "start": 4571.92
    },
    {
      "text": "Yeah, she is. Sure is here. She just walked by the camera. Awesome. Let's see. Ryan Santilli, my boy, **** love Ryan says, \"Between Andy and Kevin's hair, my sexual tension is at an all-time high. How are you feeling right now, Greg? You kind of feeling? I got hair. Okay, he's got hair. He's got hair.\" Andy hype. Everybody saying, \"Andy hype.\" Hell yeah. Andy, do you listen to Kendrick Lamar? I sure do. Um, uh, did DAMN. come out yet? The new Kendrick. I listen to Kendrick. I'm not with that greatest rapper of all time ****. I'm completely off. Oh, man. Okay. J Rock Nation. J. Cole is cool. I like J. Cole. Uh, I like how Greg meets Andy, you. Yeah, Greg's great. Andy, if you hire me as your personal assistant, I am open to providing sexual favors. Just wanted to let you know. Okay, sounds good. 307, I'll hit you up, dude. Uh, uh, also, I'm willing to sign an NDA with regard to sexual activities, unlike Kevin 'Snitch' Coello. Yeah, Kevin always like will spill the beans whenever you know there's a little hand job going on in the restrooms. It's really",
      "start": 4624.0
    },
    {
      "text": "Sign an NDA with regard to sexual activities, unlike Kevin 'Snitch' Coello. Yeah, Kevin always like will spill the beans whenever you know there's a little hand job going on in the restrooms. It's really it's really unfortunate. Andy, do you suck as good as Kirby on your shirt? Yeah, I do. I sure do. Boo the Destroyer, who I believe is Phil. I believe is Phil. Uh, K. Dot drops tomorrow. Thank you so much, Sansor 89. Appreciate that. Cool. Greg is about the rock. You are about Rock Nation. I am Rockefeller too. Amy Gill says, \"Group hug.\" It's only it's only Greg and I, but yeah, I'll give I'll give Greg a hug. Andy, do you follow any other sports? Uh, yeah, I'm a big uh, huge basketball fan, huge football fan. Kind of I was super into baseball when the Braves were good, and now they're not so great anymore, so it's kind of hard to keep up. Uh, but I still like we'll check the standings and uh, try to watch a game and throw on TV. Um, two of those, let's see. Um, the Editor Predator Andy Cortez, that's me. Love Master Cap Editor Predator.",
      "start": 4675.68
    },
    {
      "text": "Keep up. Uh, but I still like we'll check the standings and uh, try to watch a game and throw on TV. Um, two of those, let's see. Um, the Editor Predator Andy Cortez, that's me. Love Master Cap Editor Predator. Quantum Arbiter, \"Love you, Andy.\" That's Qoff Quinton Hoffman, my dude. Uh, God, it's very chilly outside. No, it's it's not bad. It's not bad, though. Hair's kind of going everywhere. World Frog 146, uh, says, \"Andy, are you hockey fan watching playoff hockey?\" I'm not a hockey fan, but I will sometimes watch playoff hockey in the same way that I will watch like the Olympics or if I I don't care about the sport, but I just want to watch it for the excitement. Like, oh, cool. Yeah. Andy, what's your favorite Fast & Furious movie so far and why is it Tokyo Drift? My favorite Fast & Furious movie so far is Six, the one I just watched last night. **** awesome. I was just the action scenes last all of the safe scenes when they dragging the safe Part Five. Great. That was really good when they cut back to that and they're like,",
      "start": 4726.08
    },
    {
      "text": "Watched last night. **** awesome. I was just the action scenes last all of the safe scenes when they dragging the safe Part Five. Great. That was really good when they cut back to that and they're like, \"This is what we actually did.\" Oh, yeah. I was like, \"I see you. I see you.\" Series. Great series. Andy, what are you using your hair to make it so silky smooth? Um, I use mousse, hairspray, uh, and thanks to my my dude Nick Scarpino, I use Rogaine every once in a while. Are you on Propecia yet? No, I don't. I'm not. Keep going. Okay, thank you. A great time. Are you worried about losing your hair? Yeah, I know. Yeah. Are you already losing your hair? Whatever that is, it's about two more cuts from going off the edge. Can you help the one? Oh, w. Oh my God, it's watch in the silver. Coke is sipping. Well, that's the Marvel Universe. Andy, who are you rooming with out in SF? I am living with Kevin's mom. How fun is that? I am on the bottom floor. They live on the top floor. It's fine. I have a roommate who I see once a day in the morning. He cooks",
      "start": 4778.72
    },
    {
      "text": "Are you rooming with out in SF? I am living with Kevin's mom. How fun is that? I am on the bottom floor. They live on the top floor. It's fine. I have a roommate who I see once a day in the morning. He cooks really smelly breakfast, and that's all I really know about it. Last night he was sneezing quite loudly, uh, and it scared me one time at like in the morning, uh, 'cause the walls are made out of **** papier-mâché. Hey, Andy, did you finish that dick gummy? I did not. I threw it away. Gross. It was not very tasty. Um, Kevin and Co. Greg needed a smoke break. Pole smoking break. Oh, got him, dude. **** that. Skin FL Male Power Fantasy says, \"Andy, can you freestyle rap?\" As a matter of fact, I can. We're out here in San Francisco. I'm here with Nick Scarpino. We're going to eat some barbecue, and I'm really looking cute. Yeah. Deal. Pickles on the table. No, you can't just point to shirt, pants, haircut, pants. That cheese. Yeah, can I have a piece that doesn't look like cheese at all? That looks like bread. Can I eat this? Yeah, okay.",
      "start": 4830.04
    },
    {
      "text": "Deal. Pickles on the table. No, you can't just point to shirt, pants, haircut, pants. That cheese. Yeah, can I have a piece that doesn't look like cheese at all? That looks like bread. Can I eat this? Yeah, okay. Sure. It's like the whole thing to gr on. Yeah, sure, I guess. Okay, okay. I'm toting some bread. Good question. You jumped in there. You. EGS Mala 40 says, \"Andy, are you bringing chairball to Kinda Funny?\" I really want to start. Brian Riley suggested that we start the Chairball Western Conference. We get Kinda Funny and Funhaus playing it, and then at RTX we have a big ass tournament, and it's just like **** intense chairball tournament. Uh, the Chairball video, uh, posted yesterday from on the RT YouTube. Cool. Really good. Think about the thing about us doing anything against Funhaus is it needs to be intellectual, 'cause I feel like we can beat phys. There's nothing physical about this. He just toss them all. There's no you don't got to be like strong or anything like that. They're really R. You're just count like",
      "start": 4880.28
    },
    {
      "text": "'Cause I feel like we can beat phys. There's nothing physical about this. He just toss them all. There's no you don't got to be like strong or anything like that. They're really R. You're just count like you're not really taking. Least is stronger than every one of us here. We most of us are. Oh, I did see you guys doing push-ups yesterday. I'm you guys for that. What is your, um, if I may interview you for sure, what is your fitness goal with these push-ups? Um, I just want to get jacked. I just want to get yolked. Uh, I want to be able to just beat up any random civilian. You be superhero. Yeah, or super. If you're beating up just random civilians for no reason. For no reason. Just for fun. **** them up. I'm looking for a hobby. You know, I'm kind of hobbies. Yeah, yeah, it's great. Mhm. Good for you. Andy, you like the new Mass Effect? I do. Yeah. Uh, I'm about maybe six or seven hours in. Haven't been playing it in the past few nights 'cause I've been watching Fast & Furious, but I like the uh, soundtrack for the new",
      "start": 4935.72
    },
    {
      "text": "New Mass Effect. I do. Yeah. Uh, I'm about maybe six or seven hours in. Haven't been playing it in the past few nights 'cause I've been watching Fast & Furious, but I like the uh, soundtrack for the new Mass Effect. It's great. It's great. They got Kenny Loggins back for it. They did. Was like hanging out with Mass Effect. Is that? I didn't know that. Playing that Mass Effect. I haven't heard that. I haven't got to that part yet. I guess chasing the Andromeda, which is the name of the ship, right? I can't remember. That's that's the other universe. That's the that's the galaxy. You're what's the name of the ship? It's not the Normandy. What? Tempest. Tempest. What the **** is the Tempest? Shakespeare. ****. It's a story. That's some Shakespeare **** right there. Asro DK says, \"Andy, you seem like a cool guy. Welcome to the family.\" Hey, man, it's all about family. All about family. It's so **** cold. And is it worth living in San Francisco so far? I mean, is the city treating you any good? Um, I've gotten a lot of questions about like, do",
      "start": 4976.8
    },
    {
      "text": "Man, it's all about family. All about family. It's so **** cold. And is it worth living in San Francisco so far? I mean, is the city treating you any good? Um, I've gotten a lot of questions about like, do you like Austin more? Do you like San Francisco more? I haven't really lived here long enough to say that. Also, I when I lived in Austin, it's not like I did a whole lot of ****. I just kind of stayed in my apartment and played video games on Art and ****. Um, so San Francisco to me so far is kind of like Austin with parking that's a little bit worse. Like barely worse, though. Oh, that's 'cause you live there. You live in the heart of the city. Yeah, I'm sure I would in the actual like city city proper. Terrible. I'm sure I would. You want a better jacket? We have an Amazon jacket. Nah, I'm good. I'm going to tough it out. I'm going to tough it out, boys. You like Shining Minutes, Greg? You want to wrap it up? Three more questions. Three more questions. Andy, what are your opinions on subpar sounding San Francisco",
      "start": 5022.6
    },
    {
      "text": "Tough it out. I'm going to tough it out, boys. You like Shining Minutes, Greg? You want to wrap it up? Three more questions. Three more questions. Andy, what are your opinions on subpar sounding San Francisco burritos? Um, I've I had one at Chipotle, but that I guess that's not San Francisco based. No, that's not a that's not a real S.F. chain. Uh, it was fine. Have we not gone to char? Yeah. Oh, man. Andy, when will we or will we ever get a 30-second review of San Francisco? Probably not. Uh, my next 30-second review is probably going to be The Fate of the Furious. Oh, yeah. I'm so excited to go see that tonight. If you would have asked me a week ago, are you excited to see F8? I would have never ever thought. Now, here's the deal. You were tweeting. You were live tweeting as you were watching one through Six, and one make turny res. So I know exactly what you're watching based on that one tweet. You're watching my favorite movie series of all time. It what how where does this rank up in your favorite movie series of all time?",
      "start": 5067.12
    },
    {
      "text": "Res. So I know exactly what you're watching based on that one tweet. You're watching my favorite movie series of all time. It what how where does this rank up in your favorite movie series of all time? In my favorite movie? Well, um, oh God, I don't know if I think there's too many low points for it to be my favorite movie series. Fair enough. Lots of low points. There there's always 2 Fast 2 Furious. Really? I was at the worst. I was in such a dark place in my life watching that movie. I wanted to just end it all. Yeah, I know you by that you mean, of course, I don't think we eat as much as we think we do. FSE. Sure, sure. Metaphorically, take out the Blu-ray and just that. It's it's it's good. I liked Part Four a lot more than I think a lot of people did. Five was really good, and Six was **** awesome. Six was awesome. Six was great. That's funny. Did you ever uh, you probably didn't see it because you probably didn't give a **** about it, but there was a a a a bunch of people calculated how long that",
      "start": 5118.0
    },
    {
      "text": "Six was awesome. Six was great. That's funny. Did you ever uh, you probably didn't see it because you probably didn't give a **** about it, but there was a a a a bunch of people calculated how long that runway would have had to be in that scene to last, and it was like I forget how many miles it was. It was it was like 0 miles long. That's the I had that same observation of like, \"Dude, when is that?\" See, it's like 15 minutes long. AB. They're going at like, you know, 60, 70 miles an hour. How long? How I'm sure it takes much. You have to be going much faster to get lift off, but whatever. Oh, here's a good question. When the Kinda Funny Theme Park finally opens, what are the biggest theme attractions and rides? Well, there's going to be chairball. Uh, uh, this going to be Andy's Guitar Center. Yeah, yeah, where it's actually just a Guitar Center, but it has it face on it. Yeah, we just we sell the same products. It's just all Fender-themed. And yeah, and most of the rides are going to be centered around us sitting around a",
      "start": 5171.72
    },
    {
      "text": "Just a Guitar Center, but it has it face on it. Yeah, we just we sell the same products. It's just all Fender-themed. And yeah, and most of the rides are going to be centered around us sitting around a desk. So you're going to sit around a desk, and it's not going to be a ride so much, but there be LED screens all around you, and that's going to pretty much be it. It's going to be really quiet, uh, and you'll just hear really loud mechanical keyboard like when I'm editing, uh, and then every once in a while we'll bust into \"Show Me That Smile\" on crying. Um, like that Harmony. Also, it'll just be really quiet, and you just hear this wo. Yeah. Are of Kevin **** hate him. Wor. Let's take one more question. Daddy's nipples are cold, man. My nipples are very cold. Um, D got some cold ass nipples. Let's see. Let's see some cold ass nipples. Andy, how large are your nips? Um, they're pretty standard size, I'd say, but they're but they're dark. I've got some pepperoni nipples. Oh, man, you're like, you got those dark Latin nipples.",
      "start": 5211.24
    },
    {
      "text": "Cold ass nipples. Andy, how large are your nips? Um, they're pretty standard size, I'd say, but they're but they're dark. I've got some pepperoni nipples. Oh, man, you're like, you got those dark Latin nipples. Yeah, I sure do. Those dark Latin nipples. Absolutely. All right, well, I guess that wraps it up, guys. Great. Thank you for joining us. Thank you so much. Great. You want to think I'll take us out? I don't know. You don't do bread and cheese. What's your problem? You don't like beans. What's your problem? **** you. **** beans are great. Exactly. Ladies and gentlemen, thank you so much for joining us here on the Kinda Funny Morning Show for the day of April 13th, or as it shall always be known, The Fate of the Furious Day. Jen's birthday. Jen's birthday. 100's birthday. Give him all some sweet nasty love. Thank you so much for sticking around with us for this shenanigan ass uh, barbecue, which I'm sure now that there's pouring light on here that the sun have shifted is just a **** blaring white screen for you guys. Um,",
      "start": 5255.72
    },
    {
      "text": "For sticking around with us for this shenanigan ass uh, barbecue, which I'm sure now that there's pouring light on here that the sun have shifted is just a **** blaring white screen for you guys. Um, we will of course be back tomorrow, but look for our Impressions tonight. Kinda Funny Reacts to The Fate of the Furious spoilers. I'm going to **** love it 'cause I'm going to have a giant Diet Coke, big ass popcorn, maybe some Butterfingers, maybe sh, maybe some Red Vines. Hey, you know what? It's time to eat, guys, 'cause you know what? We hungry. We hungry. Yeah, we hungry. We'll see you tomorrow at 11:00 AM Pacific Time. Kevin, cut the feed. Cut the feed.",
      "start": 5295.36
    }
  ]
}
