{
    "id": 2564,
    "video_id": "LaonkPGtVp4",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Broken Games - Kinda Funny Gamescast Ep. 116 (Pt. 2)",
    "description": "Why are so many broken games being shipped?\n\nThanks to Blue Apron for sponsoring this episode. Go to BlueApron.com/gamecast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1492518600,
    "duration": 1401,
    "transcript_chunks": [
        {
            "text": "What's up guys this episode of Kinda Funny Gamescast is brought to you by Blue Apron. Not all ingredients are created equal. Fresh, high quality ingredients make a real difference, so it's important to know where your food comes from. Choose from a variety of new recipes each week or let Blue Apron's culinary team surprise you. A couple upcoming meals include spinach and fresh mozzarella pizza with olives, bell peppers, and Rota Salada, and sweet and sour salmon with bok choy, carrot, and ginger fried rice. Does that sound good, Kev? Yep, yes it does. Check out this week's menu, get your first three meals free with free shipping by going to BlueApron.com/Gamecast. So that's Gamecast without the S in the middle of it. It feels and tastes good to create incredible home-cooked meals with Blue Apron, so don't wait. Right now, do it. BlueApron.com/Gamecast. Blue Apron, it's a better way to cook. Let's move to the next topic. Okay, this one comes from NeoGAF. Oh good, uh, it's a topic from a user named Soldier.",
            "start": 0.08
        },
        {
            "text": "Wait, right now, do it. BlueApron.com/Gamecast. Blue Apron, it's a better way to cook. Let's move to the next topic. Okay, this one comes from NeoGAF. Oh good, uh, it's a topic from a user named Soldier. Soldier, I thought it was interesting and I thought that he had a lot of good stuff in his original post, so I'm going to, I'm going to read the whole post. It's a little long, but I think it's, that's a good conversation. Should I call Indian again? Uh, no. Okay, that **** is dangerous. What is, what's the worst thing could happen? I don't know. You get marked permanently. One, that was a different one. I'm getting like weird, um, yeah, you're ****. I didn't hurt. That doesn't work that way. All right, between No Man's Sky, between No Man's Sky, Street Fighter V, Final Fantasy XV, Mass Effect: Andromeda, and now maybe Persona 5 of all things, this is now officially a trend that Publishers are taking with their games. I now think it's the single worst thing to happen in video games. The thread, I don't have the title, damn it.",
            "start": 42.16
        },
        {
            "text": "5 of all things, this is now officially a trend that Publishers are taking with their games. I now think it's the single worst thing to happen in video games. The thread, I don't have the title, damn it. I **** that up. Sure, there's the glass half full approach to this. Most Publishers who release a shoddy, rushed out game would typically say, '**** you, got mine,' and not bother making any fixes. There's also the strange Middle Ground example with Final Fantasy XV, which does not entirely get a pass as it does have some narrative and gameplay flaws that should have been ironed out before release, but still alleging to address those flaws as well as add completely new and previously unplanned additions to the game such as off-road driving and additional playable characters. But the most egregious examples are just far too terrible for this trend to continue. Mass Effect: Andromeda is a technical embarrassment that plenty of people on staff must have noticed, but was it was still shipped out anyway.",
            "start": 99.36
        },
        {
            "text": "Are just far too terrible for this trend to continue. Mass Effect: Andromeda is a technical embarrassment that plenty of people on staff must have noticed, but was it was still shipped out anyway because **** the fans, get it out there and later tell them how much we care. Having a detailed roadmap of patches doesn't fill me with any relief. It just tells me that the game isn't worth playing at all until months after the patches, or even then. I personally lost all interest in never touching the game. There was a brief moment where the argument could be made about quote Early Access console games, and it began and ended with Street Fighter V. If Capcom had released that game with the functioning arcade mode, the Fight Money store, and an almost uh, complete online Network, then this could have been the beginning of a unique trend with games getting out earlier so long as the core features were available. Instead, the Makoto walk animation levels of slow updates have decimated, made their",
            "start": 134.68
        },
        {
            "text": "Have been the beginning of a unique trend with games getting out earlier so long as the core features were available. Instead, the Makoto walk animation levels of slow updates have decimated, made their sales and possibly any long-term interest. There's something to be said when every single fighting game released afterward had come out with three times Street Fighter's roster and with far quicker updates. And now this might happen with Persona 5. The circumstances may not be as shitty, the translation isn't bad, the streaming situation can be easily reversed, but it didn't have to happen. It was the one game I'm certain lots of people were hoping would release issue free. My launch experience has been soured as a result, and if Atlus is going to come up with their own patches roadmap to polish the localization, I might just put the game down then and there. It's extremely rare for me to go back and replay a game 30 plus hours, and Persona games tend to go towards the hundreds. What's the point of playing a",
            "start": 171.48
        },
        {
            "text": "I might just put the game down then and there. It's extremely rare for me to go back and replay a game 30 plus hours, and Persona games tend to go towards the hundreds. What's the point of playing a product that I know is officially inferior, especially when I can still put time toward the games that come out **** free? Imagine Nintendo pulled the **** with Zelda or any of their other releases. I'm at a point where just reading the PR formatted letters that state how these fixes are the result of the fans and strong community feedback makes me want to puke. We aren't your **** fans, we're your customers. If you really cared, you wouldn't have done a shoddy to begin with. Again, not every instance of this is a No Man's Sky ****, but it's becoming more and more a common trend. I, I for one, am sick of it. Blah blah blah. There, your, why are we throw? I don't understand his Persona attack. I'm trying to find the news story. He's upset because of the, the translation people don't like, and yeah, the fact",
            "start": 205.72
        },
        {
            "text": "Of it. Blah blah blah. There, your, why are we throw? I don't understand his Persona attack. I'm trying to find the news story. He's upset because of the, the translation people don't like, and yeah, the fact that the streaming thing, the streaming thing is like, that's not a, that's not a patch thing, that's not a patch thing. And then the, the translation **** I've seen, I mean, few people complain about. I've played four, no, no, maybe five hours of the game now, and I like, I'm not there like, 'Oh my God, it sounds like Persona.' What are you talking about? I don't think we need to like split hairs whether Persona should be included in that list. I think his, the topic that he's really hitting home about is games that are shipped that are not fully functioning, right? And then we have these giant day one patches or worse, you know, it takes a couple of weeks or even months before the game is, you know, operational. Sure, I've been citing you a lot recently, 'cause when the letter from Aaryn popped up about Mass Effect and how",
            "start": 239.76
        },
        {
            "text": "You know, it takes a couple of weeks or even months before the game is, you know, operational. Sure, I've been citing you a lot recently, 'cause when the letter from Aaryn popped up about Mass Effect and how, 'we're going to fix it, we're listening to you,' all this stuff, and you were like, 'I'm like 75 hours in.' Like, I, I, I'm happy you're taking care of your fans, but what about me? Yeah, it's, it's frustrating that now I'm seeing all these people come back and say, 'Oh, the animations are so much better,' and I'm like, 'Well, I'm done now.' I don't think I'm going to go back to Mass Effect until DLC is released, and then maybe I'll, you know, try to start another playthrough. It's, it's certainly frustrating, and I understand, and I think he really hits home there when he says, 'We're not your fans, we're your customers.' And that's something I think to note, the difference between the developers who create the game and the Publishers who ship the game. Not very many companies are one and the same. Like, very few people who",
            "start": 284.12
        },
        {
            "text": "That's something I think to note, the difference between the developers who create the game and the Publishers who ship the game. Not very many companies are one and the same. Like, very few people who actually make the code and do the art and write the narratives are actually like getting the discs in a store. They're not the same people generally. And what we're seeing is a lot of these giant publishing companies who have responsibilities to their fiscal year, to their shareholders, to their public stock price, say, 'Hey, this game is in this fiscal year. If it doesn't ship in this fiscal year, it's going to screw up our financial.' And so we have to get it out the door no matter what the cost. And that's really where we've seen a shift in a lot of games coming out half-baked because the publisher will say, 'Well, we can just put a patch in, it'll be fine.' And the audience saying, 'But hey, you're asking us to pay $60 for a game that you know isn't ready to go.' Yeah, and instead of thinking about your",
            "start": 323.92
        },
        {
            "text": "Will say, 'Well, we can just put a patch in, it'll be fine.' And the audience saying, 'But hey, you're asking us to pay $60 for a game that you know isn't ready to go.' Yeah, and instead of thinking about your customers who are paying for this, you're thinking about your shareholders and your stock price and your profits above all else. And they should be going hand in hand because you can't make profits without customers. Sure, and that's why I get why a lot of gamers are really upset. Like, they have a right to be upset. I mean, I was mad about all of the stuff that was wrong with Mass Effect because I love that team. But I know that BioWare wouldn't choose to send out a game that they knew was broken. That 100% was EA's decision to keep the ship date as it was. You know, if that, if that team could have gotten an extra six months, you don't think they would have taken it? Of course they would have. But, you know, that wasn't their choice. I mean, see, that's an interesting perspective too, but when you take to the",
            "start": 367.6
        },
        {
            "text": "An extra six months, you don't think they would have taken it? Of course they would have. But, you know, that wasn't their choice. I mean, see, that's an interesting perspective too, but when you take to the side of Square, like with Final Fantasy XV, like I'm sure they would have took another five years if they had the opportunity to. At some point, you do need to kind of just commit, get out. And I'm sure there's so much business that we don't know, but it's like if that, if March 1st or whatever was the date, like you got to get it done by then. And if you don't get it done by then, that then you're going to ship a bad game, and that's going to have the uh, repercussions that it, that it does in terms of the feedback. But it's, it's a weird balance between EA. At the end of the day, they're not being **** for saying, 'Hey, you got to get it done by now.' Like, that's the commitment that is. They're funding a game to be made in a certain way, in a certain time frame. And absolutely, and it's like you can only be like",
            "start": 410.16
        },
        {
            "text": "Hey, you got to get it done by now. Like, that's the commitment that is. They're funding a game to be made in a certain way, in a certain time frame. And absolutely, and it's like you can only be like, 'Oh, we need a little bit longer, we need a little bit longer.' I mean, we're at a point now with games where it, there's no longer the holiday season. The entire year is full. So, 'Oh, we need two more months,' all of a sudden dramatically changes the game plan of EA as a whole. So it's like you got to get the game out when you say you're going to get the game out. But this all comes back to the fact that like, I mean, as consumers and players and gamers or whatever, I mainly as consumers, we're not blame free in this. This is what we always talk about, right? Don't pre-order a game, don't do this. Like my leading into Mass Effect, right? I kept saying, 'There's no way it's launching in Spring. Something's wrong with that game. Why haven't we seen it? Why aren't we see?' And then they kept, they doubled down, and I was like, 'Well,'",
            "start": 449.68
        },
        {
            "text": "Effect, right? I kept saying, 'There's no way it's launching in Spring. Something's wrong with that game. Why haven't we seen it? Why aren't we see?' And then they kept, they doubled down, and I was like, 'Well, ****, they must have something awesome on and they just don't want to spoil it.' And then they put out, and it's like, 'Oh.' And this then reflects back to everybody who was so upset about the Mass Effect 3 ending. And it was like, 'Okay, if you're really upset about Mass Effect 3's ending, don't buy the next Mass Effect.' And if you, but then you run out and you buy the next Mass Effect and you're mad after the, like, we, you can, we as a culture continue to send the wrong message, right? And like, this is the problem, and I, I'm part of it. Like, right, like last night I tweeted out like, 'I decided to take a break from Persona. I'm gonna play Walking Dead Season 3, Episode Three.' Finally, I got the first trophy for the first section of the, the game, and then the next one crashed twice on me back to back. And it's like, 'I wish'",
            "start": 485.32
        },
        {
            "text": "I'm gonna play Walking Dead Season 3, Episode Three. Finally, I got the first trophy for the first section of the, the game, and then the next one crashed twice on me back to back. And it's like, 'I wish I could say, man, that never happened.' That, that was what happened in Episode 5 of Batman, and I was like, 'That's weird, why is that happening?' And then of course, beyond that, I've had pretty good luck in terms of crashes with Telltale Games. But there's problems with, you see people's saves getting eaten and this not working. Do, and it's that thing of if people like me continue to give them passes on everything, you can't be mad then when it's **** up. Absolutely. I think the, the vote with your wallet kind of mindset, it gets complicated because the people like you need to keep supporting it because you, you're supporting things you like about it. You're not paying because of the stuff you don't like, right? I think for me, an example would be Nintendo games and the Wii U. I completely supported the Wii U and I",
            "start": 519.04
        },
        {
            "text": "Supporting things you like about it. You're not paying because of the stuff you don't like, right? I think for me, an example would be Nintendo games and the Wii U. I completely supported the Wii U and I bought all the first party Nintendo games that I love because I love those things. Yeah, but it's like I feel like I am rewarding bad behavior because I didn't like the console, you know, and I didn't like the direction they were going with that stuff. However, I, I do want to support them putting out super polished, high quality games, so I'm going to support those titles in that way, right? Sure. And I mean, and that this is the problem, right? Is that we feel like if we fire, if you fire off an angry tweet, you said all you need to say. But in reality, all these things have no teeth. Everyone on the internet, including, you know, I mean like, 'Hey, I'm mad about this, blah blah,' and then you forget, you get, you get back on the hype train. Well, that's I'm saying with Mass Effect, for example, like the people that were mad",
            "start": 558.8
        },
        {
            "text": "You know, I mean like, 'Hey, I'm mad about this, blah blah,' and then you forget, you get, you get back on the hype train. Well, that's I'm saying with Mass Effect, for example, like the people that were mad about Mass Effect 3's ending, is the answer for them to not support Mass Effect: Andromeda because supposedly you'd be supporting them doing something different. But I mean, the argument would be like, 'Okay, instead of jumping in full force, I'll wait and see what people think, reviewers.' That, that is absolutely fair. Like, yeah, the don't pre-order, go for that. Sure. I, I mean, I'm kind of split on the don't pre-order thing 'cause I pre-order a lot of games 'cause in my mind, if I'm going to be buying the game anyway, I might as well get the free bonus item that is being offered in the pre-order. And just to be clear, I pre-order stuff all the time. I pre-order Persona Collector's Edition. Like, I'm not, I'm not saying that's the answer necessarily, but if, sorry, go ahead. No, no, no, that, that, that's okay. I, I think the problem when",
            "start": 597.0
        },
        {
            "text": "We talk about, um, you know, games that are broken is that the, the standard seems to be different for every developer. I mean, I remember when Mass Effect first released, a lot of people on the internet were talking about, 'Well, why does Bethesda get a pass with some of the janky animations that they have in Fallout, in Skyrim, or Skyrim, in Fallout 4, when, you know, Mass Effect: Andromeda is getting so much hate?' Sure. It's like, 'Why do, why do certain developers, you know, get to have glitches and bugs in their open world games and other developers don't?' Like, the standard is so much higher. Sure. You know, like, 'Why does Ubisoft get crucified for having bugs in their open world game but other, other developers don't?' And I think that that's something that we as a community maybe need to reconcile and go",
            "start": 633.36
        },
        {
            "text": "Like, 'Why does Ubisoft get crucified for having bugs in their open world game but other, other developers don't?' And I think that that's something that we as a community maybe need to reconcile and go like, 'Yeah, why do we hold some developers to a higher standard and not others?' I mean, maybe we should, you know, recognize as fans of video games that making games is really hard. And the one of the women who was targeted by some online hate, um, who used to work at BioWare, who was falsely accused of being in charge of the animation, you made all the faces. She was like, 'You guys really don't understand the complexity of what they're doing.' And even I, I, you know, saw some stuff online about some people from other, you know, studios who do animating saying like, 'You can't compare what Naughty Dog does and know with what Mass Effect is doing with Andromeda. They're two completely different types of games, and the production schedules are wildly different, and they have different types of artists.' And so it's, it's",
            "start": 674.88
        },
        {
            "text": "Really frustrating when people jump on a soapbox, you know, and criticize the thing that we love without going, 'Hey, like that's somebody's work. Somebody put years of their life into that work, and you have no idea what it takes to make that.' But you're so quick to say, 'Oh, you **** suck. I'm never giving you money again.' Like, that's of, that makes me sad. History has shown you will give them money again. You're just mad in the moment at what's happening here and all these different things. And that's why it's such a weird, complex situation of taking developers who are artists and pairing them with Publishers who are businesses and being like, 'Okay, this is how.' I mean, how can you get something like that delivered on time? How can you not have it turn into Final Fantasy, into The Last Guardian, and have it just go",
            "start": 724.84
        },
        {
            "text": "Who are businesses and being like, 'Okay, this is how.' I mean, how can you get something like that delivered on time? How can you not have it turn into Final Fantasy, into The Last Guardian, and have it just go on and on and on? 'Cause yeah, of course you'd want as much time as possible, you know. I mean, for everything, if there's not a deadline. I mean, the, out of all these games, the one that affected me the most was Final Fantasy XV, which I waited for that game for years and I wanted it so bad. And I love the game, I still do, despite all of its flaws, of which there are many. Uh, but playing through it, it was disheartening to know, 'Oh, there, there's a roadmap for patches already, and they're going to fix Chapter 13.' And like, there's all these problems with the game that there, they're going to fix. But if you want that experience, you got to wait. It's like, 'I don't want to wait. I wait.' That's the problem. And so for me, I played through it, and I'm like, 'I took it for what it was.' And I think that the, the big question of",
            "start": 765.64
        },
        {
            "text": "This whole thing is, what would we rather the devs and Publishers being like, 'It is what it is, we're out, we're on to the next thing, we'll fix it then maybe,' or being like, 'We're going to, we're going to do patches, we're going to do fixes so that when people in a couple months play it, it will be good for them.' What's the right answer? And is it a case-by-case thing? I mean, it's, it's a tough question to answer because a lot of games now are building in extended roadmaps for post-launch content to try to see how much they can extend their audience to keep playing the game after release. You know, we see a lot of developers now talk about like monthly DLC updates and, and free uh, content that they do, community events like logging this weekend and you can play this mission, you know, just this weekend.",
            "start": 802.48
        },
        {
            "text": "A lot of developers now talk about like monthly DLC updates and, and free uh, content that they do, community events like logging this weekend and you can play this mission, you know, just this weekend, stuff like that. And I think we're going to only see more of that instead of less. So I don't think a future where like post-launch patches don't exist is ever going to happen. Yeah, you're constantly, I mean, that's just where we are, right? And that's the thing where people like, 'Oh, there's a day one.' Of course there's a day one patch. It's 2017 now. This happens all the time. When is it not going to have that? It's the fact of we are dealing with this, and this sounds really shitty, but this weird archaic system of like, 'All right, cool, the game's gone gold a month, three weeks before it's going to go live.' And it's like, 'Well, no, they're going to continue working on that, especially if they know they can make things better and they can try to fix animations, they can try to do whatever they want to do.' Like that",
            "start": 847.32
        },
        {
            "text": "Like, 'Well, no, they're going to continue working on that, especially if they know they can make things better and they can try to fix animations, they can try to do whatever they want to do.' Like that is the solution. But it then comes down to us as consumers being like, 'We understand the social contract we have here, right?' In terms of like, 'All right, cool.' Like, I, yeah, like for me, I'm the opposite with Mass Effect where I was like, 'I can't, oh, Mass Effect: Andromeda, I can't wait.' Got it. I was like, 'And I then jump back into Persona and I was just gone.' You know what I mean? And I, but I'm, I still, I am one of those people like, 'I'm going to get back to that game. I want to get back to Andromeda.' So when I'm hearing about this patch, I'm like, 'Oh, great, cool, that's great for me. I'll just let you, I'll let them all build up and then I'll worry about it when I'm, it's time for me to worry about it.' Yeah, I mean, the, the other kind of way to go about fixing the problem is like what Ubisoft's doing with Assassin's Creed.",
            "start": 891.2
        },
        {
            "text": "Up and then I'll worry about it when I'm, it's time for me to worry about it. Yeah, I mean, the, the other kind of way to go about fixing the problem is like what Ubisoft's doing with Assassin's Creed. Like when Unity came out like two years ago now, and that was such, was it three years? 'Cause they took last year off, right? There wasn't Assassin's Creed Syndicate was the last one. Yeah, but you're talking about Unity, the first next-gen one. Yeah, the first one that like **** up everything with no face and stuff. Yeah, yeah, yeah. So like, 'cause I remember we did a topic, um, on the show about broken games a couple years ago, but it was a very different conversation 'cause like then there wasn't the patch roadmap. It was just, 'Oh, it's just broken and you're just going to **** deal with it. Maybe you'll hear about it, maybe you won't.' Yeah, but the solution they have is to take the time off and then come back with the next game and fix it. And we'll see. I was going to say, 'But you know that it's going to launch with something.'",
            "start": 922.92
        },
        {
            "text": "Won't. Yeah, but the solution they have is to take the time off and then come back with the next game and fix it. And we'll see. I was going to say, 'But you know that it's going to launch with something.' I mean like, that's the problem is like, you can't, there's no way to test video games like this and not have someone run into something. I mean, think Fallout: New Vegas is obviously the most famous example from in my history that I can think of. I'm just like, 'Who would have thought if you wore that hat that you bought from that guy and you had this other thing equipped and you went on the Strip, it would crash the **** game?' You know what I mean? Like, you have to have like, we are, we're all testing a game every time we play, play a game because, 'Well, what the **** going on? How do, is that really a thing? Do we know how to fix that? How do you fix that?' And that's the problem of like, as games get more and more complex and get, there's more and more into them, and there's, you know, it takes years to make.",
            "start": 956.8
        },
        {
            "text": "do we know how to fix that how do you fix that and that's the problem of like as games get more and more complex and get there's more and more into them and there's you know it takes years to make these things because there's so many moving parts to them that when you put it all together and you get it out there and then it's like I mean like another example personal example right is the fact of like both PS3 and PS4 right when I have the full friends list which not many people did back in the day or now now on PS4 the same way like every Housemarque game **** broke and like it was the point of like people from PlayStation coming to the office at IGN to look at my system be like what the **** and then it was finally we figured out that it was trying to Ping the servers and that was crashing the game and the same thing happened with uh Tetris Ultimate from **** SoMa and Ubisoft right where it was like all right cool and it went on it was just like chug chug chug and they couldn't",
            "start": 991.12
        },
        {
            "text": "the game and the same thing happened with uh Tetris Ultimate from **** SoMa and Ubisoft right where it was like all right cool and it went on it was just like chug chug chug and they couldn't replicate that back home because there's no way for them on a test server to say all right cool populate the auto friends list and ping for information da I totally agree with you I think the community though is angry at the idea of having to pay $60 to be a beta test so I get why people are mad but I'm in your camp that like there's no way that the development teams can you know project the problems that are going to happen with the game on a global scale when millions of players are finally you know have the code in their hands and they're testing it out and so it's it's it's a tough situation I would I would say like if you truly are so angry about you know that games have flaws then maybe you should look at spending your money elsewhere if it makes you really mad because I think we all Love",
            "start": 1027.4
        },
        {
            "text": "I would say like if you truly are so angry about you know that games have flaws then maybe you should look at spending your money elsewhere if it makes you really mad because I think we all Love video games because they're fun right I think that's the that's the biggest thing is I'm I don't think consumers are wrong for feeling beta testers right and I understand where that anger would come from my counterargument would just be that though that is where the market is now it no longer is hey I bought this **** NES cart and I'm going to go home and pop it in and that's the game yeah if something's wrong with it if there's a game breaking bug which there were **** me that's the end of it you know what I mean like it is to the point now where it's like those I remember I was you know go back to WWF No Mercy that I bought four times and returned over and over remember game to GameStop because there was a bug in that that erased all your progress and that was finally when I was like",
            "start": 1067.2
        },
        {
            "text": "back to WWF No Mercy that I bought four times and returned over and over remember game to GameStop because there was a bug in that that erased all your progress and that was finally when I was like **** my NES I'm done but that was how it was there was no way for **** THQ and Jakks Pacific to go out and fix it yeah I mean we're at a place now where not even Nintendo games are done you know every every even like Breath of the Wild comes out day one patch patch two days later there's been another patch it's like that it's crazy but again that game is different though because it was polished from the beginning and it didn't have the game breaking and that's the whole thing with like and correct me if I'm wrong cuz you're you know more about Final Fantasy than I do but with the most recent Final Fantasy where it was like Oh Chapter 13 or whatever is is really hard and people hate it we can fix that yeah otherwise it would have just been yeah Chapter 13 sucks and that would have been a",
            "start": 1105.84
        },
        {
            "text": "Final Fantasy where it was like Oh Chapter 13 or whatever is is really hard and people hate it we can fix that yeah otherwise it would have just been yeah Chapter 13 sucks and that would have been a line in the review and on message boards and that just I don't know like that the Final Fantasy XV thing is that and Street Fighter V are the ones that are most interesting to me because with Mass Effect it's just clear it's just like they just it wasn't finished you know there was problems with it and they just Shi it with Street Fighter it feels like that was the best intentions like they were trying to give us what we want like the thing that we talked about so much of games as a platform like what's the point of putting out several iterations of Street Fighter V which we knew they were going to do let's just put out one and keep adding on it and have it be free updates forever after that and that that's what you get right um or pay things for more substantial pieces but then they put",
            "start": 1138.32
        },
        {
            "text": "to do let's just put out one and keep adding on it and have it be free updates forever after that and that that's what you get right um or pay things for more substantial pieces but then they put it out to bear and it's like well you you **** up from the beginning there like now other people aren't going to try doing that like we're not going to see the Gran Turismo platform or Madden platform or whatever because like there's a against it then on the side of Final Fantasy it's like I just wanted to play through the game and it sucks that like did really nobody know that people don't like Chapter 13 like that's something that like later you're going to be like we we're going to fix that thing that nobody in the **** reviews liked it's like you knew that that that wasn't good there's no way that like that was just something that everybody was like it's snuck up on it's okay and like the I think that if they stood by it and were like no that's in the game then that'be one thing but",
            "start": 1175.12
        },
        {
            "text": "way that like that was just something that everybody was like it's snuck up on it's okay and like the I think that if they stood by it and were like no that's in the game then that' be one thing but the fact that they did go back and change it and they did acknowledge that it's a problem I think that's a problem is that when they're going to change something that's like part of the story of the game like come on like that's a different experience for people having different animations or like fixing the animations or whatever that's one thing like the shading and stuff like that's just adding to the experience but when you're changing the actual experience I'm not so okay with that I don't know I am I wish we could do that in more types of media yeah I mean I same thing I go back to you know um it doesn't matter we just had Marvel Heroes in right for Marvel Heroes Omega and talking to Anthony about that and being someone who's there from beta on and I I'll never forget when David",
            "start": 1216.48
        },
        {
            "text": "know um it doesn't matter we just had Marvel Heroes in right for Marvel Heroes Omega and talking to Anthony about that and being someone who's there from beta on and I I'll never forget when David Brevik came in for his second up at noon after the game had launched a year later when they were relaunching it as Marvel Heroes 2015 right and and I was like oh yeah great and he's like yeah and and he's like well I'm like why then rename he's like well it wasn't that good when we launched like we launched and we've learned a lot and it wasn't where we wanted it to be and so we've worked and now that's why we've put this new thing on cuz this is a brand new game and now it's really great and like I find that refreshing when a developer is like yeah we **** up like you know what I mean we could just wash it and lay everybody off or whatever but we're going to get in there we're going to do it and like yeah I I I'm not versed enough in what was wrong with Chapter 13 what was it it was I mean",
            "start": 1254.16
        },
        {
            "text": "just wash it and lay everybody off or whatever but we're going to get in there we're going to do it and like yeah I I I'm not versed enough in what was wrong with Chapter 13 what was it it was I mean it was just it was tonally really odd and different all of a sudden turned into like a weird horror thing okay and it was super long and like a maze that just it there was nothing good about it gotcha you know whereas the rest of the game there might have be a problem here or there but it was still good totally stood out IGN was not the problem but now you play 45 years old why H out with you let me cook food for you yeah I oh my **** god that was your warning shot you pissed me off again it's right in the face I mean my thing is like I'm talking about in a Final Fantasy game you should not be changing a core piece of the the story sure like that is the one thing that you should nail Metal Gear Solid V is another example where was the end of that game why did it not have an end like",
            "start": 1288.6
        },
        {
            "text": "be changing a core piece of the the story sure like that is the one thing that you should nail Metal Gear Solid V is another example where was the end of that game why did it not have an end like and that's the thing if they were to come back and fix it now it's like no too little too late on that like I would have wanted to wait to get that game as it should be instead you gave me a masterpiece of a game lacking an ending lacking entire like third it felt like that sucks you know but then then again it's like all right well then is the answer just not doing it I don't know but the real answer is finish the game sure before you put it out sure I hear you yeah it's complicated it is complicated I just want a Metal Gear Solid V to have a good story that's all I want why did you I mean you got it fine well you didn't but you had a lot of fun you played the game was great the gameplay was amazing why didn't matter story **** if you want a great story go play Peace Walker best Metal Gear",
            "start": 1327.16
        },
        {
            "text": "it fine well you didn't but you had a lot of fun you played the game was great the gameplay was amazing why didn't matter story **** if you want a great story go play Peace Walker best Metal Gear of all time hit you right in the watch I was trying to get a stick you did hope you enjoy that episode you can click here to subscribe to Kinda Funny Games you can click there to subscribe to Kinda Funny you can click here to support us on Patreon you can click there for some stuff that I'm not sure but I'm sure that Kevin's going to put something fun there what if you click here",
            "start": 1370.12
        }
    ]
}