{
    "id": 2586,
    "video_id": "R02Eb4DEuNg",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello",
        "Cool Greg",
        "Geneviève St-Onge"
    ],
    "title": "Greg's Birthday Bash! - Kinda Funny Morning Show 04.27.2017",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1493328517,
    "duration": 6324,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to the Kinda Funny Morning Show for Thursday April 7th, 2017. Yes, I'm one of your hosts, Greg Miller, alongside the pure one, Tim Gettys, making his valiant return to the show. Feels like it's been a long time. I guess it has been a long time gone. Big days I miss and come out. Please rub down Tim's chest. Give me that rub down, please. Minority Report, please get the rub down here. They're doing it. Thank you. Happy birthday to you too. Thank you. It's I know it's hard. Appreciate that. I it is my birthday. Oh, ****. It is 34 years young, my friend. What the ****? How did you time the horn with your celebration? **** bus just killed someone outside. How do you feel? Do you feel rejuvenated? A new year, a new you? No, I feel good, but I think we're just on a good roll. Life rolling, having a good rolling, rolling, rolling, roll, rolling. Come on. Yeah, yeah. Now breathe in. Now breathe out. Hands my hands down my way or the highway. God, remember how Andy, do you remember how great that album",
            "start": 1.54
        },
        {
            "text": "a good rolling, rolling, rolling, roll, rolling. Come on. Yeah, yeah. Now breathe in. Now breathe out. Hands my hands down my way or the highway. God, remember how Andy, do you remember how great that album was? Ab **** me, God. Limp Bizkit. Come on. Limp Bizkit. What a great name. There was a Z in there. Break your **** face tonight. I told you then still blew my **** mind when Colin Moriarty pointed out that that was a Ben Stiller reference. I told you when he starts that song and he yells out Ben Stiller's name like, what, what, what, what, what, what? I like it. How long have you been gone from Morning Show? Do just two days. Oh, okay. Yeah. Internet Explorers on Monday, right? Yeah, yeah. Okay, yeah. So that was the thing. I'm happy to be back though. We got a fancy new TV to look at in front of us. Very impressed with this TV. Of course, during the play for Mario Kart, I told Kevin this would not stand any longer. Big Kev dog got out there and got a **** kick ass TV that Tim hates, but I like it's not that I hate it's",
            "start": 62.0
        },
        {
            "text": "TV. Of course, during the play for Mario Kart, I told Kevin this would not stand any longer. Big Kev dog got out there and got a **** kick ass TV that Tim hates, but I like it's not that I hate it's just the you hate it, dude. No, you're allowed to say you hate it. Samsung killed it last year and then they come through with the **** new units. They're not as good. They **** it all up. God damn it, Samsung. We thought we liked you. We thought we were friends. You did this to us, Samsung, you pieces of ****. We had The High Ground. You betrayed us. Yeah, yeah. And the Jedi, the order, the order. Yeah, remember that Star Wars references to reveal themselves to the no, none, hone. You're breaking my heart. I wonder if there is, I'm sure there is, but I wonder if there's any like good W fanfiction out there, like sex fan fiction. I feel like I would know about it at this point. Everybody knows, everybody knows that I love a good erotic story, lit erotica. Andy, you know this. You've written a few for me and with and and with uh",
            "start": 118.68
        },
        {
            "text": "fiction. I feel like I would know about it at this point. Everybody knows, everybody knows that I love a good erotic story, lit erotica. Andy, you know this. You've written a few for me and with and and with uh Andy with uh W's nose. I definitely feel like there's some interesting, there's some interesting places you take that. There's some interesting places to take that. You know, this upsets me. Which part? The fanfiction thing. Okay, there's not enough fanfiction about us. There's just not. Cause here's the thing. I remember back in the day, we did get one though. I think there's been, there's been a couple. All of us ****. There's been a couple. But I back of the day with Rooster Teeth, yeah, even when they were a small operation, I was reading a whole bunch of **** that would pop up that like, who the **** wrote this? But I was impressed. Okay, **** got nasty. Sure. This is a challenge to everyone out there. I think it's just that our audience skews a little too old for it. Yeah, me too. You know what I mean? We're",
            "start": 169.12
        },
        {
            "text": "this, but I was impressed. Okay, **** got nasty. Sure. This is a challenge to everyone out there. I think it's just that our audience skews a little too old for it. Yeah, me too. You know what I mean? We're we're the more refined YouTube channel. You go and you cut your teeth on these Achievement Hunters. Hey guys, farts. I'm man. I punched a desk. I'm British. And then you're like, you know what? I grew out of it. Let's go see somebody who only does a Let's Play once every six months. Yeah, we're good at it though. They're quality. They're quality. Well, yeah, no, well, I like, I like today. I here's what I did. We went and did what you do, Greg. We went and did that Star Trek VR Let's Play. Dynamite content. Fun stuff. Really cool stuff, right? Yeah, we're excited to get it out there. But I've seen a big old Kev dog here tinkering with it. And so today during the AMA video for that'll go up Saturday, uh, answering your Patreon questions, but it's live for everybody on KindaFunny.com. I asked Kev, what's the deal with that? Are you",
            "start": 209.84
        },
        {
            "text": "with it. And so today during the AMA video for that'll go up Saturday, uh, answering your Patreon questions, but it's live for everybody on KindaFunny.com. I asked Kev, what's the deal with that? Are you just setting it up for Andy? And he said, yes, that's the that I'm setting it up for Andy so he can just jump in. I'm like, great. And he goes, but I don't know when he's going to have to time to edit it cause 's working on all the Kinda Funny Live shirts right now. W looking radical. But then I noticed that for the last 10 minutes, Andy's been playing Mario Kart sitting right there and it doesn't seem like he's working. **** ****. Prove it, dude. Say like, I don't know. You can't prove it. I'm editing on the go. What's the timeline button on the Switch? Yeah, that you're using Adobe Premiere on Switch. One of the few apps it does have. Yeah, if you didn't know, ladies and gentlemen, this is the Kinda Funny Morning Show each and every weekday here on Twitch.tv/KindaFunnyGames. We come to you with the nerdy news",
            "start": 253.28
        },
        {
            "text": "apps it does have. Yeah, if you didn't know, ladies and gentlemen, this is the Kinda Funny Morning Show each and every weekday here on Twitch.tv/KindaFunnyGames. We come to you with the nerdy news you need to know about before jumping into the chat to answer your questions, comments, and concerns. In between those two segments, I reach on internet, grab a video game, toss it to one of you. How do you win? It's simple. Be in the chat, be a subscriber, support us on Patreon. There's a whole bunch of caveats and things we add up. Caveat asides. We'll get to that. We'll get to that later on. I I don't need to beat you down with it right now yet. Uh, Tim, yeah, before we get to the first story, we're going to go see Guardians tonight. We **** are Vol. 2. That's exciting. I'm upset about it though because I wish that we can get big Nick dog to go too so we can do a reacts. Yep. Yeah, I know. And here's here's what I got. I finally got an email back. Don't read it. I finally got an email back. Kevin, are we try to mic",
            "start": 295.96
        },
        {
            "text": "that we can get big Nick dog to go too so we can do a reacts. Yep. Yeah, I know. And here's here's what I got. I finally got an email back. Don't read it. I finally got an email back. Kevin, are we try to mic Kevin, you hear me? Uh, what got the email back? Because I had reached out. I said, we have Tim and I are going to go see Guardians of the Galaxy. I just hit him back. I said, when you have a headcount, let me know cause there's a a bunch of other Kinda Funny guys here. And then I put the actual number three, not that many, who'd love to come see it too. I just got an email back three minutes ago. Kev, you want me to read it to you? Yep. Hi, Greg. Sorry for the delay. I just got a final headcount and we are at capacity. No. Who if we have attrition, I will let you know. I hold on. Let me say, sounds great. Thanks for thinking of us. The hell is attrition? What does nutrition have to do with this? What does nutrition have to do with this? Uh, yeah, I mean, you know, whatever. Same thing happened with Age of Ultron, whatever. Yeah, but I",
            "start": 337.48
        },
        {
            "text": "of us. The hell is attrition? What does nutrition have to do with this? What does nutrition have to do with this? Uh, yeah, I mean, you know, whatever. Same thing happened with Age of Ultron, whatever. Yeah, but I just want to get our review out to the people. But that's the thing. People in the chat right now, I'm looking there right now. I'm seeing a username, Mubot. He seems to be here a lot. Um, what I want to know is how do you come down on the Kinda Funny Reacts? Would you want to react super early or would you want it just when on Friday or Thursday night, Friday morning? The thing with the super early is it gets to both audiences. I feel like it gets lost though, but not if we just repromed it. Bad at that though. But I mean, we have Joey now. She's pretty **** awesome at tweet. Pretty good. Joey's good. Yeah, Joey's good. So I don't know. Okay. I Don't Know Jack 14 is going to watch it tonight to maybe we could just bring that person over here and they react to maybe maybe we could do that. I was thinking, I don't",
            "start": 378.32
        },
        {
            "text": "good. So I don't know. Okay. I Don't Know Jack 14 is going to watch it tonight to maybe we could just bring that person over here and they react to maybe maybe we could do that. I was thinking, I don't want to do this because this gets too complicated. I don't want to put out two reviews, but we could do a spoiler-free review tonight and the spoiler review later. We did that with Star Wars. Star Wars. Well, Kinda Star Wars. We recorded them back to back and put out two separate videos. They performed really well. But I don't know. I don't think we need to do that necessarily if Guardians. Yeah, I don't know what to do. Yeah, I don't know. But it's going to be fun. I'm excited. Yeah, it's happening. I'm actually not that excited if I'm being honest. God damn it. Don't go. Let me go instead. I want to watch. But it's just like, are you guys racing each other or you just doing different things in your Switches right now? I have to create a me. What this is the life that we live, Greg. Uh, in more important news, new",
            "start": 424.88
        },
        {
            "text": "it's just like, are you guys racing each other or you just doing different things in your Switches right now? I have to create a me. What this is the life that we live, Greg. Uh, in more important news, new episode of the Kinda Funny Animated Series is now live on YouTube.com/KindaFunny. Some would say it's the best episode yet. Some would include me. Thank you. I'm glad. Damn it. It's about time somebody did this. I've been saying for a long time. They've been keeping me on the bench a long time. I've been riding the bench. You guys off having your porn adventures with Barbara Dunkelman. By the time I got to come out here and do something, have an episode myself. **** yeah. This is the Greg Miller episode. This is the Greg Miller episode. That one that everybody's been saying. Some people are saying there's a lot of me in it. There is a lot of you. There is a lot of Kevin in this episode. That's a surprise. There's some cameos in this episode that we don't want to spoil because it's a great moment. So make sure, well, you can just",
            "start": 464.6
        },
        {
            "text": "is a lot of you. There is a lot of Kevin in this episode. That's a surprise. There's some cameos in this episode that we don't want to spoil because it's a great moment. So make sure, well, you can just go ahead of it like just that's like right in the middle. That's right in the middle of it. Are you that stupid? How are you that dumb? I ha it's literally the intro of the show of me watching you guys. I hate you guys. You're the worst. What was that? You're the worst. What was that? I was like, I I almost and I was like, oh no. And he stops right where it **** is. Yeah. Anyway, this clown, Bernie the Clown, voiced by Burnie Burns. Why Burnie lends his talents to us, I will never know. He Li, but I appreciate it. But this episode's amazing because it features the love of your life, Genevieve. Genevieve. Now what's interesting is that of course you'd think in a way we timed this. Genevieve St-Onge moving here. Here's an episode about us, her wanting to **** me and me not being able to because I'm a little boy. Uh, we didn't",
            "start": 508.76
        },
        {
            "text": "is that of course you'd think in a way we timed this. Genevieve St-Onge moving here. Here's an episode about us, her wanting to **** me and me not being able to because I'm a little boy. Uh, we didn't this. Her she recorded this dialogue the day after our first date and we she had been cast before we ever went on a first date. Yeah, it's all just happened. St that it's come up the way it's happened cause she was coming over for something else, dxo at that point. Yeah, I guess that makes sense. No, Lovecraft had been announced yet. So yeah, so anyway, she came through and I was like, hey, you should do this cause originally we had cast is uh iJustine, right? Yeah, but iJustine was too busy. She was too busy. Couldn't do it. Thanks. And then then **** you either. iJustine talking to Genevieve. I was like, everything you say is funny. Yeah, it's funnier than when normal people say it. So I want you to say it. And then she said all the things and goddamn if I don't laugh every time I hear her say any line in this. She just puts the emphasis on",
            "start": 551.28
        },
        {
            "text": "funnier than when normal people say it. So I want you to say it. And then she said all the things and goddamn if I don't laugh every time I hear her say any line in this. She just puts the emphasis on whatever word you would never think to put emphasis on, which makes it funny cause she's foreign. I mean, I'm not making fun of the foreign people. I'm making fun of no, I I didn't mean that way. I'm making fun of funny. Yeah, I know. No, God. What what was that? What was that? I liked it cause I went, he, what is wrong over there? There's too many ****. Maybe you stop playing and making me all day. Don't cover me up. Maybe if you didn't play with with your M all day on my birthday, Kevin. Happy birthday. Thank you. Genevieve looks like not comfortable with what Happ 90% of the time I spend with her. Don't worry about that. Um, I get that. Of course, you're getting a lot of Genevieve St-Onge today. St it's my birthday. She's this is her first uh Kinda Funny barbecue. She's been in town for oh man. So she took all control away from me.",
            "start": 595.92
        },
        {
            "text": "I get that. Of course, you're getting a lot of Genevieve St-Onge today. St it's my birthday. She's this is her first uh Kinda Funny barbecue. She's been in town for oh man. So she took all control away from me. Kevin and I, uhoh, she's coming over here to make crazy some **** French poutine. **** no. A she's well, she's making other she bought a whole bunch of flank steak last night. She's gonna do stuff with there. B some biscuits she's gonna make. I think pizzas on the grill like from scratch. Pizza's on the grill. Oh, from scratch. Okay. She's stepping the game up around here. You know what I mean? I'm pretty stoked. How much how much maple syrup's going to be in shrimps last night? She bought the stuff for fancy s'mores. Oh, fancy s'mores. As usual, about the time I would say, let's go to the first story. Kevin has stepped away from this post as always. But anyway, definitely check out the animated episode. I think it's really, really, really good. I think it's the this episode is what I think that we always wanted",
            "start": 638.72
        },
        {
            "text": "stepped away from this post as always. But anyway, definitely check out the animated episode. I think it's really, really, really good. I think it's the this episode is what I think that we always wanted this series to be. Sure. Which is kind of just like it. The world is now built. People now know the characters. They're all out there. There's a bunch of little subtle things that I love. I love the pictures of Colin all over your house. It's so good. Yeah. So yeah, watch it. Leave a nice comment or leave a comment that gives your constructive criticism. Either way, we appreciate it. And remember that this sucks and the voice acting is terrible is not constructive. No, actually, I guess voice acting is ter well, no, voice acting is terrible. Semicolon. Greg should have inflected here. Done that. That's constructive. Yeah, yeah. Everybody go compliment Kevin though on being hairless. I do. I do appreciate those comments. First story comes from IGN.com where Joe Scrabble, a made-up name, says recommended to me as a friend on",
            "start": 683.48
        },
        {
            "text": "yeah, everybody go compliment Kevin though on being hairless. I do. I do appreciate those comments. First story comes from IGN.com where Joe Scrabble, a made-up name, says recommended to me as a friend on Facebook last night. Don't give in. Don't buy in. That's the Matrix trying to that's one of those like the porn fake profiles. Yeah, exactly. Kevin, is there any way we could in the screen that they're looking at maybe enhance a bit feel? Yeah, I like that. Nintendo. Sorry. Oh, the problem is we just don't get to see the video in the back in the bottom, but it doesn't matter. I just I just think this is good. This looks nice. Again, shout out to you, Kev, for this little I love this this layout. I love this lay. Good. It's really good job, Eno, as well. One day you do need to surprise me though with a little Chad box. What's a Chad box? There's a Greg box. There's a Tim box. Chad box pops up that has a camera on Chad. I I mean, I just said one day. I didn't say right now. Yeah, but you know how I am. I want to do now. I know.",
            "start": 721.72
        },
        {
            "text": "a Chad box. There's a Greg box. There's a Tim box. Chad box pops up that has a camera on Chad. I I mean, I just said one day. I didn't say right now. Yeah, but you know how I am. I want to do now. I know. Don't do it now. Also, let's talk about how good I look today, huh? You're looking good. You're looking damn good. Thank you. Chicken wings story. A lot of people my shirt. Yeah, what's up with the shirt? A fan made the shirt. We don't actually sell a shirt, but I really want to sell the shirt. Sure. So I might. What a surprise. The shirts you want to sell are going to get made and put through right away. What's going on with your mic? The shirts that I want to sell will never get made. Never. I know, Kevin. I don't know. When I put a mic on and you do a mic check and you say it sounds okay, you it sounded okay. Like you're the one looking at me. I can't see my mic. It in a stupid place down. Why would you clip like this? You know what? I don't ever want to clip my mic on again. All right. Excellent. I love touching you. You've",
            "start": 770.24
        },
        {
            "text": "the one looking at me. I can't see my mic. It in a stupid place down. Why would you clip like this? You know what? I don't ever want to clip my mic on again. All right. Excellent. I love touching you. You've just given me permission to do it whenever I want. You can do the story now. No. Oh, Greg. The kids can hear you. They love it. This is what they want. This is what they love. They love this kind of ****. Ooh, back your next move. This NPD Nintendo Switch sells 2.74 million units in under a month. Nintendo has announced that its new Switch console sold 2.74 million units worldwide in less than its first month on sale. Nintendo announced the figure at in I'm sorry. Let's try again. Nintendo announced its figure in its year-end earnings release, which it calls a promising start for the console. Nintendo president originally expected to ship 2 million units of the console in its first month. So they killed that. Yeah. Uh, it also revealed that Legend of Zelda: Breath of the Wild for Switch has sold 1.76 million",
            "start": 808.48
        },
        {
            "text": "originally expected to ship 2 million units of the console in its first month. So they killed that. Yeah. Uh, it also revealed that Legend of Zelda: Breath of the Wild for Switch has sold 1.76 million copies, meaning 20,000 more units of Zelda have been sold than Switches in the wild. That's so weird. I enjoyed Brian Altano put out a tweet about it when they released the original numbers about where the same thing where there was more sold than Switches and they were like, that's a stupid number. And then they all talked to each other and realized that like they were the problem where, oh, I bought it digitally and with a collector's edition. You can see how it all happens where it all starts stacking up. Perhaps telling. Nintendo also pointed out that launch game 1-2-Switch saying that it was generating buzz, but it did not reveal say sales figures. Yeah, it's buzzing all right. Nintendo expects to sell 10 million units of Switch hardware in the next year alongside",
            "start": 856.88
        },
        {
            "text": "Switch saying that it was generating buzz, but it did not reveal say sales figures. Yeah, it's buzzing all right. Nintendo expects to sell 10 million units of Switch hardware in the next year alongside 35 million software sales. If that comes to pass, the Switch would come close to outselling Wii U's 13.56 million lifetime sales in just over a year. **** yes. Lot of interesting stuff here. Mhm. So originally they projected 2 million. Yeah, when we got the numbers last month, like the early numbers, I think that was just America. Yeah. And that was just under a million, right? And yeah, it was just under a million. So like when you when you this is significant jump above that. It shows it's doing well worldwide. Yeah. And if they're looking if they projected 2 million, the 74, that's almost a million more. Yeah, than they projected. Yeah, them talking about the 10 million now for the next year. I have a feeling that that's a little bit. I mean, I don't know, dude. Like it's one of those like I'm saying low. Oh, oh, okay.",
            "start": 893.88
        },
        {
            "text": "they projected. Yeah, them talking about the 10 million now for the next year. I have a feeling that that's a little bit. I mean, I don't know, dude. Like it's one of those like I'm saying low. Oh, oh, okay. Okay. Well, I think it's that's the thing is I think it I think they can hit that. I think that that's not outrageous and I think that's a good spot to set it at to not get crazy about it. Really, it comes down to can you get these **** things out? Are you trying to we it again where you're just like, well, we wanted to go out and get snatched up cause again, it was a new story we read yesterday of like, guess what? Toys R Us is saying Friday with Mario Kart, they will have units and stuff. And genius marketing strategy when you think about it because I mean, it sucks to hold them back, but I don't think that they're necessarily holding back. They're just they have a certain amount. So they either put them out three weeks before or at the same time. You get what I'm saying? If you wait and hold off, the adoption",
            "start": 936.44
        },
        {
            "text": "they're necessarily holding back. They're just they have a certain amount. So they either put them out three weeks before or at the same time. You get what I'm saying? If you wait and hold off, the adoption rate up the game with the system is going to be much higher. Yeah. So if they can keep that going on, their software sales are going to be through the roof. Yeah, it's interesting cause they are it is shades of Wii where if I'm in a store, which I never am, but if I was and saw one, I'd buy it immediately and get it to somebody who needs it. Last night, I saw uh friend of the show, Nick Chester, over at Epic. He tweeted out the photo of his that he bought the Wii or he bought the Switch, but he didn't buy any games. I assume he's waiting for Mario Kart. I don't know. Or he just wanted to have it to have. Oh, yeah, I saw that. And it was like, okay, but it was like, that's the where we're at right now. Oh, ****. There it is. Got to get it. Got it. Put it there. You know what I mean? Yeah, man. But so 10 million, can we go back to",
            "start": 979.24
        },
        {
            "text": "that. And it was like, okay, but it was like, that's the where we're at right now. Oh, ****. There it is. Got to get it. Got it. Put it there. You know what I mean? Yeah, man. But so 10 million, can we go back to that story real quick? I never left it. Is it 10 million more or total 10 million by the I believe it's total. Nintendo expects to sell 10 million units of Switch hardware in the next year. Oh, so I guess so. I don't know. The phrasing of that's interesting. Yeah, I think they're saying from here out out 10 more. Either way, if it were to sell 10 million a year, I think that I think they're saying from here on out 10 more because they're saying it would come close to outselling the Wii U's 13.56. That was the point I was. So that'd be 1.74 or whatever. Yeah. So in one year, this thing is projected to crush the Wii U to hit what the Wii U did in its entire lifetime. Yeah, that is great news. Yeah, right? Yeah, if you keep going on with this, I definitely I keep saying that I think this thing's going to hit at",
            "start": 1014.4
        },
        {
            "text": "the Wii U to hit what the Wii U did in its entire lifetime. Yeah, that is great news. Yeah, right? Yeah, if you keep going on with this, I definitely I keep saying that I think this thing's going to hit at least 3DS numbers. I totally stand by that. Sure. And I this news makes me so happy because we're starting to get to a point where that number is impressive enough. The Nintendo can start to lay off the 3DS and you know, start committing to this as more of its sole platform. Let me jump. Let me read a little more of the stats here because they go past the Switch. Uh, the Wii U itself is not faired well, selling just uh 760,000 units as it ceases production alongside software sales of 14.8 million units. As for Zelda on Wii U, the game has so far sold 1.08 million units, bringing it up to 3.84 million units across the platforms. It's been a good year for the 3DS, however, as sales of hardware grew 7% year on year, shifting seven I'm yeah, shifting uh 7.7 million units. There are Nintendo Switches available on",
            "start": 1060.08
        },
        {
            "text": "the platforms it's been a good year for the 3DS however as sales of hardware grew 7% year on year shifting seven I'm yeah shifting uh 7.7 million units there are Nintendo Switches available on Amazon right now go go uh while software sales hit 55.08 million units a 14% rise in last year the company's for a smart device game seems to be paying off just shy of uh 4.5 billion Yen over the so yeah 3DS still doing well which is interesting stop double down and Switch brother yep but again they have to to to get that **** out of the way but again they they have to end when this number hits I don't know what it is I don't know where I'm sure that they have a mark where they're like there's enough out there in the wild to get these the people to buy the games for the system it's interesting to think about their strategy right now where they have like a game a month yeah May is the one month they're missing and I think that that is bad news like I I think that's a",
            "start": 1104.08
        },
        {
            "text": "system it's interesting to think about their strategy right now where they have like a game a month yeah May is the one month they're missing and I think that that is bad news like I I think that's a pretty bad **** up for right out of the gate where March was Zelda April's Mario Kart June uh Splatoon or Arms July Splatoon, surely um August right now is rumored to be that the Ubisoft Rabbids Mario RPG crossover thing okay and um then we already know we're getting Fire Emblem Warriors sometime this year they're saying Xenoblade Chronicles 2 I doubt that but whatever we know we have Mario Odyssey that's probably November okay maybe October um and then we have E3 announcements as well sure sure sure sure sure sure those are the if they keep doing some **** where they like keep putting Switches out with each game and really push each game I think that they're they're going to sell millions of each of those games well yeah I yeah I see what you're saying yeah that makes sense yeah",
            "start": 1152.48
        },
        {
            "text": "Switches out with each game and really push each game I think that they're they're going to sell millions of each of those games well yeah I yeah I see what you're saying yeah that makes sense yeah I mean Switch is I'm glad it's going so well I'm glad I love my system so much and that's the thing is I don't I'm not hearing from and I'm pulling myself into the chat right now because there's always somebody there to say it I'm not hearing from people who are saying they're disappointed with their Switch that they own a Switch and aren't happy with it I think we all bought it knowing what we were getting into and here we are I'm **** rabid ravenous about Kart. Kart will continue to consume me it was like now it's been an interesting thing of how much Kart I've played and now getting into the wild where it's been before like all right cool I'll jump in and do another Grand Prix whatever and try to beat my time or whatever and blah but now it's like oh wait **** I want I have time for a",
            "start": 1201.2
        },
        {
            "text": "wild where it's been before like all right cool I'll jump in and do another Grand Prix whatever and try to beat my time or whatever and blah but now it's like oh wait **** I want I have time for a race I did this yesterday where I had time for three races before uh Alana got here and so went online sure enough people were playing played three races **** I was like this is awesome this is now this is similar to what I was doing with with um uh sparade Tetris I have enough time I have 3 minutes I got time for a race try to bring out my points or whatever try to bring them down and it's something I I wouldn't have done that back home you know what I mean like I wouldn't go home and be like oh man I got time for a race boot up the Wii U turn on the TV do this settle in all right now I'm oh time to go do something like this is I don't have to think about it pop it on and go Jason Schreier tweeted this morning I saw this which I thought was interesting just based on on him and his",
            "start": 1237.6
        },
        {
            "text": "I'm oh time to go do something like this is I don't have to think about it pop it on and go Jason Schreier tweeted this morning I saw this which I thought was interesting just based on on him and his credibility and like what he thinks the Switch's success is fantastic and I hope it keeps up if Nintendo this thing properly it could be the greatest of all time console I'm like wa that's a lot and then obviously people are no way getting in there he like someone says but we know Nintendo somehow they'll ruin third party relationships and the Jason response and virtual console and Inter options et cetera et cetera so it's like you know he's not totally just sucking its dick but I don't know man I'm I'm hopeful I'm feeling good about it I'm loving mine and I I really do hope that at E3 they come and kill it because these are all great signs that this thing is off to a a long beautiful life yeah and I think this is the this is what we I talked about in the Lauren Laninga episode which is Kinda Funny",
            "start": 1274.36
        },
        {
            "text": "and not Kinda Funny Games but when Lauren Laninga comes through wants to talk about games you let talk about games Y is the fact that I think numbers like these uh play into the fact of okay I'm Ubisoft or not even Ubisoft I'm Activision not Activis because I suck I'm a third party developer that isn't already doing something or is it only out for the biggest thing in the world like all right cool there's enough in there let's make a small indie title let's give somebody a year to make something different and small and Shovel Knight-esque you know what I mean like do something like that not we're going to go **** put Batman: Arkham Origins on it or some **** Empire exactly exactly let's make something cool for It Go y let's stay with the Nintendo news double down a bit on the mobile news that was",
            "start": 1314.28
        },
        {
            "text": "go **** put Batman: Arkham Origins on it or some **** Empire exactly exactly let's make something cool for It Go y let's stay with the Nintendo news double down a bit on the mobile news that was in there before we're staying on IGN Matt Porter says Super Mario Run downloaded 10 times more than Fire Emblem Heroes makes less money uh Super Mario Run is nearing 150 million downloads combined on iOS and Android however it's not making as much money as Fire Emblem Heroes this news comes via the Wall Street Journal's technology reporter in Tokyo Takashi Mochizuki on Twitter Nintendo Chief number of Fire Emblem downloads less than one-tenth of Mario but revenue revenue bigger than Mario Super Mario Run is a free download however it costs money if you want to progress past the first three levels and the boss the level unlock for Mario is a one-time payment of $10 whereas Fire Emblem Heroes has microtransaction actions you can buy orbs unlock new Heroes with the most expensive pack",
            "start": 1354.08
        },
        {
            "text": "levels and the boss the level unlock for Mario is a one-time payment of $10 whereas Fire Emblem Heroes has microtransaction actions you can buy orbs unlock new Heroes with the most expensive pack costing 75 bucks what was that I think it's Andy's Amazon and I think he has his guitar no no no someone sent a tip and I opened it Oh I thought that was that too immediately started and I was like oh Super Mario no sorry last month Nintendo said Super Mario Run didn't meet the company's expectations a Nintendo smart device games were one of several encouraging parts of its latest financial statements more than quadrupling the amount of money made year-over-year and then we keep going so this is that's the news part of it uh I don't think it's that shocking like I mean like guess what like phone games are on to something with microtransactions and how people play how they consume it and so this this was a big deal remember that Super Mario got tanked and using reviews because oh I",
            "start": 1400.88
        },
        {
            "text": "like phone games are on to something with microtransactions and how people play how they consume it and so this this was a big deal remember that Super Mario got tanked and using reviews because oh I played for four levels and I got to pay blah yeah no it's an interesting thing because again Nintendo tried different strategies with mobile and it tried to do the thing that all the core gamers wanted which was we're going to put out a a real game with a real price tag and and add value like say that this thing has a value and then the Fire Emblem Heroes is the example of well no we're just going to do what we know works on this platform and guess what it works what's more shocking though is Fire Emblem man it is a core franchise like that is a game like to see that it's doing so well is awesome that people are I've seen so many people playing it just like on when I'm out playing Fire Emblem Heroes I'm like why are you playing this game yeah but that's awesome but where a Super Mario Run was a",
            "start": 1447.16
        },
        {
            "text": "that people are I've seen so many people playing it just like on when I'm out playing Fire Emblem Heroes I'm like why are you playing this game yeah but that's awesome but where a Super Mario Run was a bit more of like a like you'll see it in movie theaters like trailers and stuff like no one's actually into it I do think it's important though you need that Mario out there on the the platform and I I think that they made the right moves with the mobile thing but do you think they'll ever do it again that way that way probably not yeah but why would they I think I mean I think this was definitely a this was a put up or shut up I think this is what I always talk about when Colin would talk about season passes right or when the internet talks about season passes gets mad at season passes they're not necessarily audience for that season pass as a Batman fan I was fine with the Arkham Knight season pass right but as a commentator devoid of it who was never going to buy it to commentate on season",
            "start": 1486.68
        },
        {
            "text": "necessarily audience for that season pass as a Batman fan I was fine with the Arkham Knight season pass right but as a commentator devoid of it who was never going to buy it to commentate on season passes that way you're not understanding what the market and the fan wants whereas I think this is the same thing awesome Nintendo is saying there is value in this game pay us upfront for it and you get it great go do it and it's not the business model this is back to video games being a business and how does that actually work and where do you go and I think that Nintendo really missed the mark with Super Mario Run in it didn't have a target audience that it was doubling down on like so okay if you're aiming at the mobile gamers even like the the hardcore like the real gamers that also play mobile games like me right I play mobile games all the time I was like H Mario Run's a little bit empty compared to Rayman Jungle Run which is a third of the price and has way more content and is a",
            "start": 1526.2
        },
        {
            "text": "mobile games like me right I play mobile games all the time I was like H Mario Run's a little bit empty compared to Rayman Jungle Run which is a third of the price and has way more content and is a better game that's very similar so it's like it lost people like me then the casual people they're like oh it's a Nintendo game on on a a mobile I'm going to do this they played for a little bit and then stopped and then there's like the the hardcore people like you that are just like eh all right cool it's fun well it lasted but I'll never think about it again exactly I played it for the first two levels I paid for it I was like all right whatever going to get back to it uh T. Starky 0810 says lots of background clutter noise is Andy shooting hoops or something no just Kevin me and Kevin the noise all the clanking and the dropping and the things and the moving excessive excessive I we can power through we're professionals yeah but it's a Here Comes, let's cancel Bar I'm just saying I mean",
            "start": 1568.16
        },
        {
            "text": "noise all the clanking and the dropping and the things and the moving excessive excessive I we can power through we're professionals yeah but it's a Here Comes, let's cancel Bar I'm just saying I mean like maybe you want you want to cancel Bar, Bar way to be quiet and then there's a way to like be as loud as possible it's not that loud those in the chat that was Trevor Starky I mean are you kidding me whoa that's what I do you cat it you don't just say that yeah that's what I do when you are going to talk about we we can talk about Kinda Funny Life everybody we're talk about Kinda Funny Life 3 June 3rd here in San Francisco at the Regency Ballroom tickets available KindaFunny.com/KL3 here's Andy Cortez who's also not working on the shirt or the let's play okay guys got there's a shirt that I'm working on right now and um we're trying to come up with fake video games that are Kinda Funny related so for example The Legend of P.Y. or Funny Fantasy 69 or something you know just like silly",
            "start": 1612.4
        },
        {
            "text": "I'm working on right now and um we're trying to come up with fake video games that are Kinda Funny related so for example The Legend of P.Y. or Funny Fantasy 69 or something you know just like silly things that are Kinda Funny related that are also game related so tweet me your ideas at #KFLGames okay #KFLGames there you go and so it's going to be like a community project and I'm going to like pick the ones that I think are the coolest and most creative and they're going to be on a shirt so all right #KFLGames use that hashtag so not only are you not doing your job you want other people to do it too yeah that's a great point yeah like you're not doing it sounds like he's doing his job by designing the shirt I guess I'm just see like his shirts are **** sick very excited to have these all over people's bodies next story comes from GameSpot.com where Oscar Diaz says new Project Scorpio images show graphical boost over Xbox One wa Project Scorpio specs were recently",
            "start": 1660.32
        },
        {
            "text": "to have these all over people's bodies next story comes from GameSpot.com where Oscar Diaz says new Project Scorpio images show graphical boost over Xbox One wa Project Scorpio specs were recently revealed showing the console is capable of playing games in native 4K and upgrading the resolution of your existing Xbox One titles now Windows Central has obtained some images of just what kind of visual boost Scorpio will offer over the Xbox One the beetle images below illustrate what the improvement like might look like the photo on the left is according to the website a ladybug that has been rendered at 4K using existing Xbox One assets the right image meanwhile has been given vastly improved textures and utilizes Scorpio's extra GPU over Xbox One wait what see here can you guys see it yeah yeah so this is Scorpio yeah this is PlayStation I'm be honest so this one is shiny and looks kind of like lemon skin this one you can see scales all right so I'm going to read it again cuz Kevin's",
            "start": 1709.92
        },
        {
            "text": "giving you all the wrong information what go back to the thing oh Jesus God all right so this is the one on the left side this is the one on the right side are you positive yeah I mean I'll go back over here Jesus **** oh my God what's happening all right so stop right here okay the photo on the left is according to the website a ladybug that has been rendered at 4K using existing Xbox One assets the right image meanwhile has been given vastly improved textures and utilizes Scorpio's extra GPU power over Xbox One what did I say wrong you said the one on the right is PlayStation 4 no I said did I yes I don't believe you **** I I didn't hear oh my bad they know less I thought he was right but your chat will let me know if I'm wrong but I was also focusing on the ladybug the ****",
            "start": 1764.88
        },
        {
            "text": "did I yes I don't believe you **** I I didn't hear oh my bad they know less I thought he was right but your chat will let me know if I'm wrong but I was also focusing on the ladybug the **** textures of this goddamn I it's interesting though cuz like on first glance the one on the left looks better cuz it looks more detailed you see it and it's this one actually has more detail yeah I can zoom in see yeah there you go and then this is the PS4 version there you go Kevin did say PlayStation Kevin definitely did just say PS4 right now **** you what oh did I do it wrong this time yeah you did twice the chat which hasn't caught up to the live **** up is saying you **** up before nobody cares right I know nobody cares calm down this is the PS4 this is theoretical Scorpio theoretical thank you right the no none of them are PlayStation 4 you keep saying PlayStation 4 instead of 4K isn't the PlayStation Pro I'm assuming that's what they were comparing it to I hate you what I wasn't",
            "start": 1814.44
        },
        {
            "text": "thank you right the no none of them are PlayStation 4 you keep saying PlayStation 4 instead of 4K isn't the PlayStation Pro I'm assuming that's what they were comparing it to I hate you what I wasn't listening to the first part of the AR so I guess this is 4K and this is Scorpio is that what Xbox One and the Scorpio Kevin oh okay so this is Xbox One is a Scorpio all right see now I'm getting it if we just talk it out guys I mean that's not correct either though they're all they're all using fancy tech all right dude the photo on the left is a ladybug that has been rendered at 4K using existing Xbox One assets whoan says time to drop Kevin off a building hey guys notice all the detail in the legs God look at look how hairy the legs are all okay okay tell you what man wow that that's a big difference that is yeah but there's ants on the tree and Horizon so **** look at his like eyes eyeballs yeah eyeballs you get a lot more detail there yeah what's crazy is this is a picture",
            "start": 1866.2
        },
        {
            "text": "a big difference that is yeah but there's ants on the tree and Horizon so **** look at his like eyes eyeballs yeah eyeballs you get a lot more detail there yeah what's crazy is this is a picture of like flowers actually and they just punched in that is crazy I I made that part up they looked you're right though that is a pedal that is in fact a pedal next story over on GAF Injustice 2 Le Joker gameplay leaked they leaked the Joker here is what we're being told right but it's a crazy looking Joker Joker's it's only Le cuz it's French well we we if only Genevieve St-Onge was here and there's a gameplay trailer that we could look at as well are we going to watch it yeah I am so impressed with how this game looks yeah oh yeah for them man yeah trois coups what does that mean I don't know come save us and translate So, who is Le Joker I don't remember him from comics but supposedly this is a big deal because the Joker spoiler alert M shouldn't be in this game I mean did you you read all the",
            "start": 1925.8
        },
        {
            "text": "us and translate So, who is Le Joker I don't remember him from comics but supposedly this is a big deal because the Joker spoiler alert M shouldn't be in this game I mean did you you read all the Injustice comics of course so you're caught up don't worry about it okay keep up guys there's multiple universes of course there's multiple Jokers let's kind let's not get crazy here let's notzy this is the this is from Earth-7 the all French Earth that's why he's little Jonjo Joker oh no last one looks pretty cool looks pretty cool over at the PlayStation Blog Nioh DLC Dragon of the North out May 2nd we're excited to showcase our upcoming DLC for Nioh: Dragon of the North coming to PlayStation 4 next week I'm sure many of you samurai have been hungry for more adventures and challenges this new chapter picks up after William's valiant victory in restoring peace to Japan in keeping with the tradition of our inspiration through Japanese history and mythology the central character for this",
            "start": 1983.16
        },
        {
            "text": "new chapter picks up after William's valiant victory in restoring peace to Japan in keeping with the tradition of our inspiration through Japanese history and mythology the central character for this new chapter is based on Lord Masamune Date the ruler of the Sendai feudal domain in the Keicho era about 400 years ago in our opinion his personality exploits in history lend himself to be a key player so there's Nioh DLC coming if if you're strong enough to be Tim was not 5 days away Tim was crushed under the weight crushed under the weight he could not compete he could not do it he had to let it go bad I'm a bad boy The Hollywood Reporter meanwhile says Ewan McGregor here's an ad to block the thing so hold on we got to here you can just look up n got I refuse not going to do itell was that Ewan McGregor to star in Disney's Christopher Robin exclusive didn't even know Christopher Robin was going to be a thing this is interesting news you hear about this he's an adult no Ewan",
            "start": 2039.6
        },
        {
            "text": "Ewan McGregor to star in Disney's Christopher Robin exclusive didn't even know Christopher Robin was going to be a thing this is interesting news you hear about this he's an adult no Ewan McGregor is in talks to star in Disney's Christopher Robin the live-action film which will be helmed by World War Z and Quantum of Solace director Marc Forster centers on a child centers on the child from A.A. Milne's Winnie the Pooh stories but he's all grown up McGregor will play the adult Christopher Robin who has lost his sense of imagination and is a businessman focused on work and success the studio is also bringing in this guy did that Christopher Robin was inspired Christopher Robin you so it's Hook it's Hook with a **** bear but yeah Hook is great Hook is **** amazing Winnie the Pooh comes back to help him get creativity back so what's interesting about this is it going to be the Winnie the Pooh is it going to be CG is he going to be drawn in is he going to have the voice be CG he's going",
            "start": 2088.36
        },
        {
            "text": "to help him get creativity back so what's interesting about this is it going to be the Winnie the Pooh is it going to be CG is he going to be drawn in is he going to have the voice be CG he's going to be the I don't know I'm a bear yeah Nah, I ate that man. Nah, not one of these voice um BlanketFor83 says Tim I told you this once and you announced it on the air don't remember that but I'm lot of things this show you we just we talked about this before not with Ewan McGregor um but what's interesting about this I might have said this before but Max Landis has pitched this exact movie on a in a YouTube video I saw once that is one of my favorite YouTube videos of all time like look up Max Landis movie pitch and it's him at a panel and he's pitching and I guess I'm spoiling like the reveal cuz he pitches the whole movie like the plot of it you don't know that it's Winnie the Pooh and then there's like a moment where you're like holy **** it's Winnie the **** Pooh but it's the same idea of",
            "start": 2139.76
        },
        {
            "text": "he pitches the whole movie like the plot of it you don't know that it's Winnie the Pooh and then there's like a moment where you're like holy **** it's Winnie the **** Pooh but it's the same idea of Christopher Robin it's **** dope go watch that **** I hope I hope there's a turn here where like he goes crazy and like he kills people as when well I think what happens is that red shirt no pants Ewan McGregor just **** hacks on people I can't say his name McGregor all right normal guy sure stress of life starts doing heroin boom Trainspotting 3 yeah m back in it now guys yeah he can see the Pooh Tiger's dead no no they're all back and happy real life is just terrible not **** ass Eeyore, Piglet **** out of here oh **** ass Piglet Piglet's the yeah n Winnie the Pooh is some straight trash all right ****ing I like honey did you ever watch Winnie the Pooh: The Animated Series I'm sure at some point the episode where they go into the bed and there's this whole other world it was ****",
            "start": 2185.04
        },
        {
            "text": "awesome you're an **** Greg even on your birthday same sucks dick Pooh is so goddamn goddamn unimaginative give me Teddy Ruxpin any day of the week all right the wonderful thing about tigers is tigers are wonderful things they the I did I did effects. The Heffalumps they're there the Woozles there every once in a while you one more time oh God you're like popping up it's popping up popping up final story of the day comes from IGN.com Alex Gilyadov D23 Expo 2017 panel lineup announced Disney has revealed its full Hall D23 panel lineup for this year's D23 Expo which takes place from July 14th to July 16th at the Anaheim Convention Center dis didn't we just have Star Wars Celebration can we just do it all there how many **** things do they need how many celebrations do they need Like they have a world and",
            "start": 2233.52
        },
        {
            "text": "the Anaheim Convention Center. Didn't we just have Star Wars Celebration? Can we just do it all there? How many fucking things do they need? How many celebrations do they need? They have a World and a Land to do stuff at. Two. Stay out of my life. Keep your laws off my body. Basically, at Land, they're announcing news for it. Disney CEO Bob Iger will kick off the event at 10:00 a.m. Pacific time with the Legends Award Ceremony that honors this year's Disney Legends Award recipient, which includes the likes of Stan Lee, Oprah Winfrey, and the late Carrie Fisher. Piper3 says, \"I can't sit here and listen to Greg shit all over Winnie the Pooh.\" Andy Cortez, what do you think Winnie the Pooh? I love him. You're fucking lying. Louder, Andy. Give me your favorite Winnie the Pooh anecdote. Oh, Pig. No, like story from your... Why does he talk like that? He does that. What does he do? Pig. He does. Following the ceremony, Pixar and Disney Animation Studios will take the stage at 1:30 to showcase their film projects for 2017 and",
            "start": 2297.0
        },
        {
            "text": "why does he talk like that? He does that. What does he do? Pig. He does. Following the ceremony, Pixar and Disney Animation Studios will take the stage at 1:30 to showcase their film projects for 2017 and beyond. Some of the movies beyond that'll be in attendance: The Incredibles 2, Coco, and Ralph Breaks the Internet (Wreck-It Ralph 2). Yeah, Disney is also promising a few surprises during the panel. I stop reading yet, or is this interesting stuff? This is a boring story about boring people. No, fuck you. Did you see the Cars trailer yesterday? That shit is hype as fuck. Cars 3 sucks dick. Cars One, underrated. Damn, Tim. What? I mean, just Cars 2 might not have been for you, but no, Cars 2 sucked. Actually, never watched it. It's bad. But Cars 3 looks so good. This, this, the car crashes. I remember in Cars 3 trailer that the first trailer is there. The new trailer, the cars crashed in all the trailers. But this trailer, you're finally getting a bit more of what the story is going to be. He gets rebuilt as an electric",
            "start": 2347.88
        },
        {
            "text": "that the first trailer is there. The new trailer, the cars crashed in all the trailers. But this trailer, you're finally getting a bit more of what the story is going to be. He gets rebuilt as an electric car. No, Super Carlin Brothers, great breakdown. Who's Super Carlin Brothers? Uh, it's a YouTube channel I really like. They broke down the trailer well. They like, they broke down the trailer and like had a theory on what it, what's it about. It's about... But that was just the first trailer. Oh, okay. It was really, I really enjoyed it. Cool. Anyway, I'm excited for Cars 3. It's coming super soon. So, in summary, Disney sucks. No, in summary, shut your fucking mouth. I'm interested on when we're going to get the actual Phase 4 information like for Marvel. Yeah, fell asleep in the middle of this boring ass article. Are they not going to talk about it until Infinity War is out? They have to. Yeah, because they spoil Avengers 4 spoiler title. So I'm talking about what the plan is after that though. Spoiler title. You can't do spoiler",
            "start": 2399.32
        },
        {
            "text": "to talk about it until Infinity War is out. They have to. Yeah, because they spoil Avengers 4 spoiler title. So I'm talking about what the plan is after that though. Spoiler title. You can't do spoiler title. Can't do it. You got some spoiler spoilers now. Justin Times says what I'm, we're all thinking. I never understood why \"sucks dick\" is associated with being a bad thing. Personally, I love when my dick is getting sucked. It's a good thing. Personally, I... This is an argument because it's the problem is personal preferences all the time. Say something sucks dick. It's just, it's, I mean, the insult I guess is that it's, it doesn't make any sense. That's why sometimes I'm like, if you like getting, if you like sucking dick, then it eats shit. If you don't like doing any of that, it does whatever you don't like. I think, um, what is it, the comedian? O, what's his name? Take us on this journey. C... hold on, hold on, give me a second. Yeah, we're giving... Louis C.K. Yeah, said it best, like, each dick, like, no one enjoys sucking a dick and",
            "start": 2445.04
        },
        {
            "text": "um, what is it, the comedian? O, what's his name? Take us on this journey. C... hold on, hold on, give me a second. Yeah, we're giving... Louis C.K. Yeah, said it best, like, each dick, like, no one enjoys sucking a dick and each one takes a little bit out of you. And then he like pretended to suck a dick and like that was great. Yeah, it would have been nice if the people could have seen. I know if he would have put his camera on for his visual gags. But Kevin likes to show that Kevin likes to give us gifts. You know what I mean? It, it, Kevin gives us gifts. It's, oh, um, they're all panicking about stuff. They're running around doing things. People running around and doing things. Um, that's it for news. Y, if you didn't know, ladies and gentlemen, this is the Kinda Funny Morning Show. Each and every week here on Twitch.tv/KindaFunnyGames, we come to you with the nerdy news you need to know about before jumping in the chat to answer your questions, comments, and concerns. In between those two segments though, I reaching the",
            "start": 2486.44
        },
        {
            "text": "Kinda Funny Games, we come to you with the nerdy news you need to know about before jumping in the chat to answer your questions, comments, and concerns. In between those two segments though, I reaching the internet, grab a video game and toss it to one of you. How do you win? It's simple. In the chat, like so many of you are right now on Twitch.tv/KindaFunnyGames, you are automatically entered to win and don't need to do a goddamn thing. However, if you're watching later on YouTube.com/KindaFunny or podcast services around the globe where we'd love you to rate us, even if you don't listen to it, just go there, do it, get out. Uh, there are three chances to win that you don't need you to be here. If you are here, you can use these other three chances to amplify to four chances. Number one, you can subscribe to us on Twitch. It automatically enters you to win. You don't need to be here. Plus, you get the logo next to your name, cool emotes, chat time with us, get to play multiplayer games with us, like so many of",
            "start": 2534.72
        },
        {
            "text": "us on Twitch. It automatically enters you to win. You don't need to be here. Plus, you get the logo next to your name, cool emotes, chat time with us, get to play multiplayer games with us, like so many of you doing, like more than a hundred of you are doing tomorrow when I play Mario Kart all afternoon after the Morning Show. Uh, you also get ad, you get the show ad-free unless we bake them in, and we're baking one in today, aren't we? Yeah, okay. Uh, then if the other two, oh, that also, if you have Twitch Amazon Prime, you have Twitch Prime. Steal back some of the fucking money Amazon's taken from you and give it to us every month. Though you have to do it or somebody else, it doesn't matter. I'm just saying it's a benefit. You're wasting money if you don't do it. Also, you go to Patreon.com/KindaFunny or Patreon.com/KindaFunnyGames. Support us at the $5 level. You are entered to win every giveaway we ever do and you don't have to be here at all. Greg, yeah, who is sponsoring this episode right now? This episode is sponsored",
            "start": 2571.64
        },
        {
            "text": "games support us at the $5 level. You are entered to win every giveaway we ever do and you don't have to be here at all. Greg, yeah, who is sponsoring this episode right now? This episode is sponsored by ProFlowers.com. Here's the ad that I wrote for them that I'm very proud of. Have you heard it yet? I haven't. Oh, good, 'cause it's been, it's been making the rounds. Nick liked it a lot. Hit Me With Your Best Shot, Greg. Big KevDog likes it. All right, close your eyes and go on a journey with me. Don't read it ahead of time. You know who I love? My Mom. You know what my Mom loves? Flowers. Mother's Day is right around the corner. So let old gruesome Greggy help you out. Visit our advertiser ProFlowers.com right now and get your Mom some flowers. 100 blooms for $19.99. Actually, don't do that thing where you put it off. Mother's Day will be here before you know it and you're just going to screw it up if you wait. How do I know? I used to do it all the time. You say you'll do it later and then bam, it's Mother's Day",
            "start": 2606.4
        },
        {
            "text": "off. Mother's Day will be here before you know it and you're just going to screw it up if you wait. How do I know? I used to do it all the time. You say you'll do it later and then bam, it's Mother's Day and you have a cheese pizza on the way and 100 problems that could have been solved with 100 blooms. You let her down, pizza eater. You screwed it all up. Mom is going to get a tattoo that says she hates you and you could have avoided this if you just would have fucking listened to me one goddamn time. The only way to stop that horrible future and get 100 blooms for a Mom and get a free glass vase starting at $19.99 is to visit ProFlowers.com, click on the microphone in the top right corner and use my code Greggy. That's ProFlowers.com and code Greggy. When you click the mic, order today or ruin your life. Great camera work as always, Kev. Thanks. I'm proud of you. You thank you. That was good. Now we've talked, we've talked. When I say we, I mean Kevin and Nick and like maybe Andy. I don't know. You're never R",
            "start": 2649.48
        },
        {
            "text": "great camera work as always, Kev. Thanks. I'm proud of you. You thank you. That was good. Now we've talked, we've talked. When I say we, I mean Kevin and Nick and like maybe Andy. I don't know. You're never R. Are we allowed to curse in ads? 'Cause I curse the fuck out of somebody's ad. I don't know. We probably should avoid it, but like they keep giving us money though. Am I right, Andy? Sure. Thanks, Andy. Today we're giving away Sub Level Redux on the PlayStation 4. The winner is a Patreon Games person and it is Tate Fur. Tate Fur, you have won Sub Level Redux PlayStation 4. I will email you after the show so as not to be distracted. Let's jump into the tips, then the chat, then the fun times. I and I also believe some fucking shit challenged me to Mario Kart yesterday and then I said I would, I would take him on here and destroy him. So if you want to come out of the shadows and stop being a coward, let me know. Shadows, you, 'cause I'm ready for an appetizer for tomorrow's big match. What do you got for me, Andy? I want to",
            "start": 2692.88
        },
        {
            "text": "and destroy him. So if you want to come out of the shadows and stop being a coward, let me know. Shadows, you, 'cause I'm ready for an appetizer for tomorrow's big match. What do you got for me, Andy? I want to say one more thing. Okay, one more thing. I've gotten a few good suggestions. Let's try to make them very pun related. For example, a really good one I got, Bongo Kazooie. Fuck, like that's great. Or Tim Crisis instead of Time Crisis. Um, stuff that isn't good. It's like Kinda Funny 64. Like, you know, what's that? What the fuck is that? You know what I'm saying? Yeah, I know what you're saying. You know what I'm saying? So like, you know, kind of like gone homeless. Yeah, well, but that doesn't have anything to do with... Yeah, but I'm, it's in the right, your pun thinking. C, yeah, absolutely. Let's, let's get creative with this, guys. Let's be cute. All right, yeah, hit it up, boys. Kevin Gear Solid: Bongos of Liberty. Let's call those, those good attempts. No, okay, we're gonna be honest with him, huh? Bongo Kazooie is my favorite. So Bongo",
            "start": 2746.88
        },
        {
            "text": "this, guys. Let's be cute. All right, yeah, hit it up, boys. Kevin Gear Solid: Bongos of Liberty. Let's call those, those good attempts. No, okay, we're gonna be honest with him, huh? Bongo Kazooie is my favorite. So Bongo Kazooie is good. Yeah. Nick Scarpino sucks. Peace Walker. Hashtag, what is it? KFL3 Games? KFL3 Games. KFL3 Games. Send them to Andy. Jumping into the chat. Actually, the tips. Fuck off. Sorry, not chat. Um, Taberscaff, I'm sending this the day before as I can't watch today. Greg, please watch this one minute video on Superman. Remember when you see our Canadians? Winky emoticon. Was this a good clip? I actually don't have that on because I only get today. Okay, so you should, you should watch it on your own and enjoy it. Enjoy that shit. Okay, I'm, I'm watching on my own. I'm putting here. I've, I've opened it. I won't miss it. I love you very much, Taberscaff. Uh, Canonfire, hey guys, just wanted to plug my podcast called The Friendly Neighborhood Podcast that can be found on SoundCloud and iTunes. We talk about comics, video games,",
            "start": 2792.08
        },
        {
            "text": "love you very much, Taberscaff. Uh, Canonfire, hey guys, just wanted to plug my podcast called The Friendly Neighborhood Podcast that can be found on SoundCloud and iTunes. We talk about comics, video games, movies and more. Thanks. Happy birthday, Greg. Uh, he's also getting a shout out in the what's happening over here. He's also getting a shout out in the AMA that goes up on Saturday because he put up a question there too. So there you go. Uh, um, Rudy E. or Easy, probably Rudy Easy. Hey guys, leaving birthday tax for my pal and fellow best friend Garren. Let's show him some sweet nasty birthday love on Twitter at G_E_D_B. So G_Duby, we can't wait to see you Kinda Funny Live 3. We can't wait to see you. Hudthatninja73, a very happy birthday, Greg. Hope you have an awesome day. I'm planning another NYC Community meet up on May 6th for Comic Book Day, Free Comic Book, a trip to Nintendo NYC and Guardians of the Galaxy Volume 2. That's like to see. That's the kind of shit Kinda Funny Best Friend Community",
            "start": 2854.04
        },
        {
            "text": "meet up on May 6th for Comic Book Day, Free Comic Book, a trip to Nintendo NYC and Guardians of the Galaxy Volume 2. That's like to see. That's the kind of shit Kinda Funny Best Friend Community we got out there. Go have some fun. Now here we go. Greg Tedro114, Mr. Miller, I may not have a fancy video, but I did write/record a song for you during my lunch break yesterday. BTW, happy birthday. I love you. You heart. But this is going to be about shit Mario Kart, isn't it? Yeah, let's watch it. It won't matter when the flame burns out and I take your ass to fucking school. It's game. I want to be mad, but it's to talking shit. Compensate for that, baby. Wait, what now? For you, keep strutting that strut and try to keep up. Remember how it felt? Ready to feel that feel again? Remember how it felt when Scarpino took the... Are you ready to get spanked by a best friend? Did you know about this? How? Why this picture today? Game for you. C, go ahead. Keep talking shit. Compensate for that, baby. Dick.",
            "start": 2903.88
        },
        {
            "text": "Scarpino took the... Are you ready to get spanked by a best friend? Did you know about this? How? Why this picture today? Game for you. C, go ahead. Keep talking shit. Compensate for that, baby. Dick. P.S. I love you. I'm still your best friend. Oh, yeah. Congrats to you and Jen. But Friday, she'll find out you're not a man. That's fantastic. Shit, nailed it, man. You did that on your lunch break. God, good job, my friend. It's not upsetting. It's just interesting how many people watch this and we have no talent and they have endless fucking amounts of talent. Dude, good job, man. Great fucking job. It's a great song. I mean, it's all shit. You're going to get your ass kicked, but whatever. Fuck cool. Hudthatninja73 tips again. Can you please let the best friends know that they can contact myself at Hudthatninja73 or Kelsey Lynn (L_Y_N_N_10331) Halloween on Twitter for any questions about the NYC Meetup? See you all Kinda Funny Live 3. Yep. And I'm sure you can go post it on the forums if you haven't already and",
            "start": 2982.44
        },
        {
            "text": "Kelsey Lynn (L_Y_N_N_10331) Halloween on Twitter for any questions about the NYC Meetup. See you all Kinda Funny Live 3. Yep. And I'm sure you can go post it on the forums if you haven't already and you can get it there. MarioNotBros, happy birthday, Greg. Congrats on all the good things coming to you lately. You deserve it all. I appreciate you so, so much. Plus, that animated series episode was hilarious. What up, Tim? Heart. Thank you, Mario. Happy birthday to you too. His birthday as well today. Uh, Rookie_Shit, happy birthday, Greg. How did the whole knockoff Colin shirt thing go? Oh, I'm the one that tweeted you guys. Hope it all got resolved. I missed my, missed my shirt. Yeah, some other people were selling that \"Colin Was Right\" shirt, but like a real website, not like just like CafePress. So I hit him up like, \"Hey, we own that logo and everything, so stop.\" And they hit me back like five minutes later like, \"It's done.\" Like, \"All right, thanks. Cool.\" That's a weird thing to do. WarriorC7, I'll have to catch this",
            "start": 3061.36
        },
        {
            "text": "like, \"Hey, we own that logo and everything, so stop.\" And they hit me back like five minutes later like, \"It's done.\" Like, \"All right, thanks. Cool.\" That's a weird thing to do. WarriorC7, I'll have to catch this on the VOD on YouTube as I've got revs up for end of the... Oh, I've, as I've got, I think it means to rev up for end of the year finals, reviews, whatever the fuck. But I had to wish you a happy birthday, Greg. Have a wonderful day. Enjoy the barbecue. I will. Genevieve St-Onge was working on that barbecue already, I assume. Kevin, nope, nope. Should I talk to her about it? I think she's talking to... Name a dangerous place to have... I don't know. I'm not going to order her around. You know what I mean? I'll order. Thank you. CanCancerCookie, hey guys, I will 100% write you any guys a fan fiction. Any particular, any particular genre or situation, or can I just go all out erotica? Go all out. All out erotica. Yeah, yeah. Maybe it becomes a love and sex stuff episode of a live reading. Oh my God. Uh, Bonsy8, hey guys, took the day",
            "start": 3107.16
        },
        {
            "text": "genre or situation, or can I just go all out erotica? Go all out. All out erotica. Yeah, yeah. Maybe it becomes a love and sex stuff episode of a live reading. Oh my God. Uh, Bonsy8, hey guys, took the day off for the NFL Draft and I can finally watch live. Just wanted to say you guys are awesome. Keep doing what you're doing. Also, Central Time is the only good time zone. Nope, nope. Fuck you. No, that's not true at all. You're fake time zone. I was, I was raised there. It's a fake ass time zone. On one year on my birthday, uh, the Bears drafted Mizzou's own Justin Gage and that was a fucking awesome birthday gift. Okay. And they didn't use him properly and then he left right away. I still have, I actually just gave it away, I think, a Justin Gage jersey I made because they didn't make his own. You know what I mean? When he wasn't 1-1 Gage. But suck. I get it. AP Jackson, IckJacksSonic, paying Greg's birthday tax for him. I know he's up to his ears in $50 Mario Kart debts. Winky emoticon. Happy birthday, Greg. Thank you so",
            "start": 3148.68
        },
        {
            "text": "he wasn't 1-1 Gage. But suck. I get it. AP Jackson, IckJacksSonic, paying Greg's birthday tax for him. I know he's up to his ears in $50 Mario Kart debts. Winky emoticon. Happy birthday, Greg. Thank you so much. Thank you. Uh, BeSomebodysBlues survived the most stressful semester of my life. Thankfully, it's the last one. Graduating on Saturday. Hell yeah. Thanks for getting me through it, guys. PSG. Anyone looking for a screenwriter, hit me up. Congrats, congrats on graduating, getting out of school. Get out that school. Alex's E, Tim, yes. Have you watched any episodes of Everyday Struggle with Joe Budden and DJ Akademiks? Nope. It's not. If not, it's every bit as entertaining as it sounds. Really? All right, I need to check it out. That does sound good. Oh, yeah. Okay. Joe Budden, \"Pump It Up.\" How do I say the DJ's name because I just butchered it? DJ Akademiks. Akademiks. Akademiks. Okay. Caesar Palifox, it's awesome having a birthday twin, Greg. Have a blast. Beat Ziggler's ass. Keep the garbage truck burning. P.D. Kevin, you are a",
            "start": 3186.56
        },
        {
            "text": "just butchered it. DJ Akademiks. Akademiks. Akademiks. Okay. Caesar Palifox, it's awesome having a birthday twin, Greg. Have a blast. Beat Ziggler's ass. Keep the garbage truck burning. P.D. Kevin, you are a great dead hooker animated series reference right there. SanManatee, this is all in caps, so I'll read it that way. \"Fuck Greg Miller. Your time of death has been set. Put that ProFlowers sponsorship to use and get some beautiful flowers for your gravestone. Tomorrow's the day. Prepare yourself.\" We'll see. I like that. That was creative. Whole bunch of people talking shit. They'll get their thing. SixOutOfTen, hey Tim, do you listen to Super Duper Kyle? Oh, yeah. Just thought you'd like them. Video for you to listen to later. Dude, shout out to Super Duper Kyle. That shit went from Zero to Hero so quick. He was just some underground shit. Now selling out shows all around the goddamn United States of America. And every day that he does a different stop on his tour, he puts up a tour hype video. Oh, wow. That",
            "start": 3239.28
        },
        {
            "text": "some underground shit. Now selling out shows all around the goddamn United States of America. And every day that he does a different stop on his tour, he puts up a tour hype video. Oh, wow. That is hyper than any hype video I've ever fucking made. No, it, they're so impressive. They are just, I'm going to try to find one. Keep reading these tips. SanManatee is back. \"I'm not fucking done. I'm going to wreck you so hard Kevin's grandpa will suddenly start liking the Jewish people. Colin will feel a little tickle in his bum from the new apartment. Love you, Greg. Happy birthday.\" Remember that old joke by your grandpa? Yeah, being a Nazi. Remember that one? Do you ever like it? No, not a big fan. Okay. And Seahawk17, my wife and I lost our best, best friend, Lola, on Tuesday night. Watching Kinda Funny has been getting me through. I'm assuming this is Lola here, Kev. I think so. Lola looks like a pug of some kind. Adorable. So are you showing it to the people? Yeah, okay. My screen doesn't show you showing it. So, uh,",
            "start": 3290.28
        },
        {
            "text": "me through. I'm assuming this is Lola here, Kev. I think so. Lola looks like a pug of some kind. Adorable. So are you showing it to the people? Yeah, okay. My screen doesn't show you showing it. So, uh, yeah, I'm sorry because we have the barbecue set up. Just making sure. M, I'm thinking about... We're sorry, Seahawk17 and Mrs. Seahawk17. Pell's best wishes are with you along with ours, obviously. Steven Osland, happy birthday, Greg. My birthday is Monday, so I'll be celebrating with you from San Diego this weekend. What drink should I have in your honor at Polite Provisions? Love you guys. Heart. If they sell the Troy Baker, get the Troy Baker or an Old Fashioned. You can't go wrong. Ask for Eric Castro. Say hi for us. Yes. Say no more tips. No more tips. PDPopOff, happy birthday, Greg. Love you, brother. Just paying your birthday tax as sorry for you as my birthday gift. Tell Jen congrats on the move. If she ever stops talking to Nick, if Nick ever stops hitting on her, I will. Nick's actually gone. I was wrong about that.",
            "start": 3340.4
        },
        {
            "text": "birthday tax as sorry for you as my birthday gift. Tell Jen congrats on the move. If she ever stops talking to Nick, if Nick ever stops hitting on her, I will. Nick's actually gone. I was wrong about that. She was, she was in the back cooking. I don't know. He was, I think he said he was done with this place and walked off. Uh, Jeni816, happy birthday, Greg. Can we get some Bongos? Yes, yes, yes. Uh, only for charity. I'm sorry. Only for charity. My apologies. But shout out 816. I assume is your area code. So Kansas City, what up? KC represent. SpideyGoesThwip. Hashtag, fuck Skippy. Fuck Skippy. Is that a thing we do? Skippy Peanut Butter. We don't like. What was that, Kev? What was that? I was testing this like little... Do it again. How you did it. I'm being teleported in. It's, I thought you like fading out like Back to the Future. But I like how you were big a second ago. Well, no, that was actually you. I had, oh, you fading me, me on me. Let me get some of that. Oh, was Greg look that there it is. No, that was me. Oh, Jesus. HGJY Greg,",
            "start": 3385.08
        },
        {
            "text": "but I like how you were big a second ago. Well, no, that was actually you. I had, oh, you fading me, me on me. Let me get some of that. Oh, was Greg look that there it is. No, that was me. Oh, Jesus. HGJY Greg, you share birthday with my late Grandma who would be 100 years old today. Happy birthday to both of you. Happy birthday to your late Grandma. Portell tipped, \"Hey Greg, I didn't want to do this face to face, but Jen is mine now. We complete one another and it's time for you to move on. The apartment is ours now. Don't make things awkward. Happy birthday though.\" Damn, Portell, it's cold. You misspelled Jen's name though, you idiot dog. Dumb dog. Fuck, fuck. Use your fucking dumbs. Beat you so bad when I get home tonight. Jesus. Take the belt off and just go to town in his weener dog ass. You know what I'm saying? No, I don't. GermanEfficiency says, \"Happy birthday, Greg. Great year to start working out, wouldn't you agree?\" Winky emoticon. Also at Tim, love and respect, love and respect. Shout out to Easy Allies. Oh, is that their",
            "start": 3430.52
        },
        {
            "text": "don't. GermanEfficiency says, \"Happy birthday, Greg. Great year to start working out, wouldn't you agree?\" Winky emoticon. Also at Tim, love and respect, love and respect. Shout out to Easy Allies. Oh, is that their thing? Yeah, smart. Uh, BathtubChub, happy birthday, Greggy. Will we get Mario Kart Hot Peppers for the Switch version? Should do it for number one contendership to face off against the champ at Kinda Funny Live 3. It's an idea. That is an idea. Maybe if Nick ever brings the belt back and stops dodging everybody, dodging. He doesn't put online ever for any reason. He always has an excuse why he's not defending it. He's a piece of shit. Tedro114, \"Glad you enjoyed the song. I'm currently working on an EP. When I'm ready, I want the best friends to lend their voices to one of the songs. I'll tip again with the sweet nasty deets at a later date.\" Song's great quality. Sounds great. Yeah, I want to talk to you about stuff 'cause I don't understand how to record shit. Oh, okay. And I may or may not want to record",
            "start": 3475.72
        },
        {
            "text": "with the sweet nasty Deets at a later date song's great quality sounds great yeah I want to talk to you about stuff cuz I don't understand how to record **** oh okay and I may or may not want to record stuff sounds like something you I do it came right back at you like Angry yeah I mean what were you what were you expecting there for stay down no final tip comes from Big Bad Beluga don't get to watch as much as I'd like because of my class schedule I'm going to be a journalist but I want to wish you Greg and one Mario Picato that Mario not Bros and I know I butchered your name, Mario sorry happy birthday love you both XOXO we love you I'm speaking for him I assume he loves you as well because Mario's the kind of guy who loves he's a lover I was talking **** about Portillo not have not using his thumbs yeah um God of Death 6 brings up a good point you don't need thumbs to type it's good point how do you do space Oh how do you do space I mean he can just Peck away the keyboard Kevin's making",
            "start": 3518.4
        },
        {
            "text": "thumbs yeah um God of Death 6 brings up a good point you don't need thumbs to type it's good point how do you do space Oh how do you do space I mean he can just Peck away the keyboard Kevin's making good points Kevin I found the video I'm talking about it's at the bottom of the Scratch Pad uh I don't know what the **** you're talking about but yeah I'll get oh my God don't you just hate him no no it wasn't you at all oh it was there's a breaking there's breaking news from the chat what Entertainment Weekly says McG no longer directing Masters of the Universe David S. Goyer is writing the He-Man reboot now scheduled for a 2019 release who cares good point so He-Man sucks too so here's the thing this **** every night of his tour makes a hype video like this about that leg of the tour and they have this drone and they the way that they edit I just don't even I can't wrap my head around it I don't know what they're doing go for it Kev yeah want me back I know they want me back I",
            "start": 3559.68
        },
        {
            "text": "they have this drone and they the way that they edit I just don't even I can't wrap my head around it I don't know what they're doing go for it Kev yeah want me back I know they want me back I see them down in out know they me my team my bar we had actually push the crowd back because we getting ready to break the **** floor yeah no we should break the floor we should stay it's great news **** sick he broke the floor hell Grimecraft ass **** going shut the anyways every day they **** do different hype videos and they're so sick shout out to Super Duper Kyle send him some sweet nasty love from your boys over here Kinda Funny tell him he's invited to Kinda Funny Live 3 June 3rd San Francisco cuz he's H he's going to get there and be like oh I guess this is okay he's going to break the floor and then it's on us you think Nick Scarpino is going to like that I think we're on the first floor so it's not he's hell tight and he has a song called sex and Super Smash Bros",
            "start": 3606.32
        },
        {
            "text": "going to break the floor and then it's on us you think Nick Scarpino is going to like that I think we're on the first floor so it's not he's hell tight and he has a song called sex and Super Smash Bros so obviously six out of 10 says sex and Super Smash Bros is what brought me into him me too it's a song about having sex sex and Super Smash Bros uh we're jumping the chat answer questions comments and concerns uh Sly and Frank says Greg if you destroy Zyger on Friday I will stop being a lazy ass and start using my Twitch Prime well then I mean you could just get ahead of it right now and do it cuz Zyger dies tomorrow it's over Zyger dies tomorrow T114 says Tim I do audio engineering for a living I'd love to do something together DM me when whenever okay that's the guy with the song okay yeah are we still doing that other thing he never stepped up or not that I've seen who the person it'll have to be tomorrow yeah I'll see I'll see everybody tomorrow oh I mean we just play if you",
            "start": 3678.6
        },
        {
            "text": "yeah are we still doing that other thing he never stepped up or not that I've seen who the person it'll have to be tomorrow yeah I'll see I'll see everybody tomorrow oh I mean we just play if you want no it's it's more fun be this kid ass gotcha uh T-JoeB13 Greg how do you feel about Persona 5's restriction I how do you feel about Atlus's Persona 5 restrictions now that they've been relaxed I've always agreed with them in the first place because I don't want spoilers in any people's YouTube I didn't see that they did him I predicted that that was going to happen obviously that they're going to let up on this it's the right movie to do they should have done it a long time ago that was a negative Cloud over a **** amazing game they should have got in front of that a long time ago um Dark Angel 1010 says Greg should Nick be stripped of the Nintendo World Championship if he doesn't defend it within 30 days I think he should but somehow the is the guy who makes all the rules about the",
            "start": 3723.28
        },
        {
            "text": "Angel 1010 says Greg should Nick be stripped of the Nintendo World Championship if he doesn't defend it within 30 days I think he should but somehow the is the guy who makes all the rules about the belt so nobody **** knows what's going to happen that's not true we make the rules and that's not part of the rules sorry thank you thank you I guess people asking what the hashtag is for the shirt design it is #KFLGames oh we said a different hashtag last time we was on so that was good of us I think that we we **** up the hashtags okay great how about this #AndyCortez is not Kevin Coello no Steven Cole says Greg what's one thing you want to accomplish before you turn 35 The Rock on the GameOverGreggy-ation yes yes yes brother um O King Chadley Greg can we get a Gen Chad I would say yeah she needs to do the Chad voice but she's back there cooking doing crazy she back there cooking uh MojoWhat says Greg how is Portillo adjusting to the new roommate Genevieve St-Onge uh they are two",
            "start": 3766.8
        },
        {
            "text": "say yeah she needs to do the Chad voice but she's back there cooking doing crazy she back there cooking uh MojoWhat says Greg how is Portillo adjusting to the new roommate Genevieve St-Onge uh they are two peas in a pod he's very happy I he's been a depressed little dog for a long time his little tail doing his little thing he does that yeah they cuddle up he sleeps on her all the time sleeps on me uh SpecsaverSpice Greg what were you doing at IGN uh no yesterday IGN came here and filmed with us it was something we're doing for that other video that you had gone and done with Brian and Max it was the the video that you guys might have seen of me and Nick in the sand dunes in sand buggies uh they that video supposedly is going live by the end of this month so this month's almost over it's going to be great going to be great SutterSaidSuiters8 it's Kinda Funny going to PAX Australia this year no we went to RTX Australia RTX Sydney but that was our thing now we got to do some work around",
            "start": 3821.2
        },
        {
            "text": "to be great going to be great SutterSaidSuiters8 it's Kinda Funny going to PAX Australia this year no we went to RTX Australia RTX Sydney but that was our thing now we got to do some work around here right Kev yep yep oh I'm gonna jump in the chat or sub only chat I do that RobotLovesMe Tim and Greg is there a GoG episode with the origin and story of Gia and Tim and Greg and Jen if so which number and for God's sake why not I mean there yes to both of those but not together isn't there an exclusive where you and G talk about yeah like we've talked about the Kinda Honeys our origin your origin has been discussed on it's never been a topic yeah but Saturday's Q&A that goes live teases when I might talk about it as a topic I haven't played Mario Kart with the Pro Controller yet you want to do that today probably yeah you you want me to take you the woodshed here I think we have a busy did we do we could do it right here though like you know what I mean you want to do right",
            "start": 3866.36
        },
        {
            "text": "you want to do that today probably yeah you you want me to take you the woodshed here I think we have a busy did we do we could do it right here though like you know what I mean you want to do right **** yeah get it booted up and we'll do Tim and me do a grand a race here a race to end it all coward um this you want to play two yeah all right **** ass get in here you playing too yeah but I'm really bad so have fun just have some fun with here right is that possible what I could just play if we have some a third no come here because what it would be is that no no I mean you can play with us I have to get my Pro Controller gotcha all right guys we're we're to end it with some Mario Kart here little bit also the barbecue stream are we is anything happening out there I have no idea I've got no updates yeah I told you she's working on in the back well that's not out there she's got a prep it **** oh no now see Jesus people SP I it's fun that we did the Patreon Q&A thing before this",
            "start": 3919.56
        },
        {
            "text": "got no updates yeah I told you she's working on in the back well that's not out there she's got a prep it **** oh no now see Jesus people SP I it's fun that we did the Patreon Q&A thing before this you know the video but they're spoiling their own questions Panut043 says Greg can can you Milly Rock Greg and answer is yes I can now that you've taught me how to Milly Rock but I'm not ready to Milly Rock until you know somebody else is in control right now we're going to need to fix this TV Kev it's all out of whack what's wrong with it the colors are just off okay well this is why we're doing beta testing uh somebody else is player one I'm not Andy I think you might be you **** us yeah you **** us uh Kev do you want to come play uh yeah give me I'm sorry I got to set this up yeah that's I'll keep doing tips then Saturday Night Live special guest uh can I read a new sub that was not mentioned two days ago on Reddit Omni Bushido what up my dude Omni Bushido whoa I want to put you",
            "start": 3965.28
        },
        {
            "text": "I'll keep doing tips then Saturday Night Live special guest uh can I read a new sub that was not mentioned two days ago on Reddit Omni Bushido what up my dude Omni Bushido whoa I want to put you guys in the middle Andy can you stand where the balloon is thank you keep him here says we need a GoG a new GoG toping on what comics you're reading hopefully we'll have a fixed for that soon why do they need it all right how do I how do I connect to this someone teach me you you pop off your you're going to have to just get a controller and come play oh I don't I think Wireless Play I'm Not player one Wireless Play I think only allows for me to be okay well all right this is why you shouldn't be player one back all the way up Andy why don't you guys just switch cuz I can do it once that happens I can pop and do this all right give me two seconds yeah see Wireless Play I we could do but we only with two what so I guess if you so you and I could play Wireless Play and have them",
            "start": 4011.84
        },
        {
            "text": "that happens I can pop and do this all right give me two seconds yeah see Wireless Play I we could do but we only with two what so I guess if you so you and I could play Wireless Play and have them join on their switches or everybody can just man up and come over here and we play on the let's just do that oh no yeah I know you you unplug the whole thing good **** Toad's helmet looked in that one scene did you see that I got your controllers okay now this is a new this is a new one I've been running with this year the Wiggler Kart of course my my my cart finally unlocked it took me forever Dry Bones of course I'm big old Dry Bones but I put on uh sponge wheels for crazy acceleration not that crazy high speed though something I get to test out here with you boys going be this little cutie little L. Kev you don't want to come be on camera in a second sorry I'm just making sure that this is all working correctly okay it's my birthday we're going have a barbecue playing some Mario Kart",
            "start": 4072.48
        },
        {
            "text": "cutie little L. Kev you don't want to come be on camera in a second sorry I'm just making sure that this is all working correctly okay it's my birthday we're going have a barbecue playing some Mario Kart what a **** day baby I don't understand Jesus why we can't be lovers things AR getting out of out we got to buy we got to buy more Pro Controllers I mean like the delay on this is ridiculous are you guys getting that too yeah the TV is not set right oh the TV's delayed yeah really mhm need to be like on game mode or whatever yeah hey it's all good no it's not cuz this is people to think we're bad who cares I care I don't care this is all a game about Precision Kevin fix the TV whoa whoa we'll make the bed higher now you know what I mean these dumb **** kids do you feel like there's an an enormous amount of well there you got to do a whole not enormous there it feels like there is you got to Google best settings for then this TV and then figure out what Rings.com all right",
            "start": 4122.8
        },
        {
            "text": "an an enormous amount of well there you got to do a whole not enormous there it feels like there is you got to Google best settings for then this TV and then figure out what Rings.com all right everybody we're doing a trial run here on this thing we'll see what we got there's massive input lag is it massive I mean I was getting like half a second okay but is it also because you're your controller is trying to communicate through the TV to the switch I doubt what a **** St oh no no you can't do it now happy birthday put the cart happy birthday dear Happy Birthday to You yay I have nothing left to wish for cuz it's all here wish for a I love you guys **** yeah y two t Greggy I got you guys all right I'm going to stomp your **** face in get milk well it's just me thank you guys thanks for making this life possible milk had some she did buy milk thinking you so does three small kindergarten style cartons of milk those are my favorite kind I you really big straws to put in you are",
            "start": 4180.6
        },
        {
            "text": "for making this life possible milk had some she did buy milk thinking you so does three small kindergarten style cartons of milk those are my favorite kind I you really big straws to put in you are lactose intolerant you don't need shut up shut up how do you go how do you go shut up how do you go shut up you've played yeah but I don't remember oh yeah no there's I guess yeah this is bad yeah this is really bad I'm killing oh man Greg so you are Dry Bones oh 344 a Dry Bones you know what they say man no hit 34 and die live to war oh yeah do say that that is something they did say a lot of what is happening so what does the yellow antenna mean cuz oh who did this oh Kevin it just got disconnected I was saying there's something wrong nobody was listening you're you're get a Pro Controller Kevin can we what are you doing Kevin your your L is disconnected your left your left is disconnected you got to sync it or whatever go close to it or some **** I forget I think you might have",
            "start": 4262.16
        },
        {
            "text": "Kevin can we what are you doing Kevin your your L is disconnected your left your left is disconnected you got to sync it or whatever go close to it or some **** I forget I think you might have to resync it there it goes no there it is there we go I'm gonna just sit down here sure that sounds good God damn it now I'm just on W yeah this is a little better for me so what is Jen going to make oh no like chicken nuggets I think she's making steak French delicacy some shrimp stuff some crazy salad yeah holy **** she's like she's like legit like this isn't our normal **** barbecues but we're putting frozen pizzas out there I **** this controller my God is the lag bad uh no the lag's better but like sometimes the steering just goes out I think the left is just random that's the yeah that's the thing with the **** oh come on I'm already doing Tim how's your lag down there it's pretty bad yeah I'm accounting for it I'd probably be in like I will **** I will oh I will lose",
            "start": 4330.44
        },
        {
            "text": "yeah that's the thing with the **** oh come on I'm already doing Tim how's your lag down there it's pretty bad yeah I'm accounting for it I'd probably be in like I will **** I will oh I will lose my goddamn mind I'm a bullet I don't like any of this yeah this Splatman I also just feel like a **** you these **** Kuma just wandering in the street get out the way where mother what are they doing where's the regulation on this track oh come on **** goddamn what am I supposed to do that's all I have guys **** Blue Shell yeah that's for me thanks Kev hey no worries you're a real team player **** oh son **** hell damn it Kevin that's on you this second place finish is on you Stray Van why is Kevin not drifting I don't know how to play damn it we got to troubleshoot this TV yeah that's why I wanted to test it out today right now smart I mean you want to keep playing on your shit I mean I'm not during the stream or whatever yeah no we should stop no more no more",
            "start": 4401.32
        },
        {
            "text": "this TV yeah that's why I wanted to test it out today right now smart I mean you want to keep playing on your shit I mean I'm not during the stream or whatever yeah no we should stop no more no more are we going to keep going or well I got to read subs still obviously oh yeah it's what should we stop this yeah yeah sure yeah we stop wait are we really not uh we're not we're streaming the barbecue I'm fine with streaming the barbecue I don't care it's your call okay sure still read subs though well we usually do that out there that's why I was concerned I see your I'm letting I'm letting non subs back in too that was good game good game good game no that game sucked that was awful stupid lag sorry about all right you'll fix it though right Kevin I I'll sure I'll try please fix it Kevin fix it fix it all right so we're doing subs out there yeah we're going to go hang out Genevieve she already cooking out there stuff happening out there it doesn't look like it see I don't that's the whole",
            "start": 4479.68
        },
        {
            "text": "it fix it all right so we're doing subs out there yeah we're going to go hang out Genevieve she already cooking out there stuff happening out there it doesn't look like it see I don't that's the whole thing it's not our normal barbecue shenanigans you want to see what it looks like yeah show me what's happened outside hold on oh my God there's too **** buts but I didn't have to do this to myself you know what I mean sure that's just it yeah that's not that's not a fullblown barbecue yet give me a second I'll go find out what's happen check in with I like that he uses it the same voice you know yeah man we got too many subs today too many subs I'm going to start reading through them too many subs too many subs BigN5 sorry it starts at 11:16 happy birthday Greg Amazon screwed up my Mario Kart 8 order so I won't be getting it until Tuesday now instead of kicking your ass in Mario Kart guess I'll have to do is Cheer you on go get that money Greg I will uh GilderGilderFrontier Fral",
            "start": 4522.08
        },
        {
            "text": "Kart 8 order so I won't be getting it until Tuesday now instead of kicking your ass in Mario Kart guess I'll have to do is Cheer you on go get that money Greg I will uh GilderGilderFrontier Fralsto love you guys Happy Birthday, Greg you loud wonderful monster thank you keep him here the great mate thinking back to PAX when Greg got beat by The Champ gives me hope for my myself tomorrow you'll need it **** what's the update from Genevieve St-Onge uh she is about to go out there having Cool Greg helper okay cool I love whenever there's free food Cool Greg's here yeah he knows what's up he knows what's up I appreciate that that's when he gets the call hey Greg you want to come out for food can I have your power CaptainTutu says happy birthday Greg you Dashing Young devil you can't wait to play you in Mario Kart tomorrow reminding the best friends that I'll be streaming Drawn to Death and giving away mystery boxes over a KF Best Friends Channel tonight at 5:00 p.m. Pacific tonight uh keep",
            "start": 4572.2
        },
        {
            "text": "you in Mario Kart tomorrow reminding the best friends that I'll be streaming Drawn to Death and giving away mystery boxes over a KF Best Friends Channel tonight at 5:00 p.m. Pacific tonight uh keep him here friends better than Seinfeld F***Matter31 shout out if you're Chicago Sub or Chicago 31 ApocalypseWillie uh NingPoopScoopNingPoopScoop GreedoHB or G oh here he spells it out G-Dub parentheses you always seem to have trouble with my name cuz it's dumb GDB happy birthday Greg I definitely think you need to use your it's my birthday powers to demand that Nick puts the Nintendo World Championship on the line of Mario Kart Nick will never do it he's a coward he's coward I didn't he was here Sir Alex happy birthday Greg sending you early congratulations and all the ass beatings you're going to hand out tomorrow winky emoticon thank you uh Beer happy birthday Greg all to best thank you uh NoLano386 happy birthday Greg I was afraid I wouldn't be able to play Mario Kart with",
            "start": 4613.24
        },
        {
            "text": "you're going to hand out tomorrow winky emoticon thank you uh Beer happy birthday Greg all to best thank you uh NoLano386 happy birthday Greg I was afraid I wouldn't be able to play Mario Kart with you but then thankfully I got fired Jesus well I'm looking forward to playing you tomorrow you got a lot of free time look at there does Genevieve St-Onge know she's on camera uh no is she's doing inappropriate **** oh you never know well it looks like she's about to blow it up so go help her and let her know what's happening is that life uh DarkClinton keep rocking it guys see on Mario Kart 8 soon **** yeah you will Jose_FearWithGlee my name is Jose_FearWithGlee Greg is your switch bending too no my switch has not been bending uh T1PandaColbyJack4 Shockwave41 uh Peter Petrov here's here is more Amazon's money thank you OST uh OSTim amazed you've lasted 34 years Greg happy birthday you big Beautiful Bastard thank you true uh OST again amazed you've lasted 34 years Greg okay",
            "start": 4661.92
        },
        {
            "text": "here is more Amazon's money thank you OST uh OSTim amazed you've lasted 34 years Greg happy birthday you big Beautiful Bastard thank you true uh OST again amazed you've lasted 34 years Greg okay you subbed twice thank you uh KobeJack4 subbed again what's happening uh NX happy birthday Greg good luck tomorrow on the Mario Kart uh and let there be no #BendOverGreggy exactly Bend Over Greggy SuperNintendoSmoothWhiskey just got a job offer in My Chosen field unfortunately that means no more watching live for me I'm miss hanging with you and everybody else no big deal remember goes up KindaFunny.com and podcast services around the globe a lot of double subs I don't know how that's happening SmoothWhiskey again MatPlays happy birthday Greg good luck oh oh so SmoothWhiskey subscribed via Twitch Prime for four months SmoothWhiskey subscribed at tier one for four months that tiered sub system oh did did we get I talked to Joey I thought we weren't doing it maybe we did",
            "start": 4714.76
        },
        {
            "text": "subscribed via Twitch Prime for four months SmoothWhiskey subscribed at tier one for four months that tiered sub system oh did did we get I talked to Joey I thought we weren't doing it maybe we did interesting I don't know if any let us know in the chat or something I guess if you're seeing tiered subs and if so give us more money you I'm just kidding do what you got to do no big deal uh MatPlays happy birthday Greg good luck in the races tomorrow uh KingBaconator happy birthday Greg I'm moving in two days and I can't wait to get better internet so I can see your beautiful faces in **** HD hell yeah SanoWest years in and I'm never looking back happy birthday Greg see you on Friday amigo I'm worried SanoWest is really good at games and he's playing it's rough it's GNA be great uh DyckDyssWTrick001 KuroKuma woo excited for Kinda Funny Live 3 TysonRhino happy birthday Greg or Greg happy birthday I see a lot of people want to **** you up tomorrow but not a lot are",
            "start": 4765.12
        },
        {
            "text": "supporting you I'm in your corner **** up Zyger and **** up that another no name hack you got this brother I'm going to **** some kids up tomorrow yeah uh BR80 Happy Birthday, Greg uh KersteinHapBirthGragHeart uh JessGur9 Feliz Cumpleaños, Señor Greg Kevin's no longer here to translate that I don't know I can't help you uh RedSEF happy birthday Greg Jen can I get some food no you may not it's all for us look at her out there trying to figure everything out try not to burn her hair Kevin looking his hand whipping that hair back and forth I whip my hair back and forth I whip my hair back got the salt on it oh you the I'm I'm not going to be out there I'm going back I got to do work I'm turning it on and unmuting um IotaMiguTrollEyes happy birthday Greg this week's GoG was great",
            "start": 4807.96
        },
        {
            "text": "got the salt on it oh you the I'm I'm not going to be out there I'm going back I got to do work I'm turning it on and unmuting um Iota Migu Troll Eyes happy birthday Greg this week's GoG was great thank you we I think we've been on a roll with GoGs and Gamescast man they've been fantastic yeah Alana's coming up tomorrow for users yep she she's making that uh corn with the cheese and the spices on it I don't even know what you're talking about but what is that Papito or something no idea **** dude she's like y all she's trying we all have fast can I take off the other mic then yeah cuz I got too much okay bye guys bye bye Tim bye C don't die Darkov happy birthday Greggy Mike Azir55 Huggy Homer uh TJoB13 can't believe in four months already here's do another great four months of entertainment thanks for helping me filter out all the asses at work all the **** at work probably keep up the good work I'll set it all up yeah Panther84 John Caya seven months of Twitch",
            "start": 4858.2
        },
        {
            "text": "of entertainment thanks for helping me filter out all the asses at work all the **** at work probably keep up the good work I'll set it all up yeah Panther84 John Caya seven months of Twitch Prime happy birthday Greg love what you guys do Vorus uh Vduet Tainted Sweets happy birthday Greg hope you like your chibi drawing where was the chibi drawing did he I've missed this I will check my email if it's on the internet somewhere I'm sure it'll be fun hold let me send off the game too for Tate Fisher Faner who won today and then you won exclamation mark sent that's done don't this guy up yep I'm up you're good I'm running they can hear you yep so that's all the subs for right now oh wait no one more here a Cular Guy a Cular Guy also sub um so I'm going to go out there now and talk and stream I guess for a little bit yeah see what's up sounds good I'll bring the computer do you want a power cord for it I will need a power cord if I bring my computer actually **** it I'll just here's",
            "start": 4923.56
        },
        {
            "text": "I guess for a little bit yeah see what's up sounds good I'll bring the computer do you want a power cord for it I will need a power cord if I bring my computer actually **** it I'll just here's the thing we already called tips we already called Subs we're moving to Twitch uh chat on the phone nice nice all right I'm going to switch over solely to the BBQ cam okay I'll be there in one second guys boom there it is I'm going to go out there and talk to Jen she's gone there's no one there she's right there everyone's gone oh she's back um can you make sure when you're not around here to mute your mic yep of course I don't want any our secrets getting out our luscious luscious Secrets is it oh good call then huh we're coming out we're outside you hear this the can finally ran out huh yeah now we got a refill tank and we'll have a backup one good thinking good thank you work here we go get this chat only and here we are we're out here I am miked you're going to be miked the rest of the",
            "start": 4981.4
        },
        {
            "text": "now we got a refill tank and we'll have a backup one good thinking good thank you work here we go get this chat only and here we are we're out here I am miked you're going to be miked the rest of the way do you want to be miked complain no are you sure you're but they can hear you keep in mind yeah so don't don't think they can't hear you hi oh you got some butter lettuce oh I love some butter lettuce do you know what they're called in Canada I don't know B lettuce Boston lettuce okay let's close this got okay that's good Chan sure I was trying to size up the frame oh cuz then I can put there or why you hiding cuz it's sunny and I'm that's girls they all going to hear the kissing sound that good yeah give him the kissing yeah look they're in love oh it's hot **** yeah she loves it don't worry she loves it I appreciate that you guys got a new Kev smart if I came here and give you guys it won't happen that fast there was one missing you let it out no I I held them in so we're come",
            "start": 5024.16
        },
        {
            "text": "worry she loves it I appreciate that you guys got a new Kev smart if I came here and give you guys it won't happen that fast there was one missing you let it out no I I held them in so we're come here and tell us what all you cooking today cuz you got crazy stuff I made a garlic and rosemary focaccia okay what's that this is on can you turn on so it's not like leaking gas or anything that's close enough don't don't take it too close the wall all right are we fixed is it fixed Cool Greg Wrangle these wires for me okay this is you need you want you want to crank it downan no no no no no grab them and get ready I'm going to start moving did you want this one on cuz I turned it on I'll step back you take over it's not working yeah it is yeah yeah you ready yeah they're all lit okay you're all set that one's on remember that I don't know if you want it on yeah why would I not want it on something's wrong with the mic Kevin Kevin go fix the audio Kevin audio audio audio what is that okay hold on",
            "start": 5079.44
        },
        {
            "text": "one's on remember that I don't know if you want it on yeah why would I not want it on something's wrong with the mic Kevin Kevin go fix the audio Kevin audio audio audio what is that okay hold on thank you okay I like that you can't see temperature in there oh yeah we Kevin brought it you know a discount yeah so good now they say oh what oh yeah I want to hear yeah so what are you making here which Kevin told **** on it cuz he said that the actual name for it is focaccia oh you're making focaccia bread yeah I guess okay sure focaccias focaccias uh I made some Chimichurri for the the steak **** yes you did **** yes you did and I'm going to make a uh tart chicken breast salad for a tart chicken breast salad tart it's lemon honey um what did I put in there shallot G garlic lemon and uh I'm going to make some roasted corn in the cup with queso queso fresco oh yeah okay what is this this is like the shrimp oh good Andy is super excited about the shrimp shrimp Andy love shrimp okay it's going to be a",
            "start": 5155.0
        },
        {
            "text": "some roasted corn in the cup with queso queso fresco oh yeah okay what is this this is like the shrimp oh good Andy is super excited about the shrimp shrimp Andy love shrimp okay it's going to be a grilled halloumi and shrimp salad yeah you got that halloumi cheese yeah now have you Haven you ever heard of this halloumi cheese no you grill it and you eat it and it tastes so **** amazing yeah salty as the day is long so good though is that all the stuff we're showing off yeah no ribs though huh no she's stepping it up I'm K look at all the flank steak you got Cool Greg can we get a power cord yeah I'm not sure it's uh sorry I'm not sure it's working what is it the the grill yeah it is but I can't see the FL oh this side I can see yeah you got to you got to get low you got to look cuz the heat it's not heating up move yeah what's going on we scared about this she was just saying I it's not like super hot well you got to turn up higher then it's all yeah they're all on we we're not seeing",
            "start": 5216.12
        },
        {
            "text": "it's not heating up move yeah what's going on we scared about this she was just saying I it's not like super hot well you got to turn up higher then it's all yeah they're all on we we're not seeing the yeah that is a big part of grilling is not opening it up all the time no no no no no no there's like not enough going to it oh did you not open up the valve all the way oh you guys switch it out right no yeah I did though it's j right here same love my life we're going to go see Guardians tonight with Big Tim Big Tim did you no no Big G and actually I she's Little G I'm Big G oh we decided on that a while back you weren't here you were gone for a long time yeah I got like pizza dough it happens how's P good it was very sad sure I spend all day with him and now no not today should have brought them I had my AR I had a balloon I had two bags of grocery yeah I couldn't bring P he excit for all this oh now one's working it smells like burning burning yeah lubing it up keeping it nice and",
            "start": 5267.4
        },
        {
            "text": "them I had my AR I had a balloon I had two bags of grocery yeah I couldn't bring P he excit for all this oh now one's working it smells like burning burning yeah lubing it up keeping it nice and lubed up I am so stoked look at all this you did something here with the corn yeah so I'm going to grill that and put this mix on it which is sour cream uh Mayo all right chili powder uh lemon and queso fresco so how you doing happy birthday thank you I'm doing good 37 huh yeah old man day for you I think he's 34 if we're being honest yeah I should tied my hair up this now what am I allowed to just eat a little of right nowes yeah good job all right yeah I'm not going to touch those all right **** it I'll have one they're going to go in the salad there's a salad yeah there's two salads actually what's going on here it's the Chimichurri sauce ooh hell yeah m hm I we ran out of oil oil we did sorry so what are you doing right now you just waiting waiting",
            "start": 5320.6
        },
        {
            "text": "salad yeah there's two salads actually what's going on here it's the Chimichurri sauce ooh hell yeah m hm I we ran out of oil oil we did sorry so what are you doing right now you just waiting waiting there's more there I should have probably done this when I got here sure sure it's really disappointing remember when I was like you should get here super early and do it and then you're like I'll get here when I get here I was like all right I'm going I almost called an offer to pick you guys up cuz I was right by uh your house around 8:30 she had so much prep work to do too well I was like oh it's too early it actually took me an hour okay IED some quality garbage American TV what'd you watch yeah Fixer Upper it's actually can you look for the Canon wire the power cord for that thing away from my 600-lb it should be in the case in you're done with my 600-lb Life I can't do it anymore gota it's I can't do it anymore yeah don't watch that **** I I mean it's the first time I have TLC what",
            "start": 5385.68
        },
        {
            "text": "my 600-lb it should be in the case in you're done with my 600-lb Life I can't do it anymore gota it's I can't do it anymore yeah don't watch that **** I I mean it's the first time I have TLC what can I do ShadowNextGen says Kevin is not about healthy that healthy eating you get it team fat all the way right Bud hell yeah if you can make healthy food it's team fat wory I'll eat that uh Chad the Piranha Plant says Greg what yeah it's out again yeah what's happening I don't know did you open it or close it I I opened it the I think the chicken in the sunlight great way to get salmonella everybody did you do something to it now no nothing's been done to it no barbecue today there it goes the W did you turn it too low and like the wind knocked it out I mean they're all on high no no I was talking about before now you turned it off now that's off well those these are on though okay but didn't you have more than that on I they were all at like high what's up this one no all right it I",
            "start": 5431.52
        },
        {
            "text": "talking about before now you turned it off now that's off well those these are on though okay but didn't you have more than that on I they were all at like high what's up this one no all right it I got it just go do your sorry I'll help you in a second I don't I know I got it just let me do what if we all explode we're not going to explode I think you just turned it too low and I think the wind blew I did not I just saw them all down there honey Kevin well that's fine I'm just letting you know what temperature where do you want them high okay they need the Heat going up hi what you want to talk about I don't know let's see what chat wants to talk about what do you want to talk about I want to cook cuz I have a 1:30 appointment yeah you're not going to make it like I told you like I warned you that these were bad plans you were making and you should come here early but you did not listen to me I did get here early shake the tank a little and tap the valve no no RTJamJamerson honestly",
            "start": 5495.44
        },
        {
            "text": "you that these were bad plans you were making and you should come here early but you did not listen to me I did get here early shake the tank a little and tap the valve no no RTJamJamerson honestly I'm just here for Jen at this point uh so is it going again yeah or is it yep still going so you heat it up first huh yeah we should just throw the meat on top once we turn it on it's not true that's not at all really I let it heat yeah oh I I don't know man yeah it's like an oven would you see I think it went out again is it just too windy what happened here is this a pretzel well this is can we push it in deeper right it is can we push yeah sorry sorry Sor sorry uh do you want the mic uh sorry let me move the hose not touch touch them who what'd you do didn't explode your mouth expl my mouth Mickey likes it Uncle Mickey likes it no we've never had it this far out so maybe the wind we out of propane yeah we were this morning I went and got another one yeah I was going to say were you",
            "start": 5544.96
        },
        {
            "text": "mouth Mickey likes it Uncle Mickey likes it no we've never had it this far out so maybe the wind we out of propane yeah we were this morning I went and got another one yeah I was going to say were you really out of propane or was it too windy maybe it's the wind I mean yeah I mean I can hear little rocks in there I don't know how we're going again but I mean I think there's still some left if you move it around and you can hear sand in there that's probably not it sounds empty I mean I can put it back in eventually we do throw it up in the air someone shoot with a gun do that I like I like the way you think Scarpino should we buy a shotgun company shotgun what **** peasants handguns we use handun H so fun you shot a handgun too right I like guns I'm you got it I don't I don't this is feels like too much why it's not pressure um stop eating those tomatoes you said come hungry we're all hungry it's going to take 5 minutes the longest thing is a chicken had a lovely conversation with",
            "start": 5596.52
        },
        {
            "text": "like too much why it's not pressure um stop eating those tomatoes you said come hungry we're all hungry it's going to take 5 minutes the longest thing is a chicken had a lovely conversation with people the bakery yeah about that flour oh yeah you're like what and I was like you're a baker right like yeah can I have flour I'm like yeah can I have some of it like I don't understand you need a flour for your I got the pizza of dough that I made and then now it's so this just like comes up Rises man how crazy is that you move it over 5 in I didn't we were just beyond the wall that was the thing what a genius move putting in the corner here thought it would burn down the house that first day now it's saving the day still might burn down the house one day you know fingers crossed whoa wait what no I mean that I won't that I won't okay okay thr the are you slack yet yes I have and Andy showed me how to GIF things so now you're all going to get lots of dirty pictures oh Lord you putting some",
            "start": 5657.96
        },
        {
            "text": "no I mean that I won't that I won't okay okay thr the are you slack yet yes I have and Andy showed me how to GIF things so now you're all going to get lots of dirty pictures oh Lord you putting some olive oil on there don't say that you doing some Pro maneuvering in here you be have S they teaching you they teaching you how to grill up there K comments even in the I'm on uh yeah he's uh seriously Jason says flour or Coke W both question mark the world's not enough you're going to put that on the going to put on the like that yeah I'm going to test it out first in case the yeah I've seen pictures of people doing this and it being bad on the gr can you uh question oh maybe not actually I don't know might need a um the other yeah the other bacon come on now this house oh we have aluminum foil does that help aluminum foil do it all right get out of my way get out of my way Nick don't touch my **** hey you're the one who can't figure out how to do it you're blowing up the house I don't",
            "start": 5704.56
        },
        {
            "text": "does that help aluminum foil do it all right get out of my way get out of my way Nick don't touch my **** hey you're the one who can't figure out how to do it you're blowing up the house I don't care Jes she she came here and she was like I can't believe hey Kev bring me a beer she's like I can't believe how little you guys have in this place we're dudes a there's no oven yeah and C we're dudes dudes up now I know every time I cook here I'm like oh man I need to make I started making a list with Andy of things I need but that doesn't mean I've actually ordered them or done anything Toms oven stove top oh man this chicken already smells good baby but it's not hot enough it's cuz you left it open forever we got one of those girls that has the stove top we just we have a stove top Yeah there yeah it's right there RTJamerson is this what man's planing is you standing in a kitchen with a woman telling her what to do yes look at it I'm not going to sit here and talk about gender roles in",
            "start": 5749.88
        },
        {
            "text": "yeah it's right there RTJamerson is this what man's planing is you standing in a kitchen with a woman telling her what to do yes look at it I'm not going to sit here and talk about gender roles in the household Chad the Piranha Plant says Greg almost said what I asked when will you be doing the reaction to the movie Guardians of the Galaxy I don't know did you guys figure that out yeah tonight right no not tonight we still are you going to see it again with us when we cuz we booked those sck yeah probably yeah Alamo or no I forget where we booked them I feel like we should just do it when it's closer but just want to be part of it smart hey thanks I think your milk might have got left out you might want to put it in the fridge uh milk doesn't go bad I don't mean bad I mean if you want cold all you're making a lot of sense I'll put in how many beers we got we need more talking to Kevin's chest and answer questions sure damn how tall is Greg he's like 6'3 how tall are you Greg 63 yeah",
            "start": 5795.08
        },
        {
            "text": "all you're making a lot of sense I'll put in how many beers we got we need more talking to Kevin's chest and answer questions sure damn how tall is Greg he's like 6'3 how tall are you Greg 63 yeah he's 6'3 he's really tall uh holy cow it's Chris says Nick and Greg should wrestle nope we'll both get hurt both old true and neither of us are athletic yep uh MojoWhat says tell Nick I said hi hello I really want to try some of this stuff Ryland Prince says Nick give me a butthole butthole and people are asking what the temperature is outside what do you think it's like 65 yeah high 60 maybe like 68 your glasses look cool though uh uh people would like you to give Greg a spanking when he gets back very American thing yeah it's very he needs to take his pants down at least halfway though we have to watch the in closet yep just keeping out and you'll you're going to know we're there because you'll hear sounds but he won't you know what I mean don't look at us don't acknowledge that we're",
            "start": 5844.12
        },
        {
            "text": "have to watch the in closet yep just keeping out and you'll you're going to know we're there because you'll hear sounds but he won't you know what I mean don't look at us don't acknowledge that we're there flip out these the last two beers flip out I I never think we drink that much but then we're just always out of beer so you want do you want the your final milk set yes please Zigger1337 says do a push try just let try try it's mine so like don't play with it too long it's getting cold e no no that's what he likes uh why is is there no label yeah cuz it was made by a friend oh you want do you want it yeah no no is it the only one no it's good more go get more you can't get more that are sent from Texas from a fan named Tyson Rhino try it give it taste give a taste everyone's **** putting their mouths on it I don't actually care I don't actually care no it's really really oh Jesus why do you have to get your lips on there like that did you see that yeah right good job no Nick",
            "start": 5902.12
        },
        {
            "text": "putting their mouths on it I don't actually care I don't actually care no it's really really oh Jesus why do you have to get your lips on there like that did you see that yeah right good job no Nick Rhino remember he licked it heck at yeah I'm so going to drink it you know I'm going to drink it God that's good never mind mind happy birthday thank you from the chat from the chat happy birthday from the chat too they told me uh that's it you need to get your pets no are you guys spanking stuff totally Mo like full on ass cheeks out yesterday yeah I looked away really hard well we're at that stage of Our Lives it was while you guys were doing the exclusive and I just started **** laughing what I can't wait till we get to the part where balls come out that's that's when we've reverted back to that already happened cuz Nick I mean your brother that's true Matt has showed you his balls I have not done that yet I'm trying to that's the last shred of professionalism I have uh G oh I don't",
            "start": 5952.4
        },
        {
            "text": "to that already happened cuz Nick I mean your brother that's true Matt has showed you his balls I have not done that yet I'm trying to that's the last shred of professionalism I have uh G oh I don't know say tell Andy come not show car again yeah oh yeah Andy if you're listening I'm get him we're waiting for you no let's see if he's watching on Twitch all right uh people are asking Jen what her new job is none of your **** business to be announced is the answer right now she is serving as the de facto Kinda Funny barbecuer cook SL all around power around wait is this like a forever kind of thing I hope so if we had a **** Geneviève St-Onge Chef that would be amazing imagine how bad that would be for my career not for your career it be bad for my **** waistline no should make healthy everything is so healthy yeah see she's thinking about it BurgerXB says how drunk did Nick and Tim get a Rooster Teeth I didn't get that drunk but man they drink a lot yeah they drink a lot on their sh me to",
            "start": 6006.84
        },
        {
            "text": "is so healthy yeah see she's thinking about it BurgerXB says how drunk did Nick and Tim get a Rooster Teeth I didn't get that drunk but man they drink a lot yeah they drink a lot on their sh me to be I'm not saying the entire company has a problem but they have a problem they have problem problems lot of this is very good I'm enjoying it way more than the first time not saying it's you know I just Faor says Nick ask Kevin to check the mics tons of static and popping it's probably the barbecue I don't know yeah I know I don't know what it is it's a bad day yeah you know how it is when we out here we can't check your mic you can't guarantee anything when you're out here we need to get some of those Electronics no those are expensive yeah yeah no everything everything is set perfectly time is it it is 1:40 okay you want to call it no I think I got to call it one and a call it two I'm just trying to remember call it down if you want no no need to call anything I'm just yeah we read we",
            "start": 6054.2
        },
        {
            "text": "is it it is 1:40 okay you want to call it no I think I got to call it one and a call it two I'm just trying to remember call it down if you want no no need to call anything I'm just yeah we read we already closed all that out I was just saying I wanted to make sure I was aware of the time let's call it then going get that code no need to call anything huh you want to get me my phone where's your phone we need your phone for you're cooking I need to text my 130 Point tell them you're going to be a little late yeah hope they're not watching this I don't think they are it's a hair appointment so it's not too bad what's going on over here oh you're not going to stay all day oh no why'd you do it like that I actually meant it I actually meant it oh you did yeah I can never tell with you why cuz I always have this underlying feeling that you deeply hate me no no I like you I've said that yeah don't touch me though **** this is good you know it kind of tastes like a chocolate",
            "start": 6091.32
        },
        {
            "text": "cuz I always have this underlying feeling that you deeply hate me no no I like you I've said that yeah don't touch me though **** this is good you know it kind of tastes like a chocolate milk it does but with alcohol in it it's really really good dude in Texas you **** nailed it with this batch he nailed it so yeah this is we got meat there and then the shrimp now what are you doing with the shrimp the shrimp's done it goes I prepped it last night uh and it's going in the salad so I'm just going to reheat it I can just eat a shrimp right now that's what you're telling me you could but the butter is like old that's never stopped it it's never stopped me before hey thanks no problem do some cooking on it uh I don't know what you did before I got here I rolled the dough with some flow did you see our table see our table a lot of dough on it just in the middle of it I see that is that that's not even the worst thing has ever been on the table no that's true lot of things",
            "start": 6135.92
        },
        {
            "text": "some flow did you see our table see our table a lot of dough on it just in the middle of it I see that is that that's not even the worst thing has ever been on the table no that's true lot of things happen on that table I'm going to start needing help ideally from you you're going to start needing help okay what I need I wasn't going to offer wasn't going to offer um to start Distributing **** sure just tell me what to do Bobby room sure wrap it up yeah fine let's wrap it up I'm sorry it just feels like we're you know doing a lot more and then they're static and I feel bad okay we can send pics afterward also everyone is like gone it's just the three of us it's okay I've done shows by myself before ladies and gentlemen this has been the Kinda Funny Morning Show for my 34th birthday on April 27th, 2017 thank you so much for watching along with us being goons having a good time as you do this is Genevieve St-Onge she loved my life the best birthday present I ever got to be with",
            "start": 6188.4
        },
        {
            "text": "on April 27th, 2017 thank you so much for watching along with us being goons having a good time as you do this is Genevieve St-Onge she loved my life the best birthday present I ever got to be with me choke slam choke slam through the barbecue by God by God give me your by God by God I love it when she does it uh it's been fun remember we're going to go make more content today do things tomorrow the Kinda Funny Morning Show will be back 11:00 a.m. it'll be Nick and Tim you don't need to care about that but at 1:30 I come in and I play Mario Kart with all the subs until 5:00 p.m. at the end of the streams when I'll take on average Josh and then Zigger and **** destroy them and win for Zigger 150 bucks and win for Sea Pitt 150 bucks um Kevin I know you're in there listening make sure you fix that **** TV cuz I won't play a shitty TV tomorrow um we're working you can subscribe do that stuff doesn't really matter if you can that's great we need the money obviously but I don't",
            "start": 6243.08
        },
        {
            "text": "you fix that **** TV cuz I won't play a shitty TV tomorrow um we're working you can subscribe do that stuff doesn't really matter if you can that's great we need the money obviously but I don't want to guilt you just enjoy the content share it with it you know for my birthday present today don't worry about the tweets don't worry about the subs or anything like that just go out be good to each other be good people go find somebody on the internet and be nice to them how about that until next time it's been our pleasure to serve you",
            "start": 6293.8
        }
    ]
}