{
    "id": 13764,
    "video_id": "6Eu0KgXLGDg",
    "show_name": "Highlights",
    "hosts": [
        "Blessing Adeoye Jr.",
        "Roger Pokorny"
    ],
    "title": "We've Lost Our Minds",
    "description": "From KFGD: https://www.youtube.com/watch?v=ilDDFNy07HI Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\nGo to http://meundies.com/kindafunny and use code kindafunny to get 20% off your first order, plus free shipping on orders of $75 or more.\nGo to http://factormeals.com/factorpodcast and use code FACTORPODCAST to\nget 50% off your first box plus free shipping.\"\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1742415685,
    "duration": 1112,
    "transcript_chunks": [
        {
            "text": "Hasbro wants Balders's Gate 4 but isn't in a hurry. This is Victoria Kennedy at Eurogamer. Hasbro has quote a lot of people very interested in Balders's Gate uh as developer Larry moves away from the series. Balders Gate 3 released toward the end of 2023 and became a smashing su toward the end is August toward the end like the the eighth month. It's the second half, you know. That's not toward the end months. I mean July is in the second half third like almost to the last third actually. Yeah, August is not toward the end of the year. Towards the end. We're going towards the end. Okay. The end of the year is December. Yeah, we're going towards the end of the year is November, maybe October. We're going towards the end, though. You're getting towards the towards the end. You're not like you're going towards the beginning. August is like August is smack dab in the middle basically. It's closer to the middle than the end. All right. Would you like your gamer to now ride in the middle of",
            "start": 0.08
        },
        {
            "text": "going towards the beginning. August is like August is smack dab in the middle basically. It's closer to the middle than the end. All right. Would you like your gamer to now ride in the middle of 2025? Just say August. Just say August. Bombers Gate through released in August 2023. It's less words, but it released towards the end. Yeah, cuz you're going closer to the end. It's going Yeah, you're right. How would How would the What if What if someone who was reading this article doesn't know what August is? They don't know. They're from a country that doesn't doesn't recognize August 11month country. Balders Gate 3 released toward the end of 2023 and became a smashing success for Dungeons and Dragons owner Hasbro as well as Larry. It like it released in like beginning of of August too, I'm pretty sure. Unless I got that mixed up. Maybe that was review code. I digress. The game won scores of praise and awards across the world. And last year, Larry's director of publishing, Michael Dow,",
            "start": 44.4
        },
        {
            "text": "pretty sure. Unless I got that mixed up. Maybe that was review code. I digress. The game won scores of praise and awards across the world. And last year, Larry's director of publishing, Michael Dow, revealed the game's average daily peak in I think I was playing it in like July for the review. Oh, Mr. Video Game of Sorry. I'm sorry. It wasn't towards the end then. You say you're for the people. Bless. Yeah. You're talking to No, he's talking to the industry elites. Freaking Listen. All right. You're okay. You keep making mistakes like these, you're going to end up like game four. All right. You got to figure I'm just saying you got you got to figure [ __ ] out toward the end of the year. [ __ ] August. And y'all are telling me that August isn't even in fall. Remember that. And it's toward the end of the year. August is is summer. August is summer. But you're talking about game releases. Never mind. I'm taking a hold for myself. Uh back to the article. Ah. Uh, however, despite this",
            "start": 83.44
        },
        {
            "text": "the end of the year. August is is summer. August is summer. But you're talking about game releases. Never mind. I'm taking a hold for myself. Uh back to the article. Ah. Uh, however, despite this heady success, Lyen is moving on from Balders's Gate and has confirmed two games are currently in the works, both of which will be based on his own IPs and described as the studio's best work ever. So, where does that leave the future of Balders's Gate? Well, there are plenty of others who are very interested in Balders's Gate. SVP of digital games at HasRO Dan Aub has said, quote, \"We're kind of working out what our plans are for the future and what we're going to be doing with that. And actually, in pretty short order, we're going to have some stuff to talk about around that, IU told IGN during this week's GDC event in San Francisco. Now, while the wording of in pretty short order certainly sounds promising, this doesn't mean we're about to suddenly get Baldersgate 4. In fact, Hasbro isn't",
            "start": 124.32
        },
        {
            "text": "this week's GDC event in San Francisco. Now, while the wording of in pretty short order certainly sounds promising, this doesn't mean we're about to suddenly get Baldersgate 4. In fact, Hasbro isn't quote in a hurry for that particular game. Quote, that's the thing. We're going to take a very measured approach. We've got a lot of plans, a lot of different ways to go about it. We're starting to think about it. Okay. Yeah, we're ready to start dipping toes a little bit and talking about a few things. Aub explained with the publication adding that exec uh the adding the exec said he eventually wants a Baldersgate 4, but it'll take some time. As for other Hasbro Dungeons and Dragons games, I said he is quote never one to shy down from a challenge. After all, there are several other D and D based games in the works. And in November, Hasbro announced following the success of Balders's Gate 3, yet another Dungeons and Dragons game was in production. quote, \"I think anything that forces us to",
            "start": 163.52
        },
        {
            "text": "games in the works. And in November, Hasbro announced following the success of Balders's Gate 3, yet another Dungeons and Dragons game was in production. quote, \"I think anything that forces us to raise our creative bar and developers love to have a to have a high bar to go after and I think we've actually seen the team push some really interesting ideas that they're like, okay, we need to raise our our bar. We need to go bigger on this and things like that.\" So, I think and things like that, I guess. Uh, so I think that's our hope, right? We will keep raising the bar and everyone just tries to go a little higher. IU closed. That's how you, bro. That's IU. I just be talking. IU is my guy. I That's my That's the homie. Um I don't know who I is. I definitely I get it. Of course. I'm Hasbro. Yeah. I want the biggest success in our gaming division that we've ever had to have a sequel, right? Like it's it's the the question is is Len going to come back to it? No. They don't seem like they",
            "start": 207.28
        },
        {
            "text": "Yeah. I want the biggest success in our gaming division that we've ever had to have a sequel, right? Like it's it's the the question is is Len going to come back to it? No. They don't seem like they want to come back to it. They got two games working on. Yeah, exactly. They're going to continue down this path and then maybe 20 30 years from now we get a Balders's Gate 5 or whatever and that's connected to Larry. But I doubt it, right? It's not going to happen. I mean, maybe if you want to make predictions, because here's the thing. Oh, okay. We're doing 20-year predictions. We're doing a 20-year prediction. Games cast. Oh, I like that. 20 years for not predictions. Okay. My 20-year prediction is that some poor developer has to follow up Balders's Gate 3 from Larion and like they're going to make it they're going to put out Balders Gate 4, let's say eight years from now, and everybody's going to be like, \"Ah, but it ain't Balders Gate 3, though.\" And then Hasbro Hasbro's Yeah. It's",
            "start": 251.04
        },
        {
            "text": "to make it they're going to put out Balders Gate 4, let's say eight years from now, and everybody's going to be like, \"Ah, but it ain't Balders Gate 3, though.\" And then Hasbro Hasbro's Yeah. It's never going to be called Balders Gate 3. They made one of the best games of all time. You cannot. You can't. So, what's going to happen? Hasro is going to crawl back to Larry and be like, \"Please, we'll give you a billion dollars. Just make Balders Gate 5.\" That's what's going to happen. I wonder if Larry even wants that, right? Like, I mean, of course, they want a billion dollars. Yeah. Who doesn't want a billion dollars? But, I mean, you've seen the the head of of Larry talk about just how how focused he is on making great games that are uncompromising in every way. And if they're able to own their IPs and have things that are theirs and they make 100% of the pro profit and they don't have to worry about licensing, like that's just they they're the studio now. They're the guys now. You put",
            "start": 290.32
        },
        {
            "text": "IPs and have things that are theirs and they make 100% of the pro profit and they don't have to worry about licensing, like that's just they they're the studio now. They're the guys now. You put Larry in the beginning of a games uh uh uh a game award trailer, it is going to be the biggest game war trailer of all time, right? Like it's like new game from Lariat. Holy [ __ ] Oh my gosh. That's insane. Uh I Yes, they're going to get back to Baldersgate 4. We can do the the fantasy booking thing of like who's the best studio to make. I mean, who is the best studio to make Balders Gate 4? probably Obsidian, right? Sure. Like I mean like is is there anyone else? I mean like for Balders Gate 4 specifically Project Red Yeah. I mean Yeah. I mean names, you know what I mean? like we're just saying [ __ ] like cuz like here's the thing is I don't know if I can think and granted this isn't my I'm not like the the CRPG expert here and so I'm not going to tell you like you know definitely not but",
            "start": 326.16
        },
        {
            "text": "[ __ ] like cuz like here's the thing is I don't know if I can think and granted this isn't my I'm not like the the CRPG expert here and so I'm not going to tell you like you know definitely not but it's hard for me to think of a developer that specializes in that kind of game that's going to do it better than Larry like even before Balders Gate 3 right like I speaking of Alex Viken Alex Venikin when both me and him were doing okay Beast he was the one that was playing Divinity Original Sin 2 and was speaking his its praises to me and made me realize like oh [ __ ] this Divinity Original Sin 2 game is the [ __ ] It's like a 10 out of 10 video game and like the only pe the uh like the people who knew knew, right? But Ballers Gate 3, I think, put that studio on a different level because it paired them with an IP that people really care about. Now people understand that Larry are the goats when it comes to this [ __ ] I know there are other developers who are very good at making people",
            "start": 368.56
        },
        {
            "text": "paired them with an IP that people really care about. Now people understand that Larry are the goats when it comes to this [ __ ] I know there are other developers who are very good at making people saying, people are saying in exile and that's the thing is like we can name these studios, but RG is hilarious. Man, we can name these studios, but like I don't know. I don't know if any of them are going to make a Boulders Gate that's as good as Boulders Skate 3. Yeah. So then it's like, do you redefine what it is a little bit? Cuz then if you do want to go CD Project Red, which I don't think is the right choice honestly, but if you do want to go with them, it's going to be a different type of game. Balders's Gate 3, if you're going to make an actual proper Balders Gate 4, you got to wait like 15 years. Like you got to wait a long time where that where that game feels Boulders J3 somehow feels dated which is going to be which going to take a long long long time. Like I I don't I don't",
            "start": 405.76
        },
        {
            "text": "like 15 years. Like you got to wait a long time where that where that game feels Boulders J3 somehow feels dated which is going to be which going to take a long long long time. Like I I don't I don't know how that game feels dated for the next decade at least. But you're going to have to turn around and be like okay there's things we can improve on a Balders grade 3. Let's make Balders Grade 4. You're just not going to get to that point for a very long time. You're going to have to wait. I think you either wait or you have to take it in like a dynamically different direction that is going to make people either not love it as much or might really resonate with people. My booking for this and this is going to piss people off Super Giant. I think after they're done with Hades, I think you pair them with the BaldersGate IP and go, \"Hey, do something do something with this.\" I don't then we can come back into the the amazing indie studios or or independent studios generally that are you",
            "start": 444.48
        },
        {
            "text": "pair them with the BaldersGate IP and go, \"Hey, do something do something with this.\" I don't then we can come back into the the amazing indie studios or or independent studios generally that are you that are doing unique stuff that sure you can pair them with IPs like uh like a remedy you could we could fantasy book a Batman you know remedy game all day and that' be amazing but do you want them to advert like do you want Super Giant to work on IP? I don't want them to work on IP. I want them to do whatever the [ __ ] they want. I mean I I agree with you. I do think it would be fascinating though it would like I'm sure they're having those conversations. It would it would it would boggle my mind if if all of these IP holders are not running to Super Giant and being like, \"Hey, we got whatever. Here it is. We do something with it, please.\" And I'm sure they have to say no to it, right? Because they're they're making incredible stuff. Um I don't know. I we come down to it where it's",
            "start": 483.2
        },
        {
            "text": "Here it is. We do something with it, please.\" And I'm sure they have to say no to it, right? Because they're they're making incredible stuff. Um I don't know. I we come down to it where it's Yeah, we can we can look at all these amazing games and be like, \"Oh, let's pair them together.\" But I don't know. I don't know. Well, let's think on us more because I do like I love My favorite thing to do on the show is fantasy booking. I love it cuz I'm thinking about the Super Giant characters. I'm thinking about like how much people love Balders G. Mike's walking in. I'm always nervous when Mike walks in. He's looking around. I don't know if he's looking for a mic. He looks like he's looking for a mic. He He smiles on us and does this. Look at that. You You never know. He like faked us out a little bit, too. Um Yeah. I just I don't know. I just think about how how much people love those characters in Balders's Gate. I think about how much, you know, resonates with people. Carlock, you know,",
            "start": 525.6
        },
        {
            "text": "bit, too. Um Yeah. I just I don't know. I just think about how how much people love those characters in Balders's Gate. I think about how much, you know, resonates with people. Carlock, you know, Shadow Heart, how much Balders's Gate is about obviously the story of the world, but the characters and the relationship between the characters. And I look at Super Giant and I'm like, \"Y'all do that so well.\" And I'd be interested to see them take those like obviously they made they made a an excellent top tier rog light, right? I think they'd have have it in them to make a big open world CRPG kind of thing, but you're right that like do I want them to do that or do I want them to continue to find their own real unique thing to do? I want those studios like a Super Giant, like a Remedy to always exclusively be in the business of topping themselves. I don't want them to be in the business of being like, \"Oh man, this other game did this thing, so we have to kind of figure out a way to do it",
            "start": 559.76
        },
        {
            "text": "exclusively be in the business of topping themselves. I don't want them to be in the business of being like, \"Oh man, this other game did this thing, so we have to kind of figure out a way to do it similarly but better.\" I want them to just look within and be like, \"No, we did that. We're going to do it better. We're going to do we're going to do the la the last game. We're going to make Hades 2 and it's going to be better than Hades 1. We don't have to worry about Balders's Gate 3 or anything.\" This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. Plus, if your shades ever go missing or an unexpected hit happens, you know, don't sweat it. They have the most insane protection in all of eyewear. Every pair is",
            "start": 597.04
        },
        {
            "text": "five stars by over 300,000 people. Plus, if your shades ever go missing or an unexpected hit happens, you know, don't sweat it. They have the most insane protection in all of eyewear. Every pair is backed by lost or broken replacements. If you don't love your shades, exchange for a new pair or return worry-free within 30 days. Y'all know I've been outside in the sun a lot playing Pokémon Go and it's such a great experience wearing Shady Rays when I'm out and about looking dope exclusively for you. Shady Rays is giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shady.com, use code funny to get 35% off polarized sunglasses. This episode is brought to you by Factor. Ready to optimize your nutrition this year? Factor has chefade gourmet meals that make eating well easy. They're dietitian approved and ready to heat and eat in 2 minutes so you can fuel right",
            "start": 635.44
        },
        {
            "text": "Ready to optimize your nutrition this year? Factor has chefade gourmet meals that make eating well easy. They're dietitian approved and ready to heat and eat in 2 minutes so you can fuel right and feel great no matter what life throws at you. Greg Miller has been loving how simple it is to enjoy his Factor meals as he's rushing between shows each day here at Kind of Funny. Factory arrives fresh and fully prepared, perfect for any active, busy lifestyle. With 40 options across eight dietary preferences on the menu each week, it's easy to pick meals tailored to your goals. Choose from preferences like calorie smart, protein plus, or keto. Eat smart with Factor. Get started at factormeals.com/factorpodcast and use code factor to get 50% off your first box, plus free shipping. That's code factorpodcast at factormeals.com/factorpodcast to get 50% off plus free shipping on your first box. This episode's brought to you by MeUndies. For years, I've been telling you all about how much I love",
            "start": 685.84
        },
        {
            "text": "at factormeals.com/factorpodcast to get 50% off plus free shipping on your first box. This episode's brought to you by MeUndies. For years, I've been telling you all about how much I love MeUndies. Real talk, I haven't worn a pair of underwear or socks that weren't MeUndies in over half a decade. And that's because I just love how premium they are, how great they look, and awesome they feel. Even my loungewear at home is MeUndies. And I cannot recommend their various shirts enough. MeUndies just gets it. From the all black classics to fun expressive prints, MeUndies has a look for everyone. Plus, they come in sizes XS to 4XL. So, there's something here for all of you. It's breathable, stretchy, and oh so comfy fabric make it ideal for all day wear. And they use sustainably sourced materials and work with partners that care for their workers. Brad, good things come in big packages at MeUndies. Get 20% off your first order, plus free shipping on orders of $75 or more at",
            "start": 738.28
        },
        {
            "text": "sourced materials and work with partners that care for their workers. Brad, good things come in big packages at MeUndies. Get 20% off your first order, plus free shipping on orders of $75 or more at meundies.com/kindafoney. Enter code kind of funny. That's meundies.com/kindfunny. Code kind of funny for 20% off. MeUndies comfort from the outside in. Story number six. It's Wii news. Uh PlayStation has given updates on five upcoming indie games. Uh Forever Skies is coming uh April 14th. Ruffy in the Riverside is coming June 26th. Roger, you like that game? No. Oh, never mind. I played a little bit of it. Uh the demo, I was like, \"It's fine. It's not for me.\" I know everyone else is excited for it. Maybe I just didn't get it. I don't know. For me, only reason I said that is you saw me playing assumed that I liked it. It was just hilarious. Well, that's a cool looking game is what I'll say. It is a very cool looking game and it might be good in the in the in the full game. I just didn't I",
            "start": 784.72
        },
        {
            "text": "assumed that I liked it. It was just hilarious. Well, that's a cool looking game is what I'll say. It is a very cool looking game and it might be good in the in the in the full game. I just didn't I just didn't really vibe with the demo. The Nighting is coming on August 18th. Skate Story is what I'm hyped for. That is coming this summer. And then Possessors is coming in 2025. That's the Heart Machine game. Oh, it's like the 2D one that they revealed last year. Oh, okay. I was thinking about the the the movie Possessor, which is [ __ ] freaky. It's a David Croninberg joint, and then David Croninberg is working with uh uh the guy that did immortality. What's his name? Um Sam Barlo. Yes. To make uh a video game. So, I was confused. I thought that that was that. My bad. Plans vs. Zombies Reloaded has been rated for a Switch release. Are you a Planes Versus Zombies guy? I love Plants Versus Zombies and they have [ __ ] up that franchise so heavily. Right. Plan Plants vs. Zombies should",
            "start": 829.2
        },
        {
            "text": "has been rated for a Switch release. Are you a Planes Versus Zombies guy? I love Plants Versus Zombies and they have [ __ ] up that franchise so heavily. Right. Plan Plants vs. Zombies should have been the next Bloons Tower Defense, right? We should have gotten 15 of those [ __ ] games. They should have been They should have been $10 a piece on Steam. We should have just kept on adding on to it. They made Plants Versus Zombies 2. That [ __ ] sucked. So much microtransactions. They started doing these third person games, which people like. They're not Plants vs. Zombies, right? They're not the core game. And then now we just forgot. Oh, now we're bringing back Plants. Now we're bringing back Pegle. Y'all [ __ ] up. We could have had everything. Plans. We could have had Plants Versus Zombies. five by now and it would have been the biggest thing on Steam. Y'all [ __ ] up. It should have been the next Bloons tower defense. You are underestimating Bloons tower defense. You are Blanes",
            "start": 868.24
        },
        {
            "text": "five by now and it would have been the biggest thing on Steam. Y'all [ __ ] up. It should have been the next Bloons tower defense. You are underestimating Bloons tower defense. You are Blanes versus Zombies is like way more successful than No, that is not true. That is literally not true. Do you think Bloons is more Yes, 100%. I guarantee you on Steam those games are [ __ ] huge. I've never been on the streets and people are just like, \"Yo, makes more money.\" Yes. I'm not saying it's not popular. I know. I know. I know it's popular. It's crazy big. More popular than Plants vs. Zombies. Yes. 100%. Cuz Plants vs. Zombies was huge at the time that we were playing it and it dropped off completely cuz people stopped playing that game cuz it's out. People are still playing balloons. There's five of them. All right. You know what? I believe you. Thank you. I'll garden Warfra left. I know it's not plants versus zombies, though. That's [ __ ] up. Somebody go into somebody for you're wrong. I",
            "start": 905.04
        },
        {
            "text": "of them. All right. You know what? I believe you. Thank you. I'll garden Warfra left. I know it's not plants versus zombies, though. That's [ __ ] up. Somebody go into somebody for you're wrong. I need the overall financials franchise for franchise. Yes. Right. What has overall been more successful and has made more money over time between Balloons and Plants versus Zombies? The results might surprise you. Uh, the Analog 3D has been delayed to July, which breaks my heart. I had that pre-ordered. Looking forward to it. That's the N64. How much is that? Uh, too much. Way too much. Too much money. And I paid it. Uh, oh, I got Ruffy on the in the Riverside on air again. Shout out my guy Ruffy. Roger loves Even though Roger talks so much [ __ ] I [ __ ] with you, Ruffy, in the Riverside. Bear, bring up a trailer for Rucky in the Riverside. Put this on me. This is the game that Roger says looks trash. I think it looks excellent. I don't know about this guy. And then Nico do the magical",
            "start": 946.96
        },
        {
            "text": "bring up a trailer for Rucky in the Riverside. Put this on me. This is the game that Roger says looks trash. I think it looks excellent. I don't know about this guy. And then Nico do the magical world director's cut launches April 15th. This is Ruffy in the Riverside. Doesn't this game look great? It looks great. Roger said it looked trash. That's that's that's exactly what I said. I said exactly what you said. That's exactly what I said. It looks beautiful. If you're if you're an audio listener, it's a 3D platformer with a really cool art style. The character is like kind of like a flat like in a flat plane, but like in a 3D world. That's hard to play. It's beautiful. It's beautiful though. It's beautiful. Uh, Nico Dico, shout out to Tim. Yeah, one of two people that played that game. Exciting. Somebody in chat says it's no balloons. Ex Blessing has no gaps except Balloons. Balloons might be Okay, I'll you know what? I'll take that. Balloons is a gap. I'm going I'm going Steam DB",
            "start": 991.04
        },
        {
            "text": "Exciting. Somebody in chat says it's no balloons. Ex Blessing has no gaps except Balloons. Balloons might be Okay, I'll you know what? I'll take that. Balloons is a gap. I'm going I'm going Steam DB while we talk sometime. Um, and that is it for Wii news. I'm going to hop. Oh, there's like seven of No, six uh Balloon CDs. My bad. There's 11,000 people playing Bloons 2D6 right now. Look how many people are playing the Plants vs. Zombies Garden Warfare on Steam. Well, I'll do Plants vs. Zombies uh guard uh game of the year edition on Steam. That's a thousand people playing it. Uh 1,700 rather. I mean, is that the second one? Cuz they made sequels. The sequel's uh Oh, no. No. The sequel's not on uh Steam because sequel is a mobile only microtransaction hell. Garden Warfare. No, I'm talking about Plants for Zombies. Sorry, I was talking about Garden. Let me go to Garden Warfare right now. 1300 people playing Garden Warfare 2. So if you combine all of the Plants Versus Zombies into one",
            "start": 1025.68
        },
        {
            "text": "about Plants for Zombies. Sorry, I was talking about Garden. Let me go to Garden Warfare right now. 1300 people playing Garden Warfare 2. So if you combine all of the Plants Versus Zombies into one thing, that is less than half of what the amount of people that are playing Balloon Tower Defense 6. You know what? My bad. My bad. Y'all, don't [ __ ] with me. I was I was wrong on this. One of the few things I know in my life, and I know that Balloons Tower Defense is [ __ ] popping off. And whoever said in the chat, \"Another bad take from Roger. [ __ ] ban yourself. [ __ ] ban yourself.\" See, now you're with I'm with you. Yeah. You know what? It's us against the audience now. You're done. All right. Even Even you wearing a [ __ ] blessing t-shirt. All right. Especially you.",
            "start": 1072.4
        }
    ]
}