{
    "id": 13788,
    "video_id": "AFFuHmYwvOw",
    "show_name": "Screencast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "Avengers Doomsday Cast Revealed! & Daredevil Eps 5-6 SPOILERCAST",
    "description": "Go to http://get.stash.com/KINDAFUNNY to see how you can receive $25 towards your\nfirst stock purchase and to view important disclosures.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\n00:00:00 - Start\n00:04:00 - Housekeeping\n00:04:50 - Doomsday Chairs\n00:12:00 - Daredevil Episodes 5 & 6\n00:44:00 - Superchat\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1743021842,
    "duration": 2766,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome to a very special episode of the kind of funny screencast. We are doing our weekly Daredevil breakdowns. Um, I have something in my throat. So, Greg, can you just talk for a second? Don't get choked up. I know it's hard to say farewell to your three stars, Tim, but I will be taking them on Wednesday. That's right, ladies and gentlemen, in NBS. You're one week removed from the Nintendo Switch 2 reveal where more importantly I will cash in stars in the bank and take Tim's three stars. Nick, we turn to you for expert analysis. Tim, already a very small man. What will happen when I steal his one reason for living? I mean, this is it for him, right? This is Tim finally going to Love Island and just burying his head in the sand like an eboo. And you have to really wonder, Gia is watching this all unfold. She's looking at them just L after L after L and then this one comes through. I mean, what is she going to She going to look at all those [ __ ] sneakers and",
            "start": 0.36
        },
        {
            "text": "wonder, Gia is watching this all unfold. She's looking at them just L after L after L and then this one comes through. I mean, what is she going to She going to look at all those [ __ ] sneakers and say, \"This is why I keep them around.\" I mean, she's going to tell she's going to take a match to those sneakers right now and just burn that whole house into True. That's true. Anyways, let's talk about Daredevil. We're talking about Daredevil. But first, we need to talk about something bigger. Avengers Doomsday. As we are recording this right now, we are uh approximately 5 6 hours in. I can't get the the time to pop up here, but 5 hours according what Kevin's got. Okay, 5 hours in to a huge Marvel Studios announcement. They have a live stream going on their uh Twitter um that has just been slowly every 12 minutes revealing a different like director's chair with an actor's name on it. Uh the the cast for Avengers Doomsday. Um and it started off a little slow. It's been slow the entire",
            "start": 53.36
        },
        {
            "text": "slowly every 12 minutes revealing a different like director's chair with an actor's name on it. Uh the the cast for Avengers Doomsday. Um and it started off a little slow. It's been slow the entire time, but we're we're starting to get some pretty big deal names popping into this thing. I wouldn't say so far we've had anybody that is truly unexpected, but it is definitely starting to paint the picture of, oh, they're doing well. They pop for Alien Comas out there. They did not see the one and only fabulous Nightcrawler, host of the traders. We're what we're going to do before we get to the Daredevil stuff is we're going to go uh chair by chair, chair by chair, everybody that's been announced so far, cuz it does seem like this stream is going to be going for a couple more hours uh announcing a bunch of different characters. Did we know this was coming or was it just today you woke up and this had started? Rumors last night started spiraling of people saying, \"Hey, tomorrow there's",
            "start": 97.36
        },
        {
            "text": "a bunch of different characters. Did we know this was coming or was it just today you woke up and this had started? Rumors last night started spiraling of people saying, \"Hey, tomorrow there's going to be news that's bigger than Robert Downey Jr.\" being announced as Doom. So, we'll see if there's something yet to be shown or if just, hey, here's the entire cast. They're actually here is the the news. Why are the S's look weird? It's just the font they use. I The font looks totally normal. The Marvel, it's all the Marvel font, right? And then the S. That's how the S looks in studios. Am I crazy? I don't know. Maybe. You're probably right. Maybe I'm wrong. What were you about to say, Nick? Oh, no. I was just I I I saw a few things teased out last night by just various artists who were like, \"Oh, maybe it'll be like more X-Men news, more this, more that.\" Some of some fun casting there. So, I mean, I I'm excited for this. Yeah. So, it's cool stuff. Uh, of course, this is the kind of",
            "start": 137.68
        },
        {
            "text": "\"Oh, maybe it'll be like more X-Men news, more this, more that.\" Some of some fun casting there. So, I mean, I I'm excited for this. Yeah. So, it's cool stuff. Uh, of course, this is the kind of screencast we've been doing our weekly breakdowns of Daredevil. A little housekeeping for you. Tomorrow's about to be pretty insane because, uh, Nintendo announced the last minute Nintendo Direct before their Switch 2 Direct next week. So, and don't forget during that Switch 2 Direct, that's when I'll be stealing the stars in the bank. You can forget that if you want. Um, so tomorrow, uh, we will be reacting to the Nintendo Direct at 10:00 a.m. Pacific. That's our normal start time for Games Daily. The Direct is going to be a couple hours earlier. We're just not going to watch it. So, y'all can watch it whenever you want, but watch it with us for our first time. We're going to stay off social media. We're not going to know what's going on. It'll be a uh a reaction without chat. So, we will not",
            "start": 174.88
        },
        {
            "text": "it whenever you want, but watch it with us for our first time. We're going to stay off social media. We're not going to know what's going on. It'll be a uh a reaction without chat. So, we will not be spoiled. Uh, and that'll be fun. Then, we'll do our normal breakdowns and all of that stuff. Um, and yeah, another fun full day of content tomorrow, just like today, because we're not done today. If you're a Kind of funny member, of course, you can do that on Patreon or YouTube or Spotify or Apple Podcasts. Uh, you can get the shows ad free. You can get the daily Gregway, uh, which today is 24 minutes about review embargos. Pretty cool. You can check that out. Uh, later today, you can also be part of the kind of funny happy hour, um, which should be a ton of fun. You can call in and talk to us. And then of course the Pokemon and Nuzlocke stream will continue. Uh if you have any thoughts on the casting of Avengers Doomsday or on Daredevil episodes five and six, please super chat them in.",
            "start": 211.84
        },
        {
            "text": "us. And then of course the Pokemon and Nuzlocke stream will continue. Uh if you have any thoughts on the casting of Avengers Doomsday or on Daredevil episodes five and six, please super chat them in. We'll get to those throughout the show as we go. Um and that's or today brought to you by Stash. Shout out to our Patreon producers Delaney Twiny, Carl Jacobs, and Omega Buster. But enough about all that. Kevin, can you bring up the chairs, please? Bring me the chairs. Uh the one thing I want to show is like, can you find the Ant-Man gag? because so far that's been the one thing kind of breaking the format. So far it's just been chair after chair after chair. Yeah. But hey man, you had a little chair. Little tiny little tiny chair. Um so that was fun. So what we're going to do is go through chronologically who they've announced so far. So Kevin, if you scroll up to the top of this uh page here, um we should be able to to see this. Um they started with Chris Hemsworth. All right. Obviously",
            "start": 249.12
        },
        {
            "text": "who they've announced so far. So Kevin, if you scroll up to the top of this uh page here, um we should be able to to see this. Um they started with Chris Hemsworth. All right. Obviously Thor. Mhm. Moving on to Anthony Mackey as Captain America, of course. Awesome. Vanessa Kirby, Invisible Woman from the Fantastic. Great. They pulled up here. Couldn't find anything slightly higher res. We need to make sure they know they they see the name. They got to understand. They got to understand who she is. Uh and it was around then that uh Marvel kind of uh put out a separate like Twitter video with the Avengers theme song playing saying Avengers Doomsday now in production. And then it had those names uh those three chairs. Does production mean filming or Yeah. Okay. Yeah. Yeah. Yeah. Um and uh we've we've known that uh production was there's a new one incoming if we want to go back to live CC. Chat's freaking out. New chair. New chair time. I've never seen one revealed, so it's a big deal to",
            "start": 290.88
        },
        {
            "text": "we've known that uh production was there's a new one incoming if we want to go back to live CC. Chat's freaking out. New chair. New chair time. I've never seen one revealed, so it's a big deal to me if we can hit it again. Oh, it's crazy. What happens is it just like pull Channy T. Hell yeah. Joey popping it off in the other room. That's awesome, man. Holy [ __ ] Gambit himself. Um but anyway, they they're kind of implying, hey, these are like the the main guys of the Avengers. This is the the the main Thor um uh Fantastic 4, Invisible Woman, and um Captain America. Uh but then they just kept going and then now they've been doing kind of like threeperson little vignettes with the Avengers theme uh playing after every three. Uh but then yeah, after that we had Paul Rudd, of course, as Ant-Man. Oh, they're playing his music. That's sick. I was I wanted to see what the reveal actually looked like, so I just rewind like a minute. Wait, that's tight. Cuz so far I thought they were just",
            "start": 340.48
        },
        {
            "text": "Oh, they're playing his music. That's sick. I was I wanted to see what the reveal actually looked like, so I just rewind like a minute. Wait, that's tight. Cuz so far I thought they were just playing uh this like ominous tone. Chat, let me know. Have they played other music cues for other people? Cuz that's sick. I know that we hate Twitter's uh video. Well, we hate Twitter, but we hate Twitter's video player, too. It's on YouTube. I don't know if there's a delay. Oh, is it? Yeah. Yeah. Yeah. Yeah. Oh [ __ ] Joey's been watching on YouTube, which it sounds like might be delayed. Kevin, I'm going to toss in a patrol control for you. Thanks, man. There you go. Alex says, \"Every chair has a theme.\" Oh my god. What the [ __ ] are we doing? Live reacting to this. I told you to do that. You told me like 10 minutes and it's not too late to just sit here and do it. I mean, I don't know. Everybody, guess what? We're going to have to Joey, I know you're watching the other thing. We're going",
            "start": 388.04
        },
        {
            "text": "told me like 10 minutes and it's not too late to just sit here and do it. I mean, I don't know. Everybody, guess what? We're going to have to Joey, I know you're watching the other thing. We're going live with this now. We got to redo the live streams. Got to we got to figure out I think so. I don't Let's not do that. Let's not I like it. But I Let's just see. Let's we'll we'll be we're live now. We're doing this episode and we'll see what happens. Uh Florence Pew, of course, uh coming back. Um then we kind of get into a little Thunderbolt section here. We have Wyatt Russell returning as uh US agent. Then uh the first big pop for me, the big surprise this morning, uh I I always forget how to say his name. Uh but uh Tanakh uh from Black Panther 2 um Neyar, which I I just didn't necessarily expect to be in this movie, like based on like some controversies with him in real life, but then also just where we are storyline wise. But pretty cool to see him back. him and invisible woman have",
            "start": 425.28
        },
        {
            "text": "expect to be in this movie, like based on like some controversies with him in real life, but then also just where we are storyline wise. But pretty cool to see him back. him and invisible woman have a lot of great storylines in the comic that I hope that we we get into. M uh then if you go down Kev Simul haven't seen him in a very long time but your boy is back uh Sebastian Stan Bucky following that uh Leticia Wright the Black Panther underneath that Eban Moss Brock from um the bear of course the thing from Fantastic 4 and then we started getting into the like okay we're getting big Kelsey Grammer, I love you so much. Returning as Beast. We last saw him in the Marvel's postredit scene. Um, and then Lewis Pullman up next, aka Bob from Topcon Maverick, aka Bob from the Thunderbolts, aka other people. Now, this really kind of brings me to my first criticism of this whole thing, Greg. And I know that you'll you'll you'll be with me on this one. Yeah. Who is this [ __ ] guy? I don't like",
            "start": 469.04
        },
        {
            "text": "people. Now, this really kind of brings me to my first criticism of this whole thing, Greg. And I know that you'll you'll you'll be with me on this one. Yeah. Who is this [ __ ] guy? I don't like when they show the picture before the title of the thing because it confuses me. Right now I'm looking at this and I'm like that's not Kelsey Grammar, Dr. Hanko's piece. That's Lewis Pullman. I put the title first everyone then the image and then I want to show the thing in Sue Storm. Jeezy crazy. God bless Bill Pullman though or Louisis Pullman though. God bless him. This looks like grownup basketball kid. That's what I think. Yeah, maybe it is. Maybe it is. We'll see. Maybe they re recast him as a different character. Uh, and then next up we have the Falcon, Danny Ramirez. Uh, also from Top Gun Maverick. A little reunion there, Nick. Yeah, I forget. He was not I forget his name. Bob was Bob. What was he? Which one was he? He wasn't Phoenix. That was her. That was her. Don't remember who's",
            "start": 527.08
        },
        {
            "text": "Maverick. A little reunion there, Nick. Yeah, I forget. He was not I forget his name. Bob was Bob. What was he? Which one was he? He wasn't Phoenix. That was her. That was her. Don't remember who's not hanging man. Damn. They all had cool names. Yeah. Uh, and then next up, Joseph Quinn Barrett Courtney himself as the Human Torch. Um, so all of Fantastic Four except for Pedro confirmed so far. He's got to be coming. He's got to be in it. David Harbor is up next. Um followed by Winston Duke from Black Panther. Him back. He's great. And then Hannah John Common who is Ghost. Which does that mean all the Thunderbolts are confirmed? Bucky US agent. Bucky US agent. Florence. Ghost. Florence. Red Guardian. So yeah. Yeah. Taskmaster. That'd be the one. Well, okay. She's coming. More important for this one is Lawrence Fishburn going to show up. You know what I mean? Yeah. Uh next up we have the big one, Tom Hston. Bringing it allies together. Love that. Uh and then again we start getting a",
            "start": 568.8
        },
        {
            "text": "for this one is Lawrence Fishburn going to show up. You know what I mean? Yeah. Uh next up we have the big one, Tom Hston. Bringing it allies together. Love that. Uh and then again we start getting a little bit crazy, y'all. Patrick Stewart. Sir Patrick Stewart, he's here. Yay. Where do you think he's playing? It's going to be We've seen him come back multiple times, mainly to die. Sometimes in very emotionally moving ways, sometimes in less so ways. Uh but it's been a very long time since we've seen him next to this man, Sir Ian Mckllen as Magneto. Holy crap, y'all. Last time they were in, he was he played Magneto. Was was it Day? Future Past. Yeah, that's crazy. 2014 over 10 years ago. It'll be very interesting to see these two men act opposite from one another again. Obviously very good friends in real life as well. You don't know that. Uh, and then next up, this is a huge deal. Uh, Alan Allan [ __ ] of course, host of The Traders, the greatest TV show on television right now. And,",
            "start": 624.96
        },
        {
            "text": "friends in real life as well. You don't know that. Uh, and then next up, this is a huge deal. Uh, Alan Allan [ __ ] of course, host of The Traders, the greatest TV show on television right now. And, uh, formerly Nightcrawler and, uh, was supposed to make a cameo in X3, but he was like, \"No, I'm not going to get the makeup for that shit.\" That's crazy. Gave him the dump truck full of money. He realized he had to. Now he's back, man. Very, very cool. How many of these people are dying in the first like 3 seconds of being on camera? I don't I I don't know. Yeah. I mean, I have to imagine it's I don't know, but I mean, we're getting a montage of Doom, RDJ, jumping universes, clowning people. Patrick Stewart, Kelsey Grammar, and Ian McCullen are not going to be like the main three characters of this film. Yeah, they're they're they're good to get. It's just a cameo. Remember when Kelsey Grammar fell off that stage? Yeah, it was really sad. I'd like you to stop bringing it up. It's just I",
            "start": 678.88
        },
        {
            "text": "of this film. Yeah, they're they're they're good to get. It's just a cameo. Remember when Kelsey Grammar fell off that stage? Yeah, it was really sad. I'd like you to stop bringing it up. It's just I can't I can't stop there. All of his career, all of his personal drama, everything else got erased in that one moment. Sideshow Bob gone and now he's just good lord when he fell off the stage. But but to have the mental acuity it's a small world pretending I was a UN interpreter. Good lord to have the mental acuity though to say good lord as you're falling off a stage. Tim he's a higher he's just a higher human than we a higher elevator. Oh, good lord. She's something, man. Like, [ __ ] Camille. Um, and then next up, we have Rebecca Roma as Mystique. Pretty damn sick to have her back. Uh, and then another one that I legitimately never thought we'd see back, James Marsden. I thought that if we were getting this Cyclops, it was going to be in Wolverine and Deadpool, Deadpool, and Wolverine,",
            "start": 717.84
        },
        {
            "text": "then another one that I legitimately never thought we'd see back, James Marsden. I thought that if we were getting this Cyclops, it was going to be in Wolverine and Deadpool, Deadpool, and Wolverine, and it wasn't, but here he is now. Ready to go. Wild stuff. And uh so then Channing Tatum is uh the the the latest one. So yeah, as we go through this, we will updating this article as we speak. Yeah, we'll uh we'll keep you all updated. Um all right, there was one more after Channing Tatum, it looks like. Oh, no. Again, this you're confused by their titling by the placement. Um anyway, exciting stuff. The big one for me that I wonder if they're going to do or not, if they're doing this, I like when are they going to stop? What big surprises are we going to get? Obviously, there's the Spider-Man. We're kind of in little X-Men world right now. I imagine Daffhne Keane's not going to be far behind here. Sure. But like Hugh Jackman, that's the thing, right? The Hugh, Ryan Reynolds, Toby,",
            "start": 765.52
        },
        {
            "text": "We're kind of in little X-Men world right now. I imagine Daffhne Keane's not going to be far behind here. Sure. But like Hugh Jackman, that's the thing, right? The Hugh, Ryan Reynolds, Toby, Andrew, those are the big ones. But the one that I am like very interested in, Jonathan Major. Yes. No way. Well, I mean, he's a new movie. There's a chance and they're Yeah, he's mounting a bit of a comeback and people are casting him and things again. So, we'll see what happens. I don't think storywise like I feel like they might be like, \"Hey, we got to make this make sense somehow.\" But I think even if they made it made sense, even if they did that, they wouldn't make a big deal about him being in it. I mean I mean I was going to say I and Disney has been I don't want to say they've been loosening. Yeah, they've been kind of dialing back a lot of their stuff like that. So we'll see what happens. But we won't know until hours and hours and hours from now. Uh, I need to know about Daredevil. Two",
            "start": 809.12
        },
        {
            "text": "Yeah, they've been kind of dialing back a lot of their stuff like that. So we'll see what happens. But we won't know until hours and hours and hours from now. Uh, I need to know about Daredevil. Two episodes last night. Of course, this is full spoilers, so if you haven't seen the episodes, please get out now. Do not watch this. Greg, I want to start with you. What did you think of you these episodes? You can talk about them separately or together. We had wondered a bit about why they were doing two episodes, you know, is it a thing? You was like, Disney's weird or whatever. And then, and it'll sound like an insult, but watching episode five and six, right? Yeah. Mhm. So, watching episode 5 and and it rolls credits and I was like, I loved it. What a great teamup issue. What a great one-off comic book, but then it was like the way like then they did the previously on Daredevil to get you set for episode 6. And I was like, \"Oh, right. The episode of TV I just watched did jack [ __ ] for",
            "start": 852.84
        },
        {
            "text": "comic book, but then it was like the way like then they did the previously on Daredevil to get you set for episode 6. And I was like, \"Oh, right. The episode of TV I just watched did jack [ __ ] for the overall plot.\" Like, it was fun as [ __ ] and I liked it. But it was a very big step outside of the Daredevil world as many team up comic books are. We're stepping outside of the current drama in Matt's life, in Kingpin's life, to tell you this story that's fun and very, very, very loosely tied to this pushing power pull or whatever with the one guy um Neo or Leo or whatever the [ __ ] one bad guy is, mob boss, Irish guy. And then we step, no, not even that, the guy they were reporting to that shows up in Fisk's office thing, but it doesn't matteruit track mafia. And then we step back into that world and I was like, \"Oh, okay. I I I love Daredevil Born Again.\" Like, I just love love love this. Yesterday I also watched on the plane the episode 4, right? Cuz I hadn't caught that yet.",
            "start": 899.36
        },
        {
            "text": "that world and I was like, \"Oh, okay. I I I love Daredevil Born Again.\" Like, I just love love love this. Yesterday I also watched on the plane the episode 4, right? Cuz I hadn't caught that yet. Loved that episode. I thought these were probably in terms of this season the weakest episodes yet. Both of them, I think. So, yeah. Yeah. And I have I have specific complaints about the second one. Not claim, but like, oh, this wasn't jelling the way I think they wanted it to. But both I loved I love Matt. I love Kingpin. I love seeing Matt suit back up. I love seeing the Vanessa stuff. Uh, even Gandalfini's boy, you know what I mean? like his ongoing back and forth and everything else. Like there's so much to love about this show that I think even these being the weakest, I'm not saying are bad. I just think that it was a little bit more like, okay, this is feeling looking like TV more than it did before. I was still like, okay, I love this enough as an overall product that I'm so all in.",
            "start": 941.28
        },
        {
            "text": "I just think that it was a little bit more like, okay, this is feeling looking like TV more than it did before. I was still like, okay, I love this enough as an overall product that I'm so all in. Nikki, I'm with Craig as well. I think the the the bottle episode, the standalone episode of the bank, I thought was fun, but I I do start to worry that now we're going to creep into uh season 1, season 2, season 3 of Daredevil, where there was always those one or two episodes where you're like, we didn't need that. And it's it's sort of taking me away from this just long enough for me to stop like to cool on the overall plot. I think by the time we hit episode 6 and he walks up with an axe, I'm kind of back in. Um but but overall I I'm with Greg on this. I think these two were the first not let downs but not as good as obviously coming off the last one um with the writing and all that stuff. Having said that I popped for for Mr. Khan coming on. I was like wait I know that guy. You hear the",
            "start": 981.76
        },
        {
            "text": "downs but not as good as obviously coming off the last one um with the writing and all that stuff. Having said that I popped for for Mr. Khan coming on. I was like wait I know that guy. You hear the voice and you're like wait cuz on her phone I was like you babe heads up. Yeah Kamala's dad is here and it's cool and a little bit of world building and the guy's a great actor too. But I do think that I think if this were a different different vibe and they were able to do like maybe just seven episodes for this, maybe not in 10 or whatever, how much they're doing, I think this would have been a scene where he stopped this bank robbery and then we moved on because I don't think ultimately this helped the larger plot and I'm really more invested in that. And then I think that they ended up unfortunately rushing some of the Muse stuff um at the end of it because they had to put a lot of resources sort of this bank robbery stuff which admittedly looked really cool in the trailers cuz all the",
            "start": 1023.84
        },
        {
            "text": "rushing some of the Muse stuff um at the end of it because they had to put a lot of resources sort of this bank robbery stuff which admittedly looked really cool in the trailers cuz all the colored ski masks and his ski mask outside and we called it too. We're like, \"Oh, he's wearing the ski mask. He beat someone up and he took that ski mask and we're just so I called you all argued.\" Um so all that stuff was cool and the episode was fun, but I ultimately don't think it added too much to the to the cannon now that is Daredevil born again. What did you think, Tim? I uh disagree with you guys. Loved these. I don't think that they're the best episodes, but I think that they're very very good and I don't think they're any lower quality than what we've seen so far, which admittedly I don't think that the show is the best thing ever. I freaking love it though. U but I love what it is. I think that it is uh trying to be something that is not, hey man, this is like the most important show in",
            "start": 1065.2
        },
        {
            "text": "that the show is the best thing ever. I freaking love it though. U but I love what it is. I think that it is uh trying to be something that is not, hey man, this is like the most important show in recorded history, but it's more like, hey, we have Daredevil in the MCU now. What's the best way we could use that? And I think the bank uh episode was awesome because I think that is a good example of it doesn't need to tie into the big story because the we're gonna get there like the MU stuff like we're dealing with that. I imagine that especially now with the whole uh official kingpin having the sanctioned team of like cops being punishers. It's like hunting mass vigilantes. It's like cool. That is like such a big story like upgrade that I've been kind of waiting for from the show that having one full episode that just allows Matt to be a badass and like Matt to show that he is the man without fear. I thought they did such a good job of putting him in that situation uh in the bank where",
            "start": 1101.12
        },
        {
            "text": "one full episode that just allows Matt to be a badass and like Matt to show that he is the man without fear. I thought they did such a good job of putting him in that situation uh in the bank where having the gun to his head and all that. Just like the way he acted was like he is such a hero. He's such a badass and it just added a lot of layers to what I feel like the story they've been building for the Matt and Daredevil characters so far. Um, of him trying to decide, do I put the mask back on back on? I can't do it. I can't do it. I can't do it. And then when we get to the um second episode, like one of the the rare [ __ ] used in the MCU, him saying [ __ ] it and suiting up. I freaking loved it, man. I thought that [ __ ] was so hype and uh so well earned and it it it took long enough to get there, but I think that you really needed that um episode to kind of like breathe a little bit. Um oh uh there Fantastic 4 music. Um so all all Fantastic 4 there makes sense. Uh but yeah, I I",
            "start": 1142.4
        },
        {
            "text": "to get there, but I think that you really needed that um episode to kind of like breathe a little bit. Um oh uh there Fantastic 4 music. Um so all all Fantastic 4 there makes sense. Uh but yeah, I I thought that these were a great onetwo punch. Um and the Kamala Khan connections I think are fantastic. Even the reference of her being out in California, it's like all right, cool. Who else is in California? Cassie Lang, Scott Lang's kid in San Francisco. Champions, baby. It's happening. But hype stuff all around for me. Yeah, I uh just going out a little bit. I don't know if we want to. Please go into it. I don't know if we need to take an ad break or whatnot. I'm not sure. Yeah, might as well. Here's a word from our sponsors. This podcast is brought to you in part by Stash. Are you still putting off saving and investing because you'll get to it someday? Stash turns someday into today. Stash isn't just an investing app. It's a registered investment advisor that combines automated",
            "start": 1188.0
        },
        {
            "text": "putting off saving and investing because you'll get to it someday? Stash turns someday into today. Stash isn't just an investing app. It's a registered investment advisor that combines automated investing with dependable financial strategies to help you reach your goals faster. They'll provide you with personalized advice on what to invest in based on your goals. Or if you want to just sit back and watch your money go to work, you can opt into their awardwinning expert managed portfolio that picks stocks for you. Stash has helped millions of Americans reach their financial goals and starts at just $3 per month. Don't let your savings sit around. Make it work harder for you. Go to get.stach.com/kindfunny to see how you can receive $25 towards your first stock purchase and to view important disclosures. That's get.stach.com/kindafoney. Paid non-client endorsement not representative of all clients and not a guarantee. Investment advisory services offered by Stash Investments LLC, an SEC",
            "start": 1231.6
        },
        {
            "text": "disclosures. That's get.stach.com/kindafoney. Paid non-client endorsement not representative of all clients and not a guarantee. Investment advisory services offered by Stash Investments LLC, an SEC registered investment of adviser. Investing involves risk and investments may lose value. Offer subject to TNC's. Nick, you wanted to get into it? Yeah, just getting into um the the kind of bigger criticism I have of this the the sixth episode was that I didn't feel like the transition to Daredevil was as dramatic as I thought it was going to be. It felt very nonchalant. And granted, look, we know he wants to be Daredevil again. He's noodling with the law. He left the bed and he went up there and started practicing. He's doing his cool stuff. And obviously, look, the [ __ ] series isn't called Matt Murdoch attorney of Law. It's called Daredevil Born Again. So, we got to see him there. I was just assuming that at some point there would be that final thing to push him over the edge. Um, and",
            "start": 1281.04
        },
        {
            "text": "Matt Murdoch attorney of Law. It's called Daredevil Born Again. So, we got to see him there. I was just assuming that at some point there would be that final thing to push him over the edge. Um, and I feel like they're doing a better job at pushing Kingpin back into the darkness than they are at pushing Daredevil. I think his story line makes a little bit more sense. I think he's more troubled. I think in this one there really wasn't it felt forced that the girl was like, \"Hey, I'm following this dude. Like, I figured out where this guy is in the subway and and then Matt just kind of finds him or maybe I missed the detail there of how he knew where she was.\" I guess maybe she told him where she was going or whatever. Um, but I just felt like it was a little hamfisted to get him back in the suit. And then about 5 seconds into the Muse fight, I stopped giving a [ __ ] because it was so [ __ ] nasty. in the choreography and the and and how they moved was so well done with Muse doing like",
            "start": 1328.8
        },
        {
            "text": "suit. And then about 5 seconds into the Muse fight, I stopped giving a [ __ ] because it was so [ __ ] nasty. in the choreography and the and and how they moved was so well done with Muse doing like there's there's a great moment where Muse is about to like stab her and Matt just like no look throws his like grappling baton thing at him and like and Muse moves out of the way. Um so all that stuff was great and look obviously like we got to get him back in the suit. We need to see him in the suit. He's got to be fighting people. I just feel like Muse could have used one more episode to cook. We could have had her there as a captive more and have him have to figure out how to get there and then be he I needed that moment where it's like the oh [ __ ] I'm hanging off a cliff, let go moment and go back into the darkness. And I don't quite feel like we got there with him. I agree with that. I think that would be my uh criticism of the episodes again that I liked a lot, but it was at one",
            "start": 1366.56
        },
        {
            "text": "and go back into the darkness. And I don't quite feel like we got there with him. I agree with that. I think that would be my uh criticism of the episodes again that I liked a lot, but it was at one point, I forget what it was that Jen was listening in or watching and kind of giggled at. I'm like, there's been a few leaps in logic here that are very much a comic book thing. When I'm reading a comic, I don't worry about it, think about it. But in time here, right, one of the ones I jotted down is like Matt leaves the bank. He has left the bank. I'm on the phone with Kristen. Things didn't go well. And he goes, \"Call 911.\" And he the 911 call. Yeah, my partner just left the bank and said, \"Call 911.\" Something's And it's the same thing later on where it's like uh I have the one of like it felt too forced of when Cherry shows up and he's got his heart beating and Matt it's like is that for me? He's like or he's like I I got to let you got where Matt you got to be straight with me buddy.",
            "start": 1406.16
        },
        {
            "text": "too forced of when Cherry shows up and he's got his heart beating and Matt it's like is that for me? He's like or he's like I I got to let you got where Matt you got to be straight with me buddy. Let this one go. And I'm like wow. We just I feel jumped in escalation from where I we missed something there in terms of shifting us into that. The cops do their job and he's like and then Matt's and even his reaction to that he's like yeah don't worry about it man. It's cool. Like no [ __ ] Yeah I feel. So I'm with you on that. I mean it all works. I think and again I enjoyed it and he suited it up and I popped and I liked seeing him on the roof and do and again the if I may to jump into episode six there right my coming off of the Kamala Khan or the Mr. con episode, which I do want to talk more about. But coming in here, my first note is I thought it was a weird pacing on the opening conversations cuz it's Matt and his girlfriend and Fisk and the mobster. And neither conversation I felt",
            "start": 1447.12
        },
        {
            "text": "about. But coming in here, my first note is I thought it was a weird pacing on the opening conversations cuz it's Matt and his girlfriend and Fisk and the mobster. And neither conversation I felt like was hitting on the level. So to go back and forth between them, I was like, \"Oh, this is making them seem even more not that they're not jelling and it's taking me out of it.\" versus when the Muse fight pops off and it's Kingpin versus Adam. This is [ __ ] a Kingpin [ __ ] slams him in the ceiling and slams him on the table. Like, that's rad. And this is what we wanted, right? This is what we've been waiting for. We've been waiting for for to see that duality play out in both in the dramatic side of it and then also in the action side of it. And you just forget that Kingpin can [ __ ] throw it out. You forget that. See, this is where I I where I differ from you guys where I just feel like the entire season I've kind of seen Kingpin as he's a bad guy and he's like not like the whole oh,",
            "start": 1486.64
        },
        {
            "text": "it out. You forget that. See, this is where I I where I differ from you guys where I just feel like the entire season I've kind of seen Kingpin as he's a bad guy and he's like not like the whole oh, I'm trying to be good. like I just don't buy it. I haven't bought it and I feel like we kind of differ on that. And I think that we've seen this like the them doing similar scenes in multiple episodes and like I do think that we get to the point of there was a build to him becoming Daredevil and putting on the the suit and I think that like it was overdue to an extent but I think that the uh the nonchalantness that you're talking about like I feel like it makes perfect sense when he got the white tiger's dead right and now this the girl is going to be the next one and he knows that she's out there and like trying to fight for justice and going after this serious serial killer and she's now in a position where she's about to get her freaking blood sucked, right? That being a moment for Matt",
            "start": 1525.76
        },
        {
            "text": "and like trying to fight for justice and going after this serious serial killer and she's now in a position where she's about to get her freaking blood sucked, right? That being a moment for Matt Murdoch to be like, \"All right, what what am I trying to like the charade's over like I got to do this stuff and like him having the the foggy thing and thinking about it all like I thought it was like such a a great moment of like, oh, this it's time to freaking go like move on and let's get into this shit.\" I mean, and again, not not the most disappointing thing ever. I mean, we get him in the suit, we're great, but I always look for the moment of like I always kind of hearken back to Batman Begins, right? where you want that that moment where all is lost and there is no hope and the commissioner is on the horn and he's like you got to and and Gordon's like you got to send more people and the commissioner's like there's no one left and then Batman [ __ ] flies across the river and you're",
            "start": 1565.6
        },
        {
            "text": "is on the horn and he's like you got to and and Gordon's like you got to send more people and the commissioner's like there's no one left and then Batman [ __ ] flies across the river and you're like oh there is one person left. I want that level of hype when someone gets back into a suit and I think there just was really no buildup. In fact, it was kind of a let down for me. But if anything, if I may, like I think the the scene be a few scenes before he suits up of him going up, going to the thing, opening the thing. We see all the helmets. Maybe this is episode four before. I forget. No, it was a few episodes and playing with a stick. So that's four. They all slam together since I watched them all. Like I think that scene took away from him suiting up here. I would have rather not have seen that there. Get up there. He does this whole thing. It opens. There's a sigh or quiet determination that I have. We see the helmet and we see the change of like that's what it is. Yeah. I think I",
            "start": 1600.24
        },
        {
            "text": "that there. Get up there. He does this whole thing. It opens. There's a sigh or quiet determination that I have. We see the helmet and we see the change of like that's what it is. Yeah. I think I think you're right in that regard. I think I think to Tim's point though, I think they really did want they want you to go like he's he's 75% going to be Daredevil again. A little bit of a push and that's fine. That's cool. Um but I I really do think they were trying to I would disagree with you a little bit, Tim. I really do think they were trying to build Fisk up as like, hey, I'm on another path now, but I'm being pulled back into this. But I don't think they did a great job doing that either. I don't I mean, I just feel like every single scene they they didn't show that like that that's what they're telling us. But it's like every single thing this got a man in a cage. He has a man in a cage, but he's also trying to get this port project up. He's going through the right channels of doing",
            "start": 1639.28
        },
        {
            "text": "they're telling us. But it's like every single thing this got a man in a cage. He has a man in a cage, but he's also trying to get this port project up. He's going through the right channels of doing that. He's pitching billionaires on it. He's not threatening them when they push back at him. So, you do have these moments where you're like I think it's a little bit confusing cuz we've had one moment where he blackmails the the the police chief who was a crooked police chief. So, I guess that can be kind of handwaved away. But then he's t these billionaires are just being shitty to him including that guy that what the hell is he from? Swordsman from Hawkman Hawkman, right? Uh he's in this now and uh and and boy does I I'm just not a fan of this character. I I don't like him in this scene. I really don't like I for whatever reason he reads is so cheesy to me and I don't know if it's because the fake mustache and the fake hair. He's a swordsman. Yeah, the French swordsman. That is fair.",
            "start": 1675.04
        },
        {
            "text": "I really don't like I for whatever reason he reads is so cheesy to me and I don't know if it's because the fake mustache and the fake hair. He's a swordsman. Yeah, the French swordsman. That is fair. I I just wish they had maybe I don't know. I wish they'd left him out of this one cuz I think he deflates the scene completely. That's an interesting one where I thought Mr. Khan getting dropped in and being being shot like Daredevil. I was like, \"What a great team up. This works for me.\" Swordsman, I agree with Nick. Not that I just I hate the guy or anything, but I was like, \"Oh, you worked for me in Hawkeye.\" And here it is very much like I'm not vibing the same way with you. I love it, man. I feel like the more that they can actually build out the different crime syndicates in the the MCU that we've had and have Kingpin actually have to deal with that stuff, I feel like it just makes it feel so much more real that these characters are popping up and having conversations. And I do",
            "start": 1712.96
        },
        {
            "text": "MCU that we've had and have Kingpin actually have to deal with that stuff, I feel like it just makes it feel so much more real that these characters are popping up and having conversations. And I do think that uh that what we got from Swordsman, he is a little goofier and for him to in this be be more serious. Like I just think that it's a it's a wise take on the timeline of where we've had the characters and stuff and also making these shows matter because Kingpin was in Hawkeye. Of course, he was. I just think stylistically this show in my opinion is a cut above all the shows that had come prior to it. And I think that they do a really great job even in these episodes of just these candid shots they have of New York, the St. Patrick's Day, right? Which I doubt that Netflix got out there or excuse me, um Disney Plus got out there and recreated St. Patrick's Day. I'm I maybe they did or maybe they just shot some B-roll of it last St. Patrick's Day of New York. But all that all that",
            "start": 1749.44
        },
        {
            "text": "or excuse me, um Disney Plus got out there and recreated St. Patrick's Day. I'm I maybe they did or maybe they just shot some B-roll of it last St. Patrick's Day of New York. But all that all that stuff that really does feel like someone's going out there and documenting where New York is right now, I think grounds the show in a way that all the shows prior really don't. So when you have some of these characters like uh uh uh Camala's dad or like the swordsman come, it just it seems kind of uh like they're out of place to me just a little bit. Especially as Vincent Denafhrio is trying to play a little more philosophical, introverted, darker Charlie Cox playing trying to play a dark. We're not we're not pulpy PG-13 comic book. We're rated R. I'm going to jump up and [ __ ] slam down on some homie's knee and he's never going to walk again. And so, yeah, these I think it I think it takes away from the tension a little bit, especially after we had that really good scene with the the the",
            "start": 1787.04
        },
        {
            "text": "homie's knee and he's never going to walk again. And so, yeah, these I think it I think it takes away from the tension a little bit, especially after we had that really good scene with the the the blonde lady who was like, I'm a billionaire. You're just [ __ ] you're not even in our pool, man. You just ain't [ __ ] And he's like, I'm [ __ ] kill this lady. Um, but having again, these are I I want everyone to understand these are minor criticisms. Tim, I'm right there with you. When I when I looked at the calendar the next, you know, when I got home yesterday and was like, \"Oh, [ __ ] right. Daredevil.\" I sat and I was just thorough I thoroughly enjoyed both of these episodes. I just think it's so difficult because the first four, especially the last one was like one of my favorite episodes of Daredevil like that had ever been done. So there's going to be some highs and there's going to be some lows when he [ __ ] punishes Punisher and then he goes, \"I'm sorry. I'm sorry.\" My god, it",
            "start": 1830.08
        },
        {
            "text": "of Daredevil like that had ever been done. So there's going to be some highs and there's going to be some lows when he [ __ ] punishes Punisher and then he goes, \"I'm sorry. I'm sorry.\" My god, it was so good. So good. I love him opening the the safe like just sitting there and like listening to him, man. I a question. is I mean there's no one even like so this guy beat the [ __ ] out of these guys are not dead right these these gangsters at some point someone's going to be like this dude's daredevil right or they're not they're henchmen they're not thinking that and he's he gets he slinks away from the crime scene even though he announced his name this is one my so my criticisms of the I loved the bank episode loved loved loved loved loved the bank episode when the officer shows up I was like is this going to be Yuri from like Spider-Man are we going to do that kind of thing uh anyways though loved it overall my My one criticism I had here was I I'm like, \"Jen, that's Camala's dad.",
            "start": 1861.04
        },
        {
            "text": "like is this going to be Yuri from like Spider-Man are we going to do that kind of thing uh anyways though loved it overall my My one criticism I had here was I I'm like, \"Jen, that's Camala's dad. This is [ __ ] awesome.\" And he mentions his daughter and he mentions Camal by name. I'm like, \"Okay, we're starting.\" And then it was when he and I liked the Funko Pop on the desk. And I don't even mean as a product placement thing. I liked it on the desk. Fine. But when he picks it up and like makes a big I was like, \"Now we've gone too far about talking to your daughter and not saying she's Miss Marvel.\" But my hope was going to be and I think honestly is a missed opportunity for how the relationship ends of come over for dinner, come to Jersey Sitter, meet and I'll meet Kamala. Haha. Like I get to a degree of course the uh because I don't think anybody would think I mean there's so many vigilantes right where even [ __ ] Daredevil doesn't know Miss Marvel right that I think are they",
            "start": 1904.0
        },
        {
            "text": "I get to a degree of course the uh because I don't think anybody would think I mean there's so many vigilantes right where even [ __ ] Daredevil doesn't know Miss Marvel right that I think are they going to put it together he's Daredevil? No cuz no one would assume that right now just stick with me. Um you know when he he chokes out that guy and fights and it's a close fight and he does the [ __ ] thing where he slides on the stairs and stops the shotgun. That was [ __ ] cool as hell, right? It's more for me that when he gets down there to Mr. con and isn't using the stick and isn't doing the thing and attacks the thing. You know what I mean? Like I would have preferred at some point he says I have abilities and then Kamala's dad is like you're not alone. You know what I mean? Like uh wink wink nudge nudge I know somebody or my daughter not name you know what I mean? Like I wish he would have put the pieces together of like you're one of these metahumans. You know what I mean? There's",
            "start": 1937.2
        },
        {
            "text": "wink nudge nudge I know somebody or my daughter not name you know what I mean? Like I wish he would have put the pieces together of like you're one of these metahumans. You know what I mean? There's more to you than it's just a little thing. I don't care again but it's a comic but crossover works. But let's pause real quick. Kev, can you bring up the next one with the with the music that they're saying that like they're building the hype on right here going? It's just Avengers theme. Yeah. I mean, it's going to be it's going to be the one and the only Chris Evans. [Music] Lot of rumors. I mean, he has to be quick. I think it's Carter. You think too? Oh, Peggy Carter. Yeah. Let me play the what if music, you know. Maybe it's Jeffrey, right? What's up, Kev? Who are you guessing? Josh Brolan. As Cable. Oh, yeah. Good point. How cool is that? Josh here. Oh, something's happening back there. The door is opening. This is crazy. Ezra Miller. Quicks. I got you. If I had Kevin's walking in, if",
            "start": 1976.64
        },
        {
            "text": "As Cable. Oh, yeah. Good point. How cool is that? Josh here. Oh, something's happening back there. The door is opening. This is crazy. Ezra Miller. Quicks. I got you. If I had Kevin's walking in, if I had Kevin Feigi's phone number right now, I would be like, \"Bro, you can't do this [ __ ] to me.\" I would be random Wednesday. Tom [Music] Cruz, Jason Baitman. That's probably RJ already J. Yeah. Yeah. It's RDJ. Is he just going to sit there for the rest of the day? That's probably over then, right? Yeah, I think so. That's the cast. Now in production. Skunkan. Interesting. I tell you what, here's here's what I say. Good [ __ ] luck, James Gun. You know what I mean? Good luck, bro. The DCU dead again. I ain't got no chairs. Sorry, didn't mean to to cut you off, Nick. You were about to say something. I don't even know what I was talking about anymore. That was hype. I'm so excited for this next. Can you imagine how dope that would be, though, if they were just like tomorrow they just did",
            "start": 2027.72
        },
        {
            "text": "I don't even know what I was talking about anymore. That was hype. I'm so excited for this next. Can you imagine how dope that would be, though, if they were just like tomorrow they just did the same thing, but it's like, you know, every movie, but they're No, I was I was about to make the pedestrian very Reddit [ __ ] point of like people would [ __ ] start to wonder about this guy. Like all the cops know he's got extra like good abilities right at this point. They know he can fight and then obviously there's all these gangsters on this one side know he can fight. Who turned your arm the wrong way? I'm not going to say who turned your leg the wrong way. I'm not going to say I'm so embarrassed that a blind man beat me up. Yeah. I mean obviously this guy who's a pretty ca I mean he's not an incapable you know criminal. all the guy that Irish guy seems like he would he would recognize the the suit the guy was wearing that beat the [ __ ] out of him and one of the masks from that thing",
            "start": 2123.28
        },
        {
            "text": "an incapable you know criminal. all the guy that Irish guy seems like he would he would recognize the the suit the guy was wearing that beat the [ __ ] out of him and one of the masks from that thing but maybe you don't put two and two together cuz you do think that someone who is you know has a disability like that would be completely incapable of doing it but his friends would be like hey dude that dude that was like that told you he had to take a [ __ ] he beat my [ __ ] head in yeah and did a lot of cool [ __ ] maybe a lot of cool [ __ ] he did some real sweet this wasn't even like a normal fight like he like slid down and like caught a thing as he was choking me was pretty sick um [ __ ] doing MMA as we slid down the stairs. We we've ted on a little bit, but the muse fight, the way this thing pops off when there it down in the subway and we see the train coming and it's like out of focus and you just hear the sound of the train and you just start seeing the shadow of a silhouette",
            "start": 2159.84
        },
        {
            "text": "thing pops off when there it down in the subway and we see the train coming and it's like out of focus and you just hear the sound of the train and you just start seeing the shadow of a silhouette of him running. You see red in Muse's eyes first. Oh yeah. because of the brake lights of the train and it cuts and just out of the blur and the red this dude's going like 90 mph and he freaking like zip lines towards him and like just starts beating the living [ __ ] out of him and also Muse is so sick what Muse is doing go what are you going to say lame Museame his painting in the blood awesome his outfit stupid his outfit's [ __ ] awesome totally dumb and then they have the hey are you muse can we take a photo of you I [ __ ] is it? Show your [ __ ] face. You suck. This is art. The white tiger and Muse guys are too Oh, Lte. I just going back to this shot cuz I think this might be one of my favorite shots like in any freaking Marvel show. I just can't I was like the train goes by and it's",
            "start": 2199.04
        },
        {
            "text": "and Muse guys are too Oh, Lte. I just going back to this shot cuz I think this might be one of my favorite shots like in any freaking Marvel show. I just can't I was like the train goes by and it's just red and I'm like, \"Oh, that's sick.\" Cuz color is used so well in this especially even like him, you know, pulling the red mask and all that stuff. I mean, he's kind of on the middle and he's just looking and the camera's slowly dling on him. And as the red in his eyes are just like kind of glowing a little bit more and then it cuts over and out of just that blur just comes running. It's such a beautifully beautifully speed shot and then we just go into it and these dudes are fast. What' you say about that? This white boy can run. There it is. Um, I my stupid brain of course if we're if we're going to really dial this and be hyperritical of it, the the fighting is amazing, but bro, when you down someone, like [ __ ] tie him up. And also, she got an eagle the size of a [ __ ] Lacroy can",
            "start": 2248.6
        },
        {
            "text": "going to really dial this and be hyperritical of it, the the fighting is amazing, but bro, when you down someone, like [ __ ] tie him up. And also, she got an eagle the size of a [ __ ] Lacroy can stuck into her leg. She's dead. That water jug is full of her blood. A magic amulet around her. Uh, is she already at this point? I don't know. Okay. Well, he opened up her hand and then shot her up full of you would have to assume some sort of sedative. And she had something wrapped around her wrist. Bracelets. I just assumed she had wrapped the ambulance. I had myself cracking up because I was going to say I wish Daredevil would have said, \"Put the blood back in the girl.\" No, I mean, this has this I thought he was just going to like pour the sparkless water back into her. Basketball boy. So good. Um, but overall, I think two very good episodes. Just not not not the highlights of the series yet. I'm so excited every Wednesday. Me, too. Um, I I think that I think that I'm excited to see",
            "start": 2294.08
        },
        {
            "text": "good. Um, but overall, I think two very good episodes. Just not not not the highlights of the series yet. I'm so excited every Wednesday. Me, too. Um, I I think that I think that I'm excited to see what they do with Muse. I like that he's kind of a pain in the ass for everyone involved. And of course, we got to talk about we got to talk about the the bad seeds putting together the the team. Yeah, man. I mean, that's cool. Again, good setup. And also like I like that that Muse is straight up a serial killer. Like that's like such a I know that the Netflix shows like especially like Jessica Jones like got into that type of stuff, too. But it just like I think raises the stakes a bit when we're talking about 60 bodies and their blood is being drained to turn into paintings for this artist. like that's that the public are kind of looking at as like a as a Banksy type like as like a hero like celebrity. It's like that is again I think a really good kind of time and place for how New York",
            "start": 2333.36
        },
        {
            "text": "like that's that the public are kind of looking at as like a as a Banksy type like as like a hero like celebrity. It's like that is again I think a really good kind of time and place for how New York in the MCU right now is and like seeing how a kingpin mayorled New York especially now like having the the mask versus um the this task force vigilante now that Daredevil is back right like Fisk is not going to be happy about that like straight up Matt Murdoch is probably going to be exposed right like by the people that do know and including Fisk hunting him down I don't know uh maybe he's exposed or be fisks lowkey just tells all this all of his punishers to go kill him. Either way, it's going to be an incredible action sequence. But I could see him exposing him. I think that'd be a good cliffhanger for the season, right? End there. Blow up Matt Matt's spot because it's all going too well. Matt Murdoch is very much like Peter Parker, right? His personal life can't be great. Yeah. And so",
            "start": 2373.44
        },
        {
            "text": "for the season, right? End there. Blow up Matt Matt's spot because it's all going too well. Matt Murdoch is very much like Peter Parker, right? His personal life can't be great. Yeah. And so he's got this girlfriend who lives with him who's also, you know, doing this. I enjoyed this little bit of tension here of like, I want to talk. Can you set up an interview with Frank Castler or the Daredevil? It's like, man, are you [ __ ] me just to get close to these guys? Interesting. That's an interesting like not not overt. Maybe it's a little thing. I like that. Um, and yeah, you know, then my one of my Oh, again when I was talking at the top where I was like, okay, some of this started to feel like, oh, this is a TV show or it's too convenient. Like I think there's two different scenes in the conference room again in the lawyer place, the law firm they call it. Uh, and then in the background I'm just like, who are all these people? I mean, I get it. It's a sexual thing, but it's you're",
            "start": 2419.04
        },
        {
            "text": "conference room again in the lawyer place, the law firm they call it. Uh, and then in the background I'm just like, who are all these people? I mean, I get it. It's a sexual thing, but it's you're looking for money, but there's all these people back there. I'm like now I've been in this office enough I'm like wonder what the [ __ ] is going on back there. What are these people? Yeah, I just assume that he was like the nonprofit arm of this highly lucrative law firm that's in like the Hell's Kitchen. But I guess they're broke and we and they need to have a hard conversation with like 30 employees that are in the background. Again, it's fine. It's like, oh yeah, well that's happening back there. That's weird that I see more of them are doing like maybe you don't need that contract. Matt have a desk cuz he's just hanging out in this conference room all day. That conference room is lit. It's pretty cool. Not as good as ours cuz you built ours. Yeah. No Punisher uh in these episodes which",
            "start": 2457.92
        },
        {
            "text": "a desk cuz he's just hanging out in this conference room all day. That conference room is lit. It's pretty cool. Not as good as ours cuz you built ours. Yeah. No Punisher uh in these episodes which I don't think was needed. Are we going to see the Punisher at all for the rest of the show? I think we have to now now that we have the task force like officially it's a thing. It's not just like teases. It's like oh yeah like he has to be the one to get involved and be like no he's got to give the speech right. Yeah. You don't get it. You don't get it. Does the task force go after the Punisher though? They are sort of punisher disciples. I mean no I think they're go they're going after I think Daredevil. My question is are they going after anyone else? Daredevil amuse you have to imagine right? They're trying to find him. Yeah, I mean that's that'll be the interesting thing to see is like is he going to actually point them toward like some good or is he basically just going to kill all the",
            "start": 2490.08
        },
        {
            "text": "They're trying to find him. Yeah, I mean that's that'll be the interesting thing to see is like is he going to actually point them toward like some good or is he basically just going to kill all the like the Spider-Man's and the Daredevils of this little of New York right now. Yeah. I mean I wonder I don't I wonder if we're going to get more white tiger like characters like other masked heroes uh whether we know them or or don't. I think you have to right. I think you have to get a couple scenes of them being like tracked down and like killed. That'd be so sick. I just I don't I I would love that. I just I I struggle to think up who it would be, you know, because it can't be Spider-Man. I wish it was, but it can't be. Ah, Spider-Man would be [ __ ] incredible. But that's in a world where the TV shows make way more money than the uh the cinematic universe, and I don't think that's going to happen right now. Um, any any final thoughts on either of the Daredevil episodes? I mean, Greg, I",
            "start": 2523.68
        },
        {
            "text": "TV shows make way more money than the uh the cinematic universe, and I don't think that's going to happen right now. Um, any any final thoughts on either of the Daredevil episodes? I mean, Greg, I don't think you were here for episode four. Correct. Was for the Punisher one. Yeah. Fantastic. Phenomenal. Just [ __ ] awesome. And I think again that's again watching that the in the afternoon watching these two later on that's where I think there was maybe a disconnect for me of like I don't think these lived up to that bar but in general the series is fantastic. That episode was awesome. What an awesome scene. So cool to have them back together screaming at each other. Frank Castle, Matt Murdoch loved it, right? Just hiding out in the the the least conspicuous place. An old basement building with [ __ ] tons of guns everywhere. I think that's where the punisher lives. Uh I loved that. I loved we talked a little bit yesterday or last week about the philosophy of that episode too. Really",
            "start": 2561.76
        },
        {
            "text": "with [ __ ] tons of guns everywhere. I think that's where the punisher lives. Uh I loved that. I loved we talked a little bit yesterday or last week about the philosophy of that episode too. Really really kind of a an indictment of the criminal justice system or or or a defense for it depending on who it was talking to. So I liked a lot of those conversations which led me to slightly more disappointed with these episodes because we start talking. We're really getting into the vigilante. Are they good? Are they bad? Can you do good things? Can you be a bad person and do good things? Can you be a good person and do bad things? Yeah. What does that overall mean? But I don't think we're really nailing that home. We don't have a lot of those philosophical conversations. similar to how we had a great conversation with them two sitting down at the diner. I I love those moments in this and I think those are the those are the standout moments for me in the series so far. We got some super",
            "start": 2598.96
        },
        {
            "text": "a great conversation with them two sitting down at the diner. I I love those moments in this and I think those are the those are the standout moments for me in the series so far. We got some super chats to close this out here. Um David Flores says, \"After watching Daredevil, I'll never forgive Kevin Feige for Moonnight. We could have had all the cool street level Moonnight stuff from the comics.\" I mean, it's not too late. I know season 1 didn't deliver that necessarily, but clearly Marvel television is willing to go in a different direction now. So, I mean, if they were to make a season 2 that's like this, I'd watch it. It could be. Yeah, could be great. This is a well produced show. Very good. Um, Optimistic 92 says, \"Slightly early birthday tax. It's Friday, but I got to reach out during all the Marvel news. Love you guys. I'm so excited for Doomsday and loving Daredevil. Happy early birthday and thank you for hanging out with us for all of your Marvel needs.\" David N says, \"With",
            "start": 2630.48
        },
        {
            "text": "all the Marvel news. Love you guys. I'm so excited for Doomsday and loving Daredevil. Happy early birthday and thank you for hanging out with us for all of your Marvel needs.\" David N says, \"With all the old X-Men coming back, is there a chance this is also a bit of an Avengers versus X-Men film?\" Um, I think so. I don't think it'll at all actually adapt to the Avengers AVX story line, but I do think that you think this is an incursion of I think because of Battle World from Secret Wars. Like I do think Doomsday is going to start getting into that where there's going to be I imagine a fair amount of this plot is going to be different universes communicating with each other via the postredit scene of Beast from the Marvels, right? Um probably like talking to a Doctor Strange who was not Benedict Cumberbatch wasn't there. Interesting. And Scarlet Witch wasn't either. That's interesting. She did. Um, but having a back and forth between universes of like only only one of us can live, you",
            "start": 2670.96
        },
        {
            "text": "Cumberbatch wasn't there. Interesting. And Scarlet Witch wasn't either. That's interesting. She did. Um, but having a back and forth between universes of like only only one of us can live, you know, like what are we going to do here? And that that could be cool. Yeah, those foxes are dead though. Oh, yeah. Maybe not post maybe not until Secret Wars, you know. We'll see. Um, let us know in the comments below what you think of all the casting. Uh, and if you think all the X-Men are going to die in Doomsday. Uh, until next time though, if you are watching live on Twitch, keep hanging out. you'll watch the Pokemon Nuzlocke. Um, otherwise, uh, coming up soon, if you're a kind of funny member at the $25 Patreon level, you can join us for the happy hour. Uh, but until next time, have a marvelous day. [Music]",
            "start": 2711.6
        }
    ]
}