{
    "id": 13744,
    "video_id": "ezHTNn05YCU",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Kevin Coello",
        "Andy Cortez",
        "Mike Howard",
        "Karl Jacobs"
    ],
    "title": "Pokémon Nicklocke 2.0 (Part 10) - WE ARE SO BACK!",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://meundies.com/kindafunny and use code kindafunny to get 20% off your first order, plus free shipping on orders of $75 or more.\n\nGo to http://factormeals.com/factorpodcast and use code FACTORPODCAST to\nget 50% off your first box plus free shipping.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1742644042,
    "duration": 4245,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] Hello. 3 2 1. Yo, what the heck is going on? Kind of funny best friends and Pokemon trainers all around the globe. It's Friday and it's Mike and Nick in the afternoon and we're [ __ ] back. We're back. Uh, we're back. We had a great uh we had a great stream yesterday where we talked to you guys and thank you so much for everyone that called in. That was fun. I think we might do that a little bit more on the grindy grindy days. Um but today Mike surprised me. Mike said, \"Nick, look, I'm on the stream. We're probably only going to have an hour and a half to play and he and he decided on his own accord to come in a little early today, a little bit of a looser schedule and just sit here and grind for me off stream.\" And you did a really good job, Mike. Grinded. Grinded by the light as they are. up in a douche in the middle of the night. Kevin, let's take a look at where we find our squad right now. We got prime time, our level 28, fire dancers 29, Dudikov the dude at level",
            "start": 0.0
        },
        {
            "text": "as they are. up in a douche in the middle of the night. Kevin, let's take a look at where we find our squad right now. We got prime time, our level 28, fire dancers 29, Dudikov the dude at level 28. Could have got him a little higher. Uh muscle 27, not Nick at 28, and Wet Kev, Jesus Christ, how long did you grind for today? At 28. And there's also I left you a present as well. We won't reveal that present right now, but there is a present in the box as well. So Nick, you are kind of back on track. We've been grinding. We've recovered after a couple of jabs left and right. And uh we've brought ourselves back to kind of where we need to be. Are you going to reveal the present right now? Well, I saw we got one earlier that I saw. You want to see the present? Okay. So, I want to give a shout out, but we do. You want to do it? You want to do it? I mean, you can do it right now if you want. I got to look, man. I I was that kid that always used to peek inside the present. Take a look. Uh",
            "start": 62.4
        },
        {
            "text": "out, but we do. You want to do it? You want to do it? I mean, you can do it right now if you want. I got to look, man. I I was that kid that always used to peek inside the present. Take a look. Uh kind of funny, best friends. Of course, today I have been grinding for Nick and I've been doing my best not to catch a bunch of Pokémon, but I did unfortunately catch one Pokemon. We had a very special guest in the room with me. So, I do apologize to all of you out there. I didn't go on and name it after one of you cuz I did want to save that for us. But I did allow our guest to name a Pokemon because they were standing next to me. So, if you take a look, we have a mill tank that is now level 25. Holy [ __ ] Uh, we caught it at about 13, so I was really grinding the whole crew there. Uh, to all of you out there. Again, I apologize. I tried my best not to catch Pokemon throughout this. There were some other ones, so I kind of slowed down, but we did name one after Carl Jacobs. He was in the",
            "start": 106.16
        },
        {
            "text": "of you out there. Again, I apologize. I tried my best not to catch Pokemon throughout this. There were some other ones, so I kind of slowed down, but we did name one after Carl Jacobs. He was in the room with me. And so, Carl, uh, you have a level 25 mil. You might be on the squad. Uh, and so you are back now with a full six stack normal. Great. And, uh, a very strong Mil tank in the background. Miltank is uh becoming a freak. Is becoming a freak. Freak on a leash. Let's take a look at Miltank's move set here. Let's go into the summer cuz they have that great they can heal. Yeah, they've got all sorts of cool [ __ ] So, Roll Out is the one that almost destroyed us. That [ __ ] That shit's going to rock with you. That shit's going to rock with you. So, I wonder if roll out would help us uh in in the next run. I'm not quite sure. B. What is that? Let's look. Now, b is very cool. So, b the user will hold on to two turns. It will let the other Pokemon attack them twice, but then hit them",
            "start": 148.08
        },
        {
            "text": "in in the next run. I'm not quite sure. B. What is that? Let's look. Now, b is very cool. So, b the user will hold on to two turns. It will let the other Pokemon attack them twice, but then hit them back for double the damage taken. Interesting. And I didn't want to lose that. I had a couple opportunities where I could have taken that out, but I was like, you know what? I'll hold on to that. That'll be one we could lose later on, but I thought it would just be fun to hold on to. What was Dudikoff at? And then body slam right there. Seven. 28. 28. And then uh milk drink. You heal yourself. You a little milk in you. Ah, I had a little milk time. What is Wet Kev at? Uh, 29. And so, of course, that puts Nick kind of back in it. Kind of funny. Best friends. This is where I will turn to you uh poker trainers out there. Now that Nick is kind of back in a spot, we have a fun Friday here where we can kind of start moving a little forward. And so, we kind of want to talk about the lighthouse.",
            "start": 187.92
        },
        {
            "text": "poker trainers out there. Now that Nick is kind of back in a spot, we have a fun Friday here where we can kind of start moving a little forward. And so, we kind of want to talk about the lighthouse. Maybe we should go there. maybe we start moving towards the next gym. Of course, as you know, I'm similar to all of you. I have done the research and looked things up. And I know we're kind of close. I I would say that we're pretty close. Maybe not close enough, but like we're there where we could start moving towards that. But uh chat, you all let me know what you want to do today. Where's our vibe at? And let's go have some fun. What do you think? I love this. I do want to check in real quick with the emails. Of course, Nick Jansen has been uh giving us chart after chart after chart. So, I do want to check in. I believe he gave me one more chart and I want to just double check that we have to go through the uh all of our uh uh notes on everything to make sure that we are all kind of up",
            "start": 235.36
        },
        {
            "text": "do want to check in. I believe he gave me one more chart and I want to just double check that we have to go through the uh all of our uh uh notes on everything to make sure that we are all kind of up to date. Uh he has updated the t the chart with the milk tank now. That's great. Uh I don't know if that was always there but uh have you heard about John Cena Mark? Let's not forget about that. No John Cena. Have you heard about John Cena? Oh Mike you hear about John Cena? No. Dude, he's bad now. See, for 17 years, Mike, he used to be good, but now he's a badass. You didn't know about this? Oh my god, it's the craziest thing. I can't believe they did this. No one could have ever seen this coming. They didn't tease this out for 15 [ __ ] years. And finally, when John Cena's popularity starts to decline, they're like, \"Let's\" and he's going to retire cuz [ __ ] he wants to just do movies and be funny as [ __ ] cuz he's a great fun actor. He's been through Peacemaker, all these things. Oh,",
            "start": 277.44
        },
        {
            "text": "to decline, they're like, \"Let's\" and he's going to retire cuz [ __ ] he wants to just do movies and be funny as [ __ ] cuz he's a great fun actor. He's been through Peacemaker, all these things. Oh, no. He's a bad guy now. And The Rock's bad, too. Oh, he's a bad guy now. And there's something called the bloodline which apparent Oh [ __ ] The blood line a bad thing. I acknowledge usually when you talk you we talk about someone's bloodline like when you keep referring to the bloodline in a violent way. It's usually not good. But this is good. Oh no. No. No. All right. Let's get let's go. Let's go kill. Um chat. Strike first. Strike hard. Never go north. Never go north. We know that well. We know that. Well, what else? Was there anything else up there? Uh yes. If we don't quick attack, we don't die. Okay. Yeah. No quick attacks. That's good. No deaths, Andy. Anything else? Okay, chat. Well, I'm going to turn to all of you. I believe there's a poll up in the chat right now, which I'm",
            "start": 317.76
        },
        {
            "text": "don't die. Okay. Yeah. No quick attacks. That's good. No deaths, Andy. Anything else? Okay, chat. Well, I'm going to turn to all of you. I believe there's a poll up in the chat right now, which I'm going to go look at right now. I don't know what that says just cuz it's like uh that might be old. Yeah, I have no idea what that says up there, but I'm going to look at it right now. Uh I'm going to probably leave it up to the chat then, I guess. And I'll say chat, what do you want us to do? And I'll put a couple of things here. Um poll, new poll coming out, chat right now. [Music] Um let's go. Fire stone. So, here's some options that I'm going to throw out, chat. You can help me figure figure it out. Fire stone at the Pokey Olympics. Oh, we can earn ourselves fire to your V. We'd have to restart. That's okay. We can do that. I'm not saying we we go to the lighthouse. Lighthouse. Lighthouse. Um or I don't know what what's the third option, Chad. Is there a third option here? Go north. No,",
            "start": 352.32
        },
        {
            "text": "That's okay. We can do that. I'm not saying we we go to the lighthouse. Lighthouse. Lighthouse. Um or I don't know what what's the third option, Chad. Is there a third option here? Go north. No, we want to go either prime time. Idea. We want to We want We want to either go to lighthouse or we want to spend the rest of the day making Kevin play those games. Absolutely not. Those are great opport turns playing those games and see which one of us can can be worse at it. Spoilers, it's going to be me and Kevin. Um or we go take down the lighthouse. Lighthouse. Lighthouse. I want to get this thing a stone very badly. Okay. I'm I'm tired of this Vulpix being let's say it kind of weak. The Vulpix is kind of weak. I don't think I grinded. You have Yeah, you have grinded it. Yeah, but even then it was it was like literally not like the move set. Let's give me the moves. Oh, you got me flamethrower. You already got me flamethrower. Got it. Yeah. [ __ ] Yeah. Yeah. You wanted it. You got it. I",
            "start": 396.64
        },
        {
            "text": "was it was like literally not like the move set. Let's give me the moves. Oh, you got me flamethrower. You already got me flamethrower. Got it. Yeah. [ __ ] Yeah. Yeah. You wanted it. You got it. I did my very best not to [ __ ] [ __ ] up. I promise you. No, you're the man. I didn't want to miss moves. I didn't want Pokemon to evolve, but I tried my best. Well, we got flamethrower and that was going to be a big deal, but that's cool. Uh, it's not a big deal. I do want the fire stone, but I don't think we need that the that stone now, but it'd be cool. We really needed to get five the flamethrower cuz like man grinding that little prime time was real hard without it. Did you see that our friend Hip Albatross 23 just gifted out 10 tier one subs to the channel. Thank you, Hip Albatross. Of course, chat, don't forget, of course, throughout Nick's Nuzlocke 2.0, O, you can support the stream, the stream, and the team here at Kind of funny games by helping keep the lights and mics on with",
            "start": 442.88
        },
        {
            "text": "course, chat, don't forget, of course, throughout Nick's Nuzlocke 2.0, O, you can support the stream, the stream, and the team here at Kind of funny games by helping keep the lights and mics on with your support via Twitch subs. If you're over on twitch.tv/confunny games, if you gift out 10 subs anytime to our community, you get to name a Pokemon and you get to enter into win a oneof one Andy Cortez original art piece. You can see them over here. He's currently working on something else, but he's been taking a PB for a long time. He did leave the room and say the cheese might have hit him hard for the pizza. It was private, guys. Uh, well, he said it. He said it. If you want it to be private in the office, you keep it in your inner monologue. Keep it to yourself. Mike, look at how look at what level is. Windo is currently grown by 43 levels. So, Windo is at level 44, 43 window. I think it started at three, right? I think it started at zero. Was it zero? I thought it wasn't at five",
            "start": 491.32
        },
        {
            "text": "at what level is. Windo is currently grown by 43 levels. So, Windo is at level 44, 43 window. I think it started at three, right? I think it started at zero. Was it zero? I thought it wasn't at five when they hatched. I don't know. Either way, it's probably a monster. I'm telling you right now. Here's the thing. We've made a rule. We're not pulling this thing out of I know, but I want to see it. We're not pulling I just want to see. Hello, father. Hello, father. You know the wor to 43. We got to pull it out. The worst part of the Togepi is it doesn't involve uh or it evolves via friendship. Yeah. Yes. We have to do the whole thing again. Yeah. But if we pull him out, we should pull him out for one fight. Let him get a taste of blood and then put him back in. I don't think Let him get a taste of blood. Cuz if Am I crazy in thinking that if we pull the level 43 out right now and put him up against like 30s, he'll just But it's move set sucks. I don't know what his move set might be a",
            "start": 533.84
        },
        {
            "text": "taste of blood. Cuz if Am I crazy in thinking that if we pull the level 43 out right now and put him up against like 30s, he'll just But it's move set sucks. I don't know what his move set might be a little baby. The four latest moves and like two of them are just like the [ __ ] we don't do. Jer says daycare has been prisoned this month. What What's the Bane quote? I grew up in the darkness. He's like I was born in the darkness. Molded by it. Your ass is just visiting. That's what's going to happen here. Uh the poll is currently up on what you would like to see the team do today. A lot of love for the Firestone, Nick. I mean, look, dude, it's been Friday in a week. I would love nothing more than to go to the dome and just and burn it out with the Firestone. Let's If we're going to go burn it out, let's I think that' be a great way to end I think we could do it in the next hour. And I think that'd be a great way to end the week. Yeah, it's been a a really fun long week. We've done a",
            "start": 576.48
        },
        {
            "text": "it out, let's I think that' be a great way to end I think we could do it in the next hour. And I think that'd be a great way to end the week. Yeah, it's been a a really fun long week. We've done a lot of awesome things with GDC. Um, and we've done a lot of fun with that. So, uh, I'm going to burn this pigeon to death. That'd be so funny. Pidgey somehow kills you, dude. It's happened before. It'll happen again. Look at that thing. Oh, rotissery. Gone. Mike, I'm so sad. 28, baby. Dude, we're so back, bro. So, the squad is back. We're feeling good. I want to give a shout out. Mike, I think you were gone this day, but I want to give a shout out to Kevin to Andy because we were I think I could say this. I think it's I think it's fine to to to let this loose a little bit, but let it loose. Um, we talked offline, obviously, and we were all just so ready to quit and burn this [ __ ] place down. And then we got our gear dose and we thought, hope, but we're probably going to still get, you",
            "start": 623.28
        },
        {
            "text": "Um, we talked offline, obviously, and we were all just so ready to quit and burn this [ __ ] place down. And then we got our gear dose and we thought, hope, but we're probably going to still get, you know, we're not getting out of prison. They're not letting us out of prison. evidence just is too strong again. Got a chance to get on. We're just not getting the chair. We're not getting the chair, but we're still we're still [ __ ] And then we went through this little patch of grass, which I would actually like to I'd actually like to name this this patch of grass right now because this patch of grass is where grass this patch of grass right here is where we found our Vulfix. And Andy, you kind of remind me of a Vulpix a little bit. Thank you. It's a beautiful majestic animal. Great hair. Thank you. It's a good vibe. Things just really turned around when that Vulpix came into our life. I would like to I would like to name this little patch of grass the the Cortez gully. Cortez Cortez",
            "start": 669.76
        },
        {
            "text": "Thank you. It's a good vibe. Things just really turned around when that Vulpix came into our life. I would like to I would like to name this little patch of grass the the Cortez gully. Cortez Cortez courty got some better. Can we call it Andy time? Andy time. Yeah. I mean we were looking for more of a joke than I think Kevin but you want to call you want to call a patch of grass andy time. What was the Andy? What was your brilliance? I said Cortez gully like burn gully. A gully is I like you know what a gully is. I don't know what a gully is. I like the gully. Fine. What is it? Andy. Well, what about Andy Court? Like Cortez, but it's a you know like a little You mean that? That's what Andy just said. Oh, did he? Yeah. I just Andy, that was really good. We had a friend uh uh in in middle school and high school named William Gully. We call him Gully. Oh, okay. And he would always He's the guy who would always uh give us discounts at uh Pizza Hut. Oh, I love that guy. You got to have a",
            "start": 710.88
        },
        {
            "text": "school and high school named William Gully. We call him Gully. Oh, okay. And he would always He's the guy who would always uh give us discounts at uh Pizza Hut. Oh, I love that guy. You got to have a friend like that. My friend Tristan used to give me hook it up at Subway. Nice. It's always fun. Uh, let's see. Zrawn 2 Pro says Andy Alley. That's pretty good. That's good. How do we not think that? That's really good. Yeah. This will henceforth forever be known as Andy Alley. And this area right here will be called um the Triforce of Apricorns or Tricorns for short. I think you should probably go and exchange those at some point like cuz the the guy that's up to the chat. That wasn't an option. We are. We are going to participate in the Pokemon game. Are we? Yeah. All right. Fantastic. Let's go get ourselves a Firestone. Let's see this Vulpix become a Ninetaile. Should we find out what stone is available there today? We can. I think it's not going to be a Firestone though because it's a",
            "start": 759.84
        },
        {
            "text": "go get ourselves a Firestone. Let's see this Vulpix become a Ninetaile. Should we find out what stone is available there today? We can. I think it's not going to be a Firestone though because it's a Friday. I think so. I think it's only Thursday. It was Tuesday. It's only Tuesday that it's available. Well, go check it out. Well, we got to get points Tuesday or Thursday. We do got to get the points anyway. You can't you can't weasel out cuz we got to get points anyways. I mean, we're not weasling out. Woah. Whoa. Whoa. Why don't you [ __ ] Why would you use that verb, dude? Yeah, dude. What the [ __ ] man? Get your ass down there. I can't remember where this thing is. Let's see. He's in Andy alley. All right, Michael. He's in Andy alley. Let him be in Andy alley. Yeah, let him be in Andy's alley. I don't like when you say it that way. The fluorescent alley. Yeah. Look at him. This thing might do in handy. Vulpix. Yeah. Yeah. The uh Eevee did too, but we killed Eevee. Yeah, we Eevee",
            "start": 809.84
        },
        {
            "text": "alley. I don't like when you say it that way. The fluorescent alley. Yeah. Look at him. This thing might do in handy. Vulpix. Yeah. Yeah. The uh Eevee did too, but we killed Eevee. Yeah, we Eevee kind of sucked. Well, yeah. The Pokemon that uh the homie Dylan Cyber Bones Dylan said that I looked the most like it's an electric type. Okay. It's blue and yellow and like black chat. It's Oh, it's like the Pikachu looking one, right? I don't think so. Is it the dog Luxio? The dog. Lux. But look for Lux Ray. Lux Ray. Yeah. Um I Oh, no. It's that one. Yeah, Lux. Yo, you're right. You're right. Oh, yeah. That does look like you. No, go to Lux Ray, though. Oh. Um like the highest one. The highest evolution really does look like Andy. Yeah. Damn. That's That's what Dylan said looked like. It's crazy, too, because you have hair all over your shoulders and nothing on your stomach. I do. Yeah. That's wild. My ass, too. Hairy ass. Uh I want to give a shout out to the chat as well yesterday. Um",
            "start": 848.92
        },
        {
            "text": "crazy, too, because you have hair all over your shoulders and nothing on your stomach. I do. Yeah. That's wild. My ass, too. Hairy ass. Uh I want to give a shout out to the chat as well yesterday. Um because we had some technical difficulties yesterday. Unfortunately, I think the computer [ __ ] [ __ ] itself right at the end there. Yeah, that was right at the end there. But at because that happened, it it drew my attention up to the chat and I was like, \"Oh, right. I [ __ ] up. You have to have Dudikoff in the first spot for the bug catching thing.\" So, I backed out of that. That's why Vulpix is still alive today. Just so everyone got very lucky on that one. So, let's take a look here. Let's see where we're at pointwise and let's see what's in the store. Ooh, a metal coat. An item that can be held by a Pokemon, a special metallic foam that that ups the power of steel type. Oh, okay. Okay. A nugget. A nugget of pure gold that gives off illustri. Okay, we can sell that. That's probably",
            "start": 906.96
        },
        {
            "text": "be held by a Pokemon, a special metallic foam that that ups the power of steel type. Oh, okay. Okay. A nugget. A nugget of pure gold that gives off illustri. Okay, we can sell that. That's probably good. And some moon milk. So, no stone today. No stone today. So, we can just grind for some points. And then So, what do we need about 25,000? Well, what were we at? Let's see. We're at 200 right now. I thought we were 600. 675. So, we Yeah, we need uh 2500 total. Let's get after it. Let's see how you do with these. Got you, big dog. You want me to go sit over there and play? Why don't you do the the first time? I like that. I like that. I like I popped off on mine. Andy [ __ ] popped off. Now badly didn't make it. Would you like a jump course, a stamina course, a power course, or a skills course? Now, if you're going to give him a stamina course, so don't [ __ ] don't [ __ ] me and or don't [ __ ] Mike and give him weak ass tired Pokémon. Okay. Well, what you did with I don't think we",
            "start": 942.64
        },
        {
            "text": "course? Now, if you're going to give him a stamina course, so don't [ __ ] don't [ __ ] me and or don't [ __ ] Mike and give him weak ass tired Pokémon. Okay. Well, what you did with I don't think we have any of those left. Mike spent his entire morning for like the last 6 hours just grinding [ __ ] for us. Oh, okay. All right, I'm ready. All right, let's do the stamina course, Mike. Now, you're going to have to step in. What do I have to do? Your mic is hot. Yeah. What do I do? So, you are going to as we come in Yeah. Uh, it's going to start the games and then it's going to give you a little tut on how to beat the game or how to play the game. And basically, Mike, I want you to think of these as this is a Nintendo DS game, right? Yeah. So, everything's with the stylus. So, it's click in and flick. A click in and let go. Like that. A click and hold. Click and hold and let go. It's a click, hold, and as you flick, let go. Okay. Pretty much that's all you need. A little a little",
            "start": 987.2
        },
        {
            "text": "in and flick. A click in and let go. Like that. A click and hold. Click and hold and let go. It's a click, hold, and as you flick, let go. Okay. Pretty much that's all you need. A little a little something like this. Unless it's the brick breaker thing, in which case it's just a tap. It'll tell you. All right. All right. We're doing stamina. So, you have to look through your Pokemon, see which one has the highest stamina. Who would you like in your in your the dose? I'd like the woodman. [Music] Yep. Dude cough. Oh, yeah. All right. So, exact same team as I chose for Andy. And Andy, I would like an apology. No, it was a different team. No, it was a different team. I had somebody where I only was I only broke like three bricks and they were tired. I was like, \"What the [ __ ] Why are you already tired?\" I think that was muscle, right? Oh, yeah. It was Machamp. Do I click on the small one or the big one? Uh, we're okay now. We're just starting the game. You're okay. We haven't started",
            "start": 1024.24
        },
        {
            "text": "already tired?\" I think that was muscle, right? Oh, yeah. It was Machamp. Do I click on the small one or the big one? Uh, we're okay now. We're just starting the game. You're okay. We haven't started the actual It's so slow. But you have You're going to play with three all three of the characters. Yeah. So, just be aware of that. But you're a gamer. You're going to figure this out. We'll figure it out together. We'll start off slow. Hear the crowd popping off there for you, Mike. So, event number one, give the instructions. Ring drop. Oh, okay. Here. So, you're just going to tap on it and pull rivals out of the ring. Use the stylish to move. Clickly flick to tackle. So, this is like king of the hill. You got to just push out to jump. But I think is the flick to tackle like you click and release the click. I We're gonna find out. I think it's grab and and push and you'll slam people. I don't think you hold it. Yeah, you do. Oh, never mind. Go for it, Mike. Interesting. So, I click,",
            "start": 1065.76
        },
        {
            "text": "release the click. I We're gonna find out. I think it's grab and and push and you'll slam people. I don't think you hold it. Yeah, you do. Oh, never mind. Go for it, Mike. Interesting. So, I click, hold, and flip. Yeah, unless you need to jump on the mini screen on the big screen. Big screen. Big screen. So, you just can knock him out. Knock him out. Look. Click on your guy. Click on your guy to knock him out and flick him. Yeah. See, this is the game I did. I I think they're wrong. I think you have to release the the click. Okay. Look. Well, yeah. That's what we're saying. Yeah. You have to release as you're flicking. Yeah. All right. What is that stylus? You You click and hold. You hit You're talking a lot for a man that hasn't played the game yet. All right. It's I'm just reading the He's reading the chat directions that were written for children. No, there Oh, there's my first one. Yeah. See, it's working. Getting your ass. It's not working. I think you got to spin on that. Put a",
            "start": 1105.12
        },
        {
            "text": "reading the chat directions that were written for children. No, there Oh, there's my first one. Yeah. See, it's working. Getting your ass. It's not working. I think you got to spin on that. Put a little English on it. Tap as a jump. I don't know if that helps you at all. T probably like helps you avoid people dashing at you. There you go. [ __ ] He's not doing well. Yeah. No, this is bad. This is like really bad. You see, this is what I have been. This is the first game. This is the first game. Don't worry about it. You're going to break it up and you're going to uh make it up in the hard dump. Oh, I learned how to do it finally though for the first time. What is it? What is it? It is a click and flick. So, it's a click into your character and then flick the way you want to go. Do you release it? Not a hold. It's a click and then just Yeah. So, you release it right away. Yes. That's what Andy and I were saying. Hit the [ __ ] out. That's what you're saying. That's what we've been",
            "start": 1148.32
        },
        {
            "text": "release it? Not a hold. It's a click and then just Yeah. So, you release it right away. Yes. That's what Andy and I were saying. Hit the [ __ ] out. That's what you're saying. That's what we've been saying for the last five minutes. Press the button. The stylus click in and flick. You can't keep holding when you're flicking. Can't keep holding when you're flicking. We got you. We got two points from that, Mike. We got one person points here. That's my first win dunked on us with [Music] 108 time. It was Mike's first. You're going to be fine. Click and flick to dash. Start. Okay, you got this, Mike. Now, this is a dash. You got to watch out for the um stones. So, you're going to flick in the direction you want him to go, and he's going to go hard. And you can switch out when he gets tired. There you go. You got this. You got this, big dog. Look at that. He'll get tired in a little bit, and you're going to flick it. How do I flick him out? You'll switch it. You'll hit that big button on",
            "start": 1188.56
        },
        {
            "text": "There you go. You got this. You got this, big dog. Look at that. He'll get tired in a little bit, and you're going to flick it. How do I flick him out? You'll switch it. You'll hit that big button on the top of the switch once you see him start like sweating. Yeah. Oh, you got to go faster than that, Mike. Yeah. We're getting [ __ ] burnt down, dude. You're too far. You're flicking too far, Mike. Just little click. Little flick. Little flick. Now, we're burning. Oh, wait. This mouse corner is so [ __ ] tight. I can't move it. So, it's really not easy. Yeah, but Oh, yeah. Oh, there it is. Oh my god, he's [ __ ] killing it. Okay, I'm off the I'm off the screen. I'm off the screen. Okay, we're not last. I don't know why. We didn't need to switch out. Well, there's this guy right here. There's Ponytail. Get Barrett before he leaves. We might need to get Barrett for this. I'm just saying. I don't want to be here all night. I'm going to go see. I think I did this one the first time. We are",
            "start": 1226.56
        },
        {
            "text": "Ponytail. Get Barrett before he leaves. We might need to get Barrett for this. I'm just saying. I don't want to be here all night. I'm going to go see. I think I did this one the first time. We are not playing to Mike's strengths though because this does require Mike to be able to see what's in front of him. Two feet. That is true. Yeah. No, I can't see far away. Oh, you're farsighted. I can see the people. You got You got to get around those, big dog. You got to see those coming. I can see these people. It's very difficult to turn up and down. I want Yes, we know this, Mike. We know. That's why we made these cuz all of us have been where you're at right now, and it doesn't get any better. Switch. Switch. Switch. That switch has to come faster. Nice. Lap seven. We are currently in I think last. Come on, [ __ ] Get down there, dude. How is Dude, yellow is murdering us right now. Ow. New record, Mike. Nice. You crushed it. Uh Barry said we can go [ __ ] ourselves. Okay, good. Good to",
            "start": 1261.04
        },
        {
            "text": "last. Come on, [ __ ] Get down there, dude. How is Dude, yellow is murdering us right now. Ow. New record, Mike. Nice. You crushed it. Uh Barry said we can go [ __ ] ourselves. Okay, good. Good to know. I expect a hard no on that. Hard pass on that one. Hard pass. Okay, we'll sh last [ __ ] last place again, bro. [ __ ] It's a hard game, dude. Don't even feel that one sucks. I I really do feel like this one does not translate that well to touch the blocks to So all you're going to do is smash the box, but you have to you have to switch out fast though cuz your guy's going to run out of stamina fast. So get through that pile. You get through two piles with Gar. You got to go down with the pile, Mike. Go down with the pile. There you go. All right. [ __ ] yeah. [ __ ] yeah. Break that. Get that [ __ ] Break that button. Nice, Mike. Nice. Nice. Nice. Nice. Yes. Switch. Switch. This is where the comeback starts. Look at I did really good on this one if we remember. Look at Dudikov. Kevin",
            "start": 1306.12
        },
        {
            "text": "that [ __ ] Break that button. Nice, Mike. Nice. Nice. Nice. Nice. Yes. Switch. Switch. This is where the comeback starts. Look at I did really good on this one if we remember. Look at Dudikov. Kevin had 89. Switch. Oh, you switched too many times there. Garrett, you took care of those out. Nice. Mike has the record. Is on a level. That's cool. That's just so much better than Kevin. Woo. It was four. Two. I think he did two more than I did. Blew your Oh my god, dude. Blew your ass out of the talk about you in history. No one even explained the switching thing with me. I just kept yelling, \"Switch, switch.\" Ace fan. That's a big button. Yeah, but I'm just looking at the middle of the screen. This is my favorite narrative that we've developed so far is that just Fun fact, Mike, I really didn't want to play. They made me. You got to do it for the team. One of us are locked in this journey together. Everyone's going to have to pull a little bit. So, if we keep getting last place, we have",
            "start": 1354.88
        },
        {
            "text": "want to play. They made me. You got to do it for the team. One of us are locked in this journey together. Everyone's going to have to pull a little bit. So, if we keep getting last place, we have to do it 10 times. That's how much it adds up to to get But it's 200. But Mike didn't get last place. No, I got last place. Oh, you got Yeah, he got last. Even with that final round. No shame. No shame. No shame. You know, I got last place, too. But even with the rocks, he got us first place, didn't you? Yeah. And he was going to do it again. Yeah. Popped off five more times. Last place you get 200. First place you get like 350. No [ __ ] Yeah. It's really not that big of a run. It's going to be a long day either way. Well, we have an hour. Uh-oh. Arrow loading six slot. I don't know what that means. We're fine. We're fine. We're fine. Uh, Mike, I'm going to take us back in. I moved the keyboard. I think it freaked out. Yeah, I think you pressed the button. Put me on something different. We",
            "start": 1406.64
        },
        {
            "text": "We're fine. We're fine. We're fine. Uh, Mike, I'm going to take us back in. I moved the keyboard. I think it freaked out. Yeah, I think you pressed the button. Put me on something different. We got 208. You want to try one more time? Yeah. [ __ ] yeah. I'm locked in. I'm locked in. Maybe hit save cuz I think Mike was trying to load. I just loaded a [ __ ] DOS file. Yeah, I got it. Don't make me press buttons. Yeah, dude. I want you fresh for this next. Don't make me press. How did you just hit an F6 button? Doesn't know what he I don't know how I did that. It might have been the wire. Mike's Dude, Mike, I need you locked, bro. Thank you. The wire's tight, dude. Don't worry about the wire. Tight wire. Nobody told me. We should worry about the wire. Told me about that. He's right. No one told me. Nobody told him that people needed to move the wire. Worry about need to stand up. We need to sit down. We need to stand up. Sit down. That is true. I got to tangle up the wire some slack. The",
            "start": 1446.48
        },
        {
            "text": "me. Nobody told him that people needed to move the wire. Worry about need to stand up. We need to sit down. We need to stand up. Sit down. That is true. I got to tangle up the wire some slack. The speed course, the skill course, or the power course, the jump skill course, dude. Skill. Okay, got hella skill. That's got Mike written all over it. We're figuring out the buttons as we go. Morph me into my jammies. Aceman looks different. I'm different. [Music] What do we need here? So now, uh, this is the skills course. I imagine we need skill. Oh, there's skill. Okay. Okay. Yeah. So, we don't have a lot of a strong skill family here. We should remember that. Yeah. I'm just going to give you everyone that's got three. Yeah. Yeah. But you got this, big dog. We're a power family, I think, if we go for it. We probably are a power family. Yeah, we're definitely a power family. Who's that one group of weightlifters that like use the power of Jesus? H they like do prayers. They do prayers and",
            "start": 1482.16
        },
        {
            "text": "go for it. We probably are a power family. Yeah, we're definitely a power family. Who's that one group of weightlifters that like use the power of Jesus? H they like do prayers. They do prayers and they like um like use the power of God to like lift crazy weights and stuff. Remember that back in the ' 90s? It's like a like I I would put it next I would put what I'm talking about in the same category as um uh who are those obstacle course uh fighter guys in Yeah. I would put like it was around that sort of era. That's I've seen him on Power Team Power Team. Thank you, chat. Power team. What was the family in Seinfeld that like they kept they kept like trying to get Seinfeld to like see if they can lift more than him or something and they kept going to the hospital cuz it was like a grandpa. Who am I? Uh you're top. You're you're red. Oh no. Oh no. Where's down below? Oh, you're down below. Yeah, you're looking at people. I don't know how you're going to do this. You can't see them.",
            "start": 1535.04
        },
        {
            "text": "Who am I? Uh you're top. You're you're red. Oh no. Oh no. Where's down below? Oh, you're down below. Yeah, you're looking at people. I don't know how you're going to do this. You can't see them. Yeah, this sucks. Wow. We picked the wrong thing. Oh, you have to do it down here. Yeah, you're clicking down there. You can't do it on the top side. Interesting. That's weird. Well, you got six points. Keep going. Just keep dunking on that uh slowpoke. Look how innovative. Don't [ __ ] dunk on these guys. Playing that. Yeah. Hey, pin this. Where is this? There you go. [Music] Help me. You're doing great. So far. You think I'm close? Yeah, I think. You don't think Chaz has got a bunch? [ __ ] Chaz. Chaz. I don't know where my snowballs are going. Carl, that's exactly how you fit in. You You just got to get in. There's never knowledge required. Love the things that we love. I'd love to wholeheartedly agree with everything. That's what we do. Sucks. You got eight points, Mike. Not bad. Nice,",
            "start": 1590.8
        },
        {
            "text": "got to get in. There's never knowledge required. Love the things that we love. I'd love to wholeheartedly agree with everything. That's what we do. Sucks. You got eight points, Mike. Not bad. Nice, dude. Not bad for not knowing where my Pokemon. What did everybody else have? Probably like 30 points. Let's see what happens. Oh, we got Wow, that was a big margin. Can't even throw that one at Chaz. Chaz kind of rocks actually talking about it. Chaz was second place. We should have been better at Lionel. Yeah, let's hang out with Chaz. Um, get the ball in the Oh, and SL around flash flick. This one was hard. Mike, but you're really good at fall guys and this is kind of like Fall Guys. Is it kind of fall guys? So, this one you have to control. You're all red. You have to control your dudes all keep back for D though. Keep him backward deep. Yeah. Yeah. Take that ball all the way to the end. How did the wood man go by himself? He just felt it. Oh, wood guys. That's not your wood guy.",
            "start": 1642.4
        },
        {
            "text": "all keep back for D though. Keep him backward deep. Yeah. Yeah. Take that ball all the way to the end. How did the wood man go by himself? He just felt it. Oh, wood guys. That's not your wood guy. There's two wood guys. There's two wood guys. M. They got a wood guy. Mike, that's not your wood guy. Your wood guys at the bottom. Your wood guys at the bottom. Sudo wood. I almost called. No, that's not That was them. Yeah, there's no defense. Mike, your your lamb is in the [ __ ] top right. Your lamb is over there. Mike, I don't think this is Yeah. Yeah, there come on. Oh, that was that wasn't your point, Woodman. Widow, great job. Great job, Wood. Get over there, Lamb Chop. He's scoring his own goal. Yeah, it's really going negative. I didn't know you can go negative in soccer, but you can do that. Like any goal, get the ball in any goal. I think I three own gold on mine. Come on, Woodman. But then the red the gold ball is five points. Yeah, get the gold ball, Mike. Just the gold ball",
            "start": 1686.08
        },
        {
            "text": "do that. Like any goal, get the ball in any goal. I think I three own gold on mine. Come on, Woodman. But then the red the gold ball is five points. Yeah, get the gold ball, Mike. Just the gold ball will pop up soon. Yeah. Come on. Oh, that [ __ ] is tough. Leo Messi just scored that with one at the end there. Mike, there's two balls, Mike. Two balls. Put him in the middle at least. No, he's leaving. Let's go. That's you. You're doing that. He's not leaving. Oh, man. You didn't even get credit for that cuz it touched blue. They got a negative one. Man, there was two balls there. What are you doing? I've never seen Mike be this bad at a game. [ __ ] This is a disaster. The low scoring soccer game ever. Oh, that was you. Hey, that's two points. No, he was at a negative three. That's why. Oh, I think he was in a deficit. Let's not look at Chaz's score. Whatever we do, Chaz Chaz [ __ ] rocks, dude. I think we might have said, \"Oh, I beat not bad [ __ ] line, dude. I told you lineage,",
            "start": 1730.08
        },
        {
            "text": "Oh, I think he was in a deficit. Let's not look at Chaz's score. Whatever we do, Chaz Chaz [ __ ] rocks, dude. I think we might have said, \"Oh, I beat not bad [ __ ] line, dude. I told you lineage, dude.\" Lionel Messi. You follow uh Ronaldino? Ronaldo. Those are two different people. Yeah, there's one one's from Brazil. The other those guys. He's living the life, man. Ronaldo. Ronaldo is the He's got a YouTube channel now. Here you go, Mike. Get there. Carl met him. Carl took a photo of it. Did you? I took a picture with him. Is he that good looking camera? Whatever you're picturing. Far prettier. Mike, you got to bring those flags back. Bring them back. Bring them back. Bring them back. Bring them back. Oh, that's awesome. Yeah, he's This is a cool game. I like this one more than the other one. He's just Every time I log on, he's on a yacht with his wife. Mike. Mike. Student Widow. Slow. Is he all the same speed? Mike, get it back. Get it back. Get it back. Return. Go back. Go back.",
            "start": 1778.24
        },
        {
            "text": "one. He's just Every time I log on, he's on a yacht with his wife. Mike. Mike. Student Widow. Slow. Is he all the same speed? Mike, get it back. Get it back. Get it back. Return. Go back. Go back. Yes. Yes. Yes. We're crushing. You got it right here. Just go up up. This really adds a different element to this whole nuzlock. I like it. It's a really disappointing element. If they lose, they die. Come on, Mike. I'm trying. You're going so crazy with it. You got to be more precise. I'm not [ __ ] going crazy. I'm [ __ ] be more precise. Dude, I really feel good about your run though. I'm gonna be honest. Thank you, Carl. 3 seconds left though. Maybe bring it back. Bring it back. Bring it back. No. God damn it. 21 is really good. It's a new record, dude. I think that might be Put me on the power event. If you had made it back, why is this game so [ __ ] hard? It's a It's amazing with a stylus. Jesus Christ. But like give us a break. Give us a break. You have your uh What's that? That my",
            "start": 1830.8
        },
        {
            "text": "event. If you had made it back, why is this game so [ __ ] hard? It's a It's amazing with a stylus. Jesus Christ. But like give us a break. Give us a break. You have your uh What's that? That my wake tablet. Wait, what happened with the other Squirtle? It didn't go well. I want to redo it. It looks so A lot of people in chat really like Well, but but I want to what I want to do is take the blue and watercolor it out into here like a Oh, then I got to talk about this. Make the rest of it lighter, you know? Okay. Mike, would you like to take a break? Would you like me to try? No, I want to do one more and then you spot. Yeah, please take me to the power event. We're almost there. We only need like 15 more of those. Yeah, that's a lot of events. Where you going? We got till five. Yeah, I thought Did you tell Carl what we leveled up his Pokemon to? What was he at? 28. 24. 24. Mil started at 13. That's going to be it. You're going to get a wild text from us in like 17 weeks when we beat",
            "start": 1882.64
        },
        {
            "text": "Did you tell Carl what we leveled up his Pokemon to? What was he at? 28. 24. 24. Mil started at 13. That's going to be it. You're going to get a wild text from us in like 17 weeks when we beat this. He died. hard to eradicate. Just got taken down by a level 16 radicate. He was utterly demolished. Oh, there it is. We're We're here. We're here. [ __ ] wheezing self-destructed. Terrifying. This game's terrifying. Oh man, we somehow earned less points than last time. No. Yeah, we got 194. How is that possible? They're giving us fewer points. I played better that time. They're giving us fewer points. Back on. He's He's a winner. What do we want, Mike? The stamina the power course the power course. Did we try that already? No. We have power mons. We want the one I did was the easiest and I can't remember what that was. The jump course stamina. No, I don't. It was It had It was very easy. We need the race is easy and we need the brick breaking thing cuz we're dominating. Pretty [ __ ] up",
            "start": 1934.48
        },
        {
            "text": "remember what that was. The jump course stamina. No, I don't. It was It had It was very easy. We need the race is easy and we need the brick breaking thing cuz we're dominating. Pretty [ __ ] up that like this is straight up. This is power. Power. What's power? Oh, power. Got it. Chop. Yep. Gyarados. Oh, dude. Freak. No, we're going to put him in the front. Freak. He's freak. He's going to win this for us. He's a freak. Dude, look at that, dude. Not Nick. Come on. And Kevin hated not Nick. Still do. Leveled it up. I think this I I think this round of Nuzlocke weaker on the names. Really? I think our names last. It's their fault though, not ours. They're less sexual. Oh, yeah. Way less sexual. Way less sexual. We had a drowsy named Poon. Yeah. Yeah. that we had a mankey named Puzzi. Oh yeah, Pocus. Cuz that's what I named my Dune popcorn bucket. And we loved that at Pokemon. We kept say you're putting the Pocusi on a pedestal. Well, that's very good. All right, Mike. Pay attention.",
            "start": 1984.4
        },
        {
            "text": "yeah, Pocus. Cuz that's what I named my Dune popcorn bucket. And we loved that at Pokemon. We kept say you're putting the Pocusi on a pedestal. Well, that's very good. All right, Mike. Pay attention. You're just going to bounce. Touch the block. Touch the blocks to strike. Oh, we crushed this one. Ready? Yeah. This is I'm ready. You got this. I'm not even going to get in your head about this at all. I got this one to I would tell him to switch. I would tell him to switch. [ __ ] yeah. All right, you have a mouse on this one, dude. You're insane. Oh my god. Yes. Oh my god. No. You got to switch it out. I thought you switch it out. The greatness. That's what happened to me. That little guy sucks. Machoke sucks. We talked about it. Why is Machoke choking on this thing? Switch it out. Switch it out. Switch it out. He's tired, dude. Gyarados is a monster. Yeah, he was not even He just broke his That's a bond right there. We're at 100. Triple digits. That's a Oh, I dominated my competition",
            "start": 2038.72
        },
        {
            "text": "it out. Switch it out. He's tired, dude. Gyarados is a monster. Yeah, he was not even He just broke his That's a bond right there. We're at 100. Triple digits. That's a Oh, I dominated my competition there. You just crushed that, Mike. We might just be a power competition. We are power competition. Look at that. 100. We know where we need to tell Chaz we're back. [ __ ] you, Chaz. Took a breather. Yeah, Chaz is got Mandy and Mac. I just picture Mike yelling, \"Where's Chaz at?\" They're like, \"He's not left. His mom picked me up 20 minutes ago. He won last week.\" Okay. This is This is like This is like You got to be in the circle, Mike. Get in the circle. All right. And then got here. Be in the smaller circle. Circle. You got to push them out a little. Push them out. Yeah. Push them out. Bully them a little. All three of them have to be in the circle. I'm going to get them in. I'm going to get them in. Point for being in the circle. Pseudo. Yeah. Knock them out. Oh, they're pushing out",
            "start": 2086.24
        },
        {
            "text": "them a little. All three of them have to be in the circle. I'm going to get them in. I'm going to get them in. Point for being in the circle. Pseudo. Yeah. Knock them out. Oh, they're pushing out your boys. Yeah. Yeah. Stay in. Stay in the Stay in there. How do you pull people out? Body them in. Body them in. Like the the heavier the Pokemon sometimes the weight will push them out. Saying [ __ ] that purple wants more points. Purple wants more points. Be in the purple. Be in the purple if you can. 10 for him. I'm going to be in the purple. Blow him out. Blow him out. Blow him out. And the arrows are orange when they're in. Get the Oh no. Only one. Mike. They can pro stride. They can be in either circle. It'll count. Yeah. Yeah. Yeah. Yeah. Yeah. You can put two up there and one up there. I think you're fine. I don't think they have to be in the same circle. I may have made that. Get in there, Big G. Feels so right, though. It does feel right. Come on. Oh, that's two. That's two.",
            "start": 2135.2
        },
        {
            "text": "I think you're fine. I don't think they have to be in the same circle. I may have made that. Get in there, Big G. Feels so right, though. It does feel right. Come on. Oh, that's two. That's two. That's two. We're in. That's two. Two in the two in the sweet. One in the pink. Five far right. Get your guy in the pot. There you go. Just keep Gyarados there and bully him out. There you go. Gyarados is heavier than all. Yes. Yes. Yes. Michael, he's up. He's the radiator. He's too hot. Oh, Mike, you got that. You got that. Well, dude, why? I got I'm holding them. You're good. You're trying. No, dude. Uh, Mike Kilder's pseudo is going to take this top spot, bro. Look at Gyarados all by himself. Get your guy back in. Get your guy back in. Nobody's interested. Nobody's battling this squad. Nobody would dare. Chaz is in the stands right now, too. Freaky. Chaz texting his mom, \"Get me now.\" before they call me next. Bring the Winnebago now. Did you get there, Mike? Look at you. Oh, big points.",
            "start": 2170.56
        },
        {
            "text": "would dare. Chaz is in the stands right now, too. Freaky. Chaz texting his mom, \"Get me now.\" before they call me next. Bring the Winnebago now. Did you get there, Mike? Look at you. Oh, big points. That's That's huge. I think we could We're going to call this one. Let's see how many tickets we get. Wait until we get number one throughout. Like win the whole championship and they give us 100 extra points. All of your hard work. Oh. Well, the good news is you did good enough in the past two ones. Yeah, that is right. That is right. We should keep track of how many points we have, too. Oh, this is not your game, Mike. Keep those in the back field. I'm going to keep them in the back. Actually, let's throw Gyarados in the goal. You know what I mean? Carl, you Oh my god, it didn't go well. That guy scored. Got kicked it so hard. Danny Phantom. Oh, that's my point. That's your point. Just stay there. Stay in the goal and just stay. I'm trying get him to the wood out. Shoot out. I get it.",
            "start": 2216.4
        },
        {
            "text": "guy scored. Got kicked it so hard. Danny Phantom. Oh, that's my point. That's your point. Just stay there. Stay in the goal and just stay. I'm trying get him to the wood out. Shoot out. I get it. Mike, get that Gyarados back in place. D up, dude. D up. Yes. Nice. There you go, dude. That's the strat. Deflect and and move. Go faster than him. Yes. I'm going freak mode. You give him two seconds, he'll give you the gold. Oh, that gold is really important. Oh [ __ ] Get it out. Oh no. Clear that out. Get your boys back. Beat him there. That's just not true. That's unbelievable. This guy's a fe That echkins was just useless getting released that Woo's going free on him. I think it might be right. I think they kind of put the rest of the children in Argentina. Oh my god. What's happening? Woo. Stop protecting their goal, dude. Score that. Machamp or Mach. Mike, don't pull your bike. Don't pull your goalie. What are you doing? Don't pull your goalie. No. What are you crazy? Put it back in.",
            "start": 2256.48
        },
        {
            "text": "Stop protecting their goal, dude. Score that. Machamp or Mach. Mike, don't pull your bike. Don't pull your goalie. What are you doing? Don't pull your goalie. No. What are you crazy? Put it back in. Put it back. [ __ ] [ __ ] goies. [Laughter] What are we doing? Nice. Mike, that's you. My people just chill in the yellow base. Do something, man. Woo. Dude, the fans are going to be calling for the coach to get fired. That was a goddamn meltdown. I've seen worse, but not many. Oh my god. Third place, Mike. Oh my god. I could have won that, dude. We got JG. JG in the YouTube chat says clutching defeat from the jaws of victory. Man, really fell apart there. I think we still got first, though. Yeah. No, the the points. I think I think we're going to be in second. No, that's first, bro. That's first. Two first place and a third. You think so? Well, it's us versus team blue here. I guess you're right. Mandy's Clifford. I love how slow it goes, you know. Yeah, let's keep this going. Can you",
            "start": 2312.24
        },
        {
            "text": "first. Two first place and a third. You think so? Well, it's us versus team blue here. I guess you're right. Mandy's Clifford. I love how slow it goes, you know. Yeah, let's keep this going. Can you skip this? I'm trying. I'm skipping through. Press plus. Plus, plus I'm power. I'm power. Okay. Oh, you know, we got enough. Okay. I was like, we won. Nope. Maybe. Yeah. Oh, yeah. Oh, that's a dominant one. That was event one. Oh, Jesus. Oh, yeah. Oh, yeah. See you. You have enough of a lead that you don't need to worry. Fear now. Yeah. Almost blue took that contact. Cuz the the last event you didn't win, right? Look at our team. Oh yeah. Look at that. So the team we wanted. It's the team we can afford. How much we get? How many pick How many did we get? We're battling for a Firestone here. 350. I think Sudo is like the epitome of he thinks he's part of the team. Yeah. Doesn't get it. He He went from like humble to cocky reel. Yeah. See what they He's going to ask for a big contract like",
            "start": 2373.2
        },
        {
            "text": "I think Sudo is like the epitome of he thinks he's part of the team. Yeah. Doesn't get it. He He went from like humble to cocky reel. Yeah. See what they He's going to ask for a big contract like nah, we don't need that. That whole second half of that soccer one waso sitting in the yellow while Mike kept screaming control. That's amazing. Are we only 100 points there? No. No. You receive an extra 100 on 47. So let's go take a look. Let's see where we're at. We're like uh 1,00200 1529. Oh,000 away. 1,000 away. Oh, too easy, dude. Two first place victories. Does anybody else want to try? Anybody want to try their mic? Try. Uh, no. I'm gone. Can I You want to come? I was walking in here to tell you guys I was about to call an Uber, but I'm going to stay for this happen. Get us a,000 points right now. Perfect. [Laughter] I need a candy bar. I need a candy bar. One, two. What? All right. So, we're going to do the same. Do we want that one or do we want to try the jump course? Might be a",
            "start": 2419.92
        },
        {
            "text": "right now. Perfect. [Laughter] I need a candy bar. I need a candy bar. One, two. What? All right. So, we're going to do the same. Do we want that one or do we want to try the jump course? Might be a little easier, too. Okay. Do the jump course. Carl, what would you like to pick? I'm down for whatever you guys think. Is there something you eat or something? Do I What should we pick here? No. No. He's going to handle it. Uh Ooh, that's a fun one. So, we did the stamina course, the skill course, and the power course, right? I mean, let speed or jump. I wish we could keep Carl here. He's so out of breath. Why? I just say Carl, let's give Carl everything. Let's just have him do them all. You know what I mean? What is the best candy bar? Uh, I think the speed is that candy bar. Let's do the speed course with car. Let's just give him the speed course. They're all candy bar. This is from Switzerland right here. This is a good candy. There's only like six games. Hey, why did we do the jump",
            "start": 2480.72
        },
        {
            "text": "speed course with car. Let's just give him the speed course. They're all candy bar. This is from Switzerland right here. This is a good candy. There's only like six games. Hey, why did we do the jump course? We've already seen the speed course. Did we? We've done the jump course with Barrett. Well, as long as we didn't already change our elf. Yeah. Okay, so we need speed. And speed is not our strong suit here. Oh, wait. Yeah. Are you guys screwing me over here? Maybe a little. Yeah, we got to make sure we play to our strength for this. Yeah, we need power. So, we can cancel this. Let's go do power. Let's do Let's do the jump course. That sounds cool. I like this. Huh. It's very competitive. Yeah. Mhm. I want to set I want to set Carl up for success here. Look, I'm here. We need a thousand. I'm trying to make him get a stat. That's a [ __ ] gamer, dude. Okay. Two attempts. Here we go. He gets it. Where are you taking him? We're going to I'm taking him right back. So, we need the jump",
            "start": 2529.52
        },
        {
            "text": "I'm trying to make him get a stat. That's a [ __ ] gamer, dude. Okay. Two attempts. Here we go. He gets it. Where are you taking him? We're going to I'm taking him right back. So, we need the jump course. Jump. I don't like the speed course. We don't have speedy. We don't like we we're Yeah, we're we're blocks of cement here. We're not doing great. So, we're going to do the jump course, which I assume we have. Yeah, we got the dose. Oh my god. Look at the That bird's got up. But look, but but for a second, two star for stamina. Do we think we give Gyarados that lead? It's a really good call. He got the stamina and the jump. Uh, we can freak. Yeah. Yeah. You want to put him up front? That's an all-star athlete right there. He's just a specimen. Yeah, he can do both. Well, he ain't got speed. Wait, we doing jump right now? Doing jump. Comes from a family of athletes. Order also doesn't really matter. I mean, we don't I got to put you in for here. So, here we go. Okay. We We jump with",
            "start": 2576.32
        },
        {
            "text": "Wait, we doing jump right now? Doing jump. Comes from a family of athletes. Order also doesn't really matter. I mean, we don't I got to put you in for here. So, here we go. Okay. We We jump with the Vulpix. I like that. Let's go. Get him to hop. So, I'm using this is my This is me right here. No, you got to use the big one. Some games switch. Okay. So, you just got to sort it out. You know, we got to jump. Stop looking at the Costco guys and focus on this. The giant bomb guys got the Costco guys. They got the Costco. They got the Costco guys. Bro, that's a big deal. Boom. Boom. All right. So, quickly tap the Pokemon to jump. So, you're going to pull down and up. Looks like you're going to tap it, drag it down, and release to let it go up. Okay. Okay. Sure. Let's do this. To tap, you got to get away from You can go angles on this, Carl. Have the Oh, there we go. Oh, yeah. They're all three years. They're all three yours. Yeah. Let them fly. Let them fly. Holy [ __ ] Pidgeot just out",
            "start": 2622.92
        },
        {
            "text": "to get away from You can go angles on this, Carl. Have the Oh, there we go. Oh, yeah. They're all three years. They're all three yours. Yeah. Let them fly. Let them fly. Holy [ __ ] Pidgeot just out there soaring. Oh, they're landing on each other. I see. Knocked out birds. Still getting points though. You know what I mean? Oh, that one. Oh, nice. Look at the angle. Oh, big points there. Come on. Oh, I mean just slamming on top of all these people. Okay, there you go. I don't know. It's just these numbers are so arbitrary. I don't know if it's like You got to go faster. They just make up. You got to go faster. I think you're doing really well. I think you're doing really great. You're getting lots of like ups and downsies. Hey, you're not doing much. But like we are going up against we got to be ready. Well, we got 300. Can I halfway in realized that there's a top screen that I could see the rest of the Oh [ __ ] Oh my god. Holy [ __ ] What? There was so much more happening. There's a",
            "start": 2671.28
        },
        {
            "text": "to be ready. Well, we got 300. Can I halfway in realized that there's a top screen that I could see the rest of the Oh [ __ ] Oh my god. Holy [ __ ] What? There was so much more happening. There's a lot. There's a lot happening behind the scenes though. I don't You can't see it on the rest of it. Yeah. Look at the bird one all the way at the tippy top, too. Wa. Okay. 46 forward, bro. That's a big number. Yeah, that's great. Let's see what we got. Here we go. Let's see who we beat number one. Dominated. Look at that. Dominated. What are we doing? Jump might be our game. 110 points more. Jump might be the game. I mean, Chaz, you know, we haven't seen this yet. Use the stylus to move three Pokemon around. Touch the jump and catch it. Oh, we have seen this. Move three Pokemon around. Use the stylus to move. So, you're going to be on a plane and you're going to this are going to go over your head and wherever you catch them, there's going to be a stripe and you get a point. [ __ ] guys.",
            "start": 2716.56
        },
        {
            "text": "stylus to move. So, you're going to be on a plane and you're going to this are going to go over your head and wherever you catch them, there's going to be a stripe and you get a point. [ __ ] guys. This one might be a little bit more rough. You're going to just jump and grab. Okay. So you can move all three whenever you want, but they got to be up there. Here it comes. Here it comes. Jump up and boom. Oh, I see. Okay. Okay. Yeah. Get a big jump. Big jump. I see. I see. I see. Two coming at you. Oh, Gyos. Almost. I'm just starting to think I don't see. No. I see. I see. I don't see. Dip. You got to follow that shadow. Follow the shadow. Well, how do I jump again? Tap it. There we go. We got it. He's a thinking machine. He's figured it out. There we go. There we go. Oh, don't move. Awful. Oh, this is this is really bad. It's all right. I like that you got your guys in position now. Oh, that was holding down the backline for maximum points. Get up, Vulpix. Oh, I'm like moving around.",
            "start": 2766.08
        },
        {
            "text": "Oh, this is this is really bad. It's all right. I like that you got your guys in position now. Oh, that was holding down the backline for maximum points. Get up, Vulpix. Oh, I'm like moving around. Vulpix has no hops. No hops. Yeah, Vulpix is not the guy. There you go. We got five. We got five. That's a big deal. That's a big deal. We're battling on the backline right now. Battling on the back line. Looking for the big three points. This This is This uh this is mayhem. Oh, big three right there for Oh, this is tough. That bat called the Zupac. No, Z [ __ ] Zubat Zubat's really dominatest shining moment, I don't think. Hey, but you you put some You know what? New record, though. Anyone? I have some Pokemon on the screen. Not bad. Not bad. Oh, okay. Okay. Not that guy. How do you pronounce that name? Jesus Christ. Jesus Christ. Christ. Guys, I'll say one through three. It was really close. 10, 10, and 11. You thought, \"Oh, we're in this.\" Touch the Pokemon to jump. Control three Pokemon",
            "start": 2804.8
        },
        {
            "text": "name? Jesus Christ. Jesus Christ. Christ. Guys, I'll say one through three. It was really close. 10, 10, and 11. You thought, \"Oh, we're in this.\" Touch the Pokemon to jump. Control three Pokemon at the same time. Oh, you got to jump the hurdles. So, this is like hurdles, but you're they're all three running at the same time. So, to go back and forth, jump. You got You got it. Oh, I see. Oh, there we go. So, just tap. Why would I even move them? It's just a game. You don't have to move them. They're going to go for you. Just jump when you got to jump. Okay. There's like three temple runs. There you go. This is cool. Gyarados, get up, dude. Damn. Look at this accuracy. Behind. There you go. Double down on that goddamn pitch. Gyarados has a jump. Yeah, Gyarados a thing though. Oh [ __ ] [ __ ] that one up a little. Okay. Yeah. Yeah. Yeah. We're not We're losing it. We got to We got to focus Vulpix and uh Pidgeotto. Is weighing us down. Oh, is he really slow? Yeah, he's back of the pack",
            "start": 2853.36
        },
        {
            "text": "that one up a little. Okay. Yeah. Yeah. Yeah. We're not We're losing it. We got to We got to focus Vulpix and uh Pidgeotto. Is weighing us down. Oh, is he really slow? Yeah, he's back of the pack type [ __ ] He's in 12 right now. Yeah, we need we need that Vulpix up to like But you got know we hit we hit first place so we're good. First place is good. We just got to get these two. Come on, bullpicks. Get up to eighth. Wait, it averages it out probably. Get the finish line. Oh, 11th. Oh [ __ ] We are tied with somebody here. Oh, and we'll stay tied. First and last spot. First that doesn't have one total. Okay, see what happens here. You're looking at that blue team right there. Oh, they were like all in the middle. Yeah. What do we got here? Not bad. Not bad. Not what we needed though. Yeah. About 8 second difference right there. Oh yeah. I hate to see it. You don't want to see that. Leave me in the dust again. It was jump. I didn't think we're going to run. Exactly. What the [ __ ]",
            "start": 2896.92
        },
        {
            "text": "About 8 second difference right there. Oh yeah. I hate to see it. You don't want to see that. Leave me in the dust again. It was jump. I didn't think we're going to run. Exactly. What the [ __ ] Why is it says jump? Pretty good call. That's a pretty What the [ __ ] are we hurdling for? Give me a jump test. Gyarados jump. Crush that first one though. Crush that first one. This is where they give out fake stars at the end of Mario Party. That's what I was saying that last time. Oh, your Pokemon got points. What is going on here? Andy, can we hit plus on this part to make it go faster? Oh, we're hitting. Yeah, they gave out stars, Mike, for the lowest score. Yeah, what? Like, what are we doing? We don't need that. We don't need that. Oh [ __ ] Kevin [ __ ] breaking that thing, bro. Oh my gosh. Let it ride. Oh, Carl. Second place. Not bad. Very good. Very good. Better than we thought. Very good. Better than I thought. I thought that was a for sure fourth place. I love that, dude. That's",
            "start": 2947.84
        },
        {
            "text": "Let it ride. Oh, Carl. Second place. Not bad. Very good. Very good. Better than we thought. Very good. Better than I thought. I thought that was a for sure fourth place. I love that, dude. That's the pokey athlete right there. That was amazing. Okay. Yeah, I'm I'm subbing back out, guys. Thank you. Oh my. Of course. Stay forever, Carl. We love you. Wow. You want to try it again? Yeah, we only got like two more. I got Okay. All right. You want to do it? Oh, you're not going to get Nick a chance, man. I'll get in there. Thank you for coming out. You hang out here. Thank you for hanging out tonight. Great seeing you, brother. All right, bro. On the internet, bro. Thank you. Thanks for having me. Take care. I'll see you soon. See you guys. All right, we're back. We're heading to the finish line here, boys. Doing it. I'm going to do it. Nick's going to do it. Oh, Nick's got the controller, so I don't even have to do anything. All right, you just sit there and relax. Enjoy the show. Enjoy",
            "start": 2990.0
        },
        {
            "text": "here, boys. Doing it. I'm going to do it. Nick's going to do it. Oh, Nick's got the controller, so I don't even have to do anything. All right, you just sit there and relax. Enjoy the show. Enjoy the show. Enjoy the show. All right, so we did putting on a show. We power. We're our best at We know that power is our game. Let's go. Power game. Also has the soccer game that sucks. Yeah, but we'll just take Yeah, but you can win that. You can win that. I don't know how to win. This is a stamina course at this point. Andy, I'm confused. Is the little scream. That's the DS pad, right? Yeah. So, how is it that they're telling us to use the like What did we just pick? Was it stamina or strength? I have no idea. I wasn't paying attention. [ __ ] I think stamina, right? Might do. Yeah. Stammy. Stammy. What would you compare these candies to, Mike? [Music] They have a nice wafer crisp. Like a great chocolate. Like a Kit Kat maybe. Yeah. Uh-huh. Okay. Uh more uh more crispy kit. Less chocolate.",
            "start": 3038.0
        },
        {
            "text": "What would you compare these candies to, Mike? [Music] They have a nice wafer crisp. Like a great chocolate. Like a Kit Kat maybe. Yeah. Uh-huh. Okay. Uh more uh more crispy kit. Less chocolate. Yeah. Less chocolate. More on the crisp side. Oh, okay. Yeah, I definitely pick strength. Oh, yeah. Yeah. Oops. This is going to be an interesting one. Whoops. No, I mean they're the same Pokemon. They're all strong. I think we only have three. Okay, touch the box to strike the Okay, we're good. Yeah, you know this one. You know this one. This one. They're all strong minded. Your left hand's not doing anything. Don't worry about that. Keep it up. Remember the switch. [Music] Switch. Better watch the [ __ ] out. Jigglypuff is freaking in the back, bro. Did you see that switch button fast? That's sick. He did it again. What the [ __ ] dude? Yeah, it's un You can't even notice it. This old man has it. He's a Call of Duty player, dude. See you, bro. Take care. Great meeting you, Charlie. Good",
            "start": 3084.56
        },
        {
            "text": "sick. He did it again. What the [ __ ] dude? Yeah, it's un You can't even notice it. This old man has it. He's a Call of Duty player, dude. See you, bro. Take care. Great meeting you, Charlie. Good seeing you. Yeah. See, you took Mach Machoke out. Yeah, Machoke kind of sucked. Yeah, that that was a great call. You did phenomenal. You You got 100. I don't think my heart even [ __ ] did one beat there for a second. I think it just stopped for me. I think I put all the power to my brain on that. everything to your brain. That's how the body works. It's like Unlimited or whatever that show was. Limitless. That one. Limitless. Yeah, that's the one. Do you watch the show, not the movie? Uh, I didn't watch either. Oh. [Music] Oh. Get in the circle. Dominate with Gyarados. Gyarados is your body. He's your big body. Yeah. Look at that dick. [Music] Damn. You just bodied that Gastly. Yeah, I just put that Gastly on his [ __ ] ass. I saw you do that. That's one that like all of Gassie's friends",
            "start": 3145.84
        },
        {
            "text": "He's your big body. Yeah. Look at that dick. [Music] Damn. You just bodied that Gastly. Yeah, I just put that Gastly on his [ __ ] ass. I saw you do that. That's one that like all of Gassie's friends will reference and like make fun of him for watch. Watch that pseudo wood. He's outside. Oh [ __ ] Yeah, they got he got remember that Gyarados big body. Yeah, [Music] you got pseudo wooden. That's beautiful. That's exactly how [ __ ] Oh [ __ ] I bit him out bigly. I got a little horny. I got a little horny. [Music] Look at that little ball. Look at that little ball. Fight for the five. Push him out. Push him out. Yes, you got five. I got five. Mike, what's that little pig thing? [ __ ] Machop. I like it. Oh [ __ ] Look at that, man. I just pushed Machop face. Just face on that ass so hard. Don't let this Jigglypuff check. Oh, that [ __ ] Jigglypuff checked the [ __ ] out of it. There it is. There you go. Check it back. It ain't enough. [Music] 36 points. Pretty good. Not bad. Is it",
            "start": 3202.32
        },
        {
            "text": "Don't let this Jigglypuff check. Oh, that [ __ ] Jigglypuff checked the [ __ ] out of it. There it is. There you go. Check it back. It ain't enough. [Music] 36 points. Pretty good. Not bad. Is it enough to get me number one? Sure is. It is. It is. I'm not going to say I'm the best gamer in this office, but Andy better watch out. I'm blown away at how wrong I was. You're coming up next, big dog. You got No, I [ __ ] did this already. I'm done. Andy can do it again. Ah, the goal roll. Okay. All right. This is it. This is the hard one. This is the one that broke. Mike. Yeah, this is true. Okay. I'm taking my jo out. Oh, what the [ __ ] dude? They [ __ ] went on you hard. Get Pseudowo. He's got freak He's got freak athleticism. Leave Gyarados in the back. Pseudooo. Pseudowo's got energy. We're [ __ ] What the [ __ ] Why are they all dunking on me right now? You got time. You got time. Get in there, dudov. Pseudo wood is should be the one you're using. I've lost my mouse. No, it's in your",
            "start": 3266.4
        },
        {
            "text": "[ __ ] What the [ __ ] Why are they all dunking on me right now? You got time. You got time. Get in there, dudov. Pseudo wood is should be the one you're using. I've lost my mouse. No, it's in your hand. That's your goal, I think. Oh, that was our goal. This one's the hardest one. Jay Bagel 25 with 10 gifted subs. Big J. Honestly, Andy, I think you got lucky. Thank you for the subs. There it is. Plus five. Plus five. Hit it. Hit it. [ __ ] Oh. Oh. Oh my god. My job's going crazy. Come on. Suda. Sudo is a freak. Get in there. Get in there. A Get back. Get [Music] back. I think Gyarados in the two balls. Two balls. Two balls. Three balls. Damn. Gyarados hits hard as [ __ ] Yeah, Gyarados is slow though, man. Yeah. There. There. Go, go, go. He's knocked out. Oh, come on, Nick. God damn it. I lose my mouse. Yeah. Yes. That D. Do you see that? [ __ ] G. Oh my god. Oh my god. You wo [ __ ] We didn't pop off for you enough, Nick. Sorry. I was there for you the whole time. Yeah. Thank you,",
            "start": 3321.04
        },
        {
            "text": "I lose my mouse. Yeah. Yes. That D. Do you see that? [ __ ] G. Oh my god. Oh my god. You wo [ __ ] We didn't pop off for you enough, Nick. Sorry. I was there for you the whole time. Yeah. Thank you, Kevin. Andy, check your phone more, please, for Christ sake. Doing ex with another 10 gifted. Thank you. Excave troll and J Bagel 25. All for the 10 gifted subs. Join the raffle and support the stream. Thank you everybody for supporting us. I'm I'm redoing Toggleon Games. Squirtle. Squirtle. I wonder if Togalong Games even knows that he won. No, wait. Well, he's going to when he when he opens uh when he opens his mail and there's this boom. We don't know what that We're going to figure it [Music] out. All right, Mike. What do you think? I think we're short. I think I do one more, right? I think we got to do two more. What do I get here? Earn 379 points. Do I get another 100? Two. Another 100 points. Okay, so we're getting pretty good here. Let's see where we're at. Uhoh, Joey. Easy. I want",
            "start": 3391.6
        },
        {
            "text": "we got to do two more. What do I get here? Earn 379 points. Do I get another 100? Two. Another 100 points. Okay, so we're getting pretty good here. Let's see where we're at. Uhoh, Joey. Easy. I want your stupid kunas, Joey. I want the dude to give me a [ __ ] fire stone. No. [ __ ] my mom. Sorry, mom. I love you. Thank you, Cave Troll, for gifting out 10. How much we got? I got to get out. I'm sorry. on my camera on me. Chumba to chumba slowmo. Chumba chumbas. Wait, is it that camera? Oh, it is. We have 23. We have one more of these. Who would like to do it? Andy, do you want to step in or you want me Get Andy in there. Last one, bro. Last one. No, I'm drawing, man. Okay, you got this. I'll go again. We're going to do the same thing. I just want to try to get second place so I can just finish this up. What did we do? We did the power. Power. Power. Always power. [Music] We're a power family. We are a power family. We're powering power. We have a strong chat. Can I get a Can I get a Do",
            "start": 3449.52
        },
        {
            "text": "this up. What did we do? We did the power. Power. Power. Always power. [Music] We're a power family. We are a power family. We're powering power. We have a strong chat. Can I get a Can I get a Do we got a good squad or not? Chat, are we back or we not? Got a bunch of 28s and 29. Oh, you mean just in general? Yeah, we back in general. Is this squad back or we not back? [Music] I'm I I think I'm really happy with the turn that's happened. See, I think we did stamina last time, Mike, but I could be wrong. No, no, we do power. We do power. Power is where we thrive. Power is where we thrive. Okay. All right. [Applause] [Music] Block Smash. [Music] [Applause] Y'all saw we had Sam Lake in the building tonight. Yeah. Made a big deal. That was sick. I wish I had uh gotten here earlier. I knew I was going to be coming in later. Um, but I really wanted to record, you know, the coffee video, but have me with an energy drink. Like just me with a Red Bull as we both do the sip, you know. Oh, [ __ ]",
            "start": 3505.6
        },
        {
            "text": "going to be coming in later. Um, but I really wanted to record, you know, the coffee video, but have me with an energy drink. Like just me with a Red Bull as we both do the sip, you know. Oh, [ __ ] Watch out. I got him my thermos. Oh, nice. My sick Allen way too thermos. Well, you got NPC trailer, mic, bro. Look at you. 106. You know what, Andy? It didn't super excite me. Oh, really? I It turned me around. Really? I I was very much like, \"What are we doing?\" Yeah. And the the one that they showed yesterday, Future Game Show, I the idea of like you your dudes turning into the sticky note people. I saw that got me excited. Uh and also just that big ass, you know, whatever his name was. Something Steve or whatever his name was. Okay. Sticky Ricky is what his name was. Sticky Ricky. That's what they called in the trailer. It remind me of Ricky Siki. Mikey's favorite movie. I love Ricky Staniki. That's a good movie. It's a good fun time. That reminds me of um his other movies he made on",
            "start": 3585.12
        },
        {
            "text": "what they called in the trailer. It remind me of Ricky Siki. Mikey's favorite movie. I love Ricky Staniki. That's a good movie. It's a good fun time. That reminds me of um his other movies he made on on Hulu. I don't remember. Come to me. Well, they got married and somehow they made a second one. It was even worse than the first one. They got married. Yeah. It's like wedding guests or something like that. It'll come to me. Let me get it. Did you see the um Happy Gilmore teaser? No. No. Oh, did they get the second one? Yeah, just a little just a little teaser. I've seen a movie. Did you see the Freakier Friday teaser? Yeah, it did. Yeah. What' that do for you? Uh, nothing. Oh, it's called Vacation Friends. Oh, Vacation Friends ones and two. Awful. Bad movie. Awful. Freelance. Awful. You see that one? No. Awful. That was with Allison Brie. God, I love Alison Brie. Who doesn't love Alison? You know, she's married to Dave, right? Yeah. Short guys can win. How about Jackpot with him and",
            "start": 3640.96
        },
        {
            "text": "see that one? No. Awful. That was with Allison Brie. God, I love Alison Brie. Who doesn't love Alison? You know, she's married to Dave, right? Yeah. Short guys can win. How about Jackpot with him and Aquafina? Uh, I don't know that one either, man. Are these all just straight to streaming? Yeah. Yeah. Yeah. Yeah. Yeah. Oh, we'd be making a bag off of stream with my main man John Cena. Making a bag. God, it's just like it sounds like you're doing the the steering like LaMarcus Aldridge. Awful. He cost in the game last night. Although they win the game, but if they lost it would have been. This is the most [ __ ] life. Now, these are all movies that I watch and I smile and laugh at, but in reality, they're awful. You know, they're bad. Yeah. Yeah. Yeah. You chat would be ripping them apart. So, yeah. Just know where we're coming from. All right, Nick. This is a big moment. All right. Pretty sure we already got it. Like, dropping like it's hot, bro. Come on. Let's score some goals on",
            "start": 3693.6
        },
        {
            "text": "So, yeah. Just know where we're coming from. All right, Nick. This is a big moment. All right. Pretty sure we already got it. Like, dropping like it's hot, bro. Come on. Let's score some goals on this, Nick. [ __ ] D up. Let's get positive here. Let's get two goals. Set a set. Set Oh [ __ ] That one went really far and fast. Get there, Nick. Oh, [ __ ] Put your body on it. Uh, Nick, you got to put your body on the line, dude. I'm putting my body on the [ __ ] line. You got You got to block, though. There's There's no one in the goal. No one get the ball. We got an open hole. Open hole. Yep. It's just gaping. No. Oh, it's not in. It's not in. It's all There's no way to get it out. I can't clear it. My guys are right here. No getting past these guys. No one's getting past that. Okay, they got past them. [ __ ] Oh, he went through them. Somehow didn't score that one. Okay, you're putting everyone in the field. Yeah, put them in the field, Nick. Armor on the world. You should do armor on",
            "start": 3740.32
        },
        {
            "text": "past them. [ __ ] Oh, he went through them. Somehow didn't score that one. Okay, you're putting everyone in the field. Yeah, put them in the field, Nick. Armor on the world. You should do armor on the world. Yeah, this is like uh what's it called, Mike, in hockey where you like put the goalie? Oh, you pull the pull the goalie. Yeah. Yeah. Do you know a lot about hockey, Mike? I know a good enough. Not Not a lot, but I know enough for sure. I enjoy hockey. You be watching any playoff hockey? No. When it happens, nothing better than playoff hockey. Oh. Oh, yeah. Playoff only because you know last year the most because of Levitar show and because Florida Panthers do. Are you watching the NCAA basketball tournament yesterday and today when when you play all the games? Not really. You know about MCN State. The the manager who's got the the NIL deals to hold up the boom box. Amir Khan. Everybody knows about his aura. Oh wow. I got a No, I didn't know any of this. They beat Clemson. All",
            "start": 3789.04
        },
        {
            "text": "about MCN State. The the manager who's got the the NIL deals to hold up the boom box. Amir Khan. Everybody knows about his aura. Oh wow. I got a No, I didn't know any of this. They beat Clemson. All right. 125. Okay, that was the lowest scoring game in history. We were yapping. Sorry, Nick. No, no, it's not your fault. You're talking about some sort of like hockey or some [ __ ] I have the capacity to not listen to anyone when I want. That's my superpower. Yeah, he does really good at that. I just zone out and stuff. I do notice superowers. He does that a lot. It's like very true. Kevin superowers. His voice is at the frequency. Penetrate big power. It's the only person. It's really it's it's a magneto Charles Xavier dynamic. It really is. We're like uh You think you can get through this helmet, Charles? All right. Now, we need to reset the TV, right? Let me do the save real quick. Oh, yeah. Yeah. Give me a hard save. Let's do a hard like Let me step out. Check the money. Make sure we",
            "start": 3829.92
        },
        {
            "text": "Charles? All right. Now, we need to reset the TV, right? Let me do the save real quick. Oh, yeah. Yeah. Give me a hard save. Let's do a hard like Let me step out. Check the money. Make sure we make sure we got what you wanted. Oh my god, you're so fast. Yeah, we're at 28. We're good. We could get some milk moves, too. Ms. Well, we we'll get there after we get the thing. Move milks. Let me slow you down. Hold on one sec. That's okay. I got to get out anyway. Be hilarious if it saves faster. You're like, \"How? What is that?\" It did. That's hilarious. Faster. Did you handle it? Handle business. All right. That means Kevin's got to change the day, right? Something insane like that. What time is it? Jesus Christ. It is 4:36, boys. Not bad. Time to get this Firestone. What's that? We need to make it next Tuesday. Whatever the date for next Tuesday is. Damn, that's crazy. So, chat, we'll see you next Tuesday. This computer's out here just living in the future right now. A dirty word. I know.",
            "start": 3878.96
        },
        {
            "text": "it next Tuesday. Whatever the date for next Tuesday is. Damn, that's crazy. So, chat, we'll see you next Tuesday. This computer's out here just living in the future right now. A dirty word. I know. I know. Mike, what the [ __ ] candies are these? I mean, if you someone could just tell me what day that is, that would be great. Do you know how day it is? I know. The calendars have been updated. It is the 25th. Thank you. I'm sorry. What do you What are you mad about? It's like you click on the clock on the bottom. You changed it. It doesn't work that way anymore. It doesn't show you a calendar. Do you have a calendar? Hold on. It does work. Like I was doing it. It froze. It froze, guys. How it goes. We We'll get that. Did we at least save? Yeah. Yeah. Yeah. We did. We're fine. We're fine. We got the safe. I have to buy Andy a video game right now. What are you buying? Uh just buy a video game for work. Oh, for next week. Yeah. Be fun. Oh, yeah. That's super fun. Technically, I think",
            "start": 3946.56
        },
        {
            "text": "We got the safe. I have to buy Andy a video game right now. What are you buying? Uh just buy a video game for work. Oh, for next week. Yeah. Be fun. Oh, yeah. That's super fun. Technically, I think you're supposed to buy it for me, but it doesn't matter. I guess it's Annie's machine. That's fine. I can't remember which one it was. Okay, but Anna's machine has a better car. That's what we want. You're right. I'm sorry. I'll shut the [ __ ] up. Okay, cuz I'm about to buy this game. Doesn't matter. I don't know if we can. He gave you the look like, \"Don't [ __ ] me on [Laughter] this.\" Okay, Andy, look. I'm buying this device. Andy, look at this. Oh, [ __ ] He's doing it. Sorry. You click on now. Nothing pops up with Windows 11. It I was doing it. That's how I So you think I'm a liar? Yeah, that's I mean you think he's a liar. That's how I was able to do it the last time we tried. We don't think you're a liar. We just say that maybe you're not telling the truth. I have purchased that.",
            "start": 3999.84
        },
        {
            "text": "that's I mean you think he's a liar. That's how I was able to do it the last time we tried. We don't think you're a liar. We just say that maybe you're not telling the truth. I have purchased that. Here we go. You have to buy it, though. Here's our Firestone. Perfect. [ __ ] Yeah. Should we get some moon milk, too? [ __ ] Do we have enough? We've got extra, right? Yeah, we got some extra. Yeah, let's do it. [ __ ] Let's get three. Should we get some moon? How about that PP? Oh, you want the PP upp. Is that a Is that a permanent PP up or is that I believe so. Don't click on it. Wait a minute. You give that to your Pokemon. It slightly raises the max PP of a selected move that has been learned by the target. So, if you have a special move that you really, really love, you can get that PP up, but it has to usage rate. We could do it. No, let's get the milk. I mean, I mean, this is a perfect way to end the stream is we evolve Vulpix and we end the weekend. We had Did I I bought the thing,",
            "start": 4049.92
        },
        {
            "text": "but it has to usage rate. We could do it. No, let's get the milk. I mean, I mean, this is a perfect way to end the stream is we evolve Vulpix and we end the weekend. We had Did I I bought the thing, right? Yeah, you got it. Yeah, I bought the fire stone. That's no longer ago. So, let's go. Let's go put this. Oh, I can only get two milks. Well, I can Should I get a white apple? Nah, [ __ ] it. We'll keep it for later. Hey, you only buy one milk at a time. All right, ladies and gentlemen. Well, I don't like the inside of this casino cuz I don't like these blankets. Kevin, can you move the mouse cursor just off? Just my little Yep. Yeah. I don't want to spoil this wonderful moment for everyone. It's a big moment. Here we go. Mhm. This is with all your support. Prime time. Save it. Why would I save it? Just in case something goes wrong. Oh, I think you meant save the stone. Oh, I thought they meant save the Oh, save the PP up. You didn't get the PP up. No, I got the PP up another time. If",
            "start": 4088.24
        },
        {
            "text": "save it? Just in case something goes wrong. Oh, I think you meant save the stone. Oh, I thought they meant save the Oh, save the PP up. You didn't get the PP up. No, I got the PP up another time. If Futuro says, \"I wish I got my PP up.\" I can send you a website that will help with that. Kids are into honey. Honey? Oh, yeah. That guy across the street is selling 10 boxes of honey a week. What are they into honey? I think he just tells you things. I know. I I had a hard time believing it, but then I see the kids over there and I'm like, you know what? Have you ever seen someone buy it? Oh, I've seen so many people buying honey. Bro, you're such a liar. People People People be smacking the honey pouches, bro. That's the new thing. They just like getting jacked up, friends. Give me the tails. Tail is old enough. Here we go. [Applause] Woo! Man, let's go, dude. We're back, ladies and gentlemen. Uh, perfect. Obie Boing says, \"Nick, water your berries.\" Obie, thank you for that reminder, and",
            "start": 4123.76
        },
        {
            "text": "Tail is old enough. Here we go. [Applause] Woo! Man, let's go, dude. We're back, ladies and gentlemen. Uh, perfect. Obie Boing says, \"Nick, water your berries.\" Obie, thank you for that reminder, and from now on, you have to remind me every day. You're the you're you're berry guy. You're berry guy. water the berries and let's say goodbye because we will be back on Tuesday with more Pokemon. Monday I have a very fun special sponsored stream coming your way with Nick and Andy and then Tuesday the crew will be back for more Pokemon mania as we are now reset and ready to go forward and have some fun. Joey, I just want to say congratulations for getting the best Pokemon in all the Ninetails. She likes Ninetails is pretty rad. And then what's the name? Uh, prime time. Prime time. Prime time. Prime time. Pretty sick cuz it's prime time. Prime time. Prime time. Mom. With that, ladies and gentlemen, Pokemon trainers all around the globe. Thank you so much for the love. Uh, a great week of",
            "start": 4164.96
        },
        {
            "text": "Prime time. Pretty sick cuz it's prime time. Prime time. Prime time. Mom. With that, ladies and gentlemen, Pokemon trainers all around the globe. Thank you so much for the love. Uh, a great week of content, a lot of content over on your world. So, please go check it all out. Great Sam Lake interview by Roger and uh, Greg today. So, go check that out and go give him some love. We're going to save and we're going to get out of here. Kevin, take us away.",
            "start": 4215.6
        }
    ]
}