{
    "id": 1130,
    "video_id": "r7jIgWuLboE",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "The Best Games We Haven't Played - Kinda Funny Gamescast Ep. 32 (Pt. 2)",
    "description": "These are the games we can't believe we haven't played.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1439902801,
    "duration": 1836,
    "transcript_chunks": [
        {
            "text": "[Music] Topic number two. What's happening over there? I just was looking at the time. See how long that topic was. It was 22 minutes. It's good to know. I'll keep I'll keep you updated as we It's very important. Topic number two is is upon us, but I have something to say. This topic is not I It's not even a sponsor thing. This topic is shout outed. This topic is supported on Patreon by the one and only Mike Biffle and his game volume. Now, what's exciting about this, Colin? And why it's the second topic? Do you know why they get through? Why would volume be sponsoring the second topic? Of course, they went to patreon.com/kindfunname kind of. They went No, not the topic. They went to patreon.com. So, you're being literal about why kind of funny games. All right. Sponsored us for a month of shoutouts because they're awesome. So that's what you're asking because I thought what I thought you were asking was why are you putting the sponsorship before this topic? I am, but you're thinking",
            "start": 0.34
        },
        {
            "text": "shoutouts because they're awesome. So that's what you're asking because I thought what I thought you were asking was why are you putting the sponsorship before this topic? I am, but you're thinking about it in the wrong way. Okay, I see. The reason this is on topic too, because that means that this topic will be posting on Tuesday on youtube.com/kindfunnygame, which is the 18th, which is the release date of volume the game. This segment is sponsored by volume, a stealth game out now for PlayStation 4, PS VA, PC, and Mac from the creator of Thomas Was Alone. volume combines the core story, combines a core story starring Andy Circus and Danny Wallace with an editor that lets you make and play content as part of a growing community of stealth game fans. For more information, follow at volume game on Twitter. And of course, go get it right now. We've we we've seen this game before. We sure have. I'm very excited for it. I'm excited about it, too, because it it reminds me of I mean, I",
            "start": 55.44
        },
        {
            "text": "game on Twitter. And of course, go get it right now. We've we we've seen this game before. We sure have. I'm very excited for it. I'm excited about it, too, because it it reminds me of I mean, I always kind of like the VR missions in Metal Gear in the sense that like I was awful at them, but I like the idea of just strategically getting through from point A to point B. And that's what this game is. I mean, it's it's it's it's just those clever VR missions and kind of collecting things as you go and stuff like that. I think it's I think it's cool and I and I I think uh Mr. Biffl is a extremely talented, extremely friendly kind of guy. He's a great dude. Big supporter. Kind of funny. Happy to support him as well. Yeah, exactly. I'm happy to support him. Uh, topic number two, Colin, is something I It came up to me, I think, over the I You always have this, right, where you can't remember what was said on what show. I think this popped up at RTX. It might have been Gamescast last week,",
            "start": 98.8
        },
        {
            "text": "I It came up to me, I think, over the I You always have this, right, where you can't remember what was said on what show. I think this popped up at RTX. It might have been Gamescast last week, and it sounds like something we would have done before, but according to the Kind of funny forums over at kind of funny.com/formums, we haven't cuz I did some research on this. Okay, but the topic is gaming omissions, the things we didn't play, but should have. Okay, now this stems from, of course, you saw me lugging around my 3DS. Yeah, I don't know why you saw me tweet that I was playing Super Mario Brothers 3. Oh, that's right. Yeah, Tim asked me about this, I believe, during the RTX panel, but it might have been Games Cast last week. And both of you flabbergasted to find out. I've never played Super Mario Brothers 3. And when I say played, I mean sat down, played start to finish. I'm going world to world playing it. Sure, I've popped in at somebody's house, I'm sure, and played it. I've seen",
            "start": 134.08
        },
        {
            "text": "Mario Brothers 3. And when I say played, I mean sat down, played start to finish. I'm going world to world playing it. Sure, I've popped in at somebody's house, I'm sure, and played it. I've seen it a bunch of times. I've watched top 100 videos where it pops up. But I've never sat down, owned a copy of Super Mario 3, and played it. I didn't have an NES. I was a Sega kid. My first Mario game was the one on Game Boy. I can never remember. Super Mario Land. Yeah, that's the one. Uh, so I mean, I've always been behind in Mario games, but I obviously I've played Mario 1. I've played Mario 2. That was one a lot of times you played at your friend's house. That was a big one. And then three, for some reason, never got played in that that that ecosystem. So, here I am going through it now because I don't like having that hole in my heart, that hole in my acumen, if you will. What do you What do you think of it? It's hard. Like, that's the weird thing I wasn't expecting. And I don't know if",
            "start": 174.24
        },
        {
            "text": "I don't like having that hole in my heart, that hole in my acumen, if you will. What do you What do you think of it? It's hard. Like, that's the weird thing I wasn't expecting. And I don't know if it's just getting used to cuz the DS the DS is so on the DS the DS is so strange to hold for me. You know what I mean? But it's like I am getting my ass handed to me and I'm only like world two cuz I'm cuz I'm not really putting in a lot of work to it. You know what I mean? Like I was going to play it on the plane instead I watch movies. So that didn't happen. Yeah. I'm I'm a little disconcerted that you find it that hard in world two. But it's funny because then Nick while we're at RTX took my DS and put on uh Super Mario 3D Land on DS, right? and I have like 42 lives and I'm a million and it's like I don't know why that obviously my Mario story I talk about the Game Boy one, right? And sure I played that and I enjoyed it and I remember having fun but the one I fell in love with where I",
            "start": 210.4
        },
        {
            "text": "like I don't know why that obviously my Mario story I talk about the Game Boy one, right? And sure I played that and I enjoyed it and I remember having fun but the one I fell in love with where I became a Mario fan was Super Mario World and that was the one I knew inside outside da da da and it felt so perfect. Very inspired by Mario 3. And that's the thing about Mario 3 doesn't feel that way. So it's almost like learning again to be Mario if that makes sense. Sure. I mean, I think that Mario 3 was at the time really, really, really special. Yeah. And still is a special game, but it is it doesn't hold a torch or a candle, I should say, to Mario World at all. Um, but one begat the other. Like, absolutely. Um, I feel like I don't Mario 3 is definitely harder than Mario World. I still think probably the original Mario and Mario, like real Mario 2, like Lost Levels, are probably still hardest Mario. Oh, sure. Sure. Sure. if you play them like without cheating um based on just a lot of",
            "start": 246.0
        },
        {
            "text": "probably the original Mario and Mario, like real Mario 2, like Lost Levels, are probably still hardest Mario. Oh, sure. Sure. Sure. if you play them like without cheating um based on just a lot of like hit detection [ __ ] and like you only really have one hit like so if you have a fire flower like you don't just become big Mario become little Mario I mean there's a lot of like little design choices in the original Mario that that made it very difficult but um Mario 3 is is a seminal NES game sure um and I was surprised you played not because I knew you were a Sega kid but my my assumption with games like that like tentpole kind of games and that was that's maybe the biggest game of all on NES in terms of sales. Yeah. Um except for Tetris. Well, no. Tetris on NES actually didn't sell. Game Boy really sold Game Boy was uh although Tetris Tangent Tetris and Nintendo Tetris sold respectably on NES, but um my assumption was that everyone had played that game. Sure. Um now I don't think",
            "start": 298.32
        },
        {
            "text": "Boy really sold Game Boy was uh although Tetris Tangent Tetris and Nintendo Tetris sold respectably on NES, but um my assumption was that everyone had played that game. Sure. Um now I don't think the game's hard enough where you should be struggling on world two, which indicates to me that because the game doesn't really ramp up until like world five maybe. So, I I think that it's probably something to do with you playing on DS. I'd be interested to you play it on the NS original or just on Wii U. Yeah. With a with a sideways Wii remote. Sure. Um see how you feel about it then. I think that game's really really [ __ ] fun. But yeah, Super Mario World. I'm doing I'm having fun with it and I'm not frustrated and like put it down. I hate this game. I mean, I've put an afternoon at the bar in with it. You know what I And that was the thing of like you get towards the end there and I was just like ah and then I'm out of lives and I have to restart and go through and I'm like you I I mean",
            "start": 340.4
        },
        {
            "text": "with it. You know what I And that was the thing of like you get towards the end there and I was just like ah and then I'm out of lives and I have to restart and go through and I'm like you I I mean for me honestly it's still learning a lot of like I put I put out a tweet that people were like what are you talking about trying to learn the logic of chain chomps cuz I'm like oh he's coming right at me. So if I just jump over and then I do it and he would jump I wasn't even there. Why are you going at that? You know I'm like I sit I have to stop back sit back and be like what the [ __ ] is this guy up to? What's his game? Where's he going? You know what I mean? Like that's just stuff you take for granted every time. You got to wait for the execute and then you jump over. Yeah. But I but I did that and I was again this isn't getting hung up on chain chops. I'm just saying that they weren't shooting in the initial directions I thought they'd be shooting. Sure. Weird. Yeah, they the chain",
            "start": 378.48
        },
        {
            "text": "that and I was again this isn't getting hung up on chain chops. I'm just saying that they weren't shooting in the initial directions I thought they'd be shooting. Sure. Weird. Yeah, they the chain chomps I know from Mario 64 even Yeah. Mario World, I remember being like, \"Oh, these guys are chumps. No big deal. You got to just have a parabola over them basically.\" Yeah. Um No, I hear you. I mean, the games for me, I mean, when I really think about Oh, and these [ __ ] these these guys that hide, the desert blocks that hide that and then they come at you. These [ __ ] Nah, they're not a big deal. They're not. But you got to learn where they are and what they I'm like yeah that's all memorization. I walk up to him. I'm like are you going to be a real block? Ah you're a [ __ ] jumping bean. That's a memorization thing for sure. Uh much like Mega Man or something like that. You just remember after a while you just remember. I mean how many times has have we all you know many of us gone",
            "start": 408.64
        },
        {
            "text": "That's a memorization thing for sure. Uh much like Mega Man or something like that. You just remember after a while you just remember. I mean how many times has have we all you know many of us gone through Mario 3 till you just remember it. [Music] Um, when I think about games that I haven't played, I feel like they're all basically on PC because I feel like I I feel like I um have a pretty solid and well-rounded experience on console since the 2600 all the way through. Even there's a lot of [ __ ] on Master System I have not played. Obviously, uh, Genesis, I mean, I feel like I've played most of the games that matter on Genesis and I don't, again, I mean, I've said it many times, I don't feel like that list is huge. Yeah. Um, Saturn's a pretty huge blind spot for me just because I only, you know, I knew like my brother's roommate had it and we played games on it, but I'm sure there's games on there I miss. But I I think that the by the time I could, you know, I had Dream every",
            "start": 440.56
        },
        {
            "text": "only, you know, I knew like my brother's roommate had it and we played games on it, but I'm sure there's games on there I miss. But I I think that the by the time I could, you know, I had Dream every basically I've had every console since the Dreamcast, every one of them. So, with the exception of or access to them, all of them. So, of any, you know, the mainstream ones, I mean, yeah. Uh, but on PC, I mean, the the my my glaring weak spot on PC is almost everything, you know. Um, but specifically, I'm thinking about like the 1980 to 1995 era or so. So, I feel like there's a lot of gaming genetic stuff, like like really important stuff on on PC that I know and I've read extensively about, but I've not played. The games that come to mind are like Ultima, uh, like all the Ultima games. um which were heavily inspired by D and D which heavily inspired Final Fantasy and Dragon Quest. So, I mean there's there's a a blind spot there. A lot of adventure games because I really don't find",
            "start": 483.44
        },
        {
            "text": "um which were heavily inspired by D and D which heavily inspired Final Fantasy and Dragon Quest. So, I mean there's there's a a blind spot there. A lot of adventure games because I really don't find adventure games fun at all um are and by adventure games I don't mean like Gone Home so much as I mean because I do like Gone Home as much as I mean like just like full throttle and it's like oh Jesus Christ like I just I just don't Yeah. Just like no thanks. Like I I don't understand the excitement about these games. God bless you if you like them. Yeah, we love Tim Schaefer. We love his work. Good for him. you play these things. I'm just like, I don't even know. This isn't fun. Like Grim Fandang, even the remake, I was like, \"Yeah, I don't get it. I don't get it.\" Um, so that I was always very turned off by those games. Now, I played like the Maniac Mansion like [ __ ] port on NES that's not really the real one. Sure. Stuff like that. But there's a pretty huge gap that I'd like to go",
            "start": 531.92
        },
        {
            "text": "very turned off by those games. Now, I played like the Maniac Mansion like [ __ ] port on NES that's not really the real one. Sure. Stuff like that. But there's a pretty huge gap that I'd like to go back and fill at some point for um some of those early WRPGs and um and adventure games. I I think that's what sticks out to me um the most. I mean, if we're talking about games that I've [ __ ] around with, I mean, games that I've not really beaten all the way through that but that I'm familiar with or I've [ __ ] around with in some capacity, probably HalfLife would probably be like that that whole series is probably a huge gap for me, too. Do you enjoy it? Yeah. It's just like it's on PC. Like I just I enjoy it. Like I've tried so hard with HalfLife and like Damon was like I remember cuz they were you know people beating this drum when Orange Box came out and I was playing on 360 and they were like I don't like it. Well, at least play Halfife 2. It's better than Halfife one. I'm playing",
            "start": 568.24
        },
        {
            "text": "were you know people beating this drum when Orange Box came out and I was playing on 360 and they were like I don't like it. Well, at least play Halfife 2. It's better than Halfife one. I'm playing Halfife. I'm like, I don't this just sucks. I don't enjoy how this feels. I I Every's like, \"The story is so good.\" I'm like, \"Yeah, but the game play sucks. Sorry.\" Like, it just doesn't it isn't fun to play. Like, I'm driving these [ __ ] goddamn jeeps around or whatever these go-karts. I'm getting I pass some guy. I got to turn around and go fight him. I got goddamn guys on top of roofs shooting at me and I got the [ __ ] head crab coming. Yeah. I think I just never had the fortitude to really this was before the Orange Box like really uh [ __ ] with it for very much very long cuz I had PC gamer friends and stuff. I mean and and you're introduced to these games you see them and you [ __ ] with them a little bit. I'm just like I just and by the time you know when Orangebox came out which",
            "start": 610.96
        },
        {
            "text": "friends and stuff. I mean and and you're introduced to these games you see them and you [ __ ] with them a little bit. I'm just like I just and by the time you know when Orangebox came out which I think was in 2007 uh right when I had really first started IG. I was there they were maybe six months when Orangebox came out. Um the PS3 port was awful. The Xbox 360 port was was what it was but I was still like very much in Wii mode at that point. So by the time So by the time like I got back around to really like acknowledging the fact that the Wii sucked, I it was just too late. I was like other Yeah. It's just like well there's I'm like there's other things I want to play and I just never I just never cared enough to go back. You know, now here here's a question related to what we're talking about. You're talking about Yeah. You know, other things had come around so on and so forth. Are we to the point or are we at the precipice of the point you think where we're talking about I can't",
            "start": 647.36
        },
        {
            "text": "about. You're talking about Yeah. You know, other things had come around so on and so forth. Are we to the point or are we at the precipice of the point you think where we're talking about I can't believe these omissions in our library and da da is that ever going to go away? I feel like there's so many games now every Tuesday, every day on Steam, every indie, every and I know you're going to scoff it off every mobile game that like games that you try to play. Monument Valley and all these things that are doing amazing things that I haven't played and I have no intention of playing and I don't I don't think about it like I think about Mario 3 like I thought about Super Metroid. Like I thought about oh [ __ ] these are games that people look back and define as their defining like video game moment and I have no experience with them. Yeah. I think it's a it's it's going to be a hindsight thing. I think a lot of these games that even since the time we worked at IG in the very beginning,",
            "start": 682.8
        },
        {
            "text": "moment and I have no experience with them. Yeah. I think it's a it's it's going to be a hindsight thing. I think a lot of these games that even since the time we worked at IG in the very beginning, I just don't think a lot of these games are old enough for me to care yet. Sure. It's not to say that they're not great. I mean, there are great games that are must plays in those, but I'm not like I don't have enough distance between them to be like, \"What are the games that I really like [ __ ] missed?\" Yeah. As opposed to games that just passed us by, which I think are two different things. To your point about mobile gaming and stuff like that. Listen, like look, look, that's not a real gaming platform to me. And you though, no, but I want to just explain I just want to explain where I'm coming from with this that mobile gaming has been destructive to the kinds of games that we like. The the the the volume of them, the way people play those games, the [ __ ] way they're marketed, the way",
            "start": 721.76
        },
        {
            "text": "from with this that mobile gaming has been destructive to the kinds of games that we like. The the the the volume of them, the way people play those games, the [ __ ] way they're marketed, the way that the way that the pe they nickel and dime people or whatever. So, if you like those kinds of games that More Power, that's fantastic. But like that those are that's not even a platform that I acknowledge as something that like is so like PC and console and handheld is it there's like not a fourth pillar. There's not a fourth leg, you know? And so I'm not saying that is like if you like those games, more power to you. But like this is your opinion. Exactly. But what I'm trying to say is like I'm overwhelmed enough with the games I miss without having to think about a platform that I feel like has been largely destructive anyway and that I don't really destroy. How how hasn't it been? How I mean what you're saying microtransactions are destructive. Yeah. Just like everything about I don't",
            "start": 755.28
        },
        {
            "text": "has been largely destructive anyway and that I don't really destroy. How how hasn't it been? How I mean what you're saying microtransactions are destructive. Yeah. Just like everything about I don't want to say everything about because I don't know I'm not familiar with the whole [ __ ] breath of catalog of of mobile games but everything about what I've seen about them has been trying to be driven into the way we play and the way we market and the way we monetize core games. And I think that's a huge [ __ ] problem. You know, I don't think there's I don't think there's a goddamn thing that console gaming can learn from from playing a game on iOS at all. I think it goes the other way. And so, yeah, I'm I stand by that 100%. When I want to just pay you $15 for a game, but I can't because you have to have these microtransactions. It didn't start on console. Sure. You know, but it hasn't it hasn't really worked on console either. No, but it's still here it is, you know. Well, sure, but I",
            "start": 797.68
        },
        {
            "text": "have to have these microtransactions. It didn't start on console. Sure. You know, but it hasn't it hasn't really worked on console either. No, but it's still here it is, you know. Well, sure, but I mean, those are just shitty products I wouldn't want to play anyway. You know what I mean? If they're if that's going to take down a shitty console game, then I don't want to play it to begin with if you're going to be nickel and diamond going out there. Sure. I mean the the benefit of mobile gaming I think is and granted they kind of came up together but stick with me is the fact that it opened up the door for indies you know it was the first place where it was for 99 bucks you're a game developer and go try something and go do something and get your feet wet and learn I mean look at like Mitchell Morgan look at learn code how are you going to make an app how you going to do this and then you can start wrapping your head around making a video game which I think you saw Sony and Microsoft",
            "start": 838.72
        },
        {
            "text": "Morgan look at learn code how are you going to make an app how you going to do this and then you can start wrapping your head around making a video game which I think you saw Sony and Microsoft respond to in terms of how to get their platform into people's hands and lower the development cost and get people kits and do these different things. Now granted, Steam was there totally the green light program. They were indie games were happening there as well, but I think part of the ground swell is mobile. I guess I I I I mean there's certainly a point to be made there. But I do think that mobile gaming is a race to the bottom. It's a a question of volume. It's a question of iteration. It's a question of copying. It's a question of like all these kinds of things. There's like no like for all of the games that are on mobile that seem like there's love put into them, there's many more that aren't. There's no there's no quality control. There's just no respect for the gamer. But I think, you",
            "start": 871.36
        },
        {
            "text": "the games that are on mobile that seem like there's love put into them, there's many more that aren't. There's no there's no quality control. There's just no respect for the gamer. But I think, you know, and like and that and I'm sorry like I stand by that. Like I don't the the revolution that we thought was happening in 2008, 2009, 2010 where it was like that was like what was going to be the future has not panned out because that doesn't resonate with people that actually care about games. That's that's like the bottom line to me. And I was so happy, you know, like don't get me wrong, I didn't want that [ __ ] to become the future because when I remember I remember saying I remember saying on podcast beyond many years ago, I was like, if that is the future and that's the way we're playing games, I no longer play video games. Yeah. You know what I mean? Like if there's a touch screen and it's all touchcreen and it's just all gimmicky and nonsense, you know, I'm sorry. Like it's just",
            "start": 913.04
        },
        {
            "text": "games, I no longer play video games. Yeah. You know what I mean? Like if there's a touch screen and it's all touchcreen and it's just all gimmicky and nonsense, you know, I'm sorry. Like it's just it's not a judgment on those games per se or the people that make those games per se or the people that play those games per se. It's just say like I take gaming seriously and that platform doesn't. And so like that and that that's I mean like my whole pro my one part problem with the argument is I feel like it's baby out with the bath water kind of thing is that yeah there's a ton of [ __ ] in there but isn't that the same thing of like looking back and granted don't get me wrong Atari took it on the chin and all these other things but when they were making games like ET and there were this stuff there were good games in there too but there was a wealth of [ __ ] You know what I mean? Like I don't want to take away and say that the platform is destructive and totally [ __ ] up and it's all",
            "start": 945.92
        },
        {
            "text": "there were good games in there too but there was a wealth of [ __ ] You know what I mean? Like I don't want to take away and say that the platform is destructive and totally [ __ ] up and it's all on that when it's really a set of bad apples ruining it for the bunch. Yeah. But it's like it's I would I again I don't disagree. I might that that's a decent analogy except for the fact that I think that the diamonds and the rough are the exception, you know? No, that's not even I don't even think that's a a thought. I think by [ __ ] numerals, you know what I mean? If we're looking at the numbers and the lists and the quantity of games put out there and the numbers that are uh swords and sorcery or whatever. No, that's not right. You know, um damn it, whatever. One of the amazing [ __ ] games Marty always likes that I never play, but you know what I mean? Like the ones that are new experiences doing something, Republic will say, \"All right, you know what I mean? Like, yes, there are games",
            "start": 978.24
        },
        {
            "text": "Marty always likes that I never play, but you know what I mean? Like the ones that are new experiences doing something, Republic will say, \"All right, you know what I mean? Like, yes, there are games that are thought out and done this and that's how they're trying to be, but then yeah, there are overwhelming loads of [ __ ] and clones and fucks.\" But Republic is a is a is a game with like with console sensibilities sensibilities and will be coming to those platforms. Yeah. Well, finally, I think. Yeah, cuz they realized they needed to make more money. Yeah. Because you realize that you put your game out. That's the thing is that there's a deficit of trust on these platforms and reasonably so. Like think about the golden era of gaming to me is always going to be the NES era. And I don't think that's a huge wins. It's not to say there wasn't bad. There was really bad games on NES, but Nintendo was smart enough to learn from Atari and be like, you can only publish five games a year.",
            "start": 1016.72
        },
        {
            "text": "think that's a huge wins. It's not to say there wasn't bad. There was really bad games on NES, but Nintendo was smart enough to learn from Atari and be like, you can only publish five games a year. That's it. Yeah. So, you better figure out which games you want to publish. And that created that created shell companies, but it also created a uh a really vibrant ecosystem of great games. You had to believe in your product. Exactly. And when platform holders don't believe that there needs to be any sort of spigot where they can shut things on and off and be like, \"Well, this game sucks, why would we ever want to have it on?\" Apple and Google like don't care. They don't care, you know? And as long as they don't care, I don't care. And the one thing that really bothers me about mobile gaming specifically is like how people read into numbers about mobile gaming. Like everyone plays games now. I'm like, I'm sorry. Like not all games are created equal and not all gaming is created equal. It's",
            "start": 1050.64
        },
        {
            "text": "is like how people read into numbers about mobile gaming. Like everyone plays games now. I'm like, I'm sorry. Like not all games are created equal and not all gaming is created equal. It's not again a judgment if that's how you want to spend your time, which is to say like we learn we we had all this anecdotal nonsense about how many gamers are out there now and they're playing games on Facebook and they're playing, you know, Zing is making these games and like look at them now, you know? Yeah. Like some of these companies don't even exist anymore. The iOS and and and Android seem to exist on the same [ __ ] five or 10 games over and over again. Just people dumping money into these games. Meanwhile, other people just release their games on these platforms and they don't matter. So, I have no idea how the [ __ ] we even got on this train of thought. But, but uh it's it's gaming emissions. Yeah, I with you. Well, no. I mean, what I originally said was that I don't I don't count this as",
            "start": 1087.2
        },
        {
            "text": "no idea how the [ __ ] we even got on this train of thought. But, but uh it's it's gaming emissions. Yeah, I with you. Well, no. I mean, what I originally said was that I don't I don't count this as a platform where there are no missions cuz there are games that I love on iOS like like Plants vs. Zombies. Sure. But that came Dev Story. Yeah. Like whatever whatever the games are, but I mean like come on guys. Like until these platforms start taking their games more seriously, I have no interest in taking their games seriously because it's not even necessarily about the t the lack of tactile control, which is a huge problem too, but um it's more a lack of like just respect for the consumer. sell me my game, you know, make a game that's that you believe in, that's good. Stop racing to the bottom and making everything free and [ __ ] nickel and dimeing people. People don't core gamers don't respect that. I am a core gamer and I don't respect it and I don't respect the platforms that those",
            "start": 1123.6
        },
        {
            "text": "and making everything free and [ __ ] nickel and dimeing people. People don't core gamers don't respect that. I am a core gamer and I don't respect it and I don't respect the platforms that those games come from, you know? So, it's just See, I I'm with you on not respecting, but I don't respect the developers, not the platform. The platform is just a [ __ ] machine to me. Whereas, it's the developers behind it that are doing their different things. Well, let me ask you this question because I don't think there's a right or wrong answer, and who knows like what the future might hold. Do you think that your favorite game of all time in 10 years will be on that? No. Do you think it ever could be? Because I don't I just don't think it's possible, you know? Like I just don't I just don't I just don't think that it's it's you know, I think it's possible. I think I think when you I I mean like when we're talking about processing power and all this other [ __ ] that will come in VR and how I",
            "start": 1162.72
        },
        {
            "text": "don't think that it's it's you know, I think it's possible. I think I think when you I I mean like when we're talking about processing power and all this other [ __ ] that will come in VR and how I mean like there's a million unknowns and who knows what's around the next corner in terms of technology. But I do I think it is I don't want to look at this platform and think of it in the way I still think old people look at video games and they think NES. I don't want to look down the line now and be old and think about oh it's a mobile game and think about [ __ ] uh some touch match three puzzle garbage. I don't know what it's going to become. Just like I don't think people who were wrote off video games as Mario don't know what they became. Sure. But do you would you and again just hypothetically, yeah, consoles disappeared, VA is obviously done. I mean these these handhelds disappear. Yeah. Do you think that you would play games anymore? I mean I would play far fewer games it and I",
            "start": 1194.16
        },
        {
            "text": "yeah, consoles disappeared, VA is obviously done. I mean these these handhelds disappear. Yeah. Do you think that you would play games anymore? I mean I would play far fewer games it and I mean that would be the thing of like now that but like what you're talking about is like I think it's very simple to think of it like a light switch. all of a sudden everything we love is gone and this is what exists in the everything's [ __ ] cuz it would be right like we wouldn't where would you go for but like in reality if that was what started to verge and move off then you'd have sites like IGN be actually telling you what's good and there'd be gatekeepers that rise up you know what I mean similar to what happened in the way of like fan fan zenes that then became EGM and fan sites that then became IG you know what I mean like there'd be a new class that rises up with it to be the gatekeepers and keep these people honest Whereas right now, yeah, nobody gives a [ __ ] Yeah. And that's a huge",
            "start": 1233.92
        },
        {
            "text": "IG you know what I mean like there'd be a new class that rises up with it to be the gatekeepers and keep these people honest Whereas right now, yeah, nobody gives a [ __ ] Yeah. And that's a huge problem. And I also think there's just a limited capability these machines. It's not even about processing power. It's just it is about control and input. You can't like I I think they released Mega Man 2 on on iPhone. Like that's a joke. You know what I mean? Like that's a I'm sorry. That's a joke. You can't There's certain games that you can't play. Like it's fine playing Final Fantasy 6 or Dragon Quest. It's just turnbased and whatever you move around on the screen. I totally support that. Like there's also just a limited array of genres that can be on there and no one's figured it out in the sense of like a massive [ __ ] crazy commercial success. And I just the the reason I bring this up is because the way people were talking about mobile gaming a few years ago was a cataclysmic it was",
            "start": 1272.56
        },
        {
            "text": "sense of like a massive [ __ ] crazy commercial success. And I just the the reason I bring this up is because the way people were talking about mobile gaming a few years ago was a cataclysmic it was it was supposed to be cataclysmic and it and it was supposed to be cataclysmic for our core gaming sensibilities and like I said that was when I was like [ __ ] this like my days are numbered in this industry because I'm not I'm not no like I'm just not accepting it. Done with it. Yeah. And we've seen the exact opposite. These consoles are selling, well, not Wii U, but PS4 and Xbox One are selling meteorically. The games are still bold and ambitious. I also think PC obviously is clearly the biggest viable platform for new games and new ideas. And PC might be the most exciting because there's just a dump a bunch of different ways to have input, whether it's it's your keyboard, whether it's your mouse, whether it could be voice or video, it could be VR, it could be whatever it is. I'm not",
            "start": 1306.56
        },
        {
            "text": "just a dump a bunch of different ways to have input, whether it's it's your keyboard, whether it's your mouse, whether it could be voice or video, it could be VR, it could be whatever it is. I'm not saying anyone's taking advantage of voice or video, but I'm saying there's all sorts of [ __ ] you can do on PC and and conceivably on console. We've talked about this before, you know, that we I come out here and I'm all bullish on consoles and I I [ __ ] talk [ __ ] about PCs and D and I'm clearly joking and playing it up. PC is the perfect platform. It is. I if if if if consoles weren't where they are right now, if this console generation we're in right now, PS4 and Xbox One weren't such a runaway success in Valve, in my opinion, wouldn't have [ __ ] up Steam Machine. They could have easily taken over. They would have been done cuz, you know, like we just got our volume codes, right? But we only got them for PC. They're working on PS uh PlayStation. And it's like, oh man, I really",
            "start": 1343.92
        },
        {
            "text": "taken over. They would have been done cuz, you know, like we just got our volume codes, right? But we only got them for PC. They're working on PS uh PlayStation. And it's like, oh man, I really wanted to play this and I'm playing. I'm like, well, you know what? My PC can actually run it and I could pack a controller and be done with it. And then I could also output that to my TV and I could put it in big picture mode and I could just move the tower out there and and it's like I could do all these things to make the PC be the only thing. But I'm already so anchored both in nostalgia and trophies and digital libraries and this community that I love that I'm like, \"Well, no, I'm going to stick with PlayStation cuz that's like what I am.\" You know what I mean? Like PC has all the parts. And I really thought that Valve was going to come in and be like, \"Boom, Steam Machine. There's one. This is how it works and it's going to your home and it's going to be there and it's going to you don't",
            "start": 1382.08
        },
        {
            "text": "really thought that Valve was going to come in and be like, \"Boom, Steam Machine. There's one. This is how it works and it's going to your home and it's going to be there and it's going to you don't need anything else. You never need I mean like you don't need another gaming machine. You know what I mean? Like we've made it simple. Finally, PC gaming is simple and this will run the games that are important right now. Instead, they were like, \"Hey, [ __ ] it. Everybody can make a Steam machine. There's 14 versions and they range from $100 to 15,000.\" They dropped the ball. And I think that they dropped the ball cuz they never really even wanted the ball in their hands to begin with. They had no interest. I just don't think they can, which I get, but it's just no one came along to be like, \"We we get hardware and we want to be in the hardware business and we can sell this to you.\" You can't. They couldn't because, you know, unless they were endorsed by Steam in some official way. I",
            "start": 1417.84
        },
        {
            "text": "\"We we get hardware and we want to be in the hardware business and we can sell this to you.\" You can't. They couldn't because, you know, unless they were endorsed by Steam in some official way. I think this all brings up just an interesting point that conventional wisdom in gaming and we've I've been wrong many times about the things that I've said before in the past of course too but conventional wisdom about the es and flows of gaming have just been totally [ __ ] wrong for for years PC gaming was [ __ ] dead as [ __ ] the day is along you know in 2007 2008 2009 like like that was just that was a huge they were getting bad ports and like nothing and it was like and you know the consoles were going to die because uh mobile gaming was going to take over and stuff like that and the Minecraft generation is going to ruin the ability to buy and and and manufacture AAA games. Now, there's like there's all sorts of shifts. Yeah, there are there massive shifts. I mean, AAA space is shrinking",
            "start": 1453.52
        },
        {
            "text": "generation is going to ruin the ability to buy and and and manufacture AAA games. Now, there's like there's all sorts of shifts. Yeah, there are there massive shifts. I mean, AAA space is shrinking and there's no middle space anymore, but there's there's a vibrant indie space which you claim or and I think rightfully so might have been incubated somewhat on phones. I still think that we we just don't know what's going to happen. All I know is how I want to play and experience games. Yeah. And I feel like everyone looked at these phones and tablets as just gaming machines for a lot of people, and I'm like, they're not. They're app machines and if you and there's a huge difference between an app and a game. It's not say you can't play and enjoy and make good games on these things. It's just to say these are not the beall end all platforms. And we I didn't mean to go on this hu rant about oration about mobile gaming, but it's just it is Tim's not here to be a [ __ ] wad as usual and",
            "start": 1492.64
        },
        {
            "text": "just to say these are not the beall end all platforms. And we I didn't mean to go on this hu rant about oration about mobile gaming, but it's just it is Tim's not here to be a [ __ ] wad as usual and [ __ ] it all over Pokemon. Uh but I just but to me it's just like Yeah. So like I I just don't look at these platforms as something that I give a [ __ ] about and like I'll be shocked if I ever do. Yeah. Yeah, like I'm just I'm just saying like I always have, you know, I have my my iPhone in my pocket now. I have my tablet and all those things, but I just don't I just And even when these touch games come to something like Vita, it's like I'll play some of these games like I played that game None Attack and um Mayhem Men's Mayhem and stuff like that and I'm like, \"Did you ever play Jetack Joy Ride on PS4?\" Uh yeah. Well, I did a let's play with it on uh with uh um with Tim, but it's like these aren't these aren't like these are 60 hour experiences. Yeah. And they're just like not even",
            "start": 1528.24
        },
        {
            "text": "Joy Ride on PS4?\" Uh yeah. Well, I did a let's play with it on uh with uh um with Tim, but it's like these aren't these aren't like these are 60 hour experiences. Yeah. And they're just like not even that good, you know? I'm sorry. Like they're great time wasters. Yeah, exactly. I'm like there's nothing there's nothing inspired about an endless runner, you know, like like even the genres we've been given by these things, you know, are like it's just like what is this, you know, like what is the genre? Now, you love your race the sun though. I do like Race of Summer. Race the Sun has a point. Race to Sun's not really an endless runner. I mean, it's it's it's it's thoughtful, you know? Yeah. I don't know. I I just think that I I want I want some evidence that positive things are happening from these platforms that benefit games and gamers. And all I'm seeing is the benefit of the same [ __ ] few companies like King putting out the same [ __ ] games claiming that everyone plays games",
            "start": 1565.68
        },
        {
            "text": "from these platforms that benefit games and gamers. And all I'm seeing is the benefit of the same [ __ ] few companies like King putting out the same [ __ ] games claiming that everyone plays games because they play these games. Sure. And then that's and then that's projected on our industry. The benefits are, you know, just like they are on consoles that there are indie people out there doing cool indie things. You know what I mean? that are doing games and mobile games in a way we would have never thought about and like again few and far between. I understand what we're saying. Yeah. And they should go somewhere where people are going to notice. Agreed with that. And I'm not saying that's PlayStation or Xbox or Nintendo. I'm saying that's probably PC. I think most end up there too and then later years later get ported to PlayStation 4. Anyway, I probably piss people off with my my mobile gaming rant. Although probably not. They're not watching this. No one who there are no I mean",
            "start": 1608.56
        },
        {
            "text": "then later years later get ported to PlayStation 4. Anyway, I probably piss people off with my my mobile gaming rant. Although probably not. They're not watching this. No one who there are no I mean there's I don't I don't even know mobile defenders. the people who used to cover mobile stuff for us, I don't know them to come out of the woodwork and argue with us about any of the points they've made and how the history's gone. It's just a shame because I do believe in a level of platform agnosticism where it's like if a good game comes to a platform, you should probably play it if you're interested in it. That was a good example. You know, Gears was always an example that would be on Xbox or obviously a lot of Nintendo first party stuff. You know, when I played Gone Home on PC, I really fell in love with Civilization 5. There's a common theme between those games. They can't be played on a phone or a tablet. And there's another common theme between uh all of the platform agnosticism is",
            "start": 1643.44
        },
        {
            "text": "in love with Civilization 5. There's a common theme between those games. They can't be played on a phone or a tablet. And there's another common theme between uh all of the platform agnosticism is that I can't imagine being excited about anything on that platform, you know? Sure. I hope someone proves me wrong one day, you know. But when people were talking about like Monument Valley and all these games, I'm like whatever. You know, like whatever. You know, I'm not and that's not a that's not that's not a uh that's not a a casting appall on that game specifically or that studio. I don't know anything about that game. just like it was good enough for Francis Underwood based on but based on how many times I was burned and have been witnessed other people get burned on these platforms where they just want to play. It's like that's just turned me off the experience. It's like it's like to say we were talking about with PlayStation Network in the last uh in the last segment. If you had",
            "start": 1676.96
        },
        {
            "text": "they just want to play. It's like that's just turned me off the experience. It's like it's like to say we were talking about with PlayStation Network in the last uh in the last segment. If you had really bad experiences with PlayStation over and over and over again, would you really give a [ __ ] if anyone said that there was a good game on PS4 you should play? Probably not. Exactly. Not. Yeah. And that's where it comes with the PC thing were the drivers and the problems that which is a real problem. I hate when people deflect that because that that is a real problem. And it happens to me every time I try to use a game. Not anymore, but back in the day. Well, Steam has kind of unified things and made things easier. And I I think Steam is so very impressive. Like I think when I [ __ ] around on Steam, there's only a few games I play on Steam, but when I when and you know, very few and far between because we're just so busy with other things, but always very impressed with that",
            "start": 1716.56
        },
        {
            "text": "around on Steam, there's only a few games I play on Steam, but when I when and you know, very few and far between because we're just so busy with other things, but always very impressed with that platform. Yeah, they can learn. That's why I wanted them to win. I wanted them to Steam Box to be awesome and be the reason where I would go, \"Fuck, maybe I will unplug everything and just use this.\" Yeah. But it it wasn't it wasn't to be they Valve is so weird. They're a weird company. Yeah, we can spend a whole I mean because I I don't know a great deal about them. One of the things I wanted to do when I was at IGN when I was still writing my history of series was I was I was looking into in a very preliminary way with with just you know me and and kind of talking to some people about you know doing the history of Valve and it was it was I was I wanted to do it because I thought it would done really well. I wanted to do it because I was also really [ __ ] curious about it myself. Oh yeah.",
            "start": 1748.88
        },
        {
            "text": "doing the history of Valve and it was it was I was I wanted to do it because I thought it would done really well. I wanted to do it because I was also really [ __ ] curious about it myself. Oh yeah. Yeah. Learn a lot about and even if I could have just gotten there for a week and talked to them and not written anything, I would have done it. But Sure. Um, yeah, they they they just they're very insular and they just seem like they don't really care. And I don't really I don't and I don't mean that in an apathetic way either. I just think that they're like our product's good and we don't really need to do anything else. Yeah. We don't need to worry about what people We don't need to make games and we don't need to. It's like the same thing with Halfife 3. It's like I think Halfife 3 will happen, but I think that that's not a priority to them. Yeah. That unlike everything else they do that could it's not going to lose money, but they when they look at development costs and all these",
            "start": 1782.16
        },
        {
            "text": "happen, but I think that that's not a priority to them. Yeah. That unlike everything else they do that could it's not going to lose money, but they when they look at development costs and all these kinds of like this is an investment we don't have to make. Yeah. You know, so I digress. All right, I hear you on that. I still have no idea how the [ __ ] we started on that conversation. Gaming omissions. I I mentioned Super Mario and you you went off. It was just crazy. Nobody understood it.",
            "start": 1811.04
        }
    ]
}