{
    "id": 1088,
    "video_id": "Mp4bOCm6Zm4",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello"
    ],
    "title": "Thank You, TakTrack!",
    "description": "TakTrack received this video due to his support on Patreon. To support the Kinda Funny crew go to: http://www.patreon.com/kindafunny or http://www.patreon.com/kindafunnygames \n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1438810435,
    "duration": 249,
    "transcript_chunks": [
        {
            "text": "what's up tack track T track that's right we're finally going to talk to tack track after all the support he said he said it submitted so many topics cuz he's great there this of course your thank you for patreon.com ofun games naturally been supporting us here he's been giving us all the great topics on the kind of funny games cast we watched his music video we have we did watch the music video it's good thank you for wearing the shirts yeah we watch it was very Missouri where did we watch it we watch it on on YouTube no but oh we were in Dallas oh I see what you mean sorry I didn't understand yeah we still need to listen to his album that's that's going to be one of the topics but we're all very busy yeah and when I say busy I mean we're driving around in the car a lot like this we legitimately could be listening to this album right now it would have been that would have been a great great great idea that would have been a good this is actually one of the only areas where I have a CD",
            "start": 0.08
        },
        {
            "text": "could be listening to this album right now it would have been that would have been a great great great idea that would have been a good this is actually one of the only areas where I have a CD player too think come to think of it well he's also on Spotify oh we'll do it after this then okay when we're done with the these Thank You videos yeah all right sounds good all right all right so there you go Tech track that's going to happen but thank you for all your support we love you you take care of us you're a good dude you have you you've lived a life he's the one who bouncer he I wanted to know about our fights remember uh there was someone [ __ ] I [ __ ] it up there was someone else he did where he was like and I worked this job and I was like what how many jobs have you had I even an amazing story for yeah tell what hey hey Nick how you doing good what tell me what place tack tracks worked tack track this is a little known fact about him worked in an experimental lab to create a",
            "start": 34.2
        },
        {
            "text": "amazing story for yeah tell what hey hey Nick how you doing good what tell me what place tack tracks worked tack track this is a little known fact about him worked in an experimental lab to create a better human growth steroid oh my God for people's feet now a steroid just named at the feet yeah because it it's scientifically proven that the bigger your foot the harder your punching power in the ring but this experimental uh uh scientist went wait is the grow hormone the the experiment or is the scientist T track the science tack Trak worked in the lab as a lab assistant and then realized that they had gotten him in there under nefarious oh no uh pretenses and so when he finally figured out what they were doing drug they were doing elicit drugs they were making drug doing okay no they were making drugs to this wasn't benefiting my at all community no and then he had to kill them all Kevin how's kill them all had Des why you so much water thirsty but like no I'm okay Kevin was",
            "start": 70.16
        },
        {
            "text": "they were making drugs to this wasn't benefiting my at all community no and then he had to kill them all Kevin how's kill them all had Des why you so much water thirsty but like no I'm okay Kevin was literally just at the water up and it was just going into his mouth I've never heard him breathe that heavily though it's like he had to focus so hard I'm sucking this water down problem with breathing and drinking water you understand too that he just ate five lunchable pizzas so not only is he coated in sodium inside his heart struggling to continue to beat right now cuz this was piled on top of McDonald's food which was piled on top of us eating horribly all week yeah destructible I don't know what you're talking about you'll fall your voice is destructible it's my one weakness okay so anyway T try to kill the scientist and save the scientist's hot daughter uh because her name is Julia okay and she is no but they're related which is weird it's some weird alternate universe so it's oh",
            "start": 122.32
        },
        {
            "text": "T try to kill the scientist and save the scientist's hot daughter uh because her name is Julia okay and she is no but they're related which is weird it's some weird alternate universe so it's oh they're alternate universe related yeah they're alternate universe related so it's kind of weird that like she's a cousin of Julia Styles yeah but they were born at the exact same instant and when the moms were naming them they were like they both want Julia because Julia was their um their great aunt who was the matriarch of the family cool yeah again the what where's the alternate universe part so they were born in alternate universes and then they crossed over as part of the foot foots I'm going to share this with you right now I'm not 100% sure I know what an alternate universes so thank you T track for all your support on patreon.com kindof funny games and of course all your support on patreon.com just period all your support period you've been fantastic you wear our shirts and your music",
            "start": 173.2
        },
        {
            "text": "track for all your support on patreon.com kindof funny games and of course all your support on patreon.com just period all your support period you've been fantastic you wear our shirts and your music videos uh you're you're a lovely dresser I got a burp but it's not coming so I'm just doing that thing where I'm like please don't push it cuz I don't want you to throw up on your shoe right sh the shoe would be the least of the concerns with me throwing up in this car with like an hour left in the trip TX track we love you thank you so much all right",
            "start": 221.16
        }
    ]
}