{
    "id": 14009,
    "video_id": "0jCbOEVspUU",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Mike Howard"
    ],
    "title": "Mike & Nick Play Avowed Powered by GeForce RTX 5090 and NVIDIA DLSS4 #rtxon #geforcepartner",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745926086,
    "duration": 4969,
    "transcript_chunks": [
        {
            "text": "Yo, what the heck is going on? Kind of funny best friends, welcome in to your Monday afternoon stream with you guys, Mike and Nick in the afternoon. We're back uh with Barrett today as well. Barrett, thank you for running the ones and twos and thank you to all of you staying through an entire day of live contact content here at Kind of Funny Games. Kind of funny games daily. Kind of funny games cast. We had a screencast. We had a podcast. Now we're here for an Nvidia sponsored stream. I'm telling you. I'm telling you what, if you like our content, and I know you do, this is one of those days where we really over for you guys. We had some great stuff out there. The podcast we just did live was so hilarious. We talked about Blessing's journey. Second time going to Japan in one year. Fantastic. And then we also answered the question, who would win in a fight, a silverback gorilla or 100 men? Yep. And Andy got a birthday present. And Andy got an early or and good birthday present depending",
            "start": 7.2
        },
        {
            "text": "And then we also answered the question, who would win in a fight, a silverback gorilla or 100 men? Yep. And Andy got a birthday present. And Andy got an early or and good birthday present depending on how you look at it. Well, you know, you got to let presents come to you, Nick. Yes. Okay. Sometimes people have birthdays and there's a set date. Sometimes you got to let the gift come to you. Absolutely. He is someone who touted February as his entire birthday month. Birthday month. Even though of us who have February as well. Wow. Cool. Greg. Wow. Is in February as well, isn't he? Well, I got him a birthday gift. You know what I mean? Like that's nice. Nearly in May. I was close. I was close. Like I said, the birthday gifts come to you. Okay. So, if you're going out there and you're going to buy someone someone's special a birthday gift, let it come to you. Let it come to you. Let it come to you. Now, Nick, you know what's coming to us? You and I having some fun during this afternoon",
            "start": 52.4
        },
        {
            "text": "to buy someone someone's special a birthday gift, let it come to you. Let it come to you. Let it come to you. Now, Nick, you know what's coming to us? You and I having some fun during this afternoon stream. Today we have kicked on a vow because we have teamed up with our friends over at Nvidia to showcase more Nvidia DLSS4 and all of the tech that goes into your brand new graphics cards, giving you the very best. And with our Nvidia 50 series, we can get the very best of DLSS4 with multi-frame generation. That's what Nick's going to be showcasing today. Just like we did with last week over at Allen Wake, we have a fun partnership with Nvidia where we'll be showcasing DLSS and Nvidia Reflex all day long. Over 700 games and apps have this tech that you can get the very best out of your GPUs. And so, Nick, if you go to the settings really quick, let's just show them what you got and how easy it is to click on. Of course, update your driver settings anytime you boot up the PC. Make sure",
            "start": 94.8
        },
        {
            "text": "And so, Nick, if you go to the settings really quick, let's just show them what you got and how easy it is to click on. Of course, update your driver settings anytime you boot up the PC. Make sure it's ready to rock and roll. But just like that, upscaling. We can go right on over to Nvidia DLSS. We got Nvidia DLSS4 thanks to our 50 series. You have it on performance. You got frame generation. You got reflex low latency. So, you have all the options to get the very best out of your performance on your rig. Absolutely. I love that, Nick. Let's go have some fun. Of course, if you want to learn more during this sponsored stream, type an exclamation point Nvidia anytime to go check out the blog post with all of the games detailed and how you can take advantage of it. Of course, chat, welcome in. It's Mike and Nick in the afternoon and I miss you. I can't wait to talk with all of you. Uh the X guy says bedtime for me. 9:00 a.m. meeting tomorrow. Can you believe that, Nick? A full day of",
            "start": 142.24
        },
        {
            "text": "in. It's Mike and Nick in the afternoon and I miss you. I can't wait to talk with all of you. Uh the X guy says bedtime for me. 9:00 a.m. meeting tomorrow. Can you believe that, Nick? A full day of content streaming. They're already going to bed. That's how big the day has been. That's crazy, man. Look, it's been a big day. When you're as good at making content as we are here, the kind of funny offices, you deserve yourself a nap. Yeah. Enjoy that. I appreciate that. And thank you to Mr. Pib answering the question over on the YouTube chat. Thank you, Mr. Pib. Yes, that will return next week. I am forcing Andy and Nick to sit in the lab to play Pokémon. No excuses, no schedule changes. They have to play it for my birthday. Uh so yes, you will get Pokémon soon. But until then, you have a full week of content before that, which is going to have a whole lot of fun coming your way. Uh Nick Scarpino, you're playing a vowed and you are getting mauled by a bear. M bear. Getting mauled by a",
            "start": 183.84
        },
        {
            "text": "full week of content before that, which is going to have a whole lot of fun coming your way. Uh Nick Scarpino, you're playing a vowed and you are getting mauled by a bear. M bear. Getting mauled by a bear. How many jabronies do you need in a vow to take down a bear? We'll find out in just a moment. So, I got to I got to cook this bear's behind real quick. Yeah, yeah, yeah, yeah. Got the bear. Good thing you got three jabronies as a crew in this game because man, you really needed them on that one. The heck is going on? What's this thing? See this little minion thing for my life. Yeah, I think that Groot guy just called. Yeah, this guy these guys are What's up with Groot over here? Got him. Got him. Nice job. Nice job. Okay, we are We're still fighting the bear over on the far side. Don't you worry about it, bro. I got you. Watch this. Watch this. Santos. [Music] Nice. I'm frame generated, bro. This uh this started really fast. Get this stream kicked off. We just you know you know how",
            "start": 228.8
        },
        {
            "text": "you worry about it, bro. I got you. Watch this. Watch this. Santos. [Music] Nice. I'm frame generated, bro. This uh this started really fast. Get this stream kicked off. We just you know you know how you go. You get in there and you just got to start you got to start like letting them know. Uh welcome back to Nick's playthrough. I'm a vow for this fun Nvidia sponsored stream. Nick, as I was going to ask you before you fought seven bears and two group men. They don't. Where are we here fighting off the dream scourge of a vow? Do you remember where you left off? You know I do. I was in a lake going for a meteorite on a side quest. Um that was very difficult and I was getting owned. So I dropped the I will say I dropped the difficulty level down one. I'm on uh not the easiest, but I'm on the second to easiest cuz I just want to kind of get back in here and have some fun and level up a little bit. But now we are doing this main story mission which I believe well actually you can see it",
            "start": 288.24
        },
        {
            "text": "second to easiest cuz I just want to kind of get back in here and have some fun and level up a little bit. But now we are doing this main story mission which I believe well actually you can see it right there is retrieve an an adroane heart. I got to go over to the animacy method and get or that's that's the name of the mission. I got to go find this this heart. So that's what I'm doing. We are continuing to investigate the dream scourge. Figure out what's going on with that. I am a beautiful godlike. I don't know if you know this or not about me. Beautiful things are growing out of my face and probably my back as well. So, we're continuing to just kind of look around the beautiful land that we are in in gorgeous. And you got your two homies with you. I got my guys. I got Garris and uh Kevin and we're just having fun, man. We're exploring and we're we're doing missions and I'm I'm trying to prove to everyone that godlikes aren't that bad of people. Okay. Yeah. Yeah. They were a little",
            "start": 334.48
        },
        {
            "text": "and we're just having fun, man. We're exploring and we're we're doing missions and I'm I'm trying to prove to everyone that godlikes aren't that bad of people. Okay. Yeah. Yeah. They were a little worried about your look. That's right. Yeah. Exactly. Exact. All right. Well, here we are. Of course, chat, let me check in with all of you as we ride alongside Nick Scarpino. Chad, how we feeling today? What's the vibe? How's everything? How's everybody doing? I think Oh, what's this big treehouse? Should we check this out? Get in there. I played almost the whole game with a pistol with shock damage and high stun. Loved it. It's what Drew says. It's so fun. I'm I'm I'm dual wielding right now. I've got my my wand and I've got my sword. And they are basic weapons, but I have upgraded them a little bit. Upgraded my abilities and I think I'm trying to go all in on the old uh What are you doing? Wizard. I want to be a wizard for once in my life. He's a wizard. I'm a wizard. Wizard. What are",
            "start": 381.16
        },
        {
            "text": "bit. Upgraded my abilities and I think I'm trying to go all in on the old uh What are you doing? Wizard. I want to be a wizard for once in my life. He's a wizard. I'm a wizard. Wizard. What are these people? Hello. He was a fair. I swear this I'm going to steal this. I'm going to steal this. Yeah. Take all that stuff. That's That's just free. They can't I got a fish guy with me and a dwarf and they can't stop me. They can't stop you now, right? Oh, thanks, homie. Yeah, it's Monday. I'm happy to be back in the office. I had a terrific weekend and uh I was so excited to return to work for this week in particular because of this sponsored stream. And then throughout the week, me and Nick have a challenge. We have a goal. We got to escape. We're going from noob to pros in one week. One week devoted to nothing but Escape from Tarov. Mike and Nick's adventures start tomorrow. I have finally bought the game. I have downloaded it. I'll tell you what, we should a couple of days. We should have",
            "start": 421.92
        },
        {
            "text": "to nothing but Escape from Tarov. Mike and Nick's adventures start tomorrow. I have finally bought the game. I have downloaded it. I'll tell you what, we should a couple of days. We should have streamed how hard it was to actually buy and download this game cuz it sounds like we're hacking Russian Russian intelligence. It was a lot going on. Kevin thought I was downloading another malware virus, but uh it was the point where Kevin was like, \"Please don't use anyone's credit card for this because this is not going to go well for anyone.\" I gave him my credit card. It was good enough. It was fine. And so, yeah, we are super excited. Um, you know, this week it's going to be just Mike and Nick on your streams. And so, we're really, really excited to try a new game, jump into it. We've been down with the Extraction Shooters lately, you and I. Marathon. Uh, we get to talk some more about Escape from Tarov. So, that's going to be cool. So, yeah, you and I, we got a big uh extraction week",
            "start": 466.88
        },
        {
            "text": "down with the Extraction Shooters lately, you and I. Marathon. Uh, we get to talk some more about Escape from Tarov. So, that's going to be cool. So, yeah, you and I, we got a big uh extraction week going on. We're very excited as the kids. I love that you're just taking everything from these people. Well, you know, I'm sure this is a side mission that I just haven't hit yet, but Okay, let's take a look at this land. Got to do the cinematic thing Andy likes to do. Yeah, show it off. Let it soak. He says, \"Let it soak.\" It's good. Now, I wonder if he'll let that cactus soak that I bought him. Of course. Minimal attention needed. I thought this would be a good uh gift. Why don't you plant it outside and see if we can get it to grow where the old kumquat tree? Oh, that's not a bad idea. That'd be kind of cool. Kind of fun, right? Maybe in like 10 years that thing's huge and Yeah, we're still here. And you know, be beautiful. That would be cool, Nick. That would be cool. Then everybody be",
            "start": 506.56
        },
        {
            "text": "be kind of cool. Kind of fun, right? Maybe in like 10 years that thing's huge and Yeah, we're still here. And you know, be beautiful. That would be cool, Nick. That would be cool. Then everybody be like, can we get that [ __ ] cactus out of the front? It just falls down. And I'm like, I'm not taking it out. It's got Oh, look at all this gun, man. We just we found some sort of uh treasure trove here. I got this is some sort of crew here. They had every weapon under the sun. Oh, an ancient memory. These poor guys are going to get assaulted. Yeah, they're going to get sieged and they're going to go for their guns and I'm just going to be running away with Exactly. F you guys. F you. Hero of time 73 says, \"Michael and Nicholas.\" What a duo. Come on. We're going to have a great day today. They call us the dynamic duo. tomorrow. Sunburn and Cheeto fingers full out. It's game time. Cheeto fingers. Are you getting dusted? Get dusted. Lick the tips of the fingers. All right. This lady just",
            "start": 548.16
        },
        {
            "text": "call us the dynamic duo. tomorrow. Sunburn and Cheeto fingers full out. It's game time. Cheeto fingers. Are you getting dusted? Get dusted. Lick the tips of the fingers. All right. This lady just talks too slow. I was going to ask you, are you watching this? Is this you? What's going on here? My brother, my lover, my rival. I just want to I just want to get to the battle. He just wants to get into the good stuff, y'all. Get him into the good stuff. There's so much talking. There was a disaster. It's like a like a history class. You're just not into it. No. No. Yeah. Yeah. You flew into rage. Slide took a village with it. We were caught a shard of memory. We were battered, wicked, the earth gave way beneath our feet. We were left to fall alone. There were We looked with how could you bear to speak to us? It twisted beneath the brand of your forgiveness. It burned us to know you never expected better. After now, this could be the dream scourge talking to you. You know what I mean? It's",
            "start": 591.92
        },
        {
            "text": "to speak to us? It twisted beneath the brand of your forgiveness. It burned us to know you never expected better. After now, this could be the dream scourge talking to you. You know what I mean? It's like, ah, they burned my my my roots. Mhm. Well, they're scourge. That's what they get. Compassion. Yet, Mod, your brother, opposed Nakutek's construction with his How could he despise your mission? [Music] Is that I'm just going to go through it. I just want Yeah, get Thank you to Lexi Gunner for the tier one sub for 94 months. Says Mike and Nick in the afternoon. Lexi Gunner, we have a lot to catch up on. I'm very excited. Hopefully next Monday. We can do a little Mike and Nick in the afternoon because I have a lot of internet to show Nick. Of course, I want to take some time and talk about the NBA playoffs and of course the NFL draft. But, uh, we'll get to that in the Mike and Nick afternoon segment because man oh man, I got some great videos for you, Nick. I'm excited for you, Mike.",
            "start": 645.52
        },
        {
            "text": "the NBA playoffs and of course the NFL draft. But, uh, we'll get to that in the Mike and Nick afternoon segment because man oh man, I got some great videos for you, Nick. I'm excited for you, Mike. Got some great videos. I can't I'm excited for me and excited for you and I'm excited for us to race. I don't know what that you know what I'm talking about. Yeah, I love that. That's a little teasers, right? Teaser. A little malt teaser. All right. I think he's just bang out of here. I don't think I need to be in here anymore. JD Neil says, \"I can't wait for you guys to shoot each other because this game doesn't have any markers for teammates.\" Yeah, we're going to be pretty excited, JD. We're going the hardcore. The hardcore. It's going to be so fun. This would be cool if that went down. Oh, I mean, might like if you just jumped on that thing and all of a sudden just went down. Might be able to. No, you wish. Be cool if you could though. Yeah. Get out of my way crates. Man, what a year",
            "start": 703.2
        },
        {
            "text": "I mean, might like if you just jumped on that thing and all of a sudden just went down. Might be able to. No, you wish. Be cool if you could though. Yeah. Get out of my way crates. Man, what a year for RPGs, Chad. I'm telling you what, you got a vowed. You got Kingdom Come: Deliverance 2. You got now Expedition 33, Oblivion Remastered. Yeah, people were asking if I was interested in that. I probably might play a little bit of it. You might play a little Oblivion. Yeah, it's old school. Did you ever play Oblivion way back in the day? I just played parts of it just to capture for like review cuz that was like the first year or two I was at IGN. Okay. And you were playing games for review, like to capture, I would just like jump into like Aaron Brevig save or something like that and be like, \"Hey, I'll just I'll capture this segment that I needed.\" time. I'm anecdotally familiar with Oblivion, but it never really spoke to me. Uh just because that's one of those games you really like most",
            "start": 738.08
        },
        {
            "text": "\"Hey, I'll just I'll capture this segment that I needed.\" time. I'm anecdotally familiar with Oblivion, but it never really spoke to me. Uh just because that's one of those games you really like most RPGs, you got to just kind of give yourself to you got to give yourself to it. You got to commit to the bit. Um it's like you and Cyberpunk. I love Cyber Punk, man. I'm loving it. Or you and I with Alan Wake. Man, what a good what a good opening of a playthrough. Me and Nick and Alan Wade. This guy's blocked every single one of your shots. Yeah, he Yeah, really has. But he's not going to block this. Skeleton Warriors. Three skulls. Oh, no. You got him. He's got to be you. Over here. Okay. He's kind of strong. This guy's very strong. He's kind of strong. This guy's very strong. And this is bad. I should not have picked a fight with these guys. Mr. Ox says, \"My my first day on the new job. Got to get the KF up to finish out my afternoon.\" Well, congratulations on the new job. Hopefully you",
            "start": 781.6
        },
        {
            "text": "I should not have picked a fight with these guys. Mr. Ox says, \"My my first day on the new job. Got to get the KF up to finish out my afternoon.\" Well, congratulations on the new job. Hopefully you had a terrific Monday and a great first day. Nick is out here just working right now. The guy was tough. Marius is uh low health right now. Mario is going to take a dirty. He's fine. He's fine. We're good. We're good. There we go. You're good. These are my guys. We make a good squad. I know we do, Marios. Let him know. Look at this. Look how pretty this is. Let him know. I think that was Kai. Oh, shoot. Whoa. Something's hit me. Something's hitting me. Okay, you're going in. You're going to the heart of something right here. Twice. This is where takes us. These are very powerful, though. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Bad. This is where we just stand back and let the boys fight. Let the boys fight. Let them fight. This is you with the one versus 100 gorillas here. You just got to watch",
            "start": 839.2
        },
        {
            "text": "Yeah. Yeah. Yeah. Yeah. Bad. This is where we just stand back and let the boys fight. Let the boys fight. Let them fight. This is you with the one versus 100 gorillas here. You just got to watch it. Oh, I've been informed that I've been informed there's a secret treasure cash up there. This makes sense cuz this is tough. Somebody's guarding it. Watch your back. Oh [ __ ] I got impacted. I got him incapacitated. Oh man. Bro, get on this guy, bro. I like they gave you that little like You're not good enough at this game. You can come back up to it. What the hell? Louise, that guy really messed me up there. Oh wow. Our first death of the day. Okay. Oh, I did not think that was going to happen. I thought I had that guy. So, you don't take a knee and your teammates come and res you. Mm-m. Wow. Okay. You get one basically like, \"Hey, you're incapacitated and Oh, that was a See, I thought you got rooted up or something. You need to break free.\" Okay. Interesting. Oh, well, we're back on top",
            "start": 894.96
        },
        {
            "text": "Okay. You get one basically like, \"Hey, you're incapacitated and Oh, that was a See, I thought you got rooted up or something. You need to break free.\" Okay. Interesting. Oh, well, we're back on top of the uh the good old watch tower. The good old watch tower. Got to collect all their stuff, though. Got to have all this stuff. Got to steal it all the You know what I mean? Got to watch this. Don't hit that memory. Don't you dare. We figured it out. We heard about it. We're going to go straight to the mission. Actually, Harley, what's up? Welcome in on the YouTube chat. Hi, Harley. Thank you for tuning in. Look at us just having fun. Just platforming, just having a great time. As a reminder, the skulls mean the monsters are above your level and at levels and levels are decided by gear quality. Oh, okay. Good to know. Yeah, I'm I decided that I'm very underleveled for a lot of this game. You're very underleveled. Uh and I don't know if I should be doing more Ask that same person. Should",
            "start": 964.24
        },
        {
            "text": "Oh, okay. Good to know. Yeah, I'm I decided that I'm very underleveled for a lot of this game. You're very underleveled. Uh and I don't know if I should be doing more Ask that same person. Should I be doing more side missions to get or like should you be following the story? Well, I am. This is the main story mission, right? I just every I just keep clashing with clashing baddies out there. It's better than clashing with baddies. Michael, what's up? Better than clashing with baddies. I'll get to this little shard here. Upgrade your gear at camp is what people are saying. Oh, look. You know, I have though. I've upgraded all my stuff. I just don't have We could take a look. We could talk about it. Talk about it. So, I've come here, right? I got my workbench. Upgrade my gear. A little upgrade. I want to sell stuff. Mike, how far are you in the blueprints? Did you ever reach uh room 46? BJ Bernardo, I have reached the final room, but all of the doors were closed and I have not played",
            "start": 1013.36
        },
        {
            "text": "I want to sell stuff. Mike, how far are you in the blueprints? Did you ever reach uh room 46? BJ Bernardo, I have reached the final room, but all of the doors were closed and I have not played since. So, there will be a day I need to go back and play. Yeah. See, I don't have Are we upgrading that common sword, bro? I've already upgraded it, but I need I need more parades ladder. Yeah, you need more iron chunks. I want to just sell half this crap. I don't know how to sell. What do you sell stuff at this game, guys? I think you have to go back to the vendor for that. Probably got to go back to the team. Yeah, let me go back to town and sell all this [ __ ] I don't want to get uncovered. Listen, Kai, I need you to stalk like a cat, not stomp around like a ballot. Excuse me. Oh, look at him with the nice the cool fun lines. Yeah, they're fun. They're getting a little playable. He's like, \"Hey, you heavy stomping, you know. We're trying to trying to be quiet as we slick in here.\" Well, you",
            "start": 1059.52
        },
        {
            "text": "the nice the cool fun lines. Yeah, they're fun. They're getting a little playable. He's like, \"Hey, you heavy stomping, you know. We're trying to trying to be quiet as we slick in here.\" Well, you think if you lick this, you're gone for a couple days. Oh, easily. You are you are in World of Warcraft land, as I used to call it. Let's see if we can just not engage. Now, people say you could break it down for crafting materials. Oh, okay. That's what I need. How do I do that? I go to the back of my camp. I think so. That's what I want to do. I think so. Let's set up camp. Let's do that again. Let's see if we can't upgrade it. Scrap the stuff for upgrades. Thank you. All right, take a look. It's in a book. It's reading rainbow. Reading rainbow. Reading rainbow. Enchant unique weapons. Nothing I can do. Oh, got nothing. Break down. Break down. R. What's this thing? Why is it all cool and dangly? No, I'm not a shooter. Tell me. What do you say? I might keep. You're not a shooter. Could be a",
            "start": 1099.76
        },
        {
            "text": "I can do. Oh, got nothing. Break down. Break down. R. What's this thing? Why is it all cool and dangly? No, I'm not a shooter. Tell me. What do you say? I might keep. You're not a shooter. Could be a shooter. Okay, this is a level two fine quality. Chat, should I go two-handed ranged gun? I can mess around with it. That would really change up your play style. That's kind of fun. No, look at that. Look at you. Little slow. Yeah. Okay. Okay. Look at you. What do you got upgrade wise? Oh, you can just scrap anywhere. That's cool. So now, see, I still can't upgrade. Yeah, he's still short. I'm still short. See what I can craft. Can I craft anything? More potions or something. Upgrade material. Downgrade. Downgrade. I want downgrade anything. Is a vow co-op. How are they both play? No, Eric. Uh we are watching Nick Scarpino play right now with this. Uh it's a fun Nvidia sponsored stream. We're showcasing DLSS4 with Nvidia uh and how you can get the very best by not sacrificing any of your",
            "start": 1142.88
        },
        {
            "text": "we are watching Nick Scarpino play right now with this. Uh it's a fun Nvidia sponsored stream. We're showcasing DLSS4 with Nvidia uh and how you can get the very best by not sacrificing any of your high quality uh gameplay for frames. Okay, let's just go on the mission. We'll we'll just skirt around those guys. Get a quick save off, too, while we're here. Skirt around them. I like that. Yeah, we don't got to go get involved on that. Always have to get involved. All right, we're taking a little walk, y'all. Here we go. I can't do anything. I'm assuming it's up this way, right? Nope. This is where we went before. Screw these guys. Run away. Let's take a little wrap around. All right. Let's do a little rap. Let's get a wrap. Well, my guys are back there still. No, you know, they got to fight for you. They got to put up the fight. Oh, this guy just conveniently left two potions and some coin for you. I can take these guys. No, you Oh, you think so? Okay. Yeah, get after them. I think I",
            "start": 1214.8
        },
        {
            "text": "for you. They got to put up the fight. Oh, this guy just conveniently left two potions and some coin for you. I can take these guys. No, you Oh, you think so? Okay. Yeah, get after them. I think I got it. You just got to be a little more strategic with your moves here. Well, Marius is going to die. Oh, okay. Perfect. Look, he's back alive. That's not good [ __ ] Yeah, a little longer range than what it is. Oh, Eric says, \"I love this game.\" Nice, Eric. Heck yeah, man. Yo, this guy's That's the guy, dude. Get it out, bro. Let it out. We got to watch out for that guy. Kill this [ __ ] dude. Shoot this [ __ ] They just threw a giant grenade on your teammate right there. Oh, see yeah, you got him. You knew you had it. Oh. Oh, bros my ass. Yeah, definitely don't get hit by that, bro. Kill this guy, dude. Blast his ass. Oh, damn. He got frozen solid, man. So, that guy's a rock right there. Got him. I got him. You know, your homie is laying down [ __ ] frozen. Keep dodging. This is I I can't",
            "start": 1284.08
        },
        {
            "text": "guy, dude. Blast his ass. Oh, damn. He got frozen solid, man. So, that guy's a rock right there. Got him. I got him. You know, your homie is laying down [ __ ] frozen. Keep dodging. This is I I can't take these guys on. I'm way too You're good. You burned him. You burned him. He's back up now. He's standing. Yeah. Yeah. There you go. He just needed a moment. This guy. Did we just attract somehow more people? Oh, yeah. Oh, wow. That's big. Oh, this was that first guy, wasn't Yeah, that was somehow those first guys respawned and then you attracted them. Now, this is the game, man. This is the game. It's all about battling, bro. You want to battle? You want to battle? I've got it. That guy just like, \"What up? I'm up here. [ __ ] you, dude.\" No, there's just too many guys. I'm not. That's all right. It's all right. Got to drop them out of the open here. [Applause] Oh, just blocked it all with the shield. Yeah. How badass was that? Yo, you know, we're just going to restart. We're going to",
            "start": 1365.04
        },
        {
            "text": "right. It's all right. Got to drop them out of the open here. [Applause] Oh, just blocked it all with the shield. Yeah. How badass was that? Yo, you know, we're just going to restart. We're going to load that guy. He's going to load it back up. Yeah, he's got Hey, no harm, no foul. That's us getting dominated. No harm, no foul. Okay. Well, you know what I mean. That means we get to restart. Try that again. We're going to go around this. Mike, have you played this yet? Away. And I put about seven hours in at launch for a day and that was about it for me. uh just wasn't in the mood at that time. Uh haven't gone back either. I probably should. I know people really liked this one. I do like Obliv or uh Obsidian and what they do with the RPGs, but I kind of want to play Kingdom Come Deliverance over this at this time. Oh [ __ ] Oh [ __ ] Just woke up the plant people. We're fine. They don't get, you know, they mix it up. You got too many, right? Away. I got I got this. I got Oblivion. I",
            "start": 1428.64
        },
        {
            "text": "over this at this time. Oh [ __ ] Oh [ __ ] Just woke up the plant people. We're fine. They don't get, you know, they mix it up. You got too many, right? Away. I got I got this. I got Oblivion. I got Expedition 33. I got Kingdom Come Deliverance, too. I got to I got to make a choice on where I'm putting it. I don't know yet. Oh, wow. Big come up. I do have to go that way. Oh, I guess I can go this way. It also doesn't h help Wayne that I'm like you know me proceeding to just put a bunch of my time and effort into old games as well. That's important. I mean I played DMC 3 Nick and that game that game is one of the coolest games I've ever played in my entire life. Devil May Cry. So cool. That's crazy. That's crazy talk, man. [ __ ] me, dude. There's so many bad guys out here. Yeah, this is bad. Oh. Oh. Oh. Oh. There's a little sport people. Oh yeah. Yeah. They're on me. Oh my god. Oh my god, there's group. Oh [ __ ] Yeah, this is bad. Yeah, I need more parkour. I might need to take a",
            "start": 1485.04
        },
        {
            "text": "bad. Oh. Oh. Oh. Oh. There's a little sport people. Oh yeah. Yeah. They're on me. Oh my god. Oh my god, there's group. Oh [ __ ] Yeah, this is bad. Yeah, I need more parkour. I might need to take a step back and just start doing some sides. Yeah, you can always restart. You don't got We're here with you on your journey. The thing, dude. I'm going the thing. I'm just literally running past all these guys. How the [ __ ] am I going to Oh [ __ ] We've all been We've all been what? We've all done what you're doing right now in a game. You just got to run past all the enemies and just try to get to the quest marker and just finish it off strong. Uhoh. He's got some army on me. Oh man, I thought you were going to jump for it. I still got I got a little bit left in me, but okay. Okay. Okay. Oh man, that guy's going to jump. I can go hard in the yard. It's not going to be good. It's not going to be a You got to jump, man. There we go. Commit to greatness. Dip out of there. Oh, look at you.",
            "start": 1546.08
        },
        {
            "text": "man, that guy's going to jump. I can go hard in the yard. It's not going to be good. It's not going to be a You got to jump, man. There we go. Commit to greatness. Dip out of there. Oh, look at you. You're playing with him, cheesing him. Oh no. He can jump, too. [ __ ] [ __ ] Oh no. All right. Well, this mission is uh too far into the game. Yeah, we got to We take that mission. We scrap it. We scrap it. Let's go back to the camp. Let's re-evaluate where you're at. Let's find you a new mission to do. Okay. Of course, thanks to our sponsor for today, Nvidia, where you can take a moment, you can update your game drivers, and you can get the very best out of your GPUs. Right now, we are on our 50 series showing off DLSS4 frame generation for over 700 games. Just like a VAD where you can get the very best quality without sacrificing frames. Of course, you know this because we have done many Nvidia streams where we get to show off DLSS and of course, Nvidia Reflex. Will you get the very",
            "start": 1597.08
        },
        {
            "text": "the very best quality without sacrificing frames. Of course, you know this because we have done many Nvidia streams where we get to show off DLSS and of course, Nvidia Reflex. Will you get the very best performance out of your computer? We're going to do a little companion. We're gonna hook up our homies here. Oh yeah, do something new. Okay, we're going to go back down this way. I like that. I'm just I'm clashing with too many people waiting for me. Dubai says, \"I didn't enjoy Kingdom Come Deliverance 2 at all, but I played a I I played a vow twice though.\" Meaning like you played it all the way through or you just turned it on twice cuz Yeah, if you played it all the way twi through twice, that's amazing. That's pretty great. Holy cow. What's up there? Dang. See, there's just little spots you go. I want to just explore that. Gone in minutes. No wonder they're having trouble for years. Years. Potion. Read that. Put that in the log for later. Yeah. Get it loose. Loose like a goose.",
            "start": 1648.32
        },
        {
            "text": "you go. I want to just explore that. Gone in minutes. No wonder they're having trouble for years. Years. Potion. Read that. Put that in the log for later. Yeah. Get it loose. Loose like a goose. Dubai says, \"I beat it and then I started it over on the hardest difficulty.\" Nice. Wild. Good for you. Pretty crazy. That's called having a good time. My minions. My minions. My minions. We should go. We'll go back to that. We'll go back to that this year. You only if Kevin plays with us. Only if Kevin play. Kevin, you're all over the battlefield. I don't know how to use awesome keyboard. Thanks, Kevin. Oh, man. Not the tree guy again. Oh, you're you're you're mopping the floor with these guys. All right, we found the zone we got to be in. Yeah, yeah, yeah. There we go. No, maybe not. Yeah, that guy's got aggro that guy. Christ. Blast him in the forehead, man. Can you control your guys? No, it's like Mass Effect where you just kind of tell them what to do. Okay, but they just kind of do their",
            "start": 1695.6
        },
        {
            "text": "got aggro that guy. Christ. Blast him in the forehead, man. Can you control your guys? No, it's like Mass Effect where you just kind of tell them what to do. Okay, but they just kind of do their own thing. I'm I'm a wizard. I'm kind of getting in there a little bit too much, though. So, I need to like I need like a little bit less clear. The combat's really fun, though. Yeah. Fast-paced two-handed combat similar to what you would see in a Skyrim, but also having the loadouts to quickly change and do different things is really cool. That's right. Your spell casting, which I always appreciate getting to see all the cool colorful spells. Just punishing. It's fun. What's chat saying? Chat's like, \"You're the wrong man. You got to go back. You're so far gone. No, they're all just hanging out with you, watching. They're enjoying it. Everybody's dialed in. There. That's Thomas's old house. Oh, okay. Tama. Tama, what's up with your house? It's your boy Nick. Who else so much here reminds me",
            "start": 1760.88
        },
        {
            "text": "with you, watching. They're enjoying it. Everybody's dialed in. There. That's Thomas's old house. Oh, okay. Tama. Tama, what's up with your house? It's your boy Nick. Who else so much here reminds me of Tama. Tama? It's strange to be back without him. I still can't imagine what he wanted me to find. Say what? What's that you're holding? Yeah. Yeah, it is. Damn you, Tama. Damn it. Damn you. Gosh darn tama. I carved this for him years ago. I had no idea that is the voice actor, let alone All this time, I never knew he had. I never knew. And he tells me like this when he's long gone, leaving me with nothing but a piece of driftwood I gave him years ago. Sorry. Oh, so loud. You got the godlike features, just your eyebrows. Very cool. I never gave him any reason to be koi. And we knew each other for years. We were close. I trusted him with things in my past. Things I don't talk about. Sometimes I wish you weren't so damn perceptive. It's my job, dude. Did I tell him? Huh? I was a mess when",
            "start": 1829.68
        },
        {
            "text": "for years. We were close. I trusted him with things in my past. Things I don't talk about. Sometimes I wish you weren't so damn perceptive. It's my job, dude. Did I tell him? Huh? I was a mess when we met. I'd been through the battles in Deadfire and a handful of mercenary campaign since. I was a chewed- up piece of flatsom drifting to the living land. You're damn right. Tom always saw right through me. He knew what I was. A coward. No, I let him down. A coward. He was always there when I needed him. But when he needed me, I'm sorry. I'm going to need some time with this. That's probably for the best. I appreciate you listening, especially since we haven't talked much. Just the the two of us. Little fresh air will clear my head. Look at that. Two best friends just hanging out, man. Just talking about their past. About to rob this dude's [ __ ] house. About to take everything in this man's house. Baffle this dude's stuff. He got wheels of cheese. What does he got up in here? Sword.",
            "start": 1910.16
        },
        {
            "text": "talking about their past. About to rob this dude's [ __ ] house. About to take everything in this man's house. Baffle this dude's stuff. He got wheels of cheese. What does he got up in here? Sword. Anything good? Help us out, Kai. What does he got in here? Wheel of cheese. Hook me up with that good good. They somehow wrap themselves up in an existence. I've never seen anything like this. Neither have I. Never seen a tree grow so quickly as to trap someone inside. Oh, yeah. That's outside my expertise, but I wouldn't be surprised. You seem capable enough, stranger, but the forests are not safe. As if this weren't enough proof of that. The forests. Stay out of the forests if you can help it. Good luck out there. All right, buddy. Good luck out there. Stay out of the forest. Stay out of the forest if you can help it. All right, so continue to continue. Find the carving. Straight up. Better swimmers. Okay, he's still working through them. Okay, so his his side quest is still going, but we",
            "start": 1988.96
        },
        {
            "text": "if you can help it. All right, so continue to continue. Find the carving. Straight up. Better swimmers. Okay, he's still working through them. Okay, so his his side quest is still going, but we have to keep rocking with this. The animacy method is the main story that I'm on, but it's everything's three skulls. Yeah, you got you got a level. You got a lot of side quest though. I know. We're just going to do this. You got a lot of side quest side quests more. We'll start from the bottom and work up there. I love that escape plan. Yeah, cuz uh otherwise it's not good. What do you want, dude? You want to talk to me? Been to Fior a few times. You want to talk to me? I thought there was I thought he wanted to save us up. Look at this map, dude. I got so much more to explore over here. Uh, Nick, you have a lot to explore in this game. So beautiful. Where is the Oh, I got to go over there. No, I'm not going there. That's That's No. So, I think Yeah. Go back to your journal cuz I think you",
            "start": 2047.44
        },
        {
            "text": "you have a lot to explore in this game. So beautiful. Where is the Oh, I got to go over there. No, I'm not going there. That's That's No. So, I think Yeah. Go back to your journal cuz I think you clicked on one. I don't know if you read like what it is. Oh, I got to track it. Yeah. There you go. There you go. Place I don't care what it is, dude. I'm just knocking out side. I don't care what it is, man. Let's see what this is now. That's an ancient memory. It's way southeast. Oh, yeah. Okay, there we go. In a different part of the world. We'll fast travel over there. I'll spare everyone my lack of abilities in this game. We'll just fast travel. I'm shocked that you didn't say anything during that podcast, Mike. I truly am honestly shocked. I should have jumped in there and had some fun. You guys were having such a good time laughing. I just feel like, you know, he I can't believe he was so mad at my birthday gift. I thought he really would have liked that birthday gift. It was",
            "start": 2088.88
        },
        {
            "text": "fun. You guys were having such a good time laughing. I just feel like, you know, he I can't believe he was so mad at my birthday gift. I thought he really would have liked that birthday gift. It was thoughtful. It was kind. It's going to go well in his streaming room because guess what? He he can set it and forget it. Yep. Every every two months, somebody will remind him, hey, water that water that little cactus you got there. He'll put a little water on it. Little cactus. Little cact little cactus. See if my more abilities here. No, no more points. Okay, we'll just keep going. Okay, keep it going. Exit here. Come on. Come on. Come on. Come on. AB. That's new. Oh, A and B. Acquire Orus. Kiss. Go into the sinkhole. What? The sinkhole. Yeah, I don't know where that is. We're going to find out. We're going to go find this kiss first, though. What are we going into here? We're traveling to this. Is this a new world or is this just going to be like a building? A building. Okay. Or a town.",
            "start": 2136.32
        },
        {
            "text": "We're going to go find this kiss first, though. What are we going into here? We're traveling to this. Is this a new world or is this just going to be like a building? A building. Okay. Or a town. Yeah, it looks like a No, I think it's a new party in a map, right? Is it? Is it now? Yeah, a new area. Oh, look at that, Mike. You called it. Or I guess technically an area you've already been. Yeah, you made some Oh, man. You made some progress in this game. I put a little time into it. Yeah. Yeah. I'm impressed. Thanks, dude. Oh, [Applause] this is more my style. What up, Kyler? aka Black Demon 47. How are you, homie? Nice to see you. Our Monday's going really well. We've had a great day full of content. We're back in the office smiling, having some fun on a sunny day. Dunked on him. I'm happy. Everyone okay? Where the heck am I now? Uh, you are back at the original starting area. So, this is the first plot of land here. You can tell by the big town. I don't know how I got so off the",
            "start": 2190.32
        },
        {
            "text": "happy. Everyone okay? Where the heck am I now? Uh, you are back at the original starting area. So, this is the first plot of land here. You can tell by the big town. I don't know how I got so off the beaten. Man, you you win a couple areas out there, right? I just kept walking, man. I let the story take me where this I always do that and then I get discouraged cuz I'm like, \"This game's hard.\" And everyone's like, \"Dude, you're in the final mission and you have a level one gun.\" We're not menu guys. That's why we don't read. We're not big menu guys. We don't freaking read, dude. Uh I'm a Buffalo Bills fan and Nick Scarpino is a Jacksonville Jaguars fan. Big NFL fans, of course. If anybody has a hookup for the new era jackets, Nick is in the market for a nice all black with the teal blue uh new era Jacksonville Jaguars jacket. Damn, this guilt's impervious. That was a mistake. I do miss having a starter jacket in my rotation. I need to put one in. Now, when you say starter jacket, what",
            "start": 2265.12
        },
        {
            "text": "new era Jacksonville Jaguars jacket. Damn, this guilt's impervious. That was a mistake. I do miss having a starter jacket in my rotation. I need to put one in. Now, when you say starter jacket, what kind of starter jacket? I want to pull over starter jackets. Button me. Oo, what's in here? See, this is what happens when I get sidetracked. That's what this game wants you to do is get sidetracked. That's what the vow's all about. You're sneaking into something, am I? Oh. I think there's something glowing next to you. What is it? Oh, golden plaque of oats. Oh, okay. Totems and totems. So, you're looking for more of like the just bomber jacket with the buttons up. Yeah, I want the button up straight up v not. Yeah, just bomber jacket but without the pocket. I want that. Okay, I like that. There's one there's a sick ass one that's uh like all black says giants on it. But then someone's going to talk to me about the Giants. Yeah. That's why we said you're a Jacksonville Jaguars fan. Yeah.",
            "start": 2322.0
        },
        {
            "text": "one there's a sick ass one that's uh like all black says giants on it. But then someone's going to talk to me about the Giants. Yeah. That's why we said you're a Jacksonville Jaguars fan. Yeah. Cuz nobody will talk to you about the Jacksonville Jaguars. No, nobody's going to care about that. And they're cool colors. Teal and black. Okay. Yeah, we're back at this. We're back at my main. Yeah, you're back. You're back at home. We're home base. This is where we should be. I got off on a sidetrack where I had to go find some meteorite and bring it around. And then I guess and then some lady was like, I'm doing experiments on the dead. And they're like, I'm reanimating. What are we doing? It was so fun, but I was like, I don't know what's happening. Welcome to the Pearl District. The southern paradise. I'm glad those sparrow hawks are gone. We're back, baby. Of course, I went the wrong way. No, I'm here. Hello. Oh, push level says Nick's movie poster will definitely have the line. He's on",
            "start": 2392.8
        },
        {
            "text": "paradise. I'm glad those sparrow hawks are gone. We're back, baby. Of course, I went the wrong way. No, I'm here. Hello. Oh, push level says Nick's movie poster will definitely have the line. He's on the final mission with a level one gun. That's pretty good. That was a pretty good one, though. Outgunned. Under man doesn't understand his team can do [ __ ] with him. Bring the supplies to the refugees. Sounds good. I just get so excited to progress, you know? Yeah, but then I get I get just dominated. I don't want that. That's also you just take on so many missions at once. Yeah, that's always my big that that's the catch of these games. That's always the problem I have with any RPG, right? Is you just get so I Hey, I needed to go and then I'm like, oh man, now I'm at work. I'm getting bogged down on all this. But like you give us any sort of a schedule one gas station simulator, we'll put in another extra eight hours of work. We'll punch in 100%. Darth Dubie, thank you for the raid.",
            "start": 2438.28
        },
        {
            "text": "down on all this. But like you give us any sort of a schedule one gas station simulator, we'll put in another extra eight hours of work. We'll punch in 100%. Darth Dubie, thank you for the raid. What up, Darth Dubbie and the crew? Welcome in. Sorry, lady. My bad. Word on the street is you confronted your killer. I'm Show me what you have for sale. Oh, okay. Well, show me what you got for sale. Maybe I'm buying from her. Maybe she's selling from me. How much money do I have? I have a lot. Let's buy some potions. 150. No, I don't need that. Oh. Oh yeah, that's good. Selling stuff for like 300. That's easy. I'm buying [ __ ] Yeah, we'll buy that. You got 5,000 bucks. I do. We're putting time in. This mission, though. Where is this mission? Where is this? Look how good this looks, Mike. It does look incredibly crisp. These people look destitute in real life. Thanks to Nvidia DLSS4 and our 50 series GPU. [Music] Oh, where's he going? He's trying to figure it out. This town's a lot. It's a",
            "start": 2493.2
        },
        {
            "text": "look incredibly crisp. These people look destitute in real life. Thanks to Nvidia DLSS4 and our 50 series GPU. [Music] Oh, where's he going? He's trying to figure it out. This town's a lot. It's a big town. It's a big town. Get over there. Let's go this way. Give me an indicator. You know what I mean? Give me an indicator. There's an indicator right in front of you. How do I get around this thing? I will say this. I will say this. The mini map up on your top left that should have the walls and the walkways of the town. It should not just be an empty circle and just kind of pointing. It should always have the detailed outlines. You get the cgrapher in there. I I'd make you a map, Nick. You know what I mean? I get a map. I think I got to get out of this town. I think the actual thing snow bike Mike the cgrapher will handle that. He's our map guy. Look at this. Man, we're lucky to be alive right now. I always think that we will be watching. Killing it in comedy. Yeah. I did a fun show",
            "start": 2556.4
        },
        {
            "text": "bike Mike the cgrapher will handle that. He's our map guy. Look at this. Man, we're lucky to be alive right now. I always think that we will be watching. Killing it in comedy. Yeah. I did a fun show last Thursday night. Nick Croll stopped by. Nick Croll stopped by to watch you do comedy. No, no, he stopped by to do comedy on the show that I was on. Still great though. Yeah. He did not watch me at all. He has no idea. It's not a knock against Nick Crow. He just kind of popped in, did a set, and left. And I was like, that was the coolest thing that's happened to me in a while. Seems like a really nice guy. Well, yeah, I'll take all that. You cooking? We're taking it. Cooking. Hey, buddy. That guy's like, \"I'm having such a bad day.\" And Nick just stole all of my food. Jack, Man, I'm so hungry. I can't wait for No. Oh, no. Oh, no. Where? Okay. Even here. Take a look. Yeah, you see it. You see it? Who builds a shanty town like this? Who was your city planner? Uh, Gore Dragon. I did not",
            "start": 2616.0
        },
        {
            "text": "I can't wait for No. Oh, no. Oh, no. Where? Okay. Even here. Take a look. Yeah, you see it. You see it? Who builds a shanty town like this? Who was your city planner? Uh, Gore Dragon. I did not get an opportunity to talk with him. He is uh he's doing some shows up here. I think he's hanging out with his family and uh I think he wanted to get some sets and so he popped onto a few shows that were around the neighborhood or up in San Francisco. one of which was in Santa Rosa and he came and closed it out for 30 minutes. So, it was cool getting to see him perform. I had already I had already gone up before that, but because it was Santa Rosa, I drove with the uh the uh show organizer and so I was sticking around and he just popped in. I was like, \"Well, this is cool. This is a nice little treat.\" Hello. Please. Who is that, Llet? Hello. I hear unfamiliar footsteps. Love visitors, dearest. No one we know. Sorry for that. My husband's recently lost his sight. He's easily confused. So am I.",
            "start": 2667.52
        },
        {
            "text": "Hello. Please. Who is that, Llet? Hello. I hear unfamiliar footsteps. Love visitors, dearest. No one we know. Sorry for that. My husband's recently lost his sight. He's easily confused. So am I. And I can see 2020. Oh, Rome. Yes, of course we know her. Oh, Re. Ah, good soul on that woman. We went through some hard times together. That we did, dearest. Did Rome tell you we have enemies back in Adia? It's true. Only a matter of time before their friends spot us in the city. We don't want any trouble, just to live our lives in peace. So, it's time to move on. Only, it's not so easy as just walking out the door. First off, we need herbs. And kiss, the apothecary said. I should be able to get these eyes back in shape. Only the apothecary didn't have any. Said it grows by the eastern gorge over by the eastern gorge. Did you ever watch that movie The Gorge with Mile? Miles Teller? No, with Miles Teller, my main man. The rooster. Thank youly. Rooster sitting all day up on top of his perch",
            "start": 2721.24
        },
        {
            "text": "by the eastern gorge. Did you ever watch that movie The Gorge with Mile? Miles Teller? No, with Miles Teller, my main man. The rooster. Thank youly. Rooster sitting all day up on top of his perch just waiting for the right time to see Andy Taylor on the other side of the gorge. The gorge. What was the one that you made me watch with Chris? The depths or whatever. The scary movie where they were cave spelunking. Oh, that was I didn't make you watch that. Terrifying. That was Descent. Descent is what that was called. Yep. That it is. Look at that. I got all the stuff they need. Thank you enough. There is one thing more though. Well, oh jeez. I got a lot. What is it? You got to help get a sight back. Smugglers who are taking us out of here. Yeah. They're beached north of the sea stacks away from where the Adrenans are looking. Yeah. So, and you need an escort. Escort. You got to help them. You No, it's not that. The problem is that these smugglers found out we're a dear. Oh, I have to",
            "start": 2786.6
        },
        {
            "text": "from where the Adrenans are looking. Yeah. So, and you need an escort. Escort. You got to help them. You No, it's not that. The problem is that these smugglers found out we're a dear. Oh, I have to kill the smugglers. They don't like us much. Kill the smugglers. You take their boats now. Nearly enough for the journey before. So, yeah. Yes. I'm afraid we can't pay what they're asking. And if they knew what I'll have a conversation, they probably charge us triple. Blood wine. Oh. Uh, I mean Oh, [ __ ] Oh, look at him. Yes, we're not proud of our past. There's no easy way to say this. Start talking. We killed two people. Whoa. It was a land dispute. Things got out of hand. Jesus. There was a fight. You ever thankful about Man, you think about land disputes and people putting down their fences and how people lose their minds over the fence. Holy [ __ ] I would want I saw one over the weekend where some lady was losing her mind cuz some her neighbor was putting in a fence and I was like I",
            "start": 2835.44
        },
        {
            "text": "and how people lose their minds over the fence. Holy [ __ ] I would want I saw one over the weekend where some lady was losing her mind cuz some her neighbor was putting in a fence and I was like I would want a fence I would want the highest fence possible. I don't want to see any of my neighbors. This is the thing. I live in San Francisco and I I don't like my neighbors as is cuz I live in I live in a you know I live in a big building and uh I think to myself, \"Oh, it' be so much better if I went out if I moved out into the suburbs.\" And then I hear stories of the suburbs people how they hate like you're just locked in. You have this house, you hate the person your left and right. This is a nightmare. Nightmare scenario. Now I'm stuck there with him. Yep. Uhhuh. Maybe. Who's putting up this fence? What side is getting the nice part of the fence? Don't know, man. Don't know. Right. Because I in reality, I want the outside of the fence looking inside my yard cuz that's what I call the",
            "start": 2897.6
        },
        {
            "text": "fence? What side is getting the nice part of the fence? Don't know, man. Don't know. Right. Because I in reality, I want the outside of the fence looking inside my yard cuz that's what I call the nice. Yeah, I want the nice part. I don't want the inside of the fence because it's not as pretty. So, I'm trying to work one over on you like, \"Yeah, put up the fence. Give me the Give me your outside of your fence. You want the outside of the fence? I'll paint it. I'll make it look good.\" Oh, you can paint the Yeah, paint it like Mr. Miyagi. Paint it like Mr. Miyagi. Oh, look at that. I got some tarnished solvent. Had to have it. Had to have it. It's the most important thing I got. All right. So, I got to talk to these. Oh, where do I get these all over? Look at this all over the place. I got to find them. Like little mini things. I tell about the time when we put up a fence up in Tahoe. Guy next door, Drew. Mhm. Drew would uh answer the door every single day. giant pitbull and uh only in",
            "start": 2936.56
        },
        {
            "text": "to find them. Like little mini things. I tell about the time when we put up a fence up in Tahoe. Guy next door, Drew. Mhm. Drew would uh answer the door every single day. giant pitbull and uh only in his boxers. Yeah. He didn't care. He didn't give a crap about the fence. Yeah. He said, \"Do whatever you want. Just don't disturb me and the dog.\" Yeah. Don't Don't mess with my dog. The dog. My dog. Little shits. Flying rats. What else are you going to take? What's up, lady? Oh, you okay? I can sell stuff to this lady. What's up, lady? Another customer. Come in. What do you want from me? Oh. Serve me up. What do we got? Server mod. I don't need any of this crap. Get out of here, lady. You're not making a sale today. Even though I don't know what's Can I sell some of this crap that I have, though? You got to find a vendor for that. Isn't she the vendor? Let me see if I can go back and just sell a bunch of crap that I don't need. You like to pick up crap for sure. I do. Am I the only one?",
            "start": 2976.88
        },
        {
            "text": "You got to find a vendor for that. Isn't she the vendor? Let me see if I can go back and just sell a bunch of crap that I don't need. You like to pick up crap for sure. I do. Am I the only one? You pick up crap. No. Everybody loves to pick up crap in these games. That's the whole point about it. You just got to keep picking them up. Oh, there you go. There's all your items. This is my inventory, but I don't know if I need half this crap. It's all just edible. Oh, spoiler. Sean of a new age, thank you for using that Prime Gaming sub with us for 75 months. When are we hot dropping Howard Hospital? Thank you, Sean of New Age, for the support and the love. I figured it out, Mike. Sorry. Oh yeah, you figured it out what you want. Yeah. Yeah. Let's go down to the food. We're going to sell this. Oh, spoils cucumbers. The food can spoil. It always does. It's not good. It's not good for you. Yeah. I don't think I need half this stuff. Eventually, I'll start making some uh some stews and stuff",
            "start": 3031.28
        },
        {
            "text": "Oh, spoils cucumbers. The food can spoil. It always does. It's not good. It's not good for you. Yeah. I don't think I need half this stuff. Eventually, I'll start making some uh some stews and stuff with it, you know. Excited about that. I don't know if I need half this crap. They have cooking in this durable. Oh, do they? I don't know. I was asking you. You brought up stews. I was wondering if you message my boy. Message your boy at station five. Arcane gloves. Let's put those on. Secondary hand. Nothing. Notification band. Okay, cool. Do you get like Do you do all the stuff in these games, Mike? Do you put all the all the stuff on that you need and you upgrade all your stuff? Nick, when a game clicks with me, like this kind of game, I get fully lost in it where I try to do everything and then I burn myself out after the second area. This happened in The Witcher 3: The Wild Hunt. I did every single question mark in the first zone, Nick. Took me like 25 hours. I never wanted to see",
            "start": 3077.12
        },
        {
            "text": "and then I burn myself out after the second area. This happened in The Witcher 3: The Wild Hunt. I did every single question mark in the first zone, Nick. Took me like 25 hours. I never wanted to see the game again. I'm just done. Yeah, you're just done. I said I had a great experience. I don't want to play anymore. Currently in Oblivion that I'm playing. I'm playing as Evil Mike. And uh I am I'm making my own rules in the video game. As well you should, my friend. I am making my own rules. Let's go back in here and talk to this. Yeah, I think that ends up being like where' that go? That ends up being the hardest thing for me in this. I wish there was like a casual mode where there were they just let you just kind of mainline it because I would have beat this game if it was like 20 hours long. But the fact that I know it's a solid 80 to 100 hour experience to kind of really get into it, I'm like, \"Ah, it's not for me.\" Well, the you know, I think what you got to do then is you got to",
            "start": 3148.64
        },
        {
            "text": "long. But the fact that I know it's a solid 80 to 100 hour experience to kind of really get into it, I'm like, \"Ah, it's not for me.\" Well, the you know, I think what you got to do then is you got to probably put it on the easier difficulty, you know what I mean? And just stick to the mainline story quest. And I think you can get it done pretty quick here on these. I heard this one was a little bit smaller experience than a lot of the other ones. The dreams gorge. I love these. I love these like these pictures. Okay. Yeah. Yeah. The art. Uh-huh. Illustrations. Illustrations. Optional. You got to go talk to the captain. Yeah. Where the heck is he? I thought you were going towards you. Is it in shoot? No. I was going toward A. Oh, you're going to go towards A. Okay. Yeah, you were going towards B right there, I think. Crap. Where the heck is it? Oh, it's in here. Oh, I was going to Right. You're right. You're right. Right. My bad. It's an optional part of it. Yeah, we're going to do it.",
            "start": 3197.28
        },
        {
            "text": "B right there, I think. Crap. Where the heck is it? Oh, it's in here. Oh, I was going to Right. You're right. You're right. Right. My bad. It's an optional part of it. Yeah, we're going to do it. Yeah. Okay. Yeah, we need it. Do you know what it will be? No, it's It says it. No, no. I mean like what what is it? You're going to go talk to the captain about what? Maybe selling them down the river. Tell them they're going to try to break out. You know what I mean? Like what is B? I don't know. A or B. That's what you're talking about. Well, like no B is optional. So you're going to go do A no matter what. Well, if I do B, I won't be able to do A. You think so? Yeah, because you're right. If I report the refugees to the captain, it'll it'll they're going to jail. They're going to jail. Well, they did kill two people. Who hasn't killed two people? You know what I mean? It was over a land dispute. To the mushroom people, I am like a mass murderer. My god. Yeah, a bunch of people. Yeah. So,",
            "start": 3249.6
        },
        {
            "text": "they did kill two people. Who hasn't killed two people? You know what I mean? It was over a land dispute. To the mushroom people, I am like a mass murderer. My god. Yeah, a bunch of people. Yeah. So, there is that. You got to go. I don't know, chat. What do you think? Should I sell these people out? Uh, I do believe, Mike, you can cook in this game to answer your question. Okay. There is some sort of I think it's like Legend of Zelda where you can like throw Oh, I love that. Cool little thing. Yeah. Nice. Okay. So, I don't want to do that. I apologize. Everyone, you're going to watch me run back through a Yeah. Want to hit this guy in the dick. You know what? I'm always fascinated by people's running techniques. I'll tell you, I can't get enough of watching just people run from trained runners to just average jabronies. I always find it fascinating like who taught you to run? Do you ever think about your body when you're running? What do you look like when you run? I cuz you see some",
            "start": 3295.6
        },
        {
            "text": "to just average jabronies. I always find it fascinating like who taught you to run? Do you ever think about your body when you're running? What do you look like when you run? I cuz you see some different running stances out there. I don't run cuz it's hard. Yeah. Well, yeah. I mean, yes. Uh and it takes a lot of stamina. I'm just But like what is your what does your stance look like? You know, I I wish I'd learned how to run. Sometimes I when I fantasize about what it would be like to just take my brain and put it in my body from when I was like seven or eight. Yeah. I would love to go back in there and just just feel what it's like to actually have running feel good for once, you know? Chase that running high. Yeah, dude. Don't you think? I love that running. Wouldn't you want to do that? Just be like, \"Hey, man.\" Cuz when I run right now, it feels like death. It feels like my body is dying. Yeah. I think that happens for like the first hundred times you do it and then like after",
            "start": 3337.84
        },
        {
            "text": "Just be like, \"Hey, man.\" Cuz when I run right now, it feels like death. It feels like my body is dying. Yeah. I think that happens for like the first hundred times you do it and then like after that, it will feel better though. Really? Yeah. But you're going to have to do it 100 times. Oh, [ __ ] Watch out. You guys are clearly This is exactly where I want to be. Nice job, everyone. Thanks everyone. Good job. Let's go have lunch. We did exactly what we needed to do. We killed these. Look at how good the skin looks on this lizard guy. Yeah. Damn, man. Real scaly scaly, but also the underbelly looking kind of soft, you know? Yeah. They got those soft bellies. They do. And you want to What a weird creature. Want to pet the lizard? Yeah, the lizards are just weird creatures, man. They're cool. All amphibians are a little weird, you know? You're a little weird. Okay, I got to get that one. Gross. Jesus. I'm just going to cheese it. Say what you like about my people. We build a phenomenal",
            "start": 3379.12
        },
        {
            "text": "All amphibians are a little weird, you know? You're a little weird. Okay, I got to get that one. Gross. Jesus. I'm just going to cheese it. Say what you like about my people. We build a phenomenal going from death from above. Here, friends. It's all right. No. All right. Look alive, ladies and gents. Oh, she's got fuzzy ears. That's how you ah a kind-hearted adearan. How nice for them to find a friend here. The way I understand it, they don't have many friends among your countrymen. Take it easy on him. Wow. He's all right for an adren. Fine if you say so. Well, what do you want? No deal. Pay the difference or forget it. Pay him up. You got money. The envoy saved my life at North Reach. Oh, I saved her. Oh, that's lady I saved. But a deal is a deal. We don't give handouts. It's two clients. Believe me, you don't want to get on his bad side. He's a kill. Tits. Are we a charity now? Whoa. Fine. Tell your miserable countrymen the deal is settled. Free of charge. Sick. We'll take them to",
            "start": 3428.64
        },
        {
            "text": "Believe me, you don't want to get on his bad side. He's a kill. Tits. Are we a charity now? Whoa. Fine. Tell your miserable countrymen the deal is settled. Free of charge. Sick. We'll take them to Thirdborn when they're ready. Thank you. Sure, whatever. And that's Captain Soldis. Thank you very much. Well, I'm Dr. Nick Scarpina, proctologist. Cool. There you go. You did it. Look at that. I did it. Now I want you to go all the way back. That's what I've never loved. Come on. I never loved that. You know, run all the way here. You're going to literally just talk to the lady for like three sentences. I want you to run back. What is Why Why do I got to do that? I never love. He never tells. I'd be like, \"Send a raven.\" Yeah. Send a raven. Let them know. Send a raven. They'll be fine. You know what? This like what I do with Andy when I want to stream with him. I sit in my room and I go like this. He got it. You know what I mean? He got it. Andy Andy Andy Andy Andy Andy. Hey you two over",
            "start": 3490.2
        },
        {
            "text": "what? This like what I do with Andy when I want to stream with him. I sit in my room and I go like this. He got it. You know what I mean? He got it. Andy Andy Andy Andy Andy Andy. Hey you two over there, you're good to get on the boat. You know what I mean? Yeah. One way or the other. Did we sort it out? Nick, are you excited for Predator Badly? Oh, wait. Uh, I'm very excited for our Badlands. Very excited. Very excited. It looks weird and fun. It looks weird, Nick. Really weird. Very weird, but fun. I hope it's good. Me, too. Cuz Prey was good. Prey was good. I liked Prey. It's the same person. Um, but I Well, yeah, but now we're being the Predator. Yeah. I mean, you can't always just have people running away from the heck, I guess. Remember, there's a ladder behind you. Right here. No, no, 180. Oh, 180 there. Um, yeah. I don't know. It's This This is fun, though. It kind of opens up the world a little bit. I do wonder if the Predator is going to be able to communicate as the main",
            "start": 3538.08
        },
        {
            "text": "no, 180. Oh, 180 there. Um, yeah. I don't know. It's This This is fun, though. It kind of opens up the world a little bit. I do wonder if the Predator is going to be able to communicate as the main character. It's always That's always a wild card. Obviously, they have uh they have El Fanning in there to kind of be the the human voice in all this, even though interesting. So, we'll be back. Okay. Great. You've come Let them know they're free. They're safe. Oh, wonder. Did you hear that, Derek? I did love. Thank you so much. I don't think we'll be needing these anymore. Nice, dude. I got some Paradesian ladder and some pelt. We need to get ready for the journey. Yeah, get ready for your journey. And if you ever find your way to Thirdborn, please come find us. It would be lovely to see you again. Get your eyes working, buddy. Here to see a real second chance. Yeah, remember you gave him the uh cure to help him. Sick, dude. Look at this. You saved them. Saved their lives. Envoy. We're so",
            "start": 3587.12
        },
        {
            "text": "Get your eyes working, buddy. Here to see a real second chance. Yeah, remember you gave him the uh cure to help him. Sick, dude. Look at this. You saved them. Saved their lives. Envoy. We're so cool, dude. Envoy. Yeah, I love how they got away from giving you a name. The envoy, dude. Get some coin. Bust through this [ __ ] Let some light in. Just the envoy. You see need some light in this house. They're like, \"Hey, man. That's really going to wake me up in the morning.\" Yeah. Get up. It's going to rain tomorrow. Put in an honest day's work in your your schlub. Get up into an honest day. Get up, bro. Sleeping in too damn late like Andy Cortez. All right. What should I do next? Like, let's go to the old on the next on to the next mission. You, like you said, you start at the bottom, now you're here. Oh, you got to scroll down. Let's see. Let's do this precious light mission. Find some Oh, no, no, no, no. What? This one? Not the one with the skull. It's not precious light. Okay, maybe",
            "start": 3633.76
        },
        {
            "text": "here. Oh, you got to scroll down. Let's see. Let's do this precious light mission. Find some Oh, no, no, no, no. What? This one? Not the one with the skull. It's not precious light. Okay, maybe Dawn trader. Treader. Dawn treader. Cool. Yeah, I like that. See where it's at. How far is it? Let's fast travel. Let's go to the travel office. Lot of unaccount Well, you know what? Those unaccounted 4 hours are being accounted for on today's podcast. Go check out the latest kind of funny podcast where they talk a little bit about Andy's unaccounted 4 hours and how they're being accounted for in a really positive way. Pretty crazy. He walks to go get a hamburger. Where's What hamburger shop you think? Uh, he Well, the one I saw him at was super duper. I knew it. I had a feeling. Super duper. Not Not bad. Not Not the worst. Not the worst. But definitely one where you eat it a bunch, you go, I don't need to eat this. Very greasy. Very greasy hamburger. I am worried about Andy's heart health. You",
            "start": 3682.32
        },
        {
            "text": "bad. Not Not the worst. Not the worst. But definitely one where you eat it a bunch, you go, I don't need to eat this. Very greasy. Very greasy hamburger. I am worried about Andy's heart health. You know what I like? What's that? Beeps. You're a beef burger man. Beeps Burgers is probably the best burgers in town. What the heck? I'm confident in saying that. Oh man, I'm totally wrong. Yeah, you went to the wrong town. You went to another town. You weren't supposed to go there. But stop doing that. Look, you know what I mean? It's like I get it. I get it. You Yeah. Yeah. There's a lot of blue markers on your map, but all of a sudden that wasn't the one. Mhm. Scyan, thank you for using that Prime Gaming sub on us for 26 months. Shout out to Sciphan 007 for the support. Am I crazy? Have you guys uh So, yeah, you looked at that one. You got to go up. Oh, I went the wrong way. Yeah, you went to the wrong one. I don't know why you have so many blue things highlighted, but like that's No,",
            "start": 3734.64
        },
        {
            "text": "guys uh So, yeah, you looked at that one. You got to go up. Oh, I went the wrong way. Yeah, you went to the wrong one. I don't know why you have so many blue things highlighted, but like that's No, either. Also, it's crazy that like to the north here, you have absolutely nothing. I mean, there's a quest right here. I can just doodle them right here. What is that one? The finer things in battle. Look at Look it up. See the fire? We'll just track that real quick. It's like 5 ft away from me. Yeah. I'm going to run this. Oh, this is the one where you got to go get a better body armor and stuff. I remember this one. Is it okay? Yeah, you got to just buy stuff before. Catherine Mark messes with Super Duper. I like that. Pont wants to know, \"Have you guys ever had a burger from the melt?\" No, I've only had grilled cheese. Nick took me to the melt once. Yeah, we only get burgers at the melt. I don't think Yeah. No, we get grilled cheese, right? I talk to Gwenneth. You guys have a Five Guys",
            "start": 3778.96
        },
        {
            "text": "I've only had grilled cheese. Nick took me to the melt once. Yeah, we only get burgers at the melt. I don't think Yeah. No, we get grilled cheese, right? I talk to Gwenneth. You guys have a Five Guys there. I I'm I'm a big no no on Five Guys. Uh, hello. Damn. I heard what happened. I see why you'd want to protect yourself. I'd like weapons and armor. I would like I'd like to buy something. Oh [ __ ] this guy like crazy. Yeah. So, she's got that good stuff. She got that good good armor. Very expensive though. Yeah, it's not cheap. You're going to have to be mindful cuz if you look at that if you look at that uh What's the quest list? You have a lot to buy. I got to buy all that. No, no, no, no. Got to go back to your mission. Hold on. Let's see what this tag. What What is this? Okay, finer things. Acquire better torso armor. Higher quality torso armor will reduce the damage you take from tough armor. Acquire fine torso armor. Okay. Equip a fine weapon. That's all I got to get. I got to",
            "start": 3827.2
        },
        {
            "text": "things. Acquire better torso armor. Higher quality torso armor will reduce the damage you take from tough armor. Acquire fine torso armor. Okay. Equip a fine weapon. That's all I got to get. I got to get a fine weapon. Okay. You already have one, it seems like. So, you just got to equip it. So, I got to equip it. Okay. How do I do? I don't have a fine weapon. Oh, I do. Hold on. Let's see if I can do this. I don't like the the price cost a bit. Luis, I don't like the price compared to uh others. That's why. Did I kill my fine weapon? I don't have a fine weapon, do I? Do you see it? I may have. I may have. You may have sold it. Yeah. No, I think I destroyed it. I think it was that uh Oh, did you just destroy something just a second ago? Yeah, probably. No, just a while back. Okay, I'll just buy one from her. Let's see if I can buy one real quick. Let's get some fine armor. Yeah. Get some fine armor and a fine weapon. Okay, let's get the cheapest fine armor we could possibly buy. That's",
            "start": 3875.28
        },
        {
            "text": "buy one from her. Let's see if I can buy one real quick. Let's get some fine armor. Yeah. Get some fine armor and a fine weapon. Okay, let's get the cheapest fine armor we could possibly buy. That's my inventory. What's your inventory here? Weapons. Okay, fine. Yeah. Yeah. Yeah. See, I did. I think I had to find one of this thing. Okay, so remember you only have $4,400. Well, I want to find great sword, so that's going to be good for We're just going to go for it. Yeah, I think so. I mean, there's nothing else I can do, right? I guess Well, what about a chest piece? It also wants you to get a chest piece. Yeah, I'm going to have to just go sell some cramp, but I can sell some Well, I guess so. 2,700 plus how much is the fine great sword for the fine leather Karan? Well, yeah, I was just going to say we just do the mission, right? And then you can put on whatever else you're wearing. So, you need like 5700 to 66. Yeah. Oh, man. I want this great sword, though. You're kind of short.",
            "start": 3923.68
        },
        {
            "text": "going to say we just do the mission, right? And then you can put on whatever else you're wearing. So, you need like 5700 to 66. Yeah. Oh, man. I want this great sword, though. You're kind of short. Yeah. Yeah, I like that. I'm just going to take it, dude. Take it. We'll come back. Take it. Be better. I'll equip it. Look at that. He's got a sword, chat. Got a new sword. Oh, upgraded from that common sword. That's a big deal. Sword. And I think you even upgraded it because it's giving you the hammer thing, too. Oh, big sword. Oh, I don't have a wand anymore, though. That's fine. But now I'm like not the magic guy anymore. I should have got the wand. Let me see if I get a wand. I've got a wand guy now. I love having the wand though, dude. So sick. Oh, she doesn't even sell the wand. Yeah, she's not a magic lady. She only works on iron. She doesn't work on wood. Well, we got this thing. There's two different people that do that. Carpenter and a blacksmith. Okay, you got to see two",
            "start": 3962.96
        },
        {
            "text": "she's not a magic lady. She only works on iron. She doesn't work on wood. Well, we got this thing. There's two different people that do that. Carpenter and a blacksmith. Okay, you got to see two different people. Everybody knows the rules. See if I can sell my I got to steal this. And E can mean excellent. Oh, gems. Look at all these gems I got. Can I sell these? Do I need these? I I have no idea. That is okay. I mean, I got me some cash money. Millionaires. Cash money. Millionaires. There's some [ __ ] I don't need here, too. Can I sell this? We're just going to do it. Sell it. Dang, this sword is big, though. That's a big sword. Yeah, you went with the big two-handed sword. I think you were thinking more of like a short sword, like one hand. Well, yeah. That's all right. That's all right. We're going to have some fun. Well, you can have two loadouts. Remember, you can switch back and forth. That's the whole point of this game. Break down the unused gear. Sorry, guys. Yeah, you're",
            "start": 4009.68
        },
        {
            "text": "We're going to have some fun. Well, you can have two loadouts. Remember, you can switch back and forth. That's the whole point of this game. Break down the unused gear. Sorry, guys. Yeah, you're right. Well, I'm mess with someone to find out. See, now I can like Wow, I can stop eating. Big blocks. Yeah, big blocks. I'm a god. I'm like I'm like a I'm a god. Okay, I got to acquire some better. All right. Well, I can't do that. So, we're going to put this on hold until we Let's just do a different side mission here. Thanks for rolling with me today, Mike. Uh Nick, I love rolling with you and I love rolling with our partners over at Nvidia for today's sponsored stream. One more call out for all of you. Uh as we are on the back half of our stream, don't forget about updating your drivers and getting the very best out of your Nvidia GPU. Just like us here at the Kind of Funny Studio, we are rocking with that 50 series right now. We are showcasing Nvidia DLSS4 and all the technology that",
            "start": 4073.44
        },
        {
            "text": "getting the very best out of your Nvidia GPU. Just like us here at the Kind of Funny Studio, we are rocking with that 50 series right now. We are showcasing Nvidia DLSS4 and all the technology that allows you to get the very best out of your game without sacrificing frames. Of course, you can check all that out right now at the link in the video description and in our Nightbot commands that are popping up. Celebrate 25 years of PC gaming and over 700 games with Nvidia. Okay, we're on the move. We're doing sidecore. We're just cleaning it up, man. Yes. Work today, you know. We're just cleaning it up. Oh, shoot. Warehouse key. Oh, do you have a key? It looks like you had a key. I do. Or do you have lockpicks? I have lockpicks, but I don't want to get I don't want to like piss these guys off. You want a lockpick in front of these guys? That might be their place. Yeah, that might survive. Let's see if I can sell. What do you got for me, buddy? You got some This guy is ripped my before.",
            "start": 4119.68
        },
        {
            "text": "You want a lockpick in front of these guys? That might be their place. Yeah, that might survive. Let's see if I can sell. What do you got for me, buddy? You got some This guy is ripped my before. What do you got for sale? What do you got? What do you got? That's all. What do you got? You got nothing. Okay. Uh-huh. Might be able to parkour into that warehouse. People are saying and you're nasty with the hardcore parkour. Watch this. Ready? Yeah. Hey, you. What are you doing out there? No, I can't do it this way. You sure? Oh, I think you were really cooking right now. You think I was? I like to take lunch up in that lighthouse from time to time. Nice. Go around it. Yeah, maybe go around. See if I can do this real quick. Ready? Undo. Oh, I love this. Oh, what? This is going to be so cool. Oh, what a double jump. They don't want you that way. I definitely have a double jump. Don't I have a double jump? You have a double jump? You think marathon? Maybe a marathon. You had a double jump. I",
            "start": 4171.92
        },
        {
            "text": "what a double jump. They don't want you that way. I definitely have a double jump. Don't I have a double jump? You have a double jump? You think marathon? Maybe a marathon. You had a double jump. I just swim around it maybe just run on water like Jesus. Oh man, are you jazzed up? Are we excited chat? Because like summer's right around the corner and Nick, I can't wait to swim, man. I can't wait to jump in. I have fire. Oh, I make fire. Really? Really? Yeah. No, I don't want to do that. Nothing. Nothing. Oh, my is my guy have fire. Oh, he has fire, right? There's a way to do this. I forgot how to do it. Yeah, dude. Thank Well, they're saying that Kai has fire. Yeah, I'm trying to figure I forgot how Kai does it. I think you just did it. Did I? Yeah. Yeah. There it is. Thanks, my man. Back. You had it the whole wheel. The whole time. Look at that. I got some pelts. Excuse me. Let it out. Better in the than now. We're about to parkour all over this thing. Oh, hardcore parkour. Watch out.",
            "start": 4227.32
        },
        {
            "text": "You had it the whole wheel. The whole time. Look at that. I got some pelts. Excuse me. Let it out. Better in the than now. We're about to parkour all over this thing. Oh, hardcore parkour. Watch out. Roof to roof. Absolutely. Nice, Nick. Oh, that worked out well. Yeah, I'm perfect. Drop back here. always coming from the ceiling. Bath house shipment. Nice dirty underwear. Just going to walk out the front door like, \"Hey guys, I was invited in.\" Yeah, you just say, \"Oh, what's up, guys?\" I don't want to do that. Pardon me. Get on out of there. Deliver Jillian's. I wonder if I can just get out of here from here. Yeah, you just map it out. Look how pretty that is. Look at that. Let it rock. Should we go hunt down this taurus? Yeah, let's do that. Oh, snap. You can just travel right over to it. Well, you got you you unlock fast travel gates. Okay. It's just like every other RPG where you got to like get in there, get out. Yeah. I'm go try to hunt this thing down, though. Get in there, get",
            "start": 4294.48
        },
        {
            "text": "Well, you got you you unlock fast travel gates. Okay. It's just like every other RPG where you got to like get in there, get out. Yeah. I'm go try to hunt this thing down, though. Get in there, get out. bad. Is this a terrible idea? Tell me. I need to know. Oh, okay. Yeah, it's on this island. That's weird. Well, yeah. It runs that island. This is right. Oh, it runs the island. It runs that island. Every now and then, it's going to come back into town, steal some goodies, and then get out of there. Oh, I love that. Let's go. Got the hiccups, buddy. Yeah. Something was coming out of me right there. That's right. I had a little Chipotle bowl for lunch today. Some fruit. Nick is going to go out here and fight a giant tourist demon. A menotaur's boarding ships. Folks, this guy. Sorry, friend. Oh, you're gone. Oh, wow. You need better. Definitely takes a little getting used to. Yeah. Yeah. Got to heal. Got to heal. There you go. Take it down. Take it down. Oh. Oh, look. There it is. Whoa.",
            "start": 4374.08
        },
        {
            "text": "Oh, you're gone. Oh, wow. You need better. Definitely takes a little getting used to. Yeah. Yeah. Got to heal. Got to heal. There you go. Take it down. Take it down. Oh. Oh, look. There it is. Whoa. I thought I dodged it. Oh, eat it. Eat it. Eat it. Eat it all you want. Oh, wow. You're going to take its glass eye. That's pretty. Oh, you got a special gun. Sick. I got her gun. That's cool. That's a lightning. I thought I was going to fight a taurus of some sort. It was just a lady with blue. Take all your little change here. Give me my armor. My minions. Ruia in the chat says one of the best pistols in the game. Oh, sick. I might I might switch over to that. I'll tell you that right now. I'll tell you that right now. Feeling pretty good about this chat. Feeling pretty good about it. I'm going to unlock this lock box some armor. Is that how the lockpicking goes in this game? You just hold it up. Very easy. Yeah. Oh, I love that. I love that. Very fun and very easy. Oblivion makes me",
            "start": 4428.24
        },
        {
            "text": "going to unlock this lock box some armor. Is that how the lockpicking goes in this game? You just hold it up. Very easy. Yeah. Oh, I love that. I love that. Very fun and very easy. Oblivion makes me want to pull my hair out. Yeah, sure. It's killing me right now. Yeah. All right. Hey, that was pretty fun, guys. Let's see how how much money did that just give me. We got two grand. That's a nice little come up. You only got 800 bucks. Badass. I think you came up with $1,000 on that. Yeah. Don't love this sword that I wasted $3,600. Well, you got excited. You know, you know, don't love it. Bought that. Have a buyer's remorse right now about that. I can sell it. You think I could sell it back? You might be able to sell it back. I'm not going to promise you big money for it, though. Okay. Oh, shoot. Shoot. I'll give you It's like uh Pawn Stars in GameStop. Once you leave the door, I'm giving you I'm giving you one/4 of what you value went down all the way down. Once you leave the door,",
            "start": 4505.28
        },
        {
            "text": "shoot. Shoot. I'll give you It's like uh Pawn Stars in GameStop. Once you leave the door, I'm giving you I'm giving you one/4 of what you value went down all the way down. Once you leave the door, it's like buying a Madden. Every single year you come back. Oh, that's like $2. A man like the the outside air touched it, you know? It's just like, oh, it's rough. Gotcha, fool. Like this little sh Look how beautiful this is. Little shanty town. Little sh He loves the shanty town. Love the shanty town. And why have you decided to come to the shanty town? Yeah, there was like a Oh, just show that uh there was like a quest here that I could trigger. Okay, it doesn't matter. That was good. Okay, we're going to go back to our Where are we at? Can you learn shanties in Shanty Town? T have a good shanty neck. Yeah, you know good like a C shanty. Yeah. Yeah. Not that I know of. A shanty. Okay. [ __ ] you. [Music] Do you think they were actually singing out there? Do you? Yeah, I think so. What",
            "start": 4545.6
        },
        {
            "text": "shanty neck. Yeah, you know good like a C shanty. Yeah. Yeah. Not that I know of. A shanty. Okay. [ __ ] you. [Music] Do you think they were actually singing out there? Do you? Yeah, I think so. What else they going to do? I don't know. They just seem like so bored, dying, you know what I mean? Not having enough fruit. Just getting getting scurvy. Getting scared. Seems like a hell of a life. Just getting all scurvy. People be trying to sing. I'd be like, \"Shut the [ __ ] up. We're going to die.\" All I see is ocean. I'm terrified. My life is hell. Oh man, of course I went the wrong way. So Fortune for Life says, \"Mike, did you beat this game?\" No, I did not. Bear, did you play this game at all? No. Yeah. No. Too many RPG. Too much going on. Too many games. So many. What's our next game, Bear? What's the next one you're looking forward to now that Expedition 33 is done? Um, I'm going to spend a little time not playing new games. I want to try to get through Ghost of Sushima. Yes, that's",
            "start": 4599.2
        },
        {
            "text": "What's the next one you're looking forward to now that Expedition 33 is done? Um, I'm going to spend a little time not playing new games. I want to try to get through Ghost of Sushima. Yes, that's cool. I'm jealous of that cuz yeah, when that came out, I was working on Assassin's Creed in review. So, by the time that came out in 2020, I was like, I've played this game eight times in the last four months. Uh so, I'm giving it the fair college try this time around. Nice. Before uh Yot. Good. I hoped you'd find a way to handle it quietly. My minions. My minions. You're going to stop talking right now. Damn. This is the first time I've seen Nick's uh Yeah. Yeah. You like that? Yeah. Like my guy, dude. I turned those off. Education. You turned those off. I didn't like those. You turned the eyebrows off. I did not like those. Yeah. Yeah. Don't you realize walts have ears? Lady, just relax. If you knew how much was at stake here, you wouldn't have brought it up. I'm the only one left for the",
            "start": 4654.96
        },
        {
            "text": "off. I did not like those. Yeah. Yeah. Don't you realize walts have ears? Lady, just relax. If you knew how much was at stake here, you wouldn't have brought it up. I'm the only one left for the people of Paradise to turn to. Okay. The people of Paradise. Chill. An Imperial envoy. Protect me. Don't make me laugh. If he didn't mean it, he wouldn't have offered. All right. What do you stand to gain? Guess I'm not as good a liar as I used to be. I saw the Gro drag my mother off when I was 17. They had a point to prove and a lot of good mid types to blame. I owe you an apology, don't I? Still, you earned the truth. Almost no one gets that out of me. I admit, I've gotten used to men making promises they don't keep. When you told me to trust you, well, water under the bridge. Thank you, envoy. You've done me a favor I won't forget. Come back anytime. I'll leave the light on for you. Nice. Oh, he made a new friend. Made some friends. Leveled up. Level 10, too. Annie leveled up. So sick. You",
            "start": 4703.84
        },
        {
            "text": "You've done me a favor I won't forget. Come back anytime. I'll leave the light on for you. Nice. Oh, he made a new friend. Made some friends. Leveled up. Level 10, too. Annie leveled up. So sick. You know, while we were just doing that, I thought of something. My mind went to some. Remember when I got that chia pet for the office? Chia. Oh, you mean ice spice? The ice spice. ice by a geopet that we immediately killed that day. It looked like it had alopecia in the back cuz you just like there's one spot where hair just would not grow. It was [ __ ] horrifying. Yeah, that was a great time. Oh man, that was ridiculous. It's my first ever time having a chia pet, so you got to give me some credit. It grew a little bit. Yeah. Didn't grow much though. No, definitely did not grow much. And what did grow needed to be burned. Yeah. Whatever it was, not good. It looked like it could have been in the Last of Us movie. It was pretty terrifying. A pleasure envoying. I'm Oh, okay. Those bounties",
            "start": 4774.72
        },
        {
            "text": "did grow needed to be burned. Yeah. Whatever it was, not good. It looked like it could have been in the Last of Us movie. It was pretty terrifying. A pleasure envoying. I'm Oh, okay. Those bounties were all the posters. Get my money. Hey, get my money. Give my money. Show it here. Guess you were just the one storm she couldn't survive. What? That's why they call me the storm. The stories the storm. Dude, I'm getting that money. How much do I have now? Can I buy some armor? Claim your rewards and let's buy a piece of armor because Nick, we have hit the end of our fun sponsored stream with Nvidia on this lovely Monday. So, only have a couple of minutes left. So, please go out there, spend your money, complete your mission, and we'll wrap up today's Monday of content. Of course, this has been an awesome sponsored stream with Nvidia showcasing DLSS4 and some of your favorite games. Over 700 games taking advantage of Nvidia tech. You can go check out the blog post. You can take advantage",
            "start": 4823.92
        },
        {
            "text": "an awesome sponsored stream with Nvidia showcasing DLSS4 and some of your favorite games. Over 700 games taking advantage of Nvidia tech. You can go check out the blog post. You can take advantage of it. Update your drivers and have some fun. Remember, frames win games. And you don't have to sacrifice quality. You don't have to sacrifice the very best in your gaming just for those frames. You can get all of it with Nvidia. Got some armor. See if I can find some armor now. So, let's look at that. Oh wow, that's a good color on you. Look beautiful. That's a good color on you. Look at that XP. That Mike. Perfect. And with that, that's where we'll say goodbye. Thank you all so much for tuning in. Thank you for your support. We are not done because tomorrow we'll be back. But we're done for today. You had a full slate of content. Kind of funny games daily, an awesome Games cast, you had a screencast, you had a Kind of funny podcast, you had an afternoon stream. That is a lot of content for",
            "start": 4880.64
        },
        {
            "text": "You had a full slate of content. Kind of funny games daily, an awesome Games cast, you had a screencast, you had a Kind of funny podcast, you had an afternoon stream. That is a lot of content for you to go out and enjoy if you stuck with us through all of it. Thank you for your support. And guess what? We will be back tomorrow with more streaming fun, more live talk shows. We'll see you then. Goodbye. Bye. [Music]",
            "start": 4931.84
        }
    ]
}