{
    "id": 13838,
    "video_id": "0jJgdxcd2Ng",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Joey Noelle",
        "Mike Howard"
    ],
    "title": "Kinda Funny Returns to MONSTER HUNTER WILDS!",
    "description": "Wishlist Lost Skies today: https://kindafunny.com/lostskies \n\nWishlist Monaco 2 today: http://kindafunny.com/monaco2 \n\nGo to http://rocketmoney.com/kindafunny to cancel your unwanted subscriptions with Rocket Money.\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1743544860,
    "duration": 8355,
    "transcript_chunks": [
        {
            "text": "Three, two. Yo, what the heck is going on, monster hunters? It's your buddy Snow Bike Mike back at it again with another kind of funny games afternoon stream. And I've assembled the squad trying to give Nick Scarpino a day off before we play more Pokemon. And so I said to myself, Greg, you want to play more Monster Hunter? I said, let's get out there, Mike. Let's get out there and into the wilds and order pizza. Do we order pizza? Uh, pizza is on its way. Yeah, Greg immediately looked at Joey and said, \"We're playing Monster Hunter. Get in the car. Let's go.\" And we're back. And it turns out Joey hasn't played a lot. No, because my friends suck and they won't play with me. And this is a Lauren, you're terrible. Come on, Lauren. There's no way Lauren's watching right now. Where's the squad at? That's all right. Well, we're back together. Wait for my phone to We're going to team up and we're going to have some fun. Uh Barrett is setting everything up and then he's off and running. So,",
            "start": 2.88
        },
        {
            "text": "at? That's all right. Well, we're back together. Wait for my phone to We're going to team up and we're going to have some fun. Uh Barrett is setting everything up and then he's off and running. So, I'll be pressing some buttons. But we're The whole gang is here. We're going to get pizza today. you. Uh, so I'll make sure to I'm going to order an extra large. Hell yeah. You are, Mike. Thanks. Everybody gets a slice. Uh, and so we'll have some fun. But, uh, Greg, welcome back to Monster Hunter. I know you are a hardworking daddy. Okay. You're a busy man and I know you just want to dedicate your life to Monster Hunter and hunting these. It's hard. It's been heartbreaking to see the world, my friends. I see I get the I get the screenshots. I'm 100 rake 75 100 rake 100. I'm like, a man, I'm still here lowly 50s doing my thing cuz I got to go review all the games. And some of the games I'm reviewing are great. You know what I mean? Like I'm not I don't I'm never one to hate my job. But when",
            "start": 45.44
        },
        {
            "text": "here lowly 50s doing my thing cuz I got to go review all the games. And some of the games I'm reviewing are great. You know what I mean? Like I'm not I don't I'm never one to hate my job. But when it is that thing, there's been every time I turn on anything, I'm like, man, you can say you hate it. Kind of sounds like you hate your job. I I just hate this job. He just wants to play. Why can't I have a 9 to5 and come home, no kids, no wife, be sad and lonely, but playing a lot of Monster. See, that's called the golden triangle. That's the golden triangle right there. That's not the gold. That's the golden triangle. That's not the no wife, no kids. [Laughter] So yeah, I'm still I'm uh you know, I've I've finished up my my review grind for right now. There is a game coming at the end of the week that will then take residence, Mike. But for now, before uh spring break, I feel like I can just dedicate these next few nights to Monster Hunter. And spring break, you have something exciting",
            "start": 82.08
        },
        {
            "text": "week that will then take residence, Mike. But for now, before uh spring break, I feel like I can just dedicate these next few nights to Monster Hunter. And spring break, you have something exciting coming up. Going to Chicago. Everybody knows. Come on. Chicago. A week from Thursday, I will be live in Lyall, Illinois doing a oneman show. Well, not even one man, I guess. I got Millie Ramsey coming. I got Lucky Voice Confusion coming. Uh you'll see it all popping off there uh on the Lyle stage. If you're in the area, and I mean any of the surrounding states, you know, I do not come to Chicago and do work. So this is your shot to come see me live at Benedicting University in their auditorium. Kind of funny.com/ Chicago/ Chicago. That's not the right. That's exciting. Yeah, I've really enjoyed Chicago, man. I'll tell you what, Greg's lucky I'm not coming cuz I love Chicago. I'm a Chicago guy now. Damn, I didn't know that about you. I knew you fell in love with the city. I you know I I left",
            "start": 119.28
        },
        {
            "text": "Chicago, man. I'll tell you what, Greg's lucky I'm not coming cuz I love Chicago. I'm a Chicago guy now. Damn, I didn't know that about you. I knew you fell in love with the city. I you know I I left my heart in Chicago. I'm willing to go back for it one more time. Uh Greg, do you mean if I hit me up? Well, I just killed this thing. We're having the problem where it's like I was like, \"Joey, this is a lowlevel request.\" She's like, \"This is still too high for me.\" I was like, \"Okay, well, we will figure this out.\" Well, they want me to catch a golden fish and I don't want to catch it. I got to catch a golden fish, too. That is one I'm here to hunt monsters, not [ __ ] fish. You know what I mean? You are about Chad, let's check in with you, Chad. How are we doing today? Welcome in for your Tuesday afternoon stream. How's everybody feeling uh about shucks? Like 16 18 hours before the big Switch 2 presentation. Uh you got a lot of great games out there. Have you been monster hunting?",
            "start": 161.52
        },
        {
            "text": "Tuesday afternoon stream. How's everybody feeling uh about shucks? Like 16 18 hours before the big Switch 2 presentation. Uh you got a lot of great games out there. Have you been monster hunting? What's the vibe lately? Mike, I'm going to wrap this quest up here and then I'll shoot you better. Is Greg Hunter rank 100 is what the chat was. No, I just [ __ ] told you how busy my goddamn life is and how much it breaks my heart not to be able to play. You're so busy trying. How can you do that to me? So busy trying to fight this furry spider. What a nightmare. I love that spider. We should rank the monsters. We should rank these and monster hunter worlds monsters better. Washi says that he likes worlds more, but he does. Then he'll go down the list of these and like he loves 12 out of the 15. It's like, okay, well, I think you might like these. You know what I mean? I don't say this, you know, flippantly at all, but you should never talk to him again. Washy idiot. Idiot. Hate when you",
            "start": 195.36
        },
        {
            "text": "15. It's like, okay, well, I think you might like these. You know what I mean? I don't say this, you know, flippantly at all, but you should never talk to him again. Washy idiot. Idiot. Hate when you move out of my thick and big. They're thick and big. Yeah, he's got these big pillows. And I get it. Like that's comfy and nice. Mike, it's not mine. Just not you. Oh, I'm gonna die. I'm uh accepting that from Greggy. Thank you. Also, Chad, I I know that Greg's camera is was at first really unsynced, but let me know if I fixed it. Thank you, cuz I didn't hear it. You know what I mean? I just pretend like I don't hear it. All right. How we doing? Where we at? There we go. I'm going to go help uh Joey. All right. Shoot off the flare. I'll be there. Well, you can go to Alma and then go to link party link quest. Alma, it's been so long. I know that. I know. You pretty much just have to walk me through it. Um, post/join. Everyone Barrett says it's worse. Link party quests. Okay. Link member",
            "start": 251.28
        },
        {
            "text": "party link quest. Alma, it's been so long. I know that. I know. You pretty much just have to walk me through it. Um, post/join. Everyone Barrett says it's worse. Link party quests. Okay. Link member quest. No. [ __ ] it. Who cares playing Monster Hunter? Barrett, don't worry about it. Lobby members. There we go. Here I come. Joan image in me. You know why? With no surprises today. We're going to fight this spider. Are you dare? I'm coming from the lips of an angel. Hey, I was listening to that today, too. Yeah, that one's on my mind. I don't know why. There's a cover lips of lips of the lips of an angel. There's a cover of it, a country cover that was on my Oh, okay. Now, uh, did you hear the good news, Greg? That he has risen. Uh, no. I'm happy to report that LeBron James has heard all of the LeBron James songs that are currently just going absolutely viral. Are there LeBron James songs? Oh my god. We should rank all the LeBron James songs cuz they're so put out a LeBron album. I",
            "start": 313.84
        },
        {
            "text": "of the LeBron James songs that are currently just going absolutely viral. Are there LeBron James songs? Oh my god. We should rank all the LeBron James songs cuz they're so put out a LeBron album. I don't know what's going on. No, the Tik Tok is just making up LeBron James songs. Our Tik Tok rhythms are just wild. So good. It's so good. And so the report is is that uh his son Bronnie, the uh second son, has shown him all of the LeBron James songs and he loves them. One of the you know, I don't have many mistakes as an interviewer. You know, I'm fantastic. Yes. But when I was interviewing Andrew Lincoln and Chandler Riggs for The Walking Dead, okay, I ended the IGN live thing and I mentioned the the time the Coral memes were really big of him screaming coral. You know, remember this coral. And I said that and Andrew Lincoln had no idea what a meme was, nor had he ever seen it. And Chandler Riggs, you know, a Twitch streamer. He knew all about it, but it was like I couldn't even explain",
            "start": 362.88
        },
        {
            "text": "And I said that and Andrew Lincoln had no idea what a meme was, nor had he ever seen it. And Chandler Riggs, you know, a Twitch streamer. He knew all about it, but it was like I couldn't even explain it. I was like, well, it said, you know what, it doesn't matter. We'll be back with more IG and you know what I mean. I was like, I got to get out of here. Imagine just being that blissfully unaware of the right the internet. You don't even know. You don't even care. Whatever happened with those? Did he get the movie? Remember he was going to make a They were going to make a movie about They did it. Yeah. Yeah. They made a movie about Rick. I mean, it was a TV movie. It It was one of those things where it all evolved so much and changed so much he just ended up being on TV. If you ever want to know anything about The Walking Oh. Yep. Gia still Gia knows it all. She watches it all. I got I got to talk with Gia. How did I I guess cuz there was a time when I was deep into The Walking Dead",
            "start": 412.08
        },
        {
            "text": "to know anything about The Walking Oh. Yep. Gia still Gia knows it all. She watches it all. I got I got to talk with Gia. How did I I guess cuz there was a time when I was deep into The Walking Dead and then I I gave up. I think that happens with most people. You're deep into it. Walking Dead and then just like, \"All right, it was just so good, man.\" When they introduced the uh the whisperers, that's what I lost. Oh, okay. Cuz that's when they sent [ __ ] Norman Reedus to Europe. They had Lucy and the other guy. They they were all the way up in New York. And it's like, okay, what's happening here? Yeah. I didn't make it past or I guess I came back for the Glenn uh stuff with hot Jeffrey Dean Morgan. Yeah. Um and then I was like, well, that's that's it for me. Chat, whatever you do, don't look at my gameplay cuz I've forgotten all the buttons. It is crazy how quickly you forget and like how do I heal? How does this work again? Somehow every time I get on my sacred, I swap weapons",
            "start": 448.64
        },
        {
            "text": "look at my gameplay cuz I've forgotten all the buttons. It is crazy how quickly you forget and like how do I heal? How does this work again? Somehow every time I get on my sacred, I swap weapons unintentionally. You're hitting right on the D-pad. Hit up on the D-pad when you want to get on your sacred. Then you won't do that. No. It's okay, Joe. You got this. We're here. We're here. We're going to be okay. And everybody's going to remember how much fun they had along the game of the year comes around. This is more of just like a we're just getting back on the fly life back together. Uh people want to know about the invincible finale. Did you watch it, Greg? I sure did not. Oh, you sure did not? Okay. Well, that's why you haven't got any time. I've done some Gregways about it and everything else. Like I'm well aware of the Conquest story. So, no. I have to go watch 19,000 Alien versus Predator shows and Daredevil. So, no. I have notared I have not had bandwidth to also watch Invincible",
            "start": 510.4
        },
        {
            "text": "else. Like I'm well aware of the Conquest story. So, no. I have to go watch 19,000 Alien versus Predator shows and Daredevil. So, no. I have notared I have not had bandwidth to also watch Invincible and Whiteus and the studio. You got to watch the studio. Yeah, I've heard about the studio's really good. Joe, you watch that? I've been so I tried to watch it last night after I caught up on White Lotus and then apparently I can't like chcast Apple TV Plus from my phone. It only lets you like Apple AirPlay it, but you have to have an Apple TV to do that. So, if chat has any other um suggestions for me, I guess I could just like watch it on my laptop, which is not a good Well, you know what the best part is? By the time you start watching, you'll have episode three. So, you get to watch three episodes. It'll be I've also been watching The Pit, which is actually really good. Yeah, I've heard good things about that as well. That's the Noah Wy doctor show. Yes, I watched like Jen was watching",
            "start": 553.6
        },
        {
            "text": "It'll be I've also been watching The Pit, which is actually really good. Yeah, I've heard good things about that as well. That's the Noah Wy doctor show. Yes, I watched like Jen was watching part of it and I caught like a half an episode and it reminded me of the good old ER days. Yeah, I was a big ER kid. I've never watched Should not have been watching ER. I was way too young. But yeah, that's crazy to say. Seventh grade, I distinctly remember I was watching ER cuz when one of the guys got beat up like in a in the bathroom, Dr. Green, spoilers. Uh, I remember talking to my seventh grade teacher about it in class the next day and she was like, \"I don't know if you should know this much about what's happening in New York.\" I tried watching a couple episodes of The Residence this weekend and I didn't particularly love it. Which one's that? Uh, so that's Netflix. It's essentially Afterparty, but Shondaanda rhymes. And I just did not think it would. It's long 45minute episodes and I'm",
            "start": 596.4
        },
        {
            "text": "and I didn't particularly love it. Which one's that? Uh, so that's Netflix. It's essentially Afterparty, but Shondaanda rhymes. And I just did not think it would. It's long 45minute episodes and I'm just like I don't know that I have it in me for this. Sure. Sure. Sure. Sure. Sure. So, I went back to the pit. Back to the pit. How many seasons or episodes of the pit are? Pit is week by week. So, I think Sunday or this week is the finale. So, there's only one more left, but Oh, you know what's coming back? Right gemstones. I also have to catch up on that. H is coming back. [ __ ] everything. I'm so excited. H is coming back like next week. So, that's exciting stuff. Um, it's coming back next week. Yeah, it's uh early April. I can't wait. I've also because I've liked Carrie [ __ ] so much in White Lotus been like I should go back and actually like watch the leftovers cuz I think I watched like three episodes and then got caught up in something else like 5 years ago. So I want to do that.",
            "start": 634.16
        },
        {
            "text": "White Lotus been like I should go back and actually like watch the leftovers cuz I think I watched like three episodes and then got caught up in something else like 5 years ago. So I want to do that. Um yeah, there's two episodes of the pit left. So that means it will replace the pit. Oh, perfect. Did you just die, Mike? I suck. It's okay. I died once. Chad, I suck right now. It's okay. We're going to get you back. I'm trying to get back to like We're going to be so back, man. Remember, I'm I'm using the hardest weapon in the game. So, the moment you get off the wheel on that, you're never getting back on. And that's me right now. My apologies. Stop bouncing around. This guy was bouncing around so much. I did something I rarely ever do. went to my secondary. Oh. Oh, wow. Just shoot him. You're a bouncy little guy. And you want to know why I feel like I'm more than ever uh down to switch weapons? A little game called Monster Hunter Now. Oh, Monster Hunter Now has me changing my weapons",
            "start": 685.2
        },
        {
            "text": "a bouncy little guy. And you want to know why I feel like I'm more than ever uh down to switch weapons? A little game called Monster Hunter Now. Oh, Monster Hunter Now has me changing my weapons all the time for the dailies and stuff. I'm like, you know what? Fine. I'll try it here, too. And I didn't hate that. That was helpful. But I'll always be dual blades till I die. Okay. I keep having a problem here. Squad is I keep looking down at my computer and it says April 5th 11:39 a.m. And I looked out I go, \"Man, what what day is it? What time is flying by? What are we doing, y'all?\" Yes. I don't know if you heard, Greg, but yesterday Joey had to pull me out of here uh because the clock was wrong. So, I thought it was only 4:30 and Joey was like, \"Mike, it's 5:30 at night. You have to leave work now.\" Oh, okay. And I was so deep I wasn't gonna leave. You're living it. No, it's because we haven't changed all the time stuff for Pokemon. I think um anything to get Nick a better Pokemon. It",
            "start": 746.96
        },
        {
            "text": "work now.\" Oh, okay. And I was so deep I wasn't gonna leave. You're living it. No, it's because we haven't changed all the time stuff for Pokemon. I think um anything to get Nick a better Pokemon. It did make me laugh cuz you were so loud when you figured out that it was 5:30. It was a great time. Great games sometimes take you away. They whisk you away. That's what Monster Hunter does. Today is going to fly by. Today is going to fly. Nintendo Switch day. Uh new trailer for Karate Kid just dropped. I don't Oh, I think it's the movie Karate Kid. Yes, it is. Yes. I wanted to watch it with Nick. I don't know where Nick falls on these trailers cuz it's trailer number two, Joey. How many trailers can I show Nick before he gets mad at me? I don't get mad at you. Well, I did Romulus the final trailer and he was like, \"Mike, this spoiled the whole movie. You [ __ ] up.\" And I was like, \"Okay, well, I don't know how to see that. Hate to see him get mad at that.\" Yeah. Cuz like your boy Mike,",
            "start": 794.56
        },
        {
            "text": "and he was like, \"Mike, this spoiled the whole movie. You [ __ ] up.\" And I was like, \"Okay, well, I don't know how to see that. Hate to see him get mad at that.\" Yeah. Cuz like your boy Mike, I'll watch them all. I don't care. Yeah. H Amber deposit. What if I J? Let me see. What are we doing with What if I did this? Mike needs a little sleep pod in the studio. I'll put a Let me set a tent up in the roof and I'll just live forever. I'll have a great time. This trailer spoils a lot more than the first did, I think. Yeah. I feel like for a lot of movies, if I know I'm going to see it, I don't necessarily watch the trailers anymore. Like if I know I'm in Yeah. Yeah. You got to cut it off sometime. Though I will take any excuse to watch the materialist trailer. Can a Karate Kid trailer be spoiled that much? You know what I mean? Can the Karate Kid trailer really be spoiled? I have never watched Well, I guess this is like a different one, right? where there's like Ralph Machio but it's not",
            "start": 844.32
        },
        {
            "text": "that much? You know what I mean? Can the Karate Kid trailer really be spoiled? I have never watched Well, I guess this is like a different one, right? where there's like Ralph Machio but it's not Cobra Kai but Jackie Chan right? Yeah. Okay. So like I haven't watched that one so I don't um I probably need to do that. Yeah. I assume Greg or not Greg Tim will make us Casey says spoiler karate happens. I assume I'm in your squad Greg. I think I accepted it. So I accepted Joey's invitation. So did you see an invitation go through? Now you could probably also go you could also unless you quit which I don't think you did. Uh, you could just go to the Alma again, quest, you know, link party members. I'm just like picking things because it's just like fight stuff in the forest. Yeah, we're doing it. We're with you. We're here. To get your hunter rank up. I was like, \"Sure, I'll do that.\" Maybe after this one we take five really quick and just kind of talk about what we need or where what level",
            "start": 896.72
        },
        {
            "text": "We're with you. We're here. To get your hunter rank up. I was like, \"Sure, I'll do that.\" Maybe after this one we take five really quick and just kind of talk about what we need or where what level we're at. Uh, just so I can take a look at like who I am. I am just Who am I? I got to need that right now. Ass me. I don't know if I I love this monkey. This is high on my monster hunter wild monster list. Uh oh. I got an Instagram notification from Lauren. I've been mentioned in her story. I got tagged in her story, too. Lauren, listen. You just screwed over Joey and you sent her back on these streams and it's going to come up in her performance review. You really I blame Lauren's work for making her go into the office every day so then she doesn't get home till later and then everything then she has no time to play games with me. That's really who I blame. She did mention yesterday she's like, \"I feel so behind on gaming news.\" And had a picture of kind of funny games daily up in the",
            "start": 946.64
        },
        {
            "text": "she has no time to play games with me. That's really who I blame. She did mention yesterday she's like, \"I feel so behind on gaming news.\" And had a picture of kind of funny games daily up in the background. So maybe I should have known. It's like just catching up on my friend Joey on camera. Oh no. Leave me alone. I don't like this monkey. Do you like the farts? No. I like the little babies. Cute baby monkey. Oh yeah, he's got baby monkeys sometimes with him. Hey, Snow White Mike. I think Greg needs to call another one of Tim's friends. You know, there's a lot of content today, so be prepared. There will be probably be another phone call. Again, we're streaming for a long time today. We've already called Kern. We've already called Alfredo. Who else is on the list? I would like to not name my He has a whole list. He's got a giant list. But I think one call per piece of content is pretty good. I like that we've gone beyond tormenting Tim to tormenting everybody in Tim's life. Well, I",
            "start": 987.2
        },
        {
            "text": "my He has a whole list. He's got a giant list. But I think one call per piece of content is pretty good. I like that we've gone beyond tormenting Tim to tormenting everybody in Tim's life. Well, I mean, Alfredo was very rude about it. Yeah. I can't believe he would expect you to hold back like that. He just doesn't get it. You know what I mean? Yeah. Must be nice having one of those golden parachutes from Rooster Te. You don't have to worry about chat. Who taught me how to use this weapon? Whoever Whoever taught me never stopped. We should have said, \"Fuck Pokemon. We're just doing awesome.\" Let me just apologize to you right now. Everything you taught me, I have forgotten. Okay? So, whoever taught me and took the time out of your day to teach me this weapon, I big time apologize to you. I have no idea anymore. I do like all the noises. Game's great, Jim. Yeah, except for you see this nightbot, Joe? You see this night about a vowed? I can't find this thing. I just want everyone to",
            "start": 1053.52
        },
        {
            "text": "I have no idea anymore. I do like all the noises. Game's great, Jim. Yeah, except for you see this nightbot, Joe? You see this night about a vowed? I can't find this thing. I just want everyone to know I'm I'm deep in the systems. I can't find this thing and it's been there for about a month trying to hide from me. I can't find it. I'll get you eventually just to know that. That's amazing. Can't find it. It's one of those things I've seen it before and I was like, \"Oh, well, I must not know something that you're responsible for or whatever. I didn't even cook before this. I'm out of sorts. Yeah. Yeah. Yeah. We're going to We're going to get there after this. Yeah. Yeah. Yeah. Yeah. We're going to reset the screws. We're going to look at our I think we've had a couple of jabronies joints. This Froggy fresh guy. Froggy's got game. Remember when we had Andy on this game for about a week, too? Yeah. Andy just doesn't like to play games with us. Well, I guess he plays games with you.",
            "start": 1111.12
        },
        {
            "text": "This Froggy fresh guy. Froggy's got game. Remember when we had Andy on this game for about a week, too? Yeah. Andy just doesn't like to play games with us. Well, I guess he plays games with you. According to Mike, he does not. Yeah, he doesn't do enough. Not enough games. Yeah, but enough for you is like 23 hours. There's seven days in a week, and if we're not hitting six days a week, then we're really [ __ ] Aren't you guys playing split fiction together? I haven't seen him call me back for that. I think actually you didn't call him back. Yeah, I have to put that one on me, Joe. Put that one on me. I feel like I got this cell phone. It doesn't make noise anymore. Silent Society. I don't know how to change it. So, we're just letting it ride. Silent Society. You shouldn't have changed that. I'm going to get a new phone, too. I'm going to get a new one. Oh, what are you going to get? I don't know. Just the upgraded version of this. You know what I mean? I can say you're very excited",
            "start": 1182.88
        },
        {
            "text": "I'm going to get a new phone, too. I'm going to get a new one. Oh, what are you going to get? I don't know. Just the upgraded version of this. You know what I mean? I can say you're very excited about it. Yeah, I'm pretty excited. Pretty excited. It's been a long time. I just use it for the camera cuz I always tell Washi. I'm like, \"Washy, I want to buy a camera. I want to take a lot of photos.\" He says, \"Mike, you have an iPhone.\" And I'm like, \"Yeah, but what if I get this $1,000 Canon camera?\" He's like, \"That's a bad idea.\" I'm glad that you have people Well, I guess you do have people in your life that tell you that it's a bad idea. Don't really listen to I'm the king of the Candids and so I need a good King of the Candids, they call them. I'm snapping photos. Oh, this line with pictures of him last night for a thumbnail. Yeah, Joey took a photo of me last night. Was great. It's a great thumbnail. Thank you, Joey. There we go. Nice job, team. Nice job, team. Uh, Chris in the chat",
            "start": 1230.88
        },
        {
            "text": "of him last night for a thumbnail. Yeah, Joey took a photo of me last night. Was great. It's a great thumbnail. Thank you, Joey. There we go. Nice job, team. Nice job, team. Uh, Chris in the chat says, \"Who the [ __ ] ever called you that, Mike?\" What? King of the Candids. King of the Candids. I I call myself that. It's a self-given name. Uh, Chris, it's a self-given nickname. Sometimes, Chris, someone's got to be the one taking the photos. You got to Yeah. I mean, somebody's got to, Chris. Do I have Canon photos of you? Maybe. Maybe. You never know. You have a lot photos. After Friday. Friday, I'm gonna get some of you. Friday, I'm going get some. I think I have about Greg. What's your photo count? You and I have similar photo counts on our phone. Let's take a look. I'm open it up for you cuz I am quite I'm high. Greg, I'm higher. I bet I I'm so I'm really high. Okay. So, in my li photo library. In my photo library, I have 88,232. You are so high, bro. I'm at 33,340. Damn, bro. You",
            "start": 1266.24
        },
        {
            "text": "cuz I am quite I'm high. Greg, I'm higher. I bet I I'm so I'm really high. Okay. So, in my li photo library. In my photo library, I have 88,232. You are so high, bro. I'm at 33,340. Damn, bro. You at 88,000. 88. I've never deleted a Oh, I That's not true. I I But I've I've since I got iPhone just been taking photos. I've deleted photos obviously. But like No, like you go all the way back. You got it the first time out with the iPhone. You know what I mean? How uh what so do you just let them bank on that or do you ever pull them off and put them onto your computer? What do you do? No, I mean the old days when you had to back up on your computer I would then no I just let them go there with iCloud just syncing it. You know what I mean? Taking it all. It's great. I love that. Don't have to worry about it. I last time around the last phone I did have to sign up for like one of those little cleanup programs that like all right here's seven. This is the best one. Cuz it was I was choking",
            "start": 1321.04
        },
        {
            "text": "worry about it. I last time around the last phone I did have to sign up for like one of those little cleanup programs that like all right here's seven. This is the best one. Cuz it was I was choking but then I got the new phone. I was like give me the best. Just give me the most. Give me all the memory. Give me all the memory you got. Shove a terabyte in this phone. How do you have so many? Thor says, \"Well, I took an intro to photojournalism class.\" And what they taught you there was work the shoot, which is take a lot of different photos of the thing you want from different angles to get the to find the one you want. So, I work the shoot for any photo I take, where I take lots and lots and lots of photos of the same thing and then pick the one I want, but then I don't usually have the time to delete the ones I don't want. And you have a child now. I have a kid. So you have a wife and a child. Of course, we're going to take photos of both of them. And dogs and a dog. He's in the",
            "start": 1371.92
        },
        {
            "text": "time to delete the ones I don't want. And you have a child now. I have a kid. So you have a wife and a child. Of course, we're going to take photos of both of them. And dogs and a dog. He's in the golden triangle. How many are hidden? I'd rather Oh, I I'm not on trial here. I'm not I'm not on trial. I'm not answer that question. Wow. Let's see. Okay. What are we doing? Let's all take a deep breath. What are we doing here? I'm just running with y'all. What's our numbers at? What's our numbers at, Joe? What can we tell Greg to have him help us? What number are you at? How do I know what my number is? I was like, how do I know this? Um, uh, not that. What's my hunt? What do I need to be getting after for Greggy? Let's see. Not that. Hunter profile. Maybe that's what I No. Okay. So, I'm hunter level 13. What are you? You said you went to your hunter profile for that. Yeah. And then our one. You can do it from a member list, too, if you want. You just look at everybody. Yeah. So, old man",
            "start": 1409.84
        },
        {
            "text": "level 13. What are you? You said you went to your hunter profile for that. Yeah. And then our one. You can do it from a member list, too, if you want. You just look at everybody. Yeah. So, old man Nick is 27. Joey's 13. And I'm so much higher than me. I'm 27. Okay. He kept grinding after after that one stream where we rolled credits. He kept he You guys rolled credits. Frog 131, by the way. That's who's running with us. Lightning is also in the guild out there. You'll see them running. They're 79. So, you got some we got. So, our goal here is to kind of look at Joey and just say, \"What what armor, what weapons are you looking for, right?\" Or see what mission she has. I don't It's right now it's just run around and kill [ __ ] and get your hunter rank up is my like main quest. So, I can do whatever, but maybe I can't do whatever. Three stars, I think, is maybe my limit right now. Guardian scale. I might have to kill a guardian. Yeah, dragon bone relic I need for that. I've got some",
            "start": 1464.76
        },
        {
            "text": "do whatever, but maybe I can't do whatever. Three stars, I think, is maybe my limit right now. Guardian scale. I might have to kill a guardian. Yeah, dragon bone relic I need for that. I've got some guardian scale generic. So, you've got these monsters out there. Yeah. Yeah. Just like running around. Yeah. Just so just go Yeah. Click on them like that. Mhm. And then Yeah. You can filter survey. That's just what I've been every time you guys have joined me. Oh. Oh, okay. I thought we were running different stuff. Okay. No, that's great then. You're doing great, Joe. Perfect. Frog Knight says he's ready to help this squad. Get in there. Thank you, homie. Let's have some fun. Let's go get lost. I'm following Joey. Frog, I'll get you the invite to just to join the link party. I'm hunting Wrathos is what I've been hunting. Rathalos Plus. Okay. Yeah. Right now, if I if we get a dog Sugma Plus in there, that'd help me out. Arved plus, but I I you know, the ranks are I'll look around. This is",
            "start": 1509.04
        },
        {
            "text": "is what I've been hunting. Rathalos Plus. Okay. Yeah. Right now, if I if we get a dog Sugma Plus in there, that'd help me out. Arved plus, but I I you know, the ranks are I'll look around. This is a Raian. Is that what you're also doing? Rathalos. Oh, Rathalos. Okay. Well, big difference. Hey, big unfortunately big difference. One's red, one's green. Oh, got it. Both giant dragons. Oh, yeah. He looks scary. Oh, you look like you're angry at me, particular. Okay. Okay. Ben M super chat, if I wanted to join some KFBF hunting uh in in hunting, where would I go? Uh, of course the official kind of funny guild is full. There is a secondary kind of funny games one that's a audience run that I did join. Joey has fainted before we've arrived. Yes, Neo Aoshi still plays over in the Twitch chat. He has another kind of funny audience one as well. Let us hit that. Yeah, Neo, hit me up with that code. I'd love to get down there cuz what I do every night is I sign on or not every night, but you",
            "start": 1562.64
        },
        {
            "text": "He has another kind of funny audience one as well. Let us hit that. Yeah, Neo, hit me up with that code. I'd love to get down there cuz what I do every night is I sign on or not every night, but you know, now that I've been able to play a bit. Sign on, look for a person in any of the lobbies, join that lobby. And so I'm joining Calib Bros. I'm a couple others. There it is. Neoi hooked you up. Olive party says the discord also has one. I'm fighting. I can't do it. Neo, after this remind put a giant. You might up in my nose. There we go. How do I run on this thing again? Hold R1. R1. Thank you. Thank you. This is the life, guys. Just hunting, waiting for pizza. It is the dream. Wow. One is queen of the earth, the other's king of the skies when it comes to those batos and wrath in. That's sick. Now, as you know, Mike, I know it's a big deal for you. My birthday is coming up. April 27th, we are in my birthday month. All right. I I think I want a I want a Monster Hunter show. All right. I",
            "start": 1621.68
        },
        {
            "text": "Now, as you know, Mike, I know it's a big deal for you. My birthday is coming up. April 27th, we are in my birthday month. All right. I I think I want a I want a Monster Hunter show. All right. I want to see. Should we go back and just have a massive one for your birthday? I love that. Too bad Party City's closed down. I bet you they have Monster Hunter birthday cake plates and stuff. Yeah. Yeah. Yeah. We should hit up Capcom. We'll hit up Capcom. Let them know we're throwing a Monster Hunter. Let's hit up Capcom. The big 42. Let's get Let's get it. I I will block out the day. You hit up Capcom. Let's have something fun. Let's do it. I love how colorful all of our sacreds are hanging out together. Oh, you're angry at me. That girl is poisonous. What's the butt in the bank? You know it, Mike. You've been here before. Oh. Get out of the sky. Feel like this poison is probably not great to me. It's fine. It's fine. It's fine. PETA. Oh, I died. Speaking of pea, I did finish the latest",
            "start": 1676.64
        },
        {
            "text": "Mike. You've been here before. Oh. Get out of the sky. Feel like this poison is probably not great to me. It's fine. It's fine. It's fine. PETA. Oh, I died. Speaking of pea, I did finish the latest Hunger Games book finally, and it's very sad. PETA, which I know is not the right PA, but that's the one that's on my brain. I'll take it. I'll take it, man. You're participating. You're making content. I'm trying. Whatever happened with that? They made a new one. Yeah, I watched it last weekend. Pretty good. And then she came out with a new book that came out like two weeks ago. Okay. And they're making a new movie of that that comes out in the next year or two. And are we still in the battle royale type style of this or have we moved on past that? We're not dropping kids from So the movie that came out last year or the year before was about the 10th Hunger Games and we were like in the ' 70s. Okay. For the original ones. And then this one was about the 50th I believe. And so this is Hey",
            "start": 1737.16
        },
        {
            "text": "came out last year or the year before was about the 10th Hunger Games and we were like in the ' 70s. Okay. For the original ones. And then this one was about the 50th I believe. And so this is Hey Mitch, who was the like Oh, Woody Harelson. Yes, exactly. This is about his games and how he won that. And then you get all the little cameos of some of the other characters from Jack. No Jack, unfortunately. No Jack Quaid, but may well maybe. Uh, it's funny, too. I've been watching Reacher and like I forgot that Alan Briden was in the Hunger Games movies, too. He plays another like career tribute kind of like Jack Quaid. Maybe not like Jack like Woody, but he's one of the ones that's like, \"Oh yeah, I've like trained for this my whole life and I want to win.\" She's like, \"Oh yeah, you that you've always been that character.\" He was Aquaman, too. Never forget. Was he really in Smallville? Yeah. Oh, he's had a long career. He really had cuz my touchstone for him for so long was Laser Team.",
            "start": 1814.64
        },
        {
            "text": "always been that character.\" He was Aquaman, too. Never forget. Was he really in Smallville? Yeah. Oh, he's had a long career. He really had cuz my touchstone for him for so long was Laser Team. Oh, yeah. And then Nick always talks about Blue Mountain State, which I've never watched, but I've heard I've never watched either. That kind of goes in like the same category of the League of Everybody talks about it, but I have never really watched it, but I'm really liking him in Reacher, so maybe I'll go back. Oh, I'm like very Oh, he's so good in Blue Mountain State. He's a funny character. I appreciate someone that can do comedy and action. Well, sure. Sure. So handsome. He is also just incredibly attractive. If you notice, Mike, Rathon fights on the ground more since she's Earth. I thought that was cute. That was cool. Is Lenny Kravis's character in the 50th? Yes. He's SA and he's the like designer person. We love him. Is your crew still playing this, Mike? Uh, Washi is still down for",
            "start": 1870.72
        },
        {
            "text": "that was cute. That was cool. Is Lenny Kravis's character in the 50th? Yes. He's SA and he's the like designer person. We love him. Is your crew still playing this, Mike? Uh, Washi is still down for the hunt, but nobody else. I haven't heard if Kevin or Chris or Maddox still plays this. Are you guys all What are you playing these days as a crew? Uh, Mike is playing alone. It's usually I jump in the Discord. I say, \"I love you all. I'm sorry. Goodbye.\" And I immediately turn on Final Fantasy 10. So, I have not spoke with them since we all joined the island, and we're massively let down that we couldn't do anything together on the island. Uh, what a big disappointment that was. Um, what was I going to say? Oh, are you not all playing schedule one? Me and Washi are together. I forced him to play it with me and then he fell in love with it. Yes, great call out. Oh, sorry. Yes, he's definitely S is not in sun. Do you still need to capture a vigor wasp? Uh, yeah. That one right there. Uh,",
            "start": 1943.12
        },
        {
            "text": "play it with me and then he fell in love with it. Yes, great call out. Oh, sorry. Yes, he's definitely S is not in sun. Do you still need to capture a vigor wasp? Uh, yeah. That one right there. Uh, yeah. Arm your Oh, nope. Nope. Nope. Oh, I did the wrong thing. That's gone. That's gone now. There's one over here. Follow me over here. Yeah. Follow me where I come over here. There's one up here. Where are you? So, then you'll hold L1. I'm Okay, you're fine. No. Where are you? It just stopped. Turn around. I'm like right behind you. It won't let me stop. Okay, that waterfall. See that waterfall? Nope. Nope. Nope. Turn to your right. Right. Right. Right there. Run to that waterfall. Thank you. No problem. No, no, I'm happy to help. And so then when you get up here, uh, hold L1 and then go over to your capture net with circle. Wrong one. Yeah. No. So just hold L1 and then circle. Hold L1. Circle. Yeah. Circle. Okay. Stop using the stick all together. Let go. Let's let go. Let's reset. Let",
            "start": 2006.8
        },
        {
            "text": "to your capture net with circle. Wrong one. Yeah. No. So just hold L1 and then circle. Hold L1. Circle. Yeah. Circle. Okay. Stop using the stick all together. Let go. Let's let go. Let's reset. Let go. Let go. Hold L1. Yes. And then hit circle and see how it moves your little Oh, got it. We're going down there. Yeah. Go to the capture net and then you'll need to There you go. And then hit square to equip it. Okay, cool. Hold on. Hold on. Hit square. And then aim with uh You have no weapon equipped. Yeah, there you go. There you go. There you go. And then you're going to fire with R2, but I think it's behind you. I think it's a Now it's not going to work cuz the thing Yeah, the quest ended. Got her. But now I know how to do it. So we're going to Oh, you can still get up. Hurry. There we go. Thank you. We were just running I forgot we're running around the environment. Excellent. And now this thing wants to kill me and I don't appreciate that. But who knows where that thing went, but",
            "start": 2056.16
        },
        {
            "text": "go. Thank you. We were just running I forgot we're running around the environment. Excellent. And now this thing wants to kill me and I don't appreciate that. But who knows where that thing went, but it's fine. I don't really care. Okay, somebody pick something. Give me a dashima plus or a shuga plus or the a the cover athlete plus oh [ __ ] the cover athlete bro. No way man. We love the cover cover athlete. Uh thank you Neoi. Neo aosi. Make sure you eat too joy. Make sure you go in your tent. I did that when I died the last time which happens kind of a lot. La Barina. I got a lot of those. Is this the right environment for the stuff that you Great question want. I guess I can go look at that. Uh field guide. Which one do you want? Uh the Shuga. Yeah. The Sugama Plains forest. If you if you can get I don't know if you have an Arcel Plus. I'd rather that [ __ ] this. Yeah, but I probably don't have the plus one. Okay. Okay. Well, I mean, you beat the game, so I was never I wasn't sure.",
            "start": 2108.48
        },
        {
            "text": "can get I don't know if you have an Arcel Plus. I'd rather that [ __ ] this. Yeah, but I probably don't have the plus one. Okay. Okay. Well, I mean, you beat the game, so I was never I wasn't sure. I don't know when that unlocked. So, this is why we can go head over there. It's not it. You're always making moves, you know. I'm trying. Ben M says, \"Greg, I got a tempered arc.\" Oh, yeah. Who said that? Uh Ben M said that to you. Okay. You'll have to figure it out with him. Yeah, that's the thing. We're over here running. Oh, it is interesting that it's on my list, but it won't let me go to it. So maybe I haven't unlocked actually that I might just not be high enough level. What was the other one? uh arc. What if you don't have them? So, we can do we can just do whatever. But you're just upping your uh thing, right? Yeah. Unequip the capture net so I can go back to killing things. Um you also you guys could go hunt big stuff. I'm totally fine just running around getting the little stuff.",
            "start": 2176.96
        },
        {
            "text": "your uh thing, right? Yeah. Unequip the capture net so I can go back to killing things. Um you also you guys could go hunt big stuff. I'm totally fine just running around getting the little stuff. feel like that you guys will accept this later. I like that. I will not be offended if you guys go hunt high level stuff. Well, let's see. Well, go join Ben, Greg. Well, let's keep helping Joe. I'm down to help Joe. I'm getting decent hunter rake off it. It's not like I'm wasting my time or anything. Okay. Okay. Pizza's on its way. Oo, pizza. Did you start a quest here, Mike? Is that what's happening? I started a quest. Actually, I did. Joey, are you doing this? I'm going to jump onto his quest. Joey. Joey, come hunt this raphalos with me. King of the skies. Invitation list. Never mind. How about this Minecraft movie? Man, I can't wait. You know what I mean? Jack Black. Jack Black and Jason Mimoa together for some goofs and some gags. Write me down. I have heard not great things about",
            "start": 2249.52
        },
        {
            "text": "about this Minecraft movie? Man, I can't wait. You know what I mean? Jack Black. Jack Black and Jason Mimoa together for some goofs and some gags. Write me down. I have heard not great things about really. Oh [ __ ] I mean, I am not shocked at all by that. Oh, all I want is me, Nick, and Tim to go watch it together, just like we did Borderlands. I love that for you guys. Um I Yeah, people have said that Jennifer Coolage is like the only fun thing about the movie, which is not No surprise. So, we'll see. We'll see. But I get I Nobody's walking into that thinking it's going to be a good movie. Yeah, it's a child's movie. Is it good? Is it going to be will kids laugh and like it? That's all that matters to me. Such a benevolent spirit. You know, it's all we want. Mike's just looking out for the kids. You know, it's like the kids deserve something. I got Doom when I was a child. That's all I I wanted Doom to be good. The Rock didn't make Doom good. I didn't get a bunch of I got a bunch of",
            "start": 2336.16
        },
        {
            "text": "kids. You know, it's like the kids deserve something. I got Doom when I was a child. That's all I I wanted Doom to be good. The Rock didn't make Doom good. I didn't get a bunch of I got a bunch of cool Resident Evils though, Joey. And I loved those. Neo says, \"I got press tickets to it and I said no thanks.\" I think we also passed on screeners for it, but it was also because it's a kids movie, we get screeners for like Sunday morning, and I didn't think anybody was like super stoked about going downtown on a Sunday morning at like 9:00 a.m. Do you think that you'll see this in 40X? Do you think I mean, that's the that's the way to trick anyone in Kind of funny to going to watch a movie. I got this 40x movie, everybody. Let's go. All right. Tim says, \"Cancel all programming. Cancel everything. We got to go.\" Uh, are you going to go see Snow White in 40X? Snow White. Greg watched Lilo and Stitch and I'm very I'm very jealous cuz I've never watched it. Well, great news. It's on Disney",
            "start": 2390.96
        },
        {
            "text": "We got to go.\" Uh, are you going to go see Snow White in 40X? Snow White. Greg watched Lilo and Stitch and I'm very I'm very jealous cuz I've never watched it. Well, great news. It's on Disney Plus. You can watch it there. I'm currently watching the Coach sports one. Gotcha. Watch. Oh, win or lose. I like win or lose. I'm on episode two of that. What a brilliant. Okay, so then you're there. I didn't watching win or lose episode one I was like it's cute enough I don't get it and then episode two I'm like oh it's the same like buildup to the game every time from a different perspective perspective you learn you learn what their the kids are doing or the parents I was like oh my god like episode one and it's it's just like [ __ ] blue where every one of these makes me cry at some point you'll get them next yeah okay let me give you the pitch so it's win or lose right it's this softball team uh kids junior high whatever uh the buildup to the champ the big championship game told from all",
            "start": 2438.88
        },
        {
            "text": "get them next yeah okay let me give you the pitch so it's win or lose right it's this softball team uh kids junior high whatever uh the buildup to the champ the big championship game told from all these different perspectives and It's Pixar. Oh. So, it's like so well done and like then yeah hitting on so many of like parent things and kid things and you know your insecurities and everything else. It's so good. Can't recommend it enough. You'll get them next time, Joe. That's what he says all first episode. So good. You'll get them next time. It's cute. I've been watching the Mighty Ducks Disney Plus series, but only on TikTok like Mike. Yes. with the kid from uh Shoresy and the other one. Uh they got them. They got a lot of them back. Yeah. Uhhuh. They got all the kids there, right? Last of Us than the first episode. I think I'm only on the first episode still, but that's what happens when you watch. What's that? Is that on Disney Plus? Yeah. Oh, I needed to heal. Damn it. I forgot",
            "start": 2482.88
        },
        {
            "text": "of Us than the first episode. I think I'm only on the first episode still, but that's what happens when you watch. What's that? Is that on Disney Plus? Yeah. Oh, I needed to heal. Damn it. I forgot the button. Oh, angry. specifically. So, wait, but you guys watched Lilo and Search for the first time with Ben. Yeah. Yeah. Yeah. Yeah. He he when we were at Target, uh he needed he wanted his own hairbrush cuz Jen brushes his hair in the morning. And so, uh yeah, he picked the Lelo one. And we're like, \"Oh, that's a that's a cartoon movie. You know, we should watch that.\" And he's like, \"For movie night, we were going to do movie night dinner.\" And then when we got to movie night, he's like, \"You know, I actually don't want to watch this. I want to watch Cars.\" So, we watched Cars. And then for the 78th night, And then he double then he tricked double back the other night when we're like let's eat at the table. He goes movie night. Let's watch Lilo and Stitch like ah. Okay. [ __ ] got us.",
            "start": 2529.44
        },
        {
            "text": "the 78th night, And then he double then he tricked double back the other night when we're like let's eat at the table. He goes movie night. Let's watch Lilo and Stitch like ah. Okay. [ __ ] got us. Yeah, we did. We watched the entire thing. Stayed up late to do it cuz it was so good. I know. It's so good. A different Disney. Yeah. More violent and scary. I was like, \"Oh, damn.\" I guess I don't think about it. They don't do it like that no more. Yeah. It's so cute. It is very cute. And the music's banger. Is that the new hyperfixation or just cars win over Sonic? Hyperfixation. I don't know. I feel like he's very he's diversified. Yeah. And especially when he's watching things like win or lose and then he discovered over the weekend the floor is lava. Oh, the floor is lava. Floor is lava. But so we're doing different episodes of the same thing, which is a nice change. Have you done Humans Versus Hamsters? No, we haven't. Oh, Humans versus Hamsters. It's on HBO Max. Okay. I watched it",
            "start": 2578.96
        },
        {
            "text": "But so we're doing different episodes of the same thing, which is a nice change. Have you done Humans Versus Hamsters? No, we haven't. Oh, Humans versus Hamsters. It's on HBO Max. Okay. I watched it at the Drakes with Charlie and it's there's two different uh like obstacle courses and one's human size that the humans go through and then there's a replica that the hamsters dies and they race. That's awesome. And there's all the the hamsters have like different themes and stuff like that. There's like the really sporty one and then like the nerdy one and all. Okay, I like that a lot. It's really fun. I'll introduce that. Mega potion, I guess, is what I'm taking. Gosh, switch two tomorrow, guys. I know. I I was like, am I I was debating. I was like, I don't have to come in for it because I'm not on it, but it's like a fun day to come. Yeah. Yeah, totally. It's It's that old vibe of E3, you know? That's true. And how often do we get these? So, yeah, that's a great point, too. And then I",
            "start": 2627.12
        },
        {
            "text": "not on it, but it's like a fun day to come. Yeah. Yeah, totally. It's It's that old vibe of E3, you know? That's true. And how often do we get these? So, yeah, that's a great point, too. And then I think I also did kind of tell Roger that I would help do social stuff with him because it's going to be so busy, but I'm chasing this thing. You would like you struggling to remember everything? Yeah, I don't remember a single thing. He's lost under. I have uh I've somehow recouped how to charge my shield and I don't remember anything past that now. So, everything I once had is now gone. Did you Are you committing to the hard weapon or did you Yes. Yes. Yes. I'm I'm just locked in on this. We'll come back to you. It's all coming back to [Applause] my Benny Be Good wants to know when you're getting back to drug dealing, Mike. I texted Washi said we got to get back. He said, \"I'm busy this week, so probably next week or this weekend for me and Washi.\" But yeah, once you start mixing the",
            "start": 2676.48
        },
        {
            "text": "getting back to drug dealing, Mike. I texted Washi said we got to get back. He said, \"I'm busy this week, so probably next week or this weekend for me and Washi.\" But yeah, once you start mixing the drugs, Joe, what games? Uh, this is called Schedule One. Yeah, this game has absolutely taken over the globe. It's very good at the same time like that. This is a game that has some really good systems and it's actually a lot of fun to play. It will go down as a TCG card shop sim of the year. Oh wow. It does seem like it has a little bit more to it than some of the other Sims we've dabbled in. Okay, now we got to go falling this way. He was very bad at it, but we love you, Mike. Yes, I did hear that you spent all of your money not on drugs. I was forward thinking, Joe. I thought if I get more equipment, I can make more drugs. And that put me behind the eightball cuz I had too much equipment and not enough drugs. You know what I mean? And then I hired this kid off the street and he wasn't",
            "start": 2748.96
        },
        {
            "text": "equipment, I can make more drugs. And that put me behind the eightball cuz I had too much equipment and not enough drugs. You know what I mean? And then I hired this kid off the street and he wasn't pounding the pavement like I needed him to. You know what I mean? Like it's like get out there every single moment. I need you to hustle these drugs and he wasn't doing that. And so uh you know we're we're at a standstill right now. Have you made it to the casino yet? Uh you know people tell me there's casino but no I'm too focused on the business right now to be losing my money at the casino. But once I find out there's blackjack and or roulette, there's going to be a problem. Yeah. I haven't I don't know what's at the casino. I've just seen everybody I see talking about it is about how they're losing all of their money at the casino. Cuz what I really need I need a good video game like a Grand Theft Auto 5 similar to when they put in their casino. Yeah. They have a great one cuz they",
            "start": 2803.6
        },
        {
            "text": "losing all of their money at the casino. Cuz what I really need I need a good video game like a Grand Theft Auto 5 similar to when they put in their casino. Yeah. They have a great one cuz they have horse racing which is a ton of fun. I need a good craps table. I need a craps table at the casino so I can learn how to play craps in real life. Sure. because that is the table that's always exciting. That's a game you can win money. I'm putting up air quotes on that. But that game seems like your money lasts a little bit longer than just getting annihilated at blackjack. But like I don't know how to play it, so I never play it. But like craps. I want to learn you and play it. Gambling in general IRL is always so intimidating because people get so mad at you at the tables and stuff like that. Like where's you took my car? I'm like I don't know what the hell I'm doing, dude. Where's the beginner casino? You know what I know where it is? What? river boat St. Louis, Missouri. That's where I I",
            "start": 2842.24
        },
        {
            "text": "where's you took my car? I'm like I don't know what the hell I'm doing, dude. Where's the beginner casino? You know what I know where it is? What? river boat St. Louis, Missouri. That's where I I learned where I've ne I mean I don't gamble period, but like I long before I ever went to Vegas, I went to a a bachelor party or maybe just a night out in St. Louis. I don't even know. We ended up there and it was that I I was like hit me or whatever and the guy's like, \"Dude, you're taking my car.\" Like, \"Oh, am I really?\" He's like, \"Yeah.\" And I turned to the guy and I'm like, \"Can I not take this car?\" And he's like, \"Yo.\" The dealer dealer's like, \"Yeah, I guess.\" And he took it back and gave it to that guy. I was like, that's not how a dealer should really do it. But he did. And it was like then the entire table was just chilling of like teaching me how to do it. It was very nice once it got going, but it also was like I'm like, okay, cool. I can never do that in Vegas. I can never ever",
            "start": 2883.2
        },
        {
            "text": "then the entire table was just chilling of like teaching me how to do it. It was very nice once it got going, but it also was like I'm like, okay, cool. I can never do that in Vegas. I can never ever go to Vegas now and do this. No. Whenever I go to Vegas, I just sit at the sports book, usually with my aunt and or my grandma, and we play video poker, which is fine. The worst part about all these casinos is that the buyin prices are too high, right? The minimum per hand is $25 to $50. And it's like, give me the casino that's asking for $5 a hand and let me lose 50 bucks. You know what I mean? So, at least I feel like I'm playing and learning. When it's $25 a hand, it's like, okay, well, I get four hands here and I lose a 100 bucks and now I'm done for the night. So, good job, team. They got to figure that out. It wasn't a strong enough Rathalos, though. Not Not an basic Rathalos. A little baby one. Can't believe he killed the baby one. This is a rare research opportunity. Can't let it",
            "start": 2921.04
        },
        {
            "text": "to figure that out. It wasn't a strong enough Rathalos, though. Not Not an basic Rathalos. A little baby one. Can't believe he killed the baby one. This is a rare research opportunity. Can't let it go. Oh, it's got a plus, actually. I'm going hit him up the bathroom. Hit him up the bathroom. Any opinions on the Spider-Man news? Uh, well, they made they put a name out, right? Yeah. And he's got a new suit. I don't know. Should we look it up? You want to look up it, Joe? Let's look it up. I'm going look it up. I'm look it up. Uh, Spider-Man. Spider-Man. Brand new day July 31st, 2026. Joe Tom Holland Spider-Man 4 gets official title. Brand new day ahead of summer filming. Exciting. So, he's he's back in the suit. He's ready to film. [Music] That's two months after Doomsday. That's crazy. So, he's currently uh filming Across the Globe. Uh who will be seen in the next Christopher Nolan the Odyssey movie with Matt Damon, Zenaia, and Anne Hathaway? It's I mean Nolan always has like an",
            "start": 2962.48
        },
        {
            "text": "So, he's currently uh filming Across the Globe. Uh who will be seen in the next Christopher Nolan the Odyssey movie with Matt Damon, Zenaia, and Anne Hathaway? It's I mean Nolan always has like an incredible Is isn't he dating Zenaia? Yes. [ __ ] yeah. That's cool. I think they're engaged. You both get to film together. That's fun. I'm pretty sure they're engaged. Um, she has a very beautiful diamond ring on her ring finger. So, he doesn't give spoilers anymore, he says. So, I'm not going to do it [Music] today. And then, yeah, a couple people have mentioned that it's named after the comic run. Brand new day is the comic run about Spidey dealing with people forgetting who he is. So, it works with the ending of No Way Homes. This is Tyler's new group. That's awesome. How long does he got? How many more? If this is his fourth appearance, what does his contract look like? I guess is where that's a great question, right? When is he making another Uncharted? You know what I mean? Get with",
            "start": 3034.96
        },
        {
            "text": "How many more? If this is his fourth appearance, what does his contract look like? I guess is where that's a great question, right? When is he making another Uncharted? You know what I mean? Get with it, Tom. Stop [ __ ] it. Let's get into the Uncharted world here. Let's Let's call it Marky Mark. Let's get the Uncharted movies going on. It is interesting to see um like what actors especially in the Marvel verse kind of decide to do projectwise after or during Marvel cuz I think that how do you balance that? Yeah. Cuz I had high hopes for Chris Evans which has not necessarily panned out in the way that I hoped it would. He's kind of gone the Ryan Reynolds route of like kind of generic actiony movies which I don't think have been like particularly fun versus Sebastian Stan has had some like very interesting roles. Nice. Yeah. Um so yeah, your boy Chris Pratt out here just doing anything. I watched him in that electric whatever with Bobby Browns and the Russos. which is a Netflix movie",
            "start": 3087.28
        },
        {
            "text": "very interesting roles. Nice. Yeah. Um so yeah, your boy Chris Pratt out here just doing anything. I watched him in that electric whatever with Bobby Browns and the Russos. which is a Netflix movie where the girl's brother got trapped inside of a robot. Cool theme, awesome like atmosphere and vibe. They suck. You know what I mean? Chris says, \"Whose boy is he?\" Which is a great question cuz I don't know that Chris Pratt is any of our boys. I'm picking Evans. I'm picking Pine. Chris Pat's my boy. Unless he's a bad dude, but he's my boy. You know what I mean? He does bad movies and I watch a lot of bad movies. Bad movies. watch a lot of bad movies. He Yeah, it should be. Mike is right. Oh, it should not be. No, not my personal fave. Ooh, let's see what kind of fun new armor I can be obsessed with. I guess I already have the cool cape. I'm working on the Rathalos and that one gave me a lot of XP for my hunter rank, so that worked out well for me. I'm actually like pretty happy with my",
            "start": 3139.76
        },
        {
            "text": "with. I guess I already have the cool cape. I'm working on the Rathalos and that one gave me a lot of XP for my hunter rank, so that worked out well for me. I'm actually like pretty happy with my load out right now. Okay. Um, let's see. I like that I have my like purple cool leg tats and skirt and this giant feathery long hair cape with these cool tailbones hanging off. It looks real dope. Do you guys mostly capture or kill monsters? Kill. Kill. Yeah. What is the benefit of capturing? You get more stuff. Do they have Do you have to like have them at like a certain weakness before? Yeah. When they have skulls, you put down the trap or and then you trank bomb them or trank ammo them or whatever. Joey, do you want to pick another one? Um cuz like I'm just going to pick. So do your thing. I have to talk to Fabius and Sujo. Whatever that means. Triforce guy points out it's shorter to capture, too. Yeah, cuz you don't have to wear them down as much. Yes. Um, environment overview. So, Greg,",
            "start": 3206.36
        },
        {
            "text": "to talk to Fabius and Sujo. Whatever that means. Triforce guy points out it's shorter to capture, too. Yeah, cuz you don't have to wear them down as much. Yes. Um, environment overview. So, Greg, when you get a new phone Uhhuh. do you just have them transfer the photos over? Yeah, I just have a backup in the cloud. So, I just take the phone, walk out, and then Oh, so you're literally just getting a new phone. You're not doing the the transfer stuff. No, I do. I just do it. I don't have them do anything. I just Thanks for the phone, and then I just Well, yeah. Yeah. Yeah. You're pulling it from the cloud. You're not doing it like here's my phone. Then he plugs into the other phone and you wait there for an hour while they trans. No, no, no, no. All right, good to know. Good to know. That's all via the iCloud. That's right. You got to pay for that. Yeah. Okay, I'll double check. But it's like every other Apple thing where they're taking 10 bucks a month. I guess that's part of this. I",
            "start": 3264.16
        },
        {
            "text": "all via the iCloud. That's right. You got to pay for that. Yeah. Okay, I'll double check. But it's like every other Apple thing where they're taking 10 bucks a month. I guess that's part of this. I don't I mean, I'm already giving them 10. I know that. But like I I just don't mess with iCloud that often, so I have no idea what that looks like. Are you putting something up or did you put something? I have to go talk to somebody. So I'm gonna go do that. Never do that. What? Tyler's new goof. Give her my phone. Where are you? Aren't I trying to go this way? I always trade my old phone. Gives me a discount. Mike's definitely already paying for it. Somebody says, \"Oh, 100%.\" Yeah. For more space, you got to give them money. It's crazy. I give them a lot of money. Probably find my Apple subscriptions right now for you. Oh, okay. That I Okay, cool. Over here. You guys can go hunt something if you want. Oh, never do the Verizon transfer from old phones to new phones. I do that every single",
            "start": 3315.04
        },
        {
            "text": "right now for you. Oh, okay. That I Okay, cool. Over here. You guys can go hunt something if you want. Oh, never do the Verizon transfer from old phones to new phones. I do that every single time. Tyler, what the [ __ ] do you mean? When did this happen? Just do it through Apple. Oh, no. I've never gone to Apple. I always go to Verizon. I'm a Verizon kid. We have a family plan. You know, we have a family plan. We have a family plan. What do you want me to do? Oh, yeah. Bring that pizza in here. Cool. G. Pizza time. How are you? Okay. Wants to talk. Sujo wants to talk. Anybody need a drink? I'm good. Can I have a Diet Coke, please? Thank you. You guys can all come in. Okay, let me go talk to this man. Oh, I You know what? I have a dugimma here for Yay. Nine or higher. That's You can do that. Yeah. You're hunting right now, aren't you? Yeah. I'm accepting prepping. I'm putting that up there. So, whenever Joey or Mike wants to jump on that, you got that. I am skipping my way through this",
            "start": 3366.0
        },
        {
            "text": "Yeah. You're hunting right now, aren't you? Yeah. I'm accepting prepping. I'm putting that up there. So, whenever Joey or Mike wants to jump on that, you got that. I am skipping my way through this dialogue as fast as I can. This is not any different than anyone I play by myself, which is I guess not that often. You know, Mike and I don't Yeah, come on. Tell them look at the cut scenes ever. Tell them tell them how we do it. Thank you, Cool G. Cool. I'm going to make sure we get after this pizza, please. I love my I love my armor. Tyler, next time we see each other at an event, you're going to have to explain the uh Verizon thing to me. You're going to have to let me know what's up. You're going to have to let me know. You just don't need these people anymore, Mike. You know what I mean? What? Going to Ver Yeah, but see, here's the thing, Greg. because you have the Verizon plan. You go to Verizon. Your phone has the upgrade plan. I get to upgrade for free, right? That's helpful. So, I",
            "start": 3445.76
        },
        {
            "text": "Going to Ver Yeah, but see, here's the thing, Greg. because you have the Verizon plan. You go to Verizon. Your phone has the upgrade plan. I get to upgrade for free, right? That's helpful. So, I don't have to pay $1,000 for the brand new iPhone. I also can put my old phone towards the new phone. So, I get $400 off the new phone, which is all, you know, they're playing. You can do all of this through Apple. Mhm. Those stores are intimidating. You got to have an appointment. There's a lot of jabronies there. You don't need to do it through the store. It's a lot of things. They send you a little coffin for your phone. You do it all at your desk. Oh, you want me to have them send me something? I got to send something back. Uh-huh. I don't send things back. I don't do that. It's safer for Mike to just go in. Mhm. Half the time when you go in though, they don't have the model you want, so they have to mail it to you anyways. Yep. Feel good part of the stream. Greg, should I buy WWE 2K25?",
            "start": 3511.44
        },
        {
            "text": "to just go in. Mhm. Half the time when you go in though, they don't have the model you want, so they have to mail it to you anyways. Yep. Feel good part of the stream. Greg, should I buy WWE 2K25? Ask Panda Finn. Oh, yeah. I haven't played much to be honest. I've just been so busy on reviews. Uh, but obviously I know the guys loved it. I usually love it. Don't play the island. That'd be my only advice. Why do we hate the island? Boring. Um, yeah, just boring. It's them opening the door for you to pay. So, you could do it now, but it wouldn't really help you. But like from here on out, they're going to, I bet, pour more and more into it to get you to pay. We hate that. Mike, you going to join up on this Duguma investigation? What you doing? I'm going to face this pizza. Okay. I mean, run an ad. All right. It's a good question. We'll be right back after a word from our sponsors. Great call. This episode's brought to you by Lost Skies. What would you do if you woke up and the world",
            "start": 3556.4
        },
        {
            "text": "run an ad. All right. It's a good question. We'll be right back after a word from our sponsors. Great call. This episode's brought to you by Lost Skies. What would you do if you woke up and the world around you was now floating high in the clouds? Lost Skies is the new openw world survival like that puts the power of exploration and choice in your hands. Use the physics-based grappling hook, glider, and your own custom airship to traverse the remains of this fractured world and uncover its mysteries. You and up to five friends will harness the power of ancient technology to survive the hostile islands that scatter the horizon and the threats that lurk in the sky itself. The battles are intense, so it's up to you to build a sky ship to shelter you in fierce storms and take the battle to gigantic monsters. Want to take a break from fighting in the skies? Use the intuitive island creator and share your builds with the community. Head over to Steam and Wishlist Lost Skies today and",
            "start": 3617.48
        },
        {
            "text": "to gigantic monsters. Want to take a break from fighting in the skies? Use the intuitive island creator and share your builds with the community. Head over to Steam and Wishlist Lost Skies today and discover what's lurking beyond the horizon. This episode's brought to you by Monaco 2. Gather your crew, plan your heist, and let the chaos unfold in Monaco 2. Return to Monaco, a city teameming with excellent scores and gullible marks right for getting parted from their prized possessions. Go it alone or tackle heists as a team of four with online and local co-op. Just remember, even the bestlaid plans can blow up in your face, so you'll have to stay on your toes. Monaco 2 is the sequel to the cult classic Monaco. What's yours is mine that expands on every aspect of the game. New characters bring unique abilities and play styles to help you escape the heat. And with new modes and procedurally generated levels, every run is full of surprises. The heist is on when Monaco 2 arrives on Steam,",
            "start": 3663.68
        },
        {
            "text": "unique abilities and play styles to help you escape the heat. And with new modes and procedurally generated levels, every run is full of surprises. The heist is on when Monaco 2 arrives on Steam, Xbox, and PlayStation on April 10th. Y'all know how important it is to wishlist these games. It helps the developers so much. So, please wishlist Lost Skies and Monaco 2. This episode is brought to you by Rocket Money. You sign up for something, forget about it after the trial period ends, and then you're charged month after month after month. The subscriptions are there, but you're not using them. In fact, 85% of people have at least one paid subscription going unused each month. Thanks to Rocket Money, you can see all of your subscriptions in one place and cancel the ones you're not using anymore and save more money. Rocket Money has helped multiple members of Kind of Funny learn that they're still paying for things they totally didn't even realize. You know who I'm talking about. Rocket",
            "start": 3711.04
        },
        {
            "text": "and save more money. Rocket Money has helped multiple members of Kind of Funny learn that they're still paying for things they totally didn't even realize. You know who I'm talking about. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money has over 5 million users, and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year when using all the apps premium features. Cancel your unwanted subscriptions, and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunnday. That's rocketmoney.com/kindafoney. And welcome back everyone to more Monster Hunter on today's afternoon stream. We're talking to Greg about his fun trip to Chicago coming up. Don't forget you can see Greg in Chicago for a one night only affair. It's going to be a great time. A lot of awesome best friends traveling from all over",
            "start": 3756.64
        },
        {
            "text": "about his fun trip to Chicago coming up. Don't forget you can see Greg in Chicago for a one night only affair. It's going to be a great time. A lot of awesome best friends traveling from all over the place and some great guests as well. So go see him. Uh what is it? Kind of funny.com/ Chicago. That's right. Now, Mike, we've all been patiently waiting for you to get into the member lobby thing. You didn't and somebody else got in here. So, I'm boot skyc. No, no, get let him go. It's crazy cuz I'm seeing you on my screen, so I'm like, \"Oh, nobody's moved at all.\" We're somehow on the pokey layout. I did. Yeah, but I think I might uh open your departure window, Joey, and switch yourself to ready to go. There you go. How do I open? Oh, is it this depart now? Are we on Are we on Pokemon overlay? Crazy. Okay, let's hunt these hunt these little furry guys. Oh, a whole pack. A whole pack of them. I dugged them. They should get out of here momentarily. Got it. Okay. I want to be on fire. We",
            "start": 3806.0
        },
        {
            "text": "Crazy. Okay, let's hunt these hunt these little furry guys. Oh, a whole pack. A whole pack of them. I dugged them. They should get out of here momentarily. Got it. Okay. I want to be on fire. We got a turret for Lauren's talking [ __ ] in the YouTube chat now. Sorry, Lauren. Oh, you you got off light in the Instagram story. I know I did. Mad at me and Mike now. What? Hi, Lauren. Hope you're doing well. Okay. Oh no. Smooshed. Okay. Okay. Time to get back to it. Isn't this the thing that you needed? Yeah. Mice's not in it. Oh, I need it. I need Oh, you want the other? Yeah, the next bow gun. I need some stuff off him. I guess I should look to see what I need. What are you upgrading, Greg? What are you working on? I mean, I'd like to finish off my Arcel armor uh with the high level armor bit of it. Uh and then when I we did that last one, I was like, \"Oh, you know what? I'm going to use the bow gun.\" And I was like, I haven't upgraded a bow gun cuz I haven't used it in 50 hours of",
            "start": 3874.08
        },
        {
            "text": "bit of it. Uh and then when I we did that last one, I was like, \"Oh, you know what? I'm going to use the bow gun.\" And I was like, I haven't upgraded a bow gun cuz I haven't used it in 50 hours of gameplay. So, I need to look at that. And so, that's what I was This guy's part of the next one for me. But I'm just here to hit. No, I guess I need to upgrade my bow again probably. But I don't know if you saw Greg, but Red Hudson in the YouTube chat is just booked their tickets to go to Wrestlemania 41 press. Oh, Red Hudson. That's awesome. They hide at Soncho West and Santi Zap Chris Van for us. How far out are we from Wrestlemania? Just two weeks. Something stupid like that is 420. Blaze it. Shout out. Also Easter. Yep. Blaze it. Jesus. Jesus. Can't wait to see who the WWE will resurrect from the dead. How you enjoyed the uh European tour, Greg, with the different timing? Oh, it's it's always it just bewilders me when I look over into the conference room and Raw is on or Roger's watching",
            "start": 4012.4
        },
        {
            "text": "the dead. How you enjoyed the uh European tour, Greg, with the different timing? Oh, it's it's always it just bewilders me when I look over into the conference room and Raw is on or Roger's watching Cena and Cody and I'm like, \"Oh, oh, right, right, right, right.\" You know what I mean? Like, oh, this on at noon our time now. Yeah. I don't mind it. I'm glad they're getting a taste. Yeah, content's been great. My favorite was during GDC when everyone took over the conference trying to balance that with the [Music] stream. Degeneration Max says, \"What are the Wrestlemania planes in the office?\" That's a great question. I don't know if we'll watch it here. Yeah, Tim's going. I know. Yeah. Uh, and then yeah, you'd look to Roger to organize something, but I I'll be watching it on a delay like last year where I'll let Ben go to sleep before I turn it on. Yeah, I imagine maybe Bless Roger Mike. I'm always down to watch especially Wrestlemania, Royal Rumble. It's always fun. What if you were",
            "start": 4098.72
        },
        {
            "text": "last year where I'll let Ben go to sleep before I turn it on. Yeah, I imagine maybe Bless Roger Mike. I'm always down to watch especially Wrestlemania, Royal Rumble. It's always fun. What if you were nice to me? Monster Hunter update number one, guys, on Friday. Very exciting. Getting new monsters, getting that gathering hub. It's going to be all about him. I'm so excited for you to explain it all to me next time. I assume probably for your birthday. I've been in such like a kind of gaming slump lately where like nothing's really felt like the right thing, but I should just jump in and play more Monster Hunter. Yeah, maybe now that all of my friends aren't hanging out in LA without me together, I can uh convince them that we should hang out online. Bam. Becomes a member for 5 months on YouTube and says, \"Greg, do you have a plan B for tomorrow?\" The [ __ ] does that mean? There's one plan. And I cash in the stars in the bank. I beat him. I'm suddenly up on stars over him. It's great.",
            "start": 4161.36
        },
        {
            "text": "and says, \"Greg, do you have a plan B for tomorrow?\" The [ __ ] does that mean? There's one plan. And I cash in the stars in the bank. I beat him. I'm suddenly up on stars over him. It's great. Yeah. What a plan B. I throw the briefcase at his head, murder him. I've thought about it, but that's not a plan. That's That's premeditated murder. They put you away for life. I thought about it. I've thought about how I could lie. I couldn't lie. I'm like, \"All right.\" Yeah. Now Now we have it on record. Yeah. No plan to murder Tim tomorrow. Triforce guy says, \"What are the stars tally so far?\" Oh man, if memory serves and I'm rusty, I think it's I have Tim has six, I have three, andy has one. Yeah, which isn't even really his star. So, I can literally move places with him overall. It would be great. Yeah, it isn't even Andy's star, but Andy would feel bad enough for it. He makes a fool with himself every like the Spurs. Couldn't win if his life depended on it. Dang. Tell me the last time",
            "start": 4251.52
        },
        {
            "text": "great. Yeah, it isn't even Andy's star, but Andy would feel bad enough for it. He makes a fool with himself every like the Spurs. Couldn't win if his life depended on it. Dang. Tell me the last time they won is right. You know what I mean? Not this decade. off the small monsters as well. And B, Mike, is anything coming? Oh, look at he's got a custom one. Greg is taking stars from Tim. Nice. I set a trap. There we go. Love that. Good job, everybody. This is I feel like most of my armor is this disha guy with all this fun fur. So maybe I'll be able to make something else. We finish speed out there. [Music] a trophy. Complete your first investigation. I don't know what that means. Is Tim the only KF member going to Mania? No. Snow bike Mike sneaking into catering again. I wish. I really wish. Yeah, it's so much more expensive than it was last year. I was willing to throw it all down for it, but uh when when when we first got asked, everybody in the office said no. Yeah. And I was like,",
            "start": 4298.0
        },
        {
            "text": "Yeah, it's so much more expensive than it was last year. I was willing to throw it all down for it, but uh when when when we first got asked, everybody in the office said no. Yeah. And I was like, \"Oh [ __ ] that sucks.\" And then Tim was like, \"Oh, now I'm going a month later.\" And I couldn't convince Roger to want to go. Roger. Roger didn't want to go at all. I was like, \"Fuck, I really wanted to go to this one in Vegas. Zed's playing, you know, like all all the fun Vegas activities that I could have finally have done would have been this weekend.\" Yeah. Go to the Omni Nightclub. Oh [ __ ] they got the day pool party going on before WrestleMania. I would be at that. But [ __ ] Roger, I hate him. If it was in LA again, then it's like would be a little bit easier for me to justify the money because then I wouldn't have to pay for lodging and the flight is cheaper. But I also just like don't I go to wrestling stuff for the spectacle and the fun, but I don't follow it enough, I think, to",
            "start": 4387.04
        },
        {
            "text": "because then I wouldn't have to pay for lodging and the flight is cheaper. But I also just like don't I go to wrestling stuff for the spectacle and the fun, but I don't follow it enough, I think, to justify. Mhm. Plus, I got Beyonce tickets. I have no extra money to spend. I was given a Mike, were you following any of the Miami music stuff this weekend? Ultra. Ultra is the kickoff to summer. Of course, as many of you know, Miami Ultra is the hottest spot for music, fashion, and just the culture. And then we go right into Coachella, and then we kickstart the summer. So yeah, I was watching a lot of Ultra, a lot of rain, very wet at Ultra, but of course you have some of the hottest DJs around. They had a really cool one where they were showing behind the scenes of the DJ from the like behind them looking at the deck. And so that was pretty sick of like different songs and what was going on with the the actual DJ booth. Loved that. Uh I really appreciate that a lot of these concert",
            "start": 4433.36
        },
        {
            "text": "behind them looking at the deck. And so that was pretty sick of like different songs and what was going on with the the actual DJ booth. Loved that. Uh I really appreciate that a lot of these concert festivals now let you watch them online when you can't afford them or go to them. So that's cool. So yeah, uh we're set. We're ready to rock, y'all. I watched some of the Domala and John Summit stuff. Fun. I don't really know anything about John Summit. John Summit's hot right now. Red hot right now. I like that he has a little list. It's cute. He's so hot right now. It's ridiculous. Um, but I've been listening to more Dumb Doll lately. kind of like dip in and out of musical genres. Let's go do one more dish. Okay, this commencing quest by order of the guild. What the [ __ ] How do I I don't Tomorrowland is better. Well, I mean like Tomorrowland might be better, but it's not the kickoff of summer, is it? Where's Tomorrowland? Let's find out. How do I exit the mission? That Tomorrowland's",
            "start": 4489.2
        },
        {
            "text": "Tomorrowland is better. Well, I mean like Tomorrowland might be better, but it's not the kickoff of summer, is it? Where's Tomorrowland? Let's find out. How do I exit the mission? That Tomorrowland's not till July. Slap Daddy. Uh I like just abandon it. I used to. It's been a while. I haven't done a while. Um, it's not that. What happens if I do this this way? You got it. Second tab. Joey, thank you. In Belgium. [ __ ] dude. Are you kidding me? Okay. Well, let's [ __ ] let's go to that. I'm with you. Thank you, Mr. Showtime. Mom says, \"I used to work in hospitality and live in the area where Ultra is held, and I felt like I would go into bunker mode when it came around. Air felt pre-apoc apocalyptic.\" I get it. was what is it for Ultra? It's just like a giant concert festival. Do they mix Ultra with the What's the other one where they have the big art fest? What's the Miami art? That was like a month ago. That's a different one. Yeah. Yeah, that's a different vibe. Um, you got to be",
            "start": 4565.2
        },
        {
            "text": "Ultra with the What's the other one where they have the big art fest? What's the Miami art? That was like a month ago. That's a different one. Yeah. Yeah, that's a different vibe. Um, you got to be you got to know somebody to know somebody. Yeah, but it's all I feel like that probably that whole month is probably just nuts. And then yeah, Momo is also talking about spring break. I thought they said stop coming. I thought Florida put their boot down and was like, \"Don't come here anymore. Go somewhere else.\" Can you really stop people from going to Florida for them? Are puzzles December? Why did I feel like I just saw a bunch of posts about it like a month ago? Kicking off summer would be Vegas in May. When you're when you're part of the EDC scene and just the festival scene, it's a long summer. It's a long It's a long It never ends. Oh, I hate being on fire. Stop, drop, roll, Joe. I'm rolling. I'm rolling. All right, Papa. Write me down. Papa, write me down for Tomorrowland one day.",
            "start": 4646.48
        },
        {
            "text": "summer. It's a long It's a long It never ends. Oh, I hate being on fire. Stop, drop, roll, Joe. I'm rolling. I'm rolling. All right, Papa. Write me down. Papa, write me down for Tomorrowland one day. I'm still trying to convince Nick to go to Coachella with me. Aren't we done with Coachella? I thought we was like a society. Not when you have Lady Gaga, Charlie XCX. and someone else performing there. Someone else. Someone else that's massive. What's my lineup right now for that one? I think Coachella's It's hard because I feel like all of the festivals kind of vaguely or have a lot of overlapping acts between like Coachella and Lola and um Lady Gaga, Charlie XCS, Megan the Stallion, but it's Posty and Green Day. You don't like Posty? I love Posty. I don't like the country act. Oh, I agree. What's the one where they're gonna have Sabrina Carpenter, Charlie XCX, and Chapel Ron headline? It's something in Spain. I have no idea. Are y'all doing outside landsets at home? See, the way that",
            "start": 4701.12
        },
        {
            "text": "What's the one where they're gonna have Sabrina Carpenter, Charlie XCX, and Chapel Ron headline? It's something in Spain. I have no idea. Are y'all doing outside landsets at home? See, the way that Momo feels about Miami during spring break and uh Ultra is kind of how we feel about except Mike. I'm Mike. I went to Outside Lands with Chris Anka last year and I had an absolute blast. And I think Outside Lands in the park is one of the coolest venues and events you can go to. And they got a pretty good lineup this year. I'm not going to lie to you. They got a pretty good lineup. When is it? I always forget. It's usually August, September, right? Outside Lands 2025 is coming your way August 8th through the 10th. They got Tyler the Creator, DOAT, Posier, John Summit, Anderson Pac, Vampire Weekend, Glass Animals, Gracie Abrams, Jamie XX, Doi, and more. Uh, Ludicrous will be here as well. Doi would be so fun to see. I would I would go to outside lands again after that experience with Chris",
            "start": 4760.96
        },
        {
            "text": "Glass Animals, Gracie Abrams, Jamie XX, Doi, and more. Uh, Ludicrous will be here as well. Doi would be so fun to see. I would I would go to outside lands again after that experience with Chris Anko. Does Chris have to come again? Um Chris, you Chris come back. No, not for this one. Only if he likes somebody. Chapel Realm was an experience. One that we'll probably never get to experience again. It was a great time. Chris Lake. Oh, there we go. Oh, Chris Le says, \"Has Greg tried the new Gaga album? It's very T-Swift.\" The new Gaga album is very good. There's one song in particular that feels very Taylor. Jen and I started it and she didn't vibe and but and I also I think three songs in had no strong opinion one or the other. Yeah. So that was a skip on our part. I love the new Gaga album and I'm not really a I don't really like her traditionally. Sure. But I'll give a shot on the way home. She's a fun one. I'll send you how bad do you want me needs to be where you started. Okay. Too",
            "start": 4828.8
        },
        {
            "text": "and I'm not really a I don't really like her traditionally. Sure. But I'll give a shot on the way home. She's a fun one. I'll send you how bad do you want me needs to be where you started. Okay. Too familiar. I'll keep you in mind. And I'll let you know when they break down the days and I get to know who's on what day. Then I'll make my move cuz like Doaat I would love to see. John Summon I'd like to see. Doi I'd like to see. And then she's also so good. So like yeah there there's a couple of lists here of like oh I'd go see them. Is Charlie there? No. Gracie Abrams is I think skippable for a festival for me personally even though she is a Tay daughter as we lovingly refer to them. I think spring carpenter would be fun too, but I think she Lola or Coachella. I also want to go to Al or uh Cali Roots this year down in Monteray. Cali Roots is the uh big reggae festival down there. And they got all of my people I love seeing. Yeah. I feel like all of my like high school and college bands",
            "start": 4881.44
        },
        {
            "text": "Cali Roots this year down in Monteray. Cali Roots is the uh big reggae festival down there. And they got all of my people I love seeing. Yeah. I feel like all of my like high school and college bands are also now reuniting and playing together. Like all of my emo bands. Brand new was touring again, which Barrett and I were talking about, which is crazy because he got hella cancelled and pretty much everyone stopped. Well, not everyone, but a lot of people, enough people stopped listening to them and are Oh, [ __ ] Joey. Yeah, we all my homies hate Jesse Lacy, which is a bummer because Brand new is my favorite band for like 10 plus years. But if you're wondering where I'm at, chat, I'm in the weapons training area to just reg grasp the weapon back in the lab. I'll be back grinding it out. I had a I really needed a just a reset moment here. Something corporate's also touring and they're hoping for McMahon. Something corporate. I've never heard of that. That's a great name. Oh, I feel",
            "start": 4946.96
        },
        {
            "text": "I had a I really needed a just a reset moment here. Something corporate's also touring and they're hoping for McMahon. Something corporate. I've never heard of that. That's a great name. Oh, I feel like you would really like them. That's me. In like a in like a bear recommends music to you. Yeah, sure. Sure. Sure. Weezer adjacent. Okay. Hell yeah. Okay, I'm back. Let's do this again. Oh, and then they're saying that you meant Prima Vera Barcelona as the big Spain one. Oh, is that the one with the three of them? Really? I think that's what chat's saying. Yeah, that one's going to be crazy. That one has all three of the girls. They're calling it the Powerpuff Girls cops. Yeah, I saw her. I think Chapel said that on podcast. That's all three of them are going together. That's cool. I mean, that truly is them. So funny. And Barcelona is just fun. If you were going to pick a city to go hang out in for a festival, it's not that one. Yes. All three nights. Charlie XCX in the Sabrina in the",
            "start": 5007.12
        },
        {
            "text": "that truly is them. So funny. And Barcelona is just fun. If you were going to pick a city to go hang out in for a festival, it's not that one. Yes. All three nights. Charlie XCX in the Sabrina in the Chapel realm. You have the craziest weekend of your life. I wish that I was cool enough to go to a Charlie XX concert. I will appreciate her music from afar, but I know that that is not that's I don't do enough drugs, frankly. I'm not that much of a club kid. You better run. All right, I figured it out. I figured the buttons out. I'm back. Took me a minute. I'm still I'm still only doing it like 60% correct, but I'm doing it, you know? I'm back to where I was. I'm here to dance. There's not enough dancing. Put the phone down and dance at concerts. That's Mike's rules. Wow. Put the phone down and dance. You should have saw I don't going crazy with it. I know. It is wild to see like all the videos and stuff and it's just a sea of put the phones down and dance. Ooh, trapped. Oh, Christian",
            "start": 5090.24
        },
        {
            "text": "and dance. You should have saw I don't going crazy with it. I know. It is wild to see like all the videos and stuff and it's just a sea of put the phones down and dance. Ooh, trapped. Oh, Christian JPEG says, \"I went to Charlie's show sober and it was great. So much dancing. Hell yeah.\" I would go crazy in that one. Roger. It's so funny cuz Roger and I talked about it before the album came out cuz we were like, \"Oh, that would be fun to go in SF.\" And then the album came out. I was like, \"Oh, this is for the cool kids. I think I'm too old for this now.\" Also was with Troy Sabon, who I also know. Then they had Addison Ray as well opening up for too. That was a little three people that D Pepsi song pretty big. Pepsi hit. It hit. That song hits. That song hits cuz I I can't confirm or deny that. I can tell you that I don't have many I don't have enough photos. How about that? I don't have enough photos. Yeah, they call you the captain of the cannon. Exactly. Captain of the cannon. I can",
            "start": 5196.56
        },
        {
            "text": "I can tell you that I don't have many I don't have enough photos. How about that? I don't have enough photos. Yeah, they call you the captain of the cannon. Exactly. Captain of the cannon. I can look back on that day and say I don't have enough photos. Should have taken more. There we go. Lord the Sugama. This thing's incredible. Let me get all my goodies. Oh, you see hangman's comment, Greg. That's pretty cool. I see. We don't have to restart. That's nice. He says, \"Greg, have you tried your hand at other weapons? The Artisan system or Ardian system uh lets you craft other weapons at Rarity 8 directly, so you don't have to start from scratch.\" I've seen it, but as I never uh did anything but blades, I never actually went into it. Is there there's no like incentive to try new weapons in this the way that there is with Yeah, I haven't seen dailies of like use a long sword, do whatever. They do have, you know, qu the daily quest and stuff though, so it might I maybe I've missed it or",
            "start": 5259.12
        },
        {
            "text": "this the way that there is with Yeah, I haven't seen dailies of like use a long sword, do whatever. They do have, you know, qu the daily quest and stuff though, so it might I maybe I've missed it or I'm not paying attention. Mhm. Cuz I am always surprised by how much I like the sword and shield in uh the mobile one. I forget what it's called. Why can't I remember? No, thank you. Um but I've never tried it here. But I feel like I'm just committed to the bow. I'll go look at the artisal system now. Oh, I like that. Artisal. These are arteasonal weapons. Okay, now I got to go talk to that guy again. Oh, I want insect glaive and bow user here. What are your all secondary weapons? Insect glaive for me. That used to be my old main one. Light bow gun. I think mine is dual blades. Maybe I ver I only ever accidentally swap them on my sacred. I don't ever use it intentionally. Okay, let's get all [Music] my [ __ ] out of here. Liquid. Oh, I need more. potions and then I should [Music] probably",
            "start": 5336.0
        },
        {
            "text": "ever accidentally swap them on my sacred. I don't ever use it intentionally. Okay, let's get all [Music] my [ __ ] out of here. Liquid. Oh, I need more. potions and then I should [Music] probably cook some meat. Good call. That's a better bogo than what I was using. Thank y'all. Cook some meat. There will be challenge quests to get some rewards and race for the fastest time. This is all done with pre-built sets. If you do those quests, you'll be hunting with different weapons. Might even find a new favorite. Ooh. The only problem is that if I try something one time and I'm not automatically good at it, try it again. This is why my time playing guitar was shortlived and an array of other uh hobbies I've picked up in the last 15 years. Okay. Damn. Okay, let's go. I'm with y'all. Wherever you want to go. Drop something, Joe. Oh, yeah. I'm going. Drop like it's hot, Joe. Here we go. It's like one of the story quests. Oh, okay. Maybe. Where am I going? This guy's fun. Nurilla. Oh, you're",
            "start": 5416.84
        },
        {
            "text": "want to go. Drop something, Joe. Oh, yeah. I'm going. Drop like it's hot, Joe. Here we go. It's like one of the story quests. Oh, okay. Maybe. Where am I going? This guy's fun. Nurilla. Oh, you're in the pit now, Joe. Is that good or bad? You're in the pit now, Joe. Is that good or bad? Why do you You're in the pit, Joe. This is the pit. This sounds scary. The pit, Joe. Oh, it has scary music. Uh, the flare should go off. So, okay. Okay. Ready to help. Oh, no. I'm away. Scary. Oh, Joey. I'm in the pit. He's in the pit. You look And I kind of know the buttons this time, which means I'm good. This is very exciting for me. Oh, okay. Okay, sir. Joey, he's dominating me. I'm, you know, I'm spamming my arrows the best of my ability. He is dominating me. Coming. He did look like he was directly on top of you for a lot. Oh. Ooh. You shoot webs. I do like that you have these fun purple spikies though. Yes. Oh. Oh. I hate these little sticky things. Let me out. Oh, okay. I guess that's one way",
            "start": 5525.12
        },
        {
            "text": "on top of you for a lot. Oh. Ooh. You shoot webs. I do like that you have these fun purple spikies though. Yes. Oh. Oh. I hate these little sticky things. Let me out. Oh, okay. I guess that's one way for me to get let out. Come here. Oh, he's just dominating me all the time. All the time. Thank you. Oh, we're doing some real good work. Let's [Music] see. Uh, why anyone butt me? He's a spider. It's in his nature. His little spiky jaw thing. Yeah, his teeth or whatever. Yeah. I want to say mandible, but I don't know if that's actually Do zoo books still exist? Did you Were you ever a zoo book person? Love a good zoo book. Explain a little bit. Um, it's like a kids magazine, but it was like all about different animals and stuff like that. Feels like a doctor's office. 100%. Yeah, doctors are dead. Was that in highlights? Highlights. Yeah, my mom got banned out of highlights subscription. He loves it. Oh, yeah. This is like just all about animals. They always had [ __ ] two cans and",
            "start": 5647.52
        },
        {
            "text": "are dead. Was that in highlights? Highlights. Yeah, my mom got banned out of highlights subscription. He loves it. Oh, yeah. This is like just all about animals. They always had [ __ ] two cans and [ __ ] on the covers. [Music] Got him. That was crazy. Climbing them out. Yep. I was expecting more movement. I feel like we usually have to like run around. Not in the pit. Not in the pit. Oh, in the pit. Yeah, this is a special spot. Have you started watching the pit? How do I put my weapon away? I don't like those shows. Too much blood. Oh, I don't like the whole we're in the emergency room, blood flying everywhere. I don't like those. Yeah, big big no no on that one. Huh? We learned something new. I also saw a lot of Grey's Anatomy in my day. I I don't got time for that. I've seen a lot of in hospital romance. I'm pretty good on that. Okay. It never goes out of style though. There's always some hospital show. Always. McDreamy Mc Steamy Mc Steamy There's a lot of other ones too but I",
            "start": 5806.64
        },
        {
            "text": "of in hospital romance. I'm pretty good on that. Okay. It never goes out of style though. There's always some hospital show. Always. McDreamy Mc Steamy Mc Steamy There's a lot of other ones too but I don't Ally whatever that What was her name? What was the main lady's name? Addison. No, that that was Meredith Gray. Meredith. Okay. Same name. Ex-wife. Oh, my girlfriend is in healthcare and the pit made her cry. Zachie G. Damn. I do hear from like a lot of people that it seems to be like the most realistic take on hospital things. Remember House MD? Oh, hi. Gosh, there was like a semester or two in college where that's all my roommates were watching. So, every time we walked in and out of our room in like the living room part, somebody was always watching house DVDs. [Music] Um, okay. I want all that. All [Music] that. Okay, let me skip through this little cut scene. Lurking Shadows. Philip G. Philip Guy says, \"Why are you watching Grey's Anatomy, Mike?\" Golden Triangle. It's a great",
            "start": 5868.0
        },
        {
            "text": "all that. All [Music] that. Okay, let me skip through this little cut scene. Lurking Shadows. Philip G. Philip Guy says, \"Why are you watching Grey's Anatomy, Mike?\" Golden Triangle. It's a great show. You know what I mean? Golden Triangle. It's a great show. Great show. I still don't know what that means. You're in the golden triangle. It's time, money. Time, money, and health. I forget what it was. Time, money, and health. Mike, all of that. Living fine. Let's see if I can upgrade. Got something in mind? This cannot be forged or upgraded yet. Great. Love that for me. Greg, did you get your Dugima gear? Oh, no. I'm still working on stuff. How much How much more do you need? Uh, well, first off, it looks like I'm wearing old gloves. Hold on. Uh, and then uh Oh, that's my Arcel [ __ ] right? Cuz the Arfeld I'm thinking of the weapon, but I don't need the weapon anymore because now I did the artisal weapon. So, I got no answer for you there. Don't need to worry about it. Just need the I",
            "start": 5933.04
        },
        {
            "text": "Cuz the Arfeld I'm thinking of the weapon, but I don't need the weapon anymore because now I did the artisal weapon. So, I got no answer for you there. Don't need to worry about it. Just need the I need I need my arc my arc veils. Mark veiled. But I need a lot of those guys. And then I need to look into this glove business that apparently I'm wearing old gloves cuz the chat was like, \"You need to change your gloves.\" I was like, \"What are you talking about?\" And I looked, I'm like, \"No, these gloves are old. I don't know why they're still there.\" Waste every second of my life with you. Um, Greg, what can you tell me about these different types of armor spheres? Uh, they upgrade your stuff faster. Okay. Better. Uh, you know, you'd want to keep your coolest ones for your later armor. Your high gear armor now, right? Anyway, right. Yeah, the amount of We're playing this, Joey. Don't worry about it. Just put the orbs in and fill it up and have fun. We're not We're not here trying to run a",
            "start": 6021.52
        },
        {
            "text": "gear armor now, right? Anyway, right. Yeah, the amount of We're playing this, Joey. Don't worry about it. Just put the orbs in and fill it up and have fun. We're not We're not here trying to run a world record at any stretch. No. And I really do like the look of this armor. And I don't know that I'm going to find anything that I'm going to like more. Oh, what if I just do that? Yeah, I like this one. Trying to get out of here, you know. Hello. Cool. What if I do that? And then what if I do this guy that if I can do one of those? Cool. Cool. Oh, I can transmock. I love learning so many things. Okay. Okay. Now I just have to go back and investigate things. So we can do whatever we want now. Oh, okay. I like that. Should we hunt uh Greg's cover athlete? No, you guys aren't high enough for it. Or Joey isn't for sure. Oh [ __ ] Tragic. Then Joey, pick an animal. Let's go hunt it for you. Okay. Accept the optional quest. I don't want to. Wouldn't tell me what to do now. Greg, I'm checking",
            "start": 6067.28
        },
        {
            "text": "Or Joey isn't for sure. Oh [ __ ] Tragic. Then Joey, pick an animal. Let's go hunt it for you. Okay. Accept the optional quest. I don't want to. Wouldn't tell me what to do now. Greg, I'm checking out the comments over on the YouTube channel about uh the Switch 2. Okay. Jonesy writes in and says, \"Sivate the mouse feature.\" And I would hate that. Uh because Civ to me has already moved on to controller support. Well, then I don't really look at Civ as like an intensive mouse supported game. Sure it is. But like I want more of a real RTS that really requires the mouse and keyboard over the controller. But uh Civ is not a bad call. Civ is not a bad call at all. Do you think Civ will be there tomorrow? It's already on Switch, right? Civ the other ones. Yeah, I think so. Well, yeah, the most recent one. Yeah. Not this this newest one. Seven said, I think launched day and day with Switch, right, chat? Am I wrong? Uh I would say no. I think it's I mean I don't think Yeah. I I just don't to",
            "start": 6186.08
        },
        {
            "text": "recent one. Yeah. Not this this newest one. Seven said, I think launched day and day with Switch, right, chat? Am I wrong? Uh I would say no. I think it's I mean I don't think Yeah. I I just don't to your point. Why would that be a big deal for them to be like and now I don't care? Watch you click the buttons in Civ is right. Okay. I got to go now over here in the chat. Uh Mark 11 says Joey isn't high enough or Greg isn't good enough. Protector L. Oh [ __ ] I'm not wrong. Oh [ __ ] No, no, no, no, no. This isn't me. I I need help. If is there a way for us to go do it in the open world? Because when I try to do it off the investigation stuff, it's like Joey can't join because she's done it. I'm pretty sure it would lock her out even if we went to open world. Yeah, I haven't [ __ ] around with that much from review periods. Should says Greg is right. Thank you. So now get [ __ ] Munch Civ 7 is on the Switch. Wow, I didn't know that League on console. I'm trying to see. I want more",
            "start": 6245.12
        },
        {
            "text": "with that much from review periods. Should says Greg is right. Thank you. So now get [ __ ] Munch Civ 7 is on the Switch. Wow, I didn't know that League on console. I'm trying to see. I want more Pokemonite. Put that get that Pokemonite in the Gen One upgraded to the Gen 2 switch. Joe, this is Got to love Pokemonite. Um, I haven't picked anything, but you can do whatever. That's level 41. Yeah. No, somebody's running. I'm going to jump. Get up in there, Greg. We're watching your stream anyway, so get get to going. Me and uh Joey will I can support Joey. I can also play with whoever. No, I'm here. I ain't doing nothing. If you wanted to go to the open world areas, you would need to be in an environment link party. Why are there so many things? Thank god. But my point is, if I engaged with the big monster there, Joey wouldn't be able to do it, right? Or am I wrong about that? It would be so cool if monsters scaled. Yes, that would be cool. But I understand that I am asking this for a I",
            "start": 6293.2
        },
        {
            "text": "the big monster there, Joey wouldn't be able to do it, right? Or am I wrong about that? It would be so cool if monsters scaled. Yes, that would be cool. But I understand that I am asking this for a I want a different game. Listen, I'm going to put in the work between now and Greg's birthday. Greg's birthday coming up soon. It'd be your gift to me, Joe. Buy buy him presents. Just play Monster Hunter with me. Really? Yeah. Yeah. It's not even asking that much, but can't [ __ ] get Andy in here. [ __ ] Andy. A lot of unaccounted 4 hours. A lot of unaccounted four hours. Could have could have easily been playing Monster Hunter, but no. Choosing not to play it. Oh, there was 15 Steam demos. I played the Suga. Okay, we're running. Oh. Oh, Mike, you're so fast. Lightning has the map. Use them as a trap. You can also go uh hunt your land and sea people. What are they? Aaron land. Oh, the Rathalos and the Rathanne. Yes, Ratheian Caroline. That's a former cover athlete. A little bit past their",
            "start": 6359.76
        },
        {
            "text": "a trap. You can also go uh hunt your land and sea people. What are they? Aaron land. Oh, the Rathalos and the Rathanne. Yes, Ratheian Caroline. That's a former cover athlete. A little bit past their prime, but still highly beloved. Totally. Everyone still loves him. You know what I mean? Like Jameus Winston. Everybody loves him. Exactly like that. I've been saying that for weeks. Did anything ever happen with the Luca trade? Like, oh, big deal. Big deal with Luca. Yeah. Yeah. Big deal. Like I knew that, but like now he's just on the Lakers and it's fine. Just on the Lakers that it's going to be a it's going to be a long playoff season with those guys. Dallas fans crushed everywhere. Are they just boycotting the team? Uh they should be going after that guy is right. Yeah. Never go to another game again. You know what? Do me a favor, Dallas fans. Ask him to trade Clay back. Tell them send him back to the Bay. We don't need him anymore. We've given up on the team and the franchise. This",
            "start": 6430.04
        },
        {
            "text": "game again. You know what? Do me a favor, Dallas fans. Ask him to trade Clay back. Tell them send him back to the Bay. We don't need him anymore. We've given up on the team and the franchise. This is We're in a rebuilding stage. Might as well send him back. Might as well move to New Mexico at this point. Who needs this team anymore? Move them to Albuquerque. Well, that was one of the theories, right? Is that they wanted to like tank the team so they could move him to Vegas. Move them. Move them. That's a great move. It's a crazy move cuz like the owners are all Yeah. Mark Cuban's not there anymore. All um casino money, right? Mark wouldn't have let that happen. Mark. Didn't Mark Cuban say he would like divorce his wife before he let Mark Cuban would never let that happen. Is right. Don't you run away from me. I hate that. angry. Is your controller as loud as mine, Greg? I don't think so. I feel like I have like every noise coming through it. Oh my god, I almost did the move finally",
            "start": 6497.2
        },
        {
            "text": "you run away from me. I hate that. angry. Is your controller as loud as mine, Greg? I don't think so. I feel like I have like every noise coming through it. Oh my god, I almost did the move finally once. I believe in you, Mike. You can do it. If Mike, you can see it, then Joe, we never talked about the uh Kiki Palmer Siza movie. Oh, it's on Netflix now. and I watched it uh before it went to Netflix over on Amazon or whatever. Yeah, Joey had a great time. Isn't it so fun? It's a fun time. It's not It's not blow your socks off, but it's going to make you laugh and giggle a little bit fun comedy. If you guys have Netflix and you want to just have like a chill Sunday afternoon, throw it on one of them days. Kiki Palmer is a It's a great Cat Williams is in it running around. Uh, he's always at the He's always saying something. Payday Loans place. Yeah, she's so funny. She's fantastic. Who's in I think she might be in that. And I think she also might be in elementary. Oh, the girl from um",
            "start": 6561.4
        },
        {
            "text": "the He's always saying something. Payday Loans place. Yeah, she's so funny. She's fantastic. Who's in I think she might be in that. And I think she also might be in elementary. Oh, the girl from um the last season of Curb Your Enthusiasm. Remember the the father fell in the pool and then convinced Larry that he has to hire his daughter on all the shows. That girl's been getting some work and I want to just give her a shout out. She's funny and makes me laugh and I'm glad to see her getting some work which is cool. She's in the studio I believe. But yeah, it's a great time and I if we got one of those every year I would be so happy just like two friends hanging out having fun. I love that. I love all of the this all takes place over the course of one day. We got to figure it out. Uh kind of like kind of like expressing. Yes. Count says she was in the studio. Thank you. Yes. That made me smile seeing her. I was like, \"Yeah, hell yeah.\" Man, everybody talking about the studio. I know,",
            "start": 6646.88
        },
        {
            "text": "of like kind of like expressing. Yes. Count says she was in the studio. Thank you. Yes. That made me smile seeing her. I was like, \"Yeah, hell yeah.\" Man, everybody talking about the studio. I know, right? We got to watch the studio. You got to watch the studio. You two. I've never had a show on episode two affect me so much where I was like actively like fiddling with my phone and stuff cuz I was like on the edge. Yeah, I was nervous and on the edge the whole time. Oh, interesting. And episode one is just funny as hell. Oh my god. I got to get back to Righteous Gemstones, too. Jen was so excited. She's like, \"There's a new season starting.\" And I'm like, \"Babe, we are like a season and a half behind.\" She's like, \"Really?\" And I'm like, \"Yeah, we put it on one night and you just were not feeling it. We stopped and we never went back.\" It's like, \"Oh, should we?\" I'm like, \"Yeah, probably.\" I don't know. You got to go get to when they want to make the mega resort in Florida. Oh my",
            "start": 6702.64
        },
        {
            "text": "not feeling it. We stopped and we never went back.\" It's like, \"Oh, should we?\" I'm like, \"Yeah, probably.\" I don't know. You got to go get to when they want to make the mega resort in Florida. Oh my gosh. We have Eric Andre. Yes. Andre is white. Who does who plays white? Just ridiculous. Actually, I think we fall. I can't remember who it is. I want to say it's Leslie Bib, but I don't actually think it is. And I just have her on the brain from White Lotus. Yeah, but Pontton, that edge was like funny, comedic edge. Se I feel like is going to put me on the edges, right? Seance might be good for me though. In what way? Maybe I need a doppelganger. You know what I mean? Oh no, Mike. Snow Mike at work. Snow, we definitely don't need to go. You already live that life where you don't want to leave work and you're so happy here. I can only imagine you are very much the Audi at home. Yeah, but then you'd be so sad because you wouldn't have any of your Andy memories at work. I know. That's the",
            "start": 6750.64
        },
        {
            "text": "work and you're so happy here. I can only imagine you are very much the Audi at home. Yeah, but then you'd be so sad because you wouldn't have any of your Andy memories at work. I know. That's the thing. He'd go home and watch the streams. Go watch all the content he made here. Get new Andy memories. Maybe maybe Andy needs an Indian and Audi so that his Audi wants to hang out with you. Yes, cuz or they don't remember, you know. You guys dominated this mug. Great job, Joe. just crashing in. Are you getting people to come in here? First time chatter, Greg. Mr. Stars in the bank. Miller has never looked so good as he does right now. Are you getting people to come in here write that [ __ ] right now? I mean, I've seen that a couple of times. This whole entire business is built on my back. All right. I've seen a couple of people coming in here writing about I'll tell you the way Greg looks right now. Stars in the Bank has been an amazing bit that has been the gift that's kept on giving cuz",
            "start": 6797.44
        },
        {
            "text": "right. I've seen a couple of people coming in here writing about I'll tell you the way Greg looks right now. Stars in the Bank has been an amazing bit that has been the gift that's kept on giving cuz it it keeps me entertained to make fun of Tim. And then of course uh it ruins Tim's reputation which I'm always happy about. I want you to know that my mom called me last night was like can you explain to me what's going on with Tim? And I was like I can but it doesn't really make that much sense even to me. And she's like okay. Yeah. The amount of people I have in real life been like but so Tim's leaving huh? I never thought I'm like no no no his stars are leaving. I'm taking his stars. They're like, \"What the [ __ ] are you talking about?\" I'm like, \"Oh, there's there's so many.\" Listen, there's a lot going on. If you can't watch 12 hours of content a day, I really can't help you understand. It's right there. Okay, let's see. What do I got to do next? I don't want that. Mission.",
            "start": 6855.44
        },
        {
            "text": "there's a lot going on. If you can't watch 12 hours of content a day, I really can't help you understand. It's right there. Okay, let's see. What do I got to do next? I don't want that. Mission. Investigate all regions and raise your [Music] HR. Let's go here. Have they shipped the Pokemon jackets yet? They should [Music] be. You can also hit up uh the merch support email if you have questions about your order, which is Make sure I have the right one before I forget. Merch support at novo.tv, which should also be on the website, but um I'm pretty sure those have already been shipped out cuz we do print order, but if you haven't gotten them yet, let me know. Um, okay. What am I going to do now? Chat, get it going right now. Everybody copy and paste. Greg Miller has never looked so good as he does right now. Okay, get them spam it up in the chat right now. Let's get them going. Ashlin says, \"I miss whatever stream where it went from Greg taking two of Tim Stars to taking three. How was",
            "start": 6896.64
        },
        {
            "text": "he does right now. Okay, get them spam it up in the chat right now. Let's get them going. Ashlin says, \"I miss whatever stream where it went from Greg taking two of Tim Stars to taking three. How was that decided?\" Uh, that was decided when Carl Jacobs did his first guest spot on Game Showdown. He was so bad that when I came out, he thought I was going to reprimand him and he announced that he had talked to Blessing and upped it to three star. Thank you. To which Blessing nodded, so that's accurate. He nodded. Every so often, Blessing will be like, I don't know about I'm like, you were there and you did the damn You acknowledged it. So, no one's going to screw me out of this. This is, you know, core content and tomorrow it all comes to a head. It has been fun for the last week coming into work every day not knowing what's going to happen cuz even we don't know. No, not you all. It is a Slack message usually in the morning with It's a gift to you guys, too. It is. I like it. I'm always",
            "start": 7004.56
        },
        {
            "text": "work every day not knowing what's going to happen cuz even we don't know. No, not you all. It is a Slack message usually in the morning with It's a gift to you guys, too. It is. I like it. I'm always It's so fun. I like the laughter, the camaraderie it brings. We all we all giggled outside as we waited to drop roses outside. I'm kind of sad to see it end, but it's maybe I'll win again next season if it comes back. And how many stars in the bank are eligible or available for season? Yeah, maybe maybe he puts out stars in the bank next season, you know, then you can win it. There's a very good chance the blessing never does this again. He acts like he hates it, but it's been great. He laughs. He laughs harder than anybody. When I go back and watch the clip of uh interrupting the Nintendo Direct, he's got the the He's laughing. He's laughing so hard when the when the image of Tim comes up. So good. Very Courtney, everybody's an amazing individual to collaborate with on torture.",
            "start": 7051.84
        },
        {
            "text": "Direct, he's got the the He's laughing. He's laughing so hard when the when the image of Tim comes up. So good. Very Courtney, everybody's an amazing individual to collaborate with on torture. Incredible. Just the little touches, too. Putting the watermark on the video. I'm coming, Joey. Perfect. cuz I'm just rolling around trying to stay alive at this point. Just going to shoot this guy right in the mouthful. Oh, he immediately stunned me when I jumped on him. Am I just fighting different? Oh, I'm fighting totally different things, aren't I? caps. Oopsies. Oh, I was writing the right thing. Just the wrong one. Must have been the right thing, but it must have meant the wrong one. Greg, I we haven't talked about it, but you enjoyed Stella Cole on your way home. I did. Yeah. Stella Cole made it through it. Then I played it for Jen. She liked it too. And then here's where it gets really funny. So we liked it. We were outside around the fire pit listening to it on the speaker, right? And",
            "start": 7103.52
        },
        {
            "text": "it through it. Then I played it for Jen. She liked it too. And then here's where it gets really funny. So we liked it. We were outside around the fire pit listening to it on the speaker, right? And then we went into inside to cook or whatever. And so that's where she switched over to Ekko and was like, \"Eko, play Stella Cole.\" And it turns out that there is another Stella Cole who just has one L in her name and she plays like jazz club uh covers were what we were or whatever. Oh, that's it. which is also our [ __ ] So, we just let that play. I tried several times to get it fixed today. Actually, I'm enjoying this. We just let it go. Two Stella Coals. Both are great. I love it. Which is rare because the only other Stella I've ever met is a complete [ __ ] See, she put up a photo of me and Ben Star helped out. It was a trash can. I did not. Stella, man, what a what an [ __ ] She's got it out for you. She does. And all I've ever been is nice to her. Just like Tim. Just like Tim. Getting",
            "start": 7182.16
        },
        {
            "text": "Ben Star helped out. It was a trash can. I did not. Stella, man, what a what an [ __ ] She's got it out for you. She does. And all I've ever been is nice to her. Just like Tim. Just like Tim. Getting gifts for Tim everywhere. Exactly. Whoa. Maverick, you can, but I'm just going to copy merch support at Novo TV on it cuz they handle all of our merch stuff. Merch. So, happy to do that for you, but you could also check in with them directly. We can go from there. Oh, I'm going to die. Smoking Joe says, \"Greg, you could just go for Andy's one star.\" A lot of people have said that would be a funny payoff to this bit. I I don't agree. I don't agree that that's I mean that doesn't help me. You know what I mean? Yeah. We're trying to win. Yeah. This isn't this isn't a bad This is our one chance to to challenge him. Okay. Okay. He's so effing good at this game. What if you What if you were mean to somebody else? That guy really came out to you, Joe. That was great. Yeah, that was rude. I'm",
            "start": 7227.36
        },
        {
            "text": "to to challenge him. Okay. Okay. He's so effing good at this game. What if you What if you were mean to somebody else? That guy really came out to you, Joe. That was great. Yeah, that was rude. I'm already pretty close to being dead. So, Ryan says, \"But it doesn't help Andy.\" And I'm like, \"Yeah, I know. We got to We got to beat him.\" Yeah, Andy's really far behind. Guess we're climbing this wall. chasing him. Okay, that guy saw that giant dragon, looked at him twice, barked at him, and then ran away. Like, oh man, I'm going to challenge this guy. Psych. Actually, I don't want to challenge him. We got this. Oh, he's chasing us. The giant dragon. No, we gave up. He said, \"I don't really want any of that. No, thank you.\" Oo, we got him all deflated. Love that. Unless he comes back bigger and stronger, then I'm really not going to like that. Oh, he looks so bad, Mike. He looks so bad. Yeah, he's not in a good place. Yeah, he's having a rough go of it. He's not in a good place right now.",
            "start": 7294.4
        },
        {
            "text": "stronger, then I'm really not going to like that. Oh, he looks so bad, Mike. He looks so bad. Yeah, he's not in a good place. Yeah, he's having a rough go of it. He's not in a good place right now. He's so deflated. Oh, he's reinflated himself. No, it was all just a tactic to think we got to get closer. We got got We got got. I hate when that happens. Damn it. Every time I try to get him a move, he hits me with the oil blow up. A little poo. Yeah, we hate that. Every time. Every time you Every time I look around. Every time I look around. Every time I look around. It's in my face. I also saw Greg that Charlotte Carden is like Canada's like woman of the year for Billboard or whatever. Yeah. Like she's so huge outside of the United States. It's ridiculous. Every's like a she was on kind of funny. I'm like, \"Yeah, but she's also like she goes to she in in Canada, she sells out stadiums.\" That's crazy. It is so funny how some artists are just like Robbie Williams and that one guy.",
            "start": 7401.04
        },
        {
            "text": "of funny. I'm like, \"Yeah, but she's also like she goes to she in in Canada, she sells out stadiums.\" That's crazy. It is so funny how some artists are just like Robbie Williams and that one guy. Exactly. That had a movie. They're like, \"Why didn't Robbie Williams have it in America?\" And they're like, \"They really tried and we just didn't care.\" Only one song they say. Only one song we like. You're like, \"Oh, get out of here.\" Other than that. Yeah. [Music] Did you ever watch that movie, Joey? I didn't. Did you give it a try at all after all the Tik Tok ads that we got about? I just a billion of I just did not care. And the like as a monkey thing also was not really doing it. Saw himself as a monkey. He was running around. Um, yeah. Uh, I think biopics are hard unless you have uh like at least for me an attachment to the artist itself. That makes sense. Yeah. Which is why I'm so interested by these like four Beatles movies that are coming out. They announced the cast warrior at",
            "start": 7469.52
        },
        {
            "text": "at least for me an attachment to the artist itself. That makes sense. Yeah. Which is why I'm so interested by these like four Beatles movies that are coming out. They announced the cast warrior at cinema club yesterday. Four Beatles. Yeah. They're doing four like one movie for each of them and they're all coming out in the same month. It's like the first like theater bingeable experience. Oh, it's like Paul Mezll is going to be Paul McCartney, Barry Keegan is going to be Ringo, Joseph Quinn, maybe Harrison, and then um Harris Dickinson is going to be uh John Lennon. So, it's like a hot group of actors kind of in their prime. It'll just be interesting. Greg Miller, number one Beatles fan. Going to be right in line. I like the Beatles a lot. There's overrated and this is a great example of why. Because they got movies. Let's do four movies. Oh my god. I mean, I don't necessarily They should do a fifth where they all finally cross over. I guess we come together now. Come together. I am",
            "start": 7532.0
        },
        {
            "text": "why. Because they got movies. Let's do four movies. Oh my god. I mean, I don't necessarily They should do a fifth where they all finally cross over. I guess we come together now. Come together. I am so bad at this game. It hurts. I am missing every single time. Joe, this guy also sucked. I hated this monster. Yeah, he was cuz every time I get close, he blew me up and it's like I'm just trying to get in the combo, man. But yeah, I just had a really tough time with that guy. I never knew the romp polo was so tough. How do I put my weapon away again? Set it and forget it. Right. How do I put my weapon away? Joey, I have no idea. He said, \"Set it and forget it.\" And I don't know. Oh, RMO Peel. You made a Rmpo Peel reference. Oh, but how do I put my weapon away in what? Right now, R1. R1. Oh, thank you. I've been wondering the same thing. You guys get out of that. I'm ready for whatever you want to do. We're having a tough time. I'll tell you, this was not an easy experience to jump back",
            "start": 7587.6
        },
        {
            "text": "thank you. I've been wondering the same thing. You guys get out of that. I'm ready for whatever you want to do. We're having a tough time. I'll tell you, this was not an easy experience to jump back to after a month away from this. That one, we just got to commit. That one really hurts. I'm going to commit for the next month. You're going to commit to this, Joe? I'm going to commit to this for the next month cuz I I like it and I have fun. Good. You know what, Joe? If you commit to this, you'll be prepared for when they do the updates. Oh, yeah. I think we'll get an update sometime in the summer. And nothing else is like doing it for me right now. Oh, then yeah, you should just commit. I will not be committing to this. I will not be committing. I'm committing until we get to Greg's birthday. Okay, I like that. Just for the month. It's a soft commit. I'm in I'm in pain. I have missed so many times. I'm I'm in actual pain of this video game. Oh [ __ ] Friday's the first update. That's",
            "start": 7652.88
        },
        {
            "text": "Okay, I like that. Just for the month. It's a soft commit. I'm in I'm in pain. I have missed so many times. I'm I'm in actual pain of this video game. Oh [ __ ] Friday's the first update. That's going to that's going to be tough. Going to be tough. Waffle plays Twitch says, \"I still haven't played this game.\" You should play this, Waffle. This is uh this is a goatee contender. This is up near the top of my list for the year already. I'm sure this will be uh one that people will talk about at the end of the year. This is a great game. Chris says, \"Let's cancel on for dance update.\" I'll tell you what, I can't wait for the dance. Get me back there. Get me back there. Chris, do you enjoy playing War Zone with Mike? Tell her Chris. Tell Chris cuz I'm trying to figure out how we got this to happen. Is it just she will and then we told Andy that you and Mike or you and Nick? Is it just that? Yeah, it's me and Nick. We begged. I found a Raithon. Let's go find it so you can get your cool",
            "start": 7696.56
        },
        {
            "text": "happen. Is it just she will and then we told Andy that you and Mike or you and Nick? Is it just that? Yeah, it's me and Nick. We begged. I found a Raithon. Let's go find it so you can get your cool armor. I'm right behind you. You're the best. Enjoy strong word. Okay, got it. Mike paying people to play Monster Hunter for him like Elon. That that won't help me. You know what I mean? It won't help. I wish that there was a little bit longer of a range on my bow and arrow, but I understand. I just want to play a different game every time I say this. So, I know that that's not what Monster Hunter is, but here I am because I do actually think it's fun and I want to upgrade all my [ __ ] The things we do for Greg, I'm happy to play it because I don't have any one else to play with, clearly. Oh, get in here, Greg. All right. So, I know technically I'm I'm like the boss or whatever. Are we really doing this meeting at three? Yes, we're doing the meeting at three. All right, cool. Just making",
            "start": 7749.6
        },
        {
            "text": "get in here, Greg. All right. So, I know technically I'm I'm like the boss or whatever. Are we really doing this meeting at three? Yes, we're doing the meeting at three. All right, cool. Just making sure. Just make sure somebody's paying attention. I've been keeping track of time. All right, cool. I looked at the counter. I was like, \"All right, [ __ ] Yeah, [ __ ] [ __ ] That happen? Are we doing it? We still doing that?\" We are knocking this meeting out. We just push it. You know, we got We got one last hunt. So, come join us. I'm coming. I'm on it. I'm on the way. Come join us. I already died. One last I'm already dead. I've already died. Oh [ __ ] That means I got to stay alive. Man, chip damage. Two at a time. Man on the run. Man on the run. That man is running now. Man on the run. The running man making a new running man movie. Oh, really? Excited. Did we see that Glenn Powell and Sydney Sweeney went to his sister's? Let's not get ahead of ourselves. Let's get ahead of",
            "start": 7820.96
        },
        {
            "text": "run. The running man making a new running man movie. Oh, really? Excited. Did we see that Glenn Powell and Sydney Sweeney went to his sister's? Let's not get ahead of ourselves. Let's get ahead of ourselves. I saw it. They're they're beautiful people. She called off her engagement. I know. I'm Well, I've been following the drama via the Tik Toks I get served. Like I wish them both well if that's what they want, but I don't want to be overanalyzing. She's going through a breakup, she goes to a wedding with a friend, you know what I mean? A hot friend that they have amazing chemistry with. Incredibly most chemistry lace couple of the last. But that's the people you want to spend time with after a breakup. The people that you laugh with, the people that you share moments with. Yep. Yep. Yep. Yep. Yep. Maybe it's a hot bod. Okay, it's fine. It's fine. Honestly, being able to be actively mad at all of them on content is the main reason. It's great proof for my therapy. We're going to sense",
            "start": 7865.68
        },
        {
            "text": "Yep. Yep. Maybe it's a hot bod. Okay, it's fine. It's fine. Honestly, being able to be actively mad at all of them on content is the main reason. It's great proof for my therapy. We're going to sense we're going to spend a great Friday together. It's going to be really special. I'm so excited to to witness it. All of you guys' IRL together. Just having Chris in the office will be fun. I know. Chris, just come hang out more. Chris, stay the whole week. Come come come early. Come Thursday. Get here early. Come react to the Switch tomorrow. Get in the plane right now. You want Yeah. You want You want to come talk Nintendo with us? Come talk Nintendo. Gigg, what color are you wearing tomorrow? Are you going to wear red for Nintendo? What are you wearing? It's going to be a surprise for you. Oh. Oh, no. Jesus. No. No. No. Is it a surprise for you or is it No, no, no, no, no. I just I I have Don't worry about it. Okay. Are you dressing up, Mike? Well, I was going to wear red for Nintendo,",
            "start": 7907.36
        },
        {
            "text": "Oh. Oh, no. Jesus. No. No. No. Is it a surprise for you or is it No, no, no, no, no. I just I I have Don't worry about it. Okay. Are you dressing up, Mike? Well, I was going to wear red for Nintendo, but the set is red, so now I think I'm just going to wear black. Too much red. Yeah, you don't want to go too much red. You've got red on you. Got him. Oh, oopsies. Oopsies. Yeah, drag my body back to the camp. I understand. If I die young, bury me. Whatever happened to them? I know. and something. Perry the band Perry. I can't get it to go to pizza cutter mode. I'm trying so hard. I just can't. I don't have the rhythm anymore. I've lost it. You've lost that love and feeling. Oh, that love feeling. Oh, a different verse. [Music] Sorry, I only do the top gun version. It's funny. Stop moving. Let me get your little hot spot. I like people speculating what you're going to wear. Yeah, exactly. You got me thinking about what he's going to wear. I'll tell you when we're off camp. It's going to",
            "start": 7957.52
        },
        {
            "text": "me get your little hot spot. I like people speculating what you're going to wear. Yeah, exactly. You got me thinking about what he's going to wear. I'll tell you when we're off camp. It's going to be exciting. It's not as exciting as you think it is. Well, just let me know if I got to go find that blazer that I bought. I don't know where it is. So, let me know. Is it the one that you spent way too much money on? Uh-huh. Uh-huh. I don't know where that is in the car or in the, you know, it's somewhere cuz, you know, I didn't take it back. So, just let me know if it's a blazer day. I'll try to find it. I will be wearing a blazer. A blazer. You're wearing a Okay. God forbid I got motor oil on that thing in the trunk. Chrisenka says it's wrapped around your Steam Deck. Are you going to buy a Switch 2, Mike, and also have it live next to your I will be buying a Switch, too, 100%. Uh, will I be using it often? No, of course not. But I will have one. It's funny cuz I want to go My Switch is",
            "start": 8095.2
        },
        {
            "text": "Switch 2, Mike, and also have it live next to your I will be buying a Switch, too, 100%. Uh, will I be using it often? No, of course not. But I will have one. It's funny cuz I want to go My Switch is right behind us. I'm excited tonight to go through my Switch one on all the games that I've ever purchased on that cuz that was like a heavy digital only console for me. Yeah. And there's got to be so many games if they could tell stories. Mike played me for 30 minutes. They can't Mike bought this game and never played. You know what I mean? Like it's going to be That's a great game. Go through your go through your Switch library, you and me, and be like, \"What do we do with this game?\" Fire. Mike bought Mike bought Super Smash Bros. barely ever played it and complained every single time cuz all he wanted was all the characters. Never put any time into unlocking the characters. Just said Nintendo, I'll pay you for them instead. Classic. And that still is a great business model that they",
            "start": 8174.32
        },
        {
            "text": "all he wanted was all the characters. Never put any time into unlocking the characters. Just said Nintendo, I'll pay you for them instead. Classic. And that still is a great business model that they should adopt. There are people out there that don't want to unlock them. Just let me play. Yeah. I just want to have my friends play with this. Can we not? Exactly. This is a party game for me and my friends. When they come over, I want all the characters unlocked. Please understand that, Nintendo. I want to spend How long do you think Tim spent unlocking all those characters? Spirits is a different story altogether. That's true. I forgot about that. He's such a weirdo loser kid. I can't wait to bash his head in tomorrow. Figuratively, if he wakes up with a bash in head, that wasn't me. Once again, not premeditated. Been very, very clear, everybody. It's not what I'm here to do. Oh, let's go. [Music] I know. I feel like I still don't know if I'm going to buy one tomorrow or like",
            "start": 8225.12
        },
        {
            "text": "me. Once again, not premeditated. Been very, very clear, everybody. It's not what I'm here to do. Oh, let's go. [Music] I know. I feel like I still don't know if I'm going to buy one tomorrow or like immediately. Really? Do you not use your Switch that much? No. I pretty much think that I would be fine not having a new Switch until Animal Crossing. Ah, fair. Say goodbye. Everybody, this has been us streaming Monster Hunter Wilds. Uh, I have a good authority. We're going to do it more. Uh, we're done with Pokemon Forever. Uh, Nick sucks. Nobody wants to watch him play it anymore. Uh, but in all reality, remember this is our end of the programming day. We're going to go to a meeting right now. But more importantly, tomorrow at 5:45 a.m., we are turning on the stream. So, we can give me three stars as I take Tim Stars with Stars in the Bank. And then we will roll in to the Nintendo Switch 2 presentation. We will live react to that with Cat Bailey. We will then do a games. We will then do",
            "start": 8268.32
        },
        {
            "text": "stars as I take Tim Stars with Stars in the Bank. And then we will roll in to the Nintendo Switch 2 presentation. We will live react to that with Cat Bailey. We will then do a games. We will then do Games Daily. We will then stream a whole bunch of Pokemon. Uh it will be a very good day, a very memorable day, a historic day, some would say. And Tim will hate it. So there's no better reason than to pick up that kind of funny membership. And come join us tomorrow bright and early, 5:40 a.m. Pacific time, aka 8:45 Eastern time. Uh, until next time.",
            "start": 8322.88
        }
    ]
}