{
    "id": 13875,
    "video_id": "56_0MlWl7oE",
    "show_name": "Gamescast",
    "hosts": [
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "The Most Influential Games of ALL TIME?! - Kinda Funny Gamescast",
    "description": "This episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nTime Stamps:\n00:00:00 - Start\n00:01:55 - Housekeeping\n00:04:17 - It’s Time to FINISH THE STORY\n00:10:51 - The Most Influential Games of ALL TIME\n00:30:02 - The List\n01:02:52 - Ranking the List\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744313629,
    "duration": 3925,
    "transcript_chunks": [
        {
            "text": "[Music] Yo, what's up? Welcome to Kind of Funny Games Cast for Thursday, April 10th, 2025. I'm one of your hosts, Blessing Addio Jr. Joining me is Lacroy Poppy Tim M [ __ ] Gettys. Here's the thing, Bless. Yesterday, me and you did an amazing episode of the kind of funny games cast where we found a video game music quiz uh where every 10 seconds a different video game song would play 100 different songs ranging from very easy to very hard. We ran out of time because we had a big uh collab stream with Giant Bomb playing Monaco 2. That was a blast. You can check out the video on YouTube now. Uh but because of that, we didn't get to do the very hard the final 20 video game songs. So before we get into today's topic after you get through the housekeeping and all that stuff, I think we got to do a quick lightning round just to see what we had left. See, I'm scared because I think for yesterday's episode, not to spoil it for people, we started off very strong obviously because it goes from",
            "start": 7.81
        },
        {
            "text": "do a quick lightning round just to see what we had left. See, I'm scared because I think for yesterday's episode, not to spoil it for people, we started off very strong obviously because it goes from very easy to to very hard. By the time we got through the latter half of that episode, hit a wall. It It was a struggle bus. We hit a wall. We started struggling by normal. So my fear is that we're very hard, we might not even get any. I mean, as long as we get one, I will chalk it up as a win because like, yeah, we we ended up getting 31 correct. Uh, but then once it got post easy and normal, we only got one, right? God. So, we have 20 left. Did we get one more? I thought I got like two back to back. I got I wrote down one and a half. Well, I think that that like one of those was still in the the easy or normal area. Oh, it's like once we got to hard, we're in a bad place. But anyways, we'll get to that in a sec. Remember, this is kind of funny. Games cast. Each and every weekday we run",
            "start": 58.72
        },
        {
            "text": "the easy or normal area. Oh, it's like once we got to hard, we're in a bad place. But anyways, we'll get to that in a sec. Remember, this is kind of funny. Games cast. Each and every weekday we run uh we do don't run you through the nerdy news because we do that on the last show. We get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch podcast services around the globe. If you love what we do, support us with a kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast, excuse me. To get all of our shows ad free, watch us record them live and get a daily exclusive show for a chance to be a part of the show some of your thoughts and opinions as YouTube super chats as we go. housekeeping for you. Friday we kick off the Elder Scrolls Online podcast, a kind of funny games cast limited series. You can join Greg Mike Zenmax online studios director Matt Fyroar and The Elder Scrolls Online game director Rich Lambert as they",
            "start": 98.96
        },
        {
            "text": "Scrolls Online podcast, a kind of funny games cast limited series. You can join Greg Mike Zenmax online studios director Matt Fyroar and The Elder Scrolls Online game director Rich Lambert as they start an unflinching four-part show about the highs, lows, successes, and failures of the 10-year-old game. Greg calls it the deepest dive of his career. And it all kicks off Friday, tomorrow as your normal Games cast as well as The Elder Scrolls Online YouTube. We never get this level of depth from developers. So don't miss it. Uh if you want to know how games really get made and keep going. Remember, we're an 11 person business all about live talk shows. You got KHD right before this, which was more of that Nintendo Switch 2 news. Uh then after this episode of Gamescast, you're getting the stream, which is Mike uh and Kevin playing Blueprints uh on Cave. I started to hint toward the idea of we might switch it up. I got the confirmation uh that we're not playing that game today, but we",
            "start": 138.48
        },
        {
            "text": "stream, which is Mike uh and Kevin playing Blueprints uh on Cave. I started to hint toward the idea of we might switch it up. I got the confirmation uh that we're not playing that game today, but we might be playing it later on. The Blueprint stream should be good though. Kevin and Mike playing a puzzle game. Oh, nothing can go wrong. And it's one of the best games of the year. And so you're defin definitely going to want to check that out. And I can't wait to see Mike. Mike playing blueprints is like the most like with Kevin Backseat Gaming. with Kevin Backseat Gaming, especially because it's way more of a Kevin game, I think, than a Mike game. But I am fascinated to see how Mike tackles it. Uh, you're gonna want to check that out right after this episode. If you're a kind of funny member, you can get today's Gregway from Mike. Thank you to our Patreon producers Anatoli, Delaney Twining, Carl Jacobs, and Omega Buster. Today, brought to you by BetterHelp, but we'll tell you about that",
            "start": 182.24
        },
        {
            "text": "you can get today's Gregway from Mike. Thank you to our Patreon producers Anatoli, Delaney Twining, Carl Jacobs, and Omega Buster. Today, brought to you by BetterHelp, but we'll tell you about that later. For now, let's start with topic of the showt. So, before we get to the [ __ ] list, we got to close it out. We might [ __ ] the bed. We might [ __ ] the bed. We got to try to get one of these, everyone. We're going to lightning through it. We're not going to pause. No, we're Oh, we're not pausing. No pausing. No. No pausing. We're going straight through this thing. The final 20. [Music] We both won, dude. [Music] At zero. No armor core. Oh, no way. I [ __ ] up on Mirror's Edge. I would have knocked out this. I should have known if it was the vocal track. [Music] Mario Sunshine. Hell yeah. Boy on the Game Boy Advance. Cult classic. [Music] Oh [ __ ] Bastard. I already got Bastion. I said it yesterday. I said I don't know. The Final Fantasy 15 demo where you're in the bedroom. It's",
            "start": 217.12
        },
        {
            "text": "Boy on the Game Boy Advance. Cult classic. [Music] Oh [ __ ] Bastard. I already got Bastion. I said it yesterday. I said I don't know. The Final Fantasy 15 demo where you're in the bedroom. It's obvious. Oh, little nightmares. Yeah, I would never have gotten this. I love the word itude. [Applause] Oh, I mean Red Dead Redemption. Sever. Oh, I don't [ __ ] with Sever, too. I don't remember this. This is so hard. Metroid Dread. I was also thinking Metroid Dread. Yeah. Come on. Let's go. We got one. We got one. Oh, is this do No, this isn't Doky Doi, is it? I mean, I'm going to say Doky Doi Literature Club. No, I was way off. Webs. I've not heard this. This is the first game I haven't heard of. That looks kind of cool, though. Attacking the Power of Guju. [ __ ] yeah. Jacket two. So close. Jack 2. Can you imagine if it was Jack and the power goddamn so close. Just recently played Jack 2 and I could not clock that. This is some winter music. This is winter level. Um Gex, I think it's like",
            "start": 284.0
        },
        {
            "text": "2. Can you imagine if it was Jack and the power goddamn so close. Just recently played Jack 2 and I could not clock that. This is some winter music. This is winter level. Um Gex, I think it's like a festival. What is Valkyia Chronicles? This has such winter vibes. [Music] It's like a racing game. I mean, it's not Ride. It's so not Diddy Kong Racing, but that's what I'll say. Ah, boy bever. [Music] See, this is where I would have said Shadow Colossus. I'm going to say Ory. It has to be there eventually. Eventually. Nope. Damn it. Cross punk. No. [Music] the lives. Uh, Broken H. Oh, you know, I've always wanted to play Bushidito Blade. I was looking at some clips the other day. I was like, \"This game looks [ __ ] dope.\" [Music] Oh, a Capcom fighting game. Enter the dungeon. Yeah, this is very the dungeon too. [Music] Resident Evil near replicant. Shenmue. Wow. Thought it was the save room in Resident Evil. [Music] DK64. Yeah, that's what I was thinking, too. It's not Radiant Histori.",
            "start": 381.28
        },
        {
            "text": "very the dungeon too. [Music] Resident Evil near replicant. Shenmue. Wow. Thought it was the save room in Resident Evil. [Music] DK64. Yeah, that's what I was thinking, too. It's not Radiant Histori. Oh, that was on the tip of my tongue. How could I [Music] forget? Game of Thrones tailtale. It's not a bad guess. Hide though. Oh, Chance of Sonar. Wow, man. That is impossibly difficult. [Music] The last story on the Wii. It's got to be there eventually. Oh [ __ ] Crow country. Crow country. What? What? Putting that on the video game music thing is insane work. I don't have anything really interesting. Bless. I would not have played sound like Yeah. I mean that sounds like last but it's not right. We'll say last. [Music] What? What is that? I can't read it. I can't read it. It won't let me thing. Hide. Let's see if I can hide. Okay. Okay. Interesting. Okay. We got one. We got one. That's all. We got one. That was impossibly hard. That was impossibly hard. The thing is I And you know,",
            "start": 462.08
        },
        {
            "text": "thing. Hide. Let's see if I can hide. Okay. Okay. Interesting. Okay. We got one. We got one. That's all. We got one. That was impossibly hard. That was impossibly hard. The thing is I And you know, it's always that battle. You were talking about this yesterday doing game showdown. It's hard to like get ones that are reasonable for people to guess but still exciting and like challenging so it's not just like the most obvious [ __ ] Yeah. But like I want I feel like we need to find something with some type of parameters of like all right it's here are just a bunch of classic Nintendo games and we need to say like what what is the song? You know what I mean? Like it's from this level or I don't know. There has to be something that like we we there needs to be a level of understanding if we know these things. It's almost like the categories are more so Ubisoft, Nintendo, PlayStation, Xbox as opposed to easy to hard cuz like what's hard to these guys or what's normal to these people",
            "start": 557.36
        },
        {
            "text": "we know these things. It's almost like the categories are more so Ubisoft, Nintendo, PlayStation, Xbox as opposed to easy to hard cuz like what's hard to these guys or what's normal to these people apparently making this thing not normal to me cuz god dang I think we did pretty good overall though. Yeah, cuz what you said how many getting about about 34 34 out of 100. It was like half of what I predicted. Yeah, cuz I predicted 80. I mean I thought it was going to be hard but I was saying we should go for 25. So, you know, we're overachieving according to me. Yeah. Well, congratulations to us. Congratulations. We should do this again. If chat, if if people come across like other versions of these that are Yeah. Let us know. Yeah. Blue sky to them or uh tweet them at us or whatever and like Yeah. I'd want to do this again. I love that. Yeah. All right, Tim. It's topic of the show. Today is a [ __ ] list. Of course. [ __ ] list is where I go online, I find a top 10 list, and I bring it",
            "start": 600.24
        },
        {
            "text": "Yeah. I'd want to do this again. I love that. Yeah. All right, Tim. It's topic of the show. Today is a [ __ ] list. Of course. [ __ ] list is where I go online, I find a top 10 list, and I bring it back to you and Barrett, and we judge it for the audience amusement. Here's the thing. This is one that I didn't go out and seek. This is one that sought us that sought us. The streets were calling out our names. We're saying bless Tim. Tim bless there. There's a there's a what' you say? Juvet. It's the the main character in Nanimusha 2. My only memories of that game like is the because the mom his mom is like a ghost and she just keeps like Juvet Jet. See my version would be Heavy Rain where somebody had a bug online. Have you seen this video? Somebody had a bug where they had to they kept pressing the button and they kept calling Jason for way longer. Hilarious. Um, but yes, this list sought us. Uh, it is actually I don't even know. I don't even have the full title here. If I click into",
            "start": 643.04
        },
        {
            "text": "the button and they kept calling Jason for way longer. Hilarious. Um, but yes, this list sought us. Uh, it is actually I don't even know. I don't even have the full title here. If I click into the article, it's not going to spoil the thing, right? Uh, no it shouldn't. Perfect. It's from Oh, it's from BAFTA. So, it's from BAFTA. So, this is a big deal. This is official. Official. These people know what they're talking about. It's a list of the most influential video games of all time. The most influential video games of all time. I feel like often we need to define the list before we get into it of what's that even mean, right? Are we talking best? Are we talking top? Are we talking favorite when it comes to these top 10 lists? Yes. Most influential. That means that these games, every game on this list, all 10 of them need to influence video games in a major way. In a top way, some would say. In a top way. Do you want to know how many games are actually on the list? Yes. Yes. 21. 21",
            "start": 685.44
        },
        {
            "text": "on this list, all 10 of them need to influence video games in a major way. In a top way, some would say. In a top way. Do you want to know how many games are actually on the list? Yes. Yes. 21. 21 games on a top 10 list. Are they? That's my type of list. Yes, they are. the ranks. That's where the spice begins, everybody. Oh, this be a fun one. I've only looked at the 21st spot uh after that cuz I wanted to check ahead just to make sure what the vibe was. Gotcha. Oh, this is 21 ranked. I didn't realize it's all all 21 ranked or just the top 10 ranked and a bunch of honorable mentions. Uh no, it start the ranking starts at 21. Okay. All right. I mean, let's throw Let's throw the games out. Would it be fair to say that this is an easy list to make? Yes. In my head, this is an easy list to make. I think so too. I think that this is an easy list to make with what 21 60 plus% accuracy. Yeah. Right. Like I feel like there might be some things we we don't get or there might be a different",
            "start": 725.68
        },
        {
            "text": "make. I think so too. I think that this is an easy list to make with what 21 60 plus% accuracy. Yeah. Right. Like I feel like there might be some things we we don't get or there might be a different version of a thing that we say, but like I do think that there is a cannon in 21 is such a specific it's such a specific number. Yeah. I feel like if you're making a list of 21, everything there has to be like okay like this fits. Yeah. Like we made a list of games and whittleled down to what matters most and then that was the number. This was the 21 mark. So yeah, let's just start naming things. Super Mario Brothers. See, this is where we get tricky cuz how many Mario games can fit on with Mario. Let's start with Mario and let's see. Mario 64. I also reading this first blurb. It does say to reflect the medium's universal impact ahead of the 21st BAFTA game awards. We asked the public a provocative question. What is the most influential video game of all time? [ __ ] the public. Okay, well",
            "start": 770.8
        },
        {
            "text": "the medium's universal impact ahead of the 21st BAFTA game awards. We asked the public a provocative question. What is the most influential video game of all time? [ __ ] the public. Okay, well that does change things. So to read I'm going to read the whole first blurb, right? Words by Chris Chris Schilling. Video games influence on popular culture has never been more prevalent. Their effect is visible in audible in today's music across the world of TV and cinema and on the catwalk. On the catwalk uh on the catwalk. Even your favorite language learning and fitness apps feature progression systems and rewards popularized by games. Oh, okay. I see. I see where they're going. Uh to reflect the medium's universal impact ahead of the 21st BAFTA game awards. Oh, that's how they get the 21. It's the 21st FAFTA Game Awards. I take back what I said earlier. We asked the public a provocative question. What is the most influential video game of all time? So then I wonder if it's not ranked. I",
            "start": 816.04
        },
        {
            "text": "the 21st FAFTA Game Awards. I take back what I said earlier. We asked the public a provocative question. What is the most influential video game of all time? So then I wonder if it's not ranked. I wonder if it's like they asked 21 people. Oh, let me read on. As more than one responder said, it's unfair to have to just choose uh to have to choose just one. Do you pick the pioneers that shaped the early days of the medium, the innovators that were ahead of their time, the ones that proved formative to your own creative journey, or simply the ones that made you most emotional? As might be expected, among the extraordinary number of responses we received was a staggering variety of games, ranging from titles that launched the industry to contemporary giants uh released mere months ago. The top 10 alone spans multiple genres from platformers to shooters, sandbox adventures to simulations. So, without further ado, here are the public's top 21, each of which it's fair to say has had a",
            "start": 858.88
        },
        {
            "text": "The top 10 alone spans multiple genres from platformers to shooters, sandbox adventures to simulations. So, without further ado, here are the public's top 21, each of which it's fair to say has had a seismic impact on games and those who play them. I don't think it's 21 people. I think there's probably like a poll or something. Yeah, they just pulled and then Yeah. Yeah. Okay. Okay. So, Mario wise, Mario 1, Mario 64. I think that's it. I agree. I think we only see 64. That would be an insane thing to do. I mean, if you want to keep it one per per franchise, I would say 64. Yeah. I mean, Mario Super Mario Brothers one. I I I know. Yeah, but like like this is an example. If they don't have both, [ __ ] this list. I don't think you get both. That's But they're so different. Like, actually, no, I think you do. I think I think you're right. They're entirely different and like legitimately are the most influential games of like those genres and time periods. Like, yeah, I think Mario saved",
            "start": 899.44
        },
        {
            "text": "I think you do. I think I think you're right. They're entirely different and like legitimately are the most influential games of like those genres and time periods. Like, yeah, I think Mario saved the industry. The argument I would make would be if you were to do one per franchise, which I think for this you shouldn't, but if you were to, I think maybe you keep Super Mario Brothers in and then instead of Mario 64, you do like Zelda Ocarina, something like that. The Z targeting. Yeah. Something else that had like a Yeah. big impact on 3D. Yeah. GTA 3. GTA 3 for sure. Tetris. Pong. Yeah. I mean, Pong. Pong needs to be on this list. Pong might be number one on this list. Pong. Tetris. Yes. Yeah. GTA 3 is a great pull. Pac-Man. Yes. Or Miss Pac-Man just because of the the modding and stuff like that. That might be the Yeah, but one of the two. I'm right now Miss Pac-Man. Halo. Halo's complicated because I think Doom, right, for Doom or Wolfenstein for first-person shooters. I was also",
            "start": 949.04
        },
        {
            "text": "like that. That might be the Yeah, but one of the two. I'm right now Miss Pac-Man. Halo. Halo's complicated because I think Doom, right, for Doom or Wolfenstein for first-person shooters. I was also going to throw Golden Eye in there, too. But I think Halo also like like the story Gary always says where like he wasn't sold on like first-person shooters on a console and like he played it and he was like, \"Oh [ __ ] I understand it.\" Like I think that sticks in a lot of people's head. So I I I would be surprised if Halo 1 was not on here. Well, so Halo 1 is interesting because it it like to what Barrett's saying like it kind of defined console twin stick shooting, like dual stick shooting, not twin stick. Um, and then Halo 2 have having online. Yeah. You know, I mean, you can encapsulate so much by just saying Halo 2. But like also this is fan voted. That's you got to keep that in mind of like what would people say? I guess if you ask somebody because I think the question they ask",
            "start": 997.12
        },
        {
            "text": "so much by just saying Halo 2. But like also this is fan voted. That's you got to keep that in mind of like what would people say? I guess if you ask somebody because I think the question they ask people are what is the most influential video game of all time? Which I think does paint this a bit different. Right. Street Fighter 2. Yeah. See, now we're cooking. Now we're cooking. They said from they said up to games from just a few months ago. Yeah, Portal. Yeah, I could see it. Portal or Halfife? Something in that family. I would I would I would say Halflife probably more likely. Yeah. But like if you asked Did they say people on the street? No, they said um What did they say they're Who did they say they're asking? We asked. They just said they asked the public. Yeah. Dark Souls, not Demon Souls. Dark Souls. Dark Souls. That's good. Final Fantasy 7. Metal Gear Solid. Middle Gear Solid should be on. Middleear solid. Yeah. Yeah. Yeah. For sure. I mean, yeah. Final Fantasy 7. It's a",
            "start": 1048.0
        },
        {
            "text": "Demon Souls. Dark Souls. Dark Souls. That's good. Final Fantasy 7. Metal Gear Solid. Middle Gear Solid should be on. Middleear solid. Yeah. Yeah. Yeah. For sure. I mean, yeah. Final Fantasy 7. It's a tough one. Final Fantasy 7, I think, does I mean, has a strong chance. In fact, I'm going to say yes. This is a public poll. Yes. But what did it influence? People's childhoods. No, but really though, you know, like that that to me is like the I I feel like Metal Gear Solid is a better example of what we would be saying Final Fantasy 7 influenced. Mhm. I think Final Fantasy 7 in particular influenced uh mainstream awareness of JRPGs in America specifically. Yeah. Yeah. Yeah, like that was like a huge kind of moment for sure. I'm going to write it down. I think Final Fantasy 7 just based off of popularity alone. Yeah, I think that's more of a contender. Someone in chat also uh pops up Pokemon. I don't think so for some reason. It's a rough one cuz again like what what are we talking about",
            "start": 1104.72
        },
        {
            "text": "popularity alone. Yeah, I think that's more of a contender. Someone in chat also uh pops up Pokemon. I don't think so for some reason. It's a rough one cuz again like what what are we talking about like influential, but I do think that uh I mean Pokemon everything you just said about Final Fantasy 7 you could apply to Pokemon. you could apply to Pokemon. And then also when you're talking about a public poll, like what are the answers that like pulled um people that people that are filling out a poll are going to say, right? Like when it's when this is a public thing, when it's a vote thing, I think Pokemon just has the popularity. And it did influence a lot in terms of mechanics and the the training and community and all that stuff. And even like if you want to take it into like even just how you franchise a video game and like spin that into different products and make it a thing that's bigger than just the system. Fortnite, Minecraft. Fortnite Minecraft both have to be there. I'm",
            "start": 1161.44
        },
        {
            "text": "how you franchise a video game and like spin that into different products and make it a thing that's bigger than just the system. Fortnite, Minecraft. Fortnite Minecraft both have to be there. I'm just trying to think of genres now, right? Because it's like cool fighting game street. Okay. Yeah, World of Warcraft for sure. For sure. So far we have a pretty good list. Yeah, cuz we've written down Let me count how much we've written down. Rogue. Oh, yeah. Wait, what did you say, Barrett? Rogue. Oh, yeah. Okay. Yeah. I mean, that might be too in the weeds like nerdy because I don't know if like for a public poll again public poll like do people know that like Rogike and Rogue Light are specifically based off a game called Rogue? Like I mean I wonder if then you get Hades as an answer or Rogue Legacy. Rogue Legacy definitely has I mean Rogue Legacy would be such a banger, but I think for the popularity thing of it for people that are filling out a poll, when you think of the last five",
            "start": 1204.0
        },
        {
            "text": "Legacy. Rogue Legacy definitely has I mean Rogue Legacy would be such a banger, but I think for the popularity thing of it for people that are filling out a poll, when you think of the last five years of Rogue Lights and like how Rogue Lights have accelerated, I think a lot of people would would attribute that to something like Hades. That's fair. Yeah. I This one is a little weird too, but I think Limbo like being a breakout hit. Uh see over that I would say Journey. See, I would have said Super Meat Boy. Yeah, I think one of those three. Yeah, I'm going to say Limbotory. I mean, if we're going to do that, it might as well be Cave Story. Cave Story. Biggest first indie game. Really? I'm I put Limbo/Journey/meboy/cavetory as one entry. Sims. Is that influential or is that just impactful? That's Yeah, I think that's a good distinction there. Yeah. Yeah, man. It it starts getting tough cuz Yeah. I like I like the genre thing of you know games. Is there like an influential sports game?",
            "start": 1257.08
        },
        {
            "text": "That's Yeah, I think that's a good distinction there. Yeah. Yeah, man. It it starts getting tough cuz Yeah. I like I like the genre thing of you know games. Is there like an influential sports game? There's a lot of them. I feel like a lot of choices. There was that What was the football game? It was like not Madden. It was like NFL 2K uh 2K 5. 2K 5. That's that was the big one because that also online and all of that stuff like that could be there. But it depends on like how what we're talking about like again what is the influence like what is the thing that they're introduc or not introducing but like emblematic of Did we say Last of Us? No. Oh, I could see Last of Us on there. Yeah. But I I don't know like I feel like that would be a a poor choice when it's like well the answer is Uncharted then. Like we're talking influence. It's like, yeah, Last of Us exists because of Uncharted in a direct way of like style of game. It's similar in the conversation of Rogue and Hades, right?",
            "start": 1311.68
        },
        {
            "text": "then. Like we're talking influence. It's like, yeah, Last of Us exists because of Uncharted in a direct way of like style of game. It's similar in the conversation of Rogue and Hades, right? Like yes, Last of Us exists because of Uncharted, but then the kind of tone and depth of The Last of Us, I think really skyrocketed this focus in on cinematic storytelling in video games past the summer blockbuster popcorn flick that Uncharted was to spoil a little bit of my Daughty Dog video. Uh, and so I I do think in terms of storytelling in video games, I think Last of Us is probably on there more likely than Uncharted. Yeah, cuz I don't think I don't think you get a modern God of War without Last, right? Like you don't get that from Uncharted. I don't think you get like a lot of modern Sony I think comes more from Last than Uncharted. Even though you get Last because of Uncharted in the same and also I would even like put in I mean we didn't say Resident Evil 4. Oh, definitely. But like",
            "start": 1364.08
        },
        {
            "text": "I think comes more from Last than Uncharted. Even though you get Last because of Uncharted in the same and also I would even like put in I mean we didn't say Resident Evil 4. Oh, definitely. But like Resident Evil 4 I think almost equally influences a Last of Us. Yeah, as much as an Uncharted does. I mean, we got if I if I write Resident Evil 4 and Last Bliss, that brings us to 20. So, we just need one more game. Sonic the Hedgehog 3. What What's a game that's like emblematic of openw world? I mean, GTA 3. Yeah, but like that's sandbox. You know what I mean? I feel like we like we talked about sandboxed 2 and it was like there was a shift to open world where it like really changed. See the real answer probably is Assassin's Creed 2 but Skyrim. Skyrim might actually be the the public answer. That's actually a really good answer. Yeah, that's a good call. Super Metroid. Oo yeah. I mean and Castlevania. Yeah, but Super Metroid is like that's where Metroid Vania comes from cuz like",
            "start": 1417.52
        },
        {
            "text": "answer. That's actually a really good answer. Yeah, that's a good call. Super Metroid. Oo yeah. I mean and Castlevania. Yeah, but Super Metroid is like that's where Metroid Vania comes from cuz like Metroid one, sure. But like Metroid, what do people think of first? Super Metroid or Symphony of the Night? Super Metroid. Really? Yeah. Symphony of the Night, I think, is is a all considered fairly niche. Yeah, that's more of a nerdy pick. Okay. I mean, that's 22. I feel good about that. I mean, I'm sure Are there Are there any major things we're missing before we hop into this? Because right now for to read it through what I have written down, I have Super Mario Brothers, Mario 64, GTA. Wait, do we even say Zelda Ocarina? At one point, I said it, but I didn't write it down. I'm going to write down Zelda Ocarina. Yeah, it should be. Uh, so Mario Brothers, uh, or Super Mario Brothers, Mario 64, Zelda, Arcarina, uh, GTA 3, Pong, Tetris, Miss Pac-Man, Street Fighter 2, HalfLife, Dark Souls,",
            "start": 1470.64
        },
        {
            "text": "down Zelda Ocarina. Yeah, it should be. Uh, so Mario Brothers, uh, or Super Mario Brothers, Mario 64, Zelda, Arcarina, uh, GTA 3, Pong, Tetris, Miss Pac-Man, Street Fighter 2, HalfLife, Dark Souls, Metal Gear Solid, Final Fantasy 7, Pokemon, Fortnite, Minecraft, World of Warcraft, Hades, Limbo/Journey/meatboy/cavetory, one of those. NFL 2K 5, uh, Resident Evil 4, Last of Us, Skyrim, Super Metroid. We're missing mobile games. Sure. Which one? Angry Birds, Candy Crush. Angry Birds or Candy Crush? I think both are great answers and I feel like that's they're the match three still has such a chokeold on so many people, you know. Yeah. Yeah. Candy. Let's go Candy Crush. That that I think is the right move. I'll never forget having to do guides for Candy Crush at IGN for like a month. I really question my career decisions for that. Yeah. I had to do Where's the water? Something. Also, I do want to shout out PUBG. Oh, PUBG, dude. Oo, you put Fortnite. I actually think it's PUBG in Tommo just",
            "start": 1518.56
        },
        {
            "text": "my career decisions for that. Yeah. I had to do Where's the water? Something. Also, I do want to shout out PUBG. Oh, PUBG, dude. Oo, you put Fortnite. I actually think it's PUBG in Tommo just in I think Well, I think both of them. Yeah. Yeah, you're right. I mean, now it is cuz PUBG had influence on like accelerating the battle royale genre, but Fortnite I think is beyond that, right? Like Fortnite is it's battle royale, but also it's like monetization and all that stuff. Yeah. Yeah, you're right. So, I'll I'll PUBG under Fortnite only because the opening thing says uh contemporary giants release mere months ago. I'm trying to think of like what came out. Astrobot. That's not influential. Influential, you know. Yeah. But like what else? Last year. Could it be metaphor? What's it in? Yeah. And it's like I think like games that are coming out mere months ago, it's like too early to say that they're influential because we don't know what the impact on. Well, I think that's where that",
            "start": 1572.56
        },
        {
            "text": "And it's like I think like games that are coming out mere months ago, it's like too early to say that they're influential because we don't know what the impact on. Well, I think that's where that that's where the [ __ ] comes in. Oh god. You know what I mean? The public. Yeah. Yeah, cuz I mean technically what like there's nothing that would have came out a few months ago that would be influential by now. Also, did we say Balders's Gate 3? No, I think you get Balders's Gate 3 on that list. I mean, have we seen that influence anything? Yeah. Like if we're going that rabbit hole that it's like coutour, you know, like Yeah, but like they're saying the spans everything like I bonus 3 I can see being influential. You know what I mean? Like I think it will in the long run. I wonder. I mean I like that'd be cool, but I don't know, man. just and I'm only putting that because they say like this is like spanning up until maybe even a few months ago. So like there has to be something. If I'm",
            "start": 1622.48
        },
        {
            "text": "like that'd be cool, but I don't know, man. just and I'm only putting that because they say like this is like spanning up until maybe even a few months ago. So like there has to be something. If I'm picking one game from the last couple years, it would be BG3 or Elen Ring. Elden Ring. Yes. But even that more likely. Influential is a weird one, but yeah, just for recent games, you know. Yeah. If there had to be a recent game, I think Elden Ring, but I also struggle to think about like what that actually means. Yeah. All right, because if every list is just popular games, then it doesn't matter. You know what I mean? But anyway, let's get into it. Before Oh, before we move on, somebody said Bellatro. Could that be it? I don't know. I mean, again, I feel like these recent games, it's impossible to talk about influence because we don't know what's going to influence or how it's going to. Unless time travel. Think about it. Think about it. during this ad break. Of course,",
            "start": 1661.6
        },
        {
            "text": "it's impossible to talk about influence because we don't know what's going to influence or how it's going to. Unless time travel. Think about it. Think about it. during this ad break. Of course, patreon.com/confunny youtube.com/conf funny games, Spotify and Apple podcast where you can go to get the kind of funny membership uh which allows you to get shows adree. And speaking of ads, let us tell you about our sponsors. This episode is brought to you by BetterHelp. We all know that therapy can feel like a lofty investment, but we also know that there's nothing better to invest in than yourself. The state of your mind is just as important as your physical health. Let's talk numbers. Traditional in-person therapy can cost anywhere from 100 to 250 per session, which adds up fast. But with BetterHelp online therapy, you can save on average up to 50% per session. Therapy should feel accessible, not like a luxury. With BetterHel, you pay a flat fee for weekly sessions, saving you big on cost",
            "start": 1708.72
        },
        {
            "text": "online therapy, you can save on average up to 50% per session. Therapy should feel accessible, not like a luxury. With BetterHel, you pay a flat fee for weekly sessions, saving you big on cost and on time. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. And it isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. Your well-being is worth it. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindafoney. betterhelp.comkindfunny. And we're back. I want to shout out the chat that says we forgot to mention Breath of the Wild. Yeah, that's great on our part. Yeah. Yeah, that's that's nuts on our part, but yeah, I'll put that in there if we're talking about recent stuff.",
            "start": 1750.88
        },
        {
            "text": "that says we forgot to mention Breath of the Wild. Yeah, that's great on our part. Yeah. Yeah, that's that's nuts on our part, but yeah, I'll put that in there if we're talking about recent stuff. Climbing. Yeah. I mean, honestly, just opening conversation. Yeah, that's here's the thing. Talking about influence, there are multiple Breath of the Wild likes. We see games and we're like, \"Oh, looks like Breath of the Wild all the freaking time.\" Yeah, whether that's visual style or uh gliding or climbing, it might not have been the first to do it, but it's the one that did it that way. Yeah, Kab in chat says, \"I disagree with Breath of the Wild. It didn't influence anything.\" Kabs, I'm tired of your anti Breath of the Wild [ __ ] campaign. Also, aren't you a fan of Immortals Phoenix Rising, the game that is just a lesser Breath of the Wild? No, no, no. They made that in a They made that in a silo. They didn't play Breath of the Wild. No, they made that out of their own brains. [ __ ]",
            "start": 1803.28
        },
        {
            "text": "the game that is just a lesser Breath of the Wild? No, no, no. They made that in a They made that in a silo. They didn't play Breath of the Wild. No, they made that out of their own brains. [ __ ] people at Ubisoft were sitting there. They're like, \"Yo, what if we made a game that was open world that had puzzles and looked exactly like this other game?\" We haven't seen this other game, though. You know what I mean? We're Ubisoft. Like, no kebabs. I had a dream that I quit this job, quit jobs in general, and all I did was go on a quest once uh the Switch 2 comes out to 100% Breath of the Wild and Tears of the Kingdom. That's all I did with my life. [ __ ] Good for you. It's a good dream. Good for you. I had a dream last night that they announced Joker for Smash and then I woke up and I was like, \"Oh, Joker's already in Smash.\" That's how good Smash Ultimate is. Smash Ultimate, everyone. That's how good Smash Ultimate is. I was so hyped. Dream about a memory. Hell yeah. Let's hop into",
            "start": 1840.8
        },
        {
            "text": "like, \"Oh, Joker's already in Smash.\" That's how good Smash Ultimate is. Smash Ultimate, everyone. That's how good Smash Ultimate is. I was so hyped. Dream about a memory. Hell yeah. Let's hop into this list. Of course, this is coming from uh baft.org. Um All right, let's do it. Let's do it. Number 21. Interesting. Grand Theft Auto. Okay, I disagree with this. Okay. In 1997, Dundy's DMA design produced one of the greatest great success stories of the British video game industry. GTA wasn't the first game to let you play the bad guy, but it was the one that popularized the idea of video games letting you indulge in transgressive acts across a realistic urban sandbox. No, this is a bad pick. It's a bizarre pick, but I'm not mad at it yet. I'm mad at it cuz think about it. You don't get GTA 3 without GTA. See, that that's taking this whole thing too far. That's That's going too far. We're getting Rogue on this list. I mean, we might get respect. I don't I don't know if I respect Grand",
            "start": 1878.76
        },
        {
            "text": "3 without GTA. See, that that's taking this whole thing too far. That's That's going too far. We're getting Rogue on this list. I mean, we might get respect. I don't I don't know if I respect Grand Theft Auto one. If we are going to like like not only are we looking at the [ __ ] like, you know, the bottom of the of the tree, we're digging underneath and looking at the roots to see where everything truly comes from. I don't know. I could This is a weird pick, but also Yeah. If we get Rogue, if we're talking about Pong, if we're talking about the [ __ ] roots of everything, that's not influence though. That's not the thing that influenced. I'm not I'm not mad yet. I'm not mad yet. Reverse Nepo [ __ ] Nepo Queen Tim. Yes, Nepo Queen. At number 20, Skyrim. Yep. So far, I mean, GTA is weird, but I'm not mad at Skyrim. Two things into the list. felt pissed off about the first one cuz everybody was like everybody was making it seem like entry by entry this [ __ ] was going to be a trash",
            "start": 1930.24
        },
        {
            "text": "but I'm not mad at Skyrim. Two things into the list. felt pissed off about the first one cuz everybody was like everybody was making it seem like entry by entry this [ __ ] was going to be a trash fire. No man, Skyrim was is one of the very few games that any games media person that was at that E3 when they showed this has a memory of how it took everything over. Yeah. Like this game was different. Remember 11 1111? Yeah, man. We're never going to get that again. No, that's how time works. Like, oh, never mind. That doesn't work. I was going to say like, we get like a 22 22 22. N get that again. The one and only. Damn, that's crazy. I remember Watchmen. They they were 369 Tim. Remember that? Did we never did we not get a 12 1212? People didn't want to release on December 12th. Wasn't that the end of the world? Uh, by the Mayans. Yeah, it was sometime in December. That was the Mayan apocalypse. Yeah, which didn't happen. Also, like what what happened to Coney? remember why did you say",
            "start": 1982.24
        },
        {
            "text": "the end of the world? Uh, by the Mayans. Yeah, it was sometime in December. That was the Mayan apocalypse. Yeah, which didn't happen. Also, like what what happened to Coney? remember why did you say that as if it's a looming threat? It could be. I didn't get an update on him. Is he around still? Like, should we be doing something about Coney? All right. Holy [ __ ] At number 19, we got Grand Theft Auto 3. That's awesome. GTA 3 is number 19 and GTA 1 is number 21. Why would you even put them this close together? This is so that's bizarre. That's bizarre. I mean, I'm happy it's here. The way the votes came down, even with the way one was talked about, like, no, I don't I don't stand by that. See, here's the thing that I'm curious about. You ask the public was you're so caught up in this public thing. Well, no, cuz like I It's Do you know what it is? is because I do all the kind of feudy polls and I sift through the answers. And so often when people write into polls, they don't know how",
            "start": 2029.68
        },
        {
            "text": "thing. Well, no, cuz like I It's Do you know what it is? is because I do all the kind of feudy polls and I sift through the answers. And so often when people write into polls, they don't know how to write in for accuracy. And so I did my thing unplugged. Okay. Uh and so I will have to assume when they write in like Final Fantasy sometimes depending on the question I'm like, \"Oh, they mean Final Fantasy 7.\" Like I just got to assume that they actually mean this other thing. And as someone who does the game of the year, like all that stuff, it's just like sometimes the math just [ __ ] maths and it's a weird Yeah. Yeah. So I'm like with this poll, did you guys see a bunch of people riding with Grand Theft Auto and then he went, \"All right, Grand Theft Auto 1 is the one.\" When you know in your head that they actually meant Grand Theft Auto 3, they have to They're They're more responsible. I'm just saying that. Unless they're using AI to compile this [ __ ] [ __ ] [ __ ] I'm just saying",
            "start": 2088.96
        },
        {
            "text": "head that they actually meant Grand Theft Auto 3, they have to They're They're more responsible. I'm just saying that. Unless they're using AI to compile this [ __ ] [ __ ] [ __ ] I'm just saying it's happening more and more. At number 18, we got Dark Souls. Makes sense. Makes sense. Absolutely. So far, numbers 201, 19, and 18. It's a good top 20. I'll say that. It's a good top 20 so far. Even though GTA 3 should be in top five. We didn't talk about that. Should be in like That should be at least top 10. Yeah, for sure. That should be higher than Dark Souls. Yeah, even though Dark Souls should also be higher, I think. But All right, that's number 18. At number 17, Final Fantasy 7. Interesting. Can you read it? Yeah. Uh, arguably no game has more completely justified Sony's decision to take console gaming from cartridges to CDs with the original PlayStation. That additional storage didn't just allow Final Fantasy to move from 2D sprites to 3D polygons. It afforded Square Enix the",
            "start": 2132.16
        },
        {
            "text": "take console gaming from cartridges to CDs with the original PlayStation. That additional storage didn't just allow Final Fantasy to move from 2D sprites to 3D polygons. It afforded Square Enix the opportunity to tell an emotive tale via expansive cutscenes. that it has required more than two games to remake speaks volumes to the legacy of its story which more than a quarter century on features one of the medium's most famous and heartbreaking deaths. I don't know that I stand with this for influence, man. Like even what what did they just say about influence? What's any of that? What did this influence? I mean, I guess it's I think it is that line between influence and impact cuz I think this is probably one of the most in Final Fantas one of the most impactful games of all time. And I think that's almost like what they're talking about here a bit more because I understand what they're driving at as far as like what you can do with CDs and what Final Fantasy 7 was able to do with the",
            "start": 2179.12
        },
        {
            "text": "that's almost like what they're talking about here a bit more because I understand what they're driving at as far as like what you can do with CDs and what Final Fantasy 7 was able to do with the CD, right? And then also when we have the game being remade over the course of a decade right now, right? Like that is a franchise or that is a a game entry. Yeah. And that has Yeah. become a franchise, right? It has stayed. It has permeated. I mean, but just thinking about like what games did it influence and what what did the game itself influence? I don't know that I literally like look at things and go, \"Oh man, it's Final Fantasy 7. It's Final Fantasy, sure, as a franchise, but like I don't know. I mean, part of me also wants to say like, could Final Fantasy 7 just also be the Final Fantasy pick? Talking about even just the GRPG pick, talking about how big GRPGs are in the in the gaming space. But if that's the case, in the way that you have GTA and GTA 3, it's like, are you just going",
            "start": 2220.0
        },
        {
            "text": "pick? Talking about even just the GRPG pick, talking about how big GRPGs are in the in the gaming space. But if that's the case, in the way that you have GTA and GTA 3, it's like, are you just going to put Final Fantasy 1 there then? Maybe, maybe, maybe Dragon Quest one, Persona 1. At number 16, we got Balders's Gate 3. I I think this is too early to say it's influenced anything. Yeah, me too. I think it's the best iteration of this type of CRPG, but Dungeons and Dragons influence on games is incalculable. Uh Lyan Studios multi-awward winner, the latest uh and perhaps greatest of all D and D inspired adventures is the new standard by which all tabletop inspired RPGs will be judged. Beating out Nintendo's astonishing Tears of the Kingdom to multiple game of the year prizes is the least of his accomplishments. Actor Neil Nubin, who plays the unforgettable Asterion, rightly points out that its depth of interaction, romances, and also friendships, storytelling, and freedom have helped",
            "start": 2261.6
        },
        {
            "text": "of his accomplishments. Actor Neil Nubin, who plays the unforgettable Asterion, rightly points out that its depth of interaction, romances, and also friendships, storytelling, and freedom have helped legitimize games as an art form. Okay. Well, I disagree with that last part. I don't think Balders E3 is the reason why games are an art form. No, I don't agree with this. That's a that's a quote. I I I'm I'm with you guys that it's way too early. I do think like if you had to pick something for the last few years that is going to end up being one of those ones that we talk about. Yeah, Balders Gate 3. I think Balders Gate 3 is right next to Elen Ring in like Breath of the Wild for that stuff. I would hope. I just think that that's the type of easier said than done type thing. If we're talking about what's going to be the downline influence of Balders's Gate and you're telling me that it's going to be incredibly wellrealized characters and story and stuff, it's like, all right, that's",
            "start": 2311.68
        },
        {
            "text": "about what's going to be the downline influence of Balders's Gate and you're telling me that it's going to be incredibly wellrealized characters and story and stuff, it's like, all right, that's that's a lofty ass thing to to be inspired to do. You get what I'm saying? Like, but I think it's more will be in the pudding on that one. I think it's more so like depth of writing and how you tackle characters and like how you like tackle RPG interaction. Like Balders Gate 3 is one of the rare RPGs where legitimately I'm like, \"Oh, this is an RPG. This is a game where I feel like I'm actually role- playinging these characters and I'm actually like I feel like I am a character in uh in the story.\" A lot of other video game RPGs almost see like they're role playing as tabletop RPGs, if you know what I mean, where it's like, \"All right, cool. I got choices, but I know how limited this is.\" I just my only stance on this is I think Balders's Gate is too good and too unique of a unicorn in this",
            "start": 2349.36
        },
        {
            "text": "what I mean, where it's like, \"All right, cool. I got choices, but I know how limited this is.\" I just my only stance on this is I think Balders's Gate is too good and too unique of a unicorn in this situation that like I just don't see that happening. I can see people trying but like Super Metroid is and Symphony of the Night are impactful because or uh influential because they've influenced other games that like are able to like match that energy and like do things. We'll see. I just think that that's like it might be too good. It might be too much of a a new standard that no one else is going to be able to hit. I think there's not going to be a another Well, I'm not gonna say there's not gonna be another. I think more AAA and more RPGs in general going forward are are going to have to look at Balders's Gate 3 and like their design and like in like all right, how do we make a how do we make an RPG aa RPG that's going to actually live up to the standards that people have now because",
            "start": 2388.16
        },
        {
            "text": "look at Balders's Gate 3 and like their design and like in like all right, how do we make a how do we make an RPG aa RPG that's going to actually live up to the standards that people have now because of Balders's Gate 3. I I legitimately think that going forward like any AAA developer making one of these games is has to look at this. But we'll see. Again, like this is a weird one because it is so early that it it's hard to argue that it belongs on this list, but since they're trying to span up until modern times, I'm not as mad at it. At number 15, we got World of Warcraft. Yep. Makes sense. Makes total sense. Here's the thing. It's like when these pop up and it's like, \"Oh, I don't even need the explanation.\" Yeah, we know. We know. At number 14, we got Metal Gear Solid. Mhm. People were acting like this is a crazy list, man. What's that mean for the parts? That's Oh, man. And number Yeah, cuz middle gear solid makes so much sense. Totally. Yeah. At number 13, we got Pong. Mhm. Yeah,",
            "start": 2432.8
        },
        {
            "text": "acting like this is a crazy list, man. What's that mean for the parts? That's Oh, man. And number Yeah, cuz middle gear solid makes so much sense. Totally. Yeah. At number 13, we got Pong. Mhm. Yeah, makes sense. At number 12, we got Tomb Raider. Interesting. Very interesting. Can you read the blurb on this one? Because I immediately don't agree. Only a handful of characters transcend video games. The likes of Sonic, Mario, and Pikachu are almost universally recognized, and Laura Croft belongs on that short list. The intrepid archaeologist was born out of necessity. Designer Toby Guard uh wanted to make an Indiana Jones-like game, but it would have been too costly to create two playable characters. Guard stuck with his preferred choice, and the result was a new gaming icon. As actor Jane Perry explains, quote, \"Lara opened the door for strong female characters in games. She's a positive role model for everyone and a true hero.\" End quote. I This seems like a bit of a stretch. Like as",
            "start": 2477.2
        },
        {
            "text": "Perry explains, quote, \"Lara opened the door for strong female characters in games. She's a positive role model for everyone and a true hero.\" End quote. I This seems like a bit of a stretch. Like as again, what did that say about what this list is actually about? Not much. I do think an argument could be made. I don't agree with it for this but like could be made of Tomb Raider does have a if not unique rare ability to transcend being more than just a game like everybody knows who Tomb Raider right in a way that is only can be said about things like Mario or Pikachu. Yeah, that's very impressive for the type of game that it is and all of that stuff. Um, and like the Angelina Jolie movies were like real huge huge deals outside of video games and like but there was also an interest because of what it was. So I don't know maybe that influences like oh video games cannot be just video games and like characters could be more but like I don't know. I I see it I I I respect it being on the",
            "start": 2534.32
        },
        {
            "text": "of what it was. So I don't know maybe that influences like oh video games cannot be just video games and like characters could be more but like I don't know. I I see it I I I respect it being on the list. I think seeing it above some of the other things we've seen so far is a bit questionable. Um, yeah. That's my thing is I I'm starting to feel like this isn't ranked. Like even if they say it is like it we're just when we're talking about things like influence, it's hard to rank influence, right? True. Cuz we're not just talking about like the quality of the game or all that. It's like literally like ranking on the list. I almost just feel like this list shouldn't have been ranked. I feel we'll see. I'm with you as far as if I was making this list, I probably wouldn't have ran ranked it just for the nature of it to what you're saying. I look at this as in the same vein as Final Fantasy 7 where I think this is more impact than influence. Snowbike Mike in the chat says Tomb Raider has",
            "start": 2587.36
        },
        {
            "text": "just for the nature of it to what you're saying. I look at this as in the same vein as Final Fantasy 7 where I think this is more impact than influence. Snowbike Mike in the chat says Tomb Raider has to be on this list 100%. Mike, if you have an argument, I'd love for you to come in here and explain it. He really loves the second movie because I should call Cradle of Filth Cradle. Cradle of Filth. Um but yeah, I think this is I think Tomb Raider is impactful as hell, right? It goes back to the Final Fantasy 7 thing. It goes back to the thing we're saying of like everybody knows who Tomb Raider is. Everybody knows who Laura Croft is, right? You want to talk about Yeah. opening doors for more female characters to be in in video games. I think maybe you can make that argument, right? Like I think there are things you can say regarding how big of a franchise Tomb Raider is. even but like and maybe it's like it checks enough of those boxes where it makes it the uh best case scenario for",
            "start": 2624.48
        },
        {
            "text": "I think there are things you can say regarding how big of a franchise Tomb Raider is. even but like and maybe it's like it checks enough of those boxes where it makes it the uh best case scenario for one game representing multiple of those things because like even for like the translation through to other mediums. I feel like you could make the argument for like a Mario or a Sonic or a I mean Pikachu would be Pokemon would be the number one for me to pick of like oh a transcendent franchise. But yeah, I'm not I'm not mad at it on this list based on it being most influential. I'd move it down. Like I think this could have been number 21. Um, but I'm not I'm not necessarily blown away uh by it being on this list. Number 12 is kind of high, but yeah, I'm I'm with you of like maybe this shouldn't be a ranked list. At number 11, we got Tetris. Hell yeah. Oh, yeah. One I forgot to mention, Mortal Kombat. That should be here. You know, I was thinking about that. I think Street Fighter 2 is",
            "start": 2664.72
        },
        {
            "text": "be a ranked list. At number 11, we got Tetris. Hell yeah. Oh, yeah. One I forgot to mention, Mortal Kombat. That should be here. You know, I was thinking about that. I think Street Fighter 2 is probably the if we're going to just have like a fighting game representative. Yeah. See, I was thinking more ESRB. Okay. Like the the when I mean and again back into the conversation of Tomb Raider and all that [ __ ] right? Like transcendent franchise, everybody knows Mortal Kombat, but then also Yeah. And actually influence ESRB stuff. That's that's actually Yeah, that is the definition of influence there. I'll take that. Yeah. and number and also shout out to Tetris. But uh actually no, I was going to I was going to answer my own question. I was going to be like what has Tetris influenced? But there are so many Tetris-l like video games and then also if it influenced the success of the Game Boy and so can't look past that. And also just video games maturing as a medium as well. At number 10,",
            "start": 2713.52
        },
        {
            "text": "are so many Tetris-l like video games and then also if it influenced the success of the Game Boy and so can't look past that. And also just video games maturing as a medium as well. At number 10, we got The Sims. Yeah, you called it out. Here we go. Interesting. Can you read this one? Uh, having simulated a city, Will Wright and Maxis decided to zoom in and let you take control of its inhabitants. The result was effectively a virtual doll's house that let you set your own goals for your characters. Uh, would you give them a better life or turn their world into a waking nightmare? The Sims expanded the medium's audience, attracting more casual and female players and later providing a safe space for LGBTQ plus players to express themselves. As voter Anna Higgs explains it, it was a quote, \"A god game that became a social phenomenon. It brought joy. It made us all feel a bit more in control of our lives, even if the baby was on fire on the kitchen floor.\" End quote. You know what? Like,",
            "start": 2760.72
        },
        {
            "text": "god game that became a social phenomenon. It brought joy. It made us all feel a bit more in control of our lives, even if the baby was on fire on the kitchen floor.\" End quote. You know what? Like, I I feel like we should have had more conviction with the Sims when we talked about it earlier, cuz Yeah, definitely. Like when you look at even just things like Animal Crossing and all the like the cozy sim games and all that stuff, like I feel like there's multiple forks in the road that to some extent can easily be traced back to Sims and the people that like Sims like all of these new types of games. So Sims before was that before GTA 3. It was right. It must have been very similar timing, right? 90s. Yeah. Sim cuz Well, the first Sims was on 98. I know it was PC, but was it like on Super Nintendo or No, I'm thinking of Sim City. No, you're thinking Sim City. Uh, which was a Nintendo published game. Wow. The Sims was 200 from when GTA 3 was 2001. Gotcha. Gotcha. Okay. Well, around the",
            "start": 2809.12
        },
        {
            "text": "Nintendo or No, I'm thinking of Sim City. No, you're thinking Sim City. Uh, which was a Nintendo published game. Wow. The Sims was 200 from when GTA 3 was 2001. Gotcha. Gotcha. Okay. Well, around the same time cuz I was going to say like I think the sandbox elements of what makes Sims special, right? Like that is also part of what why we rever a game like GTA 3 and like what how that permeates. I think the sandboxiness of like I'm going to trap this person in a pool, watch them drown. Like be a game letting you do that. It's crazy for sure. At number nine, we got HalfLife 2. Again, I don't understand why people were so mad at this list. And I don't want to I know I'm saying that too early. There's still a lot of game There's still a lot of game left on the board. I mean, there's eight left, right? But I'm not mad at this. So, what are we missing? But yeah, let's go back to our list. What are Mario? I mean, there's no Mario. There's no Zelda. Um, have we gotten GTA 3 on this list? Yes,",
            "start": 2853.36
        },
        {
            "text": "right? But I'm not mad at this. So, what are we missing? But yeah, let's go back to our list. What are Mario? I mean, there's no Mario. There's no Zelda. Um, have we gotten GTA 3 on this list? Yes, we got it. Was number 19. Um, I mean, we got Pong, we got Tetris, we've not seen Pac-Man, but like cool. Um, Street Fighter 2. Um, let's see. Did we get Dark Souls? Yeah, Dark Souls is on here. Dark Souls on there. We got Mel. Yeah. Yeah, we got Mel Solid. Uh, we got FF7. We've not seen Pokemon yet. We've not seen Fortnite. We've not seen PUBG, Minecraft. Uh, we saw Did we see World of Warcraft? Yes. Yes. Um, no Hades. Um, Limbo Journey, Meat Boy, Cave Story. We've not seen any of those. No sports games yet. No RE4. Um, Last of Us. We've seen Skyrim. Uh, no Super Metroid. No Candy Crush. We've seen Balders Gate 3. Uh, and no Breath of the Wild. Okay. Yeah. I mean, so there's a lot left. There is a lot left that they could leave out. But depending on what they choose to leave out here, I",
            "start": 2897.76
        },
        {
            "text": "seen Balders Gate 3. Uh, and no Breath of the Wild. Okay. Yeah. I mean, so there's a lot left. There is a lot left that they could leave out. But depending on what they choose to leave out here, I could see this landing. Well, so what's interesting about HalfLife 2 here is like, okay, cool. What's the influence of it? I feel like it would be here for kind of the storybased firsterson shooter. But then there's also the kind of physics side of it, right? Halfife 2 is influential because it is kind of where gaming meets tech and like pushing tech forward. Um, and yeah, I feel like you can really kind of like draw lines between a lot of very successful games that came after to HalfLife 2. You can say Halfife one as well, but I do think Halfife 2 was a demonstrable step up in a way that actually mattered. it it felt like a big uh technological leap for what gaming can be. And I think that it Halfife 2 and like the Orange Box in general kind of I think imagine uh very much inspired a",
            "start": 2945.12
        },
        {
            "text": "actually mattered. it it felt like a big uh technological leap for what gaming can be. And I think that it Halfife 2 and like the Orange Box in general kind of I think imagine uh very much inspired a generation of game developers to make games. Good call. At number eight, we have Super Mario 64. Love seeing my guy. We cooking. We cooking. And yeah, eight. I mean, that's that's good. I I think it could be higher, but I think this is good as well. Yeah. Not seeing top five definitely feels weird, but yeah. Yeah. I don't think I don't think we see Super Mario Brothers one on here. Yeah. Simply crazy. I mean, we'll see. I think that's nuts. If Mario 64 at number eight makes you think that maybe you got Mario Brothers, Super Mario Brothers at one or two. I mean, Mario Brothers is number one. Like, if this is a ranked list, like I think just she surely by definition of what we're talking about. Yeah. We'll see. At number seven, we got what? Kingdom Come Deliverance, too. No [ __ ] shot. I",
            "start": 2992.4
        },
        {
            "text": "Like, if this is a ranked list, like I think just she surely by definition of what we're talking about. Yeah. We'll see. At number seven, we got what? Kingdom Come Deliverance, too. No [ __ ] shot. I need you to read each and every one. No [ __ ] shot. Okay, now I get why the Oh, what the [ __ ] Yo, what influence has this had, Tim? Kind of funny. It's [ __ ] up. We didn't play this game. I I saw the Reddits. I saw the comments. I saw everybody. We didn't play the first true masterpiece of 2025 yet. We should have played this video game trailer. Yeah. What the what? What? They put it right above Mario 64. Oh my god, that's so Wait, I need you to read it. Bless. I need you to read it. Not even two months old, the most recent entry in our list has clearly attracted a vocal and supportive fan base. offering offering a a hensibly rendered and wonderfully open-ended sandbox where you're free to shape every man where you're free to shape every man apprentice Henry as you please. Deliverance",
            "start": 3043.52
        },
        {
            "text": "base. offering offering a a hensibly rendered and wonderfully open-ended sandbox where you're free to shape every man where you're free to shape every man apprentice Henry as you please. Deliverance 2's commitment excuse me to authenticity found favor among voters. The word immersive showed up in more responses uh than for any other game. If its future impact has yet to be determined, this historical RPG has already left a mark on its players. As one put it, quote, \"It gives me hope for the future of gaming.\" Oh, great. There's no chance that this game is on uh most influential game list in five years. You don't think so? No. Zero chance. I think it like it definitely has an audience. People who've played it like really [ __ ] love it. But in terms of like being influential, I feel like what this game does, there's been so many games before it that have done that. What is this game doing differently and new that's going to inspire a next generation of video games? That's like a big",
            "start": 3097.68
        },
        {
            "text": "what this game does, there's been so many games before it that have done that. What is this game doing differently and new that's going to inspire a next generation of video games? That's like a big question, right? I'm I'm I'm going to play especially it being too much two months old. It's very much like, okay, yes, a bunch of to be I want to take devil's advocate here. Think of all the games that have been influenced by Kingdom Heart Kingdom Come: Deliverance 2. You know, like think about the [ __ ] up. That's hilarious. This definitely feels like a like uh they knew about this poll and like the entire fan base came in because they're upset that you know us and other outlets haven't covered it uh every single day of every single hour. So they're like we need it to be on this list and voted the [ __ ] for it. You know damn that's tough man cuz I was I was honestly I was going to defend the [ __ ] out of this list even though it has had some slip ups. I was going to go to bat. This is",
            "start": 3145.44
        },
        {
            "text": "the [ __ ] for it. You know damn that's tough man cuz I was I was honestly I was going to defend the [ __ ] out of this list even though it has had some slip ups. I was going to go to bat. This is one of those ones where one entry, a singular entry can just ruin an entire list. Yeah, I'm not going that far cuz I I still think that this is a good list. I'm taking out the ranked aspect of it in my mind cuz I think that that is it's silly and like easily I no one will ever agree about that stuff. Mhm. GTA 1, no. Kingdom Come Deliverance, no. Um Balders's Gate 3, I'm on a wait and see. I get it, but we'll see. Yeah, that's too early. Besides that, I think this list is kind of our list, but hey, we have six more to go. So, let's see. Let's see. And number six, Minecraft. Yep. Which is great. I'm laughing cuz you sandwiched Kingdom Come: Deliverance 2 between Mario 64 Minecraft. Yeah. Yes, this makes sense. Um, shout out Minecraft and number five, The Legend of Zelda: Ocarina of Time. This",
            "start": 3191.68
        },
        {
            "text": "laughing cuz you sandwiched Kingdom Come: Deliverance 2 between Mario 64 Minecraft. Yeah. Yes, this makes sense. Um, shout out Minecraft and number five, The Legend of Zelda: Ocarina of Time. This list is so funny because it's so good. I mean, they're [ __ ] such a left turn. are just weird ass choices. Like it's like you have like it's like you have a friend that's in your close friend circle where you're like you've known him for years and you're like, \"Oh man, I rock with this guy.\" And they just say something racist against the most random group of people and you're like, \"Wait, when did this happen? When did you not when did you start liking those folks? Why would you say those words?\" Hey, Barry, can you do me a favor? What? I have a conspiracy theory. Can you go back to the beginning of the list and I want to see how they spell out Grand Theft Auto? Okay, there's Grand Theft Auto. Can you go down to 19? Grand Theft Auto 3. Okay, my theory was going to be one of them said GTA",
            "start": 3242.4
        },
        {
            "text": "of the list and I want to see how they spell out Grand Theft Auto? Okay, there's Grand Theft Auto. Can you go down to 19? Grand Theft Auto 3. Okay, my theory was going to be one of them said GTA Grand Theft Auto. There's going to be some [ __ ] SEO [ __ ] trying to gain the system. Kingdom Come Deliverance. Everyone's searching for it. Yeah, let's put it there. But no, that theory has been debunked. Spoon case has been there. Bless. I'm glad that's resonating with you, chat. God. All right. All right. That was number five. At number four, Halflife One. Cool. All right. Double dipping. Okay. Not mad at it. I mean, I'm a little mad just for like I guess you know what? But again, I was saying HalfLife one in terms of the single player story campaign like that that they [ __ ] did it. Two, the tech pushing the tech forward, man. That changed things. That opened game design. See, I feel like we could have consolidated here a little bit. We could have, but I'll let it slide. I think you",
            "start": 3286.24
        },
        {
            "text": "the tech pushing the tech forward, man. That changed things. That opened game design. See, I feel like we could have consolidated here a little bit. We could have, but I'll let it slide. I think you gave such a good argument for Halfife 2 that I'm I'm not as mad as I would have been. And and earlier we were saying or I was saying that um we have um Pac-Man, Miss Pac-Man, it's like the modding scene like HalfLife created Counter Strike, you know what I mean? Portal, like all these things came from this game. So, we're down to top three. There's three spots left on the list. Are there things that we need to see in this top three? Super Mario Brothers. If you're having GTA and GTA 3 and if you're having Halfife one and two. Yeah, dude. You gotta have Super Mario Brothers. Super Mario Brothers. What are the two other games you think? I feel like they've got all the ones that I'm like, if they don't [ __ ] have this, I'm going to punch somebody besides Mario. Resident Evil 4. You got to",
            "start": 3335.6
        },
        {
            "text": "What are the two other games you think? I feel like they've got all the ones that I'm like, if they don't [ __ ] have this, I'm going to punch somebody besides Mario. Resident Evil 4. You got to have Resident Evil 4. Honestly, you need Street Fighter 2. If you don't have Street Fighter 2, that's insane. I don't think we see Street Fighter 2. Think about arcades. Think about what it did for multiplayer. Think about just character select screens, health bars, like Yeah. Yeah. Fortnite we still haven't seen. Oh, wait. We've not seen Fortnite. No. Fortnite's number one. Fortnite's number one. There's no uh Battle Royale. You're right. Fortnite number one. Super Mario Brothers number two. Combos, dude. Street Fighter 2 better [ __ ] be there. I'm gonna say my prediction. I'm gonna say Resident Evil 4 instead of Last of Us. I'm gonna say, in fact, I'm gonna reorder my thing because I actually have a little bit of trust in them. So, I'm gonna say number one is going to be Super Mario",
            "start": 3380.48
        },
        {
            "text": "Evil 4 instead of Last of Us. I'm gonna say, in fact, I'm gonna reorder my thing because I actually have a little bit of trust in them. So, I'm gonna say number one is going to be Super Mario Brothers. I think number two is going to be Fortnite. And number three is going to be Resident Evil 4. We didn't even get Call of Duty. Do we think Black Myth Wukong uh shows up on this? No. No. No. But I I get where your head's at there, Barrett. Call of Duty. Actually, you're [ __ ] right. Yeah. Modern Warfare that that should be on the list. really should be on the list. Mhm. All right, let's get to number three. All right, and number three, we got Super Mario Brothers. All right, I can't hate this list, dude. Yeah, I can't hate it. They did good. I didn't do the perfect job. You're speaking. You're speaking. You're speaking soon here. I'm a little early. Two more spots left. There's two more spots left. There is. But hey, like I checking all the boxes. They're checking them, man. They're",
            "start": 3424.72
        },
        {
            "text": "You're speaking. You're speaking soon here. I'm a little early. Two more spots left. There's two more spots left. There is. But hey, like I checking all the boxes. They're checking them, man. They're checking them. At number two, we got Doom. Okay. Okay, I'm not mad at that. Okay, I'm not mad. So, I feel like with the last couple choices that we just saw, it's like, all right, it sucks that we're not also going to get Breath of the Wild or this or that or whatever, the halos and all that, but it's like I can see what they're trying to do. Yeah, at least we got King Deliverance. Again, not every choice has been perfect, but overall, I think it hit where it needed to hit. And like if you're not going to have a halo on here, which again to me is a little crazy like Doom if you want to take it all the way back, right? Like we were saying at the the top of the show here, Doom fits that mold in terms of Yeah. first person shooter. Yeah. All right. Number one. Number one. We got No [ __ ]",
            "start": 3472.08
        },
        {
            "text": "it all the way back, right? Like we were saying at the the top of the show here, Doom fits that mold in terms of Yeah. first person shooter. Yeah. All right. Number one. Number one. We got No [ __ ] Shut the [ __ ] up. Shut the [ __ ] up. No [ __ ] shot. We got Shenmue. Okay. What Shenmue? Shut the [ __ ] up. This is crazy. No. Okay. First off, I want to say Shenmu at number one is wild work. This is this is insane behavior. Like somebody needs to get checked hard. Having said that, I knew having said that. I knew I was going to say having said that, y'all don't know. Y'all don't [ __ ] know. Shenmue was incredibly influential. This game deserves to be on this type of list. This game was so open. You go out there talking to people, getting stories, and all this stuff like so ahead of its time. And I definitely we've heard so many different developers legitimately cite Shenmue as why they make their game design choices and all that stuff. Yes, I think Shenmue deserves a spot on this",
            "start": 3512.96
        },
        {
            "text": "time. And I definitely we've heard so many different developers legitimately cite Shenmue as why they make their game design choices and all that stuff. Yes, I think Shenmue deserves a spot on this list. Number one, hell no. Number 20, sure. That that's where I'm at. That's where I'm at. You know what? Fair. Like there's a lot for Shenmue of like game design where you look at it like playing Shenmue one nowadays, you're like, whoa, they were doing games like this back then? Mhm. There's there's so much here. here. What what do they say about it though? Uh they said a surprise number one in some respects. So yeah, this is definitely ranked. Uh and yet Suzuki's 1999 Opus increasingly feels like the original blueprint for the dynamic detailed settings that we have since become since uh settings that have since become the expected norm at gaming's bleeding edge. Settings used in such industry titans like Grand Theft Auto and Assassin's Creed franchises. The phrase living, breathing world",
            "start": 3570.64
        },
        {
            "text": "that have since become the expected norm at gaming's bleeding edge. Settings used in such industry titans like Grand Theft Auto and Assassin's Creed franchises. The phrase living, breathing world might be a marketing marketing cliche today, but when Shenmue arrived, it accurately described the game's astonishingly vivid rendition of Yokosuka, where uh Tacernn hero Rio Hazuki searches for his father's killer. And more than anything, this influenced Mega 64 to make one of my favorite Mega 64 sketches of all time. Rocco walking around the streets looking for the man that killed his father. You don't get better than that. That straightforward but absorbing revenge plot paid sec played second fiddle uh to simple pleasures of inhabiting such a convicting urban space with its own timetable. Non-player characters were granted lives of their own and so Rio would have would have to fit into their into their routines and rituals. In both its embrace of a slower paced lifestyle and its use of an",
            "start": 3615.36
        },
        {
            "text": "characters were granted lives of their own and so Rio would have would have to fit into their into their routines and rituals. In both its embrace of a slower paced lifestyle and its use of an in-game clock to dictate the players's activities, it could be seen as a precursor to Animal Crossing or Stardw Valley. The quieter moments and otherwise noisy blockbusters such as Uncharted 4, The Last Part Two, and God of War surely took their cues from Suzuki's game, and its spirit lives on through the increasingly popular Yakuza Like a Dragon series, which similarly encourages uh you to slow down every now and again. Shenmue may have struggled commercially on release, but if it felt out of step with its peers, that's only because it marched to its own leisurely rhythm. And as we all know, the genius of the true pioneers is often only appreciated after the fact. Its unique appeal is summed up by voter Jesse Strife. Quote, \"I played this game when it initially launched, and even now, I've yet",
            "start": 3663.76
        },
        {
            "text": "of the true pioneers is often only appreciated after the fact. Its unique appeal is summed up by voter Jesse Strife. Quote, \"I played this game when it initially launched, and even now, I've yet to encounter another game quite like it. Shenmue holds a special place in my heart.\" End quote. The Lou in the chat says, \"Shenmu started QTE,\" confirming what I I thought but wasn't sure about. Yeah, great write up. I I actually think that that's awesome. And yeah, them bringing up all the Animal Crossing and all just like the side quests and side things. Yes, like Shenmue at that time was such a thing of like it's a game you can just live in and like actually just live in it. Number one is insane like and more than that like I don't even think I can stand by an argument of top 10. Here's the thing that write up moved me. Yeah. I started tearing up a little bit. I was like, \"Damn, I got to play Shenmu. This [ __ ] sounds [ __ ] innovative.\" Oh my god, that's so freaking funny. Barry, you had",
            "start": 3704.96
        },
        {
            "text": "that write up moved me. Yeah. I started tearing up a little bit. I was like, \"Damn, I got to play Shenmu. This [ __ ] sounds [ __ ] innovative.\" Oh my god, that's so freaking funny. Barry, you had something to say. No, I was just saying it's insane. Yeah, I was just backing up what Tim was saying. Yeah, listen, I [ __ ] with that write up so hard that I might I I You might almost get a thumbs up for me, but not quite. It's There are too many mistakes on this list. Too many missteps. I won't even say mistakes cuz all this stuff is purposeful. These aren't mistakes. These are missteps. Yeah, I'm with you. I'm still giving it a thumb up. Not two thumbs up. I'm not enthusiastic about it. We always say we like when lists have something to say. Yeah. And you can't tell me this list didn't have something to say with Shenmue at number one and they tried backing it up. They showed their homework. I I just feel like the the omissions here, right? Like Street Fighter 2 to me is the the biggest",
            "start": 3745.92
        },
        {
            "text": "something to say with Shenmue at number one and they tried backing it up. They showed their homework. I I just feel like the the omissions here, right? Like Street Fighter 2 to me is the the biggest omission and a a battle royale. Yeah. No Fortnite feels incredibly off. And again, this is a fan pulled thing. Like this ain't this ain't on the bathtub necessarily, but like I think no Fortnite is is kind of wild. um BG3 here over Breath of the Wild if you want to talk about more recent type games. I know Breath of the Wild is 2017 now, but even still like that feels a bit off. No, Resident Evil 4 feels a bit off. Like that's wild. There's too many omissions plus weird inclusions like Kingdom Come Deliverance 2 that I makes me have to give the thumbs down. Yeah, I have to give the thumbs down as well. Like I again it's like almost there to being a thumbs up, but yeah, like Kingdom Come Deliverance to being above what was it? Mario 64. What do we have? Yeah. No Super Metroid either. Feels",
            "start": 3793.28
        },
        {
            "text": "as well. Like I again it's like almost there to being a thumbs up, but yeah, like Kingdom Come Deliverance to being above what was it? Mario 64. What do we have? Yeah. No Super Metroid either. Feels odd. Oh, yeah, man. Yeah. Just a lot of weird uh uh omissions here. Um even though a lot of the inclusions I do think are good. Like this had way more good inclusions than I would have thought based on how people were talking about it. And it has like I mean 95% of the inclusions are actually pretty good here. You know, I'm not mad. And we called them. And we called them. Yeah. Like you know, Mario 64, Halflife, Sims, like Ted, like this is a good even Tomb Raider. I'm like, you know what? I'm not mad at that. There's so many good. There's so much good here, but it's it's the bad that's full as a bunch for me. Yeah. Hey, that happens. Tim, this has been another episode of the Kind of Funny Games cast. This has been another episode of The [ __ ] List. And let me tell you, the [ __ ] list",
            "start": 3834.64
        },
        {
            "text": "as a bunch for me. Yeah. Hey, that happens. Tim, this has been another episode of the Kind of Funny Games cast. This has been another episode of The [ __ ] List. And let me tell you, the [ __ ] list always delivers. Not a bad episode of The [ __ ] List as far as That's true. That's true. Of course, each and every weekday we get together and talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, on podcast services around the globe. If you love what we do, support us with the Kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch us record them live and get a daily exclusive show. Catch today's KD on YouTube or podcast services and know that until next time, it's been our pleasure to serve you.",
            "start": 3878.08
        }
    ]
}