{
    "id": 13955,
    "video_id": "5pbfEXH4HiE",
    "show_name": "Screencast",
    "hosts": [
        "Tim Gettys",
        "Barrett Courtney",
        "Saige Ryan"
    ],
    "title": "Star Wars Andor Season 2 SPOILERCAST Episodes 1-3",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745528080,
    "duration": 3782,
    "transcript_chunks": [
        {
            "text": "[Music] a long time ago in a galaxy far far away, we used to talk about Star Wars almost every single week. And it has been far too long since the Ahsoka uh screencast breakdowns we have done. We are returning for Andor season 2. Of course, I'm your host, Tim Gettys. I'm joined today by Barrett Courtourtney. Tim, it's been way too goddamn long talking about Star Wars. Having Sage back on kind of funny content, having Carboni back. Oh, he's not here today. Why? He has to be in Japan to host Star Wars Celebration, you know? Whoop-dedoo. 10 years of doing Star Wars Celebration. Who the hell does he think? Gosh. Like, he doesn't understand the importance of Andor. andor season 2 episodes 1 through three. We had to be here. Sage, welcome back. How are you doing? I am so good. I am Well, I'm I have a fever. So, if my voice sounds funny, it's because I'm only standing by the power and motivation of Andor season 2 and also seeing my friends. I love it. I love it. So happy to have you back.",
            "start": 2.24
        },
        {
            "text": "I have a fever. So, if my voice sounds funny, it's because I'm only standing by the power and motivation of Andor season 2 and also seeing my friends. I love it. I love it. So happy to have you back. Here's the deal, everybody. Uh Andor season 2 is a show absolutely worth watching. I want all of you to watch this show. So, if you're not watching the show, you should. If you've watched it, watch it again. We got to support things like this. And here's the other deal. Because of how they're releasing this, three episodes a week for the next four weeks. Very cool because each week is going to cover one year leading into Rogue One, which of course then leads into Star Wars: A New Hope. Um, but three full 50inute dense episodes of prestige television a week is very complicated to cover. Uh, Tony Gilroy, the showrunner himself was like, \"Hey, I love that this is happening, but I feel bad for the podcasters. We are the podcasters.\" And not only that, we are podcasters that are dealing with",
            "start": 64.16
        },
        {
            "text": "Gilroy, the showrunner himself was like, \"Hey, I love that this is happening, but I feel bad for the podcasters. We are the podcasters.\" And not only that, we are podcasters that are dealing with busy schedules and we have Sage, we have Carboni. We're trying to get the four of us as often as possible to talk about all these uh shows, but of course that's going to come with a lot of inconsistencies week to week. So, just letting y'all know the plan going forward for the next 3 weeks is going to be every Friday at 12:30 p.m. Pacific. Uh as many of the four of us as can be there uh will be here covering this. The show does come out on Tuesday nights, but because there's three episodes, we want to give us as much time as possible to watch them, give y'all time to watch them, and to have us talk about that. And hey, if uh you want to wait, you can always watch this stuff later. Catch up at the show whenever you want to and then check out our full spoiler thoughts here. This will not just",
            "start": 112.0
        },
        {
            "text": "about that. And hey, if uh you want to wait, you can always watch this stuff later. Catch up at the show whenever you want to and then check out our full spoiler thoughts here. This will not just be a review. It'll be our thoughts or whatever, but it's full spoilers because what's the point of the show otherwise, right? Exactly. We got to we got to get into the nitty-gritty of it. Yeah. So, again, um I'm thinking that next Friday it will be all four of us together unless something goes horribly arry. Um but I'm very excited for that. But hey, that's the future. We're here now. This is our weekly andor breakdown. Thank you so much for joining us. Returning to Star Wars, you can watch it live on YouTube and Twitch. You can get it later on podcast services around the globe. You can get the kind of funny membership that gets you the shows ad free and a daily exclusive Gregway. You could also be a super cool Patreon producer like Anatoli asked, Delaney Twining, Carl Jacobs, or Omega",
            "start": 153.2
        },
        {
            "text": "the kind of funny membership that gets you the shows ad free and a daily exclusive Gregway. You could also be a super cool Patreon producer like Anatoli asked, Delaney Twining, Carl Jacobs, or Omega Buster. Today, we're brought to you by Imperial and Aura Frames, but we'll tell you all about that later. Forget all the housekeeping. We spent enough time talking. I want to get right into some Star Wars talk real quick. Been a while since we've talked about anything Star Wars. Yeah. Um, any top level thoughts on Star Wars post Ahsoka season 2? Sage, did you watch Skeleton Crew? Did you watch uh any of the the animated stuff they put out there? So, I watched Skeleton Crew. I'm not caught up on the animated stuff right now. I loved Skeleton Crew and I didn't feel like a lot of people were talking about it. Um, it was exactly what I thought it was going to be. It was The Goonies. It was childlike joy. It was uh looking at characters and going, \"Oh my god, if this character existed when I",
            "start": 188.96
        },
        {
            "text": "about it. Um, it was exactly what I thought it was going to be. It was The Goonies. It was childlike joy. It was uh looking at characters and going, \"Oh my god, if this character existed when I was a child, like I would be fundamentally changed forever.\" Like, don't get me wrong, I'm grateful I had Leia, but I'm trying to remember the name of the little girl with like the bionic features. Oh, yeah. Yeah. One I think the coolest kid in all of Star Wars. 100%. Uh, jumping off that, it's honestly, you took the words right out of my mouth. If I was a kid watching that show, like it would have changed everything. Not that Star Wars already didn't change everything, but like it really was. Skeleton Crew rocked. Like I feel like it was so different for Star Wars and we've seen many things try to be different, but I don't think necessarily succeed. I think Andor is the exception to that. Like it does something different and it very much succeeds. But Skeleton Crew, I I think that it like",
            "start": 236.56
        },
        {
            "text": "to be different, but I don't think necessarily succeed. I think Andor is the exception to that. Like it does something different and it very much succeeds. But Skeleton Crew, I I think that it like really was great. Like not the best thing ever of all time, but I don't think it needed to be. And I was entertained the entire way through. And there was more than a fair share of like big things that happened that I was like, whoa, I didn't like the big mystery of the planet was very satisfying to me. And and I think that show was great because it leaned into being different. I think sometimes some other Star Wars stuff when they try to be different. It's always like one foot in, one foot out. And this really leaned into being a Goonies pirate inspired adventure. Um it just happened to be in the Star Wars universe. And I think that's uh it really succeeded with that. and not just being a big fun mystery thing, but also getting characters like uh Chad is saying uh KB was the the character",
            "start": 275.04
        },
        {
            "text": "the Star Wars universe. And I think that's uh it really succeeded with that. and not just being a big fun mystery thing, but also getting characters like uh Chad is saying uh KB was the the character that we're thinking of of like really strong powerful moments uh with these kids uh having fun characters uh like Jude Law that feel so um uh Hondo inspired in ways and stuff like that. Uh yeah, really fantastic show. Yeah, really liked that. Um and then there was the acolyte which I still have not seen because it happened during my wedding uh time. So, I I was like way too busy. And one day I will go back and watch it because it is the only live action one I haven't seen. Um Barrett, you want to start off on your quick thoughts on that? I liked it. I I liked it more by the end of it cuz I think where that season ends, the things that they were setting up, I was like, \"Okay, I'm excited where we're at now and where this is going.\" throughout the show. It felt like a lot of weird choices",
            "start": 317.52
        },
        {
            "text": "where that season ends, the things that they were setting up, I was like, \"Okay, I'm excited where we're at now and where this is going.\" throughout the show. It felt like a lot of weird choices that were being made to get to those points. Um that had me on a roller coaster of of thoughts, but overall I I liked the vibe. Um I I liked the, you know, kind of teen ya angst of it all. Um, it felt very, it felt like a show that would have come out during uh, you know, Lucas still running things and like we're still in the middle of like doing the prequel trilogy in some positive and some negative ways. Uh, but I I overall had a good time. Very very uh, bummed out that it got cancelled or Yeah. is not continuing. What What did you think, Sage? I I loved the acolyte. Do I think it was like the best piece of Star Wars ever? But I no, but I think that we have to get to the point where we stop comparing everything to what's the best Star Wars because we're getting so much. Like it can't all be",
            "start": 360.72
        },
        {
            "text": "piece of Star Wars ever? But I no, but I think that we have to get to the point where we stop comparing everything to what's the best Star Wars because we're getting so much. Like it can't all be in competition with like is this Empire Strikes Back, right? Um I think it was a fun story and I do feel like the most disappointed cuz it felt like there was more story to tell there. Like it definitely feels unfinished to me um in that it was supposed to have another season. So I'm I'm bummed to see that. Obviously, we know where a lot of the like divisiveness and hate came from for the acolyte. Um, but yeah, I I think it's really wild when there's so much bad content out there that people were like the acolyte is bad. I do think it was sold not in the right way because it feels very much like the the trailers was like murder mystery kind of like almost cop detective procedural and the show is not that. And I do think like I I think some of the uh not the you know extreme criticism that uh",
            "start": 414.16
        },
        {
            "text": "the the trailers was like murder mystery kind of like almost cop detective procedural and the show is not that. And I do think like I I think some of the uh not the you know extreme criticism that uh feels in bad faith, but I do think a lot of people were coming in expecting one show and kind of got the rug pulled out from underneath them, which I I think really hurt the reaction overall to the show. Well, jumping off that, uh the the marketing and the prehype cycle for this little show called Andor was very interesting. Uh because when the show was announced, everyone's first reaction at a time when they were announcing the Mandalorian and all these like bigger Kenobi. It's like we're really getting a show about Cassie and Andor from Rogue One. Like why would we ever do that? And then we saw the trailers and we're like this looks pretty good, but we'll see. We'll see. And then the show started and all of us shut the [ __ ] up and we're just like wait a minute. How is this the best",
            "start": 455.92
        },
        {
            "text": "we saw the trailers and we're like this looks pretty good, but we'll see. We'll see. And then the show started and all of us shut the [ __ ] up and we're just like wait a minute. How is this the best thing ever? Uh, and we were all together on that journey going through all the different arcs. I, uh, recently rewatched the entire season 1 cuz Gia had never seen it. She's given up on Star Wars as a whole in terms of the all the Mando shows and stuff. She made it through season 2. She's like, I don't think this is for me anymore. And I'm like, that is totally fair. Uh, but for Andor, I was like, one day when season 2 comes out, this is going to be for you. And she fell in love with it. I refell in love with it where I'm like, you know what? Andor season 1 as good, if not better, than I thought it was. So very top level. So uh I thought the first three episodes were phenomenal in general. Uh it immediately felt like Andor except for Cassian. Um I I think that Cassian's story is currently",
            "start": 502.48
        },
        {
            "text": "it was. So very top level. So uh I thought the first three episodes were phenomenal in general. Uh it immediately felt like Andor except for Cassian. Um I I think that Cassian's story is currently the weakest, but I trust that it is going to pay off. Um, I think it's really interesting how much they've been splitting their time in kind of like the jumping between these really three places and then kind of mostly jumping between Cassian and Monothma. Um, I would say the strongest right now that I has me the most invested is probably Monothma's story, but I also love like deeply love her as a character and love like the historical place in the rebellion that she holds. Um, I did not expect the storyline between Sirill and Dedra at all. Oh, I'm just Oh, they walk in the apartment. I was like, wait, wait, what? They got mom drama. This is awesome. The in-laws are involved. Dedra having a like sitting down with his mother is got to be top top tier Star Wars scenes of all time. So good.",
            "start": 543.52
        },
        {
            "text": "wait, wait, what? They got mom drama. This is awesome. The in-laws are involved. Dedra having a like sitting down with his mother is got to be top top tier Star Wars scenes of all time. So good. Absolutely wild. There's something so strange about seeing moments of normaly in the Star Wars universe that I really enjoyed of just like, oh yeah, and sometimes people just have an apartment. Yeah. You know, totally. Sometimes people just need to have sometimes people need to have a good sit on their bed trying to disassociate from throwing a little tantrum, dude. God, I love And dude, the one of my favorite I had to pause and rewatch it cuz it made me laugh so hard. Legitimately, I think the funniest moment in Star Wars history is him talking to the like the the guy on his first day or whatever and like giving a recap of from his perspective his journey in season 1. He's just it's so self-righteous and it makes himself this big hero and it's just like you're such it's like an office it's",
            "start": 601.28
        },
        {
            "text": "and like giving a recap of from his perspective his journey in season 1. He's just it's so self-righteous and it makes himself this big hero and it's just like you're such it's like an office it's such an office desk job where it's like a juxtaposed to last season where he was like uh you know trying to be a cap and he a cop and he does do that like speech and totally fumbles it and oh awesome cinema yeah continue stage oh um yeah I would say right now I think we're in a very interesting place there's um I I I really really really appreciate that the writers of Andor did not shy away from the natural comparisons um and like onetoone nature of like like the empires doing Nazi stuff. Yeah. Um you know uh things that won't get us demonetized or whatever. But I thought some of the things that were really interesting in the comparison to that were obviously the stuff going on on Gorman which was really really interesting. Uh the suggestion that they had like fully looked into and tried out",
            "start": 647.28
        },
        {
            "text": "were really interesting in the comparison to that were obviously the stuff going on on Gorman which was really really interesting. Uh the suggestion that they had like fully looked into and tried out the concept of a plague or natural disaster also mirrors a lot of like leaked documents from the CIA. Um there's been so many historical documents that have not leaked but like been posted because at a certain point they have to become public information of like hey these are just things that the government considered before they did a different atrocity. Uh and I think that's a really really interesting like view into the empire. Yeah absolutely Barrett. Uh yeah, I I really adored these first three episodes. Uh no surprise, we're we're were so [ __ ] back. Uh I think the way the season starts feels like such a response to a lot of people who started the first three episodes of the first season felt like it moved too slow and they were like, \"Ah, we need action.\" And it was funny like",
            "start": 699.36
        },
        {
            "text": "feels like such a response to a lot of people who started the first three episodes of the first season felt like it moved too slow and they were like, \"Ah, we need action.\" And it was funny like watching that and being like I could see where the show would naturally probably start in terms of andor storyline this season if that wasn't such like a big talking point for the first season. Uh but besides that, yeah, like the I I do wonder if like the structure of this season, every three episodes, every week, uh tackling a new year. And I do wonder like if it's going to be jarring skipping from what we just got in these first three episodes to next week. But I do wonder if there's going to be different kind of overall themes for each year. Uh because the one that really uh kind of stuck to me for these first three episodes was, \"All right, now after, you know, you're forced to wake up and look at uh kind of um fascism in the face, where is everybody going to be at after that first step?\"",
            "start": 740.96
        },
        {
            "text": "for these first three episodes was, \"All right, now after, you know, you're forced to wake up and look at uh kind of um fascism in the face, where is everybody going to be at after that first step?\" And the answer is everybody's just hanging on by a [ __ ] thread. And I think every single kind of uh plane of action that we have over these uh first three episodes uh between Andor's mission gone wrong uh kind of catching up with uh Dedra and uh intern Sirill uh catching up with uh Mon Mothma and her daughter getting married and uh there was a fourth one as well that I'm blanking on. Um, oh, and then Bix and Braso and Will and the end uh kind of scene, right, where we get the cut between man getting [ __ ] wasted at her daughter's wedding with the uh remix uh uh Space Miami music uh playing at the wedding and then cutting to Andor Bixs and Will flying off um really pulled that all together uh for me. I know a big criticism or not a big but a criticism people have had is episode 2 and",
            "start": 785.44
        },
        {
            "text": "at the wedding and then cutting to Andor Bixs and Will flying off um really pulled that all together uh for me. I know a big criticism or not a big but a criticism people have had is episode 2 and kind of where Andor stuff is. I really adored that stuff and I we'll get into it but it really that storyline really solidified to me of like if one thing goes wrong all of this falls apart. If Andor gets shot and killed here um uh by these idiots Yeah. by these idiots. Luan has to start all over again in terms of finding a man he can trust on this level to do these missions for him, right? Um yeah, I I completely adored it. Obviously, it keeps up with the awesome storytelling, great cinematography, uh great performances by everybody. Um excellent excellent script writing as well. So, uh yeah, those are top uh top uh level thoughts there. I am absolutely obsessed with it, man. I feel that the being right back into it. I love how they just take their time with everything. Sometimes to an",
            "start": 846.64
        },
        {
            "text": "those are top uh top uh level thoughts there. I am absolutely obsessed with it, man. I feel that the being right back into it. I love how they just take their time with everything. Sometimes to an uncomfortable degree, like the amount of cutbacks to the dance sequence at the end. It it got comical, but then it came out the other end of like getting incredibly upsetting as they started not just having the music play when it was during the dancing, but hearing the music play as we're cutting to Bixs and Andor and just like all the different story lines and just like how upsetting it is and feeling the like loss of control of of everything. Not that there was any full grasp on the control at all throughout the first three episodes, but uh the little that they had. I really really liked where all the different storylines were dealing with their own thing, but all connected in the the way of like having Luin's uh assistant like have to get out to be able to get on the radio to get Cassie",
            "start": 901.28
        },
        {
            "text": "all the different storylines were dealing with their own thing, but all connected in the the way of like having Luin's uh assistant like have to get out to be able to get on the radio to get Cassie to where he needed to go to save Bicks. like just very very smart stuff. Little reminders of the other story lines of like the the planets go uh that they're talking about and Luan talking to one of the wedding guests who is like half Gomerian or whatever and like those little reminders of like everything is so interconnected. I mean even starting it off with the one year later and Krenics there. It's like okay cool. This is grounding this in a way. We saw the beginning of building the Death Star in the last season and obviously the prison uh being where the Death Star was being built. Like it there's just really smart reveals like little over uh little by little over time that I just really appreciate. Starting off with the um the heist gone wrong I thought was really smart from an action",
            "start": 945.6
        },
        {
            "text": "there's just really smart reveals like little over uh little by little over time that I just really appreciate. Starting off with the um the heist gone wrong I thought was really smart from an action perspective. I enjoyed it a lot. But also my favorite thing about the show is just living in sides of Star Wars we haven't seen. And like all of the costume design, set design, production design in general is so off the charts in every single way, but even just the not just the wedding and not just all of the uh Shandrilla stuff like cuz obviously that is so stunning top tier u but even the in the the Empire situation in the beginning where he's talking to that woman and and she's like the plan is I'm going to flirt with you and the person's going to come by. the the natural conversations of yeah that I'd buy it and when the other woman comes by and they're giggling together and stuff and oh he's cute like that feels so not Star Wars but at the same time I think grounds all of this and",
            "start": 989.52
        },
        {
            "text": "yeah that I'd buy it and when the other woman comes by and they're giggling together and stuff and oh he's cute like that feels so not Star Wars but at the same time I think grounds all of this and they're all just people they're all just people whether on the good side or bad side like and that is so terrifying when we then yeah get to the point of Andor who just has the worst luck in the world granted he is putting himself in positions where he can get in a lot of trouble and get caught all the time but like good lord this my homie. You're just getting caught up in stuff where like you're a cop, you're in a prison, you get out of the prison, you have to deal with like so many freaking backtoback moments where there's guns to your head and to be in this little u situation on Yavin 4, which was awesome. And like them realizing, oh, there's so much fog here that like we can hide in. It's like that is such great stuff for for f the future. But, uh, Sage, you were saying that, um, the",
            "start": 1031.44
        },
        {
            "text": "was awesome. And like them realizing, oh, there's so much fog here that like we can hide in. It's like that is such great stuff for for f the future. But, uh, Sage, you were saying that, um, the the andor of it so far hasn't really been so, uh, followed through on. All the other characters seem to be I I don't want to put words to your mouth, like like just it's the weakest of the the stories. Go for it. Like, it's been a really fun story that's happening. They just haven't uh given him a lot yet. I think that they did a really strong introduction of the character and him having that interaction with this, you know, like a mole essentially on the inside at this Imperial base. And I think that like I think it's exactly what you said. I think that this storyline is a reminder. So like I don't think it's unimportant. I think it's just not there yet. Um and I think it will be important. I think that what it is there is to show that these are just people, right? And like the entire story",
            "start": 1072.8
        },
        {
            "text": "think it's unimportant. I think it's just not there yet. Um and I think it will be important. I think that what it is there is to show that these are just people, right? And like the entire story of Andor in general in season 1 and up to this point is like this is how fascism like takes hold. And it was a big part of Marva's speech was like it is because normal people are complacent, right? like the big bad with the big twirly mustache can't take power without uh a million normal people that you would live next to in some way being a part of that system. So meeting normal people in the Star Wars galaxy has been the beginning of this. So you have these normal idiots uh that are all there just trying to figure their own stuff out and they have a part of this rebel group but they're not necessarily good at it because not everybody is going to be Luke Skywalker. the heroes of the rebellion and not everybody's going to be so trusting together as well, especially when something goes wrong.",
            "start": 1116.56
        },
        {
            "text": "good at it because not everybody is going to be Luke Skywalker. the heroes of the rebellion and not everybody's going to be so trusting together as well, especially when something goes wrong. Like that's something I like after just rewatching a little bit of Rebels and being reminded of like, you know, on season one of Rebels, they all come together. And it's funny cuz I think season one of Rebels takes place around this uh these first three episodes and each seat uh season of Rebels is going to take place around each of these uh uh three episode drops and like how tightlyk knit the Ghost of the Crew is and like uh you know there's a little bit of distrust here and there, but like that is a crew uh that comes together very quickly in the beginning of that, but I love that we get to see this where that's not going to be the same story for every Rebel Cell, which right now in terms of the rebellion, they don't know that there are really other cells out there and they don't see the",
            "start": 1160.56
        },
        {
            "text": "this where that's not going to be the same story for every Rebel Cell, which right now in terms of the rebellion, they don't know that there are really other cells out there and they don't see the larger plan of Luffin mainly slowly bringing them all together in a way. And yeah, to see them all fall apart was just so quickly too. And so that my thing is I feel like the Monmouth story line for these three, the wedding in general was by far my favorite. Um, but second place was the Andor stuff. And I think it's because while Andor didn't do much new, I think that uh there is something about the familiar that like strengthened it for me of him being in these situations constantly. I think now after what we saw from season 1 of him kind of just not wanting to get involved then getting thrust into it then having to be the guy save himself so many times. The conflict being about leadership specifically and that the rebellion needs leadership and if it doesn't have that it's all going to",
            "start": 1204.24
        },
        {
            "text": "into it then having to be the guy save himself so many times. The conflict being about leadership specifically and that the rebellion needs leadership and if it doesn't have that it's all going to fall apart I thought was so well portrayed between this group kind of infighting to a literal standoff like a capture the flag situation but with life or death stakes and it ends with like I I thought it was going to be a fight to the death bare knuckle boxing type of stuff and it's just it's ro shambo and it's again like and to me that's the thing of I I liked andor having to be in this situation instead of trying to figure out a feeling that he's going to be the one to suggest using that as the base and going back there. And I wonder how quickly that happens. Maybe I'm super off about this and like chances are I probably am cuz it it ends with him just flying off. But I get the vibe that he might go save them later. You know what I mean? I don't unless they all kill themselves. I don't",
            "start": 1247.6
        },
        {
            "text": "and like chances are I probably am cuz it it ends with him just flying off. But I get the vibe that he might go save them later. You know what I mean? I don't unless they all kill themselves. I don't think so. Especially cuz like the next three episodes that come out is going to be a year from now. Like that's that's something we have to kind of remind ourselves here is that like once we get to that I don't know if we get an update of like oh yeah I went back and saved those dudes like a couple I don't think we need to do that. Just what if some of those characters are just there there possibly? That's what I was thinking. I I for me it felt so em uh kind of uh it was a parallel to how we're introduced to Andor in Rogue One where this dude who kind of helps him get this information and he sees how like oh this dude is lost and this dude is gone and he's going to be kind of dead weight and he [ __ ] kills him. That's the first scene we get with Andor. And I to me the way I read the end",
            "start": 1300.64
        },
        {
            "text": "sees how like oh this dude is lost and this dude is gone and he's going to be kind of dead weight and he [ __ ] kills him. That's the first scene we get with Andor. And I to me the way I read the end of that um it must have been the end of episode two uh where he finally gets away from them. It really felt like a he quickly kind of saw the the moment he heard their leader was killed and that she was kind of their connect to like help like fund this rebel cell, he immediately knew this crew is lost. Yeah. There there's no helping them out and there's no getting them out of there. So I I don't know if that's where they go with it. Um especially like when he flies off, it is very much like a I I got to get the [ __ ] out of here. And in terms of like him suggesting Yavin just with lore stuff I I I'm blanking on Sage maybe you remember this at all of like them going to Yavin and Rebels felt like a moment but I forget if that was already an established base or if like the ghost crew uh",
            "start": 1340.08
        },
        {
            "text": "I I I'm blanking on Sage maybe you remember this at all of like them going to Yavin and Rebels felt like a moment but I forget if that was already an established base or if like the ghost crew uh kind of helped out with that or whatever cuz they were they do help man at some point in season 3. Uh and so that I'm I'm a little bit hazy on. Yeah. Yeah. We'll see where it all goes. Uh Barry, you were saying that you wanted to you had a structure of how you wanted to talk about this. Pretty much just breaking down like, you know, you've got the Andor mission gone wrong. You've got Manothma's wedding. Uh you've got let's uh catch up with Dedra and uh her kind of um dear Dra um the essentially the this pitch for a uh job that she could take uh for the ISB uh in to in terms of Gorman Gorman Gorman. Uh, and then, uh, Bix, Braso, and Will, uh, being non, uh, undocumented, uh, workers on a planet. So, uh, just cuz there's so much back and forth between all these three episodes, I felt like it",
            "start": 1388.4
        },
        {
            "text": "Uh, and then, uh, Bix, Braso, and Will, uh, being non, uh, undocumented, uh, workers on a planet. So, uh, just cuz there's so much back and forth between all these three episodes, I felt like it was kind of to help us kind of figure out where we want to go. Do do you guys think that the following three weeks are going to follow this format of there being kind of one event that is like I would say that the wedding was the one event here to be able to like tie everything to like to be able to constantly cut back cuz I feel like that's actually really smart framing uh for for all this and I wonder if maybe it'll like shift on which of the stories gets like that main uh focus later but cuz I thought like the most engaging [ __ ] happened during those the wedding scenes like Moth getting betrayed by Tay was like some real [ __ ] Like real brutal stuff cuz you think back to season one which again having just watched it like the first conversation they have where he's just they lightly start",
            "start": 1440.56
        },
        {
            "text": "by Tay was like some real [ __ ] Like real brutal stuff cuz you think back to season one which again having just watched it like the first conversation they have where he's just they lightly start talking about politics and he's just like we we shouldn't talk about politics and she's like well maybe we should like I'm down to and he's like no no no my politics are way too extreme for you. Yeah. Tay was her first outlet outside of Luan, who she barely gets to really talk to or her cousin, right, is the one who's uh uh also works with Luan. Bun new hair now. Yeah. And uh Taye felt like her first like, oh my god, someone I know in my personal life that isn't my cousin who I barely get to see because she's out on missions. We're talking about stuff and maybe I can bring him in and stuff. And yeah, to see that kind of fall apart because even though he has these views when he's actually tested on what that means for his personal kind of gain of it all, to see him completely crumble and fold",
            "start": 1487.84
        },
        {
            "text": "to see that kind of fall apart because even though he has these views when he's actually tested on what that means for his personal kind of gain of it all, to see him completely crumble and fold uh to that is like it her deal coming to terms with that and then having to have the conversation with Luan on how do you deal with that? And dude, what's so complicated though is because I clearly you look at it, there's a right and there's a wrong. But there's also like if you look at it from Tay's perspective, he lost his wife. He lost all of his money for this stuff. But on top of that, the one thing that he didn't demand, but in hindsight probably should have, even though it's shady and not cool, is having uh Man's daughter marry his son. Because this whole wedding with the other guy's son is part of the reason why he is now broke and just [ __ ] right now. He's dead presumably. Oh yeah, that is nice. In the middle of episode two, I wrote one of my notes was, \"Oh, Tay ain't making it out",
            "start": 1530.96
        },
        {
            "text": "part of the reason why he is now broke and just [ __ ] right now. He's dead presumably. Oh yeah, that is nice. In the middle of episode two, I wrote one of my notes was, \"Oh, Tay ain't making it out alive.\" Yeah. Yeah. Yeah. S What are your thoughts on all that? Like, oh, is it going to be this? Is he poisoned? Is the car going to explode? Is there going to be explosion outside? We were just like waiting for the moment and then it's Cinta coming back at the end. Ooh. And then her Oh, come on. Yeah. her and um Mon's cousin who I'm blanking on. Locking eyes. Yeah. Mellow drama. Yeah. That's Vel. Belle. Um I look while we're talking about the wedding, we have to acknowledge we talked about skeleton crew, best kids in the galaxy. Um we have to talk about the worst child in the galaxy, Lita. God, I I think you can't just throw out Lita without also throwing out this [ __ ] whatever kid she's marrying as well. Both of them suck. You don't even hold her hand. Also, I get it though. She",
            "start": 1581.76
        },
        {
            "text": "God, I I think you can't just throw out Lita without also throwing out this [ __ ] whatever kid she's marrying as well. Both of them suck. You don't even hold her hand. Also, I get it though. She sucks. She sucks. I wouldn't want to hold her hand either. Yeah, I know. It's the moment where Lita is about to go out and man has a realization because something that was really compelling to me last season about Mon Mothma's character was the moment that she had to sacrifice her daughter for the rebellion. Essentially, she had to make this choice as to not drudge up more suspicion and cover her own ass uh when she was so against this arranged marriage. It was something she had to do. And you watch Mona Mothma be like, I know I'm doing the wrong thing here, but I have to. I'm choosing what I think is the greater good at the expense of my family. And that moment where she breaks right before her daughter's about to walk out for this wedding ceremony. And it's like, you don't have to do it. We",
            "start": 1629.8
        },
        {
            "text": "is the greater good at the expense of my family. And that moment where she breaks right before her daughter's about to walk out for this wedding ceremony. And it's like, you don't have to do it. We can leave right now. It'll be an act of bravery. We'll say, \"You're not ready.\" And her just looking at her and going, \"I wish you were drunk.\" Yeah. Oh, dude. It's so real. It's [ __ ] brutal. And to see M we're seeing the birth of a man Mothma, the death of this Mon Mothma, and the birth of one that has no [ __ ] left to give. Like, this is her turning on her daughter, you know? like this is her like there's no looking back from this moment like the moment she looks goes I go first and like walks out it's like oh we are dealing with some crazy [ __ ] that again is the power of the show of like taking all this fantastical [ __ ] but grounding it in like real dynamics and relationships of like this girl was raised on Coruscant as a privileged little [ __ ] you know in in a world of politics",
            "start": 1675.52
        },
        {
            "text": "taking all this fantastical [ __ ] but grounding it in like real dynamics and relationships of like this girl was raised on Coruscant as a privileged little [ __ ] you know in in a world of politics that benefit her with this [ __ ] dad like and a mom that has to only be good in the shadows I think That's another important thing too. It's not like man can be a positive role model for her in in any accurate way. Yeah. I I think there's something to be said as well like Lita sucks as rightfully like it makes sense especially with her upbringing uh her kind of wanting to be more a part of her culture which is essentially just being a tradife. and kind of I I loved the small little moments though of her, you know, she runs off crying cuz yeah, like uh her uh husband to be isn't holding her hand and like when you see them doing the the hike. I also love that it was like a three-day celebration. It felt like such a like oh my god, this is so extravagant in so many unnecessary ways. Thank",
            "start": 1713.92
        },
        {
            "text": "hand and like when you see them doing the the hike. I also love that it was like a three-day celebration. It felt like such a like oh my god, this is so extravagant in so many unnecessary ways. Thank god because it allowed three different outfits for everybody. Oh yes. Oh, the True. And God the outfits were good. Yeah, the outfits they they Oh, and oh man, man, he is just the sassiest [ __ ] ever. But sorry, just to get back to my point really quick before I lose it, is that like I love her latest moments of breaking where she's kind of not fully realizing, but it's maybe being incepted into her brain of like this life that you've wanted so badly is not going to be what you wanted it to be. And I I do wonder if that leads uh to anywhere in in terms of like we do know eventually man is going to break from you know the uh the Senate to be an actual leader of the rebellion. And I I'm I am anticipating of what her final conversation with her daughter and her husband are going to be before",
            "start": 1763.2
        },
        {
            "text": "to break from you know the uh the Senate to be an actual leader of the rebellion. And I I'm I am anticipating of what her final conversation with her daughter and her husband are going to be before she goes full I'm out. I'm out of here. Yeah. Sage. Uh I think uh a moment for for the dress uh manma was giving mommy. so hard in this episode. Um, damn. Like just damn. A moment for the snatch waste. Yes. Um, but yeah, I think that there's a level of she has to like, you know, at some point she has to let go of her family to be an effective leader of the rebellion and they are making it easier and easier and to some extent she's imposing the knowledge that she has now uh on her teenage daughter. Like I know that that this marriage thing is bad. I know this tradife lifestyle is bad. Why don't you like why aren't you like me? because I didn't want to be married in this way. Like she said that she wished that her mother had given her the out before she married this [ __ ] that she's been",
            "start": 1810.08
        },
        {
            "text": "you like why aren't you like me? because I didn't want to be married in this way. Like she said that she wished that her mother had given her the out before she married this [ __ ] that she's been stuck with her whole life. Um but this girl likes her dad. So she's like I don't know what your problem is with him, but like I'd be fine with that because she's just like him. Um and it's like uh I think it's a complex thing that people navigate that we're seeing more often in media where it's like somebody who's a good character can be a bad parent. Yep. Ooh. Oh, you know, like I think it takes us as far back as like when people were mad that A was a bad dad when you find out later from Avatar. Like she's a bad mom. She is. She's a bad mom and a great leader of the rebellion. Yeah. I want to keep talking a lot about Andor season 2 episodes 1 through three after a quick word from our sponsors. This episode's brought to you by Imperial. We've told you all how important it is to developers to",
            "start": 1858.56
        },
        {
            "text": "talking a lot about Andor season 2 episodes 1 through three after a quick word from our sponsors. This episode's brought to you by Imperial. We've told you all how important it is to developers to wish list games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shields and the powerfully ranged cannon. With a deep ability system, extensive",
            "start": 1901.2
        },
        {
            "text": "and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shields and the powerfully ranged cannon. With a deep ability system, extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode's brought to you by Araf Frames. If you haven't called your mom in a while, here is your reminder to do",
            "start": 1948.08
        },
        {
            "text": "8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode's brought to you by Araf Frames. If you haven't called your mom in a while, here is your reminder to do it. But then, if you want to go above and beyond, Mother's Day is coming up and I have the perfect gift idea. Aframes are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Trust me, Gia's dad does, Greg and Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. And I know that from experience. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aframes.com to get $35 off plus free",
            "start": 1997.36
        },
        {
            "text": "the Aura app. And I know that from experience. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aframes.com to get $35 off plus free shipping on their best-selling Carver Matt frame. That's a rafra.com. Promo code kind of funny. Support this show by mentioning us at checkout. Terms and conditions apply. Tim, you want to talk about the timeline? I do. So, Zach Johnson in the chat is saying uh that Yavin already was a base. Season 3 of Rebels was 2 years before the Battle of Yavin. Battle of Yavin. So, yeah. Doesn't that add up though that this could still be the formation then? The formation of Yavin, the base on Yavin. Yeah. I I was just I was I couldn't remember cuz Man Mothma has like a moment in Rebels and like there's a little bit of them going to the Yavin base, but I just couldn't remember from the show in season 3 if that was already an established base. Did they just make that base? I I that in terms of that",
            "start": 2042.56
        },
        {
            "text": "a little bit of them going to the Yavin base, but I just couldn't remember from the show in season 3 if that was already an established base. Did they just make that base? I I that in terms of that timeline, I was a little bit hazy. Uh but yeah, Zach Johnson says it was already a base by the uh by the time they get to it in season three. So this is pre Yavin though in Andor. Yes. Yeah. Yeah. Okay, cool. So we might see this be the formation of the base on Yavin, right? Yeah. Okay, cool. Cool. Cool. I was just unsure if there was already a story told about forming the Yavin base and stuff like that. Here's another uh Tim needs uh smarter people to tell me the answer to it thing. Tie fighters do not have hyperspace hyperdrives. Right. Right. Yeah. Some advanced ones do though. Yes. Okay. Because like I was watching this. This is experimental technology because this is more advanced than like any TIE fighter we've ever seen. Yeah. Like even more advanced than like the TIE Defenders,",
            "start": 2093.04
        },
        {
            "text": "Because like I was watching this. This is experimental technology because this is more advanced than like any TIE fighter we've ever seen. Yeah. Like even more advanced than like the TIE Defenders, which is also a part of like Rebels and stuff. I also I almost thought it was a TIE Defender like uh prototype or something like that. Cuz I remember from my limited knowledge of a lot of the stuff, I remember Vader was like the one that could. Yeah. And so in this episode or episodes when we're watching this and he escapes in episode one uh with with the TIE fighter I was and then he's kind of like lost in space. I thought it was going to be like a Tony Stark and Endgame type situation of like, oh [ __ ] the drama is he's lost and unless he gets people to find him, he's screwed because he can't hyperspace out. And then eventually when Bix he gets the call from Bix or about Bix, he's like, I got to go and then he hyperspace. To me, the him kind of floating around in space, uh it did come",
            "start": 2136.32
        },
        {
            "text": "hyperspace out. And then eventually when Bix he gets the call from Bix or about Bix, he's like, I got to go and then he hyperspace. To me, the him kind of floating around in space, uh it did come across that at first of like, oh, he's just kind of stranded. But reflecting back on it after kind of learning like, oh, he can uh hyper jump. Uh it was like he's waiting cuz he's still part of this mission that he in his eyes is like falling apart. The person he was supposed to meet never like wasn't there. All this stuff the the the dummies kind of scared them off or whatever. So now he's got to deliver this thing. So now he's just kind of waiting on like where the [ __ ] do I go with this thing because any anywhere I go that isn't like a guaranteed safe drop off point, people are going to think I'm an Imperial officer, which is what happens to him with the the rebel crew uh there. So yeah, uh there are the moment switch is good of when it becomes like [ __ ] it, which is the most like",
            "start": 2175.28
        },
        {
            "text": "think I'm an Imperial officer, which is what happens to him with the the rebel crew uh there. So yeah, uh there are the moment switch is good of when it becomes like [ __ ] it, which is the most like Cassie and Andor thing of all because like it's the stupid thing to go to that planet right now. Like if you know comms are blocked, you are putting everyone in danger, but like that's Cassie and Andor who's like, \"Yes, this is a dangerous thing to do for everyone, but don't worry, I'll fix it.\" Mhm. Yeah. And I mean, hey, he does, right? He comes and saves the day in the most epic Cassian fashion like flying over just shooting like seeing the targeting all of them like man all that scene the way that it like built the tension obviously like what a horrible situation with the ISB uh member and and Bicks like in episode one I think it was they kind of like introduced that dynamic and I'm like oh my god and they really took it all the [ __ ] way. Yeah. And they call it for what it is, too,",
            "start": 2219.12
        },
        {
            "text": "and Bicks like in episode one I think it was they kind of like introduced that dynamic and I'm like oh my god and they really took it all the [ __ ] way. Yeah. And they call it for what it is, too, which was like like even like seeing this Imperial officer, not at ISB, uh technically, uh trying to coers Bix into ISB is specifically like their it's like um what Dedra is a part of that they're like, say it's correct, they're kind of like CIA. They're more of a higher up sort of like their own department of like the Imperial. So what would this guy just be called? just like an Imperial officer. Okay. Yeah. Still Imperial. Um but yeah, you know, there the whole thing with this planet is, you know, for the first time in 10 years, the Empire is coming through to check uh visas uh for everybody for this planet that seems to be a mainly farming planet uh farming wheat. And uh you know, uh Bix, Braso, Will, and B2 are all there. Um, and you know, they talk enough about like, okay, Cassian does",
            "start": 2261.28
        },
        {
            "text": "this planet that seems to be a mainly farming planet uh farming wheat. And uh you know, uh Bix, Braso, Will, and B2 are all there. Um, and you know, they talk enough about like, okay, Cassian does know that Cassian's also a part of this crew, but right now he's on uh out on this mission and they're all worried because they don't have visas. They're, you know, refugees from uh their their home planet and they are undocumented workers essentially. and uh seeing this Imperial officer try to, you know, uh sprinkle in the idea of like, oh, like you should come visit me over in this town and her kind of doing the like a very like clear defense of like, oh, my husband wouldn't be cool with that and him still being shitty about it to fully go into the scene in episode 3 of co coercing her into sex because he knows that she doesn't have a visa and all that stuff. And uh for her to call out like after she kills the dude uh when he stumbles out, hits his head, and dies uh where she's like, \"He",
            "start": 2310.4
        },
        {
            "text": "because he knows that she doesn't have a visa and all that stuff. And uh for her to call out like after she kills the dude uh when he stumbles out, hits his head, and dies uh where she's like, \"He tried to rape me.\" And it was like even after watching that entire scene, hearing that work in like Star Wars, it was like like hell like that's awesome that they're able to like call it for what it is and clearly show like this is this is the type of people that are in these positions that do shitty things like this and this is what they do. and we're going to say it. And uh that was like kind of a powerful powerful moment for that to be called for what it was uh for myself. And then the entire kind of story on this planet uh especially where we're at now in terms of uh our presidency and all this stuff of you know people who are just trying to work uh you know farmers and stuff just trying to get by with the the hands that they can get and nobody really giving a [ __ ] about visas. But you",
            "start": 2360.72
        },
        {
            "text": "stuff of you know people who are just trying to work uh you know farmers and stuff just trying to get by with the the hands that they can get and nobody really giving a [ __ ] about visas. But you know because of like this technical rule that even the Imperial officer calls out he's like ah it's just it's just this rule you know that we have to follow. Uh it was very powerful and very terrifying and I think they framed it so well how terrifying it is how human it is on the personal level of these people um just trying to look out for each other um I I thought was all [ __ ] fantastic. Yes, I think really good example of looking out for each other in that. Like obviously there's a very strong comparison of the ice raids happening right now that makes this feel like I don't know it like immediately just makes all of the hair on my skin stand up. Um cuz it is so so poignant. Um but specifically the moment where Braso knows that he is caught uh and turns to the farmer and is like you sold",
            "start": 2409.04
        },
        {
            "text": "just makes all of the hair on my skin stand up. Um cuz it is so so poignant. Um but specifically the moment where Braso knows that he is caught uh and turns to the farmer and is like you sold me out. How dare you when you know he didn't. But it's like there's no reason for me to take these people down with me. They need to look like they were not sympathizing with me. I'm screwed. I'm going to try and protect these random farmers that have like shown us kindness and taken us in. Um, and I it was devastating when you see his face like make the decision of what he's about to do and you see the guy taking it in of being like, \"Oh, I want to say no, I didn't do it, but I know what you're doing.\" Oh, again, real people like trying their best to be good and having to deal with it and having to deal with it without being able to have the time to have a plan and sometimes you have the time to to plan and things go wrong and you just need to react and yeah, there's going to be losses, right?",
            "start": 2460.24
        },
        {
            "text": "deal with it without being able to have the time to have a plan and sometimes you have the time to to plan and things go wrong and you just need to react and yeah, there's going to be losses, right? Like Roso dying, I I feel like he was not our favorite season one. Uh, and I think that uh over was the [ __ ] homie. What are we talking about? There we had some issues with him. I I remember we think about Tim Tim with two M's. Oh, yeah. There's Yeah. Yeah. Yeah. We hated him with two M's. Yes, we do. I get it. Bras one M2. Yeah. Yeah. Braso was like, uh, I'm kind of resisting wanting to help, but he's always going to. He's always going to break and help. Even if at first he's going to be like, no, I'm not going to help. He was always going to come around. I always thought of of Brasto as the the homie cuz his story reflects everybody else uh in that community in that first season, right, of you know, slowly coming to the realization that something needs to be done. And I I like the fact",
            "start": 2505.36
        },
        {
            "text": "the homie cuz his story reflects everybody else uh in that community in that first season, right, of you know, slowly coming to the realization that something needs to be done. And I I like the fact that he dies at the end of this, right? It was just so like [ __ ] right. This is Andor. I in any other Star Wars show, he would have been, you know, second buddy, uh, you know, uh, always going on the adventures with Andor or like not a part of like the rebellion but eventually becomes uh into the fold and maybe he dies at the very end of the story and like a heroic thing and in this it's like nah, he dies in episode three and it's just like it's kind of over nothing. I mean, and again, I love it. That's the end of the episode and now we're going to get a year time jump. And I I feel like there's just like a lot working with that format of like having him dying be this like big moment at the end of this this story. Um and yeah, where's that going to to lead to to next time? But yeah, this",
            "start": 2547.36
        },
        {
            "text": "just like a lot working with that format of like having him dying be this like big moment at the end of this this story. Um and yeah, where's that going to to lead to to next time? But yeah, this entire story line was just every time they got back to it, I dreaded it a bit in a way of like they're doing such a good job. Like it feels so real and so scary for what's going on. And I thought incredibly well-andled like it it they didn't shy away from anything. And then they also, I think, did a a great job of making it compelling for the overall story as well. It didn't feel like it didn't fit. So, shout out to them. Uh, and then what what what else should we go to? Our final kind of big plane, which I'm surprised is not at the top of either of y'all's list of whoa, this is crazy, is Dedra. And, you know, there's kind of two beats here specifically with uh I call it more of Dedra's plane of action. it becomes serial a little bit as well. But we catch up with Dedra uh in um one of",
            "start": 2587.12
        },
        {
            "text": "Dedra. And, you know, there's kind of two beats here specifically with uh I call it more of Dedra's plane of action. it becomes serial a little bit as well. But we catch up with Dedra uh in um one of Krennic's bases and we get to see the [ __ ] the dude Ben Mendelson come back as Krennic and own the scene once again. Um and I was, you know, they closed like the windows. They do this uh you know uh projector of whatever he's about to pitch uh these people on. And at first I was like, \"Oh, he's going to do like a pitch on like the like uh uh the Death Star and kind of sell these people on like this is our project. We want to bring you in all this stuff.\" And they don't even do that. He shows like essentially what feels like very Detra stuff feels all very World War II. Uh uh this video that they watch, it feels like a propaganda piece even though it's like more so just like a hey, come travel to this planet, right? Uh, and then they he doesn't even really talk about what the um Death",
            "start": 2631.04
        },
        {
            "text": "they watch, it feels like a propaganda piece even though it's like more so just like a hey, come travel to this planet, right? Uh, and then they he doesn't even really talk about what the um Death Star is. He just still is telling people that it's a big energy project and we need a lie. Yeah. Which is like a lie. It's energy in the source of like it is unlimited power of energy in terms of kyber crystal stuff. But he doesn't even tell him that. He's just like we have this project. we need this specific resource from this specific planet and we need a PR spin or we one we kind of need a PR spin and two we need a way to essentially justify uh eradicating a people from their home which I am terrified by where this story is going to go cuz I can only imagine it's going to end in the genocide of this people and my bet is that's going to be the true inciting incident for the rebellion coming together in in a way of like there is clear leaders and there is a base and there is all the",
            "start": 2685.92
        },
        {
            "text": "of this people and my bet is that's going to be the true inciting incident for the rebellion coming together in in a way of like there is clear leaders and there is a base and there is all the different uh little rebel subsects coming together as like all right there is a rebellion not just many rebel groups. Yeah. And uh he's essentially trying to pitch them on like how do we what's the what can we do? We've tried we've tried thinking about like would a plague work or whatever and Krennic eventually goes yeah like them pontificating over this stuff over like tea and biscuits and [ __ ] It's like god these people are truly evil. Uh, and kind of goes to Dedra and really wants like he's like, I know you've already came up, you came up with a plan before anybody else spoke and she gives the pitch of like, you know, you need re you need to rely on a rebellion on that planet who, you know, will do the wrong things. And, uh, just showing how much of a smart fascist she is. And so then we go",
            "start": 2732.96
        },
        {
            "text": "of like, you know, you need re you need to rely on a rebellion on that planet who, you know, will do the wrong things. And, uh, just showing how much of a smart fascist she is. And so then we go to there and then their their home life. But before we get to the home life stuff, did did y'all have any other thoughts about kind of this this meeting? The publicist. The publicist World War II era like, \"Oh, let me sell you some snake oil kind of thing.\" Jesus. It was specifically There was a point where they start talking about the people where they start kind of doing their pitch to the rest of the board like, \"Oh, don't you find the people of Gorman a little pretentious?\" Like, \"Aren't they this? Aren't they that?\" And this like, \"Oh, we unite against a common enemy. Look how easily we could convince people of this. If we can convince the people in this room who know what we're doing this, that like this is going to be a narrative that we create so that we can do a genocide and convince",
            "start": 2781.76
        },
        {
            "text": "convince people of this. If we can convince the people in this room who know what we're doing this, that like this is going to be a narrative that we create so that we can do a genocide and convince people that it was kind of okay because h weren't they kind of pretentious though? Aren't they kind of jerks? Don't they kind of deserve? Remember that one conflict where they barely helped out at all? [ __ ] [ __ ] God, man. Exactly. And I thought it was so interesting to see that like, oh, the Empire had publicists. Oh, that's horrifying. That's uh a really interesting detail to add in. Um and I thought that they were going to go for more of that approach and then they're like, \"Oh, no. We're still doing a mass atrocity.\" Um but also there's going to be all of these other little things that are spinning up to allow us to commit this. Um I think it's also really interesting that Dedra isn't on board. Um because like season one you're like Dedra is a horrible soulless sociopath. Um, and",
            "start": 2827.2
        },
        {
            "text": "are spinning up to allow us to commit this. Um I think it's also really interesting that Dedra isn't on board. Um because like season one you're like Dedra is a horrible soulless sociopath. Um, and it's like, oh, are we finding Dedra's line on how far she will go? I think it's actually the opposite. I think she doesn't give a [ __ ] about the line. I think it's just not her project. It's not her project. I think she finds it boring as well because she's so like she has like the conversation with her superior, who I'm I'm blanking on his name, and she's still obsessed with Axis. Like, she's obsessed with this this web of, you know, this rebellion coming together. and she sees through the matrix and she sees like clearly Luin is a person out there. She just doesn't know it's Luthan, right? And I think that's it's more it's less of like her having a line, at least in my read, and more so like this is her this is the project that is barely moving in any sort of way. But again, that's the",
            "start": 2869.28
        },
        {
            "text": "And I think that's it's more it's less of like her having a line, at least in my read, and more so like this is her this is the project that is barely moving in any sort of way. But again, that's the power of the show is I don't think there is any character that's truly good, truly evil in this way where it's like like I mean we'll see where Dra goes with this project. I'm sure cuz I have an idea about Sirill. We'll get to it in a couple minutes. Let's get to it now. Marva and B2 Emo were good. Oh, dude, you're right. And B2, they left him. My heart I know they did. They did just leave him. Broke my heart. I was screaming. I was screaming. I was like, \"No, he was waiting for Cassie and you can waiting for Cass Heartbreaking.\" That it really is. Um, he has the saddest story in all of Star Wars. Let's just Let's just call it for what it is. Uh, there's a reason he's called emo. Um, I think Sirill K is going to have a moment where his morals are actually tested. uh you know, we we get to",
            "start": 2915.76
        },
        {
            "text": "Let's just Let's just call it for what it is. Uh, there's a reason he's called emo. Um, I think Sirill K is going to have a moment where his morals are actually tested. uh you know, we we get to have that moment where it's revealed that Dedra and Sirill are living together. They're in a relationship. Uh very clear to me that he is the pet of this relationship. the way Deadra kind of grabs his face at one point when he wonders about cancelling on his mother and you know his mom at one point talks about like oh his father one dreamt of being an adventurer and stuff and then hearing about that and probably this idea has of his father in his head thinking about you know the the toys he had in his mom's uh uh apartment back in the first season you know serial does kind of think of him as like this justified dude and I think in season one, if you had asked me when that was coming out, I was like, \"Oh, he's going to he's going to have the line through line of becoming, you know, this normal",
            "start": 2964.48
        },
        {
            "text": "this justified dude and I think in season one, if you had asked me when that was coming out, I was like, \"Oh, he's going to he's going to have the line through line of becoming, you know, this normal dude to becoming full-on fascist hunting down Andor.\" Um, but I there hasn't been really a moment where his moral and where his line has actually been tested because when he has moments of power, it's all about like the on the page like rules story and like and him specifically being like, \"Oh, this guy got away with murder.\" He never got tested in like, you know, putting the boot down on uh the throats of people in a real way, right? cuz after that he gets sent to the desk job and all this stuff and still tries to play his big adventure hero. I do wonder if Dedra actually goes through with this mission something that he's not really allowed to be in the know of. She's a part of the ISB and you know when she comes home he is like yo how was that trip of whatever that was cuz it's very",
            "start": 3014.08
        },
        {
            "text": "this mission something that he's not really allowed to be in the know of. She's a part of the ISB and you know when she comes home he is like yo how was that trip of whatever that was cuz it's very clear that he's not allowed to know what she's specifically working on. Um, I do wonder if he finds out eventually what she is going to become responsible for and if that kind of incepts into him. Not a big grand moment of now he's a hero, but I do wonder if we get to a point where he is given the moment of actually being to uh capture Andor and he says no to it because he realizes what the Empire actually is. Because I do think Dra is going to be the fullon like again I my read of it was this Gorman uh planet mission is like boring. The idea of like PR campaign figuring out how to justify genocide that is not even questioning her morals. She is just that's boring, you know. And so I I I'm fascinated to see where that all goes. Her going after his mom was awesome. like her just straight up",
            "start": 3068.24
        },
        {
            "text": "that is not even questioning her morals. She is just that's boring, you know. And so I I I'm fascinated to see where that all goes. Her going after his mom was awesome. like her just straight up just being like, \"You're not going to talk to me that way.\" And let's just set this straight of where this relationship is and where it's going to be going forward. I was like, \"Damn, dude. He's going to visit you this often. He's going to call you on these days.\" Carlos described it perfectly as uh when a sociopath meets a narcissist. Straight. She's a narcissist, but Dedra's a sociopath. Yeah. 100%. And that stuff was riveting cuz there there's no force more powerful in the world than a mom. You know what I mean? Just having to deal with a mom whose mom is words to your girlfriend is you're not what you you you're not what I thought you would look like and then follows that up with don't you want to know what I thought you would look like? And it's like oh my god shut the [ __ ] up. She's",
            "start": 3122.64
        },
        {
            "text": "what you you you're not what I thought you would look like and then follows that up with don't you want to know what I thought you would look like? And it's like oh my god shut the [ __ ] up. She's the best character. She plays Space Italian Mom. So, well, and again, we we've given a lot of credit, as we should, to all of the the wedding outfits, but I got to say, they they look freaking good in these outfits, too. It it it felt such a very clear like Dedra's kind of world, especially on Coruscant, feels very um it feels very like 40s uh chic uh kind of like new age and fancy and [ __ ] And it's like, oh yeah, like this is it's rare that we get to see this side because so much of uh the perspective is from uh the rebellion. Underbelly even of course. And when we get the Imperial side of things, it is more so they're in their uniforms. What is their actual like going out stuff kind of uh and it's like, oh, this is the this is the outfit of like very um totalitarian privileged people,",
            "start": 3173.6
        },
        {
            "text": "things, it is more so they're in their uniforms. What is their actual like going out stuff kind of uh and it's like, oh, this is the this is the outfit of like very um totalitarian privileged people, you But comparing that even to um Sirill's uh house, little apartment, you know, that's like like like totally a different vibe than what they have here. Like I love that even on the sides, there's still levels to this [ __ ] you know? Um I man, it utterly captivating. I feel like I just did not expect her to turn on the mom that way. And I feel like it was so earned and just that entire conversation like it it just puts them in such interesting places. I love your theory about uh Yeah, I feel like that's pretty spot on. Um, yeah, we'll see. It's interesting. I think so, too. I think he's too much of a wimp to be a big bad. Yeah. And I think that's what it comes down to is I don't think it's necessarily a moral quandry for Sirill. It's just are you willing to like go that far in any",
            "start": 3224.72
        },
        {
            "text": "too much of a wimp to be a big bad. Yeah. And I think that's what it comes down to is I don't think it's necessarily a moral quandry for Sirill. It's just are you willing to like go that far in any direction. I don't think he will put his out to be good, but I don't think he will stick his neck out that far to be bad in that way. And like he's going to realize that he thought him and Dedra were the same and she very much knows that they are not. Mhm. Yeah. Um, again, in any other show when they introduce the idea of like, oh, his dad left, it's like, oh god, who's his dad going to be? But I don't think that's ever going to be like a reveal or big plot point or anything, I do think it'll possibly feed into possibly where he goes in terms of not sticking his neck out, but kind of leaning towards like not being a shitty dude and and stuff like that. So, yeah. Uh, see that that was even though it was such a small part of the big action that we were getting between Andor and uh the the",
            "start": 3273.52
        },
        {
            "text": "towards like not being a shitty dude and and stuff like that. So, yeah. Uh, see that that was even though it was such a small part of the big action that we were getting between Andor and uh the the wedding uh and even like uh Bix and Braso like that was the ooh I've I've missed these characters and it has been two [ __ ] years and I need to see and and like that was the thing I was most surprised by uh was that they're in like a relationship cuz I thought I was convinced that it was going to be Dra bring into the ISB as her new like assistant or something like that. And like the direction they actually went with it, I was like, \"Oh god, that's totally different.\" But then that moment where she kind of grabs and squeezes his face, it's like, \"Nah, the power dynamic is still there.\" The power dynamic I still expected in this relationship. Still very much there. Uh there's a Naboo reference. Always love a Naboo reference. Naboo. Uh yeah, the dude was uh born on Naboo. And uh when we get",
            "start": 3317.52
        },
        {
            "text": "dynamic I still expected in this relationship. Still very much there. Uh there's a Naboo reference. Always love a Naboo reference. Naboo. Uh yeah, the dude was uh born on Naboo. And uh when we get to see the shop uh of um Luan's assistant, I'm always blanking on her name, but she feels like she's really the one in charge. Um she's so cool. Yeah, she's so cool. Um I for I always forget her name, but when she walks into the shop, and I forget if we saw these uh relics in season 1, but it seems to be Plun's face mask uh or maybe somebody else that I'm blanking on, chat, correct me if I'm wrong, next to the head headdress, baby of Amadala. And I think specifically the one she wears when her and Anakin are trying to be incognito traveling to Naboo. And I had a moment of reflection. I was like, \"That's what you wore to be incognito to get off of Corus?\" It's Naboo. Clea. That's right. Thank you, chat. Thank you, Chad. Yeah. Uh Clea is always going to be the MVP, I feel like, in the",
            "start": 3364.64
        },
        {
            "text": "like, \"That's what you wore to be incognito to get off of Corus?\" It's Naboo. Clea. That's right. Thank you, chat. Thank you, Chad. Yeah. Uh Clea is always going to be the MVP, I feel like, in the background. And I also, one of my simple things that I sent for with Star Wars is Star Wars unique tech. uh that board that pulls out the dials that she's turning, the way that she connects with it. It's one of my favorite establishing things of the Star Wars timeline is where technology is um because technology regresses so far after the war to see what remains and what there was and what people had. So like when they're showing that commercial in that boardroom is so much further advanced than what we have access to after the Battle of Yavin, right? Like when all technology has stopped progressing and been destroyed essentially by war. um just to see kind of what these pieces are that people have is so interesting. Yeah, man. I want to shout out the moment with Clea and Vel where you know",
            "start": 3411.04
        },
        {
            "text": "and been destroyed essentially by war. um just to see kind of what these pieces are that people have is so interesting. Yeah, man. I want to shout out the moment with Clea and Vel where you know they finally they meet uh at the wedding before Clea goes back to Coruscant and uh Vel's trying to be like did did we just meet or whatever and she's like no you've obviously been to the store so like we've it makes sense for us to talk at this wedding. Yeah. Like keep up with this you know we're just we're just catching up and we're you know looking for uh potential hookups at this wedding. She says something much more sophisticated. And Vel kind of looks her up and down and walks away. And Clay's reaction to just being thrown off by that is so uh Yeah, it's gold. Uh Billy Sunrider in the chat says that the the dude that was born on Naboo is Erskin, who's Mma's aid in rebels. Oh, and honestly that makes sense cuz I thought it because he was born on Naboo, but he's part Gorman and it's like or",
            "start": 3456.0
        },
        {
            "text": "that the the dude that was born on Naboo is Erskin, who's Mma's aid in rebels. Oh, and honestly that makes sense cuz I thought it because he was born on Naboo, but he's part Gorman and it's like or I don't know what the [ __ ] planet is the spider the weird spider planet. Um they like they make a point of like he is you know that's part of who he is part of his culture and it's like oh he is going to go through some [ __ ] for the next couple years and seeing what happens to uh the planet his people is from. Um, but yeah, that's awesome that that's a little detail picked up. And it makes sense cuz he talked about how like man brought him in and then he's like quickly cut off by Tay. One uh thing I forgot to bring up during the the Bix conversation uh is the the dude character. I forget his name. Will. Will his little love with the girl and having to say goodbye to her. Oh yeah. Oh, however, he's the reason Brasa dies. So like cuz he's like I said I would say bye and you know that's",
            "start": 3502.4
        },
        {
            "text": "his name. Will. Will his little love with the girl and having to say goodbye to her. Oh yeah. Oh, however, he's the reason Brasa dies. So like cuz he's like I said I would say bye and you know that's it. He takes his theater. He leaves you outside. You are right. What are your thoughts? You seem conflicted. Uh it it like did and didn't I I feel like the will romance stuff was probably the weakest. Uh the will they won't they? Some would say. Yeah. Um yeah. Uh, I do think it's hilarious how it's introduced though where uh it's in the first episode and it's like our first time kind of catching up with Bix after her nightmare. Uh, and they're working on something and she go and this is the most like non-S Star Wars thing that I've ever heard where she looks over at Will when this girl is approaching and she's like, \"You thirsty?\" And then it cuts over to the girl and he's like, \"What? Shut the [ __ ] up.\" And then he's his response is, \"Can you just be normal?\" And it's like, \"What is",
            "start": 3548.72
        },
        {
            "text": "and she's like, \"You thirsty?\" And then it cuts over to the girl and he's like, \"What? Shut the [ __ ] up.\" And then he's his response is, \"Can you just be normal?\" And it's like, \"What is happening here right now?\" It was a very good back and forth uh between Will and Bix, which is cool cuz I don't feel like they really got to interact in uh season 1 a lot and like they just they have a good kind of brother sister chemistry uh right off the bat even though they didn't have like a shared arc together. Um the most that they shared is that she was tortured by the same guy who tortured his dad right before his dad was killed. Um and what a haunting way to introduce that side of the story in these first three episodes. in the first episode where it's kind of like POV walking into their uh little um house or home or whatever. Will's kind of in a sleeping outside and you walk in and when it goes to the mirror it is the scientist who uses the you know the death of these uh babies that were",
            "start": 3598.0
        },
        {
            "text": "um house or home or whatever. Will's kind of in a sleeping outside and you walk in and when it goes to the mirror it is the scientist who uses the you know the death of these uh babies that were uh killed or whatever to torture people. And like the chills I the shivers I got I was like oh girl you are still so [ __ ] up from this. so much, man. Yeah. Yeah. I mean, where we left off, she could barely speak. Yeah. Yeah. Exactly. God. And I was like I was scared. The last thought I had is the I was scared when she is in that fight with the uh Imperial officer. Um there's a moment where she hits her head and she's kind of like out of it. I was like, [ __ ] man. What is this? Like is this going to regress her in? Because it's where she ends in season one where we find her here. There's been a lot of like I don't know if healing is the right word, but there's been a lot of like kind of finding herself again. I was like very scared of where she's going to be at mentally at the end of",
            "start": 3643.04
        },
        {
            "text": "been a lot of like I don't know if healing is the right word, but there's been a lot of like kind of finding herself again. I was like very scared of where she's going to be at mentally at the end of Totally. I mean, also we know we lose her. We know we lose her at some point. So, yeah. But can you imagine like she regresses? So she was where we understand her to be at when Cassian left and then if Cassian had come back and from hitting her head she had regressed back to the place of like just post torture would have been devastating. Um I'm glad that they found each other again but yeah I mean even then though she's so messed up. I obviously uh Braso just died but like the final shots of her and the TIE fighter like she looks messed up man. Like she woof we'll see. We'll one year later solve it. We'll have to find out next week. Um, thank you so much for hanging out with us. Uh, Sage, thank you so much for joining us again. Hopefully I can get both you and Carboni next week. We will",
            "start": 3694.16
        },
        {
            "text": "it. We'll have to find out next week. Um, thank you so much for hanging out with us. Uh, Sage, thank you so much for joining us again. Hopefully I can get both you and Carboni next week. We will see Friday 12:30 p.m. Pacific is the plan. Uh, Sage, where can people find you? You can find me everywhere on the internet at not Sage or on YouTube. Pixel Circus. Hell yes. Until next time, may the force be with you. [Music]",
            "start": 3739.44
        }
    ]
}