{
    "id": 13924,
    "video_id": "6ComHGtAlrI",
    "show_name": "Gameplay",
    "hosts": [
        "Andy Cortez",
        "Mike Howard"
    ],
    "title": "Andy Showcases Marvel Rivals Szn 2 with NVIDIA DLSS4 #RTXON #geforcepartner",
    "description": "Learn More: https://www.nvidia.com/en-us/geforce/news/indiana-jones-great-circle-marvel-rivals-dlss-4-multi-frame-gen/ #sponsored \n\nWishlist Empyreal Now!\nEmpyreal Steam Page -  https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744717377,
    "duration": 7940,
    "transcript_chunks": [
        {
            "text": "Three, two. Hey, what the heck is going on? Kind of funny best friends. Welcome in to your Kind of funny games afternoon stream with your boys Mike and Andy for a very fun sponsored stream teaming up with our friends over at Nvidia to show you the very best in video games. And Andy, we got a fun combo today. Season two of Marvel Rivals is now here. Nvidia DLSS4 and Reflex giving you the very best in Marvel rivals rivals performance to make you play at your best. Are you ready to rock? Of course I am. M cuz frames win games. Frames win games. You got to make sure though a lot of people don't remember this when they want to enable any of the DLSS stuff. Okay. The first thing you got to do is you you have to like just hit your Windows button on your PC and type in graphics settings. And if you do that, then one of the first popups you'll see, I don't even know if mine is showing. I don't think it is cuz I think I'm just caption. Oh, it is. What you want to do is um you need to turn on",
            "start": 0.08
        },
        {
            "text": "you do that, then one of the first popups you'll see, I don't even know if mine is showing. I don't think it is cuz I think I'm just caption. Oh, it is. What you want to do is um you need to turn on hardware accelerated GPU scheduling. Turn it on. That's one thing that you kind of have to enable at the c it's like a kernel level type thing, but not really, but it kind of is. you turn that sucker on first and then you could get all the benefits of DLSS4 including the frame generation and all of that fun stuff because we all know the frames win games uh especially in multiplayer games especially when you're using something like reflex which allows uh which gives you shorter response time from when you click that button to the thing happening on the screen you want all of that time to be as short as possible and Nvidia is making it possible Because frames win games, Mike, I love that, Andy. Well, we're back again for some Marvel Rivals to celebrate season 2. I'm excited cuz you needed a",
            "start": 49.84
        },
        {
            "text": "short as possible and Nvidia is making it possible Because frames win games, Mike, I love that, Andy. Well, we're back again for some Marvel Rivals to celebrate season 2. I'm excited cuz you needed a kickstart to get back into it. You love Marvel Rivals. You've just been playing so many games. You've been so that now it's finally time to get you back involved, back into the fun. So, I'm excited for you to kickstart that engine. And I'm also excited to team up with our friends over at Nvidia for a fun sponsored stream. So this afternoon we'll be telling you all about DLSS4 and all the cool tech behind the scenes with Nvidia to get you the very best performance out of your gameplay, especially with Marvel Rivals and so many other video games. So sit back, relax, get comfortable, and also maybe if you're free, come join me and Andy. We'd love to fill out the team and have all of you come join us. So if you're sitting around at home and you want to play Marvel Rivals with us as we do this",
            "start": 100.0
        },
        {
            "text": "if you're free, come join me and Andy. We'd love to fill out the team and have all of you come join us. So if you're sitting around at home and you want to play Marvel Rivals with us as we do this fun sponsored stream, feel free to jump on in and have a good time with us. But Andy, before all of that, let's catch up. Let's talk about it. How do I get the very best? What do I have to do to turn on DLSS4? Mike, you need to hit the escape button. Escape. Then you go into your settings. Get out of here. And then under display, you want Nvidia DLSS on. Okay. If you're playing on a 4K monitor, maybe you go with something like balanced or or performance mode because what DLSS does is it if you're playing in 4K, it'll make that 4K image cuz it's really hard to make the game look good and run well at 4K resolution. But when you turn DLSS on, if you go to performance mode, it'll take that 4K image and make it, let's say, a 720p image, which is a lot easier to run things at high frame rate when",
            "start": 142.72
        },
        {
            "text": "at 4K resolution. But when you turn DLSS on, if you go to performance mode, it'll take that 4K image and make it, let's say, a 720p image, which is a lot easier to run things at high frame rate when your resolution is that small. But then it uses AI to rebuild that image to get it back up to the sharpness of 4K. Since I'm playing on a 1440p monitor, I normally go with quality mode, meaning that I'm not rendering everything at 1440p anymore. It goes down to like, I don't know, 900p, 1080p. I'm not exactly sure the right the numbers, but then it uses AI to rebuild it back up to 1440p. So, it looks insanely sharp. It looks amazing, but the game is going to be running smoother because of that. And then you want Nvidia Reflex low latency on. You turn that sucker on. Nvidia reflex low latency. You need that cuz frames win games, Mike. Nvidia DLSS frame generation. You turn that sucker on whether you want two, three, or four. Oh, and usually frame generation really good for playing a game",
            "start": 190.48
        },
        {
            "text": "You need that cuz frames win games, Mike. Nvidia DLSS frame generation. You turn that sucker on whether you want two, three, or four. Oh, and usually frame generation really good for playing a game with like crazy high uh insane ray tracing. Okay, that's usually kind of tough to get a lot of frames when something looks visually that t when something looks that visually incredible and it's that taxing on your machine. Frame generation will get you to the frame rate that you want to then have all of the the visuals and bells and whistles uh in your video game. and then everything else. Well, you know, in a game like this, I'll turn off global illumination cuz Okay, I don't need ray tracing my multiplayer game. Oh, okay. You know what I mean? Okay. Okay. That's a game setting. That's not Well, that's how you turn on that's how you take advantage of DLSS4. And this is how you take advantage of this fun sponsored stream with me and Andy and the crew here at Kind of Funny alongside Nvidia.",
            "start": 238.72
        },
        {
            "text": "that's how you turn on that's how you take advantage of DLSS4. And this is how you take advantage of this fun sponsored stream with me and Andy and the crew here at Kind of Funny alongside Nvidia. You can type in exclamation point rivals anytime throughout today's stream to go learn more about DLSS4 and Reflex in some of your favorite games and beyond. And of course, you can help support the Kind of funny crew and our awesome sponsorship with Nvidia for more fun and great times. Like I said, if you want to come join us, I got the party open. Andy Cortez, come join this party. Let's party. Let's have a good time and let's play some games. What to say? Your little shark's so cute. Look at Yeah, man. Jeff the Shark. It's the only I'm having such a good time. only character I ever learned. And this is uh this is me. The only character you ever needed. Yeah, exactly. That's all I ever needed. That's right. Andy, isn't this shark super cool? Yeah. Oh, I Oh, Jeff the Shark is great and it's",
            "start": 284.56
        },
        {
            "text": "this is uh this is me. The only character you ever needed. Yeah, exactly. That's all I ever needed. That's right. Andy, isn't this shark super cool? Yeah. Oh, I Oh, Jeff the Shark is great and it's I'm happy to see Mike maybe return to his to form. Yeah, I'm ready to heal and be on the back line and all I need is my number one DPS guy, Andy Cortez. His dips guy. I might be checking out uh Emma Frost as well. Little dips guy in the video game. Okay. Yeah, check out Emma Emma Frost. He's a brand new hero. This is a brand new season. Uh-huh. Request to join. Oh, did you already Oh, you already sent me one. The invite. There we go. We're off and moving. Andy, you're all set then. Check your friend requests. Oh. Oh, we're getting into the Oh, we're not getting people in. I already have a full squad. All full. I loaded them up while you were showing us uh Nvidia DLSS4 and how to turn it on. Thank you to BJ Bernard for the $5 super chat that says, \"Paying my birthday tax. Very excited for",
            "start": 324.48
        },
        {
            "text": "squad. All full. I loaded them up while you were showing us uh Nvidia DLSS4 and how to turn it on. Thank you to BJ Bernard for the $5 super chat that says, \"Paying my birthday tax. Very excited for Wrestlemania coming up this weekend. Which pro wrestlers, alive or dead, would you like to meet? Thanks for everything.\" Aria Ripley, would you like to meet her alive or dead? Like to meet her corpse in 300 years? Yes. Uh, it's a great question. Yeah. Yeah. Who would you like to meet? Eddie Guerrero. Oh, Eddie. Um, let's see. Seconds before you attack. You know what? I I did meet him, but I would love to just have a a chat with him because Greg had a great chat with him at uh I think it was a Kansas City Comic-Con. Okay. We went one year where he uh spoke to Mick Foley. I had a little sit down interview. Oh, that's cool. And Mick Foley is just a really interesting dude. I'm going to say it here just in case cuz I think we can make it happen. I'd like to hang out with Xavier Woods a little",
            "start": 370.48
        },
        {
            "text": "interview. Oh, that's cool. And Mick Foley is just a really interesting dude. I'm going to say it here just in case cuz I think we can make it happen. I'd like to hang out with Xavier Woods a little bit more. You know what I mean? How do we get Austin Creed over here now? You know what I mean? Hey. Hey, get over here and hang out. We can be heels together. That's a jerk now. To the mission area. Got it. All right. Here we go. All right. I've never played Emma Frost. Yeah, but we're going to learn together. Okay. I love that. I love that. As long as you're feeling confident, feeling good. Andy, I'm going to pull your C. Oh, dude. Kenny Omega is a great one. You're going to what, Kevin? I'm going to pull your camera down a little bit. That's too much head room. Oh, okay. It's all good. I thought that I had framed you correctly by bringing it up, but it turns out because you're wearing a black sweater, I couldn't tell that there was just a giant black bar under. Oh, okay. I got the thing",
            "start": 430.72
        },
        {
            "text": "that I had framed you correctly by bringing it up, but it turns out because you're wearing a black sweater, I couldn't tell that there was just a giant black bar under. Oh, okay. I got the thing in the video game now, too. They got all the Fantastic Four. Hi. Hi. Mike, have you played a lot of this? I just got dumped. No, I have not. I have not. Chris, Anka, and Kevin are still playing a lot. JD. Oh my god, the shark is sounds so cute, too. I need a good excuse to come back into the game. Um, since I turned into a lord, Jeff the Shark. You are a lord, right? Yes. I think what is what? Okay. So, you have played a lot of Yeah. I mean, back in the day. Oh, yeah. But having one character as lord is not enough. If you really want to be a pro, you got to be playing a lot more. And Andy, we like Emma Frost. She's cool. Uh, I don't know. It's my first time playing her. Um, apparently she's a really good tank. Still don't really fully know how to use I don't know what my what that button does.",
            "start": 468.64
        },
        {
            "text": "Emma Frost. She's cool. Uh, I don't know. It's my first time playing her. Um, apparently she's a really good tank. Still don't really fully know how to use I don't know what my what that button does. Oh god. Oh [ __ ] I just Oh, he was so close to being dead. [Music] Oh, I died. Yeah, that's unfortunate. She called us into her special trans beam where she pulls us closer towards her. Oh, who is Oh, Emma Frost. Emma Frost. Yeah, it's really cool. Shift then E to grab then right click to kick. Exquisite crazy. I want to go on the point. I have ult as well. Now, how much research are you doing? Like, do you know what her alult looks like and how it's supposed to work? Uh, I was just in the uh I was in the the shooting range a little while ago messing around with her. Everybody's alting on me. I'm here alone in the I held it off for a decent amount. Yeah, that's good. Mhm. If you kick them into a wall, it does more damage. I don't even know how to kick. I also changed my button prompt. So",
            "start": 539.36
        },
        {
            "text": "I'm here alone in the I held it off for a decent amount. Yeah, that's good. Mhm. If you kick them into a wall, it does more damage. I don't even know how to kick. I also changed my button prompt. So people I I think if you're giving me combo buttons to do in the chat, that doesn't apply to me. Oh, yeah. Yeah, he had different buttons, right? You just have to tell us what it is. All right. So, she's got she switches between regular mode, mid-range, psionic mode to diamond mode, which is close-range melee. Okay. Okay. Oh, yeah. All right. So, that's that diamond mode right there. And this is where I could do the F button and it like Oh, right click is kick. Oh, 30 seconds before you attack. Get ready. Interesting. Okay. You know, my weapons can still lock on. So, let's probably shift. I thought we were supposed to be on the try it out. Shift. Oh, you have like a dash, too. That's crazy. Be sure to remember that. And when it does, I'll be ready. The battle starts in five. No, she's a",
            "start": 619.28
        },
        {
            "text": "thought we were supposed to be on the try it out. Shift. Oh, you have like a dash, too. That's crazy. Be sure to remember that. And when it does, I'll be ready. The battle starts in five. No, she's a tank, chat. Three, two, one. You kidding me? Look at these thighs. All you need to do is capture the missionary. Try to drive a cyber truck in into her and it just crashes. You know, it gets ruined. The dash is the choke slam. Oh, the dash is the choke slam. Yeah, Andy, I got to go set up something. I'm going leave it on your gameplay. Okay. Okay. There it is. Okay. You're dead. Somebody up top. Who's Who's up there? I don't see anybody up there. I see people. Somebody Somebody's moving up there. I hear it. Impervious. I see Big Hammer up in the front. We got Nitro playing with us. We got some kind of funny best friends joining us. See you guys up there. Ooh, Olive Party's here. I am. That was a nasty little combo, chat. Pretty good combo. Your mind is mine. Leave them to my I like that",
            "start": 676.88
        },
        {
            "text": "kind of funny best friends joining us. See you guys up there. Ooh, Olive Party's here. I am. That was a nasty little combo, chat. Pretty good combo. Your mind is mine. Leave them to my I like that ability. [Applause] And already forgotten. Sick. Sick. There we go. Holding down the point. No problem. Good job everybody. Look at that. Olive party with eight kills. Strat with Damn gamers. You guys are gamers. I suppose that helped. Oh god. Oh god. I am ready to put on a show. Oh, good. Might as well. Oh, no. Oh, no. Oh, no. That's never good. I am ready to put you clobbering time in you. You hear it's clobber? No, not me. But just looking down at me. Not me. No. About to go to town. I'm doing my best to stay in the backline. Got room for one more next game. We have a full party, Fox, but we will be swapping people out all the time. So, we'll be kicking people out and other people. Well, just telling people to leave. I'm not, you know, I'll do the kicking. I'm Yeah, Michael. Do the",
            "start": 751.92
        },
        {
            "text": "we will be swapping people out all the time. So, we'll be kicking people out and other people. Well, just telling people to leave. I'm not, you know, I'll do the kicking. I'm Yeah, Michael. Do the kicking. I think Cameron Abbott also wants to play. Coming with me, Mr. Groot. Oh, we're bothing each other. [ __ ] you. There you go, team. Take that. Take that. There we go. There we go team. Way to go. Go team. Look at Mike. Just our turret healer up there. I'm just up here. Oh, it a Yeah. Let's stop. Oh, that's huge. That's huge, Mike. Let's stop the thing right away. What do you say team? There we go. Uhoh. Here go. Here they come. Garut and rocket very low. Power. Oh, I got stuck. Oh no, I'm about to go down. Let's win this game. Uh-oh. Lost. I got you, buddy. I got you. Okay, we lost. Let's uh maybe let's back up. We have two out there. We have two here, one here. Let's wait for Thor to come back. Hostile. Let's wait for Mujolnir to come back and then we can go out there full force.",
            "start": 854.0
        },
        {
            "text": "uh maybe let's back up. We have two out there. We have two here, one here. Let's wait for Thor to come back. Hostile. Let's wait for Mujolnir to come back and then we can go out there full force. Wait for the hammer. Oh no. Strap. Be careful. Domination. Oh, I'm getting [ __ ] I'm getting frosted. Okay, I need help. Oh my god, I need help. Your mind is mine. Oh no. Oh, you did your best healing me. That was not good, huh? You did your best. We got ulted. That's unfortunate. You can't be rid of me so easily, I'm afraid. Exquisite. 89%. It's you and me again, old buddy. Leave them to behold the god of the winner. judge the jury. They're dominating. You can't be Let's go, Mo. Get in there. I think they got us, unfortunately. It's okay. That's okay. That's all right. Thought thought we were going to start off 10, to be honest. That's all right. That's all right. Start off. Put that on me. I'm on a new hero. I don't know what the [ __ ] I'm doing. Okay. Okay. He's learning, but I know that",
            "start": 960.72
        },
        {
            "text": "to start off 10, to be honest. That's all right. That's all right. Start off. Put that on me. I'm on a new hero. I don't know what the [ __ ] I'm doing. Okay. Okay. He's learning, but I know that frames win games. Mike, let's talk about it. Of course, you can type an exclamation point rivals anytime throughout today's stream to get the nightbot command to take you to the new blog post from Nvidia detailing DLSS4 and Reflex currently now for season 2 with Marvel Rivals and more of your favorite games. Andy showed you how to enable it all to take advantage of it. Update those drivers. Yes, always update those drivers. Make sure you're up to date, getting the very best out of it. And uh Andy will tell you more about that after a couple more games. Always be updating gamers. Let's jump to the squad. Great job. Everybody's going to get a thumbs up from me. Everybody gets a thumbs up. You all carried me. Another match. Oh, were they four tanks? I didn't realize that. They had Groot, they",
            "start": 1050.24
        },
        {
            "text": "squad. Great job. Everybody's going to get a thumbs up from me. Everybody gets a thumbs up. You all carried me. Another match. Oh, were they four tanks? I didn't realize that. They had Groot, they had Thor, they had Dr. Strange, they had The Thing, they had Rocky Raccoon, they had Luna Luna Snow. What a squad. What a squad. All right, let's see. Um, you know what sucks, Mike? The rocket raccoon thing that helped Winter Soldier shoot uh unending. Yeah. Yeah. Gone. They said no more. He only pair he only pairs up with uh Punisher now. No more Winter Soldier. Oh, that's too bad. Breaks my heart, Mike. Just breaks my heart. But I'm still going to go made the choice to get out. Still going to go Winter Soldier. Okay, I'll be on the front lines. Oh, this is this a new map? This looks No, no, never mind. We've been here. This just area looks different. It's been a while since I've played. Been a while. How long has it been for you? Well, I did play the other day with Chris, but before that,",
            "start": 1090.4
        },
        {
            "text": "mind. We've been here. This just area looks different. It's been a while since I've played. Been a while. How long has it been for you? Well, I did play the other day with Chris, but before that, it had been months and months. Like, okay. Okay. Okay. And and while I say that, Mike, I still looked at the battle pass. I was like, \"Oh, I saw this dark hole to battle pass. I was a part of this.\" He was a part of that. Well, yeah. Yeah. Yeah. Yeah. It's only season two, so how many battle passes did you really miss out on? Yeah, that's true. That is true. Can't be many. Let's look at the stats. See who's the blame. Look, it was my fault. Who Who's the blame? I put that last I put that last match on me. Everybody did great. I didn't hold my own. But I do like Emma Frost. That's a plus for me. I've been looking for a tank. I haven't had a tank to fully fall in love with. I don't think Chris is going to like you saying that. I know. I know. Pretty sure that's his character. Oh, there we go.",
            "start": 1147.44
        },
        {
            "text": "I've been looking for a tank. I haven't had a tank to fully fall in love with. I don't think Chris is going to like you saying that. I know. I know. Pretty sure that's his character. Oh, there we go. Great job. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come. Okay, we're playing safe. I like it. So are they. We're holding it down. [Music] That's what I need. Oh god. Oh damn, dude. Oh my god, I'm just getting frosted. I just got frosted. Isn't that unfortunate? Emma Frost just gave it to me. Isn't that unfortunate? Chrisa says, \"That's cool. Andy sucks. You won't ever get to play her.\" Oh, yeah. Look, man. That's not cool. Chris. Okay. You got to share the wealth. I This whole time every when I play Overwatch, if I want to win, I go Sigma. That's my best win rate hero. If I want to have fun, I go Ash. Ch. I'm pretty decent as Ash, but if I want to win, I go Sigma. I've been looking for that experience. Oh god. Oh god. Emma Frost is coming for me.",
            "start": 1186.4
        },
        {
            "text": "win rate hero. If I want to have fun, I go Ash. Ch. I'm pretty decent as Ash, but if I want to win, I go Sigma. I've been looking for that experience. Oh god. Oh god. Emma Frost is coming for me. She's She's choking me. It's kind of awesome, but scary. Emma Frost is terrifying to deal with. Holy [ __ ] Aren't you Emma Frost? Huh? Aren't you playing? No, I'm I'm soldier right now. I went up. You switched up. Glad to help, partner. Disappear. The choking move is crazy. Steal peasants. Uh-oh. Uh-oh. She's doing her thing, huh? Yep. She did her trance. And they got us. They got a lot of us. Leave them to comfort. You are dangerous. Oh, I just missed your [ __ ] ass. [ __ ] you. What did I get hit by so far away? There's a guy on top of you right now, too. All right, good. Oh, you're so close to being dead. Oh my god. You so close to being dead. That's the been knocked down before. Doesn't last. Been knocked down before. Hurt my hurt myself real bad. Stop that. The world. What is hurting",
            "start": 1279.2
        },
        {
            "text": "to being dead. Oh my god. You so close to being dead. That's the been knocked down before. Doesn't last. Been knocked down before. Hurt my hurt myself real bad. Stop that. The world. What is hurting me right now? Oh my god. Oh my god. Oh my god. Get on the PlayStation with the real pros. Andy been knocked down before. Look, that's where I started off my shooting career. Michael Overwatch on Xbox. You were gaming. You know, I was gaming. We were gaming back then. Still games. He's going to be back to Marvel Rivals. Time to slow down. Disappear. Oh god. Oh, they're doing their move. Just shooting into it. Just building a little charge, you know. Just locked me in. What? Oh. Whoa. Oh, it sucks you in. Yes, dude. That's I didn't know that. Yeah. Yeah. Put you in a trance, man. put you in a trance. Oh, damn. I thought it was just like damage and it does damage while you coming at her. That's great. All right. Uh, here's the thing. I'm one and five. Okay. Not looking great, right? But now",
            "start": 1359.36
        },
        {
            "text": "Oh, damn. I thought it was just like damage and it does damage while you coming at her. That's great. All right. Uh, here's the thing. I'm one and five. Okay. Not looking great, right? But now we win. I'm going Punisher. I was going to I was going to go hella, but strat's already hella. Strat way better than me. Oh, really? Okay. I'm just tealing it up. We're getting pushed back on. Now or stop them. Battlefield ready again. Missed all of those bubbles. Just trying to shotty this dude. Oh my god. [Music] Would love to get a kill here. Look who's here. Oh, she's so close to being dead. Oh. Oh, no. All party fighting for your life. Firework. They ain't seen nothing yet. Heavy weapons. Oh, you belong to me. Wow. Olive party holding their own. Oh my hammer. Big hammer. Take that ultimate to the face. That's tough. Where did he go? Is he dead? Wow. You guys helped him off. Great job. We live to fight another day. 3:45 scary. It's scary. 3:45 team, you stop them in their truck. What are",
            "start": 1447.28
        },
        {
            "text": "the face. That's tough. Where did he go? Is he dead? Wow. You guys helped him off. Great job. We live to fight another day. 3:45 scary. It's scary. 3:45 team, you stop them in their truck. What are these? What? Oh, I'm hitting her shield or something. Oh yeah, her like diamond form is kind of crazy. Smoke screen. I'm hungering down. Oh, we lost one now. Come on. Come on. [ __ ] I'm good to go. How have I not built up another alt yet? Just non-stop combat. Oh my god, I'm so scared of Emma Frost. It's not even funny. Like, I'm terrified of her against the world. God damn. What the hell? The diamond form combo finisher is where her real damage. Hers kick hits hard. Yeah, I was noticing the kick was pretty nasty. See, if this were comp Yeah. Yeah. That's all right. That's all right. Wait, we're getting stretched out. We're getting loose. You know what I mean? We're going to warm it up. We're going to warm it up. So much jiggle there. That's crazy. Midnight Marvel, thanks for 15 months of",
            "start": 1542.88
        },
        {
            "text": "getting stretched out. We're getting loose. You know what I mean? We're going to warm it up. We're going to warm it up. So much jiggle there. That's crazy. Midnight Marvel, thanks for 15 months of support. Raven really brought it on that one. Uh, you know, at one point I was one in five. Oh, yeah. Okay. Okay. I mean, it's clear I'm the weak link right now. You know, you but you haven't warmed up yet. Yeah. But you are getting the very best thanks to Nvidia, of course. So, I expect more from you. Imagine how much more reflex. You have Nvidia DLSS4. You probably should be playing at your alltime best. I need you to shut your mouth right now. Okay. You should be up. I'm going to squad. We got one more with all of you. Then I'm going to kick you out. We're going to get some new best friends in the air. So, let's squat up. Let's go have some fun. If you want to join me and Andy on today's sponsored stream brought to you by Nvidia, type in exclamation point rivals anytime throughout today's",
            "start": 1651.04
        },
        {
            "text": "the air. So, let's squat up. Let's go have some fun. If you want to join me and Andy on today's sponsored stream brought to you by Nvidia, type in exclamation point rivals anytime throughout today's stream to learn more. You can queue up and get ready as I'm going to grab another four best friends to play with us. I love that, Mike. I love that. And if we don't have more, I'll bring you back. You know, that's how it will go. Baby Chris will join us and show off his skills. Okay, we're back to I'm going back to, you know, old faithful right here. Okay. What are you thinking? Oh, wow. Hella with the nitro rifle colorway, dude. Isn't it the Wow, this was a free skin through like Twitch Prime or whatever. It's the sickest looking skin ever. I freaking love this. It's very you, which is very nice. Yeah, I freaking love it. I love that. Didn't January Jones play Emma Crossen or Emma Frost in first class? Uh, yeah. Yeah. January Jones was their name. That's a dope name. That's a very good",
            "start": 1691.2
        },
        {
            "text": "nice. Yeah, I freaking love it. I love that. Didn't January Jones play Emma Crossen or Emma Frost in first class? Uh, yeah. Yeah. January Jones was their name. That's a dope name. That's a very good name. It is a cool name. January Jones. You don't hear month names that much. How many Mays have you met? Not many. That's true. June 30 seconds. That is true. April. Oh, April. April O'Neal. April O'Neal. April. And then January. I like January. That's kind of stepping out of the box. Maybelline. Mabel. Maybe she's born with it. It's Maybelline. Uh-huh. October. No, there's definitely no October. October. I did have a friend though where all of his siblings were named uh Texas cities. So, his name was Houston. He had a Dallas brother. He had a Victoria sister. I love that. I kind of dig that. Names is cities. City names. Not bad. Oh, behind. Oh, behind. Spidey. Spidey behind. Spidey. Weak. That's evil. No escape from hell. Oh god. Venom pissed. Okay, come over here, Spidey. Come over",
            "start": 1730.08
        },
        {
            "text": "Names is cities. City names. Not bad. Oh, behind. Oh, behind. Spidey. Spidey behind. Spidey. Weak. That's evil. No escape from hell. Oh god. Venom pissed. Okay, come over here, Spidey. Come over here, you little [ __ ] Get over here. Oh my god. Oh my god, Doctor Strange didn't allow any of Rona X. It's my 21 sub anniversary, 16 months straight. Whoa. Can I play with you guys if you're able to hop in on time? Yes. Come join us at We have priorities with uh I know Cameron Abbott wants to hop in. We have uh Sen Nuggies wants to hop in. Also, Rona, tell me your favorite name. That's a month that you would like to name. Yeah. Nobody goes September. No October, noveers, no Deceers. [Applause] All right, they're on mic. Uh, Spidey's on mic. How about a march? Could you name somebody a march? Yeah, there's a mar. You could name march. You go with a march. I got you. I'm getting spidied. Here we go. Got it. You're such a tiny little body. You are such a tiny body. I cannot aim at you.",
            "start": 1793.04
        },
        {
            "text": "Yeah, there's a mar. You could name march. You go with a march. I got you. I'm getting spidied. Here we go. Got it. You're such a tiny little body. You are such a tiny body. I cannot aim at you. Undefeable. This team is just going crazy, aren't they? God, the the tiny bodies in this game are just too small. No, the tiniest hit boxes you ever seen your life. I want a soul. You don't want to step out there, Andy. That's a lot of people right there. You want to step out there? [Music] I'll break your shield. Terrible by me, but it's all good. All right, Spidey, get over here. Jesus. Jesus. My coworker is in November. No, they got to be the only ones in November. See their ID. We're going to need we're going to need a gonna need to see some sort of passport ID. As the family started the monthly theme, they were like, \"We'll never get to November.\" Right. Exactly. Or they're like, \"We're going to start on November.\" I want your soul. June's a good one. June. I love June. I love June. Yeah.",
            "start": 1866.8
        },
        {
            "text": "theme, they were like, \"We'll never get to November.\" Right. Exactly. Or they're like, \"We're going to start on November.\" I want your soul. June's a good one. June. I love June. I love June. Yeah. Hey, June. No, it's June. You are uneatable. Oh. Oh, he's alting. Oh, he's alting. Friends, gather around. Okay, that's not working. Who should I switch to so that I don't don't I get dumped on the least. I'll try I'll try soldier again. Unspeakable things. I hope it's not too late to set them right. It's now or never. Stop. Our dog's name is June. Okay, I like that. I like that. Stop that vehicle. Not so fast. You make a good team. That's what I need again. I am. They still got Venom with this shield, huh? Yeah, Venom's really good. Come back here, man. That doctor, man, strength is so low, dude. There it is. There he is. Got him. All right, his Spidey's up here. Here come the bad guy. Dangerous. Oh no, Phenom. Oh, nice. Undefeatable. Spidey's a menace. He's a menace. Olive party, I'm",
            "start": 1947.92
        },
        {
            "text": "dude. There it is. There he is. Got him. All right, his Spidey's up here. Here come the bad guy. Dangerous. Oh no, Phenom. Oh, nice. Undefeatable. Spidey's a menace. He's a menace. Olive party, I'm sorry. I'm not healing you. Who's not going to heal? I'm trying my best. Oh, got his ass. What? Oh, I got blinded. Aamoto. Oh, dude. Dude, he almost died. No. Have any of the Venoms twerk in front of you guys yet? Uh, when I played with Kevin Aex and Kevin and uh Chris been knocked down before the uh Kevin was often twerking. Oh, nice. You had to buy that? Yeah, you could buy a twerk emote. Really? They've been selling that? That Yeah, he does like the twerking. It looks like Did you ever play Angerfoot? No. Oh, cuz like the enemies in that game when they killed you, they would just start twerking on you. I remember that. And it looks like this. It looks like they just copy pasted the animation. It's like wildly similar. You know what? I think I'm I I think I'm getting better as as soldier.",
            "start": 2027.84
        },
        {
            "text": "on you. I remember that. And it looks like this. It looks like they just copy pasted the animation. It's like wildly similar. You know what? I think I'm I I think I'm getting better as as soldier. Okay. I thought you were going to get better as a new character. Um Well, I didn't go tank. I went DPS. Okay. Okay. I messed up probably doing that. Um, you want to swap some people out, Mike? I'm already grabbing people. Oh, you're already grabbing people. Why don't you tell them about Nvidia DLSS and I I'll grab more people right now. Everybody with Nvidia DLSS, you want to activate DLSS4 because that helps your game look great without sacrificing on frame rate or sacrificing on resolution or visual quality, performance, any of that. at Nvidia DLSS is where you want to be whenever you are playing either a multiplayer game or a single player game because frames win games. You turn on DLSS. Since I'm on a 1440p monitor, I'll go quality mode. Um, and that lowers the resolution of the game so",
            "start": 2122.64
        },
        {
            "text": "either a multiplayer game or a single player game because frames win games. You turn on DLSS. Since I'm on a 1440p monitor, I'll go quality mode. Um, and that lowers the resolution of the game so things can run better, but then it uses AI to reconstruct the image. Things look incredible. Uh, and then we got to turn on Nvidia Reflex low latency. Enabling low latency reduces game image delay. Certain frame generation algorithms will automatically activate low latency mode. You want low latency on because frames win games. Why are we like why do I have a three star freaking Oh, I have North Virginia also selected as a server. Oh no. I see. I see here. All right. How do I invite or get to Mike? You're not in mine. No. Oh no. What? What happened there? All right. Well, I'm coming back to you. Okay. Are we quitting? Or you just stay right there. You just wait for me. What? You think Blade's coming in the game? People are talking about Blade coming to the game. Oh, come on. Of course, dude.",
            "start": 2170.48
        },
        {
            "text": "Okay. Are we quitting? Or you just stay right there. You just wait for me. What? You think Blade's coming in the game? People are talking about Blade coming to the game. Oh, come on. Of course, dude. That would be ideal. That'd be kind of cool. Oh, Mike kicked everyone. Oh, it says all the party. Well, he Oh, cuz. Gotcha. I was going down the list. Well, cuz you Yeah, you were kicking everybody else, so I got kicked. That's all good. I might have just zoned out. That's all good. I was out here yapping. All right, I have to accept Cameron Abbott's friend. What do I do? There's Soulless, Fox of the Future, Chicken Chaser. All right, let's get this going. Oh, Cam Nelly's in the party, too, I think. Yeah, look at [Music] that. BJ Bernardo $5 super chat. Thank you once again for your support. Thank you everybody resubscribing and supporting. All right, we're back. We got a new squad of best friends jumping in. Let's go have some fun. All right, so far 0 for three, Mike. 0 for three is",
            "start": 2221.12
        },
        {
            "text": "Thank you everybody resubscribing and supporting. All right, we're back. We got a new squad of best friends jumping in. Let's go have some fun. All right, so far 0 for three, Mike. 0 for three is tough. That's not how we normally start these kind of games. That's That's tough. Now, whenever you play six squads, the right heroes could make, you know, you kind of six stacks. You'll you'll play against other six stacks. Oh, you're worried that we're teaming up against other teams. Other team other players that, you know, play together. Yeah, sure. Okay. Okay. Okay. That's kind of where I'm at. All right. Came going rocket. Um, I'm going to go sidekick. What I do is I'm going to go soldier Mike. Uh, Mike got to room 46 in Blueprints last night. Oh, [ __ ] Really? No, wait. Oh, you're telling him that you got to That's cool. Kevin, how far did you get? Uh, I still have not I've not gotten in, but like, man, I've had such a good time. Yeah, I'm on How far are you? I'm on run 10 or run 11.",
            "start": 2277.2
        },
        {
            "text": "him that you got to That's cool. Kevin, how far did you get? Uh, I still have not I've not gotten in, but like, man, I've had such a good time. Yeah, I'm on How far are you? I'm on run 10 or run 11. Okay. Um, I got one room away and then just luck of the draw didn't give me a room that led into it. But I am so impressed with how it's evolving. It's such a blast. Uh I think I'm on like run 22 somewhere around there. Mike, do you know what run you were on? Uh day seven. Oh, you really Well, I restarted. Do you remember? Yeah. You and I played for 4 hours and I played another four hours uh restarting and I haven't played since then. Uh this weekend was me I don't even know what I played. I think that and uh HalfLife 2 I finished. Oh, cool. Yeah, I beat Halfife 2 for the first time. It's really cool. The game is so much fun and it keeps opening up like a beautiful flower. Blueprints eating. Yeah, he's just eating this flower. Andy, what do we think about uh the White Queen? The White",
            "start": 2336.52
        },
        {
            "text": "really cool. The game is so much fun and it keeps opening up like a beautiful flower. Blueprints eating. Yeah, he's just eating this flower. Andy, what do we think about uh the White Queen? The White Queen? Yeah, it's another name for Emma Frost, right? Oh. Um, Chad, right? I got to get back to her cuz I did enjoy her. Oh, okay. Chad, right? I've I've never heard that. I don't know. But I don't know much about Emma Frost period. Anyway, who is she a part of? What is she in? X-Men. She's in the X-Men. Okay. Oh, nylon over there saying correct. Has she been in a movie? Yeah. Uh, Days of Future Past. No. No. First class. Jess. No. What's her first class? Gemma Jones. No. January Jones. We just talked about her. Oh, you just Is she big in that movie? She gets like She's a kind of a plot point. She gets like kidnapped by the by the crew. Does she get kidnapped? Yeah. Yeah. They like They hold her She's like kind of chained. It sounds nasty, but she's chained against the bed. That is nasty.",
            "start": 2392.96
        },
        {
            "text": "She gets like kidnapped by the by the crew. Does she get kidnapped? Yeah. Yeah. They like They hold her She's like kind of chained. It sounds nasty, but she's chained against the bed. That is nasty. There's still a chance to stop them. Oh my god. Oh my god. someone squeezing her neck and the diamond starting to crack. Yeah, it was uh it was uh the bacon bacon lady. Yes, I remember that. Uhhuh. Over yet. They hit a checkpoint. Now might be a good time to stop them. Yeah, that [ __ ] was like scary. The sound of like her diamond armor. Yeah. Cracking. It's gross. And Wolverine Origins. I do not remember. Oh, I don't remember that. Damn. But there's a movie I didn't love. Wolverine. ready to do some damage. More bad guys. Just what we need. Okay, so Chris Ananka comes here and clarifies the Hellfire Club and they all have different names based on chess pieces. Black Queen, Black and White King, etc. Oh, that's cool. Yeah, Fire Club's a cool name. It is. I don't know where everybody went.",
            "start": 2453.36
        },
        {
            "text": "Club and they all have different names based on chess pieces. Black Queen, Black and White King, etc. Oh, that's cool. Yeah, Fire Club's a cool name. It is. I don't know where everybody went. Jesus Christ. Couldn't tell who's an enemy. Stop them. Play time's over. Can't tell who's a friend. Friend or foe. Hi. around. I have a feeling this is going to be our first win. We have a great squad. Oh [ __ ] ass. Oh, damn. Oh, magic just behind us causing a ruckus. She's got to be so close to dying. Always glad to help, partner. Together to victory. You're Oh, great. Oh, venom in the back. Venom back line on cam. Peel peel peel peel. [Music] Yeah, we got her. My minions. Whenever she says that, I think of that one game like myth myth force. Myth Force. We liked that game. Oh, she's got to be so low, partner. Yeah, she is. Target neutralized. Oh, he shined, Spidey. Much better. We're going to be armed and dangerous. Andy, that's Venom. He's so close to being dead. And stay down again. Like I",
            "start": 2509.92
        },
        {
            "text": "low, partner. Yeah, she is. Target neutralized. Oh, he shined, Spidey. Much better. We're going to be armed and dangerous. Andy, that's Venom. He's so close to being dead. And stay down again. Like I said that and I laughed real hard and said again. [Music] Oh, come back here. Okay, there we go. There we go. Proud of us. Proud of us. We're doing great. Yep. Lock it in. We make a good team. Great heals, everybody. Oh, he's so close. He's close. Dude, magic is just pissing me off, man. We are undefeatable. All right, they just they're just like group ulting. Everybody's got an You're welcome. I made fun of it. Guru Lamb says, \"Lowkey, Kevin's top 10 funniest kind of funny staff members.\" Thanks, man. That's real nice. They hit the checkpoint. We're right here. Just so you know, top 10 out of an 11 company. Oh, sounds like this guy's pretty funny, you know. Torment 619. Uh, Mike, have you been thinking that about It's Tyler's mother's birthday tomorrow. I know. I've been thinking about",
            "start": 2612.72
        },
        {
            "text": "of an 11 company. Oh, sounds like this guy's pretty funny, you know. Torment 619. Uh, Mike, have you been thinking that about It's Tyler's mother's birthday tomorrow. I know. I've been thinking about Tyler from Cincy. Every time I think about your mama. Really? Yeah. Tyler from Cincy. Uh, we had a a moment where we had to unlock a safe and we just were we didn't know the numbers and everybody we were starting to figure it out. We were I was like, \"Look at all the pictures.\" People started throwing out random numbers. And Tyler from Cincy gave us the correct number. And afterwards, I was like, \"Tyler, where'd you get that number from? I I want to like understand all these puzzles.\" Yeah. And he's like, \"It's just my mom's birthday, man. Mom's birthday.\" You know what? That birthday's coming up tomorrow. Nice. 4:15 tax day. Pay your taxes and tell Tyler mom happy birthday. You look tired. What do you think? I told Tyler to make sure he takes her out somewhere nice. You know what I mean?",
            "start": 2712.96
        },
        {
            "text": "up tomorrow. Nice. 4:15 tax day. Pay your taxes and tell Tyler mom happy birthday. You look tired. What do you think? I told Tyler to make sure he takes her out somewhere nice. You know what I mean? I wonder what they'll do. What's a good mom's birthday? How do you celebrate a good mom's birthday? I once took my mom to a restaurant called Kokari. It's really phenomenal Greek food. And uh I went with my mom's friend whose nephew worked there and the owner drunkenly came out of the like a hatch on the floor. Yeah, of course. And got very excited and then caught the whole meal and also was like, \"Bring out all the appetizers.\" You hear that? If you could do that, it's pretty cool. Bring out the appetizers, he said. Oh [ __ ] Out of a small hole in the wall. Over. Oh, nice. Cool. Good kills. Good kill, squad. Uh, yeah, it's straight. It was, I think, probably the coolest birthday dinner experience we could have. It was alarming like he went over here Spidey. You guys are in game mode. But",
            "start": 2757.76
        },
        {
            "text": "kill, squad. Uh, yeah, it's straight. It was, I think, probably the coolest birthday dinner experience we could have. It was alarming like he went over here Spidey. You guys are in game mode. But all I want to do is tell you more about the story about this man and his restaurant. Free apps, man. Their magic is just insane. Insane. Mike, who are you playing right now? I'm playing as Captain America. Oh, you liking that? Uh, yeah. That was fun to run around in circles. He was kind of cool. He uh I like him on the tank side. Oh, wow. Look at this. Dude, this magic was insane. King's back. Damn, what a crazy intro. 32 to three. 32 and three. Holy [ __ ] Yeah, they were unkillable being the goat was a crazy character. You're 18 and six. You turned on though. Whose feet is the I did fine. Yeah, there's a big pink square around the game and then a pink square on Andy. Andy, you see that? Cuz Andy's showing off what now? If you switch Maybe cuz it was on me the whole time. But if you switch,",
            "start": 2815.76
        },
        {
            "text": "there's a big pink square around the game and then a pink square on Andy. Andy, you see that? Cuz Andy's showing off what now? If you switch Maybe cuz it was on me the whole time. But if you switch, that's cuz I had to go set up some stuff. What are we showing off on your screen? We're showing off. I mean, well, we both have DLSS sponsored by DLSS. Thank you, Nvidia. Everybody gets a thumbs up. Thank you to the Kind of funny best friends for their support. We're going to take a quick moment to hear a word from our sponsors and then we'll be right back with more. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins. as an expedition has already",
            "start": 2892.48
        },
        {
            "text": "play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins. as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. the acrobatic glaive, the defensive but devastating mace and shield and the powerfully ranged cannon. With a deep ability system, and extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with",
            "start": 2932.0
        },
        {
            "text": "expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode is brought to you by Factor. Make this your best season yet with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. Greg Miller has been loving how simple it is to enjoy his Factor meals as he's rushing between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully prepared, perfect for any active, busy lifestyle.",
            "start": 2983.2
        },
        {
            "text": "simple it is to enjoy his Factor meals as he's rushing between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully prepared, perfect for any active, busy lifestyle. Factor powers your day with satisfying breakfasts, on-the-go lunches, premium dinners, and guilt-free snacks and desserts. factor can help you feel your best all day long with wholesome smoothies, breakfast, grab-and-go snacks, and more add-ons. Multiple people here at Kind of Funny have been loving their experience with Factor. And guess what? You can, too. Get started at factormeals.com/kindfunny50 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's code kind offunny5050 off at factormeals.com/kindfunny5050 off for 50% off plus free shipping. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the",
            "start": 3031.92
        },
        {
            "text": "episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady is giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again,",
            "start": 3079.36
        },
        {
            "text": "for you, Shady is giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com. Use code funny to get 35% off polarized sunglasses. Yo, welcome back kind of funny best friends for your afternoon stream. It's Mike and Andy playing Marvel Rival season 2. Andy, you've played now an hour. How are you feeling? I'm feeling finally back in the flow. Okay, I'm going to need you to just hit start. Okay, we're starting the match. Well, hey, don't worry. I'm going to start the match. I'm feeling back in the flow. I do feel like you're trying to hold me back. I mean, I if there's anyone on this team that's holding you back, it is me cuz I'm not playing well. I'm not playing well at all. How is that affecting your morale? Yeah. How is that affecting you, though? Well, I'll be honest with you. I don't think I think it's a combination of you and I. I'm not just",
            "start": 3124.08
        },
        {
            "text": "not playing well at all. How is that affecting your morale? Yeah. How is that affecting you, though? Well, I'll be honest with you. I don't think I think it's a combination of you and I. I'm not just going to Oh, okay. Okay. Well, I mean, you went 18 and six. I blocked I blocked 16,000 damage. Yeah, I was nine and eight. We were playing uh Magic who's on crack, you know. I mean, I'll blame the other people. Oh, our squad. I'll blame our compet. Oh, wow. Oh, wow. They should be good enough to carry both you and rough. Yeah, that's And I'm the weight of three people, so they should really be able to do that. That's a really tough thing to hear, Jack. Fail me if you do not oppose me. [Music] 30 seconds. Oh, let's see. Since we got Mike, I'll go uh or since Mike's rocket, I'll go uh only throw up your little uh Remember, you got your thing to res people. You want to throw that behind a wall whenever we're close in battle so we can immediately get back into it. And then yeah, the unlimited",
            "start": 3171.44
        },
        {
            "text": "up your little uh Remember, you got your thing to res people. You want to throw that behind a wall whenever we're close in battle so we can immediately get back into it. And then yeah, the unlimited ammo thing. Crucial. The battle starts in 5 4 3 2 Chris earlier said I'm I bring up Greek food a lot. I don't think that's true. I think I was going to ask him that too. I think you bring up Greek food a lot. No, you like Greek food. I mean, first of all, I love Greek food. I Dude, I think you and Nick like I think if we were to ask you what's your favorite foods, I think Greek food's going up top three. Oh, no. I mean, I thought you were going to say it. First off, I love it. It I can't stop talking about it. Oh, Jeff is almost dead. Like I can't help that the restaurant was Greek. I'm just going to focus Jeff's in the backline. Heroes are really good. Jeff is so close to dying. So is uh Hulk. Oh, I love that. Mike. All right, we got Baby Hulk. We got baby Hulk. Baby Hulk. Yeah. Whenever",
            "start": 3221.84
        },
        {
            "text": "to focus Jeff's in the backline. Heroes are really good. Jeff is so close to dying. So is uh Hulk. Oh, I love that. Mike. All right, we got Baby Hulk. We got baby Hulk. Baby Hulk. Yeah. Whenever Hulk turns the banner, you just cuz in in Overwatch it the character is called Div.A. And it's a similar thing when D.A gets knocked out of the mech. It's baby diva. And so it's a similar thing when Hulk gets knocked out of his proverbial mech. He becomes baby Hulk, which is just banner. Oh, Neymar's so close to dying, man. Oh, see you papa. You're not going to get to that health. You too, baby. Don't let him shut him down, Mike. Just keeping everyone alive. Oh, you whiffed. You idiot. You fool. The mighty Magneto, savior of mutant kind strikes again. Huzzah. This is a nice Please. We're Ty. Thanks for Prime Gaming. Thank you, Ty. And thank you, Soncho West. There's the guy. There's Soncho West. You've captured more than half of the mission area. Keep going. Mike, I am thinking a lot about",
            "start": 3271.76
        },
        {
            "text": "for Prime Gaming. Thank you, Ty. And thank you, Soncho West. There's the guy. There's Soncho West. You've captured more than half of the mission area. Keep going. Mike, I am thinking a lot about food though. I love that. I like generally these days. Oh, you think about Greek food often. I mean, like I I'm not, but like now we're bringing it up so much that I'm kind of thinking Give me the Give me the Greek food meal. Give me from appetizer to main course to dessert. What does the flow go? I mean, I'm I'm I just I want to get a hero usually, but which is just like a sandwich. So, it's it's not like a multi-course meal, but like Yeah. See, cuz like American Greek places are it's all like like you get in the bowl. So, you're you're not going like Greek restaurant. You're going for more like I want the year. I do miss our Greek restaurant or Rexi in the west portal closed unfortunately. Oh, I'm so stupid. I'm so stupid. Why did I right there? Got every single one of us. That's too bad. I",
            "start": 3340.88
        },
        {
            "text": "I want the year. I do miss our Greek restaurant or Rexi in the west portal closed unfortunately. Oh, I'm so stupid. I'm so stupid. Why did I right there? Got every single one of us. That's too bad. I think it might have become Elena's though. So like a loss for a good reason. But you you got to start with the I can't say the name. You know those triangles, the deep fried triangles, the Greek appetizer. Okay. The uh the pas cornucopia. No. Oh, okay. Something like that. It's a big word. Remember that. And is that something you would like? I when I when I stuttered on the S, I was just like, god damn it. This is going to be a disaster for me. That's what makes me That's what makes me laugh every time, man. Really good ones that we head into the weekend with thanks to Evan. That one where we made fun of Nick was so funny. Oh, where you just you burned him? Yeah, that one. That one was real. Oh, big rez right there. Mike. Mike, you got your uh infinite ammo thing? Uh yeah. Whenever you're",
            "start": 3394.24
        },
        {
            "text": "made fun of Nick was so funny. Oh, where you just you burned him? Yeah, that one. That one was real. Oh, big rez right there. Mike. Mike, you got your uh infinite ammo thing? Uh yeah. Whenever you're ready to state, toss it up here. Toss it up here. There you go, buddy. Thank you. I need heals, though. Oh, man. Oh, [ __ ] Oh, there was just a turret right there. Oh, on the wall. Now I'm getting mad. But yeah, probably spinopa is my favorite appetizer. It's like a little pine, no triangle that's been like fried and it's got spinach and cheese in it. Okay. Dip it in some yogurt. Pretty good. Pretty good. Let's chat. You heard it here first. That's funny. I did get Greek foods last season. Goodbye for now. Invited guest. Don't mind me. I'll meet my family, but not today. Does this mean anything to you? I hate it. Does this mean anything to you? Chris, you brought up the whole Greek food thing. Don't like Don't get mad at me. Need some ranged fire. Why did I do this? I didn't mean to do",
            "start": 3445.68
        },
        {
            "text": "to you? I hate it. Does this mean anything to you? Chris, you brought up the whole Greek food thing. Don't like Don't get mad at me. Need some ranged fire. Why did I do this? I didn't mean to do this. All right, let's get on the point, Mike. Let's get on the point. Throw your infinite ammo thing if you got it back. [Applause] Damn, these Neymar turrets are just nasty. That's unfortunate. That's What happened? What the [ __ ] happened? Unfortunate. Kevin, shut up with your goddamn trying to I'm sorry. I'll stop talking. Kevin distracted you with that. And no, I wasn't trying to. Right is right and wrong is wrong. Yeah, these Neymar turrets went crazy. I just don't really know where they're at. I don't have like the seconds before you attack. Get ready. I don't got the knowledge. to know. Oh, Neyar T. And I rarely play against Ney, too. You're thinking, nobody plays Neymore. Oh, okay. Am I that obvious? You hate me because your version of me almost decimated the mutant population. And",
            "start": 3513.6
        },
        {
            "text": "Oh, Neyar T. And I rarely play against Ney, too. You're thinking, nobody plays Neymore. Oh, okay. Am I that obvious? You hate me because your version of me almost decimated the mutant population. And there are more to my Yeah, Neyon. Good against dive. Yeah, that's a good point. Three, two, one. All you need to do is capture the mission area. Got it. Got it. That music brings the world together, but right now I think we need superheroes for that. Who's Who's Mask Meiser? Is that their Neymar? Who's Nobody knows. Nobody knows. Enemy ahead. Prepare to engage. Top playing in rank. Damn, that's crazy. A little help, please. Big mistake by this dummy. Looks like the mission area is yours to capture now. I keep hearing missionary whenever this person says. Yeah, I always think the same thing and it's it's not what they're saying. Who's below me? I hear some little son of a gun. Oh, there's a turret. Oh no, we got sucked in. They did the jet the shark, Mike. They're trying to be Mike out",
            "start": 3580.24
        },
        {
            "text": "and it's it's not what they're saying. Who's below me? I hear some little son of a gun. Oh, there's a turret. Oh no, we got sucked in. They did the jet the shark, Mike. They're trying to be Mike out here. They're really good. They're really good, unfortunately. Captured the mission area. Get to the missionary back. It's been a while. If I could if I could parry [ __ ] a Jeff the Jeff the Shark alult, I would. I feel like I Everybody's jumping over it lately is what it felt like last time I played him. Judge, jury, executioner. What the [ __ ] Wall was just put in front of me. God, [Music] Mike, did you get your taxes done? Tax is done, bro. Tax day. It's exciting. What's What's your lady's name? Oh, Big Re. Don. Don. Don. Attacks lady love dawn from H&R Block. That's who I've gone to. Oh, I just got exiled. Technically, cloak and dagger can parry most with their banish. Oh, that's kind of true. Yeah. Yeah, that's true. I'm really bad. I'm really bad. Oh, you're so lucky you popped",
            "start": 3645.68
        },
        {
            "text": "Oh, I just got exiled. Technically, cloak and dagger can parry most with their banish. Oh, that's kind of true. Yeah. Yeah, that's true. I'm really bad. I'm really bad. Oh, you're so lucky you popped that [ __ ] They've almost got it. Here's how you shoot. Watch your back. I got your back. Can you [ __ ] grapple somewhere? What the [ __ ] Great heals, Mike. Great heals. I'm not healing anymore. Oh, I don't know who's healing me. Send nuggies, I think. Trying to grab to the other end to get a different angle. All right, big comeback right here. Come back season. I was just trying to set up some turrets so I can get the hell out of dodge. All right, I have also ready again. Let me guess your name, our friend. Judge, jury, executioner. Oh no, he swallowed me. Where's this [ __ ] ass going? Now I'm dead. are toast. Now my pressure captured more than half of the mission area. Keep going. Come on. Come on. He's so low. He's low. Ney more turret. All right, it's gone. Come back. Seasoned",
            "start": 3726.96
        },
        {
            "text": "Now I'm dead. are toast. Now my pressure captured more than half of the mission area. Keep going. Come on. Come on. He's so low. He's low. Ney more turret. All right, it's gone. Come back. Seasoned guest. I hear the son of a [ __ ] Where is he? He's up here. Call back. Wasn't bad enough. Hulk is going uh Hulk is in backline. [Music] What is happening to me? No, dude. Her ults paired with Black Widow or Scarlet Witch. Pretty sick. That's really good. Oh, cuz she's pulling you. She sucks you in. Yeah, you can't get away. That's That's a crazy play. That's a crazy play. Not our best. Not our best. Yeah, not our best. Not our best. We're 0 and six now. Haven't won a [ __ ] match all goddamn day. Getting it rolling. Getting it warmed up. You know what I mean? Getting it warmed up. You can't take heels from Mike. All right, we just got to get warmed up a little bit. Why can't you take heels from Mike? Oh, wow. This guy's the MVP. You stole my gameplay. What could have been? 15 and four.",
            "start": 3828.96
        },
        {
            "text": "take heels from Mike. All right, we just got to get warmed up a little bit. Why can't you take heels from Mike? Oh, wow. This guy's the MVP. You stole my gameplay. What could have been? 15 and four. That could have been me. What could have been? Did you switch to Black Widow? Oh my god. I was sniping. Yeah. Were you? I don't know. You should have my energy, bro. Don't forget if you want to play with us next game I'll be kicking the squad and grabbing a new squad. So if you want to play with us, make sure to queue up. Get ready. Uh, of course, come join us and have some fun. This is an awesome sponsored stream with our friends over at Nvidia to showcase DLSS4 and Nvidia Reflex now with Marvel Rival season 2. Get the very best. Make sure to update your driver and of course turn on all the settings just like Andy showed you at the beginning of today's stream. And you can learn more by typing in exclamation point rivals anytime throughout today's stream. And uh most importantly, thank you",
            "start": 3921.6
        },
        {
            "text": "just like Andy showed you at the beginning of today's stream. And you can learn more by typing in exclamation point rivals anytime throughout today's stream. And uh most importantly, thank you to Nvidia. Always teaming up with me and Andy and the crew here at Kind of Funny for some fun streams. Okay, since since Cam took Emma Frost, I'm not going to play a tank. Okay. Oh, okay. So, somebody else, please switch off cuz she was my only hope to be good at anybody. Okay. No one escapes hell. My domain will wonder pick who you like to be. Me and Andy will pick whoever. That's how we do. Oh, no. It It's all good, Cam. I just like I She's the only tank that I feel like I would do okay with. And even then, I don't feel super confident there. The water and the earth. Did you see we did that figure out the cans thing? No one escapes hell. What? No. I need a sentence better than that. Yeah, but I figured that out the can. You know that. You know that when he said it, I was like, does he need a",
            "start": 3968.24
        },
        {
            "text": "out the cans thing? No one escapes hell. What? No. I need a sentence better than that. Yeah, but I figured that out the can. You know that. You know that when he said it, I was like, does he need a headphone? What is he talking about here? He's talking about We did the Tik Tok trend where you put a bunch of soda cans inside of a box so you can't see and then the soda cans on the top and you're supposed to guess the order of how Kevin put the Oh, I've seen that. Okay, gotcha. I have seen that. Yeah, we uh we forced the whole studio to do it on Friday. They weren't happy with us. Oh, really? Barrett was Barrett was he was like pulling teeth from Barrett. Oh, sure. Once they Hey, hold on. Once they got in here, it was fun. They got in here. It was fun, right? Yeah. I I I think they I think at the end of it, they had fun. They smiled, but they were like, \"Can we just go back to our desk?\" And we were like, \"No.\" Yeah. We need you here. Very important stuff. All right, cool. We got some",
            "start": 4017.68
        },
        {
            "text": "at the end of it, they had fun. They smiled, but they were like, \"Can we just go back to our desk?\" And we were like, \"No.\" Yeah. We need you here. Very important stuff. All right, cool. We got some bodies down. It definitely turned out to be a pretty good Tik Tok though. Did we make it into a Tik Tok? Evan Yan made it to a Tik Tok. Oh, really? Shout out to Evans. We just constantly given content to make. I love that. Thank you, Evan. I thought we took out like three of them. Do they have Oh, they're running four DPS and one heal. Is more immortal than I? It's a new meta. Figured out the cans. You know about the cans. You heard about the cans. Look guys, we got there eventually, right? I'm almost as good at like you dudes. Figured out the can. It's just my favorite thing that happens with Kevin so often. He's getting you to the point. You know what I mean? You just got to you got to get there with him. Andy, that bird sometimes that's How about the new park, Kevin, over on the beach?",
            "start": 4065.28
        },
        {
            "text": "Kevin so often. He's getting you to the point. You know what I mean? You just got to you got to get there with him. Andy, that bird sometimes that's How about the new park, Kevin, over on the beach? I haven't gone to check it out yet. It looks really good. Yeah, the dunes. You know what? Uh, the great highway has been closed now forever and is now an official little park for us. They're going to they they plan on expanding it, right? This is just the start of it. Yeah, I think so. But it it looks great. They closed all down. They had a big street party this weekend to celebrate it. Cool. Greg was there. Big deal. All right, we just got to kill Rocket. That's their only heal. If we kill Rocket Fire. This is real fire power. Jesus Christ. Did you do it? Enjoy the air. Uh, no. I was getting alled. Oh, or I was getting Oh, yeah. I was getting aled. Immortality has its privilege. That's the only healer. We kill the rocket, we win. There's Captain Andy to tell you what to do. Behold the",
            "start": 4121.12
        },
        {
            "text": "alled. Oh, or I was getting Oh, yeah. I was getting aled. Immortality has its privilege. That's the only healer. We kill the rocket, we win. There's Captain Andy to tell you what to do. Behold the child. [Music] Jesus. Funk me. Give me a chance. I got the funk. I got the funk. I shall claim my victory eventually. Damn. Co-op time. Not going well. I like when I look down and Chris says they're Jack's cab. So, right. Okay. We win here. We win here. There he is. There he is. We win here. We win the point. You know what I mean? Turn the point on. He's one. Somebody kill the Somebody finish the job. Please, God. There it is. I want a soul. Look at that. We captured it. I love it. Love the heals. [Music] Okay, I am barely home. Never miss. Please kill the magic. Please God, please God, kill the [ __ ] magic. So many. No goddess is ever truly gone. Fight. Yeah, the Hawkeye is just living free out there. Oh, whoa. Thank you to the anonymous giftter who just gifted out a tier one sub. Thank",
            "start": 4178.72
        },
        {
            "text": "[ __ ] magic. So many. No goddess is ever truly gone. Fight. Yeah, the Hawkeye is just living free out there. Oh, whoa. Thank you to the anonymous giftter who just gifted out a tier one sub. Thank you, Anonymous. I am returned to He gave July Davis a sub. Nice. Oh, okay. I'm dead. Holy [ __ ] A lot of gamers out there. A lot of gamers at 2:49 p.m. in the afternoon. Is it summertime hours? What's going on here? I thought everybody was at school right now. Still in school. What are we doing here? without. Okay. Okay. You know, you know, you know, you know, you don't know what you don't know. You know this lady, this magic lady, this magic lady. Pretty good. You know, just dropping it like it's hot, dude. Oh my god. Oh my god. Have fun. Oh, Easter break, Mike. That's why everybody's celebrating Jesus. I love that. Why does it have to impact us though? You think about that? The adults. Mhm. Will you buy Will you buy your loved ones an Easter basket? It's a whole thing. You don't want to",
            "start": 4294.56
        },
        {
            "text": "Jesus. I love that. Why does it have to impact us though? You think about that? The adults. Mhm. Will you buy Will you buy your loved ones an Easter basket? It's a whole thing. You don't want to start this conversation with me. Oh, okay. It's a huge a giant stresser every year. Oh, no. He has he has a child now. No. Not getting him a basket for sure. Oh, no. What am I going to give this little kid Easter basket? Doesn't understand the concept of waking up. It's a photo op. Yeah, I'll put him next to Paul's Easter basket. You remember this? Every year we have like a conversation about this where I stress out. I You didn't know that? I didn't know that. One year Chad helped me find a book. You better win this game if you're not listening right now. Oh man. I mean, I'm killing the healers. I'm getting my butt whooped. I always return. I'm not going to I'm not going to put this on me because I'm just going to blame their magic who's just, you know, unstoppable. Anyone willing to help?",
            "start": 4391.68
        },
        {
            "text": "I'm getting my butt whooped. I always return. I'm not going to I'm not going to put this on me because I'm just going to blame their magic who's just, you know, unstoppable. Anyone willing to help? There we go. Look. Oh, she's still alive. What would you put together in a basket, Mike? Depends on who I'm getting it for. Would you like for me to set one up for you? Make a pre pretend like I'm making it for you. I would love that. All right. Here's what I'd do. I uh Shut up, Andy. Mike's trying to talk. I would get a blue basket for you. Oh, yeah. I would put a set of bunny ears because everybody should have bunny ears. Wow. I would have seven eggs inside of it, all with uh chocolate inside, lined with chocolate. And then after that, I would get you six bags of beef jerky, an assorted flavor. Well, I would get you a stuff. What brand of beef jerky? Assorted. I would go down the list. Oh, just different brands. Yeah, different brands. I would go to Safeway and just start grabbing jerky.",
            "start": 4449.28
        },
        {
            "text": "Well, I would get you a stuff. What brand of beef jerky? Assorted. I would go down the list. Oh, just different brands. Yeah, different brands. I would go to Safeway and just start grabbing jerky. I think you deserve some jerky in your life. Thank you. I would I would very much enjoy that. I would then probably pick you out like a Razor Ki or one of the Backbone phone uh controllers even though I think you have a bunch of them. But I think that's like just so Kevin when you think about it. A nice little stocking stuffer. Yeah. Yeah. It's a stocking stuffer. You know what I mean? And then we'd probably have to get like a bunny because you have a child now. So like you also have to give gifts to Kevin that involve his child. Yeah. You know what I mean? Like that's how dads that's how dads operate now. Oh yeah. It's like everything you get is also your child. Yeah. Oh, that probably be it. I wouldn't let him, you know, I'd push him away like Chris says, \"Turn off the West Coast servers.",
            "start": 4512.0
        },
        {
            "text": "now. Oh yeah. It's like everything you get is also your child. Yeah. Oh, that probably be it. I wouldn't let him, you know, I'd push him away like Chris says, \"Turn off the West Coast servers. You won't I mean, weren't we just tied up with Virginia? Turn off the West Coast.\" That's what he's saying. Do they know? Oh, turn off all but West Coast servers. Oh. Oh, I don't know how to do that. Nah, that's not why we're losing. We're just playing against other sixack. You're doing it, though. No. Don't make me Don't make Just do the low latency ones. Yeah. Yeah. I'll do it. I'll do it for him. I'll do it for her. Say the word, Chris. Think I can watch what happens. Oh, but then all our friends that are on the East Coast won't be able to play. Mike and the friend request just No, I'm just kidding. I have so many friends that I can't uh accept. Yeah, that's why we That's every time we tell you don't do it cuz that's what's going to happen. You need to like mask like a accept all, you know.",
            "start": 4551.44
        },
        {
            "text": "I have so many friends that I can't uh accept. Yeah, that's why we That's every time we tell you don't do it cuz that's what's going to happen. You need to like mask like a accept all, you know. No, I can't accept them anymore because I'm already full. Oh, my friends. So now now I have friends in the queue, but I can accept you. I can uh I can invite you from the queue. Oh, like that's Reverend Cam Abbott. He can't get in. So I just I I send him from the queue. Send him from the queue. All right. Got a new group. Still looking for our first win. Everybody, who will be the team to get us a win? Who will it be? Are we still blaming the best friends for Oh yeah, we're definitely blaming them. Guys, what's wrong with you guys? Come on, bring it, dude. Bring it. You're supposed to carry us. Bring it. Bring it. I'm not anyone. Bring it. What I do [Music] is too much echo. Sorry. That sounds good right here. Mike, are we alt together? If you go with Cap. I don't know what Cap does, but on",
            "start": 4596.64
        },
        {
            "text": "Bring it. Bring it. I'm not anyone. Bring it. What I do [Music] is too much echo. Sorry. That sounds good right here. Mike, are we alt together? If you go with Cap. I don't know what Cap does, but on Cap. I don't know what his alt does. He just runs around in a circle. No, it's like our team up though. Our team up move. Yeah. I don't know any of the buttons for Cap. I'm just pretending to play him. Oh, great. So, we're not showing you. Oh, team of activate. Maybe let's get you on another healer then cuz we have uh only one healer right now. Yeah, but we only have one we only have one uh tank. Oh, cuz we have three DPS. Yeah, that's how it goes. I would rather have two healers than D. I chose a tank because like we need a body. You know what I mean? You got I'd rather have two healers though. They need a body though. Who doesn't need a body though? Look at this shield. Look at the shield on. Oh, let me switch to yours. Look at this. I'll protect you. Oh, your gameplay's not going. Oh,",
            "start": 4642.32
        },
        {
            "text": "They need a body though. Who doesn't need a body though? Look at this shield. Look at the shield on. Oh, let me switch to yours. Look at this. I'll protect you. Oh, your gameplay's not going. Oh, yeah. It's not. Oh, that's weird. Yeah, that is weird. That turned off and on. Okay. Oh, stick on Andes for right now. Look at this. Clash with me and initiate clash. Ready? See? Yeah. Do it right now. We do something. Oh. Oh, I jump off of your body. Oh, that's cool. Okay. Oh, no. Oh, see. See, see. Initiate. Yeah. He's like, he does something. Oh, they're wrapping around. They're wrapping around. It was the perfect moment to hit Windows and start shooting. Yeah. But it's fine. Now we're in the sauce. We're deep in the sauce. And of course, we're also showcasing Nvidia DLSS4. There it is. Frames win games. Frames win games. Thor. Thor. Thor. Thor. Thor. Everybody focus. Thor. Everybody focus. Thor. Thor. Almost dead. Thor. Almost dead. Thor dead. Oh, I got one of their healers. Oh, Matt is",
            "start": 4700.4
        },
        {
            "text": "win games. Frames win games. Thor. Thor. Thor. Thor. Thor. Everybody focus. Thor. Everybody focus. Thor. Thor. Almost dead. Thor. Almost dead. Thor dead. Oh, I got one of their healers. Oh, Matt is behind. Matt is behind healer. I said nailed him cuz he's got a hammer. Nice. Cap is solo, too. Come over here, Mr. Cap. Got him. I disappear. Oh, did you get him over there, Mike? No, he's still running. You're still chasing him. Oh, you murdered him. He didn't know the buttons either. It's like, yeah, he didn't know what he was doing either, like me. That's right. He was scared. He like, \"Please, this is my brother's account.\" He's be so mad if I dank him. armed and victory. Of course, you had to ult while I'm doing that. That's [ __ ] Perfect. Doing this my way. Oh, I almost got racket rocket there. Who is What is happening? Mike is deep in there. I'm deep in the sauce. Are you supposed to be in there? I'm learning to buy heads. That seems like that's their space. Yeah, you don't want to",
            "start": 4749.0
        },
        {
            "text": "there. Who is What is happening? Mike is deep in there. I'm deep in the sauce. Are you supposed to be in there? I'm learning to buy heads. That seems like that's their space. Yeah, you don't want to be Who are we fighting? Husky Esports. What? What about it? What is this team name? They're all Husky esports. Oh, that's cool, man. You know what? I bet it's a college esports team. Maybe Northern Illinois. Northern Illinois Huskys. Could be the Yukon Huskies as well. Could be the UDub Huskies as well. There's Well, they should drop out. What do you mean they should drop out? They got a game on their hands right now. They're just playing on their school computers. That's crazy. This could also be a high school team. A lot of high school esports nowadays. We're going to pretend like it's a college esports team. Mhm. We're playing. We don't want to lose a lose to a bunch of high schoolers right now. Yeah, but like they're cohesive. You know what I mean? Yeah, they're really they're all",
            "start": 4835.52
        },
        {
            "text": "college esports team. Mhm. We're playing. We don't want to lose a lose to a bunch of high schoolers right now. Yeah, but like they're cohesive. You know what I mean? Yeah, they're really they're all together. They're definitely communicating. They're definitely dominating. Give me some other Husky teams, chat. Yeah, that's Illinois. Yukon's all I know. Uh Washington, of course. Washington. What are some other Husky teams here? There's got to be more than three. Of course. There's way more than three. Okay, I'm going to go Heels. Somebody just said, \"Oh, they're beating you on dorm internet.\" And I thought to myself, man, I remember when like dorm was good, you know, like you'd get there and be like, \"Oh, there's a T1 line.\" I tried to stay positive. I don't know if I ever had good Well, I guess I was never in a dorm, but Yeah. But you go visit Yeah. dorm friends, right? Yeah. Yeah. Please stop them. Imagine being in dorm with me, Andy. All the snoring. No. What a [ __ ] nightmare.",
            "start": 4886.4
        },
        {
            "text": "I guess I was never in a dorm, but Yeah. But you go visit Yeah. dorm friends, right? Yeah. Yeah. Please stop them. Imagine being in dorm with me, Andy. All the snoring. No. What a [ __ ] nightmare. It'd be a nightmare, huh? That would have been awful. Do you think the kid would have like left and I would have got a free dorm room by myself? Yeah. Like they would have been like, \"Yo, this kid snores so loud.\" Like there's no Oh, yeah. Cuz like he would go to the and they would be like, \"It's too bad. That's not a real reason.\" And they he'd be like, \"No, it's a real reason.\" And then they'd have to give him my own dorm room, right? That would be kind of cool. Behold the god of thunder. Yeah, Nemesis. But this is this is before like like Wi-Fi on your phones was like never good, you know, at this point. He's saying, \"Oh, my school was bad.\" Oh, yes. See, Robert Mim says, \"Kevin, I work in IT for housing at University of Oregon. Dorm Wi-Fi [ __ ] rules. They have better internet than",
            "start": 4941.52
        },
        {
            "text": "at this point. He's saying, \"Oh, my school was bad.\" Oh, yes. See, Robert Mim says, \"Kevin, I work in IT for housing at University of Oregon. Dorm Wi-Fi [ __ ] rules. They have better internet than they do at home.\" There you go. I suppose that helps. Where you going, Cap? Oh [ __ ] the whole team. Oh my god. Andy, who is this you're playing as? Uh, Emma or no, uh, Luna Snow. She was made She's a Marvel character that was made in a video game. She was in a comic first and then uh they kind of adapted her. Oh wow. She's a She's a a K-pop star. Oh wow. What video game was she made for? Uh I it was some mobile game I believe. Oh really? Something that definitely wasn't super popular here. I was a roommate that sort of has wasted bandwidth. Did they move? No, they stay there and they just hated him. aided you tried to kill me. I was trying to I was trying to heal you stage geek might be a good time to stop them. All the mic nudity too sleeping in his car. Naked naked. I'd look right. I'd",
            "start": 4990.56
        },
        {
            "text": "him. aided you tried to kill me. I was trying to I was trying to heal you stage geek might be a good time to stop them. All the mic nudity too sleeping in his car. Naked naked. I'd look right. I'd look right at him and be like, I sleep naked. What a psycho. You don't sleep naked is so freeing, bro. You got to sleep. No. Yeah, Andy. It's great. Like Yeah, you got to sleep. I'm too I'm too oily at night. What does that mean? Yeah, that doesn't mean anything, bro. Yeah. Yeah. Get more what? More sheets. Oh, I mean it's just annoying to like always have to wash them as often as I need to. I Well, Mike washes his sheets every day. I used to wash them every day. Now I wash them once a week. I'm doing a great job at saving water. I'm protecting our planet. Do people get mad at you? No, I just decided to get better. You know what I mean? It was more when I moved into your house. I didn't want to do it every single day. You paid for the water, so it's whatever you want. Have done it. Yeah, I",
            "start": 5061.76
        },
        {
            "text": "to get better. You know what I mean? It was more when I moved into your house. I didn't want to do it every single day. You paid for the water, so it's whatever you want. Have done it. Yeah, I would have. Enjoy the fire. You ever think about Marvel Ultimate Alliance and how great that game was? Mhm. Miss that one. Please get Thor. Please get Thor. You seen that Tik Tok spray, Andy? What could that mean? Merkelo Maniac. No. Yeah, I have not seen whatever spray you're talking about. It must be for oily skin. Oh, okay. Protecting the Sage, Sage, I make one one commitment a year. Okay. One commitment. Protecting the the planet, but still buying Smart Water every day. Someone's got to buy them or else they're going to sit on the shelf. Let's just go to the business center. You can buy them in bulk for like $12. I think it's 18. Let's go get a Costco hot dog and make that happen. That sounds like a deal. I'm actually not against that plan. Love that idea. Would you also get a chicken bake?",
            "start": 5106.72
        },
        {
            "text": "bulk for like $12. I think it's 18. Let's go get a Costco hot dog and make that happen. That sounds like a deal. I'm actually not against that plan. Love that idea. Would you also get a chicken bake? Oh, come on. You know I'm getting a chicken bake. You going to do the cookie thing. Cap, leave me alone. Boom. Damn. I'm really just holding down the fort here. I don't know what you guys are doing back there, but I'm really just holding down the fort. Everybody, I'm getting dived by everybody. Just so you know, I'm in the middle here just really holding it down. Seems like it's a lot of mic over here. Somebody please get this cap. It's a lot of mic over here team. I'm coming to give cap. I'm coming to get cap. He keeps on going back to the heel. He just reheals. I'm giving up on the point. I'm giving up on the point for cap. I'm going to go run this. Yeah. Yeah. Just leave it on Andy. We good. Oh, big resi. Jesus. Hold it down. The fist of conscious. Wow. What an unfun match. You can't",
            "start": 5165.92
        },
        {
            "text": "I'm giving up on the point for cap. I'm going to go run this. Yeah. Yeah. Just leave it on Andy. We good. Oh, big resi. Jesus. Hold it down. The fist of conscious. Wow. What an unfun match. You can't expect to win them all. And like, all right, Mike, boot everybody. We're not playing with anybody in the chat. Wow. That's what you want to do? We're just going to play you and I just to see if things are different. YQP, not comp. Who lost? Okay. I think I think they were asking then why are you playing quickplay not comp if you're like a school? Oh, it's like they got to get warmed up. You know what I mean? Yeah, they got to All right. And Andy has told me to kick you off. Boot everybody. Okay. This is on Andy just for one match. Don't put it on me. Don't put that on me, Ricky. Bobby. It's not anything that you have to put on anybody. Don't put Why are you already deflecting? Don't put it on Ricky. Like get mad at Andy. They're going to get mad at you. They're going to get mad. They want",
            "start": 5220.72
        },
        {
            "text": "anything that you have to put on anybody. Don't put Why are you already deflecting? Don't put it on Ricky. Like get mad at Andy. They're going to get mad at you. They're going to get mad. They want to play with you. Well, they cannot play for one match cuz I want to see if it's just like a six stack thing or not. Do you think it's what it is? What do you think? You think that's what it is? It's a sixstack thing. You think that's what it is? It's just we're bad. We haven't played in a long time. Well, we're bad, too. Okay. But that doesn't help it. That certainly doesn't help the situation. Yeah. You know, I'm not anyone's sidekick. Like, I'm not running around here saying I'm good. I'm definitely bad. Oh, sure. I I I'm waiting to I don't think I'm good either people, you know. Well, you went 18 and six one game. What happened to that? I was healer the last game. Oh, you healer. Everybody was like, I guess we'll just go one healer. So, I was like, I guess I'll go healer. You Well, you",
            "start": 5282.08
        },
        {
            "text": "18 and six one game. What happened to that? I was healer the last game. Oh, you healer. Everybody was like, I guess we'll just go one healer. So, I was like, I guess I'll go healer. You Well, you got to tell that to the team. I had to be go I had to be a tank. Yeah, I didn't want to be tank. Right. You could have gone second healing. Well, you could have asked me. I did. I did. I very much did. [Music] Oh, man. Such an allegiance between. We're going to win this one. Watch. Check it out. Nobody wants to be healer nowadays. It's a dying It's a dying profession. It's unfortunate. Three. Oh, I'll go Punisher if you're going to go him. Sunny nose stuck with the T1 sub for 52 months. Welcome in, Sunny Nles. Thank you, Sunny Nles. Remember Mike, if you see Mr. Fantastic go chubby mode, don't shoot him. Okay, I'm watching Black Panther just go absolutely ham and bananas right now. Oh, you [ __ ] Magneto's so weak on the right side. Oh, great. They have a magic and you're solo though. You're",
            "start": 5323.52
        },
        {
            "text": "him. Okay, I'm watching Black Panther just go absolutely ham and bananas right now. Oh, you [ __ ] Magneto's so weak on the right side. Oh, great. They have a magic and you're solo though. You're fine. You're not fine. Having a tough time getting around this corner, but we're going to break through. We break through this corner. We got a got a whole new ball game. Oh, they call it wide mode. Oh. If y'all loses, you'll know it wasn't uh it wasn't us. Chad, I'm not saying you're at fault. I'm not saying we're losing because of you. I'm saying we're losing because of the six stack. And usually when you're six stack and you want to be on mic, but we're sponsored by Nvidia today. We can't be having randos talking in the chat. You know what I mean? Sponsored by Nvidia. Thank you, Nvidia, for sponsoring this stream. Thank you. Check out DLSS4 and Nvidia Reflex right now on season 2 of Marvel Rivals if you're playing it. Update to its drivers. He's chubby mode. He's wide mode. He's wide mode.",
            "start": 5391.36
        },
        {
            "text": "this stream. Thank you. Check out DLSS4 and Nvidia Reflex right now on season 2 of Marvel Rivals if you're playing it. Update to its drivers. He's chubby mode. He's wide mode. He's wide mode. Now, what does wide mode do? Uh he like absorbs damage and then he can like hit you with the big hit. Put it back on you. Yeah. Well, there he is in the middle. He's wide mode again. It's hard to tell when Dude, they just have ult galore. Like, this is insane. This is a bad idea to ult here. Oh, did we get him? Oh, I don't think we got him. Oh no, he's b he's rubber balling on us. I almost got him. He's bouncy balling. is not over. I'll go. Where is this son of a [ __ ] Behold the It's all happening right now, Mike. It's happening. It's all happening. And it's not good. They're just standing at the doorway killing us. We haven't left the spawn. The battlefield may change. Focus magic. Okay, magic dead. Nice. Okay, he's wide mode. He's wide mode. We can help you achieve your directive, Kirby.",
            "start": 5457.28
        },
        {
            "text": "doorway killing us. We haven't left the spawn. The battlefield may change. Focus magic. Okay, magic dead. Nice. Okay, he's wide mode. He's wide mode. We can help you achieve your directive, Kirby. Black Panther's coming from behind you. Always glad to help. All right, he's dead. Just what we need. You're welcome. Get your [ __ ] ass out of here. [ __ ] you. Pleases me to be Come back right here. Come back. Ces, come back, city. Come back, city, y'all. [Music] About time I got a shield. About time I got a shield. Look at that. My team survived. Yeah, we did. Yeah, we did. Look at that. My team survived. Magic's so weak. Magic's so weak. Magic dead. Oh, Magneto's big old armed and dangerous. Oh, why would you do that to me? Oh, I was on Reed. [ __ ] you, Reed. Oh, I died twice. Oh my god, chat. What does Poke Dagger's all do? I've I've definitely played against her enough to know, but I just don't. It obviously drains health quite a bit. So close. Remember when the world was taken over",
            "start": 5528.0
        },
        {
            "text": "What does Poke Dagger's all do? I've I've definitely played against her enough to know, but I just don't. It obviously drains health quite a bit. So close. Remember when the world was taken over by just tutorial Tik Toks of Marvel rivals? Um, play more of a ride. There. There was that one guy. He's like like orange hair and he was like, \"You're you're definitely not playing them right.\" So, here's how to play him or whatever. That guy was good. That was a really good tutorial. You think he went pro? Probably not. Oh, I don't even know if they got pro Marvel rivals, do they? Yeah, they do. Oh, yeah. Yeah, they had a big tournament recently. Real big tournament. Uh, Shroud plays. Haunted Thieves has a team. Shroud plays. Shroud plays. [Music] Almost there. We're so in. Oh, damn it. Fantastic. Oh god, he's aling. Reached a checkpoint. Keep up the system. We're gaming. your directive. Shroud doesn't play. He owns team Shroud X though, like as as a as a Marvel rivals team. That's kind of",
            "start": 5628.08
        },
        {
            "text": "Oh god, he's aling. Reached a checkpoint. Keep up the system. We're gaming. your directive. Shroud doesn't play. He owns team Shroud X though, like as as a as a Marvel rivals team. That's kind of awesome. Check it out. Could have Shroud as an owner. Remember when Shroud went to Valerant? That was like the coolest moment in video games. I was like, MJ, I'm back. Yeah, dude. It was so sick. I mean, he wasn't at like great, but it was still cool. Time to hit him hard. Oh, behind us. Oh [ __ ] [ __ ] you. Armed and dangerous again. Oh, dude. She went to her [ __ ] cloak mode. Oh, that's so that's pretty clutch of her. It's a good magic. There. Keep going. Go back to whatever sea cave you crawled out of. [Music] Ready to do some damage. Sorry, soldier. Eat [ __ ] Eat [ __ ] Magic. Almost there. Don't turn back now. Backing behind us. Behind you. I'll scare the world. Not today. Eat [ __ ] [ __ ] I'll pack you up. She's so close. Nothing personal. vehicle reached a check. Keep up the",
            "start": 5702.64
        },
        {
            "text": "there. Don't turn back now. Backing behind us. Behind you. I'll scare the world. Not today. Eat [ __ ] [ __ ] I'll pack you up. She's so close. Nothing personal. vehicle reached a check. Keep up the momentum. You like that? You like that? Gy leader Phil. I'm talking about. All right. Uh, Black Panther on the right side, I think. Disappear. Whenever I see Scarlet Witch red, I still think it's a bad guy. Tremble before here. Please get this Black Panther. That's [ __ ] hurt. He's so weak in there. I'll patch you up. I'm the greatest. I'm the greatest. You got him. No. Oh, I just heal. He's back here. Mike, I only right click. Yes. Maxim show us her true color. You're welcome. Mentally unhealthy, but very satis. We're playing great. We're playing great. That's it. Don't let anything stand in your way. Hey team mag, armed and dangerous. Oh, I would be so sick if he died right there. The spider nest is nonunctional. The mightiest heroes. Only 60 seconds left. We're so close. [ __ ] you.",
            "start": 5799.04
        },
        {
            "text": "in your way. Hey team mag, armed and dangerous. Oh, I would be so sick if he died right there. The spider nest is nonunctional. The mightiest heroes. Only 60 seconds left. We're so close. [ __ ] you. Yes, we got him. All right, they have a Jeff now. [Music] Yeah, you [ __ ] Come on. Put down me. Who doubted us? Wow. I think we know who to blame. I think we know who to blame now. It's unbelievable. It's crazy. You know, it's crazy. It's wild the way it works, you know? It's like it just adds up, you know. Everybody else was holding us down. They were better than Look how much heels I did. I know. Look at the heels compared to everyone else on the map. They were better than us, but they still held us down. Like, you know, they held us back from greatness. We've always talked about that. You know, we got our one win. Let's invite it back in. You know, let's bring them back. Let's bring them back. Yeah, we got ours. We got ours. We got ours. Mike said Chad sucks at the game. I mean, you",
            "start": 5922.16
        },
        {
            "text": "know, we got our one win. Let's invite it back in. You know, let's bring them back. Let's bring them back. Yeah, we got ours. We got ours. We got ours. Mike said Chad sucks at the game. I mean, you know. I mean, Andy was the one who kicked you all. Just remember that. I didn't kick. Well, just cuz I wanted to see I That wasn't on me. Don't put that on me, Ricky. Bobby. The amount of times that I've streamed this game and it's like, \"Yeah, let's let everybody in and we play against other six stacks.\" Who says that? What do you mean? Who says let's let everybody in? Well, like if we're playing multiplayer, are you thinking I'm saying? Do you say No, I don't. I'm not adding that. No, it's like that's you know that happens sometimes when it's a four stack of us friends and then people in chat want to join. It's like yeah, okay, yeah, sure. Join and then you play other six stacks, you get dominated. They're clumping us. Six stacks are so hard. They're clumping us. It's hard. Well, we got",
            "start": 5998.64
        },
        {
            "text": "want to join. It's like yeah, okay, yeah, sure. Join and then you play other six stacks, you get dominated. They're clumping us. Six stacks are so hard. They're clumping us. It's hard. Well, we got to win. Let's Let's win again. Okay, let's win again. Let's win now, chat. Let's win. Pick your hero or villain. I played real good there, though. Didn't look so good at the front, you know. Yeah, that's all right. That's all right. We're getting dominated at the start. They're saying, \"Mike, we need you in a tank.\" Got it. Done. That's what they're saying. They're saying, \"Mike, we need you.\" Done. We need you in a tank. You got it. I'm not anyone's sidekick. What I do is best done alone. Chad, they buffed uh Black Widow, right? She got pretty buffed. Um, thank you once again to Nvidia for sponsoring this stream, courtesy of Nvidia. Thank you to our friends over there who sponsor us. and uh allow us to show off their tech in a lot of really cool games. Again, we're never sponsored by the",
            "start": 6034.88
        },
        {
            "text": "this stream, courtesy of Nvidia. Thank you to our friends over there who sponsor us. and uh allow us to show off their tech in a lot of really cool games. Again, we're never sponsored by the game. We are sponsored by Nvidia to show off their tech. Uh this is a boy, I don't think I played this map. This is new. Teleport. What the hell? Welcome to the Hellfire again. Oh, we're in Crack Crocoa. Crackatoa. Oh, is that what they're called? This is where all the where all the mutants formed their own kind of uh land, Mike. Oh, okay. They kind of came here to get away from all the racist humans. Okay. And this is kind of like their their paradise. Okay. Okay. This is a new map. Gotcha. Okay. I hear Blade might be on this map. Really? Yeah. Look out for him. Blade. Yeah. Kevin Aex told me that Blade's in some maps. They think he could be another hero one day. Oh, wow. Oh, he's sleeping somewhere. He's sleeping in a room. That's awesome. See, look at that chat. He's sleeping. About time I got",
            "start": 6081.76
        },
        {
            "text": "in some maps. They think he could be another hero one day. Oh, wow. Oh, he's sleeping somewhere. He's sleeping in a room. That's awesome. See, look at that chat. He's sleeping. About time I got a shield. Oh yeah, baby. Nowitoionary is yours. We make a pretty good team. Blade is in Central Park. They got a Central Park in KCOA. All right. I hear them all kind of wandering around us. Oh, this is a capture. I don't know why I thought this is a payload map. I thought we were unlocking the payload. They got a Wolverine over here. Who's the baby dragon? Baby dragon. Yeah, there's a baby dragon chandelier above our heads. [Music] Damn it. You're not who I wanted to pull. Fearome fo the way. Time for you to attack. Oh, man. Johnny Storm, you're so lucky, brother. Johnny. Johnny. Oh [ __ ] disappear. Wow. Got Wolverines in that case. Armed and dangerous again. Disappear. Problem solved. You're up. Whoa. She got real framy there. What the hell? supposed to hurt. So, one thing, Wolverine is",
            "start": 6132.8
        },
        {
            "text": "Wow. Got Wolverines in that case. Armed and dangerous again. Disappear. Problem solved. You're up. Whoa. She got real framy there. What the hell? supposed to hurt. So, one thing, Wolverine is stronger against tanks, Mike, but not DPS. Like, the damage he puts out isn't the same against a a DPS as it is a tank. Oh my god, I'm getting double team over here. Big play Shay on our team, Mike. Big play. That's a cool name. Club Shay Shay. Ready to go. Oh, Wolverine does damage based on his enemy. So, I could have sworn it was like worse against tanks or some [ __ ] Well, I think it's cuz they have more health, that's why. Oh, gotcha. Gotcha. Yeah, that makes sense. Victory. I'm ready from the back of your team's capture progress. Super time's over. Oh [ __ ] Oh, I'm so low. I'm so low. Better now. There it is. Thank you. Good. Good thing I was here. That was Brian with an eye, bro. Brian with an eye. What? Come on. Happy Monday, you crazy dude. Welcome in, gamers. That's how it's done. All",
            "start": 6264.88
        },
        {
            "text": "There it is. Thank you. Good. Good thing I was here. That was Brian with an eye, bro. Brian with an eye. What? Come on. Happy Monday, you crazy dude. Welcome in, gamers. That's how it's done. All right, big hold here. Big hold. A lot of people saying big hold, big win. Yeah, they are saying that. Got to get rid of that. Yep, there we go. Boom, boom, boom, boom, boom, boom. Oh my god. Oh, we're getting sucked in. We got and dangerous. Never me, Reed. I feel like I'm being watched. Oh, I re I got my my ult back because I killed the the Loki clone. I didn't realize that. Okay. Hey, hey, hey. Let's pretend they're all around us, Mike. Let's do a little fist bomb. Hey, little fist bound. Good job. Good job. Great job. Great job. Proud of you. Great job. Thanks to the power of DLSS4, we're getting the best frames in many games. Let's do this. Initiate class. Clash with me. Oh, what? So I So we can if we're if we have an enemy in between us, we can do that and we [ __ ] bang on him. You",
            "start": 6352.16
        },
        {
            "text": "getting the best frames in many games. Let's do this. Initiate class. Clash with me. Oh, what? So I So we can if we're if we have an enemy in between us, we can do that and we [ __ ] bang on him. You think so? Yeah. No, that's that's how it works. Okay. Okay. Well, let's try to pull that off. Keep an eye out. If we see like a big tank or even like a squishy between us, in fact, since we already won the first map, let's plan that. Let's try to do it. That's what I'm thinking, too. Who are these little minion mans? Huh? These guys minions. Maybe some X-Men dudes. Are they real? Oh, they are. They kind of look like in this world like they're animatronics in Disneyland Park or something. Got it. Yeah, we bang on them, chat. I think every franchise should have their own form of the minions. Personal. You know what I mean? Oh, what? The minions. What about them? Like, you know, the Avengers, they should have some sort of their version of the minions. I see. They just kind of run around. You",
            "start": 6424.24
        },
        {
            "text": "You know what I mean? Oh, what? The minions. What about them? Like, you know, the Avengers, they should have some sort of their version of the minions. I see. They just kind of run around. You know what I mean? Yeah. Let's see. All right. Here we got a shark. Hey, now I'm in here. I'm getting I'm getting destroyed. Oh my god. Jet the shark is so weak. Is dead, bro. So is Wolverine, though. He's super low. Magic right side. Oh, he beat me. Oh no, it's a it's an frost. I thought it was magic. My bad. Dagger mission area is yours. I love the minions. I love Ly Roger. I love And I love the minions. I love the minions. It's It's kind of proven that companies do better when they have a version of their minions. You know, they've gotten about eight movies. You belong to me. I love the uh Mike. Let's try to bang on someone. Come bang on this uh this X-Men lady over here. I tried. Oh, we go. All right, we got to get the uh you got to um we got to hit these freaking You thought I was gone for",
            "start": 6470.96
        },
        {
            "text": "Let's try to bang on someone. Come bang on this uh this X-Men lady over here. I tried. Oh, we go. All right, we got to get the uh you got to um we got to hit these freaking You thought I was gone for Loki clones. You know, you see the Loki clones just kind of doing work out there. Oh, Magic has her own X-Men skin. I thought it was the other lady. Enemy located. What's the one lady? Psylock. It's magic. Oh, she got cool skin. I might become a magic man. Get Jeff. Oh, Jeff, you healed. You Wolverine. He's low. Your team's capture progress has passed the halfway point. Your powers are mine. Oh, I had you. You're so lucky, dude. You timed that so beautifully. You're up. Got one. That was good. That was good. Uh-oh. That was a good duel. Come too far. Help me. I'm going to die. Oh my god. Ro life. Good thing I was here. Disappear. You'll have to keep fighting until we have a winner. Get him across. Yes. Holy [ __ ] Clash from me. We're doing it. Clash from me. I think we did it. I think we",
            "start": 6551.92
        },
        {
            "text": "Good thing I was here. Disappear. You'll have to keep fighting until we have a winner. Get him across. Yes. Holy [ __ ] Clash from me. We're doing it. Clash from me. I think we did it. I think we did it. That guy's so low. It's crazy. Yeah, that's all right. Stay in the zone. Stay in the zone, though. We got to win. [Music] Oh no. No. I dove into it. See if I can do this. Armed and dangerous. Not today, [ __ ] Oh my god. There you go. Andy, wait. Turn on. Clash with me. Clash with me. Keep going. Do [Music] again compromised. Oh god. Oh, I'm getting berserker bared. I died. It was worth it though. Oh [ __ ] I'm back. I don't think they got the stuff, dude. I don't think this team's got the stuff. is almost yours. Wolverine. Wolverine. Flashing me. Oh, that was close. Wolverine's super low. Jeff. So is Jeff. Jeff real low. Nice. Get the [ __ ] over here. You'll have to keep until we have a winner. Here comes Wolverines behind the thing. We got to get cap. He's just up in the sky.",
            "start": 6668.16
        },
        {
            "text": "low. Jeff. So is Jeff. Jeff real low. Nice. Get the [ __ ] over here. You'll have to keep until we have a winner. Here comes Wolverines behind the thing. We got to get cap. He's just up in the sky. That's what I need delaying [ __ ] There it is. Is he overreact? Wow. Did we turn on? We [ __ ] turned on, dog. Clash with me. Clash with me. Clash only. Clash with me. Oh, I don't know how class. Get cap. Get cap. Oh, what is he doing? Strange. Yeah. Dominant. That's huge. I mean, I'm not going to say that I popped off. Come on. We did great. You showed up finally. [Laughter] [ __ ] 37 and four. That's insane numbers, dude. We did great, man. [Music] Those are crazy numbers. Wow. We did it. We did really well. Look at that. They had a Well, they also had three healers. Kind of. Yeah, they got lost. They had three healers, three tanks. They got really lost in the sauce. One more. One final game. One final game to show off Nvidia DLSS4 to say thank you to our sponsors at Nvidia. Of course,",
            "start": 6771.28
        },
        {
            "text": "lost. They had three healers, three tanks. They got really lost in the sauce. One more. One final game. One final game to show off Nvidia DLSS4 to say thank you to our sponsors at Nvidia. Of course, you can go read the latest blog post, learn all about Nvidia DLSS4 and Nvidia Reflex coming to you for season two of Marvel Rivals and so many other games. We talk about Nvidia. We talk about the tech behind the scenes that Andy and the team here at Kind of Funny get to use to show you the very best way to play, update those drivers, learn about the games that you love and what they're doing, and most importantly, support us. Thank you so much for watching and having some fun. This is our last game which means we have to win. Should we have ended on the game that Andy had 37 and four on? Yes, probably. Didn't think of that, but we're in it. Thank you once again, Nvidia, for sponsoring this. And you know, you mentioned earlier a great point that I often bring up for a few more. I would have",
            "start": 6859.92
        },
        {
            "text": "Didn't think of that, but we're in it. Thank you once again, Nvidia, for sponsoring this. And you know, you mentioned earlier a great point that I often bring up for a few more. I would have a lot more games that I would regularly be playing if I wasn't reviewing a lot of things, right? You're very busy. He's very busy and honestly thank you Nvidia for not only sponsoring us to play this but also like it gives me a chance to come back to this game. You know it gives us a chance to come back to many games like HalfLife 2. You and Nick did the big Nvidia sponsor game of course HalfLife RTX on the way. You got to play a special demo of that. Uh that's available for everybody out there. Chad, I have a question. Why do I have a team ability with Mrs. Invisible or what's her name? Miss Fantastic. Got it. What's that all about? Oh, do I have one with everybody any day? Where I like go in and I ground pound him. What is that? I've never seen that. That's a new thing, right? Chat, shields are",
            "start": 6902.4
        },
        {
            "text": "Got it. What's that all about? Oh, do I have one with everybody any day? Where I like go in and I ground pound him. What is that? I've never seen that. That's a new thing, right? Chat, shields are more Steve's thing. This like C button. What does that do? You could just see to anyone. That's so weird. That's new, right? is yours now. Took the off. Remember, take the out. Oh, Thor. Oh, Thor's on me. That's a cap team about to anyone. Interesting. I didn't know that's a You thought I was gone for good. They took away Bucky with Rocket. Yeah, I Oh, it sucks. It's a bummer. Should have ended the last game. Yeah, 100%. It's unfortunate. Black Widow is combat ready. Let's see. What are you? We have no tank. We're all four DPS. [ __ ] yeah. Nice. Trouble has arrived. They're right above us. Come back here. We're done here. That's what I need. No way. No way he gets healed. That is the most unfortunate thing ever. Oh, get Emma Frost. What are you doing in here? Behold the god of [ __ ] Oh my",
            "start": 6950.64
        },
        {
            "text": "back here. We're done here. That's what I need. No way. No way he gets healed. That is the most unfortunate thing ever. Oh, get Emma Frost. What are you doing in here? Behold the god of [ __ ] Oh my god, I'm getting choked. Oh my god, I'm getting choked. I am Asgard's mighty. Ow. All right, I'll go I'll go tank if Oh, [ __ ] I'm not going tank. Who is it? Time to go Spidey. Dude, there's no way I could keep track of playing Spidey. It seems so hard. They've almost got it. You're ready. is going to be very angry. Oh my god. Something's happening. Something's happening over there. Oh, don't you dare. Let me button mash to get out of this alt. You know what I mean? Whoa. Double kill. Come on, Saw. Big comeback right here. My mission isn't over yet. Oh, well, we'll have to keep We stole it for like half a second. I didn't even know Thor was on us. I thought that was like my teammate. I was like, why are you so far back here? Thor's 9 and0. Woo! Thor's 9 and0. Not great. How did your uh",
            "start": 7033.44
        },
        {
            "text": "for like half a second. I didn't even know Thor was on us. I thought that was like my teammate. I was like, why are you so far back here? Thor's 9 and0. Woo! Thor's 9 and0. Not great. How did your uh how did your time with the Black Widow go, Mike? But the war never end. She has a one hit kill people. It's kind of weird, right? Yeah. It's unfortunate. She has a she they she has a thing where you can like shoot them, grapple them towards you, kick them, then shoot them again before you attack. I'm not doing that. I don't want to get close. I'm a sniper. I want to get as far away as possible. And so I snipe people and it takes 90% of their health away. That doesn't make sense. Yeah. My powers allow me. Go Hawkeye. Yeah. Hawkeye is the Or don't cuz Hawkeye does one shot, but you got you know it's not a hate scam. It's a one shot. Yeah, he'll head shot and I kill. Better watch out. You better watch out cuz I'll tell you what, man. It was disappointing. And here I thought the Second World",
            "start": 7138.48
        },
        {
            "text": "it's not a hate scam. It's a one shot. Yeah, he'll head shot and I kill. Better watch out. You better watch out cuz I'll tell you what, man. It was disappointing. And here I thought the Second World War was a nightmare. He got buffed. Damn, dude. We were running against some nasty Hawkeyes for a while and it was annoying. Unleash up. Oh, she used her ultimate right away. It's unfortunate. Capture the mission area. Not so fast. Die. Oh, what are you doing back here, dude? Okay. Well, Thor, welcome to our spawn point. Nice. He got him. The first death. Jeez Louise. I am nice that soul here comes one shot. Behold the god of thunder. Control feast. Did I hit him at all? Of course you need me. Get Jess, [ __ ] ass. I want a soul. My turn now. The light. Smash him. Oh god. I want my soul. Thor on the left side. A great taste. Is he ulting again? For real. For real. Magic on. Thor. Thor. Left side. Thor left side. Get ready. Here come the bad guys. I would love to hit this Loki. Hell",
            "start": 7194.72
        },
        {
            "text": "Thor on the left side. A great taste. Is he ulting again? For real. For real. Magic on. Thor. Thor. Left side. Thor left side. Get ready. Here come the bad guys. I would love to hit this Loki. Hell unleashed. Let them come and face the queen of hair. Another destroyed. I want a soul. Putting up crazy damage. Are you mine? Nice. You're like, man, watch out for this guy. How does he have his ult again? Cuz that was Loki. Oh, glory is almost yours. Oh no. Oh, damn it. Oh, that's tough. Hell at least. [Music] Double KO return. You'll have to keep fighting until we have Oh, great play. Oh, big play, Shay. Let's go. Defense. We have bodies. We have bodies. I want [ __ ] me. [ __ ] me. I thought we had bodies. Thought we had bodies. That's three. I always capture progress has passed the halfway point. Sorry. Who is hurting me? Who is hurting me? Are you shooting me? He could do that from over there. He got trouble. I am returned to claim what the mind got to break through, boys. They've",
            "start": 7321.28
        },
        {
            "text": "point. Sorry. Who is hurting me? Who is hurting me? Are you shooting me? He could do that from over there. He got trouble. I am returned to claim what the mind got to break through, boys. They've almost got it. Why would I double dipping? They're double dipping. We got to step up. Thor, door, door. Thor, door. Keep fighting until we have three. [Music] [ __ ] you. [Music] All right. All right. Okay. It could have been my Neymar. Could have been really just a solid five and seven appearance right now. My domain will one day in Not bad. It's not bad. It's not bad. It's turning off. Big play is turning on. Everybody's turning on. Let's stick together. We're doing great. Yep. Carry us. Obviously, this is could have been 30 seconds before you attack. Get ready. It might have been. It might have been. Now we fight to save. I'm also playing on like high ass settings, chat. Yeah, I could probably destroy. I could probably drop these down like low or medium or something. Look well on Asgard's",
            "start": 7447.36
        },
        {
            "text": "been. Now we fight to save. I'm also playing on like high ass settings, chat. Yeah, I could probably destroy. I could probably drop these down like low or medium or something. Look well on Asgard's beauty, queen of hell, for you will never possess it. You are bold, old son. The battle starts in five. And we're also like streaming this to our computers and stuff, but frames win games. Got it. All right, I got away. Oh, this is Michael. I like Oh. Kid said he likes seahorses. Who doesn't like seahorses? All right. Who's Who's alone over there? Careful, Brian. Careful. Find that soul. Looks like the mission area is yours to capture now. Mission area is yours. Woohoo! Hell unleash. Oh god, I'm just whiffing this alt so badly over here. Is that the bot? It is. Huh? Assemble. Oh, such a bad old chat. Don't look at that. Come and face the queen of hell. Oh, there you go. Get get your Punisher on. Oh yeah, I like that. Oh [ __ ] No, no, no. Oh, great save. Yo, he's on me. On me, bro. This guy",
            "start": 7551.84
        },
        {
            "text": "chat. Don't look at that. Come and face the queen of hell. Oh, there you go. Get get your Punisher on. Oh yeah, I like that. Oh [ __ ] No, no, no. Oh, great save. Yo, he's on me. On me, bro. This guy won't leave me alone. Oh no. Who is that? Moonight. Oh, it's Captain America. Who the [ __ ] Oh, it is Cap. Just he's movie Captain America. Oh, really? He's They got a little Chris Evans. Yeah. I didn't know that. Immortality has I hear they're going to put Chris Pratt in the game next. Really? Everybody loves the Pratt man. Light Tower, five months of support. Thank you, Light Tower. All right. Uh let's let's chill out. Let's wait. I'm at maximum. We got to kill that freaking Loki that's bouncing. I outnumber the Loki clone. One less problem. Steal your power. Cap. Cap. Cap. Cap. Cap on us. Cap just immediately murdered me. [ __ ] [ __ ] [ __ ] I am. No goddess is ever truly gone. Fight. Did Cap get a buff? I don't know. All right. Glory is almost yours. The magic. Not again. Cap.",
            "start": 7648.96
        },
        {
            "text": "us. Cap just immediately murdered me. [ __ ] [ __ ] [ __ ] I am. No goddess is ever truly gone. Fight. Did Cap get a buff? I don't know. All right. Glory is almost yours. The magic. Not again. Cap. Control. I want your soul. I'm willing to help. I really need help, man. I I don't know what to do. No. Pass the halfway point. [Music] Okay, we just lost the whole Okay, let's all hold back. We We just got to keep an eye on this cap cuz he keeps on just isolating us in the backline. You nasty. You're going to die. Careful, Ella. You're getting cocky out there. Oh, yeah. Cap right here. What happened? She killed me immediately. Who did? Uh, Hela. Hela. Yeah, I hit my ultimate too late. She just smacked me in the face while I was switching gears. But we made it. Your powers are mine. The world. cap on me. Cap on me. Shooting them. I have spotted an enemy. Good thing I was here. Nice. Got him. You'll have to keep fighting until we have a winner. Nice. Yes. Yes. We won. Holy [ __ ] Greatest of",
            "start": 7717.92
        },
        {
            "text": "on me. Cap on me. Shooting them. I have spotted an enemy. Good thing I was here. Nice. Got him. You'll have to keep fighting until we have a winner. Nice. Yes. Yes. We won. Holy [ __ ] Greatest of all time. Thank you, Nvidia. You brought us the power because frames win games. Wow. I just got an achievement. 100 matches. Win 100 matches. I got some sort of achievement. I wonder what that was. Thank you so much to Nvidia for sponsoring this. Chris has run it back. Thank you to uh the chat for helping us out. Not necessarily the beginning, Mike, but they're near the end. They turned it on at the end. Mike gave me a turn it on. Yeah. Yeah. Thank you for the games. Uh thank you Nvidia for the sponsorship. Uh thank you everybody for watching and hanging out with us. We'll be back tomorrow with more kind of funny content. Tell them what we're doing tomorrow. We got a cool one. I don't know. Some devs. You, me, Lost Skies. Oh, nice. That's tomorrow. Hell yeah. Okay. Sick. We got a cool",
            "start": 7858.08
        },
        {
            "text": "with more kind of funny content. Tell them what we're doing tomorrow. We got a cool one. I don't know. Some devs. You, me, Lost Skies. Oh, nice. That's tomorrow. Hell yeah. Okay. Sick. We got a cool sponsorship uh tomorrow uh for Lost Guys. You remember we played it for a bit during I think NextFest. Yeah. I'm excited to get back in there.",
            "start": 7920.88
        }
    ]
}