{
    "id": 13929,
    "video_id": "70lxjRP6SqY",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Everything is Expensive and You Own Nothing!",
    "description": "From KFGD: https://www.youtube.com/watch?v=T-KzUmU_kJc&t=2639s&pp=0gcJCX4JAYcqIYzv Wishlist Now!\nEmpyreal Steam Page - https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299\nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1744743865,
    "duration": 1113,
    "transcript_chunks": [
        {
            "text": "Bryce writes in to the Stars in the Bank Tim hatemail uh thing and says, \"My son had brain cancer, but watching Tim cheat away Greg's hard-ds is the worst thing that happened to him.\" The best part about Bryce had to redo it. Yeah. Like he started writing it. I looked over and I was and he like I'm like, \"Are you stopping?\" He's like, \"No, I just screwed up a word in there.\" Like, \"Good. I'm good.\" I'm like, \"I like where that one's starting, Bryce.\" There's a man who jokes about his own cancer. I like how you're starting this one. Let's keep going. Number three on the roper report. Sony is raising the price of the PlayStation 5, parenthesis again. This is Michael Mcuarter over at Polygon. The price of the PlayStation 5 is going up again in some territories. Sony Interactive Entertainment announced on Sunday uh on its PlayStation blog. Sony's latest price increases went into effect on Monday and affect consumers in Europe, the UK, Australia, and New Zealand. Uh Sony blamed quote a",
            "start": 0.32
        },
        {
            "text": "announced on Sunday uh on its PlayStation blog. Sony's latest price increases went into effect on Monday and affect consumers in Europe, the UK, Australia, and New Zealand. Uh Sony blamed quote a backdrop of challenging economic environment including high inflation and fluctuating exchange rates end quote in a statement attributed to Isabelle Tomita uh vice president of global marketing at SIE in Europe. The price of the PlayStation 5 edition is now €499.99. Uh that's a 50 increase and now €100 more than the PlayStation 5's digital's launch price in Europe which was €399.99. Uh, the UK is getting a pricier, okay, yes, pricier PlayStation 5 Digital Edition 2. It's now £429.99. Uh, that's an extra £40 compared to what the console cost last week and 70 more than the console's original price in the UK at £359.99. Uh, in Australia and New Zealand, both the PlayStation 5 digital edition and the standard PlayStation 5 with the 4K blue uh ray disc drive are getting price increases. The price",
            "start": 38.8
        },
        {
            "text": "in the UK at £359.99. Uh, in Australia and New Zealand, both the PlayStation 5 digital edition and the standard PlayStation 5 with the 4K blue uh ray disc drive are getting price increases. The price of the PlayStation 5 Pro is not changing in any of those regions. One piece of PlayStation 5. One piece of PlayStation 5 hardware that's getting less expensive is the conso's 4K Bluay Drive add-on. Sony previously raised the price of the PlayStation 5 in Canada, Mexico, Europe, UK, Australia, Japan, and China back in 2022. When's it coming to America, Tim? Who the hell knows when's it going to come and then go away the next day and then come back worse the day after that? Like we just in such tumultuous times that it almost feels si silly to speculate and even give any thoughts on this. This sucks. This is not like it was even the last time this happened cuz it happened last time. Greg, we're at a point now that in the console generations, we're not getting price cuts. We're getting price",
            "start": 93.52
        },
        {
            "text": "This is not like it was even the last time this happened cuz it happened last time. Greg, we're at a point now that in the console generations, we're not getting price cuts. We're getting price increases. That was scary when it first happened. When we see games just get more and more and more expensive and just get standardized in that way. Mario Kart [ __ ] World is $80. That is nuts, man. I I hate this. And there's just no getting away from it. Yeah. Uh Bear has got his tweet up from the one, the only Matt Piscatella. Uh he's quote blue skying. I don't know what he [ __ ] say. Uh games industry biz that says uh major Nintendo supplier warns Nintendo Switch 2 will be subject to 145% US tariffs. Matt quote quote tweets and has a quote that says uh quote that's because US President Trump has now confirmed Chinese-made electronics will not be exempt by simply move to a different tariff bucket which means hardware created in China including PlayStation Sony's PlayStation 5 consoles will",
            "start": 139.68
        },
        {
            "text": "now confirmed Chinese-made electronics will not be exempt by simply move to a different tariff bucket which means hardware created in China including PlayStation Sony's PlayStation 5 consoles will likely still be impacted end quote. Of course over the weekend uh there was a whole bunch of different breaking news. I'm reading from a Washington sky blue uh blue sky uh I'm sorry Washington Post blue sky breaking news. The Trump administration announced that smartphones, computers, and other electronic components are exempt from reciprocal tariffs. Uh days after the United States imposed the highest levies on foreign goods in a century. Important that this talks a lot about computers and phones, it is not uh video games. The video games still are attributed to all this. So everything's [ __ ] crazy and sucks. Yeah. And again, it's like it's just the scariest part is just feeling that there's no resolution coming. Like at any moment, all of this could just be like, \"Guys, we fixed it.\" Or",
            "start": 186.56
        },
        {
            "text": "crazy and sucks. Yeah. And again, it's like it's just the scariest part is just feeling that there's no resolution coming. Like at any moment, all of this could just be like, \"Guys, we fixed it.\" Or more likely, hey, it is worse than you could ever imagine. Or or more accurately, you'll never know. We're never going to hit a this is the new normal. The new normal is where we're in right now, which is utter [ __ ] chaos. Yeah, this is what this is a shitty question to ask because we're talking about the chaos and nobody knowing anything X, Y, and Z. But I have to ask, when do you think we find out what Nintendo is going to do? I mean, I don't know. Like the the reality is this is a make orb break moment for this company. Like this is their next generation system that they are going to be supporting for the next probably 10 years. Sure, the Switch 3 or whatever it is might also come out. They're still going to be supporting the Switch 2 after uh the Switch 3 comes out. You got to",
            "start": 222.96
        },
        {
            "text": "be supporting for the next probably 10 years. Sure, the Switch 3 or whatever it is might also come out. They're still going to be supporting the Switch 2 after uh the Switch 3 comes out. You got to imagine that's how these things used to like have been working and now I think more so than ever because of just how ecosystems work. Yeah. Uh and we see Nintendo adopting that with the uh Nintendo Switch online profiles and accounts like actually like following you and all of that. Like Yeah. Like if they are not positioned for a maximum install base at the jump, that's going to be very very bad for them when they're trying to sell games and they have a limited install base. Like we've seen it happen so many times before, but even look at at Xbox right now. How many times have we talked about stories of games not selling well on Xbox because the install base just isn't there and all of that. And like that we're talking about big numbers here, right? Like it's just scary if that's Nintendo",
            "start": 275.2
        },
        {
            "text": "stories of games not selling well on Xbox because the install base just isn't there and all of that. And like that we're talking about big numbers here, right? Like it's just scary if that's Nintendo and like they need that. they we're talking about a company that has the most insane attach rate ever and like they you need systems out there to be able to attach the software to and I do think that no matter what happens here well that's going too far cuz good lord anything can happen but like I believe it is as close to a guarantee as you can get that no matter how many units uh Nintendo has been able to make and they say that this is by far the most they've been able to for a launch they're going to sell out like I think that is a guarantee But what what happens next? What happens when Do you think there's no ceiling on that statement that there's no price this thing is going to go up to where they don't sell out? I don't think so. I think no matter and again there's a reality here",
            "start": 321.2
        },
        {
            "text": "Do you think there's no ceiling on that statement that there's no price this thing is going to go up to where they don't sell out? I don't think so. I think no matter and again there's a reality here where things are just so bad that why are we even talking about video games? Yeah. Yeah. Of course. Of course. Of course. But like I I I think that no matter what happens, the Switch sells out like in in in any I think realistic next couple months of how things could shake. Yeah. There's also the side of does Nintendo pull the truck and be like pull the plug and be like we're not releasing it this year. I don't see that happening because they need to make money. They need to like get the games out and the software and all this stuff. It's like it's this sucks. This could potentially ruin so many companies no matter how big and powerful they are. Yeah. Do you think they delay it? I know that they said like as of now, right, we still haven't heard anything about like the the pre-orders.",
            "start": 364.96
        },
        {
            "text": "many companies no matter how big and powerful they are. Yeah. Do you think they delay it? I know that they said like as of now, right, we still haven't heard anything about like the the pre-orders. They were only delaying the pre-orders in US and now Canada. Uh, and they said that it'll still launch June 5th. Do they delay that in the States? I I 100% Oh, so you're just asking like only in America if they delay it, but they release everywhere else. I just I don't see them doing that. America's too important and powerful when it comes to the voice of video games and like the all that stuff. Like that's we just see how sales of games work and all that. Like they I think that that is that would be a very very bad strategy for them. And I I don't see them doing that. Do they do they delay worldwide? I think that's way more likely. Um, and I I think at this point it's I any hypothesis I could have is pulling out of my ass. Totally. I mean, this could easily by the time this hits Spotify,",
            "start": 405.12
        },
        {
            "text": "I think that's way more likely. Um, and I I think at this point it's I any hypothesis I could have is pulling out of my ass. Totally. I mean, this could easily by the time this hits Spotify, some other crazy [ __ ] [ __ ] could have come out of China or out of the White House or out of whatever and this stupid ass trade war for no [ __ ] reason. Yeah. So, like if you ask me right now, do I think the Switch 2 is going to get delayed? No. But you could see it. I Oh, a thousand% I could see it. I I I wouldn't bet anything that it it won't, but like I think that they have a plan. They again these things need to be sold or else the company is in trouble. Like there's an entire plan with like a lineup of software that they need to get out there. like and sure they can like take the hit for a while, but I do think it gets to a point that it's like there's just too too much money at stake uh that needs to be in play, but like there's bigger, more important things out there and there's factors",
            "start": 447.6
        },
        {
            "text": "but I do think it gets to a point that it's like there's just too too much money at stake uh that needs to be in play, but like there's bigger, more important things out there and there's factors that are getting involved that like could again just could tank the entire industries surrounding this course if the wrong moves are made. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a",
            "start": 492.96
        },
        {
            "text": "Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shield and the powerfully ranged cannon. With a deep ability system, extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial.",
            "start": 537.68
        },
        {
            "text": "demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox, SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode is brought to you by Factor. Make this your best season yet with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. Greg Miller has been loving how simple it is to enjoy his Factor meals as he's rushing between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully prepared. Perfect for any active, busy lifestyle. Factor powers your day with satisfying breakfast, on-the-go lunches, premium dinners, and guilt-free snacks and desserts. Factor can help you feel your best all day long with wholesome smoothies, breakfast, grab-and-go snacks, and more",
            "start": 586.96
        },
        {
            "text": "breakfast, on-the-go lunches, premium dinners, and guilt-free snacks and desserts. Factor can help you feel your best all day long with wholesome smoothies, breakfast, grab-and-go snacks, and more add-ons. Multiple people here at Kind of Funny have been loving their experience with Factor. And guess what? You can, too. Get started at factorymeals.com/kindfunny5050 off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's code kind offunny5050 off at factormeals.com/kindafoney5050 off for 50% off plus free shipping. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style.",
            "start": 634.0
        },
        {
            "text": "sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Rays is giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. again. Go to shadyrays.com, use code funny to get 35% off polarized sunglasses. Speaking of wrong moves, Gregway, number four on the Roper report, Mythic Quest has been cancelled by Apple after four seasons. Uh, this is Nelly and Geriva",
            "start": 682.32
        },
        {
            "text": "funny to get 35% off polarized sunglasses. Speaking of wrong moves, Gregway, number four on the Roper report, Mythic Quest has been cancelled by Apple after four seasons. Uh, this is Nelly and Geriva over at Deadline. Apple TV's Apple TV Plus's Mythic Quest has come to an end. The streamer has opted not to renew uh the gaming or workspace comedy series for a fifth season. The decision comes days after the season 4 finale dropped March 26th. Uh since it had not been conceived as the series finale, the seasons 4 finale will now get a new ending to give fans closure. The updated episode will be made available next week. Quote, \"Endings are hard, but after four incredible seasons, Mythic Quest is coming to a close. We're so proud of the show and the world we got to build and deeply grateful to every cast and crew member who poured their heart into it. series creators, executive producers Megan Gans, David Hornsby, and Rob Mlany. Is that how I said the one? I always forget. Uh said in a",
            "start": 728.56
        },
        {
            "text": "to every cast and crew member who poured their heart into it. series creators, executive producers Megan Gans, David Hornsby, and Rob Mlany. Is that how I said the one? I always forget. Uh said in a statement Friday, quote, \"To all our fans, uh thank you for playing with us. To our partners at Apple, thank you for believing in the vision from the very beginning. Because endings are hard, with Apple's blessing, we made one final update to our last episode so we could say goodbye instead of just game over.\" End quote. Yeah. So, that the new version of the finale is coming out sometime this week. I'm incredibly bummed about this news. I loved this show. It was not always perfect. I think season two uh overall was not good enough. I don't want to say it was bad, but I think that season two kind of put them in a in a place that they lost a lot of people that were kind of watching week to week rocking for it. Uh and and then I think that uh season 3 and four got into a much better spot of",
            "start": 774.32
        },
        {
            "text": "of put them in a in a place that they lost a lot of people that were kind of watching week to week rocking for it. Uh and and then I think that uh season 3 and four got into a much better spot of realizing like we now just have an amazing cast of characters that just putting them in situations and letting them be the way they are is fun. It reminds me a lot of Community or The Office and things like that where you were like just at a certain point it's not about the plot, you're here for the characters. Sure. Sure. Sure. And God, they got there. Like season 4 was awesome because of everything I just said. Like amazing characters and amazing choices for them. The the two leads, uh, Ian and and Poppy were awesome. The dynamics they had, the amount of situations they put them in and took them out of and back and forth and back and forth. It's a sitcom workplace comedy, right? Like we've seen a lot of this stuff before, but we haven't seen it in the video game. And the amount of times, if",
            "start": 816.24
        },
        {
            "text": "out of and back and forth and back and forth. It's a sitcom workplace comedy, right? Like we've seen a lot of this stuff before, but we haven't seen it in the video game. And the amount of times, if you've watched the show every freaking day, you've heard us say this a lot, but the amount of times that Bless and I, who are two of the people I know that watch the show, have brought up the show clearly is written by people that watch Games Daily. Like, it is jokes for us. Like, it is. And they're smart. It is very, very, very smart. Very fun. like it's a show that should not have been nearly as good as it was. Um yeah, I mean I remember this getting announced, right? Oh, Ubisoft's doing a show with Apple as at Ubisoft's like E3 show and we're like what the [ __ ] is this? And so wrong. And again, I'm not trying to say it's the best thing ever. But I will say that it is a incredibly good comedy. Like I think that they've gotten to a point that they like like I'm watching this and I I put",
            "start": 859.04
        },
        {
            "text": "I'm not trying to say it's the best thing ever. But I will say that it is a incredibly good comedy. Like I think that they've gotten to a point that they like like I'm watching this and I I put it up there. I think Hacks is the best. But in terms of the contemporary kind of comedies, like it's this hacks, like I um like I like this a lot more than Sex Lives of College Girls. And I loved that show. Another one that just got cancelled, but at the same time, I can't believe the show made it to four seasons in a spin-off. Yeah. Um I'm very uh it's called Side Quest. It it just came out. It's like technically the last uh I guess besides the little bit that they're adding here, it's the latest thing that they did. It was four episodes. Um show ran by Ashley Burch, who is a a lead in the the show um in the main show and she also uh wrote and directed a couple of the episodes in Side Quest. And Side Quest was Mythic Quest. One of the best things about it was every season they would do at",
            "start": 902.8
        },
        {
            "text": "show um in the main show and she also uh wrote and directed a couple of the episodes in Side Quest. And Side Quest was Mythic Quest. One of the best things about it was every season they would do at least one episode that was just completely not part of the main story and they would just follow one character's like backstory and it would always add some very interesting and usually the best episode of the season. Yeah. Side Quest was kind of like let's just do that for a whole show. Gotcha. And like one of them was about and it's always like relating to Mythic Quest that is this video game. And the amount of video game culture that they were able to fit in the show and treat authentically is something that really needs to be commended. And I'm saying all this because y'all should watch this show. Even if it's over the time that's there, it's worth your time. And that's really cool. They get to do an ending. It it is. And I'm very interested in what's that going to be. I don't think it",
            "start": 944.72
        },
        {
            "text": "show. Even if it's over the time that's there, it's worth your time. And that's really cool. They get to do an ending. It it is. And I'm very interested in what's that going to be. I don't think it can possibly be great. Like just with where this laid off with I mean real talk I I think that's going to be what it is. Like that's the type of show that this is. Um, but it's it's crazy that uh the side quest like one of the episodes was about um the comic book based on the game and it takes place in a comic book store uh the day that that comic shows up and the people that are coming to get it, right? Awesome concept and they just do a really good job with it. Another one is about the violinist in or maybe not violinist, whatever, some instrument in a video game orchestra concert for Mythic Quest and like just following her journey. It's like very very very smart video game culture stuff. So yeah, I'm very sad that this happened that it was canceled this way and like I I get it though. I",
            "start": 985.2
        },
        {
            "text": "and like just following her journey. It's like very very very smart video game culture stuff. So yeah, I'm very sad that this happened that it was canceled this way and like I I get it though. I totally get it. But shout out to them for four and four seasons in a spin-off that I thought were excellent. I would recommend everybody watch it. Apple TV continues to be the unsung hero of the streaming game. They need to [ __ ] promote their stuff better. And this is what happens. They don't do that. Yeah. They just let their shows happen. The people that are watching them are like, \"These are so freaking good.\" But unless you're severance, it's like it you never hear about it. You don't break out. Barrett, uh, if you don't like the ending of season 4, Tim, you can just pretend it the show ended at season two where it should have ended. No. The ending of season 2 is very good, and that's where the show should have ended. I mean, here's the thing. Plot-wise, yes. I entirely agree. But like",
            "start": 1031.04
        },
        {
            "text": "at season two where it should have ended. No. The ending of season 2 is very good, and that's where the show should have ended. I mean, here's the thing. Plot-wise, yes. I entirely agree. But like show comedy wise, absolutely. Oh, that I get that I cuz the ensemble cast [ __ ] great. I could watch them forever doing a different show. Like I would love to see them still work on something else. Yeah. And that's plotwise. Yes. That that show should have ended at season two. Yeah. But season two, but whatever. Okay. Have Oh, here we go. Timer's off. Hold on. Stop that. This one's in all caps, it looks like. Uh, this one says, \"Can't wait to see you lose all your stars, loser.\" Joey, sooner or later, TV. There's one for you. Thank you. No problem. Don't worry about",
            "start": 1069.04
        }
    ]
}