{
    "id": 14008,
    "video_id": "Ah4-dEzyoH4",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Blessing Adeoye Jr.",
        "Roger Pokorny"
    ],
    "title": "Borderlands 4 Changes Date, State of Play Tomorrow! - Kinda Funny Games Daily 04.29.25",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nWe’re here to talk about video game news!\n\nToday after, KFGD, you’ll get:\n - GAMESCAST - an Arc Raiders preview\n - After Gamescast is Escape from Tarkov w/ Mike and Nick\nIf you’re a Kinda Funny Member:\n - Today's Gregway will be a massive one lasting the entire drive in as Greg explains where the hell he's been the past two days!\n\nTime Stamps:\n00:00:00 - Start\n00:10:13 - Housekeeping\n         -  The Roper Report   -\n00:13:02 - Borderlands 4 is getting a State of Play TOMORROW\n00:23:52 - SuperChats\n00:32:38 - BREAKING: More Respawn Layoffs, Projects Cancelled\n00:45:47 - PlatinumGames is seemingly hiring for another online action game\n00:49:42 - Sam Lake would like to make a Moomins game, and write a novel after he retires\n00:56:02 - Wee News!\n01:00:48 - SuperChats & You‘re Wrong\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745950624,
    "duration": 4240,
    "transcript_chunks": [
        {
            "text": "Today's stories include Borderlands 4 is getting a state of play, Borderlands 4 is moving its release date, and Sam Lake wants to make a Mumman's game. We have all this and more because this is Kind of funny games daily. [Music] Yo, what's up? Welcome to Kind of funny games daily for Tuesday, April 29th, 2025. I'm one of your hosts, Blessing Addie Jr. Joining me is the lock. Roger Bakornney. What is up, blessing? You know it's a slow news day when I took the first headline and made it two things. Yeah. In the intro. We got to break it up a little. And I was like, what's the third thing going to be? I guess Sam L make a M's game. M. We're going to have a big conversation about M. I'm very excited to talk about Mins cuz I've seen the images. I've seen the memes of Mins, but I don't know what a Min is. Okay. I'm glad you're with me cuz I didn't know if this was going to be one of those episodes where it's like blessing. You lived under a rock. Why don't you know what the Mins are? Why",
            "start": 3.2
        },
        {
            "text": "a Min is. Okay. I'm glad you're with me cuz I didn't know if this was going to be one of those episodes where it's like blessing. You lived under a rock. Why don't you know what the Mins are? Why aren't you happy that I'm here though? I would have broken it out. You know what I mean? It would have been great. It would have been like Yeah. If it was like Greg on the show, Greg would have told me all about the Mumens and how like they're a big worldwide phenomenon talking about and I'm sitting here and the chats roasting me for not knowing the Mins and then Roger breaks it out. We don't know what the [ __ ] Mins are. We'll figure it out later. We're we're going to talk about it later. I want to have like a sit down session and like a predictions on like what Mins are. What are mments? And like how big are how big are Mums really? You know what I mean? Like are they physically? Like are how much of a worldwide phenomenon? because I assume they are a worldwide phen phenomenon because they",
            "start": 48.08
        },
        {
            "text": "how big are how big are Mums really? You know what I mean? Like are they physically? Like are how much of a worldwide phenomenon? because I assume they are a worldwide phen phenomenon because they have multiple theme parks. Oh yeah. Okay. We'll talk about this. Including one in Japan. We're spoiling the episode that clearly does not have much going on. So, we got to we got to wait a little bit. We got to wait a little bit. This is a good opportunity for me to bring up I was trying to figure out where to fit it in the show. What? You calm down. All right. It's Tuesday 10 10:02 a.m. All right. Calm down. Um I I've been playing Forts Horizon 5 for a PS5. Oh, yeah. When the [ __ ] did you get that code? Like two weeks ago. God, I saw you requested in the thing and I was like, \"Oh, Roger, I would have been playing it. I was excited. Fuck.\" Um, I had it in like we I had it in main news and I was like, \"This ain't a main news item. I played this for two like two hours on PS5.\" Then I put it",
            "start": 79.28
        },
        {
            "text": "have been playing it. I was excited. Fuck.\" Um, I had it in like we I had it in main news and I was like, \"This ain't a main news item. I played this for two like two hours on PS5.\" Then I put it in Wii News and I was like, \"That's weird.\" So, I'll just talk about it here. Yeah. Of course, I've always loved fors of Horizon or at least ever since Fors of Horizon 3, I've been big into Forza Horizon. [ __ ] love those games. My favorite racing game franchise right next to Burnout, right? They're like kind of neck andneck at this point. Um, it has been so low. I don't have like deep impressions cuz it is just the same game ported to PlayStation 5, but now I'm playing on PS5. And man, when I when I talk about how much time I have been like spreading between multiple different video games, this is one of the games that I'm talking about. Oh, really? Yeah. Where I'm like, man, it would be nice for me to go and finish Expedition 33 cuz I'm halfway through that game, but I got Blueprints post",
            "start": 117.2
        },
        {
            "text": "is one of the games that I'm talking about. Oh, really? Yeah. Where I'm like, man, it would be nice for me to go and finish Expedition 33 cuz I'm halfway through that game, but I got Blueprints post game yelling at me. I got Forts of Horizon 5, a game I've already played, but like I got a game I've already played, but I [ __ ] love Forts of Horizon. It's that thing where that game is like a breath of fresh air. It is like a cold glass of water on a summer day. It is. Give me another one. It's like It's like we lemonade, but we can figure out something there. It's like It's like a glass of mimosa on a Sunday brunch. Oh, come on. Come on, bro. Oh, dude. It's funny in chat says a cold brew. I do like a cold brew as well. Um, oh, forts of Horizon 5 is is so [ __ ] good. And like it's one of those things where I was like, I'm just going to boot it up for the experience. Yeah. Of being able to like reexperience it again and like play the intro cuz they do such a good job of good vibes in",
            "start": 155.76
        },
        {
            "text": "those things where I was like, I'm just going to boot it up for the experience. Yeah. Of being able to like reexperience it again and like play the intro cuz they do such a good job of good vibes in the forts of Horizon. Is that one where they have like a welcome to Fortza Horizon 5? You're in Mexico. Mexico. You're in Mexico. So good. You're [ __ ] racing like um a [ __ ] helicopter or no, you're racing like a Yes. Was it the helicopter? The helicopter. But the helicopter like drops two. Here's the thing. You're racing all different kinds of vehicles in all these games. I think in Fors Horizon 3, you race a train and one of them you race a vehicle from Halo. But in this one, you start off and like they drop two motorcycles from the sky and you race to the finish. It's so [ __ ] good. The game looks so [ __ ] good on PS5. Tell me how it feels though. Oh, it feels fantastic. They're using the haptics. Oh, they're using all the haptics now. Yeah. Oh, they're using all the haptics in",
            "start": 202.96
        },
        {
            "text": "The game looks so [ __ ] good on PS5. Tell me how it feels though. Oh, it feels fantastic. They're using the haptics. Oh, they're using all the haptics now. Yeah. Oh, they're using all the haptics in that thing. It's kind of crazy how much Xbox is supporting the PlayStation 5 dual sense. You think they would just turn off the Dual Sense stuff? They're like, \"Fuck you.\" They're like, \"No, man. This is just straight up. We're copying and pasting pasting this from Xbox.\" It's like, \"No, that game is [ __ ] optimized on PlayStation, and it works. It is so [ __ ] good.\" Oh man, that makes me happy. I I was going I playing a little bit of Oblivion, right? I have no uh any type of uh nostalgia for Oblivion specifically. I never played it, never touched it, never even watched like videos of it, right? So, this just a new experience to me, and it just feels like an old game. And that's not negative cuz I know it's exactly what that is, and it works for a lot of people. Just doesn't work for",
            "start": 241.52
        },
        {
            "text": "right? So, this just a new experience to me, and it just feels like an old game. And that's not negative cuz I know it's exactly what that is, and it works for a lot of people. Just doesn't work for me, right? But it made me feel like, man, I want a Skyrim remake. So then I downloaded Skyrim. You want a Skyrim? Do you know what's crazy? You're not crazy for saying that, but it sounds crazy in my brain cuz I'm like, Skyrim just came out. Of course. Yeah. And then I booted up Skyrim. I'm like, \"Oh, this is an old game.\" Well, it did. It did just come out for uh the Neo Geo Pocket. You're right. Skyrim got ported somewhere else. No matter where you've been in the last 14 years. Jesus Christ. Skyrim has always just It's a new special edition somehow. You know what I mean? You go there, you think you have the right edition. It's like the anniversary edition. play as a grown man in a Link cosplay. Yeah. Yeah. [ __ ] Yeah. And I booted it up and I was like, man, that is talk about a cold",
            "start": 275.36
        },
        {
            "text": "think you have the right edition. It's like the anniversary edition. play as a grown man in a Link cosplay. Yeah. Yeah. [ __ ] Yeah. And I booted it up and I was like, man, that is talk about a cold glass of water on a hot summer day. Skyrim. Oh my gosh. Oh yeah, dude. I I don't know. Do you have any nostalgia for Skyrim? Because I totally do. Like I specifically only the first like 14 hours of that game. Yes. The thing is everybody though. I've replayed the first like 15 hours of Skyrim multiple times. Same. Yeah. Like at least like five times I played the first 14 hours of Skyrim. And I I I don't know. I don't think I know anybody in my life that said like, \"Oh, no. I've confidently finished that game.\" It's like it's like GTA San Andreas where it's like you don't know anybody. I' I've beaten GTA San Andreas, but like 99% of people have just not beaten that game. One of the greatest games of all time. Like when we do the top 100 games, Skyrim will be on my top 100 games and I don't",
            "start": 309.92
        },
        {
            "text": "beaten GTA San Andreas, but like 99% of people have just not beaten that game. One of the greatest games of all time. Like when we do the top 100 games, Skyrim will be on my top 100 games and I don't give a [ __ ] because I've never finished that game and I will never finish that game. And that's fine. We got to do a a I don't know if this list exists online. And so it might be a [ __ ] list or it might just be me and me and Roger sit down and we do this list. Top 10 games that nobody's finished. Oh, I like this. We can make it. We can make our own [ __ ] list. Have you ever Yeah. Whenever we make a list like actually like publish it like we should work with the gamer like a little collaboration and then we should be like here's ours. Put it up there. Can I tell you something? Oh, I've always wanted to freelance for an outlet. You know what I mean? Like just write an art for money or just just for fun. Well, like for the clout, you know what I mean? like Kotaku, hit me up. Let me",
            "start": 349.2
        },
        {
            "text": "always wanted to freelance for an outlet. You know what I mean? Like just write an art for money or just just for fun. Well, like for the clout, you know what I mean? like Kotaku, hit me up. Let me write an article, you know, like let me write a review. Now, I don't know how that sits with Greg Miller of me writing a review, but like what what articles can I write for websites? Cuz I miss writing. I love writing and I I don't really flex my writing muscles. Oh, here we go. Okay. Well, that's Minecraft. Watch Mojo. That barely counts. But Minecraft does have an ending, right? Yes, it does. But like that barely counts. Also, before people get mad at us, it is it is a slow news day. We're right in with your super chats. We'll we'll tackle all of them. We promise we'll tackle those topics. But I'm just saying it does exist out there. Well, can we should we do a live [ __ ] list? Can you scroll through it? Yeah, we do one really quick. Yeah, scroll through. Scroll down real quick. Let's",
            "start": 388.72
        },
        {
            "text": "But I'm just saying it does exist out there. Well, can we should we do a live [ __ ] list? Can you scroll through it? Yeah, we do one really quick. Yeah, scroll through. Scroll down real quick. Let's see what they got on the list. Witcher 3: Wild Hunt. That's true. That's true. Who's finished WCOM 2? [ __ ] no. Yeah. Yeah, that's a good one. This is great. Bro Force. I finished Bro Force. I finished Bro Force, too. I didn't finish Bro Force and I love that game, though. That game [ __ ] kicks ass. Most games. That's also 2016. I'll I'll find you one day. Sorry, Benar. That's so good. Skyrim. There we go. No one [ __ ] beats that game. Uh, Cuphead. Honestly, I agree. I Cuphead is probably one of the best games I ever played in my life. I am probably still four bosses away from finishing that game. Damn, that's crazy. I see the other one here and I agree with this one. This is NGS5 fan and pain. But well, that game wasn't finished to begin with, so how can you finish? Yeah, exactly. The",
            "start": 423.6
        },
        {
            "text": "game. Damn, that's crazy. I see the other one here and I agree with this one. This is NGS5 fan and pain. But well, that game wasn't finished to begin with, so how can you finish? Yeah, exactly. The developers never finished the game. Oh, is that true? I don't know anything about this. Well, it's a whole weird thing where the game very clearly needs a chapter three. Like there's two chapters in the game and you finish the game and it's like there's so many un like unfinished story here. Um and it was because Konami rushed Kojima and like there was like a chat, correct me if I'm wrong, there's like an extended version or there's like some special edition that comes with cut scenes that were cut from the game where you can see some of the stuff that was cut. And so I never finished this one because I believe halfway through the game you have to fight a bunch of zombies and I was like [ __ ] this. That's not what that's not what I wanted to do. You know, it's a stealth game for me. So",
            "start": 464.0
        },
        {
            "text": "because I believe halfway through the game you have to fight a bunch of zombies and I was like [ __ ] this. That's not what that's not what I wanted to do. You know, it's a stealth game for me. So it's like why do I want to do this? Wait, so are you telling me Metal Gear Solid or Metal Gear Survive is actually like part of the cannon cuz that's all about fighting zombies kind. Yeah, they kind of set it up there right there. Um, also I did finish the Phantom Pain and like I feel like a lot of people did. But you know what? I guess chapter 2 might have thrown people off so maybe not. Battle Toads 1991. Yeah, now we're getting to like the hard territory. Super Meat Boy. I same. I don't You know what? That'd be a good poll of like how many of y'all play Super Meat Boy and didn't finish it. I think you could see the stats on like Steam like the achievements or whatever cuz I feel like most the vast majority of people probably didn't finish. That's also most games though like even like",
            "start": 501.36
        },
        {
            "text": "I think you could see the stats on like Steam like the achievements or whatever cuz I feel like most the vast majority of people probably didn't finish. That's also most games though like even like Spider-Man one like most people never even like get past like half the game. But I feel like the percent Yeah. It's crazy always to see like the drop off in percentage in story trophies for like big games. It's like god damn Sumat Boy doesn't get enough love. One of the What are you really? I feel like Sum Meat Boy gets all the love. I just don't think like when we talk about like some of the great platformers like we just don't talk about that one really. I don't know. Like it should be top five. Now you're stretching. Top five. Think about it. Guess you don't love indie devs. Well, first of all, ukulele and the impossible layer exist. Sorry, we're playing. There's room for four other games. Bless. Yeah, but then you're talking about 10 other Marios. That's crazy. There's 10 Marios that",
            "start": 534.8
        },
        {
            "text": "all, ukulele and the impossible layer exist. Sorry, we're playing. There's room for four other games. Bless. Yeah, but then you're talking about 10 other Marios. That's crazy. There's 10 Marios that are better than me boy. Oh, sorry. I thought we were talking just indie. Oh, indie platformers. Oh, then boy is probably number one. Yeah, for sure. Uh, Celeste. Celeste. Oh, you're right. Celeste is probably number one. Sumi Boy number two. All right. What's number two on this list? Minecraft. Minecraft. Yeah, number one. The number one dark dungeon. All right. I don't know. Well, we didn't even play it. Yeah, we didn't even start it, so we don't even know. That's what shitless is about. Shitless is all about making fun of people that have different opinions from you because they play different games than you do. That's [ __ ] nerd. You play Darkest Dungeon. Darkest Dungeon over here. Remember, this is kind of funny games daily. Each and every weekday, we run you through the nerdy news",
            "start": 570.4
        },
        {
            "text": "games than you do. That's [ __ ] nerd. You play Darkest Dungeon. Darkest Dungeon over here. Remember, this is kind of funny games daily. Each and every weekday, we run you through the nerdy news and need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, and now Spotify and Apple Podcast to get all of our shows add free. Watch us record them live and get a daily exclusive show. For a chance to be a part of the show, some of your thoughts and opinions as YouTube super chats as we go. Housekeeping for you. We got a schedule change tomorrow because of today's news. Uh 10:00 a.m. tomorrow, uh like regularly, you're going to get KFGD. After that, at 11:00 a.m., you're going to get a Nick and Mike stream. They're playing Tarov. And then at 1:45 p.m., you're going to get a Borderlands State of Play reaction followed by a Games Cast. Uh and then at 3:30 p.m. you're getting",
            "start": 608.72
        },
        {
            "text": "to get a Nick and Mike stream. They're playing Tarov. And then at 1:45 p.m., you're going to get a Borderlands State of Play reaction followed by a Games Cast. Uh and then at 3:30 p.m. you're getting the Patreon happy hour. And so, um stay unlocked for that. All right. Lock in. Stay on lock. Stay locked. You looked at me for like help. Save me. I don't know what's happening. Smiling at the camera like you got no thoughts going on. Actually good. You know what I mean? I'm just looking at myself. Keep it locked. Come on. Keep it locked. I We're in 11 person business all about live talk shows. Today after KD you're going to get Games cast versus an Arc Raiders preview. And then after that is Escape from Tarov with Mike and Nick. If you're a kind of funny member, today's Gregway will be a massive one lasting will be a massive one lasting commas uh the entire drive in as Greg explains where the hell he's been the past two days. Thank you to our Patreon producers Anatoli Astani Twining,",
            "start": 648.0
        },
        {
            "text": "massive one lasting will be a massive one lasting commas uh the entire drive in as Greg explains where the hell he's been the past two days. Thank you to our Patreon producers Anatoli Astani Twining, Carl Jacobs, and Omega Buster. Today are brought to you by Imperial and Ouraf Frames, but we'll tell you about that later. For now, let's begin with what is and forever will be the Roper Report. It's time for some news. We have four stories today. A baker's dozen. Starting with our number one, Borderlands 4 is getting a state of play tomorrow. I'm pulling this from the PlayStation blog. Get ready to deep dive on Borderlands 4. During this special state of play, I'll be joined by other members of the Gearbox team to share the nitty-gritty details of how you'll wreak havoc across Chyros and take down the Timekeeper. Catch the show live on PlayStation's Twitch and YouTube channels on April 30th at 2 p.m. Pacific time. Back at February State of Play, we unveiled the game's launch date, which",
            "start": 689.36
        },
        {
            "text": "down the Timekeeper. Catch the show live on PlayStation's Twitch and YouTube channels on April 30th at 2 p.m. Pacific time. Back at February State of Play, we unveiled the game's launch date, which showcased the taste of the explosive action, fearsome enemies, and powerful loot. Since then, we've announced that Borderlands 4 uh Borderlands 4's launch has moved up to September 12th, 2025, meaning you'll get to enjoy the looter shooter action even earlier. In this upcoming state of play, Strap in with me and Anthony Nicholas. I should also should pre preface this with uh this is written by a member of the Borderlands team. I'm I'm not on the State of Play. Uh, strap in with me and Anthony Nicholson, the senior project producer for over 20 minutes of developer guided gameplay, including missions, killer weapons, exciting action skills, new and returning characters, and more. Roger. Hi. Game of the Generation. Game of the Generation. State of Play tomorrow. How do you feel? Uh, a few",
            "start": 741.68
        },
        {
            "text": "missions, killer weapons, exciting action skills, new and returning characters, and more. Roger. Hi. Game of the Generation. Game of the Generation. State of Play tomorrow. How do you feel? Uh, a few things, right? We can talk about the release date, talk about whatever. I am I am interested to see just one, the reception of of of Borderlands 4 specifically, right? because I think there's just a lot of negativity in the air of just like oh it looks like more Borderlands right which I think we were kind of all hoping a little bit of uh departure but from hearing the writing team hearing the exalir Nelson Nelson I think Emma kid will feed body yeah like hearing that like the the the fact that they're consulting with new people on the writing side of things gets me excited and also like hopping into a Borderlands game at launch for me with the crew at kind of funny gets me a little excited right I mean crew kind funny as a prog term with Greg. Uh being able to hop in with Greg. I think",
            "start": 785.28
        },
        {
            "text": "into a Borderlands game at launch for me with the crew at kind of funny gets me a little excited right I mean crew kind funny as a prog term with Greg. Uh being able to hop in with Greg. I think most of us are going to be playing. You think so? You think you you're going to play? Yeah. I mean, yeah, I like Borderlands. I know Bear likes Borderlands, although I can't I can't probably out of Borderlands 3 was honestly the most I put into a Borderlands and then we stopped like a third of the way through. We did stop. We got Here's my here's my hot take. All right, because it's slow news day. I got to make the Yeah, I love this. I want to talk. No more swamps in video games. Oh, interesting. Let's Or at least let's let's dial down the swamps. What about Shrek? Cuz Miyazaki, if you make a Shrek video game, you're allowed to swamp. Okay. Yeah. Well, what was that, Bear? Miyazaki is going to come for you if you say no. And you know what? I'm telling I'm telling this to Miyazaki. You don't",
            "start": 827.84
        },
        {
            "text": "video game, you're allowed to swamp. Okay. Yeah. Well, what was that, Bear? Miyazaki is going to come for you if you say no. And you know what? I'm telling I'm telling this to Miyazaki. You don't need a swamp in every single one of your games. What about South of Midnight? You're allowed. You're allowed a swamp because that's I'm just trying to figure it out. Where does this lie? No, I like this. I like this. Keep poking holes in this. Okay. Okay. But just in general, like if you're making a game that could be anywhere. Yes. Why the [ __ ] we put in a swamp? Well, it's it's the fact that I'm just sick of it. Cuz with swamp comes poison with swamp and slow. That's the two things. No, I don't. Slow. No slow. Slow. No. What about What about swamp with no no slow? Is there poison? Yes. All right. I'm a little No swamp. No swamp. No swamp. What about just swamp with just not nothing else? Just swamp. You're just walking around swamp. I might be okay with it. Okay. You just don't like the",
            "start": 868.0
        },
        {
            "text": "I'm a little No swamp. No swamp. No swamp. What about just swamp with just not nothing else? Just swamp. You're just walking around swamp. I might be okay with it. Okay. You just don't like the negatives. I just don't like the negative the negative like properties that get applied with swamp. Okay. Okay. Okay. We could figure that out. We could figure that out. But they put a ring in Demon Souls. Be a part of the PR team that uh sells people on why swamps are good. Exactly. In Demon Souls, they put the remake. They put like a little um ring that you can attach where I think it makes you you can walk through the swamps or whatever. So, they kind of made it a little But my pitch and we could start a consulting agency is what are the other environments that we can add to every video game cuz every like here's the issue. I'm kind of a hater on all environments. Like I don't like all environments. Most environments. I like jungle. I like jungle. I like jungle. This man hates outside. I",
            "start": 908.32
        },
        {
            "text": "cuz every like here's the issue. I'm kind of a hater on all environments. Like I don't like all environments. Most environments. I like jungle. I like jungle. I like jungle. This man hates outside. I jungle. I like jungle. I hate I hate desert. Oh no. I'm with you on desert. Kind of kind of don't like frosting. Top three. And we're going to talk about border in a second. Top three worst environments. Swamp, desert, underwater. I'm fine with underwater. Underwater, overheated. Underwater, overheated. It depends on the underwater. It's because of Mario 64 and all these [ __ ] games that did it poorly. Everyone got all mad. Legend of Zelda, Ocarina, [ __ ] I'm saying a lot of games did it poorly back in the day, but then a lot of games have done it pretty okay recently. Yeah. Do I know any of those games off the top of my head? No. I was going to say name some good Mario Odyssey. Oh, yeah. That's true. I did. And a lot of them are like frictionless. And I mean that like literally and",
            "start": 946.32
        },
        {
            "text": "of those games off the top of my head? No. I was going to say name some good Mario Odyssey. Oh, yeah. That's true. I did. And a lot of them are like frictionless. And I mean that like literally and also as a joke, right? It's frictionless in terms of like I played through it and I'm like I don't think about it. Right. And that's good. Sure. And here's the thing. I think you're right as far as modern player obscure, but that's like barely. That's the thing is like water environments when done right can actually be the coolest environment in the game cuz water can just make things cooler. I mean obscure is the example of like water just made that [ __ ] cooler. You get there. It's vibes. But when done wrong, it's like and don't get me started on ice levels. Ice is just desert cold. No, but you're slipping on ice. It's slippery. Yeah, it's slippery. I will never forgive them for what they did in in Gears of War 5 where that uh that ice level took like [ __ ] 15 hours and I never finished",
            "start": 988.96
        },
        {
            "text": "slipping on ice. It's slippery. Yeah, it's slippery. I will never forgive them for what they did in in Gears of War 5 where that uh that ice level took like [ __ ] 15 hours and I never finished the game because of it. Every time I boot up the game, I it didn't take 15 hours. Probably took two hours, but every time I would boot up the game, I would be I would be in the frost level and I'd like [ __ ] this game. Gears 5 hours. Barry, you have something to say? No, I was just say can't believe Gears 5 was 45 hours. It was 45 hour video game it um all right let's talk about this [ __ ] thing actually uh I have trauma when it comes to Borderlands because I worked on the Borderlands show so I saw a lot of Borderlands and my entire life was Borderlands inside of uh uh when I was at college and just [ __ ] going to school doing seven classes and then working on that show. So nothing against Borderlands but I this it's going to be a hard thing for me them to get me in on board because I'm just",
            "start": 1023.16
        },
        {
            "text": "[ __ ] going to school doing seven classes and then working on that show. So nothing against Borderlands but I this it's going to be a hard thing for me them to get me in on board because I'm just I'm just negative on it. But this I'm excited to see more of it. Um I I I I don't know who's going to be on that uh Games cast panel uh talking about it and reacting to it, but I'm interested in that. But I'm more interested in just the release date of it all. Blessing. Because you know what that means? What was that? Yeah, if they're moving it up. What are they moving it up for? What is What is day two working on? What is 2K working on? They're working on getting out of the way of Marathon, let me tell you. All right. Marathon Supremacy. We did it. They played the pre-alpha and they're like, \"Shit, we got to get away from this thing.\" Um don't [ __ ] with me. I don't know. Like I I genuinely you don't say it. Okay. Well, okay. GTA 6, but I don't know. But you we're moving this up two weeks",
            "start": 1065.04
        },
        {
            "text": "we got to get away from this thing.\" Um don't [ __ ] with me. I don't know. Like I I genuinely you don't say it. Okay. Well, okay. GTA 6, but I don't know. But you we're moving this up two weeks to get out of the way of GTA 6. I I don't know. I don't know. You don't think that it could be end of October? So, when was the original release date for for this? What is What is the marathon release date? I could do the math or I could just look up the marathon release date. And we also have uh Ghost Shima. No, not the first marathon. [ __ ] 1994. God damn it. September 23rd. Okay. That's Marathon. That's Marathon. That That was the old Borderlands 4 release. Okay. It was the same day, guys. Yeah. Um, so you're thinking, yeah, like a GTA 6 release day coming out or GTA 6 coming out in October would be enough to be like, \"All right, let's give this Give it a little Give it a month. Give it a month. Get people to buy that and then feel like they can recoup their money and then go spend $100 on",
            "start": 1101.2
        },
        {
            "text": "be enough to be like, \"All right, let's give this Give it a little Give it a month. Give it a month. Get people to buy that and then feel like they can recoup their money and then go spend $100 on GTA 6.\" I could see it. Yeah. Yeah. Yeah, I can I It's so hard for me to stomach the idea of GTA 6 coming out this year, but like you're making sense. You're making sense. I'm definitely making dollars cuz also then it's like, oh my god, this because then I guess for me I talking about it, it would have to be like, okay, what would the other reasons be? Yeah, it could be like maybe they really I brought in Marathon as a joke, but maybe it really could have been like we don't want to release next to this thing. It's a similar We think there might be a similar audience there. Looter shooter kind of thing. I know it's a extraction shooter which is different, but you're still looting and shooting with friends, right? Yeah. I mean, that's a good call, right? I mean, I I didn't honestly forgot",
            "start": 1150.32
        },
        {
            "text": "of thing. I know it's a extraction shooter which is different, but you're still looting and shooting with friends, right? Yeah. I mean, that's a good call, right? I mean, I I didn't honestly forgot that Marathon was coming out that exact same day. So, it makes sense that they would try to push it up if they were already ready to go. Let's just push it up and get away from it. Um, but I do hope in my heart of hearts that it is a GTA that we're we're we're doing the big brain thing. I think that was in the beginning of the year when I was talking of like, hey, whenever whatever where wherever Mafia lands and wherever Borderlands lands, we will be able to figure out somewhere around where GTA is coming out. October. Where's where's Mafia? I know it leaked, right? It was like August release date. I think it August 8th. Yeah, they announced it like I think after right after it leaked. Um, so yeah, August 8th. I mean, you're right that it is aligning. Yeah, it is aligning. September. What's",
            "start": 1191.04
        },
        {
            "text": "I think it August 8th. Yeah, they announced it like I think after right after it leaked. Um, so yeah, August 8th. I mean, you're right that it is aligning. Yeah, it is aligning. September. What's after September? Yeah, we have Ghost in the beginning of October and then we have GTA. You know what, Roger, you sold me. I And here's the thing. It's not You not sold me on the fact that it is coming out in October, but you sold me on the fact that like they might be planning on trying to get this thing out in October. We'll see if they actually get it out, but like you I you are making a lot of sense. They could be making it happen. I I don't know. I don't I That's just copium right there. I'm also of the negative Nancy mindset in my heart of hearts. It's like we're never going to see this. Not never. We're not seeing this this year. We're not see GTA. Yeah. I mean, that's where I'm at. I'm I'm full negative Nancy on it. But I will say in the bringing back to the Borderlands conversation",
            "start": 1225.2
        },
        {
            "text": "never. We're not seeing this this year. We're not see GTA. Yeah. I mean, that's where I'm at. I'm I'm full negative Nancy on it. But I will say in the bringing back to the Borderlands conversation cuz you mentioned that like it seems like the vibes are kind of down on this one as far as what it feels like people are are are like feels what people of it all. I want to see the fans. That's where I'm at. I think from the media side and the press side and like the hardcore like you know our audience, right? the people that like listen and take in video game content all the time. I think they're down on it. I It's hard for me to think that's going to translate to the general audience. I think in the way that like people for during Borderlands 3 kept being like, \"Oh, the humor's stale. Oh, we're bored of this.\" Ya ya, right? Like that game still sold a butt ton, right? Like I don't think they're worried about the mi and use's of the world. I think they're worried about the people who always",
            "start": 1267.92
        },
        {
            "text": "bored of this.\" Ya ya, right? Like that game still sold a butt ton, right? Like I don't think they're worried about the mi and use's of the world. I think they're worried about the people who always show up to Borderlands. Borderlands is mainstream as [ __ ] Yeah, like Borderlands supersedes just like the video game core community in a way that like I think even though people are downplaying Borderlands 4, I also think people are underrating Borderlands 4 as far as like how big of a splash that's going to be when it comes out. Now, is it going to be as big as Borderlands 2 and 3? I don't know. I think I I I I think on this in the same breath, I'll say that I could see there being some fatigue there. Like I don't Tiny Tina's Wonder Wonderlands Wonderorlds. Um Wonderlands. I think it is Wonderlands because Wonderorld was the ball game. Yes, sure. The hats. Tiny Tina's Wonderlands came out and I thought that would have had a bigger splash given that that was basically a Borderlands game",
            "start": 1309.28
        },
        {
            "text": "because Wonderorld was the ball game. Yes, sure. The hats. Tiny Tina's Wonderlands came out and I thought that would have had a bigger splash given that that was basically a Borderlands game and I feel like that came and went and so I think it's the branding of it all, right? Like the Borderlands is Borderlands, right? Like calling it something else and getting cute with it didn't help any of it. and just like the weird direction they were going with it worked for a lot of the the niche Borderlands players, but people that are like to me Borderlands is one of those games that I could see like somebody who has a PS5 that buys like three games a year, like maybe a sports game, maybe like potentially a GTA, they could potentially be picking up this Borderlands game. I mean, that's that's who Borderlands is for, right? Like Borderlands 2K is kind of a is a weird company in the fact that like like they produce hits. Yeah. Right. They produce, it's like either Mafia, no offense to Mafia,",
            "start": 1351.04
        },
        {
            "text": "Borderlands is for, right? Like Borderlands 2K is kind of a is a weird company in the fact that like like they produce hits. Yeah. Right. They produce, it's like either Mafia, no offense to Mafia, but they're going to put out a Mafia and then a GTA, right? Civilization. They're Civilization, an NBA 2K, like they put out juggernauts of Borderlands. Um, and I think Borderlands is in that conversation of, all right, I got three games I'm going to buy this year. I'm going to buy NBA 2K. I'm going to buy Call of Duty. And then I'm going to buy Borderlands, right? I'm going to buy Civ. I'm going to buy like WWE 2K. And I'm going to buy Borderlands, right? It's one of those games. Now, we have a lot of super chats. Shout out to y'all. Y'all do the damn thing. Um Jer 7 writes in and says, \"How was Thunderbolts Bless?\" I watched it, too. Yeah, but he's asking me. Can we talk about it? Yeah. Yeah. The reviews are up. Really good. Now, here's the thing. I fell asleep. Fell asleep. Um don't go to",
            "start": 1387.12
        },
        {
            "text": "Thunderbolts Bless?\" I watched it, too. Yeah, but he's asking me. Can we talk about it? Yeah. Yeah. The reviews are up. Really good. Now, here's the thing. I fell asleep. Fell asleep. Um don't go to movies when you're jetlagged, y'all. Uh cuz it's impossible. I tried. It was the loudest theater. the loudest theater you could. Landa literally had her ears like her fingers in her ears trying not to hear how loud this movie was and you fell asleep. I love that for you. I'm a powerful sleeper. Yeah. Yeah. I'll I'll I'll brute force sleep. I love it. Like I I talked to you I talked to night you I talked to Andy yesterday on CF about like the amount of distractions that were on the flight that were like Yeah. Excel spreadsheet. The guy opening up the window. Yeah. And like there's so many just screens and [ __ ] like [ __ ] flashing my face. 2025, you I'm 20 25, you know, people just doing whatever. I forced sleep through that, though. Good for you. You know what I mean? Two hours in, I",
            "start": 1431.84
        },
        {
            "text": "screens and [ __ ] like [ __ ] flashing my face. 2025, you I'm 20 25, you know, people just doing whatever. I forced sleep through that, though. Good for you. You know what I mean? Two hours in, I locked in. I just fell asleep in the middle se my neck like this. Um, no, I'm just I'm listening to R&B. I have a I have like a R&B playlist. Thunderbolts. No, Thunderbolts. I tried to stay awake. I tried my hardest and like and I I I was in and out. Yeah. But then like a thing happened in the middle of the movie that had me all the way awake and I had me locked in and I was like, \"Yo, this is like I it it [ __ ] it [ __ ] with my sleep.\" Like that's how good it was. Thunderbolts was so good that it [ __ ] That's how you actually review all your movies. If it wakes you up, then it's good. Yeah. I like I caught the whole second half of that [ __ ] and that [ __ ] was fire. Yeah, that's a great movie. It's a great movie. It's one of my favorite MCU movies. Probably top 10. Probably top 10.",
            "start": 1475.68
        },
        {
            "text": "I like I caught the whole second half of that [ __ ] and that [ __ ] was fire. Yeah, that's a great movie. It's a great movie. It's one of my favorite MCU movies. Probably top 10. Probably top 10. Wow. Um let me see if I can find some Borderlands things in here cuz I know y'all are riding it with them. Um let's see here. He said about the guns, you know. I mean, what's up with guns? I mean, oh, you're going to get all the guns. So many guns. Jay plays casual writes in says, \"hm, take two moving up BL4 release makes me think they are making room for GTA 6 possible October release.\" Of course, we talked about that earlier. Come on, bro. I'm locked the [ __ ] in. Um, Gondor's Condor says, \"What do you think impacted Borderlands image harder, the third game or the movie?\" I And I think here's the thing, right? I don't think the third game impacted Borderlands's image, but I think it's more so a conversation of I bring it back to Tiny Tina and the Borderlands movie and Tales from the",
            "start": 1515.04
        },
        {
            "text": "the thing, right? I don't think the third game impacted Borderlands's image, but I think it's more so a conversation of I bring it back to Tiny Tina and the Borderlands movie and Tales from the Borderlands, too. We forget that happened. Oh, yeah. We literally forgot that entire thing happened. The second one came out. I look at those as like more canaries in the coal mine of are those signs of Borderlands not having it or were those just not up to par as far as like what we expect out of mainline Borderlands content? Also, where does Randy Pitchford land in all of that as well? Sure. I mean, you know me, I'm number one Randy Pitchford. I know that like people barely know him, but I feel like there's definitely like a [ __ ] man. Ah, god. Jump scare. Andy pitcher. It's one of those things where you know when I I look at so many causes and so many people like Bobby Here's the thing. I look at like a Bobby Kotic for example, everybody already hates Bobby Kotic. And so I'm like my my",
            "start": 1547.12
        },
        {
            "text": "where you know when I I look at so many causes and so many people like Bobby Here's the thing. I look at like a Bobby Kotic for example, everybody already hates Bobby Kotic. And so I'm like my my natural response is like I'm going to go the opposite. Who's somebody that people don't question or hate enough? And I look at Randy Pitchford and I'm like, did we forget all of the news stories from like 2019 about Randy Pitchford? We're putting him in every single presentation. I'm here watching the Nintendo Switch Todd Direct and Randy Pitchford pops up and I'm like, \"Did y'all not forget the USB?\" He did. Somebody forgot the USB. Um, uh, yeah. Yeah, that's the weird Randy Pitchford at all is weird because you could clearly tell the vibe of like he just very much wants to be the guy associated with this, even though I'm assuming people the the PR people are like, \"Maybe not, maybe not this time.\" But he's like, \"No, I I got to be the guy that's doing the video that's telling everybody",
            "start": 1590.32
        },
        {
            "text": "with this, even though I'm assuming people the the PR people are like, \"Maybe not, maybe not this time.\" But he's like, \"No, I I got to be the guy that's doing the video that's telling everybody everything about Borderlands, right?\" Um, yeah. I don't know. When it come when it comes to like Borderlands as a whole and as a franchise, I think we've realize that Borderline Borderlands is a franchise when it's 1 2 3 4, right? You can't you can't expand past that, right? Like I don't think there is a world where we can make a movie that's great and exciting that gets people energized to go to the theater. we can't make, you know, the Tales from the Borderlands anymore because Tales from the Borderlands was very much a very specific time and place when Tailtale was on [ __ ] fire and they could have made anything and everything and we would have bought it and played it and been excited about it. Uh yeah, that just came at the right time. We can't do it again now. Uh Borderlands 4, I think,",
            "start": 1640.16
        },
        {
            "text": "have made anything and everything and we would have bought it and played it and been excited about it. Uh yeah, that just came at the right time. We can't do it again now. Uh Borderlands 4, I think, is still going to be successful. It's still going to be good. People are going to like it. It's going to make millions and millions of dollars and be profitable. Uh we just can't do another Tiny Tina for a very very long time. Probably if ever. Um yeah, I'm looking forward to the thing tomorrow. I'm looking forward to the presentation. Like I'll say I Borderlands is one of those games that I play as a like almost like a I need to relax like chill like game. Podcast game. Yeah. Something to do in the background. Something that me and my friends can do while we're just hanging out on Discord chatting and like it's background noise to me and I I [ __ ] with games that are background noise, right? Like so many games are that and I love games that are that and Borderlands has been such a great",
            "start": 1675.2
        },
        {
            "text": "and like it's background noise to me and I I [ __ ] with games that are background noise, right? Like so many games are that and I love games that are that and Borderlands has been such a great one of those and like I think there's something to be said about you know how good the action is in Borderlands, how many guns they're able to fit in that [ __ ] right? Like like I don't know why I said it like that. I'm sorry. I need to change the music I'm listening to cuz damn. Um, but yeah, like Borderlands I think has so much going for it and I think the job they have to do with the presentation tomorrow and with the marketing style cycle up to it is remind people what Borderlands is and remind people that like hey you guys like Borderlands like here like here's all the stuff you put the best five jokes you got in there. Focus mostly on gunplay. Focus mostly on the traversal and the new worlds and all the new loots and just keep it simple. And if the if the writing is really good like",
            "start": 1717.04
        },
        {
            "text": "five jokes you got in there. Focus mostly on gunplay. Focus mostly on the traversal and the new worlds and all the new loots and just keep it simple. And if the if the writing is really good like that's awesome. Save that for the full game, right? I don't think you need you don't need specifically in the state of play any type of uh remotely cringe humor that someone can take off out of context and post on Twitter and be like look at [ __ ] Borderlands look how you know what I mean like just focus on the gunplay focus on how cool everything is and then put the game out and people will buy and put some really good dubstep in the trailer. Oh yeah, I like that. Borderlands 2 had some really good dubstep. That was Roger. We got breaking news. Whoa. But before we talk about it, I want to talk to you about patreon.com/confunny and youtube.com/confunname where you can go and get the kind of funny membership which allows you to get shows ad free. And speaking of ads, let us tell you about our",
            "start": 1758.16
        },
        {
            "text": "you about patreon.com/confunny and youtube.com/confunname where you can go and get the kind of funny membership which allows you to get shows ad free. And speaking of ads, let us tell you about our sponsors. This episode is brought to you by Imperial. We have told you all how important it is to developers that you wishlist the games you're interested in. So, if this sounds cool to you, make sure you wishlist it. I can't tell you how much it helps. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the",
            "start": 1794.96
        },
        {
            "text": "different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. You'll need to make sure you have the right gear to take on the harder cardigrams. Build your mercenary, choose your gear, master your abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses and seek out secret paths to find bigger and better loot. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready mercenaries, the monolith awaits. Imperial is available May 8th on PC, Xbox Series X and S, and PlayStation 5. Wish list now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraf Frames.",
            "start": 1838.8
        },
        {
            "text": "the monolith awaits. Imperial is available May 8th on PC, Xbox Series X and S, and PlayStation 5. Wish list now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraf Frames. If you haven't called your mom in a while, here is your reminder to do it. But if you want to go above and beyond, beyond. Mother's Day is coming up and I have the perfect gift idea. Aura frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preloaded with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Me, Kevin, and a ton of people at Kind of Funny are obsessed with our Aura frames. It takes about 2 minutes to set up the frame using the Aura app. Aura frames were named the best digital photo frame by Wire Cutter and featured in 495 gift guides last year. I counted. Aura has a great deal",
            "start": 1882.24
        },
        {
            "text": "about 2 minutes to set up the frame using the Aura app. Aura frames were named the best digital photo frame by Wire Cutter and featured in 495 gift guides last year. I counted. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting oraframes.com to get $35 off plus free shipping on the bestselling Carver Matte frame. That's a rafra.com. promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. And we're back with breaking new. Mike, what are you doing out here? Yeah. Mike, what are you doing out here? Mike just come. Mike just come. Mike just comes into the room during the ad break and just stands there like a dad. Like a dad. I just wanted to come hang out with the boys. You know, you guys got the coolest thing going on. That's all. And we missed you. Bless. You were gone for a whole week. I missed you a lot. I I saw the Reddit post and I was like, \"Damn, Roger doesn't have lunch with",
            "start": 1928.72
        },
        {
            "text": "got the coolest thing going on. That's all. And we missed you. Bless. You were gone for a whole week. I missed you a lot. I I saw the Reddit post and I was like, \"Damn, Roger doesn't have lunch with me anymore, so I miss him.\" We've never had lunch together. Like, we we would never do that consistently. You never do that anymore with him anymore. It's [ __ ] up. [ __ ] up. I'm glad Mike noticed it, too. Have you driven into work with him? Roger. But Roger doesn't have lunch with me either, Mike. That's so Sometimes I do when you have extra fries. Yeah, when I have extra fries. It's usually me walking back to my desk and being like, \"Y'all got fries on the table if you want some.\" That's the best days ever, too. When you when when I have leftover fries. Yeah, especially from the the taco truck across street when you get a hot dog. Oh, yeah. But like the fries aren't that good though. Ah, don't worry about it. Roger just loves fries. Uh, we got breaking news. Apex Legends and Star Wars",
            "start": 1974.0
        },
        {
            "text": "across street when you get a hot dog. Oh, yeah. But like the fries aren't that good though. Ah, don't worry about it. Roger just loves fries. Uh, we got breaking news. Apex Legends and Star Wars Jedi dev Respawn cancels another incubation project and lays off an unknown number of individuals again. I am pulling from Rebecca Valentine at IGN. EA has canled another incubation project at Respawn today and simultaneously laid off an unknown number of individuals across its incubation, Apex Legends and Star Wars Jedi teams. IGN has learned in a post today from the studio. Respawn announced uh it has quote made the decision to step away from two early stage incubation projects and make some targeted team adjustments across Apex Legends and Star Wars Jedi. One of these canceled incubation projects is the same one already reported uh on uh back in March. Raj, do you happen to have the article open? Uh no, I do not. Okay, I want to let I'm going to tab over because they highlight they do like",
            "start": 2006.48
        },
        {
            "text": "is the same one already reported uh on uh back in March. Raj, do you happen to have the article open? Uh no, I do not. Okay, I want to let I'm going to tab over because they highlight they do like um a hyperlink to the thing. It was a multiplayer FPS incubation project. Uh, this was from early March. Gotcha. And there were layoffs with that as well. Um, I don't know if that was one of the rumored Titanfall project. I was I was on that. I was hosting that games. I believe that that was originally going to be a Titanfall thing and then they stopped doing that and then they tried to like fracture take all the fractured pieces of that and make that in its own game and then they cancel that. Gotcha. Okay. So, that's what they're talking about here, right? Okay, so one of these canceled incubation incubation projects is the same one already reported on in March being this one that we're talking about. Quote, \"These decisions aren't easy, and we are deeply grateful to every teammate",
            "start": 2050.4
        },
        {
            "text": "incubation incubation projects is the same one already reported on in March being this one that we're talking about. Quote, \"These decisions aren't easy, and we are deeply grateful to every teammate affected. Their creativity and contributions have helped build Respawn into what it is today.\" The post continued, \"We're offering meaningful support to those impacted, including exploring new opportunities within EA.\" End quote. IGN understands that Respawn currently employs roughly 100 individuals and those affected by the changes include a mix of developers, publishing, and QA workers on Apex Legends, as well as smaller groups of individuals on the Jedi team and on the incubation projects. IGN also understands that at least some, though not all, of the developers from the incubation project reported on in March have already been moved to work on Iron Man at EA Motive. When asked, EA declined to comment on the exact number of individuals impacted, saying it is offering impacted",
            "start": 2092.08
        },
        {
            "text": "project reported on in March have already been moved to work on Iron Man at EA Motive. When asked, EA declined to comment on the exact number of individuals impacted, saying it is offering impacted individuals 30 days to find new opportunity to find a new opportunity inside the organization and is endeavoring to find roles for as many individuals as it can internally. Internally at Respawn, work will continue on Apex Legends and the next entry in the Star Wars Jedi franchise, as well as supporting the upcoming bit reactor Star Wars game, Star Wars Zero Company. EA declined to say whether or not any other incubation projects are currently in the works. In addition to these changes, Respawn FCPO operations Daniel Suarez is being elevated to general manager of Respawn and will report directly to Vince Zampella. Previously, Zampella served as GM of Respawn, the studio he founded in addition to his role as head of the Battlefield franchise. Zampella will continue as group GM and EVP",
            "start": 2131.84
        },
        {
            "text": "to Vince Zampella. Previously, Zampella served as GM of Respawn, the studio he founded in addition to his role as head of the Battlefield franchise. Zampella will continue as group GM and EVP overseeing both Battlefield and Respawn. Notably, just last February, EA told investors that Apex Legends was quote, \"not headed in the direction that we have wanted end quote and hadn't been for some time.\" CEO Andrew Wilson said that Respawn is currently working on a major update dubbed Apex 2.0. Quote, \"Our expectation is that Apex will also be one of those franchises in that sometime on a longer term time horizon, uh, there will be an even bigger, more meaningful update to that broader game experience, an Apex 2.0, if you will. This will not be the final incarnation of Apex. Wilson said uh these changes continue a trend at EA of canceled projects, layoffs, and restructuring that's been going on for several years now. Um and they go on about how it began in 2023. Uh Roger, hi. A lot to chew on",
            "start": 2176.08
        },
        {
            "text": "continue a trend at EA of canceled projects, layoffs, and restructuring that's been going on for several years now. Um and they go on about how it began in 2023. Uh Roger, hi. A lot to chew on there. What's your immediate reaction to this news? My immediate reaction is uh going off of what we talked about uh in March about the cancelled incubation project that actually I misspoke. It was a Star Wars thing that they were working on and then they canceled that and then they were trying to take the pieces of that and make that into something and then they canceled that whatever. Gotcha. Um the they specifically Respawn is trying to find its identity in a third pillar, right? Like we have Apex, we have the Jedi stuff and they're trying to find that other thing and it's not working out. And I wonder what that could be, but I don't think they even know what it is, right? And that's the that's the pitfalls of creating something so massive as Apex Legends that was so huge is still still huge",
            "start": 2223.52
        },
        {
            "text": "wonder what that could be, but I don't think they even know what it is, right? And that's the that's the pitfalls of creating something so massive as Apex Legends that was so huge is still still huge but the next thing isn't growing necessarily. Exactly. It is stagnant and people even Ubisoft sees the blood in the water. Right. Like there was that report recently where they're like oh well Ubisoft sees that Apex number uh Apex Legends numbers are kind of stagnant. Maybe we can come in with a battle royale. Sure it's not going to work. But either way there is that energy of like Apex was the thing and now it's kind of falling off a little bit. So what how can we build this up? make it a new thing or potentially find that third pillar. And that's what Respawn is struggling with right now. And it's it's such a weird thing, right? Because Respawn is such a successful side of EA. They have the Jedi games, which are not only critically successful, but financially successful. They do very,",
            "start": 2266.32
        },
        {
            "text": "And it's it's such a weird thing, right? Because Respawn is such a successful side of EA. They have the Jedi games, which are not only critically successful, but financially successful. They do very, very well. And then you have Apex Legends, which has done amazing over the last decade or so, right? When did that game come out? 2019. February. Jesus. Okay. Well, wow. I thought this game was way older than it was, but whatever. I mean, that's six years though. Yeah. Well, coming up on a decade then. Yeah. um better half a decade. So now we're trying to figure it out and it's it sucks that they are trying different things and it's not working out and that results in job losses and people being taken out of respawn and put into the Iron Man game and I I just want them to succeed and maybe good enough should be good enough. I don't know is Apex is Apex having Apex and then having the Jedi games that should be enough for a studio but they're they're keep on trying to find that next thing.",
            "start": 2304.0
        },
        {
            "text": "enough should be good enough. I don't know is Apex is Apex having Apex and then having the Jedi games that should be enough for a studio but they're they're keep on trying to find that next thing. I don't know. Barrett, what's up? Yeah, similar with Rogers. like do we need to constantly like grow and expand and all this stuff? Like if you have two stable kind of like sources of income in terms of releasing a big AAA blockbustery type uh game in terms of the the Star Wars games and then you have like this uh thing that might have fallen off a little bit in terms of other battle roy but it's still probably doing numbers in some way shape or form. Uh you can correct me if I'm wrong there. I don't know. just like Apex Legends has 119,000 people playing it right now. Yeah. Just on Steam. Yeah. And so like this all always goes back to, you know, number always needing to go up and skyrocket and all that stuff. Um I can tell you what that third pillar is not going to be. And I swear to [ __ ]",
            "start": 2343.68
        },
        {
            "text": "And so like this all always goes back to, you know, number always needing to go up and skyrocket and all that stuff. Um I can tell you what that third pillar is not going to be. And I swear to [ __ ] God, the next person who leaks or reports on Titanfall 3 being ready and coming next out next year, it's on site. It's on It's on site. It's on [ __ ] site. I swear to God. Yeah. I mean to what you guys are saying, you know, I think the thing that jumps out at me is um IGN understands that Respawn currently employs roughly 100 individuals, right? And like when you have a studio of 100 and Apex plus the Jedi games coming out isn't enough to support and sustain that, it's like, wow, what is going on here, right? Like is that a a sign of what the industry is right now? Is that a sign of overexpectations from EA as far as what Respawn um is supposed to produce for them? Is it like mismanagement of yeah what Apex is bringing in right like we talk about those high player numbers and it being I",
            "start": 2388.24
        },
        {
            "text": "from EA as far as what Respawn um is supposed to produce for them? Is it like mismanagement of yeah what Apex is bringing in right like we talk about those high player numbers and it being I think all usually in the conversation of the top three top five battle royals at uh uh at any given time in the last six years right like they have so much going for them at Respawn and they have so much I think like latent potential and I I part of me wonders if they see that in themselves and go and are going yo if we can just put out a Titanfall 3 or if we can just put out a multiplayer Star Wars shooter or if we can just put out like XYZ thing, it'll turn us into like EA's golden child. Like for real, even though so many people already see them as that. And even though I think like they kind of have been that already between the the projects they're doing, but like I think they're in a weird place because of the both the stagnation of Apex, right? Those numbers aren't growing growing growing",
            "start": 2434.56
        },
        {
            "text": "been that already between the the projects they're doing, but like I think they're in a weird place because of the both the stagnation of Apex, right? Those numbers aren't growing growing growing growing anymore. And then also you talk about the success of the Jedi games, but when you're looking at that, that is still a licensed thing that I'm sure um chunk. Yeah, Disney is probably getting a huge chunk of that money and so maybe you're just not seeing the return that you expect to see from it. I think they're just probably in a in a weird place as a company right now trying to figure out like, all right, what is going to be our golden goose that we completely own that we completely own and that is on the growth trajectory as opposed to like something that feels like it's evened out. Yeah. Yeah. I it's it's it's tough, right? because I don't it doesn't seem like any of the incubation projects from what I've heard or what I've seen rather is single player, right? They are they're going",
            "start": 2482.16
        },
        {
            "text": "Yeah. I it's it's it's tough, right? because I don't it doesn't seem like any of the incubation projects from what I've heard or what I've seen rather is single player, right? They are they're going fully for that multiplayer, right? They're trying to replace not replace but they're trying to find that other apex. This is the next Apex next Apex, right? So, they are they are fully focused on their single player endeavors on just Jedi, which is admirable and that makes a lot of sense and especially if you look at the pantheon of what EA is doing in terms of licensed stuff. I mean, they have Iron Man, they're making that Black Panther game, right? like they're making a lot of uh licensed single player IP video games. So trying to find that next uh Apex makes a lot of sense, but I don't know, man. I just I would much rather be interested. I think that's probably the direction they're going to go in, right? Is probably probably going to do Apex 2 or Apex 2.0 or whatever they call it, you",
            "start": 2521.04
        },
        {
            "text": "man. I just I would much rather be interested. I think that's probably the direction they're going to go in, right? Is probably probably going to do Apex 2 or Apex 2.0 or whatever they call it, you know, Rainbow Six Siege X, you know, whatever the the light sequel that they're going to end up doing here, but it's going to be the same client, the same game. that is much more exciting to me as a lapse to Apex player uh rather than seeing them kind of split their resources with a small team right here. Um and I'm seeing a little conflicting reports here cuz I it said 100 people but then I also saw that Grub tweeted that the layoffs sound like they're about a thousand people. So I don't know what's happening there. I and also that like I think it's a typo. Even if he means the layoffs are around a 100 people, isn't that still the entirety of Respawn? But maybe the the I don't know who's the typo. Oh, you think IGN might be the typo? Well, I don't think Respawn employs a thousand people. I",
            "start": 2558.16
        },
        {
            "text": "a 100 people, isn't that still the entirety of Respawn? But maybe the the I don't know who's the typo. Oh, you think IGN might be the typo? Well, I don't think Respawn employs a thousand people. I I'd be shocked if they employ a thousand people. U and if and if they laid off a thousand people at once, like if you're talking about that, then you're talking about across EA or something. It says about 100 people. So, so I think that's a typo. And also like I don't Yeah, if they're re if they're laying off 100 people from Respawn, this this is a different news story. This is the studio shutting down. Yeah. Um, and so maybe let's just wait and see on that one. I could also say maybe he's being uh the homie Cameron Abbott in the chat says they have about 300 people respond. Gotcha. So yeah third though. That's crazy. Yeah. No, that's still a [ __ ] insane number of people. 315 from 2019 is what uh the Wikipedia article. So maybe it's larger than that now. I don't know. Yeah. Either way, of",
            "start": 2597.28
        },
        {
            "text": "though. That's crazy. Yeah. No, that's still a [ __ ] insane number of people. 315 from 2019 is what uh the Wikipedia article. So maybe it's larger than that now. I don't know. Yeah. Either way, of course, this is breaking news and so information is coming in all at once and so um we'll wait and see on the final information, the final facts coming in. But either way, really sad news. Respond's one of those studios that I would say deserves better and like one of those studios that is one of the most talented in the industry and it hates I hate to see [ __ ] like this happen with them because the the because the money is not adding up in a way where it's like, man, you're not doing the studio justice. like a Apex plus the Jedi games should be doing. And I'm just so scared of like Battlefield, right? Vince Ampella is splitting his time between Respawn and Battlefield, right? He's heading up the new Battlefield project and team if Battlefield doesn't work, right? There's even more",
            "start": 2641.76
        },
        {
            "text": "right? Vince Ampella is splitting his time between Respawn and Battlefield, right? He's heading up the new Battlefield project and team if Battlefield doesn't work, right? There's even more pressure on Respawn to now [ __ ] hit, right, to actually re redo uh Apex and make something new. Yeah. I mean, the we can have this conversation probably in like another episode or like maybe it's a whole Games cast, but like it's one of those things where sure if Battlefield doesn't work, then the eyes get put back onto a Apex and Respawn. But I also think that's vice versa, right? Like if Apex isn't funding the rest of the company, then how much is it of how much of EA is looking at that and then looking back at the Battlefield Studio? Or how much of it is like, all right, we got FIFA or sorry, EFC. EAFC can't fund everybody. You know what I mean? Like EA is a company that has big expectations because their biggest money makers are the biggest things in the world are the biggest things in the",
            "start": 2679.68
        },
        {
            "text": "EAFC can't fund everybody. You know what I mean? Like EA is a company that has big expectations because their biggest money makers are the biggest things in the world are the biggest things in the world. And so when we have FIFA that is do that is doing it big for us. And then we had Apex that was going up up up and like starts to temper out. I think as EA you start looking at uh Respawn a little bit different like all right well you know get that money back up like we were making FIFA bucks over here. Like what do you let's let's do something about it. Um, tough. Real tough. But yeah, we'll we'll have more of that conversation as the days go and as more news comes out with this one. Let's move on to story number two. Platinum Games is seemingly hiring for another online action game. This is Chris Scolon at VBC. Let's go. Platinum Games is seemingly working on another online action game. According to a new job listing, the listing, as spotted by Tech for Gamers, is for a game game",
            "start": 2721.12
        },
        {
            "text": "is Chris Scolon at VBC. Let's go. Platinum Games is seemingly working on another online action game. According to a new job listing, the listing, as spotted by Tech for Gamers, is for a game game designer for an upcoming new title, suggesting it's still in the early stages of development. While the majority of the job listing from the Bayonetta Studio features the typical requirements expected of any game designer role, there are two points in the desired skills section that appears to suggest that the game will have online elements. According to the listing, the ideal candidate for the role will have quote experience in online action game development and experience in stage composition for online or open field games end quote. Both points seem to point to an action game with an online openw world element, which is particularly notable given that Platinum's last attempt at such an experience was a flop. Babylon's Fall, released in 2022, uh was an online action RPG, which was widely",
            "start": 2765.44
        },
        {
            "text": "openw world element, which is particularly notable given that Platinum's last attempt at such an experience was a flop. Babylon's Fall, released in 2022, uh was an online action RPG, which was widely panned by critics when it launched and struggled to attract an audience. Platinum is currently collaborating with Team Ninja on the upcoming Ninja Guiden 4. Roger, here's what I'll say. Tell me. I over the years now of talking about video games, working on kind of funny and like making friends with the industry, right, have learned that job postings like this, you can't read too into this. Oh, okay. Uh mainly because the quote the like the writing of we are we're looking for an exper we're looking for a candidate that has experience in online action game development and experience in stage composition for online or open field games doesn't always mean we are making an online action game or making a game with online in it or whatever open field open field. Sometimes it means that you had",
            "start": 2809.92
        },
        {
            "text": "for online or open field games doesn't always mean we are making an online action game or making a game with online in it or whatever open field open field. Sometimes it means that you had somebody on the team that had that experience that left and we want to replace that role and it's ideal to have somebody on the team that like can fill in those those things. Good to know. Yeah. And like that was a conversation I had with somebody who worked at a studio who had a similar thing with like you know they had an online Yeah. news articles would be like oh they're doing an online thing cuz everything says online. And in conversation with them they're like yeah usually people interpret it this way but yeah sometimes people leave and we just got to back fill those positions and we don't know. It's good to have somebody with that specific, you know, skill set just in case or Yeah, it brings an expertise level. That's interesting. Oh, I never thought about that. Okay. Yeah, there's like a",
            "start": 2855.28
        },
        {
            "text": "It's good to have somebody with that specific, you know, skill set just in case or Yeah, it brings an expertise level. That's interesting. Oh, I never thought about that. Okay. Yeah, there's like a little bit of and that's thing is like it could be the little bit of chance of no, they are making another online thing. Maybe Babylon's fault. I think it's different if you see one and it's like, oh, they're they're they're hiring for five different positions and they're all using they need people with Unreal Engine 5 specifically in multiplayer experience. That's different. But like one role, I guess. I mean, so like that's that's how I read it. That said, like let's be on the lookout because let me tell you, if Platinum Platinum, if Platinum is like, yo, we're we're back. We're making we're making we saw the crossroads and one of the crossroads said we partnered with Yokotaro for a new near game and the other crossroads said Babylon's Fall 2 when we went to Babs. Oh man, you're going to",
            "start": 2893.84
        },
        {
            "text": "making we saw the crossroads and one of the crossroads said we partnered with Yokotaro for a new near game and the other crossroads said Babylon's Fall 2 when we went to Babs. Oh man, you're going to see me on another level. All right, we're up. Platinum makes some of my favorite games, but they also make some they've been on kind of a kind of a weird tear in the last few years. I feel like they've lost a little bit of that identity. Uh well, they got Ninja Gotten 4 coming up. Sure. But I mean, if you look at the last 2017 Near Automata, then they had Astral Chain, uh Wonderful 101 Remastered, World of Demons, I don't know what that is, an iOS game, Soul Cresta, I forgot that one, Babylon's Fall, Bayonetta 3, Bayonetta Origins, and then they have Ninja Gaiden 4. I mean, most of those games are good. Sure. Yeah. Now, give me another near. I miss near. Yeah. Yot. Somebody get Yokatara on the phone. Put him to work. Come on. Uh, speaking of men to put to work, story number three, Sam",
            "start": 2930.24
        },
        {
            "text": "are good. Sure. Yeah. Now, give me another near. I miss near. Yeah. Yot. Somebody get Yokatara on the phone. Put him to work. Come on. Uh, speaking of men to put to work, story number three, Sam Lake would like to make a Mman's game and write a novel after he retires. This is Jordan Midler. I care about only the Mumens. The Mummans. Sam Lake. And I know like we've seen these guys. I've seen this guy with the meme with a knife. Can we pull up the meme with the knife? Yes, Barry. I can pull up a knife meme of a woman. Sam Lake has shared some of the projects he'd like to work on in the future, as well as the franchise he'd love to work with. Yeah. You know what? Yeah, I see what Sam Lake's talking about. I want Sam Lake to make a game, but I want the knife to be I want the knife to be the main weapon. Uh Sam Lake has shared some of the projects he'd like to work on in the future, as well as a franchise he'd love to work with, the Finnish children's characters, the Mumens. Lake said that",
            "start": 2972.88
        },
        {
            "text": "weapon. Uh Sam Lake has shared some of the projects he'd like to work on in the future, as well as a franchise he'd love to work with, the Finnish children's characters, the Mumens. Lake said that Remedy Entertainment, the Finnish developer at which he has worked for 30 years, was a detour to his dream of novel writing. Yeah. Quote, \"I'm hoping that I'll get the chance uh once I finally retire from making games to still do creative work and have smaller, more personal projects, but not yet,\" Lake told the Game Business. Lake also joked that although his recent spate of lifetime achievement awards has been an honor, he has plenty more to contribute to the video game industry. quote, \"There's a slight feeling of,\" are you trying to tell me something? Am I done? Have I peaked? Are you telling me, \"Okay, run along now, but no, I still have a lot of passion and ideas.\" End quote. He's so goated. Lake is currently working on multiple games at Remedy, including an unannounced project which",
            "start": 3015.76
        },
        {
            "text": "me, \"Okay, run along now, but no, I still have a lot of passion and ideas.\" End quote. He's so goated. Lake is currently working on multiple games at Remedy, including an unannounced project which he will direct. Lake was also asked which franchise outside of Remedy's lineup he would like to work on. His answer was The Muins. The Mumins are the main characters in a series of children's book by Finnish writer and illustrator Tove Jansen. The franchise has spawned two theme parks. Mumen World uh in Nonali Finland. Please tell me the other one's Muin Land and Akabono Children's Forest Park in Saitama, Japan. Oh, that's sick. This is just this one building. All I see is this one [ __ ] building. Yeah, but I can't say that that's a [ __ ] amusement park. The building's bigger on the inside than it looks on the outside. It's like a tardis situation. Okay. Um Whoa. That's so [ __ ] scary. Look at that. That guy. Holy [ __ ] Is that a chicken nugget? We don't. Hey, calm down on the",
            "start": 3054.64
        },
        {
            "text": "inside than it looks on the outside. It's like a tardis situation. Okay. Um Whoa. That's so [ __ ] scary. Look at that. That guy. Holy [ __ ] Is that a chicken nugget? We don't. Hey, calm down on the movementsman's Barrett. Come on. The movement community will not say for he's chicken nugget shaped. You can't you can't deny that. I [ __ ] with this man. I [ __ ] with Sam Lake. Sam Lake like he's goated. I feel like Sam Lake is the older Finnish version of Roger. Oh yeah. Where it's like Ro I can see way way more successful and smarter. But yeah. Yeah. But like you know you you had to give him time. You'll get there. You know what I mean? You're successful so far. But like I could see you giving this interview in about 20 years and just being like Garfield. Kind of funny was a detour of me. It was a detour from my actual dream. Yeah. And yeah, you were like, I want to make a Garfield video game. I want to I want to make the Garfield podcast. A dude. But one day, one day. That's what",
            "start": 3097.92
        },
        {
            "text": "me. It was a detour from my actual dream. Yeah. And yeah, you were like, I want to make a Garfield video game. I want to I want to make the Garfield podcast. A dude. But one day, one day. That's what That's what I'm thinking about. I I love this. I love this interview. And yeah, talking about the movement of it all. Like that is this this was actually a question that I was going to ask him. not about Mumens, but like I was going to be like, \"Hey, if you were to do something outside of I outside of Euron IP, would you what would it be?\" But I felt that was a little bit like you could have got you could have gotten the scoop first is what Yeah, I know. But like I was like I was like, \"Ah, do I want to ask that question?\" Cuz I feel like that's like, you know, they're making so so many amazing original stuff that I just wanted to focus in on that. Uh, but I'm glad that his answer was something like this and not like Batman or whatever. Like this is such a perfect What would your response",
            "start": 3140.72
        },
        {
            "text": "original stuff that I just wanted to focus in on that. Uh, but I'm glad that his answer was something like this and not like Batman or whatever. Like this is such a perfect What would your response be if you were if you were to ask Sam Lake like you know you're interviewing? Oh, you know exactly what it would be. What the [ __ ] are Mins? Like you're like cuz you're talking to him to talk about Island Wake 2 and Control and Max Pain and would you have the nerves enough to take a rest stop at Mu Town in the middle of that interview? Yeah, I think I would. I think I would. I would be like what? No, but here's the thing. I was with Greg. He would if if 50/50 on Greg cuz Greg might absolutely know ex everything about Mumens. He might be locked in on the Muin culture. He might know everything about it. I don't know what's going on. or he would just immediately go what the [ __ ] movements and then we would be like bear pulp movements and we would just Kevin was running that. So then it",
            "start": 3173.76
        },
        {
            "text": "about it. I don't know what's going on. or he would just immediately go what the [ __ ] movements and then we would be like bear pulp movements and we would just Kevin was running that. So then it would be Kevin be like I know the movements. I think for me for me I just think about the jaw drop of like I look Sam Lake like like dead serious in the face and I'm like yeah what do you want to work on that's outside of your IP? You're such a renowned like aur you made these really cool sci-fi horror like cool vibe like what's what's next for Sam Lake? and he looks at me and he's like moving moving and he just stops at that and I'm like and I'm sitting there like okay I love I love the written interviews because you we all imagine that he's saying it so straight face but we I've interviewed Sam Lake I know he's laughing during this I know he's like like oh you know what actually movements like and he's like making a joke about it I like he's not actually fully serious about I love this Sam",
            "start": 3211.84
        },
        {
            "text": "Lake I know he's laughing during this I know he's like like oh you know what actually movements like and he's like making a joke about it I like he's not actually fully serious about I love this Sam Lake and Benstar are two of the most accessible people in the industry cuz I I just see them places you know what I mean I was at I think it was um either Summer GameFest or like the Game Awards where I pull up to the Giant Bomb like couch thing that they do and in the building Sam Lakes is chilling. Yeah. He's like hanging out with Lucy James and I I pull up to Sam Lake and he's like, \"Hey, Blessing.\" And I'm like, \"Hey, Sam. How's it going?\" And like just chatting. What up, Sam? Just chilling. You know what I mean? I've se I feel like I've seen him like three times since then and he's always just like just at a random just at a random lucky grocery store. You know what I mean? It's like why are you in Daily City? Like what's up? Like the people who I see randomly the most are um Sam",
            "start": 3252.0
        },
        {
            "text": "just like just at a random just at a random lucky grocery store. You know what I mean? It's like why are you in Daily City? Like what's up? Like the people who I see randomly the most are um Sam Lake. Uh, I won't say Ben Star cuz Ben Star I don't see randomly like Ben Star I see with purpose. Uh, and then Cleo Thomas from holes. Have I told you about how I randomly run into Cleo? You have. That's crazy. He's just everywhere. Um, we got some super chats in from I'll just read one from Mad Rock. You are dragging this topic. Okay. You didn't tell us anything about Mumens. We're trying to get to the [ __ ] bottom of it. We're We're journalists here. Sorry. We're doing our job. Also, did I not say at the top of the show it's a slow news day? Like what do you want me to do? We have to go an hour. We legally have to do this and I'm happy. We have to talk about We have to talk about Muins and we promised at the top of the show. Yeah, we did. We did tease it at the top of the show, so we had",
            "start": 3289.44
        },
        {
            "text": "We legally have to do this and I'm happy. We have to talk about We have to talk about Muins and we promised at the top of the show. Yeah, we did. We did tease it at the top of the show, so we had to talk about it. Um, Mad Rocks writes in with a question about the previous news story. They say Yokotaro is too Oh, this isn't a question, but he says, \"Yotaro is too busy getting the bag by putting 2B in random gachas to make a new game blessing.\" [ __ ] yeah. Uh, Roger. Yeah. If we can get 2B back in an actual video game, or not even 2B, just get me near. The near franchise. Yeah, that'd be huge. That'd be so big. But if I wanted something smaller, say the tiniest news I needed to know about, where would I go? You go to our last story, the Wii News Channel, where we cover all the small news items you need to know about. Story number four. I always get so nervous before I do it, too. I don't know why specifically this, cuz I just never memorize it. Like, I just want to memorize it. I mean,",
            "start": 3328.0
        },
        {
            "text": "you need to know about. Story number four. I always get so nervous before I do it, too. I don't know why specifically this, cuz I just never memorize it. Like, I just want to memorize it. I mean, I still just read it. Do you memorize it? Like, do it. You'd go to our last story, the Wii News Channel, where we cover all the small news items you just know about. Yeah. So, I guess I do have it memorized. I honestly have me I guess I have most of the show memorized. I just read it anyway just for good measure, you know, make sure cuz then I can focus on the delivery. Oh, cuz the audio listeners don't know I'm reading. I like this what you just did there. Delivery. The delivery. Delivery. The auto listeners probably do know I'm reading. Store number four is the Wii News Channel. Uh start off from TechRaptor. Uh eagle-eyed fans have noticed that Evil Dead the game appears to have been delisted from two major storefronts, prompting worries that the game may be about to shut down. Over on the",
            "start": 3366.24
        },
        {
            "text": "TechRaptor. Uh eagle-eyed fans have noticed that Evil Dead the game appears to have been delisted from two major storefronts, prompting worries that the game may be about to shut down. Over on the game's official subreddit, user the Pac-Man 117 spotted the that evil dead, the game has disappeared from both Epic and PlayStation Store. The listing for the game is now a dead link in both cases. Evil Dead Link. Evil Dead Link. That sucks. But I mean, that's what happens with all of these games other than uh Dead by Daylight, which is the only one that just sticks around forever cuz it's it's a you know, getting updates and everything. But it sucks. It just sucks that there's a timed there's a time situation with all these games. Yeah. with this with I'm sure killer clowns will be down in like three two years just like okay why do we even make these killer clowns I forgot that was out there I forgot they put that out uh dragon sp dragon dragon ball sparking zero has been rated for switch",
            "start": 3399.28
        },
        {
            "text": "three two years just like okay why do we even make these killer clowns I forgot that was out there I forgot they put that out uh dragon sp dragon dragon ball sparking zero has been rated for switch to in Saudi Arabia only in Saudi Arabia you want to talk about a slow news let's go we were at the point where I almost looked at you and said this should be a main story yeah what's going on with the news with the [ __ ] ESRB over there I was like damn I didn't realize Saudi Arabia had like We can get leaks from their them now. You know what I mean? Like that's that's a new avenue. It's Korea. It's like this is a new one. It's like what is the somebody let me know what the ESRB is of Saudi Saudi Arabia. Uh Wu Chong Fallen Feathers launches July 24th on Xbox Series X. PS5 and PC. Also, it's on Game Pass Day 1. Far Cry 4 update now supports 60 fps on PS5. Let's go. Somebody been waiting for that. I say somebody put in the KHD slack and I was like, we don't have to put everything in here.",
            "start": 3437.84
        },
        {
            "text": "on Game Pass Day 1. Far Cry 4 update now supports 60 fps on PS5. Let's go. Somebody been waiting for that. I say somebody put in the KHD slack and I was like, we don't have to put everything in here. That's Barrett. I mean, just we're just locked in Far Cry 4 Steam War. I I sent it in just cuz it was a weird one, you know? I like sending in the weird ones. And I think VGC had it as an article, too. And I'm like, everybody's everybody cares about Far Cry 4. When they did the Syndicate patch, like that made sense cuz it was very much like, oh, Assassin's Creed Syndicate doesn't work on PS5, so they fix it, bring it to 60 frames per second. Cool. Do you think it's just one person? Who the [ __ ] was asking for Far Cry 4? Yeah. Do you think it's just one person on the Ubisoft team that just that just like that just like sneaks it in? Like no one even knew this was happening. Like who the [ __ ] did this? I love the idea of like it's Yousef, but he does like a Splinter Cell cosplay and he",
            "start": 3482.56
        },
        {
            "text": "just like that just like sneaks it in? Like no one even knew this was happening. Like who the [ __ ] did this? I love the idea of like it's Yousef, but he does like a Splinter Cell cosplay and he like sneaks into the server room to hit the button for He doesn't need to do that. He has the keys. Yeah, I know. But he's like cooler this way. Yeah, I like that. Uh Steam Splinter Cell. Yeah. See? Oh, yeah. Steam achievements have been added to Splinter Cell Blacklist. Only took us only took us like 15 years, everybody. Incredible. Why years for me? That's more random than the Far Cry 4 60 fps. Uh it makes a little bit more. Well, they Ubisoft's been doing this with a lot of their games uh lately on Steam. They've just been kind of slowly uh I know because uh EMTT Watkins Jr. has been posting about it every time it happens. Gotcha. This is huge. This is huge. And this gives us hope, you know what I mean? For eventually we'll have a remake of this game. Oh, okay. Of this one specifically. I",
            "start": 3523.44
        },
        {
            "text": "it every time it happens. Gotcha. This is huge. This is huge. And this gives us hope, you know what I mean? For eventually we'll have a remake of this game. Oh, okay. Of this one specifically. I was going to say I was like, do you even like Blacklist? Yes, I love all the Splinter Cell games and the Blacklist is probably the best Splinter Cell game and I stand by like like what is Chaos Theory? Yes, Chaos Theory is incredible for what it is, but like a modern Splinter Cell game. [ __ ] Blacklist almost perfected it. It's just wild that they took away Michael Ironside. That's crazy. Let me tell you about Splinter Cell Conviction. This is a better Splinter Cell Conviction. Have you played Blacklist? No, I've only played Conviction. Blacklist is like way better than Conviction. Conviction. I like Conviction a lot. It's great. Seth Rogan is coming to Call of Duty with a bunch of weed themed DLC. [ __ ] yeah. That's the weed. That's the smoke right there. That's the weed right there. You",
            "start": 3562.88
        },
        {
            "text": "I like Conviction a lot. It's great. Seth Rogan is coming to Call of Duty with a bunch of weed themed DLC. [ __ ] yeah. That's the weed. That's the smoke right there. That's the weed right there. You see Whiz Khalifa apparently uh smoked with Snoop Dogg's children and it was like the first time they smoke. They're adults, but like they're old enough to smoke, but it was like their first time smoking weed. So Whiskifa got to like have that experience. That's scary. But I am also like why don't you just smoke it with your dad? Yeah. Why does Whisk up have to smoke with Why? Yeah. Why is with your kids? Why don't you be a better father? Smoke smoke weed with your kids. Smoke weed with your kids. Okay, grow up. And then uh grow up. It's crazy. Uh and that's it. I had the last thing I had here was bless horizon 5, but I talked about that. That is it for Wii news. Um wow, we went over somehow and we have a lot more super chats and I promised it. I promised to get to the super chat",
            "start": 3597.52
        },
        {
            "text": "had here was bless horizon 5, but I talked about that. That is it for Wii news. Um wow, we went over somehow and we have a lot more super chats and I promised it. I promised to get to the super chat technically at the beginning of the show. N we're good. Don't worry about it. Let's keep on going through it. Let's hang out. Um Riley says, \"I hate being reminded I need to finish games. started a vowed, Persona 3, Blueprints, God of War of War, Ragnarok, FF16, Dragon Age, Vilgard, Gods, Help Me. God, you're just like me. Like, like all those games pretty much. I just have not finished. I finished though. You just got to let go. I don't believe in backlogs. Just like if you don't have something finished, just don't have it finished. Just do what makes you happy. Video games are a hobby. Hobbies are meant to make you happy. You feel stressed because you you're leaving something on the table, you're doing it wrong. My game of the year this year is going to be Skyrim. It's going to be",
            "start": 3639.44
        },
        {
            "text": "Hobbies are meant to make you happy. You feel stressed because you you're leaving something on the table, you're doing it wrong. My game of the year this year is going to be Skyrim. It's going to be awesome. Not uh what's the weed one? Weed one. Oh, schedule one. It's going to be schedule one. It's going to be Skyrim. Schedule one is about weed. Uh, all drugs. You can make me math. You can make But start off with weed. It's great. You make meth in schedule one. Yeah. Yeah. You should play this game. It's really fun. Joey's really into it. Out on Steam. You can make wildly. Yeah. It's like Yeah. Has like 100,000 people playing it right now. Wow. There's so many games where you brutally kill people. Can't have a game where you make weed. So true, bro. You know, when you put it like that. Yeah. No, you're right. You're right. Uh, Norman, I'm going to nail this one. Uh, vat vabonor. It was the I'm going to nail this one. Norman, let me know if I pronounced that wrong. Like, like you did",
            "start": 3675.28
        },
        {
            "text": "No, you're right. You're right. Uh, Norman, I'm going to nail this one. Uh, vat vabonor. It was the I'm going to nail this one. Norman, let me know if I pronounced that wrong. Like, like you did need to say pronunciation was you had two. Sometimes let me know cuz sometimes I'll look at a name and I'm like I'm skipping that one. But no, I want to be respectful of the fact that that is your name and I'm gonna say it. Vatabonor, you're so brave. Come on. Come on. Hey, I don't even know if that's right or not, but you know, we're celebrating either way. They wrote in and says, \"It just occurred to me that Yai Yote uh comes out literally the day before I leave to spend a week in SF.\" Bring your place. Damn, it's crazy. Christopher Bernett, sorry. Damn, that's crazy. You get my favorite response to things. You ever try that? You're such a [ __ ] You ever you just spent like 5 minutes trying to pronounce this person's name and then you said damn that's crazy and move on. You ever you ever",
            "start": 3711.44
        },
        {
            "text": "to things. You ever try that? You're such a [ __ ] You ever you just spent like 5 minutes trying to pronounce this person's name and then you said damn that's crazy and move on. You ever you ever hit a damn that's crazy on somebody all the time. God, you just so live with Michael. That's what's up. Christopher Bernett writes in says, \"I've been telling you all at KF that GTA 6 is coming between October 28th and November 11th for months.\" This person This person's back. Is this the person that kept on saying that they that they were like putting teasers inside GTA 5 or is that a different person? I think it might be the same person. It might be the same because Christopher Bernett I do recognize Christopher Bernett for constantly telling us that GTA is coming between these dates. Between these dates and the way Christopher says it, I have to believe that he works there. I'm telling you everybody from the future, but I don't remember the specific date. I just remember from this day to",
            "start": 3762.96
        },
        {
            "text": "these dates and the way Christopher says it, I have to believe that he works there. I'm telling you everybody from the future, but I don't remember the specific date. I just remember from this day to this day I was playing GTA one day with in between those DJ. Oh, D uh D Jacob. Okay. Right, bro. I don't know what you're doing. D Jacob, okay, is his name. Uh, I'm not personally excited for Borderlands, but got to give them kudos for keeping their formula and not making it yet another Extraction shooter out of it. I love it. I mean, we might have a mode. You never know. Borderland Extraction is not coming anywhere near Borderlands. That would kill the whole franchise. Uh Joey, clip it out. Get ready. Clip it out. Get ready. Joey Radzone says, \"Ideas for Switch 2 fall game releases. Splatoon Splatoon 4. What you see is what you're going to get.\" Metroid Prime 4 is the big fall release. Take it to the bang, baby. When are they announcing that [ __ ] date? Summer. Summer. Yeah. Because you",
            "start": 3806.56
        },
        {
            "text": "Splatoon 4. What you see is what you're going to get.\" Metroid Prime 4 is the big fall release. Take it to the bang, baby. When are they announcing that [ __ ] date? Summer. Summer. Yeah. Because you know, Switch launches, right? June 5th and then SGF happens. Nintendo doesn't do anything like proper with SGF. So maybe they do another direct two weeks, four weeks after the Switch launch. Yeah. And then it's like, hey, here's the rest of our year with the big thing being Metroid Prime 4 October, November. I think your fall games are going to be Kirby, Pokemon, Metroid Prime 4, the games that we already know of. I don't think there's going to be any bigger games announced for the rest of this year. Yeah, that's what I meant. Kirby riders. Yeah. Oh, gotcha. Gotcha. Yeah. Um, Vulk Dasher says, \"Sony and Take 2 are very close.\" So, no, so non-surprise if Marathon is involved in GTA 6 marketing. Uh, GTA 6 is November for sure. All right. All right. Kab says, \"Dude, when I when when GTA 6",
            "start": 3857.76
        },
        {
            "text": "\"Sony and Take 2 are very close.\" So, no, so non-surprise if Marathon is involved in GTA 6 marketing. Uh, GTA 6 is November for sure. All right. All right. Kab says, \"Dude, when I when when GTA 6 comes out in November, just so you know, I'm going to act like I never You never doubt it. I'm going to act like I never doubt it. I'm like, I tried to tell y'all that GTA 6 is coming out this year. I was there. I was [ __ ] there. You're the [ __ ] worst. Um, Kab says, \"The Skyrim improved. Snow levels are visually boring.\" I don't agree with that. Yeah, I like snow. I like I just like snow. How snow looks. I I hate snow in practice cuz I I grew up in Illinois and I didn't snow. Yeah, that first day of snow's magical. It's magical. I was thinking about snow days. The third day of snow makes me want to like remember snow days. Yeah. Yeah. You would like wake up and then you would watch the TV and it would say your name. It would say the name of your school. The name of your school. Dude, you",
            "start": 3905.04
        },
        {
            "text": "to like remember snow days. Yeah. Yeah. You would like wake up and then you would watch the TV and it would say your name. It would say the name of your school. The name of your school. Dude, you always up, dude. Well, for me it always sucked cuz it would be a snow day, but it wouldn't be snow. It'd be cold. Like Champagne, Illinois would get so cold that it wouldn't even be snowing. It would just be a cold day. It Yeah. I mean, they'll call it a snow day, but it's like, hey, temperatures are so low. You should not be outside that if kids go outside, they will die. That sucks. Yeah. And so there's other things to worry about when it's that cold. That's what it's like with the Midwest around the Great Lakes. Yep. It's not fun. That sucks. Um, Flying Penguin says, \"Bless is a better host than Greg. Welcome back.\" I love it when y'all lie to me. Come on. Come on. That's what I'm talking about. That's Mike's alt right there. Um, Alex Mo writes in and says, \"Uh, birthday tax. Also wanted",
            "start": 3955.12
        },
        {
            "text": "Greg. Welcome back.\" I love it when y'all lie to me. Come on. Come on. That's what I'm talking about. That's Mike's alt right there. Um, Alex Mo writes in and says, \"Uh, birthday tax. Also wanted to shout out your local comic shop. This Saturday is free comic book day around the country.\" Happy birthday, Alex. Then yes, go to comic book shops. That's fun. Um, all right. I'll be honest. We got to get out of here. We have a lot. Give me two more. Give me two more. Two more. Okay, I'll give you two more. Let me scroll back to the top to the people that got in first. Um, Gator Mash Potato writes in and says, \"I literally had the same thought process as Roger, but I went off the deep end and downloaded 4,000 mods for Skyrim. Man, I can't wait for six.\" Well, keep on waiting. Give me five more years. Total five for Elder Scroll. Six. What year? I mean, I'll give you three. Oh, okay. Three. Four. I'll give you four. I'll give you four. Bump those numbers up, baby. You think it's going to be",
            "start": 3996.16
        },
        {
            "text": "years. Total five for Elder Scroll. Six. What year? I mean, I'll give you three. Oh, okay. Three. Four. I'll give you four. I'll give you four. Bump those numbers up, baby. You think it's going to be more than five years? Yes. 100%. I think three. Three to four. I'm going to say four. Three is actually too soon, but I'm going to say four. Okay. I was trying to I was trying to line with you, but now you [ __ ] me on this and I'm going have to say that's what I do. I'm three. You're four now, I guess. [ __ ] Um, all right. I got one more. No pizza bet. [ __ ] no. Also, let me know when you want your pizza. Oh, yeah. [ __ ] I came off. Oh, also Barry, I owe you a pizza. Oh, can you just give Roger a pizza then because he owes me a pizza? Cool. Yeah, then I'll give you a pizza. I want a pizza, too. Give Roger the pizza. I think that they're going to show Splinter Cell this year. So, if you want to do a pizza with me, we can figure that out. They're going to show Splinter Cell? Yeah. The",
            "start": 4038.96
        },
        {
            "text": "too. Give Roger the pizza. I think that they're going to show Splinter Cell this year. So, if you want to do a pizza with me, we can figure that out. They're going to show Splinter Cell? Yeah. The gameplay and stuff of the remake. They have to. We've been saying that for [ __ ] four years now. But isn't it announced for 2026? Who knows? Or am I think No, I'm thinking of Prince of Persia. They're not showing that. It's not coming out. Um, all right. Gerald Rivia, this is the last one. Gerald Oivia writes in and says, \"One of my friends, can you tell one of my friends, can you tell when something happened based?\" I'm reading this. I'm just saying. One of my friends, can you tell when something happened based on it came out before or after GTA San Andreas? He's never beat it. One more. Want me to read it again? No. Or just another a different one. Okay, I'll give you I'll give you one more. One more. Um, let's see here. Let's see here. Um, Katie G writes in and says, \"There's been a",
            "start": 4081.92
        },
        {
            "text": "me to read it again? No. Or just another a different one. Okay, I'll give you I'll give you one more. One more. Um, let's see here. Let's see here. Um, Katie G writes in and says, \"There's been a little my doll from the Muins hidden in our house for the last six years, and my boyfriend still can't find it.\" All right. That's creepy. Like, was it purposely hidden or did it hide itself? I think they just lost it. They lost it. It hid itself. Oh, yeah. It hit itself like like a Toy Story toy. Yeah. Do they hide themselves? Do they have what? Do they hide themselves? Is that their home? You said like a Toy Story toy. No, but they like get up and walk around. Yeah. Okay. Like a like it's sentient. That's what I'm saying. I I'm not saying the Toy Story toys hide themselves, but like sometimes they do depending on the late in the show. What do you think about the penguin in Toy Story 2? Like, why don't you just get out the top? You know what I mean? Like, why was he still there? He was all",
            "start": 4129.28
        },
        {
            "text": "they do depending on the late in the show. What do you think about the penguin in Toy Story 2? Like, why don't you just get out the top? You know what I mean? Like, why was he still there? He was all [ __ ] dusty. You can move. Yeah, but then the what was the kid's name? Andy. Yeah. And Andy would notice. He's like, who dusted you? You're [ __ ] You're alive. Let's end this [ __ ] ch. All right. Let's get into You're wrong. You're right. So, what we got wrong as got it wrong. We only have one from kebabs. And kebabs. She writes in with not a you're wrong. I'm not reading the rest. No. Kebabs. No. Not a you're wrong, but a fun anecdote. Then they write a story. No. Kebabs. No, delete it. Delete it. We got no wrongs. Of course, this has been kind of funny games daily. Each and every weekday, we run you through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us with the kind of funny membership on",
            "start": 4172.0
        },
        {
            "text": "we run you through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch us record them live and get a daily exclusive show. Enjoy the games cast next and the stream after. But until next time, game daily. This is so weak.",
            "start": 4213.12
        }
    ]
}