{
    "id": 14011,
    "video_id": "BXTPiYmehMk",
    "show_name": "Screencast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "The Last of Us Season 2 Episode 3 SPOILERCAST",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745872658,
    "duration": 2248,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to Kind of Funny's Last of Us season to spoilercast. Of course, I'm your host Tim Gettys. I'm joined today by Nick Scarpino. Hello, Tim. And calling in remote, Greg Miller. Hello, Tim. How are you? I haven't seen that that set in a long time. It's nice. How does it make you feel? You're all fancy looking back now. Yeah, it feels good. You know, they like to snap it into the HD footage. How does it feel knowing your three stars are here with me? I hate it. You know, I really hate it. I was just at a wedding in Austin. I was there with Troy Baker and Bernie Burns. It was for Barbara Dungleman and Trevor. Like, congrats to them. Literally every single person uh thought that I was leaving kind of funny. The amount of people that are like this farewell thing like like what what's going on? I'm just like it's just Greg being Greg and then immediately like they have no more questions. They're just like okay I get it. I get it. Yeah, they get it. Immediately",
            "start": 9.15
        },
        {
            "text": "like what what's going on? I'm just like it's just Greg being Greg and then immediately like they have no more questions. They're just like okay I get it. I get it. Yeah, they get it. Immediately follow up with apologies. The amount of apologies I got. They're like I'm so sorry you have to deal with Greg. And I'm like I know. It makes for great content though. It does. It definitely does. It definitely does. Oh, you know what else is great content? Last of Us season 2, everybody. We're talking about episode three today. A little housekeeping for you real quick. Of course, we're doing this every single week. We only have four remaining. We're running out of the episodes of this show. Uh but every single Monday, we'll be here breaking everything down. You can get it on YouTube. You can get it on Twitch if you want to watch live or you can watch later. Podcast services around the globe. You know the drill. Uh if you want to get the kind of funny membership, that would be super cool. It",
            "start": 63.52
        },
        {
            "text": "it on Twitch if you want to watch live or you can watch later. Podcast services around the globe. You know the drill. Uh if you want to get the kind of funny membership, that would be super cool. It gets you the shows ad free and you get a daily exclusive Gregway. Greg, what's it about today? Today's Gregway. Why? I mean, we we'll see. Originally, I was going to do one of the questions from the Patreon chat, which was, \"Hey, uh, you know, what other video game would you want to deep dive on with the devs like you are with the Elder Scrolls Online podcast?\" But here, I I was supposed to be in the office already. I got a sick kid upstairs. Does that change it? Am I Am I doing on my way to see a redacted this afternoon? I don't know. There's a lot of moving parts. Greg Way will be fantastic as always. Right, Nick? Always, Greg. I look forward to it every single day. And you should too with the kind of funny membership. Thank you to our Patreon producers, Anatoli Asked, Delaney Twining,",
            "start": 100.96
        },
        {
            "text": "as always. Right, Nick? Always, Greg. I look forward to it every single day. And you should too with the kind of funny membership. Thank you to our Patreon producers, Anatoli Asked, Delaney Twining, Carl Jacobs, and Omega Buster. Uh we already did a Kind of funny games daily. Uh then after this, we're doing a kind of funny podcast, a big a big day of content here, back to backtoback stuff. Uh so we'll have a kind of funny podcast that's going to be talking about blesses time in Japan. We'll probably dabble with me and Austin a little bit. Uh fun stuff all around. And after that, it'll be an Nvidia sponsored vowed stream, checking out all that DLSS4 goodness. Um, then we're brought to you by Imperial and Oraf Frames, but we'll tell you about that later. Let's get into it. Last of Us season 2, episode 3, The Path, directed by Peter [ __ ] who is best known for the Netflix Daredevil show. Uh, directed a bunch of those episodes back in the day. Greg Miller, I want to start with you. What",
            "start": 136.72
        },
        {
            "text": "2, episode 3, The Path, directed by Peter [ __ ] who is best known for the Netflix Daredevil show. Uh, directed a bunch of those episodes back in the day. Greg Miller, I want to start with you. What did you think of this episode? Fantastic. Uh, you know, I think there was a lot of talk last week about the choices they had made and the differences from the game and that there and I think one of the things we kept talking about last week was them fleshing things out and so really getting to sit with a lot of the different moments here I thought were incredibly powerful and unexpected and as you've said this is spoiler we're all we're spoiling everything but you know that scene of Tommy sitting there cleaning Joel and then the only thing he says is give my love to Sarah like come on. You know what I mean? Ellie waking up in the hospital screaming, let alone her scene with the doctor. Come on. Just the way Ellie says Abby at the kitchen table when Dena tells her her name. It was like,",
            "start": 175.76
        },
        {
            "text": "know what I mean? Ellie waking up in the hospital screaming, let alone her scene with the doctor. Come on. Just the way Ellie says Abby at the kitchen table when Dena tells her her name. It was like, damn. Like, this is the show we already know is awesome in a master class and a million different things. But this is another amazing episode and example of them taking the source material that we all love so much and expanding on it in so many simple, maybe even silent ways to make it feel so much different and even more impactful. Yeah. Uh I I found this one very very emotional. I get that that's the point, but like I can't remember a time I've watched a episode of TV that like I had this like tense feeling of like almost crying. Like I didn't actually cry watching it, but like I felt that like intense emotion the entire time. Like I thought they did a really good job diving deeper into the grieving of Joel where we just don't get that in the game. Like I feel like the game uh the",
            "start": 224.08
        },
        {
            "text": "that like intense emotion the entire time. Like I thought they did a really good job diving deeper into the grieving of Joel where we just don't get that in the game. Like I feel like the game uh the function of the revenge and how she goes out immediately I think serves a different function. But here's sitting with it a bit longer and like even just seeing it uh in live action like seeing her in the the dust covered room and like going up to Joel's jacket and like putting against her face like this was just incredibly emotional episode. I think they did a fantastic job and I this is my favorite type of episode of Last of Us which is it is so true to the spirit of the game but it is majority new stuff but like I I want that I played the game. I love the game. getting more different things I think is uh very good for it. And they continue to impress me with the switched up dynamics like the changes uh with Dena and Ellie. I'm like I am so here for this. Nick, what did you think? Uh I",
            "start": 270.16
        },
        {
            "text": "I think is uh very good for it. And they continue to impress me with the switched up dynamics like the changes uh with Dena and Ellie. I'm like I am so here for this. Nick, what did you think? Uh I liked it. I thought it was a bit of a reset episode for me. I didn't think it was as emotional as you guys are saying. I think this is more like, you know, the the fallout from what happened and then really resetting the grander story of of of uh Ellie going on her revenge trip right there. I I thought the uh the great scene for me, the the one I I I really kind of walked away thinking, \"Wow, that was that was great,\" was the council scene where they actually, you know, they sat and they they had that debate, which you're having internally as an audience member because we all know you should just let this go, right? There's nothing good that can come of this. And and almost gets to that point as well until Seth stands up and is like, \"Hey, what? You guys are [ __ ] crazy. Like, they're",
            "start": 312.64
        },
        {
            "text": "just let this go, right? There's nothing good that can come of this. And and almost gets to that point as well until Seth stands up and is like, \"Hey, what? You guys are [ __ ] crazy. Like, they're coming. If you think that they're not, they're going to stop. They're not going to stop. They're coming back, right? and they're going to come back for us and they're going to take more and more and more. Uh, so he's got that old militant mentality. Yeah. Um, but other than that, I thought it was good and I'm looking forward to I mean, I like the I like the ending moment, too, where we have we have them being like, \"Oh, maybe there's not that many wolves left.\" And then they're just like a [ __ ] battalion of of wolves marching through the streets just murdering people. Uh, looking forward to it. I have questions for you guys, though. Hit me. because I I it's been years since I've played The Last of Us Part Two and so I do want to check in and see like which parts of this are from the game",
            "start": 350.88
        },
        {
            "text": "I have questions for you guys, though. Hit me. because I I it's been years since I've played The Last of Us Part Two and so I do want to check in and see like which parts of this are from the game and which parts aren't from the game. I mean, yeah, it's because the cult of this is just straight up not from the game. Sarapites are, but like not this group of Sarapites. We're getting more earlier backstory for them, which I think is again a great call. Like even just having that scene of them, we know so much from so little of just having them like we know that there's a prophet. We know that the it's not even so much like they're crazy believing in this prophet. It's more like the idea of it and this like fatherdaughter situation having them massacred. I just didn't expect that, you know, I didn't expect to I thought we were going to sit with them a little longer, but I think that's it's really powerful to set up the dynamics of the WLF and them and then also we have um you know",
            "start": 386.88
        },
        {
            "text": "know, I didn't expect to I thought we were going to sit with them a little longer, but I think that's it's really powerful to set up the dynamics of the WLF and them and then also we have um you know Jackson or even just uh Ellie and Dena out there. It's very cool. Yeah. And again, I think that was one of the powerful things they did here was introducing us to the Sarapites, the scars that early, right? And and have them do it in a non-aggressive aggression way where I think the game, even though obviously we can sit there and be like, \"Oh, I understand the motivations of the WLF. I understand the motivations of the Sarah fights.\" Both of them are introduced in a way so late that it's like, well, you're bad guys. You're, you know, and you are. Yes, we can all talk and have the conversation about them being the same as the people from Jackson, right? But I feel like they lost their humanity in in the video game. They were more obstacles. We knew Ellie had to overcome. And yeah, we knew",
            "start": 425.6
        },
        {
            "text": "about them being the same as the people from Jackson, right? But I feel like they lost their humanity in in the video game. They were more obstacles. We knew Ellie had to overcome. And yeah, we knew exactly that they were the bad guys and we were the good guys. So, I think they I was watching that scene where they introduced the scars, right? And like you're saying the father and the daughter. Well, can I have a hammer? Sure. This. What about the prophet? and him really explaining what they do and why they do it and then showing them be afraid and them run and hide in monster or monsters and wolves. It was like damn, I can only imagine watching this for the first time and be like who the [ __ ] are any of these people? But then also like you're not looking at them as oh these are guys who need to get their heads kicked in because they're they're crazy. It's like no no like they're just trying to make it in this world like everybody else is. I thought that was really well done. Yeah,",
            "start": 469.6
        },
        {
            "text": "need to get their heads kicked in because they're they're crazy. It's like no no like they're just trying to make it in this world like everybody else is. I thought that was really well done. Yeah, you see them at at first with the scars on their faces. You see you see obviously like the more religious sort of garb that they're wearing and your first thought I think at least my first thought was like oh right this is a religious cult. They're going to be crazy. They're going to be like human sacrifices or whatever. I don't remember what they were in the game and I know they were antagonists. Um and then you have that good conversation where she's like well the prophet says this and the dad kind of breaks it down. He goes well prophets aren't like gods. They're not all knowing. They're just people that believe in an ideal and they like help people you know toward that and that's why we call them prophets. And I'm like well that's such a grounded. Oh no you're all dead. There we go.",
            "start": 505.44
        },
        {
            "text": "just people that believe in an ideal and they like help people you know toward that and that's why we call them prophets. And I'm like well that's such a grounded. Oh no you're all dead. There we go. Here we go. This is going to be different. Oh no. You know, and then we have the one that that moment where, you know, Ellie and and Dina catch up with them and it's just a slaughter and you see and they even show you the dead kid. You're like, \"What do we come on?\" Yeah. Drman, what do we do, Neil? Come on. Um, but I thought that same thing too with that moment of like them whistling and explaining and him quizzing her on what it means. Like that's just a neat little part of the lore in the back building that of course playing the game we all understood that's what they were doing, but to really see them have that language is cool. I love that. I really love that cuz Yeah. I I think that how the game introduces them is terrifying. Like the whistle is just such a good device to like make",
            "start": 535.92
        },
        {
            "text": "see them have that language is cool. I love that. I really love that cuz Yeah. I I think that how the game introduces them is terrifying. Like the whistle is just such a good device to like make you feel that fear as a gamer. Like you don't know what they're saying. Yeah. Exactly. And quickly it's like oh they're hunting me. Like that's crazy. Uh but in this Yeah. Like seeing them kind of be able to like communicate with each other and then actually translate it. I was like, \"This is such a fascinating um expansion on what we already know about these people.\" Cuz like even the again, it's been years since I played it, so I'm very hazy on like the details of two, but I loved the profit stuff. Like I feel like that some of it felt a little side storyish where you had to like find like the different clues and stuff about it. But I I'm happy that it seems like they're going to dive deeper into it here because uh to Greg's point earlier, it's like they're introduced late enough in the game",
            "start": 570.0
        },
        {
            "text": "clues and stuff about it. But I I'm happy that it seems like they're going to dive deeper into it here because uh to Greg's point earlier, it's like they're introduced late enough in the game and we don't get too much of them like on a personal level. So by the end when it's just like a big ass war between everybody, it kind of just feels like noise as opposed to like groups that we care about. And I don't need characters specifically. Like I already care about them as a group more than I did in the game, which I think is again a testament to them taking their time on the show and allowing it to dive deeper into different uh directions. Yeah. And it's character development, right? I mean, you have to have that for a narrative show. Again, this is a passive experience that we're watching. We're not playing these moments. And I was I remember as they were sort of approaching Seattle, um I remember having those moments where you have to do some of the platforming, some of the walking",
            "start": 610.16
        },
        {
            "text": "We're not playing these moments. And I was I remember as they were sort of approaching Seattle, um I remember having those moments where you have to do some of the platforming, some of the walking around and trying to find the way into the buildings and stuff like that. And I and I remember all that stuff, but so much of that is not story. That's all game mechanic. That's all the immersion of you being in this world and having to explore it and being scared and and and being in those moments. But I do think they're doing a a big service really fleshing out all these characters. Even Jackson, like all the council, all these characters. I like I literally the therapist. I mean, Catherine here, come on. Come on. What are you talking about? Come on. Her drinking at the little league game. So good. Just so good. Not even that far out. I'm like, you're going to catch a stray here. Um, but I I just I I find it I think it's really smart and I think it's really interesting from just, you know,",
            "start": 647.44
        },
        {
            "text": "Just so good. Not even that far out. I'm like, you're going to catch a stray here. Um, but I I just I I find it I think it's really smart and I think it's really interesting from just, you know, you're making an HBO show, you're not making a game. And so I watch this and I go, I could be in this town more. I could see I I care about the inner workings now of these characters. I care about what happened with the therapist's husband and between her and Joel. I'm sure we'll get that story at some point later down the road. Um, but that's really that that's an immersion on a very subtle and and and very good path for me that I feel like I'm I'm I'm very much looking forward to watching the next few episodes of the show. Yeah. I mean, I think that uh just the dynamics of Jackson are so much more interesting and I feel like they're true to this again the spirit of the game where we just didn't get much Jackson, but now it's like I feel like this enhances my idea of even game Jackson where",
            "start": 682.72
        },
        {
            "text": "interesting and I feel like they're true to this again the spirit of the game where we just didn't get much Jackson, but now it's like I feel like this enhances my idea of even game Jackson where it like fills in some blanks like I like Jesse so much more continue to uh in in the show. Where did you like him when he took his sleeveless he took his shirt off and he had those giant arms? I was like, \"Whoa, Jesus. This guy get these arms from.\" But Tommy continues to be another highlight for me of like the the changes they make with him, I feel make it a a more compelling real story. Like, uh, I I love the idea of the game of him immediately going after Joel, that makes sense, too. But I think with the the version of Tommy we have here and the version of Joel we have here, having the the back and forth dialogue between uh Ellie and Tommy where he's like, you know, she's my he was my brother. Like, I know him. I know him. Don't think I don't know Joel. Yeah. And I heard like, \"Don't talk",
            "start": 719.6
        },
        {
            "text": "and forth dialogue between uh Ellie and Tommy where he's like, you know, she's my he was my brother. Like, I know him. I know him. Don't think I don't know Joel. Yeah. And I heard like, \"Don't talk to me. Don't talk to me like I didn't know him.\" That's one of the quotes I jotted down cuz I was so good stuff. Like I think that that that was really great. And this version of Ellie, like I love that this whole episode uh like the theme of her was she's lying. You know what I mean? Like she lies. They call her a liar and like they had that conversation about like people can lie and not be liars and she's like, \"No, no, no. She's a [ __ ] liar.\" You can agree to disagree here, which I appreciate. Yeah. And what I love about it is like we see her straight up lie multiple times throughout the the episode like with She starts off the episode by lying. Yeah. I mean the patio thing, right? It's like we know we're getting the [ __ ] patio scene. We know that she went to go see him. I I hope at",
            "start": 761.36
        },
        {
            "text": "episode like with She starts off the episode by lying. Yeah. I mean the patio thing, right? It's like we know we're getting the [ __ ] patio scene. We know that she went to go see him. I I hope at least, right? Like there's no way that that's true. Uh that she just didn't see him. So that and then also just like her feelings with Dena. Like I think that they added layers to it where Dena being all in on Ellie and them being all in together uh in Seattle day one in the game. That's cool and that works, but I think this Dena is way more fascinating. And I like that they're still kind of playing this like not will they won't they, but they're they're they're kids that are trying to figure out their feelings for each other. They both clearly are into each other, but they're like they want the other person to make the first move. You know what I mean? Yeah. She has that great line, too, at the end of the episode where she's like, I wasn't that high. Yeah. And that was like, Ellie, here's",
            "start": 796.08
        },
        {
            "text": "other person to make the first move. You know what I mean? Yeah. She has that great line, too, at the end of the episode where she's like, I wasn't that high. Yeah. And that was like, Ellie, here's your opening. And she didn't take it. Come on, girl. I love that. Camping. That's why Greg and I can't go camping together anymore. Yeah. Just get a whole situation. O too much. Too much moisture. Um, but yeah, even the opening shots of of Tommy, like of them cleaning Joel's body and then Tommy coming in, it's like, \"Oh my god, that is like it's gut-wrenching, you know?\" And um I I feel like just it the game I think did such a great job of having us go into Joel's house and be able to like see everything and like it had this like empty feeling where it's like it that hit so hard cuz like even though we didn't explore that house in the the first game or anything, we didn't really have ties to that house. I think they did a great job of like still making it mean so much to us, but in the show",
            "start": 832.32
        },
        {
            "text": "we didn't explore that house in the the first game or anything, we didn't really have ties to that house. I think they did a great job of like still making it mean so much to us, but in the show just the way that they shot it of the the mailbox and like the memorial stuff. Like it was so clear how much Joel meant to Jackson and how much Jackson lost with Joel dying, but also them in the council bringing up the whole thing of like it wasn't just Joel that died. Like so many people died. And I just think that it adds a lot of weight to the the context of Ellie's journey. This is the power, right, of the format where when we're the video game, uh, and I know in this this one game we are not, but for this everything we're talking about, you are right. You're on sticks is Ellie, so everything has to be from Ellie's perspective. And so I really think the fact that we're sitting here like, oh man, well, Jackson feels so much more fleshed out and I like everybody there more. And I think",
            "start": 873.28
        },
        {
            "text": "has to be from Ellie's perspective. And so I really think the fact that we're sitting here like, oh man, well, Jackson feels so much more fleshed out and I like everybody there more. And I think there's a lot to be said for the fact that when we're playing that game, we're playing as Ellie who feels like an outsider who doesn't have, you know, I mean, she can't have these connections, right? When we're walking around Jackson on the sticks in The Last of Us Part Two for the first time, right, the first thing that you feel warmth from is when you see Dena having the snowball fight with the kids, right? Otherwise, it is a stilted conversation with Jesse. You're walking out into the world. All this stuff's happening, but it's not happening to you. It's happening around you. You feel like you don't know where you belong. And it this is all thematically where Ellie is in that world. And I think that's the power of playing a video game and having that perspective, but then also hopping over",
            "start": 915.2
        },
        {
            "text": "don't know where you belong. And it this is all thematically where Ellie is in that world. And I think that's the power of playing a video game and having that perspective, but then also hopping over to a show here where there'd be no way, even though Katherine Harris therapist character isn't in the game. There'd be no way for us to see her have that conversation with Tommy, right? It just wouldn't make sense unless we're sneaking in the bushes or whatever, to hear them have this conversation and have Katherine Hera deliver that stuff about she's a liar, this that the other like, but then I love when she says it, you know what I because they drift into this therapy session so seamlessly that you know he's inherited Ellie right Ellie is now his daughter in terms of like you know basically god parenting or whatever right and then it's the conversation where you know she's going back and forth back and forth back and forth right and then it's the one of some people just can't be saved",
            "start": 949.04
        },
        {
            "text": "god parenting or whatever right and then it's the conversation where you know she's going back and forth back and forth back and forth right and then it's the one of some people just can't be saved she says that and I was like damn like you know what I mean Kevin hair of course a drunk all the time and high all the time and not on her thing but like to deliver that is pretty cool I I I like that whole conversation I like how she was talking about they had that they were sort of talking in theoreticals of like nature versus nurture, right? And she goes, \"Well,\" she goes like, \"Nurture only goes so far really, right? It's only really 10% or whatever it is. The rest of it is just someone's nature.\" And she goes, basically lose the fact that she's like, \"Did Joel drag her along or were they walking side by side? Like, is this person just someone that's got the demon in them and there's no and then she goes, \"Yeah, some people just can't be saved.\" What a great moment. So good. Smiling the",
            "start": 987.36
        },
        {
            "text": "side by side? Like, is this person just someone that's got the demon in them and there's no and then she goes, \"Yeah, some people just can't be saved.\" What a great moment. So good. Smiling the entire time. Speaking of the the sidebyside thing, did you guys notice that in the the intro the at at the end it would be like the fungus turning into like the two and now it's just one. Oh, I did not. Oh man, that was the first thing when that happened. I was like, \"Oh, I'm in for some [ __ ] They're about to [ __ ] me up with this episode.\" And they did. Oh. Yeah. This one's sadly one of those where I just skipped the intro. What? That's too slow. Come on. Music's too bad. It's either X-Men 97 or nothing for me. That's my life. That's what it's got to be. It's a simple rule. Um, I love the during the meeting where like that guy Scott was just talking about corn. It's like, \"Shut up, Scott.\" Like they just do such a great job with with Jackson of making it feel like how real people would be",
            "start": 1023.44
        },
        {
            "text": "the meeting where like that guy Scott was just talking about corn. It's like, \"Shut up, Scott.\" Like they just do such a great job with with Jackson of making it feel like how real people would be together. You know what I mean? I was dude I was into Sky. I was He's making some good points about it's hard. I mean, it's it grows fast, but it's hard to grow or whatever he said, which is funny. Um, I want to keep talking about this episode. Uh, but right after a word from our sponsors. This episode is brought to you by Imperial. We have told you all how important it is to developers that you wishlist the games you're interested in. So, if this sounds cool to you, make sure you wishlist it. I can't tell you how much it helps. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a faroff corner of the galaxy to explore enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off",
            "start": 1061.44
        },
        {
            "text": "to a planet in a faroff corner of the galaxy to explore enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. You'll need to make sure you have the right gear to take on the harder Cardiggrams. Build your mercenary, choose your gear, master your abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses, and seek out secret paths to find bigger and better loot. Help the members of the expedition in deep branching",
            "start": 1103.2
        },
        {
            "text": "take down everything in your path in Imperial. Face off against enormous deadly bosses, and seek out secret paths to find bigger and better loot. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries, the monolith awaits. Imperial is available May 8th on PC, Xbox Series X and S, and PlayStation 5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraf Frames. If you haven't called your mom in a while, here is your reminder to do it. But if you want to go above and beyond beyond Mother's Day is coming up, and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preloaded with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Me, Kevin, and",
            "start": 1148.64
        },
        {
            "text": "Plus, you can order the frame online and preloaded with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Me, Kevin, and a ton of people at Kind of Funny are obsessed with our Aura frames. It takes about 2 minutes to set up the frame using the Aura app. Aura Frames were named the best digital photo frame by Wire Cutter and featured in 495 gift guides last year. I counted Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting orura.com to get $35 off plus free shipping on the bestselling Carver matte frame. That's a rafra.com. Promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. Roger just cracking. Roger's running the show, but like he just started the countdown way earlier than he normally does. He just committed to the full 10-second countdown. You got to commit. Uh, one thing, one of my favorite lines",
            "start": 1193.68
        },
        {
            "text": "the show, but like he just started the countdown way earlier than he normally does. He just committed to the full 10-second countdown. You got to commit. Uh, one thing, one of my favorite lines in this is the it's quiet, too quiet. Curtis Surviper both in all four movies. And I'm like, this is just so good, man. been following that up immediately with the um there's about to be a whole lot less. Yeah, I guess there aren't that many wolves. There's about to be so much less. Curtis Surviper. No, that was me. I was trying to sound like a badass. You don't need to try. I'm like I [ __ ] love this Ellie and Dena, man. They're good. Yeah, 100%. Uh and that that scene that line that like levity and seeing Seattle like that was awesome. And then yeah, you see all the wolves, but having Manny up in the what's that tower called? The Seattle Tower. Oh, the the Yeah, I'll look it up. Space Needle. Space Needle. Space Needle. Yeah. seeing him up. I'm like, that's [ __ ] sick that he's just like",
            "start": 1241.44
        },
        {
            "text": "in the what's that tower called? The Seattle Tower. Oh, the the Yeah, I'll look it up. Space Needle. Space Needle. Space Needle. Yeah. seeing him up. I'm like, that's [ __ ] sick that he's just like overlooking from that like damn. Just [ __ ] salty. Yeah, just salty the entire time that these guys on the ground can't get their call outs right and he's got to move his [ __ ] and stuff like that, man. I got to go to look at the other thing. Come on, man. Yeah. Very cool. God. And then, of course, do you think there's a chance, Tim, that they don't uh go anywhere with Ellie and Dena, or do you think it's just the two they're going to they're going to play like this like you're talking about with two kids who are trying to figure it out? Oh, I mean, I think that for sure they're they're trying to figure I agree. I'm just wondering. I thought it was interesting where she was like, you know, well, I'm not gay, so I don't know. You know, you you are like, \"How did I rate?\" Like, I thought",
            "start": 1281.92
        },
        {
            "text": "to figure I agree. I'm just wondering. I thought it was interesting where she was like, you know, well, I'm not gay, so I don't know. You know, you you are like, \"How did I rate?\" Like, I thought that was an interesting line to throw in there. I I think that that was that's more Again, I think it was all bait, quote unquote, like to to try to get Ellie to like push her and whatever cuz like I feel like there was it was never like a I'm not interested in this. It was like a I'm clearly asking about this kiss cuz I liked it. You know what I mean? So, it's like I feel like it's I'm not I'm not sure I'm comfortable with what's like yet. I haven't fully, you know, we're just exploring. It's a very explorational like let's start some stuff. And then there's the the Jesse thing too uh where it's like they in the game but also in the show they've set out that they're kind of on and off and whatever. She says she goes back to him and I feel like they had to do that because of the pregnancy and",
            "start": 1316.4
        },
        {
            "text": "like they in the game but also in the show they've set out that they're kind of on and off and whatever. She says she goes back to him and I feel like they had to do that because of the pregnancy and just timing wise and this how much time 3 months later or whatever. So it's like that makes sense. Um and yeah I I feel like I don't think she got back with Jesse in like a hey like we're we're together way. I think it was more of like a they banged it out. You know what I mean? God bless him. But I I I think that Dean has been thinking about that kiss with Ellie the whole time. I think she she's gayer than she's saying. And then my other question is for you. So you you think we're going to get a flashback where they're toying. Are they trying to double trick us, the people who have played the game where when we got to see Ellie walk up after the barn dance, walk past Joel? Obviously that broke my heart cuz I was like that's the last time they're going to get the chance to talk probably.",
            "start": 1350.8
        },
        {
            "text": "game where when we got to see Ellie walk up after the barn dance, walk past Joel? Obviously that broke my heart cuz I was like that's the last time they're going to get the chance to talk probably. Then she says today it was. You think we're gonna get a double back later in these four episodes or next season? That is her walking up to the thing. I think that'll be next season. I I think that I mean I again this is it's hard because the game tells things a little out of order and it's been a long time. Don't we not see that conversation until like the end of the game? Correct. But we never got the hey like again it's very complicated because of the game never I don't think did a great job of explaining that you were living in Joel's garage. So like I when I was playing the game and we got that conversation, it had never I I we had never seen that setting before. So that was the first time we saw the porch and saw him on it and knew where we were canotically. For me it was playing the",
            "start": 1389.04
        },
        {
            "text": "that conversation, it had never I I we had never seen that setting before. So that was the first time we saw the porch and saw him on it and knew where we were canotically. For me it was playing the game, oh my god, they had this fight. She woke up the next morning, went on a patrol, Joel got killed, they never had a chance to talk or anything. So then to see that when we were watching the premiere or whatever, right? I was very much like, oh my god, they're taking that conversation away from us. They're not going to have that conversation. This is going to end badly. In Ellie's speech today, uh, you know, in front of the town council, she says something about, you know, not thinking it's gotten into her trouble before and some things you can't take back or you can't undo or whatever is similar to what she was talking about with Katherine Nhara. Yeah. I mean, obvious things are different. So, I don't know what path to go down. I feel like they they have the flexibility that they've",
            "start": 1430.48
        },
        {
            "text": "similar to what she was talking about with Katherine Nhara. Yeah. I mean, obvious things are different. So, I don't know what path to go down. I feel like they they have the flexibility that they've set themselves up that they could not do that. I think she's lying. I I think that we're going to get that scene. And I think even the way that they they showed they like last episode or two episodes ago, I guess when they showed her walking past the porch and like looking at Joel, the way that was cut to me kind of felt like that wasn't all that was that was there. Like more happened. But I could be totally wrong, but I can't imagine them not having that. Having said that, last season I thought that there was no chance they wouldn't do the Joel hanging upside down thing and they didn't. So maybe. Yeah. I mean, I think it's one of the most powerful conversations in the game, right? I think it leads to such a great line, right, of like, I don't know if I can forgive you for this, but I'd",
            "start": 1467.76
        },
        {
            "text": "maybe. Yeah. I mean, I think it's one of the most powerful conversations in the game, right? I think it leads to such a great line, right, of like, I don't know if I can forgive you for this, but I'd like to try. Like, I think that's powerful and and needed, which was why I was shocked they showed it, but took it away from us. So, I just I again I mean, you know me, I don't I don't think as critically as you do, Tim. So, it's like I saw that and I took it as face value of like, oh, they're not going to do that. Okay. I think the conversation this episode focused way too much on Ellie lying for that to not to not for her to not have a live consequence of things that she was actually saying there. Um, but I I I need your help here because I I could swear that we see the porch scene in the game early, but then we get more of it later. Like I I feel like it's a fairly similar structure to how they have it here. We just don't see her walk to the garage or whatever. But I'm pretty sure we",
            "start": 1506.8
        },
        {
            "text": "game early, but then we get more of it later. Like I I feel like it's a fairly similar structure to how they have it here. We just don't see her walk to the garage or whatever. But I'm pretty sure we get some of the conversation of them on the porch and then it's like the actual redemption between the two of them happens way later. But correct me if I'm wrong, chat. Yeah, tell me if I'm wrong. Zach says she literally says they worked that out in episode two. LOL. Like I don't Yeah, but again watching that it was such a blowoff comment to Jesse. Yeah, we worked out it's over. Like it was her trying to get Jesse off the trail of them having a major problem. I thought Yeah. A couple people in the chat saying they think I'm right. No confirmations though. But anyways, what do you think, Nick? Uh I mean, yeah, I think there's more there. I mean, I don't think you have Pedro Pascal. You don't put him in a scene like that. So from a writing perspective, you got this and this is a pivotal",
            "start": 1540.96
        },
        {
            "text": "Uh I mean, yeah, I think there's more there. I mean, I don't think you have Pedro Pascal. You don't put him in a scene like that. So from a writing perspective, you got this and this is a pivotal scene. So, I think we do go I think we go back to that and I think we go back to a lot him a lot more than than we absolutely should go back to that. Uh Lob Seahawk says, \"Tim's correct. The scene is teased several times before we see the the full thing.\" Tristan says, \"Just played the game.\" Yeah. So, okay, great. Yeah. And that's the thing is, do we get that this season as kind of like a a button to like the theme of this season? 100%. I don't know. I think it's next season. She's already lied about it. We've already foreshadowed it, right? She's already like she's lied about this relationship with him and these and that she lied about the last night. We know, you know, there's no way she absolutely talked to him until she But she lied to get out of prison basically. You know, she's on",
            "start": 1582.72
        },
        {
            "text": "with him and these and that she lied about the last night. We know, you know, there's no way she absolutely talked to him until she But she lied to get out of prison basically. You know, she's on parole. But again, we don't see that. We figured it out. That's We don't see that kicker of the conversation until she's about to kill Abby, right? We shouldn't see that in this season. Then I think they're going to hold it for next season, but interesting. Yeah, cuz everybody's forgotten about Pedro. I'm I'm I'm a bit hazy as to what she knows and what she doesn't know right now versus of it all. Right. Well, she like she knows that he killed all those people, right? for her. Oh, what he said to her, she's basically like, \"You're full of shit.\" Right. The viewer doesn't know that yet, but that we we as the game players do cuz we will in either this season or next season get a flashback where they're out on patrol or whatever and she calls him out on it. I'm like, \"What really [ __ ]",
            "start": 1618.16
        },
        {
            "text": "that we we as the game players do cuz we will in either this season or next season get a flashback where they're out on patrol or whatever and she calls him out on it. I'm like, \"What really [ __ ] happened?\" And he lays it all out and she's horrified and doesn't talk to him and that fractures their relationship. Okay. And that's where find them now, right? That's that's the fracture. That's where we picked up season season 2, episode one. Okay. Yeah. Yeah. Yeah. That makes sense. So, she knows why. But she doesn't know who Abby is, right? Or she does. Oh, no, she does because Dena heard Dena heard a whole bunch of the whole thing. Or was she catatonic? I can't remember. Wait, actually, that's a good one. I don't think this I was going to say Dena just laid out all this information and I don't think she knows names. She knows Seattle. She knows Wolves. She doesn't know that Aby's dad was the doctor. Okay. So, she doesn't know why Abby necessarily did what she did. Yeah. Um,",
            "start": 1655.44
        },
        {
            "text": "and I don't think she knows names. She knows Seattle. She knows Wolves. She doesn't know that Aby's dad was the doctor. Okay. So, she doesn't know why Abby necessarily did what she did. Yeah. Um, interesting. Okay. It's hard to keep all these motivations I know. You know, straightforward. We'll get there, though. Um, did you guys watch the next episode on No thing? I never do. I did not. I can't stand on that [ __ ] Oh, what? We need to sign a petition to be like, don't show me anything that's happening unless I can watch it right now. Oh, man. I I really am indifferent to it, but I'm on Nick's side today. If that's Nick, get the petition started. Go to change.org. Let's go to change.org. Roger's in, too. That's three right there. That's enough to get in front of the president of TV. Perfect. No, no, no. It was awesome, dude. Dude, there was a not to not to sidetrack this whole conversation. I love Bosch as you guys know, but Bosch I loved how this just started. [ __ ] yes, Nick. Go",
            "start": 1690.4
        },
        {
            "text": "No, no, no. It was awesome, dude. Dude, there was a not to not to sidetrack this whole conversation. I love Bosch as you guys know, but Bosch I loved how this just started. [ __ ] yes, Nick. Go all in. [ __ ] yes. And Bosch Legacy just wrapped up its final season and it was a [ __ ] it was a banger of a season. Of course, Tim Bosch Legacy is a spin-off from Bosch, but it's all the same characters basically just more of Bosch, right? But they do this thing on Amazon for whatever reason where they just legitimately like this season coming up this episode one ends like coming up this season on Bosch and they show you all of everything from the I'm like what are you doing? Why would this incentivize me to watch do that? No. No. But like some of them tease it out. This is like major plot points for every episode for like the next eight episodes. They'll tell you like what's happening in the next episode. This was like [ __ ] that didn't happen till like episode one. Episode one normally",
            "start": 1730.56
        },
        {
            "text": "for every episode for like the next eight episodes. They'll tell you like what's happening in the next episode. This was like [ __ ] that didn't happen till like episode one. Episode one normally has a full season and then the rest of the season. Oh man, we got to stop this [ __ ] We got to stop this [ __ ] Get in the Get it in the petition. Also, side note, everyone should watch your friends and neighbors. Jesus Christ, this looks like a fake poster. I don't I don't know. You look like a [ __ ] fake poster. The sun is setting epic saga. Bosch. What the [ __ ] is Bosch? Get the [ __ ] out of here, Roger. Mute your mic. What is happening? Mute your mic. Oh man. Um, one thing I want to call out here that I liked that we haven't talked about from my notes. Um, I really liked uh Ellie's scene at Joel's grave and then leaving the coffee beans there. I thought that was really cool. Yeah, really good stuff. I mean, even the whole grave scene, again, very different from the game. Like, I feel",
            "start": 1772.56
        },
        {
            "text": "at Joel's grave and then leaving the coffee beans there. I thought that was really cool. Yeah, really good stuff. I mean, even the whole grave scene, again, very different from the game. Like, I feel like the themes of the and character dynamics of Ellie in the show are have to be different from the game. The game, I think a big part of it was not having that time to grieve. She immediately goes off and it is just that pure revenge. I think that this having her be able to like go to the grave and like have those moments I think really changes up the dynamics of like what her mission even is, you know, and like the the the level of rage and anger just it's different in a way that I think is interesting and maybe they don't pull it off at the end of the day, but so far I think that they've been doing a really compelling job of keeping me in with the story and like I feel like it's a great show. Like I G hasn't watched this episode yet, but I'm very excited for her to to check it out.",
            "start": 1810.64
        },
        {
            "text": "been doing a really compelling job of keeping me in with the story and like I feel like it's a great show. Like I G hasn't watched this episode yet, but I'm very excited for her to to check it out. Now, Abe Froman, the sausage king of Chicago, of course, in the chat says, \"Coffee reference on the porch during the talk.\" So, I don't know. I don't know if that's I I don't know the significance of the coffee beans, but I mean, he loves coffee. It's a whole thing in the in the video game in the conversation. He's drinking coffee and she he asked about it and he's like, you know, you don't want to tra you don't want you don't want to know what I traded to get it. He loves coffee. Joel's a coffee lover. And it's mainly just like a sign of their the little moments of Last of Us that make it so special between the two of And I I I I I love it because it just shows that that's how Ellie thinks of Joel. You know what I mean? It's not just like like he saved me all like all that stuff, but it's",
            "start": 1847.6
        },
        {
            "text": "between the two of And I I I I I love it because it just shows that that's how Ellie thinks of Joel. You know what I mean? It's not just like like he saved me all like all that stuff, but it's like the little moments between them of them on their road trip. You know what I mean? Yeah. Yeah. Yeah. Great stuff. Great stuff indeed. Um any other thoughts? I think we kind of touched on everything here. No, dude. Shout out to um Bella the Bella Ramsay's performance. The opening shots of her waking up and just [ __ ] screaming. Screaming. Dude, that was crazy, man. It's uh I liked her and I liked the little not I'm not going to say it's like a full redemption arc for Seth. I think that the homophobe, the guy who's always the [ __ ] bad guy or bad cop. He's always a bad guy. He might have actually been a bad cop in Bosch at one point, too. Um this guy's great though cuz you can tell he's seen the final season. Um I liked it. I like the handshake. I like that she shakes his hand at the end.",
            "start": 1883.2
        },
        {
            "text": "been a bad cop in Bosch at one point, too. Um this guy's great though cuz you can tell he's seen the final season. Um I liked it. I like the handshake. I like that she shakes his hand at the end. Yeah. Yeah. And he's like Trey. He's like, \"This is a better gun. Like take this gun. this it's I thought that was a good scene and her giving him [ __ ] too like wasn't friendly like all that stuff. I I love it. What I appreciate about it though is how it fits so well into the Last of Us world where I don't necessarily see it as a redemption arc. I see it more as like people are complicated and they could be bad and good at the same time. And I I feel like I I liked Seth where to me like I feel like even his speech uh in the council it's not necessarily coming from a good place. Like we're we like it because we're like yeah we want we're rooting for Ellie. You know what I mean? Like as the protagonist. So it's like we want her to win the vote just storyline wise. But you said this earlier.",
            "start": 1927.2
        },
        {
            "text": "it because we're like yeah we want we're rooting for Ellie. You know what I mean? Like as the protagonist. So it's like we want her to win the vote just storyline wise. But you said this earlier. It's like they shouldn't go. I wanted her to lose the vote. They should not be like I know what this I know what this show is, but in my brain I wanted them to lose the vote vote and then her therapist sign be like why don't we just talk before you go out on this because this is going to be you're to your destruction. You're going to take yourself. But I I thought that they did a good job of like having Seth come off like I don't think he came off well. You know what I Like I would want to side with that guy giving the speech that he gave. You know what I mean? But also those people exist and those people exist for good reason to an extent. Like I like that. I I did too and I think you but I liked it because I was having that internal debate, right? There are two sides. There's actually no I",
            "start": 1966.8
        },
        {
            "text": "people exist for good reason to an extent. Like I like that. I I did too and I think you but I liked it because I was having that internal debate, right? There are two sides. There's actually no I I would argue there is a right or wrong answer based on based on like the the logic and the statistics of what might happen. But if there really is a group out there and remember these people don't know why they attacked, right? They're not they're not sure why Joel's dead. I don't think Ellie was out there being like, \"Well, let me tell you this crazy ass backstory as to what happened and take take a look at this cigar and all these things, right?\" So, they don't really know. So, on on a certain level, if you've been through all this [ __ ] they've been through, there's an argument to be made that there is a group of another faction out there that's testing the fence of Jackson and we maybe need to go push back on them before they come at us full tilt. We've already seen their numbers in",
            "start": 2004.24
        },
        {
            "text": "that there is a group of another faction out there that's testing the fence of Jackson and we maybe need to go push back on them before they come at us full tilt. We've already seen their numbers in the end of this episode, but I think the rest of us are like, \"No, violence begets violence.\" And if you push out there, they're going to push back with more force and it's just going to be all at war. But it's it's it's it's interesting. It's an interesting conundrum. Greg, I hear you. I agree. You know, I think I like Tim's summation of people are complicated. I think that's the thing where, you know, start and I know I'm dialing back a little bit in terms of the conversation, but I think that's what works for me. And then, yeah, this is a fun argument to have, of course, because it's easy for us to sit there and know that, well, no, Abby means you no harm, right? She came. Now, of course, it is different. one of the, you know, one of her compatriots there could come back and say, \"Hey,",
            "start": 2034.96
        },
        {
            "text": "us to sit there and know that, well, no, Abby means you no harm, right? She came. Now, of course, it is different. one of the, you know, one of her compatriots there could come back and say, \"Hey, they had a really nice place with power lines and all this other [ __ ] We should go take it. Maybe we do set up an operating base there.\" Da da da da. But yeah, but I mean that ship's already sailed, right? Yeah. If you're doing laundry uh Chandre Scholar in the chat says, \"What do you think about Tommy staying behind staying behind in Jackson?\" There's not a freaking way he's not he doesn't leave. He's leaving. The second you find out that Ellie and Dina are gone, he's got to go. Yeah. I mean, again, I think that this the the show version of Ellie, like I feel like the the guilt that she has to deal with, I I feel like they they did such a good job setting up Jackson as a community that we care about. So, it's kind of on her making the choice to even though the vote said don't go, she went",
            "start": 2072.88
        },
        {
            "text": "deal with, I I feel like they they did such a good job setting up Jackson as a community that we care about. So, it's kind of on her making the choice to even though the vote said don't go, she went anyway. And it's going to cause Tommy to go after her, she is causing problems for Jackson. Like, I think there's just even more guilt that's going to be on her shoulders when things go bad potentially like at Jackson. I don't know we'll ever even see that necessarily, but like I I think that the concept of her turning her back on the people, especially after they just had this brutal [ __ ] attack and the wall being destroyed, like I think that that's good storytelling. It's different than the game, but yeah, Tommy's going after for sure. You think Tommy and Jesse? Yeah. Yes. Yeah. That was the squad kind of in the game, right? It I don't remember where. Yes. Right. It was four people, wasn't it? Tommy, Jesse, Dena, and and Ellie. Yeah, I Yeah, if memory serves in chat can correct me if",
            "start": 2108.16
        },
        {
            "text": "the squad kind of in the game, right? It I don't remember where. Yes. Right. It was four people, wasn't it? Tommy, Jesse, Dena, and and Ellie. Yeah, I Yeah, if memory serves in chat can correct me if I'm wrong, the one guy who just played it or whatever, it's it's similar that uh uh Ellie and Dena take off on their own, but yeah, then uh Tommy and Why am I blank? Jesse come after them because they left. Tommy's first cuz Tommy Tommy and Ellie were talking. Oh, is he? I thought Jesse first. Oh, maybe. And then Jesse and Well, no. Cuz Tommy and Ellie were having I correct me if I'm wrong. Tommy and Ellie had a conversation. Ellie's like, \"We got to [ __ ] go.\" And he's like, \"Give me give us till tomorrow.\" And then he leaves early. Tomorrow's age 21st, Dina and Elliot, and then Jesse follows. Gotcha. Yeah. At this point, you might as well just send the 16 people. What the hell are you? Also, that was what an aggressive number. 16 people to go assass to go eliminate. Dude, [ __ ] me.",
            "start": 2148.72
        },
        {
            "text": "Gotcha. Yeah. At this point, you might as well just send the 16 people. What the hell are you? Also, that was what an aggressive number. 16 people to go assass to go eliminate. Dude, [ __ ] me. That's cool. Yeah. Um, yeah, they have to and it'll be fun. It'll be interesting. It's going to be interesting. Can't wait to see next episode. Uh let us know in the comments below what you thought of episode 3, The Path of the Last of Us season 2. Uh four remaining episodes this season. Um stay tuned for the Count of Funny Podcast live on YouTube and Twitch or you can get it later on podcast services. Till next time, love you all. Goodbye. [Music]",
            "start": 2194.48
        }
    ]
}