{
    "id": 13871,
    "video_id": "d42gO0NytNs",
    "show_name": "Gameplay",
    "hosts": [
        "Andy Cortez",
        "Blessing Adeoye Jr.",
        "Mike Howard"
    ],
    "title": "We Become The Best Rematch Team On Earth!",
    "description": "This episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744410805,
    "duration": 10909,
    "transcript_chunks": [
        {
            "text": "[Music] Three, two. Yo, what the heck is going on, Kind of funny best friends? Welcome in to your Kind of funny games afternoon stream for this lovely Friday, April 11th, 2025. It's the end of the work week, end of the school week, and oh boy, do we got a special one for you. You know, Thursday night there was a lot of back and forth. Kevin Kella got addicted to blueprints. He came up to me said, \"What if we play play Blueprints tomorrow?\" I said, \"Me and Andy are playing Steel Hunters.\" And he said, \"Well, what if we don't do that?\" And I said, \"No, no, we're going to play Steel Hunters.\" He said, \"Well, what if we just get Andy to play Blueprints?\" And I said, \"He won't like that, but we'll try.\" And Andy later that night said, \"Absolutely not.\" I said, \"You guys can do that.\" He said, \"Absolutely not. I'm playing that on my own on my Steam Deck. And so Andy said, \"No, that's for me, you know.\" Have you started it yet? Yeah, I started it last night, but maybe maybe the gummy I took",
            "start": 2.43
        },
        {
            "text": "\"Absolutely not. I'm playing that on my own on my Steam Deck. And so Andy said, \"No, that's for me, you know.\" Have you started it yet? Yeah, I started it last night, but maybe maybe the gummy I took hit a little too hard and I was like, I got to put this down. I'm living in 10-second chunks right now. Bless. Oh my god, I'm forgetting what happened 10 seconds prior. So Andy said no to that. So then we came into work. Kevin's cranked up on blueprints. Blessing looks at me and goes, \"Mike, you thought it said 300 p.m., but I got us codes to play rematch from the people who made Sefue. Let's go play soccer.\" And I said, \"Blessing, get the boys together. We're hitting the pitch.\" How did you get codes, by the way, Bless that, you know? I'm just like that. And so, here we are. We're going to play rematch for the first ever time all together to have some fun. You'll be seeing my screen, Annie Screen, and Blessing Screen. All thanks to Big Kevin Cowell on the production side. So, uh, gear",
            "start": 55.36
        },
        {
            "text": "play rematch for the first ever time all together to have some fun. You'll be seeing my screen, Annie Screen, and Blessing Screen. All thanks to Big Kevin Cowell on the production side. So, uh, gear up. Get ready for a full afternoon full of soccer. It's going to be a good time. Can I tell you this is the greatest day of my life. Oh yeah. I'm I'm [ __ ] excited to play this. I'm like I'm so locked in on playing this. Like we're about to become professional. You know what I mean? Like we're about to become [ __ ] soccer pros out there. We all know how to play. We I don't know the buttons yet, but we're going to learn the buttons. We're going to learn the buttons. I'm going to get y'all so into this. I'm also just I mean, you know what? You're not wrong, Bus. Cuz it really was a nice surprise to you making the thumbnail. I'm like, Mike, what are we playing? He goes, \"Blessing God has codes for FIFU.\" I was like, \"Oh my god.\" Yeah. FIFU. What a good what a great surprise. You know, I",
            "start": 98.24
        },
        {
            "text": "to you making the thumbnail. I'm like, Mike, what are we playing? He goes, \"Blessing God has codes for FIFU.\" I was like, \"Oh my god.\" Yeah. FIFU. What a good what a great surprise. You know, I know. I had it on my calendar. I think I had it for the wrong day or maybe they changed the day or something cuz I had it in my calendar of like, \"Okay, I know beta access is happening like right here.\" And so like I marked it out for yesterday and I also said I sent them an email. I was like, \"Yo, where the codes at? Where the codes?\" They're like, \"We'll get them to you in a few hours.\" And I was like, \"All right, cool.\" And that's when I hit you you up, Mike. I was like, \"Yo, we might have to switch it to Rematch.\" Yeah. And then I get the codes in and they're like, \"Oh, no. The thing opens like at 3:00 a.m.\" And I'm like, \"Oh, damn.\" All right, cool. I'm going have to wait for it. So, I'm glad we're able to make it happen cuz I need it. We're here. I needed this W. So, I'm in your party",
            "start": 132.96
        },
        {
            "text": "at 3:00 a.m.\" And I'm like, \"Oh, damn.\" All right, cool. I'm going have to wait for it. So, I'm glad we're able to make it happen cuz I need it. We're here. I needed this W. So, I'm in your party now. All right, perfect. Well, let's get this thing on and popping then. Are you hopping right in without any practice or any uh Well, I went to free play. It doesn't give you any instructions on how to play. So, yeah, we're going to hop right in and just roll the dice. That's how it's how the best games are made. Let me look at the uh cuz I I wore a Chelsea soccer jersey today for this and I'm locked in. I'm ready. Oh, really? You you came dressed just for the occasion. Oh, yeah. I I dressed for the occasion. That's sick. You should wear soccer. You should wear uh football kids more. I do have a few. I have a Barcelona at home. I got one for West Ham that I was gifted um by Andy Robinson. Um this Chelsea one came from Jordan Midler. Yeah. Did we have we talked about like um what's up with",
            "start": 168.48
        },
        {
            "text": "a few. I have a Barcelona at home. I got one for West Ham that I was gifted um by Andy Robinson. Um this Chelsea one came from Jordan Midler. Yeah. Did we have we talked about like um what's up with this? Is this like a closed beta? Is this an open beta? How do people get in? Bless. I have no idea. Okay. Yeah. I just emailed them. I was like, \"Can I stream this?\" And they were like, \"There's no embargo.\" So that's all I That's all I Wow. Like chat, are the streets playing FIFU or are we the only ones playing? People in the streets are playing. Okay. Yeah. I didn't know what the deal was. I don't know what's going on. Yeah. feel like it. No, we're picking jerseys. Oh, I don't know whose jerseys. Who? We're wearing my jersey on my screen. Cool. We're playing my We're wearing my jersey. Oh, yeah. I think I'm wearing my jersey. Oh, interesting. Okay, that's awesome. Everybody sees their own thing. That's crazy. That's pretty neat. All right, I got the ball here. Blessings goalie. Oh,",
            "start": 206.0
        },
        {
            "text": "Oh, yeah. I think I'm wearing my jersey. Oh, interesting. Okay, that's awesome. Everybody sees their own thing. That's crazy. That's pretty neat. All right, I got the ball here. Blessings goalie. Oh, blessing. Do you know how to pass? It's different from FIFA. Oh [ __ ] you left the goal wide open. Oh, no. We got Anybody can be goalie. Is there a button to just turn to goalie? You You were goalie first. That's crazy. I think it was just D. How do you How do you run? Oh, see L1 to run. L1. L1. L1. Oh, okay. L1 to run. Oh, circle to slide tackle. Looks like R1 to uh P or R2 to like pass or shoot. Oh, they just [ __ ] whooped you. I'm on the opposite side. Oh, I'm on the opposite side. Wide open. Oh, we don't know. He has the ball. Oh, wait. Never mind. They got it. They got it. Okay. My stamina stamina went real low. So, I only know if it only looks like B is like slight tackle. Blast. R2. R2. Oh, you I pressed R2. I think R2 is kind of like a shot kind of kick. Oh, I almost body",
            "start": 254.72
        },
        {
            "text": "My stamina stamina went real low. So, I only know if it only looks like B is like slight tackle. Blast. R2. R2. Oh, you I pressed R2. I think R2 is kind of like a shot kind of kick. Oh, I almost body blocked it. I'm on number one over here on the left hand side. I'm holding down the left side. The only thing that's doing anything is B for me. Oh, I [ __ ] cut that off. Here you go, Andy. Go, go, go, go, go. Press R2. Get up there, Andy. There we go. Okay. Okay. Cool. This is cool. This is cool. I got it. Go, Andy. Go, go, go, go, go, go, go, go, go. I'm coming to you. You go right. You go right. No, I lost it. I'm on. You just kind of lost it. Okay. L2 is strafe on D. Okay. Yeah. Yeah. Yeah. Yeah. I love that defensive position. This is really cool. You guys learning how do I pass the ball? I'm on D right now. I'm on D. I got left. One of these pass. Somebody take back right. Oh, here. Here we go. Ah, [ __ ] I almost slide tackle. There you go. There you go. There you go. Oh. Oh, you",
            "start": 304.76
        },
        {
            "text": "I'm on D right now. I'm on D. I got left. One of these pass. Somebody take back right. Oh, here. Here we go. Ah, [ __ ] I almost slide tackle. There you go. There you go. There you go. Oh. Oh, you just got Yeah, they slide tackle me from the back. I got balls. Somebody take behind me. Take behind me. Take the cross. Take the cross. I'm going for cross. Oh, I'm tired. Oh, what a what a save from Fckless. [ __ ] crazy. Fckless, you're crazy. Yeah. I mean, you want to go. There's a button to like call for the ball, right? Oh, I just wa Look at Oh my god. They're on it. Oh my god. They're locked in. What is the pass button? It's one of them. I I was able to call for the ball a little earlier. Yeah, cuz that it seems like R2 is a straight shoot. Oh, damn it. I just got knocked down. Jesus. Hit me. Oh, [ __ ] I have no stamina. I'm trying to Okay, great job. Great job. I'm wide open. Way up. Way up. I'm on the other side of the map. Oh, she passes to me. Come on, Andy. Quick, come with me.",
            "start": 350.88
        },
        {
            "text": "me. Oh, [ __ ] I have no stamina. I'm trying to Okay, great job. Great job. I'm wide open. Way up. Way up. I'm on the other side of the map. Oh, she passes to me. Come on, Andy. Quick, come with me. I'm on the me. I don't have any stamina. Oh, they know the tricks, too. [ __ ] [ __ ] We have no defenders, guys. We have zero defenders. Oh, the practice. Oh my gosh. This is nuts, dude. Fckless is [ __ ] nuts. Oh, that's icing right there. All right, I'm staying on D. I'm on right side. I'm midfield right on. I'm midfield right. Oh, you're coming through the game. Somebody's coming through the game all of a sudden. That's not me. That's not me. It is you. I think that might have been me. Oh, it's still happening. I'm on. No, I see I see slow clap is Oh, wait. Hold up. It's all of us all of a sudden. Yeah, everyone suddenly kicked in. Yeah. Hold up. That just like kind of happened. No, it's Andy, the one coming through. Yeah, there's a Let me mute off. Oh, cuz look on the top right. It",
            "start": 399.04
        },
        {
            "text": "a sudden. Yeah, everyone suddenly kicked in. Yeah. Hold up. That just like kind of happened. No, it's Andy, the one coming through. Yeah, there's a Let me mute off. Oh, cuz look on the top right. It says there's a person in the game named Slow Clap. So, they got they got dev they got devs out there playing. I was in my menus. You can't That one doesn't count. I was Yeah, I don't see Well, I got the um sick. Okay, look. Just hit hit the start button and look at with ball. Throw the ball to you. Dribble is a Oh, see that's what I need right there. Yeah, dribble is a Look at me. Goalkeeper keeper. Oh my god, they're doing stuff. They're [ __ ] big tackle. Oh [ __ ] Get away from me. Throw the [ __ ] flag, dude. I can Oh yeah. Okay, here we go. Shoot his right trigger. A is push ball. Okay. I've read you like a book. Oh my god. I read you like a book. You're insane. I don't know how to pass. Oh my gosh. That's a good Oh man, another incredible save. I'm on the right pass. I hit the right",
            "start": 447.12
        },
        {
            "text": "read you like a book. Oh my god. I read you like a book. You're insane. I don't know how to pass. Oh my gosh. That's a good Oh man, another incredible save. I'm on the right pass. I hit the right trigger. Oh, I don't know. Maybe. Yeah. Oh, but it says A is Oh, big steel. Big steel. Go Fleckless. Ah, Fckless. Just if you hit the start button, it immediately shows you the I can't. The game doesn't stop. Oh my god. This is crazy. Oh my god. Oh my god. Oh, I'm pressing start. I'm not looking. I'm not looking. Oh, what a ball. We We have the ball way over here. Bless the cross. Watch that stamina. Watch that stamina. N you [ __ ] I'm sorry. I thought that was going to be a cross. Come back. Come back, Mike. We need you. Oh, great tackle. Here we go. Oh, here we go. Get activated. Let's do this. Oh, here we go. It's you. Oh, I tried to [ __ ] do a little stunt. I tried to do a kick flip. I know Fckless is [ __ ] frustrated right now. Watch this [ __ ] Watch this [ __ ] Oh, [ __ ] Oh my god.",
            "start": 504.24
        },
        {
            "text": "Oh, here we go. It's you. Oh, I tried to [ __ ] do a little stunt. I tried to do a kick flip. I know Fckless is [ __ ] frustrated right now. Watch this [ __ ] Watch this [ __ ] Oh, [ __ ] Oh my god. Me. This [ __ ] was crazy. Ah, you jerk. Sorry. You hit right on the D-pad. You say my bad. Sorry. Big slide. Carter. Oh. Oh. Get Oh, Mike, you're insane. Get out of here. I don't know how to pass again. You were in the minis for a long time. How did you not see? There's no button that says pass. There's a tap and there's a shoot. I think it's just shoot. I don't. It says X to push goalkeeper. Oh yeah. It just says there's nothing that has like a good Here's pass button. Oh shoot. What does tap mean? Tap or push is probably what we're looking for here. Yeah, like a a Oh [ __ ] that was crazy. I wonder if it maybe it's like a tap R2 to pass and then hold R2 to shoot kind of thing. Oh my god. Oh my god. What's going on over there? I'm killing it. X is definitely pass. X just X definitely",
            "start": 561.28
        },
        {
            "text": "I wonder if it maybe it's like a tap R2 to pass and then hold R2 to shoot kind of thing. Oh my god. Oh my god. What's going on over there? I'm killing it. X is definitely pass. X just X definitely just passed way better. There we go. Last attack. Last attack. Make it count. Make it count. Oh my god. Good try. Oh [ __ ] Okay. Okay. Okay. This shit's kind of crazy. This shit's kind of crazy. The [ __ ] wrist. Oh, he's going. No, you didn't. Okay, come on. Okay, I'll be on. I got to hop into practice for at least 2 seconds. Yeah, I got to figure this out. Me, too, Mike. Fine. We'll all be You could play a solo match. Yeah, I just I just need to mess around with Oh, there's a tutorial. Doing this tutorial. Yeah. Yeah. So, we're all doing the tut. We're all We got to do the cuz I'm trying to get insane at this game. Basic movement sprint. Okay. Okay, R2 is shoot. Oh, we got to change the sprint button. Yeah, it is a weird setup. I wonder can I change my I don't think so. Can you aim down",
            "start": 626.72
        },
        {
            "text": "get insane at this game. Basic movement sprint. Okay. Okay, R2 is shoot. Oh, we got to change the sprint button. Yeah, it is a weird setup. I wonder can I change my I don't think so. Can you aim down when you kick? All right. Asking your ally for the ball. Click that in to call ball. Yeah, call ball. Yeah, I'm not saying look to aim. So, it's all about looking. Yeah, with the right stick. Ooh, that's not good. Okay, so you have to use both sticks here. That's tough. Oh, yeah. R3 to call for the ball. I don't love that. Oh, see that's kind of cool. Okay. Wh What's the call for the ball? R3. R3. Okay. Ask your ally for the ball. Pass. Pass the ball here. Okay. We're gaming. So, wherever the parentheses are is Yeah. Wherever No. Yeah. Wherever your um your cursor is. Yeah. Exactly. Wherever the cursor is, that's where it's shooting. Oh, if you like double tap L1, it's like extra effort is what they call it. Oh [ __ ] Okay, this Hey, what if this is a keyboard mouse game? I'm not trying",
            "start": 669.36
        },
        {
            "text": "the cursor is, that's where it's shooting. Oh, if you like double tap L1, it's like extra effort is what they call it. Oh [ __ ] Okay, this Hey, what if this is a keyboard mouse game? I'm not trying to get crazy here. Yo, try it out. That's wild. Look to aim. Score goal from here. That's sprinting far away. Release it with a push ball. Oh, the extra effort is left shift. No. Mm- Okay, I'm supposed to beat this dude there then. Oh, [ __ ] you. See, push ball is kind of like an extra sprint. Like you kick the ball up to run to it a bit. I think I'm going to leave it just on blastes so that we have a more cohesive tutorial. You're faster without the ball in control when sprinting. Release. Too high. Use a push ball with a direction on a nearby ball to perform an oriented control like that. the ear. Okay, you're faster without the ball tapping it. Keeping it tapped in front of you so you can just keep running without it. Oh, that's going to be a miss. Like if you press X like as you",
            "start": 721.2
        },
        {
            "text": "the ear. Okay, you're faster without the ball tapping it. Keeping it tapped in front of you so you can just keep running without it. Oh, that's going to be a miss. Like if you press X like as you receive it, it's like a nice receive. Push the ball. Okay. Oh, push it where you want it to go. That's smart. Yep. Go. We got ourselves a video game here. Yeah, we may have a game. Oh. Oh, Kev saw that. Yeah. Yeah, we saw that. Oh, that's kind of nasty. That's going to be nice. Don't love the dual stick action here with the aiming and movement at the same time. Very tough to get a grip on it, but we'll figure it out as we go. I kind of love it. I don't know why. Oh, it's too much. Oh, too. Yeah. Oh, we're we're in. We're in. All right. All right. So, press A to avoid tackles. So, I think I finished the workshop. It's funny. They did not give me a pass button. Yeah. No pass. No passing allowed in this game. I think that's just a shoot. Yeah. Yeah. You're vulnerable. And dri Well, there's two",
            "start": 788.2
        },
        {
            "text": "the workshop. It's funny. They did not give me a pass button. Yeah. No pass. No passing allowed in this game. I think that's just a shoot. Yeah. Yeah. You're vulnerable. And dri Well, there's two more blessings, so play the other two. What happened to my game? RBA. Dude, you got to do it. Hey, no. My controls just I think my game. Yeah, I think so. My controller is just like vibrating a lot. You're vulnerable. Yeah. All right. I did it. Hold on. I think my game froze. I did it. I'm going to be goalie. Calling it now. I'm playing goalie. Avoiding all avoiding all passing responsibilities. Bounce shot off the wall is a good strat from what I've seen. Yeah. A little Rocket League action there. Yeah. Control scheme is unique, but so bless. It's a It's a control thing. Like you kicked it too hard. Yeah, I like that you have that is like that tap I think is good. Yeah, it's supposed to I like the tap A of like if you're accepting the ball and then you want to quickly turn bless and get up",
            "start": 854.16
        },
        {
            "text": "hard. Yeah, I like that you have that is like that tap I think is good. Yeah, it's supposed to I like the tap A of like if you're accepting the ball and then you want to quickly turn bless and get up the field with the quick tap A and flip. I like that. Ooh, can you customize the buttons or No, I need the Xbox app. I'm pretty sure you can't. Yeah, Xbox. I think you would need to get some back paddles going. Well, I'll just go to my Xbox accessories. Back paddles is right. Oh, yeah. That's what it's there for. I don't love sprint on left bumper. It is weird. Left bumper is about to go to my D-pad or onto my stick here. Configure. We're going to go to slot two, please. Is uh L3 anything to me. No, R3 is just call for the Oh, I see. Oh, no. It's red. You I think you have to get the Oh, they're saying when you want it to control presets, there are presets you can [ __ ] with. Oh. Oh, yeah. and default preset. Click stick preset. It doesn't show you what they are. Oh, look. They have a",
            "start": 904.16
        },
        {
            "text": "saying when you want it to control presets, there are presets you can [ __ ] with. Oh. Oh, yeah. and default preset. Click stick preset. It doesn't show you what they are. Oh, look. They have a they have a a controller preset bless called FIFU. Oh, no way. That's [ __ ] awesome. So, extra effort becomes left click stick is like it controls like sefue. Tap is bottom. I'm I'm assuming more like FIFA. To tap the ball, it's uh cross or or the X button or A. Oh, yes. That's what I want. Yeah. So, you go to a controller mapping FIFU because I guess that's trying to be more like a FIFA thing. There's a no cam lock as well. Click stick is puts extra effort on left click instead of sprint button. Changes the binding. Keeps all other binding. Left stick click is extra effort. Oh, they already selling stuff chat. Oh [ __ ] Bottom face button is cross. Push ball is left face button. I need for the A for the dribble button to be on a back paddle. Always keep your thumb on the right stick. So, are",
            "start": 955.28
        },
        {
            "text": "stuff chat. Oh [ __ ] Bottom face button is cross. Push ball is left face button. I need for the A for the dribble button to be on a back paddle. Always keep your thumb on the right stick. So, are you guys ready to go or are you messing? I I'm ready to go. Give me one sec cuz now I'm trying to figure out what this second what this um FIFU preset is cuz I'm not even somebody who plays football games or soccer games. So it's like I'll just get acclimated. You know what I mean? But I would like another backpaddle. Why is it so hard to find a backpaddle around here? Oh, is it not? Every single one has somehow been taken out of all those [ __ ] things. I found one just loose at the bottom of everyone has been taken out of those. It's cuz no one puts them back. It's crazy. And then everyone Well, I'll tell you what happens. It's because people keep taking them off and it's usually Nick. It's [ __ ] Nick is right. And then he just never puts them back. He's right. That's why I have my one",
            "start": 1014.08
        },
        {
            "text": "I'll tell you what happens. It's because people keep taking them off and it's usually Nick. It's [ __ ] Nick is right. And then he just never puts them back. He's right. That's why I have my one controller for work and I just bring it everywhere I go with it. You know what we should do, honestly? Mhm. Is just because they're cheaper, buy a bunch of 8bit dough where they have the they have the buttons on the back already. You tell Kevin he'll buy them. Um, I could also buy you Kevin's in charge of all purchases. Can we not buy just uh more back battles? Oh, squared is pass on the regular scheme. What? Where did you find these schemes? On the I just started pressing square. System like game play. Oh, that changes everything. Okay, I'm I'm I'm good. All here. So, what are we learning? Bless. Uh, I'm just going to do the default, honestly, is what I'm sticking with. But squares pass. All right, I'm ready to rock. You ready? Yeah, I think I'm ready. It's going to take a second for me to",
            "start": 1077.84
        },
        {
            "text": "Uh, I'm just going to do the default, honestly, is what I'm sticking with. But squares pass. All right, I'm ready to rock. You ready? Yeah, I think I'm ready. It's going to take a second for me to get used to, but I'm ready. I know the back paddle the [ __ ] bottom of that thing. Yeah, you did. You want to continue 4v4? You want to play 5v5? Oh, there's two different ones. We'll play 5v5 this time so you can feel it. Yeah, let me feel it. We did 4v4. Let me feel it. I'd rather go 4v4. Yeah, I kind of like it being late. Too late. Well, yeah, it's too late. We got to see both of them. So, you got to see both of them. Then you can vote on what you prefer. Okay. I like that. I'm goalie. It's a democracy. I'm goalie. Yeah, I'm going straight to goal. H. Okay. Square is pass. Little barcode is to like tell them about bugs. Which barcode? You mean the QR code? Yeah. I mean, I'm sure you can scan it and probably join a Discord and tell them about stuff. Yeah. Pretty cool. Y'all should pick",
            "start": 1125.6
        },
        {
            "text": "to like tell them about bugs. Which barcode? You mean the QR code? Yeah. I mean, I'm sure you can scan it and probably join a Discord and tell them about stuff. Yeah. Pretty cool. Y'all should pick the same. Oh, you can wear the captain's jersey if you wanted to. Oh, that's cool. Or you can wear whoever. Am I the c I think I'm the captain. I'm going to rock my away jerseys. All black, bro. I'm going all black on the Away. Hello, Mr. Adrian. This shit's lit. This one. Oh, you guys got to go customize your [ __ ] Yeah. Our tag thing. All right. Is coming to you. You said square is to square seems to pass at least for Oh. Oh yeah. Okay. Interesting. They don't say that anywhere, interestingly enough. But not that. Andy coming to you. Boom. Oh, I'm after it. Andy, come back to you. There you go. Go up the lane. Go up that line. You're all free. You're free. I'm I'm uh I'm going to remain back. Break free. Oh, dude. I'm Oh, here we go. Shoot it. Shoot it. Come on. Come on. He's locked in.",
            "start": 1170.64
        },
        {
            "text": "go. Go up the lane. Go up that line. You're all free. You're free. I'm I'm uh I'm going to remain back. Break free. Oh, dude. I'm Oh, here we go. Shoot it. Shoot it. Come on. Come on. He's locked in. God slide on my knees. So crazy. Oh my god. So crazy. God damn. Play that replay, dude. Holy [ __ ] That was crazy. [ __ ] awesome. Mike just going right in the goalie. Get out. Oh, we have we have somebody on our team named Koozie. Get the [ __ ] out. The cooz. Get the [ __ ] out. Get the [ __ ] out. Get the [ __ ] out, dude. I'm going to stand here. I don't Get the [ __ ] out. Koozie, I'm in the middle for you. Oh, Koozie is going crazy. Koozie is doing moves. Oh, Koozie is sticking with it. Oh. Oh, damn it. I almost had that [ __ ] Am I supposed to be goalie so bad this guy him? How do you even pick goalie? You don't. You just run in and out, which is super cool. So, no one ever has to be locked into a position. The moment you step into the smallie, go I'm in the middle for you. Oh,",
            "start": 1235.52
        },
        {
            "text": "even pick goalie? You don't. You just run in and out, which is super cool. So, no one ever has to be locked into a position. The moment you step into the smallie, go I'm in the middle for you. Oh, Koozie's crazy. Oh, yeah. Should have in the past. So, you know, Slappy, I'm not leaving here, bro. I advise you to leave. We're playing 3v5 right now. Exactly. You can blame it on this kid. Mike, you know the pass button now. That was Stop. Oh my god, that was I couldn't save it cuz this kid had to go. You're goalie. You got Now I got it. Thank god. Whoa. Oh. Oh, let's go. Let's go. Let's Oh [ __ ] I just pass it. God damn it. It's all good. It's all good. If this kid stays here, we're just going to go three forwards then. If this kid's going to try to do mezzi, koozie, koozie, send it up, koozie. Oh my god. What a pass. Remis, read the room, dude. He's not giving it out. [ __ ] read the room. Oh, god damn it. Oh, koozie. Oh. Oh, I [ __ ] Remis, dude. Yeah, that guy thinks he's the best",
            "start": 1292.64
        },
        {
            "text": "Oh my god. What a pass. Remis, read the room, dude. He's not giving it out. [ __ ] read the room. Oh, god damn it. Oh, koozie. Oh. Oh, I [ __ ] Remis, dude. Yeah, that guy thinks he's the best goalie in the world. This guy's [ __ ] killing on D, though. Oh, what happened? What happened? He's still learning. He's still learning, brother. You dived out of the way of the ball. He kicked it right at you. Oh my lord, man. Things happen. Things happen to you. He He misread it. He misread it. It's fine. Yeah. Are you going back to goalie? Yeah, they put me in goal. Oh, good ball. I'm going for Oh, bless. Let's go. The [ __ ] Oh, no goalie right now. No go. A damn it. Oh, bless. Steal it. Oh, [ __ ] Oh, there's Mike Diamond over there. I'm learning the buttons. I'm learning the buttons. Big kick. That's you. Oh my god. Look at the clear. I'm in the middle for you. No. Oh, okay. I I'm the the passing is like so hard to get used to. Is there Is is pass the same as cross? You might just learn",
            "start": 1342.88
        },
        {
            "text": "That's you. Oh my god. Look at the clear. I'm in the middle for you. No. Oh, okay. I I'm the the passing is like so hard to get used to. Is there Is is pass the same as cross? You might just learn the buttons. Yeah, learn the buttons, babe. Learn the buttons. We mis figured it out though. Oh, you press Y, it will lock you in. I got that. Off the wall. Off the wall. Oh [ __ ] Off the easy. Oh, he passed it back. Just clearing it. He's clearing it. Oh, he almost had it. I should have dove for it. Oh my. Uhoh. I'm good. I'm good. Yeah. What's that cross button? Oh, look at that. I I don't know how to aim next time instead of die. There's like a little line that comes out when you Yeah. And I just don't know what it means. I I don't know how to I think it might be like the same where your reticle is at. Like that's I don't know actually. I got it. The [ __ ] [ __ ] Remis. [ __ ] Remis, dude. Read the room, Rem. Yeah, I don't know what Remis is doing. What I need to do is uh also put pass",
            "start": 1410.64
        },
        {
            "text": "is at. Like that's I don't know actually. I got it. The [ __ ] [ __ ] Remis. [ __ ] Remis, dude. Read the room, Rem. Yeah, I don't know what Remis is doing. What I need to do is uh also put pass on a back paddle. Oh, Remis, please send the ball to somebody. Remis. All right, there you go. [ __ ] me right now. Getting a cross across the [ __ ] goal line. Come on now, bro. Oh, see locked in. Oh, good send down the middle. Damn it. Oh, here. Oh [ __ ] Damn it. Too hard. I think I think the harder you hold it, Bless, the further it goes. Yeah. On the pass. Remis is calling for it. Oh [ __ ] Remis. Oh my god. Why would I throw it to you? I hate you. Oh, good. Thank you. I'm so rifle. Oh [ __ ] Yeah, they're trying to go crazy over there. Oh, Remis, send it up. My dude is tired, man. Send it up. Remis. Oh, good send. Okay, Remis, please. Remis, please play as a team, Remis. Oh, Goozie. Goose, I'm on the right for you. Was that a pass? Oh. Oh [ __ ] What the [ __ ] was that? You use the like",
            "start": 1459.92
        },
        {
            "text": "Remis. Oh, good send. Okay, Remis, please. Remis, please play as a team, Remis. Oh, Goozie. Goose, I'm on the right for you. Was that a pass? Oh. Oh [ __ ] What the [ __ ] was that? You use the like speed up, right? Yeah. I keep being out of stamina, I think, is the thing. Give it to me. Bless. Oh, that's a I hit the A button. I was trying to do the little Oh, nice. Great job. Get that [ __ ] out of here. Not in my house. Why did my character go the other way? Nice. Nice. Oh, man. I That's good. That's good. That's good. I beat him. Remis, you got to beat him. Oh [ __ ] You got to shoot. You got to shoot. There's four of you on him. Oh wow. He got out of it. That's crazy talk. Okay. Careful. Careful. Off the wheezy. I got Oh my god. Did you make contact? Yep. Holy [ __ ] That was crazy. This dude's doing stunts. Watch this. Watch my [ __ ] you, dude. Oh [ __ ] Oh [ __ ] Oh my god. God, he's a Oh shoot. Oh my god. Oh. Oh, thank God. That was almost real big. Remis, just send it down.",
            "start": 1512.72
        },
        {
            "text": "This dude's doing stunts. Watch this. Watch my [ __ ] you, dude. Oh [ __ ] Oh [ __ ] Oh my god. God, he's a Oh shoot. Oh my god. Oh. Oh, thank God. That was almost real big. Remis, just send it down. Remis, I'm ready to receive. Don't impress us. I'm ready to receive. Remis. Oh my god. Remis. Hey, it's freaking Uh-oh. Hitting his boy in the corner. Remis, I need you to lock lock that down. Get it out of here. Get it out of here, Remis. All right, overtime. Let's go. Remis, go. Oh my god. Who's that to? Use your team. The You suck. You suck. You could turn your mics on and then mute whoever has their mic on so we can yell at them. Mute. We might have to talk to them. Coach him up. You know what I mean? Coach him up. Off the wall. Off the wheezy. We're good. We're good. Go, go, go. That's you. That's you. That's you. Oh [ __ ] There you go. See him in the middle. I don't get this square [ __ ] You got a position. We got to take advantage of that. Can you hold square a little longer?",
            "start": 1570.32
        },
        {
            "text": "you. That's you. That's you. Oh [ __ ] There you go. See him in the middle. I don't get this square [ __ ] You got a position. We got to take advantage of that. Can you hold square a little longer? Uh-oh. Um, I got two on the right side. Remis is all alone. Somebody get the back fill. Oh, nice. Remis, you crazy, bro. I'm on the right. Give it to Andy. Why pass it across the [ __ ] field? We'll take that. We'll take that. We'll take that. Andy's wide open. Andy is wide open. One more. One more. No. Bless. God bless. Shoot it. Oh, that was great. That was still good, though. Oh my god. [ __ ] We had no defense. We have no defense. [ __ ] the walls, bro. The wall. Stay on number two. The wall. Press the button. Dad. Damn it. Remis. Give him a little prank hands. Give him a little prank. And Remis. Dude, I was on that. What is he doing? Okay. You know what I need? I think if you just stood there, he would have blocked. Yeah, I think so. It's cuz I pressed B, he did the thing. You know",
            "start": 1635.36
        },
        {
            "text": "Remis. Dude, I was on that. What is he doing? Okay. You know what I need? I think if you just stood there, he would have blocked. Yeah, I think so. It's cuz I pressed B, he did the thing. You know what I need? Tell us uh when when Kevin was like if you hold the square button what does that do and that's a great question and I need just like a free roam experimentation. Yeah, there's a free ro practice or you can just press B for free play. Oh, they have tutorials for everything. I only did the Did I only do the movement tutorial? Do the back to the passing. Look at the passing touch. Oh [ __ ] Yeah, they got multiple tutorials that I didn't how to share the ball. Yeah. Hop into that passing tutorial. Can we send that to perform a ground kick? Can we send that to [ __ ] Remis is right, dude. Remis, you suck. Yeah. So, the passing is also just the passing is also super aiming related. Oh, yeah. You got to be Oh. Oh. Perform ground kicked. Yeah, it's kind of weird. And I think it's",
            "start": 1688.72
        },
        {
            "text": "dude. Remis, you suck. Yeah. So, the passing is also just the passing is also super aiming related. Oh, yeah. You got to be Oh. Oh. Perform ground kicked. Yeah, it's kind of weird. And I think it's definitely a um that's something I'm going to want to have on a back paddle. Yeah, cuz it's hard. You got to be aiming and shooting at the same time. Oh, thank you for reminding me. I have the back paddle set up. I'll give give the rock. Let me pass it to you, dog. Here we go. I got to set that [ __ ] A volley. Oh, yeah. So, you can hit it before you even get it. Yeah, cuz you got to be like aiming and then you got to take your thumb off the stick, but the player might be in a different spot by that point. Here we go. Let's set this sucker. All right, look at us learning. Let's set this sucker to X. He keeps hitting even hitting it to form a Oh, R1 and square is lo. There we go. That's all I needed. The aiming is kind of finicky. R1 and X. Okay. Not good. Yeah, man. That second stick,",
            "start": 1735.36
        },
        {
            "text": "to X. He keeps hitting even hitting it to form a Oh, R1 and square is lo. There we go. That's all I needed. The aiming is kind of finicky. R1 and X. Okay. Not good. Yeah, man. That second stick, that's hard. Yeah. But I think you I think you guys that's why FIFA has perfected it with that the just the one stick really driving a lot of it. But then you go to the next level with the second stick. Perform a lob RB and pass the ball. Okay. I'm going to go into tutorial. I'm going to do the defense tutorial real quick. Get in that goalkeeping. That's where I thrive, bro. What is that? Mark your opponent in defensive stance. Oh, I press X to follow the enemy. Oh, okay. So, you don't really need a slide tackle every single time. Oh, okay. So, that you just get in the way with that. Yeah, like you L2 to strafe, but then X is kind of like your um like your regular tackle. Okay. Okay. It's like a dash, actually. Oh, I didn't even set this [ __ ] correctly. Whoops. Tackle enemies with RBB. There",
            "start": 1789.44
        },
        {
            "text": "L2 to strafe, but then X is kind of like your um like your regular tackle. Okay. Okay. It's like a dash, actually. Oh, I didn't even set this [ __ ] correctly. Whoops. Tackle enemies with RBB. There it is. That's what I was looking for. That RBB. That would have saved you in the last That would have saved me. I was looking for that RBB. Now you know where it is. Now I know. Now I'm about to [ __ ] some [ __ ] up. Oh [ __ ] Oh, I guess. Yeah, you don't even need to press that X. You just need to like strafe with them. Tackle enemies. Circle. Come on, bro. Oh, circles tackle. I see. Do I even need to move? Let's see. Yeah, if you double tap circle, you do that big dive. There he is. Yeah, he does. Well, it's L. So L1 in circle is the slide tackle, but then if you're just doing L2 in circle, it's like a regular like safe tackle. It's not doing it here, but okay. We feeling better. I'm feeling I'm feeling good now. I'm feeling way better, boys. I learned buttons. Let's go [ __ ] some",
            "start": 1861.2
        },
        {
            "text": "it's like a regular like safe tackle. It's not doing it here, but okay. We feeling better. I'm feeling I'm feeling good now. I'm feeling way better, boys. I learned buttons. Let's go [ __ ] some Wait, let me do I want to do the score tutorial real quick. We got ranked fives as well. We got to get to get more codes so we can get our friends involved. We need more We need more We need more people. Roger has a code. Roger, put up your computer. Just so you know, Roger's not doing this [ __ ] Do it the right way. Why did you agree to it? You're ridiculous. He knew I would say yes. He knew I'd say yes. Have you not done it yet? No, not yet. Jesus. He could have. He had a lot of time. That's why That's why I asked him. I was like, I don't think he's on Nobody's on Games Cast. He had so much time. I have a plan. Like, I needed to prep game showdown stuff. I have a plan. Also, the one that you were that you put up yesterday wasn't the one that I saw the two that I saw you filming. I didn't",
            "start": 1919.12
        },
        {
            "text": "I have a plan. Like, I needed to prep game showdown stuff. I have a plan. Also, the one that you were that you put up yesterday wasn't the one that I saw the two that I saw you filming. I didn't like him. Didn't like him. I feel that. Did I ruin it? Watson gets it. I've been there. No, you just say, you know, you get you put it out there and you're like, I don't like that. Shoot R2. Can you now just be like, maybe I didn't like maybe I liked it a little bit. This one I'm going to talk about Fridays and how much I hate him. That's You're an insane person. Oh, okay. So, you don't also Oh, you had a curve. So, you can't you can't a Wherever you're looking is not where you're passing the ball. Passing tutorial. No, do the passing tutorial. You need that. I did the I think it automatically locks to like Uhhuh. Actually, I don't know how it decides where these passes are going from. I think it's just like wherever you're like wherever your character is looking like cuz look, I'm in this",
            "start": 1974.4
        },
        {
            "text": "locks to like Uhhuh. Actually, I don't know how it decides where these passes are going from. I think it's just like wherever you're like wherever your character is looking like cuz look, I'm in this like free roam mode. Yeah. And if I if I'm running this way, if I'm running this way and I pass, it goes that way. So, it's basically where your left trigger or left stick is pointing. Yeah. Gotcha. Okay. Yeah. So, I cut it back there. If I want to go top right, I'll go over there. Mike, I'm ready. Load it up. I'm ready with you guys on. I'm ready. All right. Hold on. Hold on. [ __ ] Which one was lob? Was it L1? No, R1. R1 square. R1. Yeah, R1 pass. Uh, Cra is saying so like FIFA, right? No, I mean, no. Better. It feels way different from FIFA. It has similar ideas like the loading [ __ ] up, right? I I guess you know what FIFA does have it to where kind of where you're facing but FIFA also locks on to your teammates. Well, there is the lock on feature, right? I lock on to the ball. Uh,",
            "start": 2012.32
        },
        {
            "text": "right? I I guess you know what FIFA does have it to where kind of where you're facing but FIFA also locks on to your teammates. Well, there is the lock on feature, right? I lock on to the ball. Uh, how do I get out? Oh, you're ready. You can switch while I'm still in here. Come on, Valerant. Let us do that. You know, cuz I'm talking about for passing, right? Like FIFA will kind of magnetize the ball to like who you're passing. Or if you do a through pass, it kind of knows who you want to pass to and so it'll do it based on that. This game is way more loose. It seems like it's like very much where you're facing is where the pass is gonna go. Okay. This is cool though, dude. You could still just hit circle bless and you're in you can go free play while we're Oh, really? Oh, [ __ ] Okay, that's cool. I can't. You're the leader. Oh, that sucks. Plus, you already got all the You got all the I got all mine. Just let me be in gold, dude. If that If the other guy takes my gold spot, we got a",
            "start": 2062.24
        },
        {
            "text": "cool. I can't. You're the leader. Oh, that sucks. Plus, you already got all the You got all the I got all mine. Just let me be in gold, dude. If that If the other guy takes my gold spot, we got a big We learned how to push him out. You just stand there till he gets it. There we go. I wonder if there's a way to be like a home jerseys cuz I'm I'm wearing my home jersey, too. Let me They don't let me see Andy's home jersey. Like, I only get mine. So, cuz I'm captain. Oh, weird. Like, you can either pick your jersey or the captain's jersey. Oh, so that means I was captain then. Okay. I'm going back to gold. I'm passing the ball. All right. All right. We're good. Are you gold now? Okay, perfect. I'm going to stick to D for now. My fault. N brother. Nah, brother. Oh [ __ ] Oh [ __ ] All right. No. Oh, nice. That's all you, brother. That's all you. Andy on your left. Andy on your left. You're all set. Oh, I should have passed Andy. My bad. Yeah. And you could have drove in more. You had",
            "start": 2103.92
        },
        {
            "text": "No. Oh, nice. That's all you, brother. That's all you. Andy on your left. Andy on your left. You're all set. Oh, I should have passed Andy. My bad. Yeah. And you could have drove in more. You had plenty of room. You got plenty of time. Yeah. Out of stamina. Get Andy. Mike's locked the [ __ ] [ __ ] Extra effort. Come on. Extra effort. [ __ ] bodying me, bro. This guy's bodying me right now. Damn it. Oh, let's go, Lucen. Fueler. This guy's bodying me. How do I Yeah. Get the [ __ ] out of here. Oh, Andy's coming to you. Hit me in the middle. Oh, shoot out the wall. Bless. Oh my. Oh, nasty. I feel it. One of their players is just hugging me, dude. So, you guys are playing threeon two. Lock it in. Let's go. Bless. Go. Anyone you That's my bad. That's all good. It's all good. What are you doing? What are you What are you doing? What are you doing? Get out of here. He's keeping you tense, bro. Yeah, he's trying to Oh, he's cherry picking. There you go. That's what he was waiting for. We",
            "start": 2159.76
        },
        {
            "text": "What are you What are you doing? What are you doing? Get out of here. He's keeping you tense, bro. Yeah, he's trying to Oh, he's cherry picking. There you go. That's what he was waiting for. We have no defense. I got it. I can hang out back unless Lucen is going to. Yeah. What you know about that? What you know about that? No. [ __ ] you. That's a foul. Go, go, go, go, go. Threeon one. Twoon one. Twoon one. That's all you, Andy. Oh, no. Oh, please cross up. Oh, he's crossing to you. A damn it. On him. [ __ ] you. Oh, I almost saw that [ __ ] Andy, the intent was there, though. We saw it. You saw that [ __ ] It's all you. It's all you. Oh, [ __ ] you. They got one behind you. Bless right side. Here it comes. Great kick. Great touch. Oh, [ __ ] Great touch. Oh, he just [ __ ] you. Get it. It's you. Come on. Oh my god. You got to flip it over his head. You got to do that flip move. Good job. Good job. Oh, let's go, Lukan. Oh, where'd he How'd he get here? Get the [ __ ] out of here. Andy",
            "start": 2208.16
        },
        {
            "text": "you. Come on. Oh my god. You got to flip it over his head. You got to do that flip move. Good job. Good job. Oh, let's go, Lukan. Oh, where'd he How'd he get here? Get the [ __ ] out of here. Andy again. He's the one. Go, go, go, go, Andy. It's all you. Is you're all by yourself. You have plenty of time. [ __ ] you. Good try. Good try. Hold. I got XP just for like on target. That's kind of a great shot. It was a great shot. That's kind of neat. Oh, nice. Yeah, we're locked in on D. Get out of there, bless. Yep. There you go. Get there, Andy. Get there, Andy. Pass it. Go, Andy. Two on one. You and him. You and him. You and him. Please do one more pass. Pass. Pass. We'll take that. We'll take that. We'll take that. He's number 69. 69. Oh, I know. I said sorry. I'll just end the Oh, bro. Dude, they they don't got the great wall of Howard back there, bro. Then I got Luke and I got that. That's you coming to you. Bless. Yep. Let's go. Let's get out of here. Oh, I got you, Lucen. Oh, I",
            "start": 2259.16
        },
        {
            "text": "Dude, they they don't got the great wall of Howard back there, bro. Then I got Luke and I got that. That's you coming to you. Bless. Yep. Let's go. Let's get out of here. Oh, I got you, Lucen. Oh, I don't got you. My bad. Oh, that got to him. Oh, never mind. What was uh strafe again? Oh, L2. Oh, L2. All right. A L2 and then A to like kind of get in front, right? Yeah. Or L2 and B. Well, A is like a dash. Oh, that that you that was great thinking. That was great predictive. Oh. Oh, nice point. Great tackle. Great tackle. Oh, I got it. Oh my dangerous. Yes. coming to you. You got to say a name after that. Luke and Fula, let's go, Bliss. Oh, I tried spinning you back around just to go backwards. I'm getting my stammy back. No, that was scary. We're good. Oh my. Get that [ __ ] out of my house. Go, Andy. Go. Streak it. Streak it, Andy. Streak it. It's a blast now. Cloud failed. Oh, quick pass. Oh [ __ ] God damn it. the wrong way. I got middle. I got middle. I'm here. I'm locked. Nice",
            "start": 2321.04
        },
        {
            "text": "Go, Andy. Go. Streak it. Streak it, Andy. Streak it. It's a blast now. Cloud failed. Oh, quick pass. Oh [ __ ] God damn it. the wrong way. I got middle. I got middle. I'm here. I'm locked. Nice job. Bless. Way locking this guy down. I'm locking this guy down. I loved it. I love it. We need to gain rate ASAP. I need to gain rate ASAP. Get after it. Good job. Go, go, go for it. I got middle. Three on two. Three on two. All you. All you. Godamn. I don't know how to pass. You got to pass. It's all good. I did. We're good. We're good. We're good. Oh, he's doing tricks, Mike. He's stunting. He's doing tricks on me. Nice, boy. Come on, all you. All you bless. You got plenty of time. Plenty of time. Keep streaking. Oh, sorry. Oh [ __ ] I got it. Andy, coming to you. Yeah. Yeah. No, I got to go to Lucas. Fuel. Oh my god. Go. Three on one. Three on goal. Three on goal. No one in your way. You got plenty of time. Why? Oh, sorry. I wanted to pass. It's hard, right? It's weird. So weird. It's like",
            "start": 2399.68
        },
        {
            "text": "Lucas. Fuel. Oh my god. Go. Three on one. Three on goal. Three on goal. No one in your way. You got plenty of time. Why? Oh, sorry. I wanted to pass. It's hard, right? It's weird. So weird. It's like I got to face your direction. I'm here. I'm fine. I'm fine. Yes. Bless. That's all you Oh. Oh, I pressed. Dude, he had a good play. That was That was nasty. That was nasty. He had a good play. Damn. Damn. He's got sexy hair, too. [ __ ] God damn. [ __ ] He's really just stunning on us. That was tough. Beautiful hair. Great kick. That's a good kick. That's a good kick. Mike, are you gonna replace Lucen Fueler? [ __ ] yeah. Lucen Fueler, bro. Get out of here. He knows he doesn't want it. He doesn't want the responsibility. He doesn't need it. Just hit just hit me. Oh, there you go. There you go, Lucan. Oh, brother. Uh-oh. Uh-oh, brother. Uh-oh. Get great job, Mike. you bless off the wall. Yep. Oh, what was that ball push? All right, we're going to get We're going to get tackle tackle. Lucas",
            "start": 2452.72
        },
        {
            "text": "Lucan. Oh, brother. Uh-oh. Uh-oh, brother. Uh-oh. Get great job, Mike. you bless off the wall. Yep. Oh, what was that ball push? All right, we're going to get We're going to get tackle tackle. Lucas coming to you on the right. I'm on the right. Come back. Come back. Come back. Oh [ __ ] Oh my Jesus. Oh, we left him all alone. I'm going to jump in the air. I said you said you knew the B son of a [ __ ] It's on one button. That's all I got. It's a one button game. That was crazy. You were standing in front of it. Crazy. This is a great game. Damn. This is a This is a fun one. Damn. I don't know about that white lipstick, though. I don't know about that white lipstick. He's right. That was crazy. I need to lock in better. I'm I'm going to get the passing down. Yeah, we need to figure out the passing. Then you The passing is so weird. The passing Mike jumped 30 seconds early. He dove. He dope. That was the It doesn't like It doesn't work how you would expect. I wouldn't expect it to work.",
            "start": 2512.92
        },
        {
            "text": "passing. Then you The passing is so weird. The passing Mike jumped 30 seconds early. He dove. He dope. That was the It doesn't like It doesn't work how you would expect. I wouldn't expect it to work. Yeah, that was weird. Okay, Mike should not be keeper. No, Mike needs to be keeper. Dead head's beating down on me. Dead head, when I put up this [ __ ] this goose egg over on our side, you're going to owe me one. Okay, eventually. This is it for you. Shut up. All right. Oh, so yeah, the the way the way I'm looking at it, if I'm running down here and I see you over there, then I got to go. Yeah, exactly. Then I got to go. That work, right? Like this is some like simulation type. And I could like pass it behind myself if you're like I can go like that. You know what I mean? Okay. It's just weird cuz like you're like in my brain I'm running forward. Yeah. And I'm looking that way. I want to keep holding forward and you're looking that way. Yeah, that's a good point. So, at the last second,",
            "start": 2576.72
        },
        {
            "text": "cuz like you're like in my brain I'm running forward. Yeah. And I'm looking that way. I want to keep holding forward and you're looking that way. Yeah, that's a good point. So, at the last second, like when you know you're about to pass, you got to just hit that different direction. Yeah. Back. We're back. We're back. That kid spent money. Shout out. Max Matthews the second. He's serious about the game. This kid's [ __ ] All right. I'm wearing Max Colors. We're Max Colors, Andy. Where Max. We're rocking the Arctic Blue. All right. This is the one. Cuz y'all are ice cold. District bully. Got ice in our veins. Y'all got to upgrade your [ __ ] player profile things. I'm going to do that after this. Coming back. You're good. Oh, max defeat Matthews. There we go. I'm on the left. Oh, [ __ ] I just got tackled real bad. Oh, got it. Bless come to you. Broke my ankle. That's all you big daddy. Going to cross in the center. Go for it. Oh, right there. Oh my god. Oh, freaking go. Way to go.",
            "start": 2628.88
        },
        {
            "text": "I just got tackled real bad. Oh, got it. Bless come to you. Broke my ankle. That's all you big daddy. Going to cross in the center. Go for it. Oh, right there. Oh my god. Oh, freaking go. Way to go. Woo! Holy [ __ ] No, no, no, no, no. Beautiful. It reflected off my body. Jesus, it was all you, dude. Yeah, let's hustle right back. Let's hustle your dick. Yeah, like Christian Pissic. Oh, I'm on the left side. Oh, I got tackle from behind us. I was shooting it. I had an empty. I'm trying to follow up on it. Golaso. Golaso. Mike, way to go. What' you do about that, Dad? That's for you. No, we're we're seeing like weird like net code type of stuff. Yeah, like Mike's blocking, but on my screen it looks like it went by him. On his screen, it looked like it went by. Yeah. Oh, that looked in the net code made. They need that roll back is what they need. Well, you can see we're playing the Europe servers right now and it's probably not the best idea. Solid connection here. Oh, so out of",
            "start": 2672.6
        },
        {
            "text": "the net code made. They need that roll back is what they need. Well, you can see we're playing the Europe servers right now and it's probably not the best idea. Solid connection here. Oh, so out of position, too. That's that's that's the surfer. That's right. No, Max Matthews II is from [ __ ] H. [ __ ] it. God damn it. Dang. He said that right to me. There you go. Let's go, Max Matthews. Let's go, Max. Yeah. Work him, Max Matthews. I'm working, Max. Oh, who was that, too, brother? Okay, I'm running back on D. Running back on change the server. No, I'll play defense. I'll I'll play defense, dog. Get the [ __ ] out of my way, Mike, bro. Get that. Go, bless. Oh, baby. Right up the wall for you. Let it go. Going to set it in the middle. How'd I lose it? Oh, big slide tackle. Uh-oh. Double big. Oh, I thought I had it. [ __ ] I thought I still had the ball. Yeah, sometimes you just lose. Kick that [ __ ] out. Go Blitz to you, big dog. Oh my god. Let's go. Bless. Let's go. Oh my god.",
            "start": 2737.0
        },
        {
            "text": "big. Oh, I thought I had it. [ __ ] I thought I still had the ball. Yeah, sometimes you just lose. Kick that [ __ ] out. Go Blitz to you, big dog. Oh my god. Let's go. Bless. Let's go. Oh my god. Someone shoot it. He was above me. What the [ __ ] That was He was above me. What's that code? Yeah, the net code is I think weird. Mike, you got lucky on that one. Got him. Oh, Mike is risky. Get back, [ __ ] I'm going to cut up center. I got Everybody spread out a little bit. Spread out left. Oh shoot. We got That was bad. We got no D. Oh, I gave it to him. It's the Europe server. I gave it to him. It's the Europe server. He gave it to him. Mike kind of knows the buttons. Oh, I know. I knew exactly what I was doing. I went for the slide and he went over my head. But you slid to the right instead of like Well, you when you're on the server and it's so bad, you don't know how far away I actually am from him. I thought I was closer for sure. They go Max Matthews. Except Yeah, we got to get out",
            "start": 2804.16
        },
        {
            "text": "of like Well, you when you're on the server and it's so bad, you don't know how far away I actually am from him. I thought I was closer for sure. They go Max Matthews. Except Yeah, we got to get out of Europe. They're just could right now. They're they're we're playing on their terms right now. Yeah. Yeah. Oh, I bet. Was it 3:00 a.m.? Oh, great tackle. Nice. Europe time. Blessing come to you. I imagine. Yeah, it was to accommodate for them. Yeah. I'm going to um cross it in the center. I like it. I like it. I wasn't facing the right way. Oh, right back to you. Oh [ __ ] Yeah. Practice the jump, Mike. Pressing all the buttons, bro. Oh, damn it. [ __ ] Oh, blocking them down. Oh [ __ ] that was some nasty. Damn it. As soon as I get to the ball, it just jitters and I don't have it anymore. I'm having the same thing. Great save by diving save. Press a button. I'm learning the buttons. Good. That was We're bouncing. We are bouncing. Ah, [ __ ] you. Damn it. All right, Max, that's you. I'm",
            "start": 2862.0
        },
        {
            "text": "having the same thing. Great save by diving save. Press a button. I'm learning the buttons. Good. That was We're bouncing. We are bouncing. Ah, [ __ ] you. Damn it. All right, Max, that's you. I'm stay [ __ ] Mike running out there. Get me that. Give me that. Nom nom nom nom nom nom nom. It tastes so good. I Oh, that that was so close to them scoring. Come on. Hustle your ass over there, Andy. All right, back into defense mode. Okay, they're just clearing it. One. One. One minute left. Oh, I'm in the center for you, brother. Come on, Max Matthews. One more. Max, just one more. Max Matthews the seconds. Goalie's out. Goaliey's out of position. A [ __ ] He just did a cool move. Yeah. Mike, don't lose this game. [ __ ] no. I won't. Go Andy, go. I b him. Oh, that's a sane pass. You like that? You like that? Shoot it. Shoot it. Max Matthews the second. Let's go Max Matthews. One more. One more. No. What the [ __ ] It's the net code. It really I'm there. I'm there. Keep the ball in their",
            "start": 2929.92
        },
        {
            "text": "You like that? Shoot it. Shoot it. Max Matthews the second. Let's go Max Matthews. One more. One more. No. What the [ __ ] It's the net code. It really I'm there. I'm there. Keep the ball in their half. Keep the ball in their half. Keep the pressure on them. Ah, [ __ ] you. Yes, but shoot it. Shoot it. Bl. Shoot it. Oh [ __ ] What the [ __ ] just happened there? They [ __ ] They were driving. It's the internet. It's the internet. It's the internet. Max Matthews. Godamn it, dude. Parliament. I thought we had that. I was two steps behind. You're not hearing the music? Yeah, the music very quiet. I'm I'm going to turn the audio up. I have the audio too low. It's quiet for me, too. Yeah, it's very quiet. Very quiet music. It's like blue on the left side. Oh, I passed that. Like what? Max was over open over there. You can still score. Oh my god, he's wide open. One more. Oh my god. Andy, you have to score. No, I got tackled from behind. I got knocked down. We got to get out of this Europe",
            "start": 3013.84
        },
        {
            "text": "over open over there. You can still score. Oh my god, he's wide open. One more. Oh my god. Andy, you have to score. No, I got tackled from behind. I got knocked down. We got to get out of this Europe server. Yeah, we got to get out of Europe. We got to get out of this shitty server. This is bad. I don't Where did the ball go? That's [ __ ] That doesn't count. That one doesn't count. [ __ ] terrace. Exactly. They dubbed it to Kaiser. Oh my god. All right. So, what did you want me to uh to um edit, Mike? I You were like, you got to customize that thing. Pro player card or what was it? Oh, your player card. Yeah. Go to customization. Oh, profile. Profile. And then change up that player card, bro. Get [ __ ] Let's set this thing up, bro. Mike, see if there's a way you can switch servers. Everybody be the cheetah. We're the cheetah team. Everybody's cheetahs. Cheetahs. You'll see it on your You You get a little uh You'll see it on your player card with a cheetah team with the Jaguars. Card",
            "start": 3067.6
        },
        {
            "text": "be the cheetah. We're the cheetah team. Everybody's cheetahs. Cheetahs. You'll see it on your You You get a little uh You'll see it on your player card with a cheetah team with the Jaguars. Card background. Oh yeah. Yeah. With the Jaguars. Big game player. Cool kid. District bully. Oh, bless. You got to make yours got to go fast. Oh, of course. That's good. Were you able to change servers? No. Did you look? Yeah, there's nothing in there under system. Yeah, nothing there. There's got to be a way. Big game player. We're still loading, right? I'm waiting for y'all. Oh, I'm good to go. Last thing. Uh, give me one second. Should we go 5v5s now? Check out 5v5. Yeah, we'll check out 5v5. Says somebody's still in a match. Okay, I'm ready to go. I see. Okay, still so as you're loading up your kick. What was that? If I go here, it's a lob. If I'm aiming there, but I aim right, it's going to curve that. Okay, cool. That's pretty cool. Whoa. Oh, okay. Man, this is really sick. Okay, aim here. Go",
            "start": 3117.92
        },
        {
            "text": "What was that? If I go here, it's a lob. If I'm aiming there, but I aim right, it's going to curve that. Okay, cool. That's pretty cool. Whoa. Oh, okay. Man, this is really sick. Okay, aim here. Go curve it away from people. Sick. Like you got to make sure that you stop moving the left stick as you're kicking. Yes. Yeah. Ranked is probably isn't enabled yet. Ranked is on. We can play ranked fives. We'll try it right now. We're not there yet. I'm sending new invites out. Oh, I'm not in your thing anymore. Oh, I I backed out. I had to restart. Oh, okay. I was freaking out. [Music] How are people doing those cool um like the cool tricks and [ __ ] They showed me in PRA in like the tutorial, but I already forgot the buttons. I think it was like it was like R1 plus push ball or something like that. Oh, yeah, it is. It is. Did you both join? Yeah. I mean, all right, I'm going to start a game. I don't see you in mine, but let's Oh, yeah. There it is. Yeah. R1. Um Yeah. Yeah. Oh, I just did",
            "start": 3193.48
        },
        {
            "text": "that. Oh, yeah, it is. It is. Did you both join? Yeah. I mean, all right, I'm going to start a game. I don't see you in mine, but let's Oh, yeah. There it is. Yeah. R1. Um Yeah. Yeah. Oh, I just did it. I just bounce it on my head. Yeah. Oh, this is cool. This is cool. Yeah, I like this. You weren't in my lobby. Mario, not Bros. What up, big dog? We're not in your lobby. Why not? It says I'm up there. Look, I asked all of you in my lobby. You're not getting Yeah, I thought I joined. You sure that's not bless? Yeah, that. Did I not join? So, well, I mean, look right here. You accepted an invitation to play 114. I just did it. So I guess you got to do it in the I accepted it in game. I thought he's in a match. Yeah, now now I'm in a match. I mean a player match. I'll stay in practice mode. Well, hopefully these kids will quit. Get captain pass. What is the captain pass? One kid quit on the other side. So maybe you're going to need better cosmetics than that, buddy. Oh, that's cool. You",
            "start": 3281.04
        },
        {
            "text": "Well, hopefully these kids will quit. Get captain pass. What is the captain pass? One kid quit on the other side. So maybe you're going to need better cosmetics than that, buddy. Oh, that's cool. You can customize your stadiums. All right. New match, new new invites coming out. Okay. All right. So, I hit play game. It's I I think my game maybe just be broken cuz it still says that I never accepted your first one either. It says error. Yeah. Let me quit out. Yeah, let me do that, too. Quit on out. Actually, I think it So, who's this with me? It says we were still in Mike's old party. Yeah, I'm gonna quit out Fernie trip07. Thank you for resubscribing for 29 months. Appreciate you. Nitro 521 says FIFU. Let's go. All right, I'll take another invite from you, Mikey. There we go. I see it. Accept. Bam. Okay. Um, Mike, can you send me another one? I did. Sick. All right, we're going. All right, let's go. We're back. I'm feeling good about this now. We're back. We're getting that W. Okay,",
            "start": 3336.8
        },
        {
            "text": "Bam. Okay. Um, Mike, can you send me another one? I did. Sick. All right, we're going. All right, let's go. We're back. I'm feeling good about this now. We're back. We're getting that W. Okay, cool. R1 to do the bounce. R1 to dribble. Okay, so R1's kind of like your little modifier. Yeah, for dribbling and for passing. [Music] X is push ball, which is good for receiving. Oh, damn. We're doing the blackout game or what? Oh, blacked out. Blackout game. We're selling uh memorabilia. That's like the the blackout game. We might be uh down a man too, so be ready. Oh, sick. I saw that kid just hit leave. Oh yeah, it's a six out of seven. Oh, that's tough. Oh, 3v3. That's fine. We're going to play some offense. We're going to leave. We're going to We might go open goal on this. We'll see what happens. Oh [ __ ] Dangerous. Is that a good move? All right, they got the ball first. Big fall back. All up. Get out of the uh square. You still got the hands. Oh [ __ ] I'm out. Good. Okay. Just jump",
            "start": 3414.36
        },
        {
            "text": "Oh [ __ ] Dangerous. Is that a good move? All right, they got the ball first. Big fall back. All up. Get out of the uh square. You still got the hands. Oh [ __ ] I'm out. Good. Okay. Just jump too early. You're good. All right. I'm going to run up right side. Scumbag just joined our game. Sick. A damn it. Nice. Nice. Andy. Oh, nice scumbag. Let's go. Oh [ __ ] Where'd he go? Bless. Hi. Yes, that's close. That's close. Send it back in. Please send it back in. Let's go. Let's go. Go. Go. Come on. Go. Hit that knee slide. God. Hit that knee slide. That was good. That was great. Look at that back. Little back pass. Oh, that curve right in. Beautiful. Hot, dude. So sick. Is this camera always zoomed out or you have it zoomed in? Well, you can mess with the FOV. I have my FOV kind of maxed out I think at 90. You could go lower. Oh, you got it. You got it. I tried to put curve on it on the outside. I just got to get good at shooting. I shouldn't try to be doing stunts. Ah, damn it. Mike is",
            "start": 3483.2
        },
        {
            "text": "I think at 90. You could go lower. Oh, you got it. You got it. I tried to put curve on it on the outside. I just got to get good at shooting. I shouldn't try to be doing stunts. Ah, damn it. Mike is back there diving. He's pressing my button. He's practicing, bro. Oh, the dribbling. Oh, he needs you. Guys, let's go. Let's go. Scumbag one. Oh, what the [ __ ] It like Oh. Oh, what the hell was that? They had to get it out of there. Oh my Oh my god. Holy [ __ ] [ __ ] out. Holy [ __ ] What the [ __ ] was that? Get that. Go, go, go, go, go, go, go, go, go, go, go, go, go, go. Andy, don't look back. It's all you. Nice pass. Let's come back. Oh, that's a good try. Good try. Oh, way to go. Bless. You got it back. I'm way over here. Oh, nice. That must be nice, too. Were you trying to lob it and went up? Nice blast. Way to be in front of that crosser. crosser. I'm trying to speed up. I don't got that record. What? Right. Oh, we still got Oh, [ __ ] Damn it. Oh, bless. There we go. See? Come",
            "start": 3558.2
        },
        {
            "text": "went up? Nice blast. Way to be in front of that crosser. crosser. I'm trying to speed up. I don't got that record. What? Right. Oh, we still got Oh, [ __ ] Damn it. Oh, bless. There we go. See? Come on, scumbag. Let's go. Let's go, big dog. One more in the middle. No. Scumbag. Let's go, Scub. Oh, that's nasty work. Oh, one more. Oh, damn it. My guys just tired. Crossar. I got to manage my stammy better. God damn. Middle. Okay. What do we do? What do we do? That guy left. I'm just clearing it. I got middle. Oh. Oh. What is happening? Ah, damn it. Oh, let's go. Scumb back. That's how you win. Damn it. I lost. You still got You still got it. Yeah. It's how you finish. That dude jumped up. That's how you finish. You might win this one, boys. Come on. Come on. [Applause] Yeah. You got to just keep running it out. Running through. Oh, the Hail Mary block. Hail Mary. Save it. They got scared. Scumbag. Scumbag. Greg, read the room. Read the room. Scumbag, Greg. There we go, scumbag. He knows.",
            "start": 3631.44
        },
        {
            "text": "running it out. Running through. Oh, the Hail Mary block. Hail Mary. Save it. They got scared. Scumbag. Scumbag. Greg, read the room. Read the room. Scumbag, Greg. There we go, scumbag. He knows. He gets it. He knows who the goal is. He just come right to you. Oh, never mind. Oh, scumbag. Oh, he's pass. Oh. Oh, almost. Oh, big freaking dribble right there. We're good. We're good. Ah, damn it. I tried passing. I got mid. Oh, bless. Best way to read that. Go, Bless. It's all you. It's all you. Beat him out. There you go. Little little footy taps. Little footy taps. Damn it. Oh, shoot. All right, I got him locked down. That was good defense. Oh my god. We're good. We're good. [ __ ] Oh, I was right in the block. Good. Get the [ __ ] out of my way. Yo, you beat him. You beat him. I'm in the middle. Guy's tired though. Pass in the middle. A [ __ ] All good. Oh, nice. Big way to step up. A lot of people left and right. We're good. We're good. Oh [ __ ] Oh, he need this on you. A They [ __ ]",
            "start": 3710.56
        },
        {
            "text": "Guy's tired though. Pass in the middle. A [ __ ] All good. Oh, nice. Big way to step up. A lot of people left and right. We're good. We're good. Oh [ __ ] Oh, he need this on you. A They [ __ ] tag me from behind. I scared him. I felt the fear. Oh my. Oh [ __ ] Scary. [ __ ] you. Big save. They're doing tricks. Oh, god damn it. No, that's a ball. That's a ball. Come on. Oh, my guy's just so tired right now. Want to come in the middle? Yeah. Yeah. Oh [ __ ] Scumbaggery. Yeah. Let's go scumbag. Great. That's what I'm talking about. That's a big assist. Scumbaggery. That was huge. Mike's taking some interesting chances with his clears. Look, it's all it's all, you know. You're not having fun. What are you doing? Yeah, it's all instinctive. Well, you want me to read a book back here? The team is we winning 3 0. I got to get involved. Okay. I'm kind of Do we have a goalie? Oh [ __ ] they [ __ ] up. They passed it wrong. Oh [ __ ] I think that was an own goal. Yeah, I'm baggery, bro. Auto",
            "start": 3780.96
        },
        {
            "text": "is we winning 3 0. I got to get involved. Okay. I'm kind of Do we have a goalie? Oh [ __ ] they [ __ ] up. They passed it wrong. Oh [ __ ] I think that was an own goal. Yeah, I'm baggery, bro. Auto goal. I think they just gave it to him. Oh yeah, he was probably the last of our team to touch it. There we go. We'll take that. Tackled it. 40. Is that like an auto win for I think that's an auto win. Oh, that's it, dude. That's it. Beautiful. That was great. We dominated. Yeah, we're on US servers. We're back on home court. East though. Yeah, dude. Just imagine if we're on west. It's over for unstoppable. Hey, I gotta go pee. I'm gonna leave it on uh Mike. Okay. Sick. He's gonna leave it on me. Thank you, Chad. We're in a a little hype train right now. Appreciate you. Thanks for supporting us. You're kind of funny. Going to keep on practicing these. Hey, going up by four is the mercy rule. Seems like I think I saw a popup earlier that did say um getting four points is the mercy rule.",
            "start": 3860.32
        },
        {
            "text": "us. You're kind of funny. Going to keep on practicing these. Hey, going up by four is the mercy rule. Seems like I think I saw a popup earlier that did say um getting four points is the mercy rule. We're playing fives now. Be prepared. Oh, we're doing fives. Yeah, we got we got to try fives. Extra level. 10 months of support. Appreciate your extra level. Thanks for subscribing. Holy [ __ ] We got Santa Claus in our squad. Tat it up. Santa Claus, [Applause] can I play the beta on Steam right now? I have no idea. Yeah, I have no idea how this works. I'm on Steam. No, but like uh if you request access, I don't know how open it is just to request. All right, we're on Europe servers again. This guy doesn't want to leave the gold. Come on, Raven. What are you doing? He was standing there, scumbag. He may he may be dropping server or connection or something cuz we're on Europe servers. I don't know why I keep saying sorry. I just keep hitting the thing on the D-pad. I even tried to save him.",
            "start": 3911.76
        },
        {
            "text": "He may he may be dropping server or connection or something cuz we're on Europe servers. I don't know why I keep saying sorry. I just keep hitting the thing on the D-pad. I even tried to save him. I don't know. He's not playing. You got to take that ball from him. [ __ ] Good there, Mike. Oh. Oh, [ __ ] you. That's a foul. All right, he's active now. He got He got his Uber Eats delivery. All right, the guy needed to take a photo of it. I'm going to be D. Oh, damn it. Oh, what happened? You just tore my I left the net. Oh, that's unfortunate. That's [ __ ] That's [ __ ] Thank you, uh, Merc with the mic. Where's the server at? 13 months. We're in Europe again. God damn it, Alaka Champ. 36 months. It ain't right. Thank you, Alaka Champ. It ain't right. That boy ain't right. All right. Yeah. Mhm. Oh, good ball. Damn. That was such a good shot. That's crazy. Oh my aggressive. Let's go. Come on, Raven. Watch the [ __ ] out. Oh, sorry. I wasn't there for you, Raven. Oh, off the wall. Oh,",
            "start": 3975.76
        },
        {
            "text": "Mhm. Oh, good ball. Damn. That was such a good shot. That's crazy. Oh my aggressive. Let's go. Come on, Raven. Watch the [ __ ] out. Oh, sorry. I wasn't there for you, Raven. Oh, off the wall. Oh, they're freaking out. They're freaking out. They have bad connection, too. Raven, hit that. Hit that, Raven. Oh, off the cross. Raven, cross it. Cross it. Cross that. Oh, crossing it again. They even have custom games, too, so you can play. You just cross it back and forth. One more hit. One more. Oh, come on. Get up. Oh, wait. The ball. I What? It looked like it was past him. I got it. Oh, no. Raven. Raven. Why'd you leave? Oh my god. [ __ ] Europe. [ __ ] Europe. That's not That's not fair. [ __ ] [ __ ] Europe, man. We're on Europe. I know. [ __ ] Europe. Yeah. [ __ ] Europe. SL like slides to the left. Good. We're on your game. That's three goals that Mike would have blocked if he stood there like He's learning the buttons, dude. Learning the buttons, dude. Day one. Let's go right back.",
            "start": 4063.36
        },
        {
            "text": "the left. Good. We're on your game. That's three goals that Mike would have blocked if he stood there like He's learning the buttons, dude. Learning the buttons, dude. Day one. Let's go right back. There we go. Oh, come on. He's servers, man. I'm sitt on one. I'm sitting right back. That was insane. Oh, sorry, Mike. You're alone. That's all right. Yeah. Yeah. It's not not a good setting right now. It's not a good setting right now for me. one-on-one with this guy. And that banding though, he was teleporting on him. All right, we lo Okay, we lost. That's We get out of the match. That's fast. Was that five people? Yeah. Denny Denny RP says, \"Try hard Mike.\" Denny, I have to stop trying now. I'm going to go uh film a Gregway so these two can play by themselves for a minute. For reals? Yeah. I'm going to go film a Gregway while they're here, boys. Good luck. We got this. How do you leave the party? Uh, I've left the party, but you guys need to go to this and then click leave party. So,",
            "start": 4145.88
        },
        {
            "text": "I'm going to go film a Gregway while they're here, boys. Good luck. We got this. How do you leave the party? Uh, I've left the party, but you guys need to go to this and then click leave party. So, you didn't leave the party. I leave. He's like, you guys leave my room. You left the room is what you did. You literally left the room. All right. Yeah, the game's broken. Yeah. He said, \"Don't leave.\" Well, that's why I couldn't join last time. Don't get mad at me. Is restarting. Yeah. Yeah. It's fun, dude. It's a fun time. really fun to cut around, too. I'm I haven't gotten it down 100%, but like it's cool. He physically let the party. He just [ __ ] physically got up and left. And he comes back with any tacos. I thought today was Blessings day for Greg. Uh, it is. He gave it to Mike. I gave it to Mike cuz I'm on the stream. Ah, the same stream that Mike's on. So, yeah, but I was also on CD. This whole time I thought the the Gregway he needed to record was the one from yesterday that he",
            "start": 4204.24
        },
        {
            "text": "it to Mike cuz I'm on the stream. Ah, the same stream that Mike's on. So, yeah, but I was also on CD. This whole time I thought the the Gregway he needed to record was the one from yesterday that he didn't record. Yeah. Did he ever record the one for yesterday? Uh, he did, but here's the thing. So, I went out there and he was recording one, right? And then he did another one with Roger and then the one he posted was clearly in here. So, he recorded three. Yeah, cuz we as we were leaving, we saw him recording one with Roger. Yeah. And it'd be awesome if he spoke one of those two. If he spoke for 10 minutes straight and just cut it off and like posted them in two parts. All right, I invited Bless. Uh, I should be in. All right, quick match. Are we doing quick match four? Do we like 4v4 again? Yeah, let's do 4v4. Andy, go into system. See if we can't put the server only in Europe or in the west. Yeah, cuz I feel I feel like he was lying to us. Yeah, I don't think he checked. I think we",
            "start": 4253.76
        },
        {
            "text": "Yeah, let's do 4v4. Andy, go into system. See if we can't put the server only in Europe or in the west. Yeah, cuz I feel I feel like he was lying to us. Yeah, I don't think he checked. I think we got matched. Um Kev, what's for lunch? What do I get for lunch? I That's That's what you ribs. No, I do ribs. I'll die. SS. Ooh, that's not bad. What's that? Oh my god. Andy doesn't even know. It's a new spot I'm putting people on, too. Is that the rice place? Yeah, it's like rice bowls. It's good. I love rice. Bless. You put it in there. I I'll I'll Venmo you some money. You throw my order in. Think about it. I mean, I'm I'm about to enter a match right now. Well, yeah. I mean, I'm not saying it's happening right now. We can do it after. Are you guys here? There's We're hearing dialogue. All right. How do we turn that up? I have voice chat muted. Oh, I have I guess I'm goalie now. What's the button? [ __ ] Okay, that's up. Oh, this is US West. Yeah, we're on west servers right now, so we",
            "start": 4295.36
        },
        {
            "text": "right. How do we turn that up? I have voice chat muted. Oh, I have I guess I'm goalie now. What's the button? [ __ ] Okay, that's up. Oh, this is US West. Yeah, we're on west servers right now, so we better win. Shoot. I should have asked Mike how he was dive play. I cannot play this game. I'm tell you right now. I'd be useless to them in this. Okay. Circle to dive. Damn it. Uh-oh. Bless. Uh-oh. It was bad. No, never mind. You're good. You're good. Bless. He made that [ __ ] look easy, too. So, I'm about to make easy, too. [ __ ] Yeah, it seems like what you got to do is like stand in place. No, he had some incredible saves. Oh, there you go. Oh, that's us. That's us. Oh, [ __ ] Over behind. God damn it. Damn. This is satisfying, actually. Hold on. They got shots on goal, man. But this is like you're you're playing a CPU right now, right? Me. I mean, they don't have any names. They're just 1 2 3 and four. That's how it's always been, I think. What was that? Yeah, the enemies. We never",
            "start": 4339.12
        },
        {
            "text": "like you're you're playing a CPU right now, right? Me. I mean, they don't have any names. They're just 1 2 3 and four. That's how it's always been, I think. What was that? Yeah, the enemies. We never seen the enemy names. Also, somebody's talking to me in my ear. Yeah. Hit hit start or pop. How did I turn mine off? I went to options. Let me tell you, they're frustrating. Andy, we need you. We need you, Andy. I went to options and audio. Options. Audio. Damn it. Voice chat off. Okay, we're good. We're good. They're gone. Man, the ball gets near the goalie and I switch right Mike. Come on. Oh, damn it. I don't know. I might I might be locked in as goalie. I might like this. He won't let you do that. He's not going to let you take that. You got You got to take that from He won't let you. You're making moves out there. He's He's never going to learn the buttons like you have. Oh my god. Oh my god. Oh my god. Go, guys. Go, go, go. Let's go. Unique era in the middle of unique in a [ __ ]",
            "start": 4401.28
        },
        {
            "text": "making moves out there. He's He's never going to learn the buttons like you have. Oh my god. Oh my god. Oh my god. Go, guys. Go, go, go. Let's go. Unique era in the middle of unique in a [ __ ] Damn. One tried to take you down when you hit the ball in your I know that was [ __ ] up. I don't think that's Let's go, Miles. Let's go. Oh [ __ ] I was prepping my shot already. Oh. Oh, [Music] unique. All right, come on. We're patient pee right here. Damn, that was a sick ass little dribble. They're kicking into the wall to cause chaos. I don't like that. Are they playing one down or are you guys playing one down? We're all four four. Okay, never mind. Yeah, I just don't I [ __ ] [ __ ] Oh, here we go. Oh, that was looking good for us. Damn it. Oh, Miles. Come on, Miles. Oh, no. Right here. Yes. Yes. Love that. Come on. Absolutely love that. Come on. Oh man, so close. I can't believe he's leaving for like 15 minutes. Come on. Get me out of the freaking goalie. Come back. Yeah. Let me drop",
            "start": 4453.52
        },
        {
            "text": "Yes. Love that. Come on. Absolutely love that. Come on. Oh man, so close. I can't believe he's leaving for like 15 minutes. Come on. Get me out of the freaking goalie. Come back. Yeah. Let me drop back. Okay. Was Mike strafing when he was playing like this? Um I don't know. Only God knows. Yeah. He was moving quick though. He was doing pretty impressive [ __ ] Okay. But he also kept diving the wrong way. So I don't know that he had a full faculty of all the buttons cuz I feel so I feel I feel like I got this thing locked down. I feel alive. I'm feeling good right now. Oh shoot. You got to prove it. You got to prove this. Oh, that's easy one. Yeah, that's easy. Oh, it's going for you. Oh, that's [ __ ] That's not my bad. I thought that was my team. Good job, though. Let's go, Miles. Oh, let's go. Oh, that's it. That's it right there. Oh, [ __ ] What happened? There we go. Their goalie fell asleep. The wrong way. Their goalie probably disconnected. Look at this idiot. Look, he's just",
            "start": 4521.12
        },
        {
            "text": "let's go. Oh, that's it. That's it right there. Oh, [ __ ] What happened? There we go. Their goalie fell asleep. The wrong way. Their goalie probably disconnected. Look at this idiot. Look, he's just like, \"Oh, he's just standing there. They stopped moving right at the last second.\" That's hilarious. Let's send this to a freaking 40. Hold on. Now they're playing. Okay, our goalie wants to stay there. Oh yeah, you just giving it to him like that. Yeah, I mean I'm not Listen, I'm not Mike, you know. I can play any position. Yeah, but can they? I mean, we're about to see. Oh. Ah, damn it. Why? Why didn't I grab it? Nice. Here on the left side for you. Oh. Ah, [ __ ] It's all good. I got to not try to do these [ __ ] I don't know why I'm trying to no look. Oh [ __ ] Let's go, Miles. A damn it. Uh-oh. Unique. Uh-oh. Oh, that's dangerous, Unique. Oh. Oh, Unique. Uh-oh. [Applause] It's all you, Andy. Come on, Miles. Good try. Let's go, Miles. That's you, Miles. Miles, let that go. A That's a",
            "start": 4583.72
        },
        {
            "text": "Uh-oh. Unique. Uh-oh. Oh, that's dangerous, Unique. Oh. Oh, Unique. Uh-oh. [Applause] It's all you, Andy. Come on, Miles. Good try. Let's go, Miles. That's you, Miles. Miles, let that go. A That's a good save. That's a good try right there. Unique. Uh-oh. They're getting horny with it. They're getting excited. Great save. Unique. Get the [ __ ] Yes. Yes. Is he okay? No. Here. Let me be goalie. Let me be go go goalie. Go. Go live. Okay. He doesn't want to. Go live. Go live. Great tackle. Let's go. Bless. Big pass over here. Oh, Andy, that's you. Andy, that's you. Damn it. Getting a lot of opportunities. That's all you can ask for. Oh, come on. Damn it. [Applause] No. Send that right back in. Ah, damn it. They deflected it a bunch. Oh. Oh, yes. Plus locked in. Oh, it's too hard. It's okay. It's okay. Still in the middle for you. Ah, damn it. Oh, we're going to win. We're going to win. Help. Oh, one more. One more. One more. Damn it. Oh, they give you a last shot. That's fun. Wonder how",
            "start": 4643.04
        },
        {
            "text": "It's okay. Still in the middle for you. Ah, damn it. Oh, we're going to win. We're going to win. Help. Oh, one more. One more. One more. Damn it. Oh, they give you a last shot. That's fun. Wonder how that works. All right, cool. Hell yeah. Hell yeah. The team is better when bless isn't in goal. I thought we were popping off. We were popping off the whole game in my opinion. Is that my It is. Yeah. Yeah. Welcome in. What? We're on break from our tour. Our European tour. That's why we were getting European service. blessed with the MVP. Look at that, dude. Three P seven interceptions, four saves. I'm just [ __ ] locking. Give me any position. I'm everywhere, Chad. He's like Travis Hunter. Yeah. Bless is the Scholes of the team. I know what that means. All right. Who's Scholes? I don't know. Go look at system. See, there's We can Oh, oh, oh. Oh, oh, it's show network performance information. No. All right. Well, he was right. [ __ ] Also, there's been nothing that allows me to confirm",
            "start": 4716.88
        },
        {
            "text": "Go look at system. See, there's We can Oh, oh, oh. Oh, oh, it's show network performance information. No. All right. Well, he was right. [ __ ] Also, there's been nothing that allows me to confirm settings. Like, anytime I've gone into these settings, so I think you just hit back. It It doesn't It hasn't taken unless it's resetting every time I restart the game or something. But could it be I just get an email from random email address. Calendar check. Meeting on date. Hi, name. Just a friendly reminder that our meeting is coming up on date at time. That sounds real. Talk soon. Regards. That all sounds real. Oh, also Mike was definitely able to go to free play mode if you're the host. Oh, really? Yeah. You can you hit back and then you cuz we're Are we still looking for a match right now? Yeah, we are. Oh, go into free play. See, that's one of the kicks I want to nail right now. Well, this one comes with an attachment also. Well, deleting that email attachment. No, we're deleting that",
            "start": 4770.72
        },
        {
            "text": "Yeah, we are. Oh, go into free play. See, that's one of the kicks I want to nail right now. Well, this one comes with an attachment also. Well, deleting that email attachment. No, we're deleting that email immediately. I'm sure I'm going to get an email about this email from your Well, no. This is like from a um this is my personal email. This is even my kind of funny email. All right, we got Augustus Gloop. We got Borgs CS GO skins. And we're playing against a bot named Jose. Holy [ __ ] We got Froto on our That's [ __ ] crazy. Okay, cool. They're starting me off as goalie. They know. Are you staying there? Yeah, I'm staying here. Again, I can play any position. All right. I'm like Sabrina Carpenter. Is that Is that like a [ __ ] joke? Yeah, it is. Oh, okay. I didn't know either. I wasn't going to ask. Multiaceted superstar. Where's Andy at? I had too much trust. I'm sorry, guys, but I had too much trust in you. Uhoh. Uh-oh. Oh, that's huge. Oh, little chest block. All right, Andy.",
            "start": 4823.6
        },
        {
            "text": "going to ask. Multiaceted superstar. Where's Andy at? I had too much trust. I'm sorry, guys, but I had too much trust in you. Uhoh. Uh-oh. Oh, that's huge. Oh, little chest block. All right, Andy. I'm fully like out of Stammy. Come on. CS GO skins. Let's go. Oh, right here. CS GO skins. Damn it. Okay, we got one free on the far right. It's just me and him. Oh, [ __ ] Oh, we're good. We're good. Oh. Oh, no. Bless there. Get that out of there. No, I had Augustus gloop boy over there. Oh, great job, Bless. Let's go, Augustus. It's cool that you get like XP for doing [ __ ] Yeah, it's nice. Like, hey, you're playing the game. Great job. Oh, over here. A dang. I still clear. Oh. Oh, shoot. Try to play defense right there. Oh. Oh my god. Pleas. Oh, there it is. That was nasty. Oh, let's go. CS GO. Oh, they weren't even looking. I set them up too. I set them up so well. Yeah, it was totally you. Damn it. Okay. All right, August, that's all you, big dog, dude. August, that's you. Finish that.",
            "start": 4878.32
        },
        {
            "text": "Oh, they weren't even looking. I set them up too. I set them up so well. Yeah, it was totally you. Damn it. Okay. All right, August, that's all you, big dog, dude. August, that's you. Finish that. What is going on, August? They haven't figured out the aiming thing, guys. It's hard. I mean, it is. Oh, why does that go for it? Yeah, they're learning how to pass, too. Just like we we took a while to learn. That is true. I Nice. I love that. That's huge. Wait, where? When did I lose the ball? Like I It was on me and then it just didn't wasn't on me anymore. I thought I was just dribbling by myself out there. We're on E servers. That's why, dude. Stupid East, dude. Brother, US least. Yeah, lock that guy down. 100%. Andy, come on. There we go. No. I'm trying to get into Augustus, but I passed it badly. Really thought I was going to bounce over you, but I thought that, too. I think I got to press circle for everything. Oh, [ __ ] up that pass cuz I don't press circle thinking my guys is",
            "start": 4955.04
        },
        {
            "text": "it badly. Really thought I was going to bounce over you, but I thought that, too. I think I got to press circle for everything. Oh, [ __ ] up that pass cuz I don't press circle thinking my guys is going to catch it. I'm like, I don't know if he's going to catch that. Woo! Uh-oh. That was about to be crazy. Oh. Oh my god. It looked like it was past you. That's a huge pass. Bless. Uh-oh. Oh, damn. There was nobody in net, too. Oh, no. That guy. I thought the gold one. I got him locked down, though. He's trying to go for the cross. He's waiting for the [Music] cross. Shoot. It's okay. It's all right. It's all right. Oh. Oh my god. Oh my god. He's crazy. Oh my god. That was a setup. They haven't learned the buttons yet, but the Oh man. Okay, I'm getting that out of here. I like it. I like it. Come on. Good block. Damn it. [ __ ] I like goalie. I might need to take this from Mike. It's all he [Laughter] has. Oh [ __ ] Oh, let's go Borgs. Oh, Borgs. Let's go. Come on. Oh. All right. My dude",
            "start": 5029.36
        },
        {
            "text": "Come on. Good block. Damn it. [ __ ] I like goalie. I might need to take this from Mike. It's all he [Laughter] has. Oh [ __ ] Oh, let's go Borgs. Oh, Borgs. Let's go. Come on. Oh. All right. My dude is just exhausted. They're going to go for the cross again. Watch out. Oh, what the [ __ ] That was crazy, dude. I thought he was just passing. I thought that was a pass, too. Oh, August, they left the game. Both of them left the game. What the [ __ ] Yo, damn deny, dude. Look at this. How would I know? What a That was all right. It's 2v whatever. We got this. Bless 2v4. Yeah. Wait, who are these? What's happening in front of me? I don't see anything. Oh, yeah. There's like phantom feet. Yeah, you see these like phantom gloves? Yeah, I see those. Oh, it's your gloves cuz you made it out of the Oh, [ __ ] Oh, [ __ ] you. Stupid quitters. This is not good. Oh. Oh, bless. Oh, I like it. Oh, bless. Sorry. I tried to get you. I'm trying to get you. Oh, we're Oh, bless. Oh, I like it. Oh my",
            "start": 5097.28
        },
        {
            "text": "the Oh, [ __ ] Oh, [ __ ] you. Stupid quitters. This is not good. Oh. Oh, bless. Oh, I like it. Oh, bless. Sorry. I tried to get you. I'm trying to get you. Oh, we're Oh, bless. Oh, I like it. Oh my god. Oh, I got too excited. Oh, bless. That was some impressive plane, though. Oh my god. It's totally open back there. You're on the right. I'm just trying to put the Just trying to put the ball in the goal. Damn, we had so much time left. Why' they leave? I have to go get their food got there. [ __ ] you. Oh, I like it. Oh, I like it. Where you at? Okay, I see you. Cross right. [ __ ] It's all good. Oh, actually, we still got it. I'm going to cross right if I get it. Oh, nice. Oh, I'm here in the center. Andy, I think it means the gloves are waiting for someone to grab him. Oh, that makes sense. Oh, [ __ ] Damn. Damn. That was tough. What are we going to do? What are you going to do? You're down, too. It's not fair. Bot Jose scored. This is making me push the buttons way harder than I",
            "start": 5158.88
        },
        {
            "text": "sense. Oh, [ __ ] Damn. Damn. That was tough. What are we going to do? What are you going to do? You're down, too. It's not fair. Bot Jose scored. This is making me push the buttons way harder than I need to be. Oh, yeah. I feel I feel my left thumb like hurting. I'm like run faster. [ __ ] it gets intense. All right, Andy. Oo, I like that. Also, did not let us get like the first pass. They just like left it in the middle. It was kind of like a Yeah, whoever gets it first. Oh, bless over here. One more shot. Come on, let us have it. Bless you. Play Rocket League. People leave the second they're behind. Yeah, I wonder. I mean, that's going to be a problem in this game if people keep doing that. Wait, what? Uh, they'll be people just keep leaving. Oh, but I guess in the final game they would hopefully replace it with bots, I imagine. Unless Are we playing ranked right now? Nero says, \"I had the same problem, man. You get into it.\" Yeah, dude. My [ __ ] left finger's been like hurting.",
            "start": 5226.64
        },
        {
            "text": "hopefully replace it with bots, I imagine. Unless Are we playing ranked right now? Nero says, \"I had the same problem, man. You get into it.\" Yeah, dude. My [ __ ] left finger's been like hurting. Start it up. Get money. I wish there was a way that um We probably have one more game before he gets I wish there was a way that um cuz I'm wondering if this custom match is there. Maybe join with code. Oh, that we can play with audience members. Yeah, enter code. Oh, create max players per team four. Uh I mean, we're asking for another way to break the game, so I don't know if I want to do that quite yet. create a private match parameter. I mean, if you go to private match, I think you're Well, this would be me like creating a game code or whatever. I don't want to do that. Let's talk for 5 seconds. I'm just going to go get water. Uh Chad, as you're watching this game, let me know your thoughts. I'm having a good time. Uh, if you guys are wondering, I mean, if you guys can't tell from the",
            "start": 5274.72
        },
        {
            "text": "I'm just going to go get water. Uh Chad, as you're watching this game, let me know your thoughts. I'm having a good time. Uh, if you guys are wondering, I mean, if you guys can't tell from the screaming and yelling, uh, the game just connected, by the way. Um, should we get uh some food? Yeah, but I don't know what I don't I don't know if I'm feeling SS rice. All right. All right. I also don't know what I'm feeling right now. That's the tricky thing, bro. What's it sis? What is that? S apostrophe s rice. S is S is rice. Okay. People keep saying my video is disconnected from my audio. Uh, you know, it might be. Let's move past that right now. Let's move past that. I'll work on it. What are some What, Chat? Oh, bad servers, dude. We're in Europe. Name some cuisines for me, chat. Wow, dude. My This is bad. Chat, name some cuisines for me. You know what I mean? Lean, man. I don't think I ever had a Lean Cuisine. Me either. Wings. I haven't had wings in a minute. That's actually not a bad",
            "start": 5337.68
        },
        {
            "text": "My This is bad. Chat, name some cuisines for me. You know what I mean? Lean, man. I don't think I ever had a Lean Cuisine. Me either. Wings. I haven't had wings in a minute. That's actually not a bad idea. Some wings. Wings last night. Here, step out the goal. Yeah, let me be goalie. Bless. Yeah, wings could be Oh, I found the problem. That could be sick. Bless. I Chad, thanks for letting me know, you snitches, brother. Oh my god. You don't have to be in the goal with me, bro. Bless. I need you to check out I know your your I'm on it. Maybe you check out out here at work cuz I know your PC at home isn't necessarily the best, but it's a I got it. Game called Void Breaker. Oh, I saw we watched the trailer for that yesterday. Yeah, let me know. That's cool. It plays so much cooler than even how it looked. It looked cool. But is that is that the one that looks like Metal Eden kind of? Uh yeah, like Yeah, like it it looks like you're in the control astral plane where it's just like all",
            "start": 5384.0
        },
        {
            "text": "how it looked. It looked cool. But is that is that the one that looks like Metal Eden kind of? Uh yeah, like Yeah, like it it looks like you're in the control astral plane where it's just like all these like floating weird things. But yeah, everything being destructible and the having enemies. That was a crazy goal, by the way. I don't know if you saw that [ __ ] Was that you? No. Like they're playing this game like they've been playing soccer their whole life. Yeah. Like look at this [ __ ] One more pass. Empty goal. Jeez, that was crazy. Bless his feet is worse now. Oh, is it really worse? Oh, here. Bless. Come get in the goalkeep a lot worse. Oh [ __ ] Oh [ __ ] Oh my god. [ __ ] jump scare. How does Andy look? Awesome. Tall. That was a great pass for me. ripped. Oh, they're the people on our team are good at this [ __ ] Yeah, this is kind of crazy to watch. Oh, it looked good. Oh. Oh, I blocked it. [ __ ] Oh, damn it. Let me know if that's better. Yeah, chat, let me know. Also,",
            "start": 5433.28
        },
        {
            "text": "on our team are good at this [ __ ] Yeah, this is kind of crazy to watch. Oh, it looked good. Oh. Oh, I blocked it. [ __ ] Oh, damn it. Let me know if that's better. Yeah, chat, let me know. Also, chat, keep naming cuisines for me. Oh, it's servers. It's servers. Yeah, servers. It's servers. It's totally servers. We had it on his camera. No, we all saw it. Sure. Even worse, maybe. Damn. I I drove about the way that Well, that's out of sync. God damn it. It's that camera, man. It's giving me problems. Nick was pushing buttons, dude. Oh, that was you. That's you. That was crazy. That is [ __ ] awesome. I put some curve on it, chat. You see that? That was nuts. Look at this. Better or worse, chat. That was Look at this [ __ ] That's nasty. All right, homie. Let me drop back. I'll drop back for you. Let me be goalie. Let me go. Yeah, there you go. He's got it. Let me go go. Let me go. Europe observers, man. About 1 second off. What the [ __ ] Yeah, I think it's been like this the whole",
            "start": 5486.84
        },
        {
            "text": "for you. Let me be goalie. Let me go. Yeah, there you go. He's got it. Let me go go. Let me go. Europe observers, man. About 1 second off. What the [ __ ] Yeah, I think it's been like this the whole stream. Well, I mean, yeah, I was like, \"Holy [ __ ] they just did a bicycle kick.\" It was so hu bicycle kicks were like doing that in elementary school. Everybody just [ __ ] fallen on their bodies. Yeah, I I I did that [ __ ] all the time. I could have [ __ ] broken a bone. [ __ ] My bad. Is that worse or better, chat? Chad, let me know if it's worse or better. being taken to school by this old man. Mike, you just missed the craziest goal of my life. Mike, I'm I'm goalie now, by the way. Mike, worse. Worse. God damn it. Yeah, Blessing is taking the goalie. I love goalie. He's com. Mike, your goalie. Europe servers. Europe servers. Mike, your goalie again. It's the Europe servers, brownie. Way worse. Other direction. Big dog says chat. All right. How about that? Chat, let me know. It's so",
            "start": 5554.96
        },
        {
            "text": "goalie. Europe servers. Europe servers. Mike, your goalie again. It's the Europe servers, brownie. Way worse. Other direction. Big dog says chat. All right. How about that? Chat, let me know. It's so off. It looks like he's muted. But everyone else is good. Bless say something. Hello. Hello. Check. One, two. Better. Yep. Yes. I nailed it. [ __ ] good at this job. Oh, brother. I'm the goalie. Brother, I'm the goalie. No. Very worse. Oh, closer. Oh yeah, chat. Maybe it's on your end. Oh, [ __ ] you. Literally not moving low. I'm I mean I'm changing buttons. Maybe I didn't change it. 15 frames. No. Yeah, I changed it. Holy [ __ ] That was a crazy play. Oh. Oh, they had a great little move right there. Uh-oh. Oh [ __ ] Oh [ __ ] It's crazy. He just did a wimpy off the backboard to Duncan. Just pass it to himself on the backboard. Uh-oh. Uh-oh. All right, Chad. I set it to zero. So, let me know if that makes better. Ah. Oh, great. Great job. Oh my. Deflect from this guy. Come on. Over",
            "start": 5617.28
        },
        {
            "text": "Just pass it to himself on the backboard. Uh-oh. Uh-oh. All right, Chad. I set it to zero. So, let me know if that makes better. Ah. Oh, great. Great job. Oh my. Deflect from this guy. Come on. Over here. No. Right here. Oh, hit that. Hit that. Damn it. Oh, I saw the vision. I just wasn't aiming the right way. It was hard. Go, go, go. Yes. Yes. Big equalizer. Come on. Bless his camera is different than than uh Andy's. So, everyone saying do that is an idiot. Idiot. Idiots, chat. I think I have it now. All right, Andy, I'll drop back for you. Apply. Okay. Hopefully this does it. If not, this is as good as we're getting it. Chad, let me know if it does it. Hopefully that does it. They can hear me. Bless. Yeah, but I'm talking so that they can see. Yeah, you're right. You're right. I'm dumb. Oh my god. No. Oh [ __ ] To me. Bless. Say indeed. Indeed. Way better. I think I nailed it. [ __ ] me. God damn it. Where's the undo button? Oh my god. Camera four. Yep. No, you dumb [ __ ] Oh, let's",
            "start": 5694.52
        },
        {
            "text": "Oh my god. No. Oh [ __ ] To me. Bless. Say indeed. Indeed. Way better. I think I nailed it. [ __ ] me. God damn it. Where's the undo button? Oh my god. Camera four. Yep. No, you dumb [ __ ] Oh, let's go. Oh, one more. Cross that. Oh. Oh. Oh. Oh [ __ ] I'm alone. Oh, great save. Oh my god. Oh, Andy. Andy. Oh, come on. No. No. I meant to lob. I meant to lob the pass. They need you, Mike. No, they're working. They're doing good. Okay. Yeah. I don't know. No. One more lob. Did you get us some tacos? No. Joey gave me a Wendy's outside. She's eating Wendy's all alone. There's French fries and chicken tenders out there. Remember when I got you tacos yesterday? I know, but I wasn't I wasn't ready. Oh [ __ ] He came out of nowhere with it, bro. Oh my god. I got to That was crazy. Oh. Oh, I'll run with that. There's our moment. There's our moment. Come on. Pass Andy. past and no let me get there. Why did I get I'm right in front of it. Europe servers. Is there a way I got to like hit a button",
            "start": 5760.16
        },
        {
            "text": "with that. There's our moment. There's our moment. Come on. Pass Andy. past and no let me get there. Why did I get I'm right in front of it. Europe servers. Is there a way I got to like hit a button to like I am accepting this? Like I don't know. I was right there. Oh, my fault. My fault. Nice. You had the right idea. Come on. Come on. We set it to unlimited overtime. Just keep going till someone scores. I think that might be what it's on. Oh, really? [ __ ] cool. Oh, damn it. I just passed it the wrong [ __ ] way. I'm stupid. I'm being stupid. Oh, no. No, no, no, no. Bliss, we tried, man. I [ __ ] up. I [ __ ] up, dude. Damn. It's European servers, dude. Yeah, those are Europeans. Damn, that was close. That was close. That was tough. Dang. I couldn't I could chat. I couldn't be in the World Cup. I couldn't be a goalkeeper in the World Cup. That cuz that [ __ ] would break. So many reasons. That Yeah, but the main reason is the heartbreak. Yeah. Yeah. Yeah. The heartbreak is the",
            "start": 5850.72
        },
        {
            "text": "World Cup. I couldn't be a goalkeeper in the World Cup. That cuz that [ __ ] would break. So many reasons. That Yeah, but the main reason is the heartbreak. Yeah. Yeah. Yeah. The heartbreak is the biggest reason. You going to bed just thinking like if I just went if I just, you know, dove right. Yeah. All right. Let me invite Mike. You think it's the height? No. No, that's P's perfect for that. Not the height. Damn. Now imagine missing a penalty penalty kick in front of uh 30,000 people. Yeah, I can imagine. I feel like 30,000 people is a small dude. Messi Messi is 5'2. No, think of like a for the World Cup finals. You're talking about you're talking about a billion people. Yeah. Your family will be threatened, you know. Yeah. It's like you might let down an entire country. Come on. Oh, Mike. Also, when you're host, you can still hit back and then go back and go into free play as Oh, should I be in free play? Let's be secretary of defense like Tim Howard. Listen, that's my idol right",
            "start": 5923.2
        },
        {
            "text": "Also, when you're host, you can still hit back and then go back and go into free play as Oh, should I be in free play? Let's be secretary of defense like Tim Howard. Listen, that's my idol right there. When I'm goalkeeping, I'm thinking like Tim Tim Howard. Oh, damn. I really I I don't know if it was a server thing, but I was ready for that ball and it just didn't let me kick it. All right, I'm back on the [Applause] pitch. And I love that we're playing We're playing the beautiful game. Is that what they call it? What do they call it? They do call it that. The beautiful game. Okay. I do. Mike, you want to drop back? You want me to you call? No, you go. You play goal. Are you sure? Yeah. Yeah. Yeah. Mike was practicing. Oh, [ __ ] you. Got you, [ __ ] Go, Mikey. Go, Mike. Oh, damn. Okay, come on, Kalashi. That was a good pass. I saw the vision. Got it. Saw the vision on that pass. Way to go, Mike. Oh, Mike's trying to get pretty with it. HP. Oh [ __ ] Mike, drop back. [ __ ] me. Go",
            "start": 5978.52
        },
        {
            "text": "come on, Kalashi. That was a good pass. I saw the vision. Got it. Saw the vision on that pass. Way to go, Mike. Oh, Mike's trying to get pretty with it. HP. Oh [ __ ] Mike, drop back. [ __ ] me. Go back, Mike. Oh, okay. Yeah, I will. I will. All is right in the world. Now, that was bad defense by me. I thought I tackled him. That'll just make you That'll give you a level embarrassing. You're just like, \"Get me out of here.\" No, give me get me out of there. That's my bad. Oh, good pass. I like the I like taking it slow. I like the f Oh, damn. Me and this guy are battling. Yeah. [Music] Oh, damn it. I got in front of it. Got in front of it. Oh, me. They're Hulk Spider-Man. Dude, that you can't be two superheroes. Has to work. Look at him go over me on this. Oh, that was that kicked you in the head. I know. Almost kicked your head off. Crazy. Okay, it's okay. Two zero wheel. We've We've seen worse deficits. Hit me on the right side. Oh, damn. They're just Yeah. Oh, yeah. Oh, red like a",
            "start": 6057.36
        },
        {
            "text": "the head. I know. Almost kicked your head off. Crazy. Okay, it's okay. Two zero wheel. We've We've seen worse deficits. Hit me on the right side. Oh, damn. They're just Yeah. Oh, yeah. Oh, red like a book, Mike. Read like a book. This is West. It's me top of my head. I was right in front of it. There's no way that would have There's no way it went through me. Oh, great pass right there. Bless. Shoot that. He's out of the goal. Oh my goodness. Oh, that was close. Like this little muse. Oh, shoot. Come on, Kalashi. Crazy. Oh, right here for you. Right here for you. Both of you. Yeah. Oh, I thought you kept going. [ __ ] Shoot him. Oh [ __ ] My dude is just exhausted. Oh. Oh. Oh no. Oh no. No. Oh my mercy rule. I thought four was the mercy roll. I think is Yeah, four is the mercy roll, right? They rather roll out us. Are they taking it out? Was that it? Oh, it said mercy roll on the top left. Oh, maybe now it's mercy or like I don't know. I saw mercy roll pop up on the top left. Oh,",
            "start": 6140.08
        },
        {
            "text": "They rather roll out us. Are they taking it out? Was that it? Oh, it said mercy roll on the top left. Oh, maybe now it's mercy or like I don't know. I saw mercy roll pop up on the top left. Oh, match point. Okay, so because they score three, now it's match point. Mike is trying to make Andy. Oh, didn't chance. Okay. Oh, just ripped that. Oh, no way. That was nasty. What the [ __ ] That was nasty. Oh my. Okay, I'm going to help it with D. Let's go. Bless. Let's go. Hey, big pass on the That's okay. That's okay. Woo. Good being in there. Let's go. Ah, damn it. Yeah. Sometimes if you just left trigger in front of goalies like you'll body block him and the ball will kind of There it is. Way to go. That was really Oh, let's go Kalashi. A damn. Oh, I say you were perfect, too. They're just holding the ball. Bunch of [ __ ] What the [ __ ] was that? The hell was that? That was a crazy pass. What the [ __ ] was that? Let's go, Kalashi. Let's go. Get it, Kalashi. Nobody's in go. A [ __ ] Just",
            "start": 6228.96
        },
        {
            "text": "the ball. Bunch of [ __ ] What the [ __ ] was that? The hell was that? That was a crazy pass. What the [ __ ] was that? Let's go, Kalashi. Let's go. Get it, Kalashi. Nobody's in go. A [ __ ] Just back pass it. Bless if you can. Oh, nice. That was great. We go. Uh, not a great pass, though. [ __ ] Holy [ __ ] Little defense right there. Oh, I thought I got it. Oh, boys. Nice. Nice. I got it. I got it. Time. Nope. Oh my god, that was bad. You want to clear it, but he doesn't clear it. You're like, \"Clear it. Just clear it.\" Oh, that was bad. You knew what I wanted to do. Rough. You know, it's the [ __ ] desert environment. I don't want to be there. Too much sunlight. See [ __ ] Jesus. I'm worried about scorpions and come on. Rematch. I wish we could rematch that same team cuz we would have had him. Yeah, run it back. Run the back. Down 4 zero. Let's play fives, bro. Put it on fives. Uh, some players are still in match, it says. Back. I'm out. Maybe it just worked again. Okay. No, now",
            "start": 6299.6
        },
        {
            "text": "had him. Yeah, run it back. Run the back. Down 4 zero. Let's play fives, bro. Put it on fives. Uh, some players are still in match, it says. Back. I'm out. Maybe it just worked again. Okay. No, now it's working. Now it's working. Um, you want to do fives? Mhm. Let's feel five. Oh, they got Pop the Balloon on Netflix. What is that? Let's go. Is that a phone game? Don't worry about it. Now I got to do some googling. You see what I'm doing? Just tell me. No, it's like the Yeah. You ever see the videos of like the dude that'll walk up to a row of girls and they're all holding balloons and he'll be like, \"Hey, my name's Dave on 57.\" And they'll pop the balloon. Yep. That's right. Oh, they have that like as a TV show now to watch. Yeah, it's on Netflix now. Okay. [Music] What's the name of the plumber? Mario. Mario. That's hella funny. I don't know what which other plumber you're talking about. I need to set some better shinuards. Russian guards are stupid. They're not matching. That's what",
            "start": 6369.52
        },
        {
            "text": "Mario. Mario. That's hella funny. I don't know what which other plumber you're talking about. I need to set some better shinuards. Russian guards are stupid. They're not matching. That's what it is. I'm glad you said said it. Thank you. Did you see Mike running back to be the goalkeeper? It's what he's great at. You got to You got to know where you want to be. You got to know your positioning. Bless you. Tried it out and That was great. Oh, that was great. I don't know if great's the right word. Oh, shoot that. Oh, great job. Great job. I like it. I like it. Somebody run in. Somebody run in. I got it right here. Right here, Andy. Just wasn't even looking the right way. Oh, come on. It doesn't occur to me that I have to be like looking at the net. I know. It's new. It's new. It's new. God damn it. Oh. Oh, bless. Run in. No. I [ __ ] pass so badly. Oh my god. Oh, revolver. Revolver. Ocelot. to me. I should have been in the center. Oh, wizard. Wizard. He's a wizard with it. Oh, [ __ ]",
            "start": 6414.72
        },
        {
            "text": "damn it. Oh. Oh, bless. Run in. No. I [ __ ] pass so badly. Oh my god. Oh, revolver. Revolver. Ocelot. to me. I should have been in the center. Oh, wizard. Wizard. He's a wizard with it. Oh, [ __ ] I'm hustling. [ __ ] you. Oh, good D. Great clear right there, Mike. Keep it in. Keep keep the pressure on him. Oh [ __ ] No. [ __ ] you. That's Come on. Took my shin off, man. Oh, damn it. I'm always like there's such a Oh, just stop moving. Yeah. Oh, he's back. Changing a setting. I got it. I got it. Thank you. Oh, Mike. Oh, careful. Oh, [ __ ] Okay, that was too hard. Yeah, the passing is like so it feels advanced like the way that they're that they're handling it here. Oh [ __ ] God damn. He just whooped all of us. Yeah, got it. Great job. This is going to be a good match. I got ready. Yeah. Oh, let's go, Wizard. Dropping back a little bit. Oh [ __ ] Oh, Mike. Good, Mike. Oh. Oh, [ __ ] Damn. I'm sorry. That's all right. That's all. They had the They had the board. Yeah. Get out of",
            "start": 6466.56
        },
        {
            "text": "Yeah. Oh, let's go, Wizard. Dropping back a little bit. Oh [ __ ] Oh, Mike. Good, Mike. Oh. Oh, [ __ ] Damn. I'm sorry. That's all right. That's all. They had the They had the board. Yeah. Get out of here, [ __ ] [ __ ] guy. You know, this guy looks British for sure. Oh. So, this is indoor soccer, right? Yeah. square it. We're just playing a big We're playing in the the volume, the Unreal Engine volume. Nice. Oh, good ball. Good ball. Somebody on my I'm I'm so out of stamina. Yeah, good stuff, Wizard. Save right there. Like that in Yeah, Mike. In those situations, if you left trigger in front of the goalie, like they've kicked it off my thigh before and I've ruined like their their clear attempt. I'm so out of stamina. Bless. Oh [ __ ] Oh [ __ ] Sorry, I was dancing. Look at that block. Oh no, Mike. Oh [ __ ] Oh, revolver. Great block. Oh, they got that right to you. Oh, [ __ ] you. I'm in the center. Let's go. R1 circle or R1. Sorry. Oh, close. There's a tense one. Oh [ __ ] My tried",
            "start": 6553.28
        },
        {
            "text": "no, Mike. Oh [ __ ] Oh, revolver. Great block. Oh, they got that right to you. Oh, [ __ ] you. I'm in the center. Let's go. R1 circle or R1. Sorry. Oh, close. There's a tense one. Oh [ __ ] My tried to dive onto that. Oh [ __ ] I just did that on accident. Way to go, revolver. Dude, my thumb hurts. Mike. Oh [ __ ] Ah, damn. Too [Applause] hot. Why is it doing that now? Revolver. Oh, it's cuz I'm pressing R1. I see. Wait, what's what's R1 doing? It's the modifier. Yeah, like now it's that's why I'm doing like the jump up in the air. Oh, okay. Oh, Mike. Damn it. [ __ ] me. Oh, hit that. Good try. Good try. You got to aim. Happens. You got to aim. Yeah. Where'd he go? It's cool though. Oh [ __ ] Let's go wizard. Let's go wizard. Actually Oh, one more. Let's go. My gosh. [ __ ] All right. All right, somebody get bus. It's my bad. A damn it. Let my stam me come back. Damn. They're just playing keep away right now. Smart. They just parked the bus. Oh [ __ ] Oh, let's go. I'm right side. You",
            "start": 6639.2
        },
        {
            "text": "right, somebody get bus. It's my bad. A damn it. Let my stam me come back. Damn. They're just playing keep away right now. Smart. They just parked the bus. Oh [ __ ] Oh, let's go. I'm right side. You got the stamina for it. Oh, from behind. Damn it. Ooh. Okay. Off the wall. Oh, that was risky. Where did the ball go? Oh [ __ ] 30 seconds, boys. Score or lose? Oh, wow. Wizard, you got to put a little mustard on it. Oh, that's us. Uh-oh. That's us. That's us. There's gonna be one more. Oh my. Mike. Oh no. That's it. Oh, they're going to hold it. Oh, I was able to deflect it. Damn it. God, that's cool, bro. That's cool. We're back, bro. Mike missing that shot, but then it's like it's like a basketball. Mike, if you miss like an easy shot, you just get frustrated. You like foul him. I would have done, bro. I saw you just like handing the goalie like absolutely missed it. Damn, that was good. Christie, I got to hit that last pass though. You know what I mean? You got to do that one more.",
            "start": 6733.84
        },
        {
            "text": "have done, bro. I saw you just like handing the goalie like absolutely missed it. Damn, that was good. Christie, I got to hit that last pass though. You know what I mean? You got to do that one more. Get the catch the goalie off guard. Hit that. Hit it. Five again. Try five. Five. Five is nice. If we only had more friends, man, we'd be [ __ ] balling this up. Goddamn thumbs feeling it, dude. Right. Gets intense. [Music] Did we run an ad yet? No. All right, we'll run an ad after this. You want to do now? Should we all always rock the captain's gear, the squad leader gear, so the stream looks good? I'd like that. I'd like that. Okay. Damn. Look at MCHKR. Look at this dude. Holy [ __ ] Show them abs off. I never change my freaking shin guards. God dang it. Waiting for players. Somebody quit out, I think. Are they in? Uh, no. It's going now. Oh, there we go. [Applause] Kevin, do you want Nick the Greek? Yeah, you know, I can go for some Nick the Greek. How much longer are you guys playing",
            "start": 6825.84
        },
        {
            "text": "I think. Are they in? Uh, no. It's going now. Oh, there we go. [Applause] Kevin, do you want Nick the Greek? Yeah, you know, I can go for some Nick the Greek. How much longer are you guys playing for though? That's the question. That's a good qu. I mean, it's up to these two boys. We're playing till 3 like usual. I got say I I'll run to the dance line. We got to put that order in ASAP then. Sometimes you get there and you're like, they're expecting a pass right here, you know? I mean, I guess we're close enough to probably the stream end that I don't even need to order anything. Yeah, that's where I'm at, too. I'm going to be Oh, let's go, Mike. Let's go. Come on, Mike. Come on. Oh, good try, big dog. That was really cool. That looked like I had a shot, dude. Read it. They knew it. Oh, [ __ ] Almost got him. That was good. They're all very similar colors on this one, unfortunately. Yeah. Hit nitro rifle in the center. Oh, what the [ __ ] Oh, it like I don't know what happened. Oh, I",
            "start": 6889.52
        },
        {
            "text": "Almost got him. That was good. They're all very similar colors on this one, unfortunately. Yeah. Hit nitro rifle in the center. Oh, what the [ __ ] Oh, it like I don't know what happened. Oh, I think they maybe I think they tackled it. They hit the tackle button. Plus, also you chose the wrong colors. Did I? Yeah. Oh, my bad. I thought I chose captain. Squad leader. Oh, way to go. Way to go. Come on. Oh, you you chose squad leader. My bad. I thought you said captain. Damn it. Yo, Bless, after this game, can I come grab you? Yeah. Oh my. Right there. You just got to get violent, Mike. I was about to push me on that one. Hold the left trigger. M button. Mike. Left trigger. Oh, great job, Les. Oh, let's go. Is there anybody in the middle? Yeah. Oh, Mike. I was about to send that right to you. I'm there. I was about to send that right to you, Mike. Also, the bottom right radar. I rarely look at it, but it's very good. I didn't know that was there until [ __ ] When did that get there? Holy",
            "start": 6949.36
        },
        {
            "text": "I'm there. I was about to send that right to you, Mike. Also, the bottom right radar. I rarely look at it, but it's very good. I didn't know that was there until [ __ ] When did that get there? Holy [ __ ] dude. Honest to God, I had no idea that was there. That literally just appeared as he said, honestly. That's crazy. Oh no [ __ ] [ __ ] you. God damn it. Oh, that radar is going to change the game, actually. Yeah, it's very helpful. There's so many things to look at in this [ __ ] game. Yeah. Hey, you got to be aiming in the right direction. [ __ ] A [ __ ] you. [ __ ] Stupid number 76. Blast. Nick the Greek was the right move, too. Oh, yeah. That That would have been the one. Just too late. Just too late. Let's go, Mike. Let's go. I don't even know what I'm going to eat. Oh [ __ ] Maybe I Maybe I'll get a sandwich. What time does little Lucas close? Oh, Mike. Great job. Oh [ __ ] Penalty. Oh my. You guys are getting after it though. I like it. Little Luke, are you going to drive to",
            "start": 7017.12
        },
        {
            "text": "I Maybe I'll get a sandwich. What time does little Lucas close? Oh, Mike. Great job. Oh [ __ ] Penalty. Oh my. You guys are getting after it though. I like it. Little Luke, are you going to drive to it? No, they're on door dash. You just door dash. Oh my. Dude, the aiming is so difficult. You have to be aiming at the net, but you're looking the other way time to see the ball. It's a nightmare. What? I had the ball. I had it. If you win, you got to say something then. How am I supposed to know? You got to say you got it, man. I like you said you got it. Oh, here we go. Oh [ __ ] Man, I'm locking on D. Great job. Lock it on D. You got this shot right here, Mike. Good shot. [Applause] That's what I'm talking about. Come on. You done good. Yeah, dude. World Cup. Look at that. Uh, somebody's mic is live now. Hello. It's Andy's mic. Me? Me? Yeah, it is. It says Andy's mic. Why? You must have hit a button. I I didn't. It just It resets it. I think if you reset the game, it does that. I mean,",
            "start": 7067.76
        },
        {
            "text": "is live now. Hello. It's Andy's mic. Me? Me? Yeah, it is. It says Andy's mic. Why? You must have hit a button. I I didn't. It just It resets it. I think if you reset the game, it does that. I mean, I don't It was Midame like Right. It just turned What the [ __ ] Oh, they didn't die. You turn off right over that guy's head right there. Yeah, he didn't die at all. Is he? Damn, that's that's that's tough. Look at this. They said they said sorry. They apologize. That was a pass, too. That's unfortunate. I'm not saying any goal. I'm I'll jump back. [ __ ] you. Every time I see you. Throw the mic. Throw mic. Oh god. Oh, good ball, Mike. Yeah. Yep. That was nasty. Oh, one more hit. One more hit. That's what I'm talking about. Come on. Damn it. Going off the wall. Really good, man. Yeah, that's what I was thinking. Somebody did that last match and I was like, that might be a strat. Immuting myself again. Or like I I somehow I'm muting myself. Control. It's like control. Oh no. Every time",
            "start": 7139.28
        },
        {
            "text": "what I was thinking. Somebody did that last match and I was like, that might be a strat. Immuting myself again. Or like I I somehow I'm muting myself. Control. It's like control. Oh no. Every time someone scores, he talks. L2 triang. Yeah. Going off the wall might be the the strat. Oh, there it is. Unmute self is down on the D-pad. [Applause] Wait, who's in here with me? Um, let's see. Square it. Mike, it's coming to you. Yep. Great job, Mike. Oh, good kick. That's a good kick. You got some XP right there. Blocked him. Oh [ __ ] You checked his ass. You checked his ass. He's like, \"Oh, that didn't go where I wanted it.\" Cherry picking this whole game, too. The [ __ ] off me. Come on, Andy. Oh, damn it. I'm trying to pass the mic. [ __ ] Block. Great job, Mike. Mike's getting nasty. Mike's getting crazy. Oh, [ __ ] Oh, that was our I I thought it was their kicking it. Oh yes. Oh yes. Oh yes. Oh my god. [ __ ] yeah. We dominate. You're hitting that left trigger now, right? Dude, I'm I'm",
            "start": 7210.0
        },
        {
            "text": "getting crazy. Oh, [ __ ] Oh, that was our I I thought it was their kicking it. Oh yes. Oh yes. Oh yes. Oh my god. [ __ ] yeah. We dominate. You're hitting that left trigger now, right? Dude, I'm I'm I'm up on him. Yeah. If you stay in front of the goalie doing that, it's pretty good. Okay. Come on. Somebody take the goal. I got it. I got it. Uhoh. Oh, we're on a breakaway. I hate you. I bet it was just wide open for 5 seconds, dude. Kid just looked at me. This is hard to pass. Pass it behind me. Oh, let's go. Bless. Where you going? I'm I'm in some goalie. Oh, sorry. I was looking at Mike. My bad. I thought it was a bless. Okay. Uh-oh. Uh-oh. Bless. Come on. That is so clutch. Mike to you. Yeah. Get one extra one, Mike. One shot in. Oh, he's got qual. That was really good. [ __ ] yeah, bro. [ __ ] yeah. Let me go see what Bear wants. That was good. That was good. All right. Hit ranked game this time. Oh [ __ ] Wait. Let's wait. Let's wait till less is bad. Back. Hit [ __ ] ranked",
            "start": 7267.6
        },
        {
            "text": "bro. [ __ ] yeah. Let me go see what Bear wants. That was good. That was good. All right. Hit ranked game this time. Oh [ __ ] Wait. Let's wait. Let's wait till less is bad. Back. Hit [ __ ] ranked game. banked game. It's going to be It's going to be a while for them. It's going to be a while for them. Hit the button. Are you hitting the button for him? Play with the ball. Show me how to dance. Yeah, unfortunately. But you can't like just leave a party. It's broken. So whenever I already clicked leave party as bless and now it's not an option, but I'm still in the party. Now it should just be I think if we ever need to break up the party, we have to restart the game. Yeah, we might have to. Yeah, like uh it click back, Mike. Yeah, when you go to go to social then like leave squad. It's just me and you. Yeah, but I I already hit leave squad. So, it says on my game that like I'm not technically in the party even though I am. [Applause] I quit the game. Yeah, I'm going to do this never",
            "start": 7348.4
        },
        {
            "text": "me and you. Yeah, but I I already hit leave squad. So, it says on my game that like I'm not technically in the party even though I am. [Applause] I quit the game. Yeah, I'm going to do this never again. Right, Mike? What? No, I'm just playing. Got to quit the game. We're on the ad. This episode is brought to you by BetterHelp. We all know that therapy can feel like a lofty investment, but we also know that there's nothing better to invest in than yourself. The state of your mind is just as important as for physical health. Let's talk numbers. Traditional in-person therapy can cost anywhere from 100 to 250 per session, which adds up fast. But with BetterHelp online therapy, you can save on average up to 50% per session. Therapy should feel accessible, not like a luxury. With BetterHel, you pay a flat fee for weekly sessions, saving you big on cost and on time. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set",
            "start": 7440.08
        },
        {
            "text": "you pay a flat fee for weekly sessions, saving you big on cost and on time. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. And it isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. Your well-being is worth it. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.comkindfunny. better betterhelp.comkindfunn. Now we're back now. All right, big dog. Here it is. Our first ranked match of the weekend league. Here is the big moment for us. That guy's got no shoes on. Let's do it. I'll switch with you. You go up. Okay. Yeah. I mean, uh CJ Swiss on just it's third person soccer. Like it's like Rocket League with people, which kind of makes a lot of sense for that. Yeah. You're",
            "start": 7492.8
        },
        {
            "text": "I'll switch with you. You go up. Okay. Yeah. I mean, uh CJ Swiss on just it's third person soccer. Like it's like Rocket League with people, which kind of makes a lot of sense for that. Yeah. You're not like there's no auto aiming to pass. There's no auto. Everything's kind of like manual and third person. My fault. You just be king of puppets. Let's go. Smoking Joe's. Oh, great job, Dylan. Dylan, shoot it. Shoot it, Eddie. Oh, [ __ ] you. They They [ __ ] attacked us. Back back on D. Back on D. There's already a cherry picker there. We got to get there. He's cheating. So, no offsides. No offsides. No offsides. No rules. Yeah, Elangus. I love the instant switch to goalie so anybody can get in and out. Pretty amazing. Let's go. Let's go. Open open goal. Damn it. Oh. Oh my. That looks I didn't even mean to shoot to I just tried to dive. It was great. Oh my god. They're going to Oh my god. I'm in the middle for him. Nice. Oh, is that a little faster? Oh, let's go, Ky. Ah, [ __ ] Bad",
            "start": 7557.36
        },
        {
            "text": "didn't even mean to shoot to I just tried to dive. It was great. Oh my god. They're going to Oh my god. I'm in the middle for him. Nice. Oh, is that a little faster? Oh, let's go, Ky. Ah, [ __ ] Bad pass. How do I slide tackle again? Uh, if you hold If you're holding sprint and then you hit the B button. It's cuz I'm out of sprint. If you're out of sprint, he does the little dolphin dive. Oh, he's still doing the dolphin dive. I can't get him to [ __ ] do it. Bless would say there was like an R1. Oh, if you if you dolphin dive. Yeah, dolphin dive is a R1B. Oh, L1B is is the dive. There we go. Yeah, dolphin dive. Dylan. Dylan. Oh, man. That was close. Oh, get in front. Dylan. Dylan. Send it. Dylan. God. Send it. You son of a [ __ ] Oh no. Oh, Angus is just carrying right now. E, Angus, that's you, Mike. I'm there. I'm going to get there. I'm out of juice. I'm out of juice. Oh, Angus. Uh-oh. Angus. Angus. Angus. Angus Khan. Angus. Let's go, Mike. Oh. Oh. Oh, I got it. Oh, off the wall.",
            "start": 7625.68
        },
        {
            "text": "you, Mike. I'm there. I'm going to get there. I'm out of juice. I'm out of juice. Oh, Angus. Uh-oh. Angus. Angus. Angus. Angus Khan. Angus. Let's go, Mike. Oh. Oh. Oh, I got it. Oh, off the wall. Oh, I love that. I love that. on Dylan. See Kamari hit him. Yes. Oh, go Andy. Go. Oh, [ __ ] you. I got tackled by defense. I'm heading back. It's all about getting back on. Oh, go Andy. Come on. Yes, come on. This game rules. Hell yeah. That dude did the dive like the the predictive dive. Oh, idiot. What if I just curve it right in, baby? Big goal. Big goal. That was massive for us in the ranked play. Now we got to [ __ ] play D. Park the bus. Yeah, one more in there, man. Yeah, one more then we park the bus. Oh my god, Dylan, you're crazy with the dolphin dive. Insane. Mic's open. No. No. Not yet. Now I am. No. Let's go. I'm coming. Keani. That's not the name. Come on. He doesn't make you make up your own. If you're not on my team, I don't know who you are. Make up whatever damn I want for",
            "start": 7692.48
        },
        {
            "text": "Now I am. No. Let's go. I'm coming. Keani. That's not the name. Come on. He doesn't make you make up your own. If you're not on my team, I don't know who you are. Make up whatever damn I want for you. That's half the fun of the game. Yes. Come on. All right. Now we play D. Yeah. Park the bus. Now we park the bus, bro. [ __ ] that, dude. We just We We go. We score. They pass it off. Mercy kill this guy and Andy both right there. Come on. Keani. Pick up whatever name you want. An A and an I and an R. I didn't know we had to know everybody's name in this. [ __ ] that. I choose your name for you. I'm not asking you to know lore. I ask you to read a word. Give me that. You got the K sound right. Yeah. Whatever I want. Get over there, Colani. Get up there. [Applause] I love that defense. Hounding. [ __ ] hounded him, bro. Use your hands big. Uhoh. That's you, Mike. Give me the rock off the wall. Oh, you almost kicked that dude's head off. That guy in the face. Got to knock his face. That",
            "start": 7766.72
        },
        {
            "text": "[ __ ] hounded him, bro. Use your hands big. Uhoh. That's you, Mike. Give me the rock off the wall. Oh, you almost kicked that dude's head off. That guy in the face. Got to knock his face. That was a murder. Oh, Dylan is very good at defense, man. Keep us. Okay. Okay, you two. I'm across. I just didn't pass that hard enough. Little boot. Little boot. Oh [ __ ] Angus. Yes. Oh my god. Passing it back to you. Oh my god. I shot the ball. Oh my god. This game is [ __ ] incredible. Good job. Oh my god. They try to go. Oh my god. Mike, you're all alone. This is Mike. This is all Mike. Mike here. Oh no. He read my book. He read my book. He read my book. Yo, you can play barefoot. Yeah. Oh yeah, dude. You get weird with you. Whoa. Oh my god. Oh my god. Oh my god. Oh, dude. Player three just really dominated right there. Dylan. Dylan, do something. Oh, I think Dylan's been doing a lot. Dylan's doing great. Dylan's doing great. Yeah. It's more like do something in the moment. You know what I",
            "start": 7829.76
        },
        {
            "text": "dominated right there. Dylan. Dylan, do something. Oh, I think Dylan's been doing a lot. Dylan's doing great. Dylan's doing great. Yeah. It's more like do something in the moment. You know what I It's great to do something. How did it get there? Oh, you had the gloves on. Oh, that's Yeah, I need to switch to you cuz he went out of the box. So, you had the gloves. But yeah, you just got to you got to You didn't see it. What the [ __ ] See, right now you got the gloves on. And yeah, you could have dove. Why did A just go so far out? He dude, he was making a play. He had to make a play. Had to make a play. So, if I'm in that situation, I hit B. Yeah, you could have hit B and dive. Oh, okay. And that's the fun part about this is like you can get some crazy switches on goal like that if you're really paying attention there. Angus. Angus. Angus. Oh Mike, that is all you. That is all you, Mike. Looking for a pass. Looking for Colani. Oh [ __ ] A little far. Little far right here. Keani. Back",
            "start": 7906.96
        },
        {
            "text": "really paying attention there. Angus. Angus. Angus. Oh Mike, that is all you. That is all you, Mike. Looking for a pass. Looking for Colani. Oh [ __ ] A little far. Little far right here. Keani. Back to you, Mike. Oh [ __ ] Keani. Uhoh. Oh, Dylan. There's no L in that name. Dylan. Yeah. Oh. Oh my god. That was crazy stuff, dude. Come on. We need to have a couple. Our first rank match, dude. Oh, let's go. I'm going to leave it on you. Get in there. What if we just play ranked matches all day? Get me in there. Play till five. Let's play till five, boys. Say the word. Say the word. Say the word with us, bro. It's Friday. Like Friday. It's Friday. Me ampl want to play with you. I'm playing stuff for work, too. Playing, bro. Uh, how do I get him in? Get him in. Send him an invite. Chad, put in the Andes. Put Andy in the chat right now. You Come on, Andy. Let's win them over, chat. What if we just play ranked until five? Let's go till five. Weekend league, bro. Weekend league. What does",
            "start": 7949.92
        },
        {
            "text": "in the Andes. Put Andy in the chat right now. You Come on, Andy. Let's win them over, chat. What if we just play ranked until five? Let's go till five. Weekend league, bro. Weekend league. What does that mean? It's the weekend league. That's what FIFA does. It's the weekend league, bro. All right. I got bless in we ranking again. Oh yeah. Come on. Let's go. Put him in there. Flabby Kratos. 50 months of support. Bring Nick in for extra pressure. Sure. [ __ ] No. Part Alfredo says, \"Great. Rank F. Rank till five and then you go into Dark Souls 2 DLC. It's your weekend.\" I'm not doing Dark Souls 2 until later in the year. Why not? I'm playing [ __ ] right now. Squad leader. Squad leader. Squad leader. What are you playing? Immortalize a P tonight. What are you going to give the people? What are you going to give the people? I don't know if I'm streaming. What do you mean? I'm playing. We all want to tune in, watch stuff, Mike. I might be on this tonight, just so you know. I might give",
            "start": 8010.96
        },
        {
            "text": "are you going to give the people? I don't know if I'm streaming. What do you mean? I'm playing. We all want to tune in, watch stuff, Mike. I might be on this tonight, just so you know. I might give this. I'll be on this at 5:15. I'll see you then. Oh, I got to eat first. I don't know if I'm going to make it by 5:15. Don't worry. He's He's probably not going to be on. No, he'll be on. If there's anything Mike there's anything Mike is on point about, it's about being on the stream as soon as he gets home from work. Van cannot be off camera. Oh, it's a 4v6. How is that that doesn't that doesn't make sense. They have someone on their team named Bad Baby's Backshot. Jesus Jesus, man. Oh, I forgot the buttons. There we go. We're playing central servers. I mean, if they all quit, it's ranked. We got to win. Give me the ball. Oh my god. We're playing with Vortex is insane. We win one game, they suddenly think we're goats. Oh my my body on that. Oh, we have nobody in goal. Somebody's got to do",
            "start": 8067.12
        },
        {
            "text": "got to win. Give me the ball. Oh my god. We're playing with Vortex is insane. We win one game, they suddenly think we're goats. Oh my my body on that. Oh, we have nobody in goal. Somebody's got to do something. Didn't need it. Didn't need it. Vortex, if you need me, I'll play goal. If not, we're good. Uh, we got a guy. We got a guy. Come on. They're down a man. We're playing five on four. Well, let's take advantage. All right. Come to me, Andy, and I'll come back to you. Oh, [ __ ] I got it. Regulated my stamina bar. Oh, look at that. That's crazy. Passed off the wall. Yeah, that's a smart move. Mike is coming to you. Yep. Nice. Oh [ __ ] Oh, bless. There you go. Coming in the middle for you, Vortex. Nope. I lied. Oh, close. Oh, get that [ __ ] dude. Give me that. I'm in the middle. Nice job. Oh, Vortex. Go Vortex. It's all you. Oh, Vortex do themselves. Vortex, what are you doing? [ __ ] you, nutcase. Y'all need to learn how to do that. Like the the up thing. Yeah. No, we know how.",
            "start": 8109.92
        },
        {
            "text": "job. Oh, Vortex. Go Vortex. It's all you. Oh, Vortex do themselves. Vortex, what are you doing? [ __ ] you, nutcase. Y'all need to learn how to do that. Like the the up thing. Yeah. No, we know how. It's just in the moment. It's hard. Vortex right here. Big Vortex might be an NBA 2K. No passing allowed. Yeah, I got a good feeling about Vortex never passing the ball. Get ready. Well, you got it that way though. Oo, I deflected it. You got it that way. You can do that. That's right, Kevin. Yeah. Oh, great job. Bless. I got there. This is all you, Mike. Vortex. Oh [ __ ] I tried to get away from it. Vortex, my guy's just been up this whole time. Oh, what was he? Get in the goal, bro. Bloop face, baby. That was risky. I don't know why I didn't collect that, but all right. Oh my god, Vortex, you're passing to you, Wendy. To you, Wendy. Nice. Oh, I love that. I love that ball though. I love that ball. Keep the pressure on. Oh, vortex again. Get ready. Get ready for the No, this crazy",
            "start": 8169.68
        },
        {
            "text": "you're passing to you, Wendy. To you, Wendy. Nice. Oh, I love that. I love that ball though. I love that ball. Keep the pressure on. Oh, vortex again. Get ready. Get ready for the No, this crazy behavior. Good job. It's like I don't know how close you need to be for the game to be like, \"All right, now it's yours.\" Now it's yours is right. I think you had to jump up on that one. There you go. Blast over to me. Nice blast. Nice blast. Look right here. Looking for the cross. Oh [ __ ] It threw right past me. That's crazy. There's that dolphin. What the [ __ ] was that? We just collided on him though. He did a diving header on accident. Oh, let's go. Vortex. Oh, Vortex with a big cross to me and I wasn't ready. My apologies. I went inside instead of staying outside. It's a sorry button. Thanks. Got his ass. Thanks Andy for [ __ ] blocking that as I kicked the wrong direction. 280 faster right there with the wrong way. You're trying to emote. That was on. Yeah, I should have said that. Oh",
            "start": 8221.36
        },
        {
            "text": "Got his ass. Thanks Andy for [ __ ] blocking that as I kicked the wrong direction. 280 faster right there with the wrong way. You're trying to emote. That was on. Yeah, I should have said that. Oh my god. Blue face. Blue face, baby. Coming at you. Oh yeah. Let's go, Vortex. Oh yeah. Keep the ball going. Keep the ball movement. Come on. Be there for him. Be there for him. I'm I'm ready for him. If he gives it back, if he jumps it, I'm ready. Oh, we're going. Nice blast. Way to be there. What the [ __ ] Coming back at us. Oh [ __ ] Oh [ __ ] Oh [ __ ] Come on. It's all good. I'm here too. Oh no. I got three. You get four bless. I got three. I got your back. Nice. Oh, that a boy. That a boy. Oh my. I'm out of stam. I can't faster. Hi. Oh shoot. Vortex. Nice Andy. Way to put your body on it. What the [ __ ] Get the ball. Nice across. Go Andy to the side. I'll stay in the middle. I'm going left. I'm in the middle. Oh, Mike. That's you. I give you a perfect ball, Mike. Yes. Come on. Let's",
            "start": 8276.56
        },
        {
            "text": "What the [ __ ] Get the ball. Nice across. Go Andy to the side. I'll stay in the middle. I'm going left. I'm in the middle. Oh, Mike. That's you. I give you a perfect ball, Mike. Yes. Come on. Let's go. What a pass. What a shot for the boys. Oh my god. Holy [ __ ] Look at this pass. Look at that. Right to your [ __ ] Wow. The bread basket. Right into your hands. Woo boys. Good [ __ ] everybody. That felt good. Let's keep it up. Now we're up one. Let's keep it up. Let's keep the pressure on. We got Vortex in the in the box. I'm going stay in the middle. Stay in the middle, Mike. Stay in the middle. God damn it. That's all right. [ __ ] you. One more. Oh, damn it, dude. This dude's insane. Blue face. Let's go. Blue face. Blue face is giving y'all dimes right now. Blue face, baby. Blue face is giving you dimes. Andy, kick that off the wall. Oh god. Are you crazy again? One more touch. Holy [ __ ] Good job. I'm going. I'm going off the wall. Off the wall. Oh. Oh, damn it. My My thumbs",
            "start": 8334.96
        },
        {
            "text": "is giving you dimes. Andy, kick that off the wall. Oh god. Are you crazy again? One more touch. Holy [ __ ] Good job. I'm going. I'm going off the wall. Off the wall. Oh. Oh, damn it. My My thumbs hurt so bad, dude. That just means you're trying. I'm pushing down so hard on this. Go. Go. Bless. I'm up. That a boy. Good passing. Oh, [ __ ] Sorry. It's too much. That's all right. That's all right. Stamina. Watch your stamina. Oh, tried to get a hold of him. Ah, I should have dolphin dived that. We're good. We're good. You got three back. You got three back. Andy in the middle. Get on two. Blue face has got four. We're good. You guys made it. Oh, Vortex is crazy. Vortex. I'm going up there. I'm up. Oh, let's go. Pass in the middle. Ready. Coming at you. Oh, get it, Eddie. Oh, what a good idea. What a good idea, dude. It was right there for that [ __ ] He mad us. He was [ __ ] Ed Reed back there. That was crazy. Oh, [ __ ] I feel bad about that one. Damn it, baby. Oh, that was such a good",
            "start": 8386.96
        },
        {
            "text": "What a good idea, dude. It was right there for that [ __ ] He mad us. He was [ __ ] Ed Reed back there. That was crazy. Oh, [ __ ] I feel bad about that one. Damn it, baby. Oh, that was such a good play though, man. This game is crazy. Damn, Chad. I [ __ ] up on that one. I pressed the wrong button. All right, Mike, I'll drop back for you. Yeah, you going to drop back? You sure? Okay. All right. Blue face. Oh, blue face. Blue face. Oh, blue face. Blue face. Stay on the right. I'm in the middle. Y friend these people. Oh, I need help back massive. You're good. Bless. You're good. Oh [ __ ] You're close. Blue face. Blue face. I'm moving. I'm moving. Get ready. Eddie. Yeah. Yeah. Yeah. I didn't get it. Into the middle. I was starting to kick already. Oh, let's go. Vortex right here by Oh my god. Oh, he's insane. Oh my god. My guy's so tired. I have no energy. Oh my god. Let's go, Blueace. Oh, Blue Face. Holy [ __ ] Blue face just [ __ ] rallied off himself. That was [ __ ] insane. One,",
            "start": 8440.0
        },
        {
            "text": "god. Oh, he's insane. Oh my god. My guy's so tired. I have no energy. Oh my god. Let's go, Blueace. Oh, Blue Face. Holy [ __ ] Blue face just [ __ ] rallied off himself. That was [ __ ] insane. One, two, three. That should be three goals. Going on Twitter. That's crazy. Flip that [ __ ] [ __ ] Wow. Oh my god. Yo, we got to friend them. We just ranked up. We just ranked. We're league two. Oh my god. That was insane. DM Blueace. Let's get him in the Discord. Blue. Hey, how do my friend Blueface? Oh my god. Damn, dude. Bless MVP. Bless. Really? Really? You had like seven somethings. Blueface just did three. Vortex tossed the ball over three people. Okay. I was here too, Kevin. Blessing was blessing was defense. So I was the entire I was locking down. Remember that that goal they put on us? Holy [ __ ] Don't worry about that. Don't worry about that. Hey though, you wouldn't have given you gave Blueface a chance to, you know, really try. It could have been five. One time says Andy's player",
            "start": 8519.24
        },
        {
            "text": "[ __ ] Don't worry about that. Don't worry about that. Hey though, you wouldn't have given you gave Blueface a chance to, you know, really try. It could have been five. One time says Andy's player was wheezing that whole screen. Dude, I was My guy had no stamina. That was [ __ ] nuts, bro. I'm just saying we can go to five. Remember till five, Andy. Andy, we want to play games with you. Come on, let's hang out. All right. What are we choosing? What color are we choosing? We're going squad leader. Always. Always. Andy's color. I want that color. Who has that sweatshirt? You can You can buy that. That hoodie is fire. The card. They give you all the money. No, there's no uh You're not spending actual money yet. They give you all the money. My character's got asthma. I got to chat. I'll drop back for you when after the next match. Tell me to replace my shinuards cuz I hate these. They're ugly as hell. Go. Come on. Queef nugget. Queef nugget. Queef nugget. Stop it. Stop it. Let's go. Queef",
            "start": 8589.44
        },
        {
            "text": "for you when after the next match. Tell me to replace my shinuards cuz I hate these. They're ugly as hell. Go. Come on. Queef nugget. Queef nugget. Queef nugget. Stop it. Stop it. Let's go. Queef nugget Mike. Mike, watch this. Uhoh. Help back here. I got him. Oh, right over here. Mike in the middle. Oh [ __ ] Oh [ __ ] Got him. Oh yeah, they selfish. Oh, it's it's not it's not pretty on the lack side. It's got to get central. Oh no. Oh help. Help. A. It's okay. Damn. That's all right. That's all right. We bounce back. We bounce. We bounce back. Look at this. Oh, that's all right. That's all right. That's all right. I'm scared cuz I think Blueface did that on purpose, you know. I got gold. I got gold. Queef nugget, get out of here. Scoot your boot. Let's go, Potato. Potato. Oh, you had to catch up to it. Oh, no way. That's in. You got to give that to me. [ __ ] central central time. I know. Queefuging back for you, Queefug. Here's I'm going to play defense. I'm playing goal. I'm going",
            "start": 8631.2
        },
        {
            "text": "catch up to it. Oh, no way. That's in. You got to give that to me. [ __ ] central central time. I know. Queefuging back for you, Queefug. Here's I'm going to play defense. I'm playing goal. I'm going in. I might play goal. I'm going to play D. [ __ ] Mike. Get in that hole. Come on. [ __ ] queef nugget, dude. What were you doing, bro? Goddamn queef nugget. I don't think they see what we're doing. See what we're doing. Potato. Get out of here. Scooch. Sorry. Oh. Yeah. I kind of say here. No. Jesus. Oh, bless God. Say thank you again. Say thank you again. It'll work. Locked it. Oh my god. Oh my Oh my god. Oh my god. Oh my god. Get on your microphone. Say something. Oh my god. Oh, your mic is live. Yeah, tell my mic's live. I'll be goalie. Back out. I got your back. I got your back, potato. Go forth and score for me. Queef nuggets also. Queef nugget. I love you. Queef nugget, you got to score a goal for me. I will score the s. Yes. Thank you, Queefug. Let's lock in. What type of pass is",
            "start": 8690.4
        },
        {
            "text": "Go forth and score for me. Queef nuggets also. Queef nugget. I love you. Queef nugget, you got to score a goal for me. I will score the s. Yes. Thank you, Queefug. Let's lock in. What type of pass is this? What kind of type of pass is that? It's the bad servers. Bad servers, y'all. Why did my microphone turn on all? Who am I? Who was that? Michael. Michael. Who was that? That much [ __ ] Was that Mike Dugget? Who was that? Like down on the D-pad. Dude, I don't know what's happening. I'm hitting down on the D-pad. I'm not hitting [ __ ] Hit it now. Wait, you weren't. Yeah, you weren't hitting block either. Straight side to side. That was a fast game. We got to get out of that game. That That was a reality check. Please play some matches. All right, we got to lock it. Please nugget is not going to be pleased. We got to lock it on the police. Okay, hold on. [ __ ] shin guards. Get out of my face. These shining guards are ugly as [ __ ] How do I take them off? Accessories. Pants. Uh, no.",
            "start": 8750.4
        },
        {
            "text": "to be pleased. We got to lock it on the police. Okay, hold on. [ __ ] shin guards. Get out of my face. These shining guards are ugly as [ __ ] How do I take them off? Accessories. Pants. Uh, no. Oh, accessories. Here we go. Here we go. Oh, it was the socks, too. The combo of the sock. E. Well, no. Take off those ones. Those ones suck. You don't want the over the socks ones. I don't I don't Wait, what? Go to your shing guards and then see. You got There you go. I don't I don't want anything. Andy, go barefoot. Yeah, barefoot. Oh, I could edit these colors, though. Oh, [ __ ] Yeah. Okay, we're going to edit the colors. Hold up, Mike. Go barefoot. No, I like my all-white Nikes. I got all whites. See how it goes. I got a I got a clean look. Just show me your grippers. Basic look. Show them grippers. My shoes, too, are ugly as [ __ ] Ugly as [ __ ] Take them off. We'll go. Let me just try it with without them. And the details we'll go with. They [ __ ] broke out the Tom Cruz bit. Roger.",
            "start": 8792.88
        },
        {
            "text": "grippers. My shoes, too, are ugly as [ __ ] Ugly as [ __ ] Take them off. We'll go. Let me just try it with without them. And the details we'll go with. They [ __ ] broke out the Tom Cruz bit. Roger. They didn't. I mean, how would they not? I don't know, man. What What happened? Help me. So, what happened? I just couldn't I couldn't think of Tom Cruz's name. So, instead he said, \"Oh, Tom.\" And it's a boat. No. No. Cuz Tim was doing the thing where he was like, \"All right, think of your favorite kind of boat.\" And I'm like, \"Steamboat. Tom Steamboat. I don't know his favorite boat.\" Like I guess he was also an actor cuz like you know if if he says Tom Steamboat in his head you think that there'd be a thing be like that's not a person. Yeah. No, I just I just named what Tim wanted me to name and Tim was like what's your favorite boat? And I'm like a steamboat which I first of all I don't even have a favorite boat. So that's a bad question first of all. Really? It's a bad I think it's a",
            "start": 8842.56
        },
        {
            "text": "and Tim was like what's your favorite boat? And I'm like a steamboat which I first of all I don't even have a favorite boat. So that's a bad question first of all. Really? It's a bad I think it's a bad question. You have a you have a favorite boat Kevin? Uh it's a cruise cruise boat motor not before yesterday. Also, that was crazy. We just did. What did I just do? That was pretty crazy. We didn't do anything exactly what I wanted. What do you mean? Remember when we were going to get food? We [ __ ] that up. Well, if we convince Andy to stay till 5, you can stay with food. I'm not staying till 5. Why not? Andy, stay with us. These are the unaccounted 4 hours. These are the four hours. Andy, you look stupid. Clearly not towards me. I'm blessed. You know what I mean? Not towards us. What's the pink? Like, what's going on here with this outfit? Oh, it's not even the same pink, huh? Oh, I love that pink. Yeah, let me like the this like the socks I wear to soccer actually. You got a photo",
            "start": 8890.32
        },
        {
            "text": "the pink? Like, what's going on here with this outfit? Oh, it's not even the same pink, huh? Oh, I love that pink. Yeah, let me like the this like the socks I wear to soccer actually. You got a photo of that? My pink socks I wear for soccer. Yeah. Yeah, he's got photos of that. I don't know if I do have photos. I mean, it's just would you you and a soccer squad leader? Everybody squad leader. Chris Ana texted me. I mean, Mike can vouch for my pink socks. I can 100% vouch. Chris Anka text me rival season 2. Oh [ __ ] Maybe you play that tonight. Maybe you play something's wrong. Uh Bless is on a different color. Wait, no. Oh, Andy's on a different color. Someone did a different color. I picked squad leader. I picked squad leader. The one that [ __ ] up. Andy [ __ ] up. What are you talking about? Squad leader. You're the only one that isn't red. Yeah, we're using yours. I don't know why I did something weird. Who knows? Andy [ __ ] up. We're on my [ __ ] Who's goalie? Who's goalie?",
            "start": 8935.2
        },
        {
            "text": "about? Squad leader. You're the only one that isn't red. Yeah, we're using yours. I don't know why I did something weird. Who knows? Andy [ __ ] up. We're on my [ __ ] Who's goalie? Who's goalie? This kid's talking. Hey, I'm burst. Oh [ __ ] I'm talking. Dude, I don't know how to mute, but you got it, big daddy. Let's go, Mike. You seem cool. Yeah, he's cool. He's super cool. There we go. I'm up last. I'm up. I'm up. Oh my. Oh, sorry. Too strong. It's all right. Also, this might be the last game. Just heads up. It's about to be 3:00. I don't know how to mute. Down on the D-pad. I did press. Who [ __ ] knows if I'm still talking or not? I'm sorry. He can hear you. Why would you do that? There we go. Burst. Oh, good. Hey, we're good. We're good. We're good. Good save, y'all. Come on now, big dad. Come on, Big Daddy. Oh, good try. I've lost it with the cutting. I'm sorry, guys. cuz I'm just not there anymore. I had it. I'm just I'm way off. Oh, burst to the goat. Great job, Burst. Great",
            "start": 8971.84
        },
        {
            "text": "dad. Come on, Big Daddy. Oh, good try. I've lost it with the cutting. I'm sorry, guys. cuz I'm just not there anymore. I had it. I'm just I'm way off. Oh, burst to the goat. Great job, Burst. Great job, Burst. Let's go. Slight. You got to get that. Help him out. Nice job. Back up. Back up. One behind you. Bless. One back. One behind you. Yeah. Bless. Nice. We're good. We're good. We're good. We're good. Burstes. Got it. Nice block. Pass it to you. Oh, crossing left. Wait, I don't have What the [ __ ] Whoa, you had it. Yeah, right. Okay, Kevin saw what I was saw. Yeah, that happened to me. It's US Central. I'm in the middle. Let's go, Mike. Oh, come on, Michael. Yes. Oh, that's [ __ ] man. Nice, Andy. Oh, US Central seems to be the worst. God, what the [ __ ] is happening? Yeah. tower towers they got over there. Yeah. Yeah. Servers in Kansas. They got them central towers running it on treadmills. Mhm. [ __ ] two floors. Orange stage. Oh [ __ ] Oh, good deep. That was great. Boot it.",
            "start": 9018.8
        },
        {
            "text": "they got over there. Yeah. Yeah. Servers in Kansas. They got them central towers running it on treadmills. Mhm. [ __ ] two floors. Orange stage. Oh [ __ ] Oh, good deep. That was great. Boot it. Boot it. That a boy. And there. Accept it. No. Michael. No. [ __ ] Accepting the ball is not as clean as you want it to be sometimes. What is happening? What is that? Y'all seen this [ __ ] Hey, this is weird. No, the game's lacking. The game broke. Yeah, the game's breaking. Okay, I was Oh, it's snapping back. That kid left the Oh my god. They left the game and they just left the ball on the field. That's was an insane situation. What the [ __ ] situation? That's [ __ ] That's [ __ ] Justin J with the $10 donation says, \"Andy, go till 5. It's the weekend league. It's the weekend league. Andy, come on.\" You're just saying words that don't mean anything. Don't listen to him. He doesn't know what he's talking about. Go home. Stay. Hang out with your family, dude. Hang out with pass. Blessing.",
            "start": 9084.16
        },
        {
            "text": "on.\" You're just saying words that don't mean anything. Don't listen to him. He doesn't know what he's talking about. Go home. Stay. Hang out with your family, dude. Hang out with pass. Blessing. Oh, right here. Bless Andy. Oh god, I was ready to Okay, we still got it. We still got it. Mike. Mike, you go. Yeah. Oh, [ __ ] I forgot you had a [ __ ] aim. Come on. Cross it. Oh. Oh my god. Bless. That was something incredible. Mike, I don't want to make a big deal, but I think the food is affecting me and bless it. Well, if we stay till 5:00, we can go get lunch. We're not We're going to end the day, which sucks. Nobody wants to end the day. I'm dizzy. Nobody wants that. Oh, let's go. I would love to go. Let's go slide. Oh, yes. Oh, sexy. Come on, Eon. Shoot. There we go. Yeah. Passing off the front wall is is the way. I like that. I like that idea, boys. It's huge. Come on now. That's sick. Let's go. Is Andrew reviewing Lies of P DLC? I mean, when we get it, but probably I'm definitely",
            "start": 9138.96
        },
        {
            "text": "front wall is is the way. I like that. I like that idea, boys. It's huge. Come on now. That's sick. Let's go. Is Andrew reviewing Lies of P DLC? I mean, when we get it, but probably I'm definitely on that [ __ ] We don't even know. We don't have a release date. That's the problem. I'm just reading. It's summer 2025 and like it's almost summer 2025. [ __ ] flying. Where is the the date we got up top? It'll be August. You got to mute this kid. Oh, that was good. Chat, I like it. Aon burst is good, bro. A burst is Stop talking like he can hear me cuz he can. Look at that. See that? That's my [ __ ] right there. Let's go slide. Oh, right here. Aon burst. A burst is player, bro. This is the kid you want on your squad. A [ __ ] [ __ ] you. I got it coming right at you, Andy. Yeah. Yeah. Good passing. No. God [ __ ] You really got to like Oh, wait. I'm burst. You're nasty. Throw slide. Let's go with it. Keep it. Keep it. [Music] Oh, I got it. Coming at you, Blast. Coming at you, Blast. Look",
            "start": 9195.6
        },
        {
            "text": "No. God [ __ ] You really got to like Oh, wait. I'm burst. You're nasty. Throw slide. Let's go with it. Keep it. Keep it. [Music] Oh, I got it. Coming at you, Blast. Coming at you, Blast. Look at this [ __ ] bro. Look at this teamwork right here. Oh my god. Let's go, Bless. Come on. Come on, Bless. Why am I losing it like this? That's all right. That's all right. There we go. There we go. There we go. Oh my. Good teamwork, y'all. We got a minute 16. We're fine. Keep up the pressure. Keep it on their end. You guys are playing great. You're tied. Let's break this up. Come on. Somebody score. On burst. There you go. Aon burst. We got it. Everybody stick together. Yeah. Look at him. He's moving up with you. Oh, great call outs. Great movement. He's going to look for one of you. These dudes are insane. You guys are nasty. Great job, team. That was crazy. That was That was See how he went close too on it. He didn't go far. That was a nice move right there. I'm coming. Bless. I'm coming. One",
            "start": 9261.64
        },
        {
            "text": "insane. You guys are nasty. Great job, team. That was crazy. That was That was See how he went close too on it. He didn't go far. That was a nice move right there. I'm coming. Bless. I'm coming. One minute left in the air. Remember Mike bottom right? Did you know there was a radar, Mike? Yes, I did know there was a radar. Love that we're learning this, man. We got it. All right, slide. Come on. Come on. Watch it. Yep. Bless. Get it out of here. We're up. Let's get it out of the half. Get it over to their half. Oh, I got tackled. Should have been a penalty. How did I not tackle it? Get it out. Get it out. Yeah. Nice job. Good ball. Good ball. Threeon one. Three on goal. You got this, Andy. I just I just pass the pass. Tell him. Oh, good job, bro. It's It's crazy lag. You got a great beautiful pass. Hey, let's lock it in, team. Got to get a defensive stop here. Clear that ball if you get it. I'm on it. Yeah, there we go. That's game. Nice. That's game. That's not game. Oh, [ __ ] Get",
            "start": 9324.16
        },
        {
            "text": "pass. Hey, let's lock it in, team. Got to get a defensive stop here. Clear that ball if you get it. I'm on it. Yeah, there we go. That's game. Nice. That's game. That's not game. Oh, [ __ ] Get it. Get it. Oh my god. I [ __ ] up. I went out of it. I went on first. Oh, man. And good job. That squad is crazy, dude. That's great job, J. Thanks for 73 months, J. Great job, dude. We got time for one more. Let's play another one. We got time. Only three minutes, guys. We should We should wrap it up. That's the time of a game. Give the people what they want. You do three minute matches. My bad. Give the people what they want. One more win, we rank up. Yeah, we got to get over here. Yeah, but one more loss, then we got to do three more wins. Sure. I mean, yeah, we're not going to lose. Yeah, but like I could see Mike throwing it. We need Aon Burst. Aon Burst was fantastic. Vortex. We need Vortex. I I like Aon Burst was very positive. He was talking. He was talking. He was talking. I didn't",
            "start": 9382.8
        },
        {
            "text": "like I could see Mike throwing it. We need Aon Burst. Aon Burst was fantastic. Vortex. We need Vortex. I I like Aon Burst was very positive. He was talking. He was talking. He was talking. I didn't hear him. Mike, did you mute them? Like mute other people. I like hearing them. You're going to squad leader on the left. What do you mean you don't know? So you go to Yeah, but if they Oh, I guess you just do your uh I'm not going to say anything bad. Don't worry about that. There you go. Right there. I already muted it. Do you see how it's all muted for you? I was letting you know like I think that's the you press both those that I did all I did all mute for you, Kevin, cuz you're squad leader. On the top left, it'll tell you which team you are of way home. Oh, okay. I got I'm just doing squad leader. Why is squad leader different from captain? I guess it's the party squad. Yeah, that makes sense. All right, let's lock the [ __ ] in. Let's lock in. [Applause] 6 minutes. Give me that rock,",
            "start": 9431.52
        },
        {
            "text": "leader. Why is squad leader different from captain? I guess it's the party squad. Yeah, that makes sense. All right, let's lock the [ __ ] in. Let's lock in. [Applause] 6 minutes. Give me that rock, [ __ ] Nice, Andy. Pass it. Soft touch. Soft touch. Oh, here we go. That's you and I. Get it, Andy. Yep. I'm up. Oh, damn it. Hey, they got right in the way of it. We might be down a man. Play like you're not. Play like you're not. Yep. Play like we're not down a man, but we're down a man. Oh no. Wow. He didn't even let me. That's crazy. My guy just gave up. My thumb feels like I've been playing a fighting game. You kind of are. Like what was that dive I just did? BJ Bernardo. 30 butts of support. You went to like dive on the floor for it. All right, I'm getting out of goalkeeper. I'm getting out of goal. Oh [ __ ] I can't get out of goal. That's just Somebody Somebody pop me. Take the goal for him. It's a little difficult right now. Oh [ __ ] Damn. Andy, it's How do I play? How do I play?",
            "start": 9478.08
        },
        {
            "text": "of goal. Oh [ __ ] I can't get out of goal. That's just Somebody Somebody pop me. Take the goal for him. It's a little difficult right now. Oh [ __ ] Damn. Andy, it's How do I play? How do I play? Circle to Oh my god. Andy andy, it's you. It's Andy just ran out of the I don't know how to [ __ ] play. Oh no. I hit circle to dive and my guy like slid forward. Look at that. See, he just slid forward. Oh. Oh man. Hey, you hit the wrong button. I'll be in goal. I'm in goal. I'm in goal. Thank god. Somewhat order to chaos. Heaps. I got it. Okay. Well, somebody's got to get the ball. There we go. Yo, heaps. Go do your thing, bro. All right. We're down two. You guys got to score here. Down two. Yeah. Oh. Oh, yeah. Not too one person, though. There we go. Uh-oh. Where's Vortex when you need him? This can't be the last game, but we're not playing four on five for the last game. I think we are. We're not getting embarrassed. I'm shutting it down afterwards. Wow. Okay, chat. Just so you know,",
            "start": 9546.64
        },
        {
            "text": "This can't be the last game, but we're not playing four on five for the last game. I think we are. We're not getting embarrassed. I'm shutting it down afterwards. Wow. Okay, chat. Just so you know, we're going to leave after this game, everybody. Great week. A lot of great content, Andy. Oh, great job, Bless. Best way to stay in there, dude. Way to stay in the pocket. Oh, [ __ ] you. There you go, bless. Get across. Big little lob pass over here. Oh, [ __ ] Oh, [ __ ] Got him. Teased him. I teased him. They go heaps. Come on, Heaps. Let's go. Heaps. Fine. You're fine. Come on, Andies. There we go. Break them. They go Heaps. Heaps. And Andy. Oh, you got to hit that pass, Brody. Mikey, this is your moment. I'm ready. Good job. Oh, [ __ ] They be [ __ ] with me. [ __ ] There's two people. I just did admin. They just they just like kind of over the head just touch it. Yeah. Yeah. So, see I'm looking at them. I got one person to my left. I got to make a choice. Oh, they just did the",
            "start": 9598.56
        },
        {
            "text": "I just did admin. They just they just like kind of over the head just touch it. Yeah. Yeah. So, see I'm looking at them. I got one person to my left. I got to make a choice. Oh, they just did the dribble. Oh, yeah. They did like a lot pass. Yeah. All right. Here we go. Oh, that was Oh, that was going to be nice, too. Oh my god, chat. Uh-oh. Uh-oh. I [ __ ] you. Oh, [ __ ] you. Great save. Oh, good job, Bless. The choice to come out of the What is that rubber banding? Okay. Yeah. Well, now we're on the west. It feels better. It doesn't play better, brother. [ __ ] you. This is going crazy, brother. Brother, [ __ ] you. Oh, damn. Go, go, go. Everybody run. Everybody run. See how far they go. Where do they clear it? Oh my god. Oh, let's go. Heaps. A damn. Oh [ __ ] Okay, we're good. We're good. We're good. We take the mercy rule. We play one more match. Go, go, go. You guys, you can score. Oh, damn it. I thought they were going to go out. [ __ ] you, man. I'm not dolphin diving. It's so",
            "start": 9655.76
        },
        {
            "text": "We're good. We take the mercy rule. We play one more match. Go, go, go. You guys, you can score. Oh, damn it. I thought they were going to go out. [ __ ] you, man. I'm not dolphin diving. It's so hard to get a idea of the buttons. Wow. Nasty. That was a nasty move on their part. What do you mean? I mean, he he played me like a fiddle. I thought he'd cross. No, he bent it. Bent it like Beckham. Watch this. [ __ ] open for him. Look. Look. You open up. Well, yeah. Ready for the pass that, bro. That's a nasty move. That's a good move. They had an AI bot on their team, which I don't believe. Do they really? No. Their character was just named that. We can't end on that. We can't end on that. We can You can't end on that. We can't end on that. Kevin didn't. He wants to stay. I always keep an eye on you. We got to go. We got to go. We got to get wins. We were 5v4. It didn't I didn't Yeah, that wasn't fair. That didn't count. Should have clicked over there. Can't end on that. Can't end on",
            "start": 9735.2
        },
        {
            "text": "eye on you. We got to go. We got to go. We got to get wins. We were 5v4. It didn't I didn't Yeah, that wasn't fair. That didn't count. Should have clicked over there. Can't end on that. Can't end on that. Oh, the the the dolphin dive is so important and so hard to do in the moment. Get us the right amount of players, y'all. I think that Red Bull with an empty stomach sitting weird. Oh, yeah. It does sit weird when you don't have anything. I'm vibrating. Remember when you drank seven of them, Mike, in a weekend? That's when uh that's Well, it was one day. It was one day. Oh, yeah. And uh yeah, definitely felt it. Felt like I was going to die. Was that the when you did the super long stream? Uh, no. That's when I did uh Fall Mania with Grand Pooh Bear and he gave me cases of Red Bull at my doorstep because it was sponsored by Red Bull. Yeah. And I learned a valuable lesson on that one. Yeah. It took you out for at least like two weeks. Yeah. Yeah. You're never the same after that. You",
            "start": 9785.84
        },
        {
            "text": "doorstep because it was sponsored by Red Bull. Yeah. And I learned a valuable lesson on that one. Yeah. It took you out for at least like two weeks. Yeah. Yeah. You're never the same after that. You weren't right after that. Are we good? Yeah, we're good. Oh, 259 256. This could be bad. We have three numbers. You're like, I don't know this. No, they're a team. They come together. They they they we currently have three people on the field and it's just us three. What? Do you not see this? Oh, yeah. We shut it off. We parked the bus and we wait for our moment, boys. We can do this. Andy takes left. Blessing takes right. We're all good. There you go. Bless. There you go. Bless. Nice little bless. Okay, bless. Use that field. Use that open field on the left. Yep. There you go. Get him over on him, man. That's all right. That's all right. This kid's not real. That kid doesn't know what he's doing. Steal that ball from him. We're good. We're good. Bless. That's you. Kick it up midfield.",
            "start": 9831.6
        },
        {
            "text": "on him, man. That's all right. That's all right. This kid's not real. That kid doesn't know what he's doing. Steal that ball from him. We're good. We're good. Bless. That's you. Kick it up midfield. Just boot it. We're good. These aren't even real players. These aren't even real players. Great. I I dude I can tell they're not even playing like real players go. They go Annie coming up to you. Go. My guy's just [ __ ] tired, bro. That's all right. That's all right. We're just fine. We can beat this team. Everybody back. Everybody back. [Applause] I got the I got the center guy. Oh [ __ ] I don't Oh, good try. Bless shades XL. Good [ __ ] Good [ __ ] Good [ __ ] We'll take that. We're down one. We're down one. We can do this. Replay. Waiting for players. I got scared. I got scared. That's all. All right. It's just us again. All right. Get me out of the goal. I'm coming back. I'm coming back. You want bless? Just work it. Okay. Hold up now. Okay, there we go. Oh, [ __ ] you. What the",
            "start": 9884.96
        },
        {
            "text": "all. All right. It's just us again. All right. Get me out of the goal. I'm coming back. I'm coming back. You want bless? Just work it. Okay. Hold up now. Okay, there we go. Oh, [ __ ] you. What the [ __ ] This guy's playing like a human. Oh, one of them was definitely a human. Yeah, their name was like Shades XL or some [ __ ] Where's 256 and 259? Oh man, I'm happy I didn't move for that. They go blast. They go blast. You and Andy break it. You and Andy break it. Oh, it's going to be good footwork is going to win the game. Good footwork. You got it. You break one or two of them and then you use the rest of the field and you get in there. There you go. Oh [ __ ] Damn. I'm coming up. Oh my. Okay. I'm going to kick that up. Holy [ __ ] I'm going to try to play defense right here. Get him. Damn it. There you go. There you go, Andy. You're good. You got the There you go. This is you. I have no stamina. Nothing. We are playing We're playing for Oh no, that one's just not moving. Damn. Okay.",
            "start": 9946.32
        },
        {
            "text": "it. There you go. There you go, Andy. You're good. You got the There you go. This is you. I have no stamina. Nothing. We are playing We're playing for Oh no, that one's just not moving. Damn. Okay. What the [ __ ] is happening? Careful with that. Those I'm there. I'm there. I'm there. I got it. Let's go. Let's go. I got to remember you guys have no stamina by that point when we go on offense. Yeah. Just struggling. using so much stamina on defense. Okay. Okay. Oh my god. I don't I couldn't read it. It was an awkward angle. It was an awkward angle on that one. Couldn't read it. Oh wow. Oh, damn it, dude. That's super jked. Okay. Oh, they [ __ ] with us now. They They [ __ ] with us now. They [ __ ] chaotic. Yeah, they're going to go for the off the back wall onto that. Yeah, they [ __ ] with us. They got all the time in the world to do whatever they want. It still says waiting for players on the bottom line. They're not coming. Going to break right. Yeah. Coming at you, Bless. Oh,",
            "start": 10014.24
        },
        {
            "text": "with us. They got all the time in the world to do whatever they want. It still says waiting for players on the bottom line. They're not coming. Going to break right. Yeah. Coming at you, Bless. Oh, Bless. That's up into the You and Andy are wide open. Andy on the cross. Andy on the cross. Uh, good try. I tried to know that. Why do they have the seafue music in this? Okay. Oh, Andy. Oh, Mike. Oh, Andy. Going. Go. Go, Andy. Go. Bless. He's across all alone. Woo. Shoot it. Bless. One more. Mikey. Oh, I love that. I love that, boys. I love that boys. Pass in the middle. I got you. Keep working. [ __ ] I just started button mashing. I got scared. Yeah, I know. There it is. They're getting horny. I know what you're doing. Let's go. Bless coming to you. It's you and it's on the left. [ __ ] Oh my god. I'm sorry. It's all good. It's all good. Oh [ __ ] Oh, it hit me. It hit me in the back of the head. A dick. Focus in. I got There you go. Go. No, we're fine. Take a deep breath. If we can get",
            "start": 10077.6
        },
        {
            "text": "god. I'm sorry. It's all good. It's all good. Oh [ __ ] Oh, it hit me. It hit me in the back of the head. A dick. Focus in. I got There you go. Go. No, we're fine. Take a deep breath. If we can get one, we win. Yeah. All right. Oh, I count it. [ __ ] That sucks. I mean, honestly. Oh, they have the Rocket League cam. I just noticed that. Oh, yeah. If you press Y, if you press Y, it just I didn't know that. Okay. Whoa, whoa, whoa, whoa, whoa, whoa, whoa. Oh, I was wondering what that did. I thought it was like adsing. It'd be good to have on a back paddle so you just in and out of it. Yeah, quick quick reorient yourself and then back. Especially on those shots. Oh, I got you on the center. There you go. Nice. Come on. Come on. [ __ ] you. [ __ ] you. I have just no stamina. God damn it. Good try, boys. You're fine. I know you got one over here. Get that. Go bliss. Oh, it didn't go far enough. Oh my god. 30 seconds. [ __ ] you. Nice. Oh my god. Go bless. Oh [ __ ] I just didn't pass it",
            "start": 10143.6
        },
        {
            "text": "try, boys. You're fine. I know you got one over here. Get that. Go bliss. Oh, it didn't go far enough. Oh my god. 30 seconds. [ __ ] you. Nice. Oh my god. Go bless. Oh [ __ ] I just didn't pass it hard enough. Oh, that's not That's nothing you can do about [ __ ] I don't Man, like the passing it. Do you hold it longer to kick harder or cuz every pass I do is just like a little [ __ ] fart. Good try. We all go offense. Full offense. Pull off. Pull the pull the goalie. Let's go. Let's go. Love that. Bless. Oh [ __ ] [ __ ] did the dive thing. What? What? They didn't need that. Just blow the whistle. They gave them the last shot. Why would they give the last shot? Just end that [ __ ] We can't end it like that. Yeah, we can this unstable. Oh, Kevin already had back. I'm back. That's fine. I hate you guys. Blessed, do you want to play one more? I mean, is Andy trying to play? Yeah. Yeah. No, let's play one more. Yeah, we should have [ __ ] ordered food. God damn it. Uh, it says people",
            "start": 10204.16
        },
        {
            "text": "I hate you guys. Blessed, do you want to play one more? I mean, is Andy trying to play? Yeah. Yeah. No, let's play one more. Yeah, we should have [ __ ] ordered food. God damn it. Uh, it says people will ser the match. I think my needs back. I'm backing out of the scoreboard. There we go. Yep. Yeah. If the ranks, we take ranks seriously. You know what I mean? So, you can't be [ __ ] around with I'm going to leave it on yours. I'll be back in like 10. Little Lucas still open. Little Lucas is probably closed by now. Uh I thought Little Lucas closes at 3. Yeah, that sounds right. I mean, it's 3:12. See what you going to do. What was that? It's over three then. Thank god. Yeah. So, yeah, they're closed. Never a good sign when we're showing four people. You guys is broken. Never never a good sign when we're showing. Can't wait to see how this goes. Can't wait to see how this goes. God damn it. We're going till 5. What if we just quit immediately and then go back in? I think we could do",
            "start": 10295.52
        },
        {
            "text": "sign when we're showing. Can't wait to see how this goes. Can't wait to see how this goes. God damn it. We're going till 5. What if we just quit immediately and then go back in? I think we could do that. What's the worst thing that happens? If it says, \"Hey, you're on a player cool down.\" We end the stream and then everybody gets what they want. Your mic is on again. I Kevin, I have no idea what's happening, but I'll turn it off. R2 and R2 and L2 look like they activate. Deactivate. I turn off. See how right here right trigger lets you mute it and then Yeah. I I've explained that to him three times. He I'm in the options turning it off. He keeps Yeah, but it's there's R2 and L2. Chad, name some. Why would it turn it on? He wants to know some cuisine. Chad, do me a favor. It's 4v5. Yep. Well, we can we can do better. We can do better. I can be goalie and you guys can now we can at least cook a little bit. We can do something with four. We can do something with four. Oh. Oh, this guy's",
            "start": 10336.72
        },
        {
            "text": "we can we can do better. We can do better. I can be goalie and you guys can now we can at least cook a little bit. We can do something with four. We can do something with four. Oh. Oh, this guy's not [ __ ] around. I got it. Clear. I'm way open up top. Coming at you. Oh, that's it. That's great. That's it. Oh, Andy, that you got all the time in the world. Big D try, remember to bang that off that top middle. Work that top middle a little bit more. Especially if it's even just yourself like [ __ ] you know, Zion would do. Throwing it off the backboard to himself. Got it. Oh, good save. We're good. Oh, let's go. Oh, I'm so tired. Two's on the breakaway. Oh, good save. Good save. Yeah, we good. Bless. [ __ ] What was that? What the [ __ ] Why didn't I defend that? Oh, I went out. Oh, he went the wrong way. Yeah, I think Kevin's right. I think it is the food. It's the food. I think it is the hunger. You've worn out. You I'm worn out. I'm going to start playing D. Okay. Well, no. We only",
            "start": 10376.48
        },
        {
            "text": "the wrong way. Yeah, I think Kevin's right. I think it is the food. It's the food. I think it is the hunger. You've worn out. You I'm worn out. I'm going to start playing D. Okay. Well, no. We only have three people now. Oh, we got like I'll play like mid. Wait, somebody just left, too. No, we've always had this M. Yeah, we've only had Yeah, it's always been 4v5. Keep it. No, he just Oh, okay. Thank god. Let's just let Thank god play goalie. Yeah, let's maybe the three of us work. Oh, no. Oh, Andy, touch it. There you go. Touch it. There it is. I'm making a run. Tell me. Talk to me. I try to get away from him. Oh, it's all good. [ __ ] [ __ ] Oh, he's [ __ ] doing the dance on me. Oh, Andy. Oh, so close. Let's go, Mike. Go. Let's go. Let's go. That's all you, Mike. I'm off the wall. Oh my freak. Nasty. Thank you, bro. Come on. Oh my, dude. [ __ ] yeah. off that wall. Do it that many times. Wide open net. Mhm. Thank God. Come back to net. Come back to goalkeeping. Mm- He didn't see it.",
            "start": 10449.12
        },
        {
            "text": "freak. Nasty. Thank you, bro. Come on. Oh my, dude. [ __ ] yeah. off that wall. Do it that many times. Wide open net. Mhm. Thank God. Come back to net. Come back to goalkeeping. Mm- He didn't see it. Yeah, he didn't want it. Player four isn't playing over there. We'll take that. We'll take that. Might be 4v4. Empty net. I'm good. Empty net. Careful, Mike. I got it. Holy [ __ ] Blessing left side. Oh no, he's off on my ass. He's off on my ass. You did exactly what you needed to do. God, this game was good. This game is a fun time. He saw me going to you. I kicked him with my left foot, not the right foot. Got me. [ __ ] up. All right. All right. Get me out of goal. Come back and I'll get it. I'll get it. I'll get it. Oh [ __ ] My guys, I'm moving. Oh my god. Why do I lose the ball? I got you. You ready to go over there? Oh my god. Oh my god. Oh my god. Oh my gosh. Oh my god. Oh [ __ ] I just got tackle. There you go. You two work. Nobody in goal. If you get that ball, you just got to",
            "start": 10503.0
        },
        {
            "text": "you. You ready to go over there? Oh my god. Oh my god. Oh my god. Oh my gosh. Oh my god. Oh [ __ ] I just got tackle. There you go. You two work. Nobody in goal. If you get that ball, you just got to shoot it. You got to let that thing rip. Go, Mike. Oh, he blocked it, but I let it rip. Good call. That kid's all over us. It's a monster. It's a monster. They go work together. work together. All the time in the world. Oh my god. I tried. I tried. Amazing. I try to get it to curve in. You're crazy. Go ahead. Oh, let's go. Thank god. Crazy. Crazy. You ready? Oh my god. He's be Come on. Yes, boys. Holy [ __ ] We're in this game. I'm coming back for goal. I'll come back for goal. Let's keep it up. Keep it up. That's crazy work, you guys. That's crazy work. What happened there? Oh, great pass. Thank God. Way not to be selfish, buddy. Way to go. I'm coming back. Bless. Yeah, there we go. We're good. Nice. Thank god it's just the god on Thank God, dude. He's going to He's going to run with",
            "start": 10564.48
        },
        {
            "text": "Thank God. Way not to be selfish, buddy. Way to go. I'm coming back. Bless. Yeah, there we go. We're good. Nice. Thank god it's just the god on Thank God, dude. He's going to He's going to run with you. He's going to run with you. Yeah. Yeah. Save some stamina. One more. Oh my god. Oh my. Coming at you, boys. Big old clear. Yeah, I've got full stamina. Back in that thing. Oh, he's way out of goal. Hold on. This might Oh [ __ ] Damn it. That was so close. Oh, he might have baited us. I got one to my right. I'm good. I'm good. I'm good, boys. Good defense. Great defense. Crazy defense. That guy's four on one on the go and didn't even pass. Did not want to let it go. Did not want to pass it at all. Get him, Andy. Oh. Oh, Jesus. Oh, great. Nice blast. I got it. Go, Mike. Oh, Andy, I got you. Oh, he blocked it, but it's to you still. Oh, no. Oh, Andy, [ __ ] you. Yes. Yes. It's just you two. It's just you two. He's on your left. Blessings on your left. Nice. Let's go. Sure. I think God's",
            "start": 10630.16
        },
        {
            "text": "Oh, he blocked it, but it's to you still. Oh, no. Oh, Andy, [ __ ] you. Yes. Yes. It's just you two. It's just you two. He's on your left. Blessings on your left. Nice. Let's go. Sure. I think God's there. Get ready for the reset. Right here. Right here. Reset. Let's go. Let's go. Holy [ __ ] Well done, boys. Well done. Holy [ __ ] Great job, boys. Exhilarating. Thank God with the back wall touch. Nice. Way to be ready. Ponytail. Way to be ready. What are you doing? Thank god. Speak to me. Okay. Hey, thank God. I think he's got it. Okay, we're going. Oh, he's right there. A damn it. Oh, no. Stop doing the dolphin diamond. I'm professing it all the time. Oh, thank God. Oh my god. Oh my. Oh, Mike's right to you. Yeah, I'm there. Mike, I'm in the middle. I'm in the middle. Oh, sorry. It's all good. It's all good. Oh [ __ ] There you go, Andy. Nice touch. Nice touch. Come with me. Off the back wall. off the back wall. [ __ ] Oh. Oh, good try. I'm chasing him. I'm chasing. I'm giving I'm",
            "start": 10699.2
        },
        {
            "text": "good. It's all good. Oh [ __ ] There you go, Andy. Nice touch. Nice touch. Come with me. Off the back wall. off the back wall. [ __ ] Oh. Oh, good try. I'm chasing him. I'm chasing. I'm giving I'm extra efforting. Oh, I have no more juice. We're good. We're good. We're good. I made it back. I made it back. Oh. Oh my god. [ __ ] you. Oh. Hey, we still have overtime. This is not over. This is not over. It's crazy. Did you guys just playing down one guy and tied? Oh, good try. Thank god. That means it's the right call. Okay, I'm going to go. I'm going go. That's what we needed. Here we go. Here we go. Oh, [ __ ] you. [ __ ] Jesus. Got him. Oh my god. Thank god. Get him up there. Get it up to him. That's you, Andy. Send it right back. You're fine. Okay. Oh, good call. Oh, Andy, that's kind of nasty, though. Yeah, kind of nasty. That's kind of Oh, that's really nasty. Oh, this could be something. Let's go. Bless. There you go. Andy's coming to you. Oh [ __ ] It's coming. 8 seconds. Keep",
            "start": 10760.72
        },
        {
            "text": "of nasty, though. Yeah, kind of nasty. That's kind of Oh, that's really nasty. Oh, this could be something. Let's go. Bless. There you go. Andy's coming to you. Oh [ __ ] It's coming. 8 seconds. Keep playing overtime. Overtime. Come back on defense. Get back on defense. Nice. Bless. One more. We're good. We're good. We're good. We're good. Go, Bless. It's all you. Keep working. Uhoh. Get back on D. Come back home. I have zero stamina. You're good. Take your time. It's you and thank God. Go. Thank God. Go. Thank God. Go. Thank God. It's off the wall to you. Oh my god. Holy [ __ ] Come on. What a game. Thrilling. Oh, I needed that. That is thrilling. I needed that [ __ ] great play. Five 4v5 against the ponytail duo. Dominated us. Put us up. Put us up. Oh man. Great game. Good job. That's what I needed. Say goodbye, gamers. We love y'all. We appreciate y'all. We'll be back on Monday with a lot more content. Love y'all. Have a great weekend. Goodbye. [Music]",
            "start": 10823.2
        }
    ]
}