{
    "id": 13832,
    "video_id": "Dvg9uYJOT9E",
    "show_name": "Gamescast",
    "hosts": [
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "Our FIRST HANDS ON With The Nintendo Switch 2!",
    "description": "Tim Gettys and Blessing Adeoye Jr FIRST HANDS ON With The Nintendo Switch 2!\n\nWishlist Lost Skies today: https://kindafunny.com/lostskies\nWishlist Monaco 2 today:\nhttp://kindafunny.com/monaco2\nGo to http://rocketmoney.com/kindafunny to cancel your unwanted subscriptions with Rocket Money.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1743685218,
    "duration": 1536,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? We are here in New York City. I'm Tim Gettys. This is Blessing at Yoya Jr. Yep. How's it going, Tim? Oh, it's going so well. We just spent the entire day for the very first time playing the Nintendo Switch, too. Yeah, we did. And how are you feeling right now? Oh, I'm feeling so good. It's been such a great day, right? We got to we got to play a lot of games that we're going to talk about over the course of many different episodes of Games Cast, right? little small mini episodes. Um, but I'm just feeling overall good. It's a new It's a new era. Tim, there was an energy today that uh it's very rare to get and it was very exciting to see other people getting our hands on new hardware that uh is new but familiar, you know, and I think there there's a lot of pros there, some cons. I will say we'll get into all of that. Like you're saying, we're going to do a bunch of different uh little games cast of some of the games that we've played. Uh this episode's going",
            "start": 0.07
        },
        {
            "text": "some cons. I will say we'll get into all of that. Like you're saying, we're going to do a bunch of different uh little games cast of some of the games that we've played. Uh this episode's going to be about our hardware impressions. Whether it's the Pro Controller that we extensively got to use, uh the Joy-Con 2OS that we used both um as traditional JoyCons kind of nunchuck style, but then also in mouse mode. Uh and that's also going to include the camera that we got to play with a little bit. And um what am I missing anything there? I mean the handheld mode and then just Yeah, just the Switch itself, how the screen looks and all that stuff. Yeah. Yeah, we actually we got to play a whole bunch of games. So um we'll have a lot of experience with the hardware with the hands on. Um, so I kind of just want to start off with top level impressions of holding the Switch 2 for the first time. Yeah, honestly that this is where I think it might get the most uninteresting because holding the",
            "start": 42.0
        },
        {
            "text": "kind of just want to start off with top level impressions of holding the Switch 2 for the first time. Yeah, honestly that this is where I think it might get the most uninteresting because holding the Switch 2 hardware for the first time, it feels like the Switch one but slightly better and bigger and sleeker, right? Like it's all the things. It's all the little tiny improvements that you want out of a Switch 2 iteration that very much feels like an iteration, not necessarily an innovation. And so that's kind of my take on it. I'm with you of like, man, an OLED would have been such a slam dunk for this thing and I think really could have made it made it pop. It still looks good, right? It still feels good and I'm expecting that in the future. But Tim, what do you think? I mean, there's a lot to to break down here in a in a very nerdy way. Uh, in a very Tim's being annoying way, but also in just like a general way. General way, you're nailing it. I think this is very much, hey, it's the",
            "start": 79.6
        },
        {
            "text": "to to break down here in a in a very nerdy way. Uh, in a very Tim's being annoying way, but also in just like a general way. General way, you're nailing it. I think this is very much, hey, it's the Switch again, but just better in pretty much every way. The one way it's not OLED. Having said that, as the biggest OLED stickler in the world, I was very worried about this LCD screen. It's great. Yeah, I was saying going into this like if it's not going to be OLED, I want a PlayStation Portal equivalent screen. And in my experience so far, we're getting that. The HDR is really good. Really, really good. I got to play a lot of Mario Kart World and they're taking advantage of it. Really showing it off. Um the colors look great. The black levels are awesome. Like again, it's not OLED. And there's every time I turn my Switch OLED on, it hits me with this level of like, oh, this looks good. I wasn't getting that. Yeah. But very, very impressed. And like I got to say, like honestly, the most",
            "start": 116.96
        },
        {
            "text": "every time I turn my Switch OLED on, it hits me with this level of like, oh, this looks good. I wasn't getting that. Yeah. But very, very impressed. And like I got to say, like honestly, the most important thing Tim Getty's can say about this, I am not painfully upset that OLED's not going to be here. It's okay. It's going to be okay. It'll be it'll be a special treat for you in a few years. Yeah. But but even then, like, it's I of course I'm going to want that and and and need it. And maybe more experience will tell me otherwise, but so far I'm like, this is fine. This is it's more than fine. This is great. It's good. Yeah. Honestly. Yeah. Like I I think for me the thing that popped was playing Zelda Tears of the Kingdom, the Nintendo Switch 2 edition, right? Where you can see the upgrade. You can see how much better the game looks and playing in a handheld mode. It feels like a more premium Switch, which is again all I really want from the thing, right? I think it's going to get",
            "start": 158.72
        },
        {
            "text": "You can see how much better the game looks and playing in a handheld mode. It feels like a more premium Switch, which is again all I really want from the thing, right? I think it's going to get more interesting as we talk about the other pieces of hardware, as we talk about the Pro Controller and the and the new JoyCons. I think that's where things get really more interesting. I want to jump in there. You saying it feels like a more premium switch. I don't know that I agree really because here's the problem. The screen itself, right, the OLED felt like such a premium to me here. It's like I like I everything I just said feels I'll put on the same level because it is bigger. The HDR is very very nice. 120 frames per second. Uh all of that stuff I think adds up to pros and cons, but I'll give it kind of equal in screen quality. But I was pretty disappointed with how the JoyCons felt. They and how the buttons felt. Is it that they felt the same? Cuz that Yeah, they feel exactly the same.",
            "start": 196.32
        },
        {
            "text": "it kind of equal in screen quality. But I was pretty disappointed with how the JoyCons felt. They and how the buttons felt. Is it that they felt the same? Cuz that Yeah, they feel exactly the same. And that's what I'm saying. I don't think it feels premium. It definitely lacked a level like seeing. Okay, we're going to get bigger Joy-Cons. And I'm not just talking about the button size. Like when I clicked the trigger, the shoulder, it feels exactly like the Switch One. And that's not a compliment. Yeah. No, I I feel that. I guess that for me that was what I was expecting coming into this thing, right? Even as we're seeing the mouse functionality, I was like, \"All right, well, I guess you're going to want to feel keep the clicky nature of it because that's what you're going for here.\" But I totally agree as far as Yeah, the JoyCons feel the same. There's some new stuff in there as far as as far as features, right? But as far as game feel, the analog's the same. The buttons are the",
            "start": 234.24
        },
        {
            "text": "But I totally agree as far as Yeah, the JoyCons feel the same. There's some new stuff in there as far as as far as features, right? But as far as game feel, the analog's the same. The buttons are the same, right? You're getting kind of the same little I I think the analog stick specifically way bigger. Like feel they feel way way better, I would say. Uh face buttons slightly bigger. Like not that noticeable. Um, I will say that outside of the um, handheld mode when we're just playing with the Joy-Cons separated, uh, the the few experiences that I had doing that, I was very impressed with just the JoyCons themselves. The size of them when you're just with a single Joy-Con, it feels way better to me. Maybe it's just the size of my hand, I don't know. I liked it a lot better than the Joy-Con one. Anytime you're playing with a single one, that always felt very chintzy, very little kid, like it didn't feel right. the bigger um S and SR and SL buttons on the top of the Joy-Con also go a",
            "start": 271.52
        },
        {
            "text": "one. Anytime you're playing with a single one, that always felt very chintzy, very little kid, like it didn't feel right. the bigger um S and SR and SL buttons on the top of the Joy-Con also go a very long way, but to me it's more just like when the total package where how I'm gonna play the Switch the most besides docked is handheld with these things. And unfortunately, I think I'm still going to be looking for third party options. Oh wow. HD Rumble 2 though, real great. Yeah, I think that's what we're talking about, right? Like the details there. Um one of the games we played was Drain Drive. Yes, Dragon. So, um I think the big thing to focus on here, let's move on to mouse mode. Yeah, brand new feature we got here, right? And Dragon and Drive feed focuses specifically on the mouse mode, right? You are using two JoyCons as mice, two different mice that you're playing at uh with at the same time. And essentially, you're making the motion as if you're kind of in like this wheelchair,",
            "start": 313.44
        },
        {
            "text": "right? You are using two JoyCons as mice, two different mice that you're playing at uh with at the same time. And essentially, you're making the motion as if you're kind of in like this wheelchair, right? And you are pushing yourself forward. And with that one, I want to uh acknowledge the accuracy of it. I really liked how precise it feels as you're using it. We got to play Metroid Prime 4 as well, which we'll talk about another video. But that's another one where the mouse feels very precise. But playing drag and drive, right, you have that and it feels right as you're pushing yourself. If you push with one Joy-Con, you moved one way. If you push with the other Joy-Con, you move the other way, right? It's like you're moving one wheel at a time. Uh but yeah, the motion of doing it for me felt fun. I really enjoyed that. But then you want to talk about the HD rumble and in there as you're pushing your wheels forward, there's like these clicks that you're feeling, this feedback that",
            "start": 356.08
        },
        {
            "text": "me felt fun. I really enjoyed that. But then you want to talk about the HD rumble and in there as you're pushing your wheels forward, there's like these clicks that you're feeling, this feedback that you're feeling that I think really drives it home. You know, I'm somebody when we talk about HD rumble, I'm kind of like, \"Okay, cool. What's another feature?\" But it really does make a difference in in experiences like this where it is, oh wow, you really are conveying the feeling of pushing a wheel forward. I am a big believer in HD Rumble. I am a big believer in the Dual Sense uh and the haptics that it has and the way that it uses its vibrations and rumbles in enhancing the overall experience. And over the years, it's been cool to see kind of innovations in that space. This Joycon 2 feels substantially better than the Joy-Con 1 in terms of the rumble. And I think this game was a great example of that. Uh, but the mouse mode, uh, I'm very interested in it because it I'm it's a mixed",
            "start": 389.52
        },
        {
            "text": "substantially better than the Joy-Con 1 in terms of the rumble. And I think this game was a great example of that. Uh, but the mouse mode, uh, I'm very interested in it because it I'm it's a mixed bag for me. Um, playing dragon, uh, I'm never going to remember the name of this game. Drag and Oh, dragon. Dragon drive. It's funny cuz when you when you start off, I think you're talking about dragons and I'm like, \"No, you're talking about the dragon drive game.\" Yeah, exactly. Um, with that one, I I feel like that it's the fun gimmick, right? Um, of of going through the uh just the motion controls and playing this game in a very specific way that is only for this game. And I, you know, cool, we can talk about the actual game in a different video, but uh in terms of how the mouse used, I I'm with you. So accurate, like surprisingly accurate. It it really kind of like worked the way it was supposed to. And then playing, uh Metroid Prime, uh with the mouse mode was kind of awesome because",
            "start": 426.08
        },
        {
            "text": "with you. So accurate, like surprisingly accurate. It it really kind of like worked the way it was supposed to. And then playing, uh Metroid Prime, uh with the mouse mode was kind of awesome because I'm very curious. I want to hear more about you talking about Metroid Prime with the mouse mode cuz I also have things to say. But before we talk about it, let's get a word from our sponsors. This episode's brought to you by Lost Skies. What would you do if you woke up and the world around you was now floating high in the clouds? Lost Skies is the new openw world survival like that puts the power of exploration and choice in your hands. Use the physics-based grappling hook, glider, and your own custom airship to traverse the remains of this fractured world and uncover its mysteries. You and up to five friends will harness the power of ancient technology to survive the hostile islands that scatter the horizon and the threats that lurk in the sky itself. The battles are intense, so it's up",
            "start": 466.48
        },
        {
            "text": "to five friends will harness the power of ancient technology to survive the hostile islands that scatter the horizon and the threats that lurk in the sky itself. The battles are intense, so it's up to you to build a sky ship to shelter you in fierce storms and take the battle to gigantic monsters. Want to take a break from fighting in the skies? Use the intuitive island creator and share your builds with the community. Head over to Steam and Wishlist Lost Skies today and discover what's lurking beyond the horizon. This episode's brought to you by Monaco 2. Gather your crew, plan your heist, and let the chaos unfold in Monaco 2. Return to Monaco, a city teameming with excellent scores and gullible marks right for getting parted from their prized possessions. Go it alone or tackle heist as a team of four with online and local co-op. Just remember, even the best laid plans can blow up in your face, so you'll have to stay on your toes. Monaco 2 is the sequel to the cult classic Monaco.",
            "start": 507.44
        },
        {
            "text": "a team of four with online and local co-op. Just remember, even the best laid plans can blow up in your face, so you'll have to stay on your toes. Monaco 2 is the sequel to the cult classic Monaco. What's yours is mine that expands on every aspect of the game. New characters bring unique abilities and play styles to help you escape the heat. And with new modes and procedurally generated levels, every run is full of surprises. The heist is on when Monaco 2 arrives on Steam, Xbox, and PlayStation on April 10th. Y'all know how important it is to wishlist these games. It helps the developers so much. So, please wishlist Lost Skies and Monaco 2. This episode is brought to you by Rocket Money. You sign up for something, forget about it after the trial period ends, and then you're charged month after month after month. The subscriptions are there, but you're not using them. In fact, 85% of people have at least one paid subscription going unused each month. Thanks to Rocket Money, you can see",
            "start": 553.36
        },
        {
            "text": "month after month. The subscriptions are there, but you're not using them. In fact, 85% of people have at least one paid subscription going unused each month. Thanks to Rocket Money, you can see all of your subscriptions in one place and cancel the ones you're not using anymore and save more money. Rocket Money has helped multiple members of Kind of Funny learn that they're still paying for things they totally didn't even realize. You know who I'm talking about. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year when using all the apps premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunn today. That's rocketmoney.com/kindaffoney. All right, so",
            "start": 602.32
        },
        {
            "text": "premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunn today. That's rocketmoney.com/kindaffoney. All right, so continuing with the mouse conversation because uh very different implementation between drag and drive and Metroid Prime 4. Metroid Prime 4 is uh very seamless where it's it works the way you'd think where your left hand is now your analog and then now your right hand you're aiming with the cursor or with the mouse and we're playing in 120 frames per second and god that felt good and it was a very PC-ike experience like moving the mouse around it it was awesome. Uh there was a boss fight we did in in Metroid Prime and I I kind of tried to default to using the um or I tried to use the mouse mode majority for that and over time I found myself defaulting to using the mouse mode for boss fight which is kind of cool. Um very impressed with the accuracy of it. Very impressed with how seamless it",
            "start": 647.84
        },
        {
            "text": "majority for that and over time I found myself defaulting to using the mouse mode for boss fight which is kind of cool. Um very impressed with the accuracy of it. Very impressed with how seamless it is. Impressed with the fact that it's not a thing you need to just go turn on. You just turn the Joy-Con and is there back and forth between using the analog and then using the mouse. Yeah. As I was doing as I was playing Metro Prime 4, I looked at the person I was demoing with and I was like, \"All right, like if I wanted to play just Joy-Cons, is there like a setting I go to?\" And he was like, \"No, just lift it up and start playing.\" And I did. I was like, \"Wow, that's a really cool transition.\" Really cool. Having said that, totally broke my brain. Broke my brain as well. And I I could not get used to switching back and forth. You have to stick to one and just know it. Uh because I was like in mouse mode still trying to use the analog. Yes, that's the problem. Well, not the problem, but",
            "start": 694.56
        },
        {
            "text": "used to switching back and forth. You have to stick to one and just know it. Uh because I was like in mouse mode still trying to use the analog. Yes, that's the problem. Well, not the problem, but I guess the thing that you are going to have to adjust to is that you are still using buttons on the Joy-Con, at least for Metroid Prime 4 as you're playing it in mouse mode. And so, you are pressing certain buttons to jump, you're pressing certain buttons to lock on, do whatever while you're in mouse mode. So, you almost think about it as if you're on PC playing a mouse and keyboard, like if you have side buttons on your mouse essentially. And I'm not used to playing that way. And so, like that took some getting used to. And then I was like, let me try Joy-Con. And then it has like a does it have like a slightly different control scheme when you're just holding it up cuz it felt like it. I think it's just tricking us. That's the thing. You should get so used to it. I think the button",
            "start": 730.48
        },
        {
            "text": "it have like a slightly different control scheme when you're just holding it up cuz it felt like it. I think it's just tricking us. That's the thing. You should get so used to it. I think the button placement was the same, but it was weird when it was in mouse mode. Now, here's the thing. Like, I'm kind of all over the place with the mouse stuff because it's very accurate. It works really well. It worked great in Metroid Prime and I think it worked very well in a gimmicky way in uh Dragon Drive and like, hey, gameplay surrounding that. That's awesome. But it sucked using it as a mouse. Give me a mouse. I want a mouse. This feels like you're using something that's not supposed to be a mouse as a mouse. It is a Joy-Con turned sideways. Grab a Joy-Con from the Nintendo Switch One, put it on its side, and try to just move it around and like what you're clicking with. They're not a left click, right click. It's like it just feels like it's trying to to use something for something that we",
            "start": 763.76
        },
        {
            "text": "its side, and try to just move it around and like what you're clicking with. They're not a left click, right click. It's like it just feels like it's trying to to use something for something that we are all intimately familiar with how it's supposed to feel uh specifically in gaming. So, do you agree with that? I agree in the sense that it doesn't feel as good as an actual mouse, right? like using the Joy-Con makes me want to just plug in an actual mouse to my like dock and just play that way. I will say it reminds me a little bit of how it felt when I first picked up a Switch One and I started playing with the Joy-Cons and I was like, \"Oh, I don't know if this feels as good as a a Dual Shock, right, or Xbox controller.\" And then my mind gets used to it and then it just becomes second nature of like, \"Okay, no, the JoyCons feel fine.\" I could see myself getting to that point with the Joy-Cons as a mouse where I'm like, \"All right, no, but it feels fine.\" Like, now that I'm used to",
            "start": 801.2
        },
        {
            "text": "nature of like, \"Okay, no, the JoyCons feel fine.\" I could see myself getting to that point with the Joy-Cons as a mouse where I'm like, \"All right, no, but it feels fine.\" Like, now that I'm used to doing it, but you're right, like off this first impression, it does feel odd. It does feel like it's not made to do this even though like they were able to make it so that it could do this. You know what I mean? Exactly. And I I do expect we might get like a specific mouse uh accessory and and if this is successful and they commit to this bit uh which I kind of feel like they're going to like this it feels well implemented. It just doesn't feel perfect uh in terms of feel to me. And I don't think I'm gonna be alone on that, right? that be interested in the precision of a mouse want to kind of work, you know? Now, in talking about hardware, I think one of the things to shout out and talk about would be uh how certain games ran fidelity wise, right? I got to get my We got our hands on so",
            "start": 839.04
        },
        {
            "text": "of work, you know? Now, in talking about hardware, I think one of the things to shout out and talk about would be uh how certain games ran fidelity wise, right? I got to get my We got our hands on so many games, right? But one of the third party ones I was so fascinated about was Cyberpunk 2077, and I hopped into that. Well, first off, I watched other people play it from a distance, and I was very impressed by just seeing how that game looks on screen. Like, it looks like Cyberpunk 2077, and that is a game that has just a lot of things going on visually when you want to talk about design and like, you know, it's in an open world, but like there's so much going on stylistically in that game. Getting my hands on it, I think the biggest compliment I can uh give it coming out of that demo is that it is perfectly recommendable. Like that is a I would play Cyberpunk 2077 this way, right? And like that's to say that it doesn't look as great as it would on PlayStation 5. Doesn't look as great",
            "start": 883.0
        },
        {
            "text": "it is perfectly recommendable. Like that is a I would play Cyberpunk 2077 this way, right? And like that's to say that it doesn't look as great as it would on PlayStation 5. Doesn't look as great as it would as it would on a high-end PC. But like when I think about when I play third party games on the Switch sometimes, right, is that thing of no, this does not look good. Like I'm not going to play this way. I'm not doing this. Right? I think the trade-off of having this version of Cyberpunk portable and handheld, right? It looks like it would I imagine on a Steam Deck, but you're not paying for a Steam Deck and a high-end PC to be able to, you know, get that full experience, right? Like you have the portable experience and the on-screen experience through the Switch 2 and it looks good enough, right? I think the one the the dings I would give it would be that uh the frame rate isn't there, right? Like it is running at pro just eyeing it, not knowing for sure. I would say like 30",
            "start": 924.24
        },
        {
            "text": "enough, right? I think the one the the dings I would give it would be that uh the frame rate isn't there, right? Like it is running at pro just eyeing it, not knowing for sure. I would say like 30 frames per second, right? It's not the smoothest. Um but when I'm standing still and I'm just looking around, I'm like, \"Oh, stuff looks this game looks great.\" And that's the thing is I I feel like we saw so many games with different variations of focusing on frame rate or focusing on resolution. And I was overall very impressed with most of them. Some I was just like, \"Oh, I I want to see this in the other mode. I want to see this like like in a in a different way than they were showing it.\" Um, but I do think that uh specifically Metroid Prime in 120 FPS with in 1080 I was like pretty blown away by and I we didn't get to see the 4K version. I'm excited for that. But the same 4K 60 I very happy with that. Tears of Kingdom, Breath of Or I guess just tears. Tears of the Kingdom. We saw",
            "start": 960.88
        },
        {
            "text": "away by and I we didn't get to see the 4K version. I'm excited for that. But the same 4K 60 I very happy with that. Tears of Kingdom, Breath of Or I guess just tears. Tears of the Kingdom. We saw looked great, right? Um I think Roger was telling us that Yakuza wasn't necessarily up to par. Yeah, I uh I was very excited to try out Yakuza Director's Edition. I think Yeah, Yakuza Zero Director's Cut. Uh it did not uh look good. Uh the the uh person that was there was talking up like, \"Man, this might be the best way to play this game. It looks gorgeous.\" And it looks worse than the Steam Deck version of it. Uh like running around the world. uh the pol the polygon it just looked very like low quality like maybe like a 1080p 720p like upscaled like type deal like you felt the upscaling while you're running around the town. Uh and that just kind of sucks cuz that's an old game. That's a game that I expect to run really well. We have Kwami 1 which is in the same engine uh already on Switch",
            "start": 999.44
        },
        {
            "text": "you're running around the town. Uh and that just kind of sucks cuz that's an old game. That's a game that I expect to run really well. We have Kwami 1 which is in the same engine uh already on Switch and it looks pretty good. Uh so yeah, that was that was just a random one. It was like oh why is this even here? You know what I mean? Like if you're showing off like the the power of the Switch like this shouldn't be here necessarily. And I think Metroid Prime 4 is an example of like if you make a game for the Switch 2, that shit's gonna shine because that game looked fantastic on the Switch 2. But yeah, for Switch One, which Yeah, that's actually a good point. Yeah, but then you're like, you know, you're up as opposed to like, you know, trying to take Yakuza Zero and like, you know, form fit into this. Um, but yeah, like I was very impressed overall, I think, by the third party. That's the thing is, you know, what Roger's saying, I I feel um is very true. Having said that, I I think",
            "start": 1041.36
        },
        {
            "text": "fit into this. Um, but yeah, like I was very impressed overall, I think, by the third party. That's the thing is, you know, what Roger's saying, I I feel um is very true. Having said that, I I think that this is the closest we've been to uh the Switch to sorry to a Nintendo console being a a viable option as your sole console. early to say that, but I do think that uh for people that can't own multiple things and want the portability and want just want a plethora of third party games and big exclusives like this reminds me of kind of the best of every world we've had of Nintendo from Gamecube to the Wii to the Wii U to Switch on together between first party support, third party support and all of that. And I'm saying that from a like hardware perspective, right? Like um it just seems like it really works. There's more hardware stuff I want to get to. Um, like the Pro Controller. Oh, we haven't talked about the Pro Controller. Yeah. I I like how it feels. It feels like slightly",
            "start": 1078.64
        },
        {
            "text": "like it really works. There's more hardware stuff I want to get to. Um, like the Pro Controller. Oh, we haven't talked about the Pro Controller. Yeah. I I like how it feels. It feels like slightly different from the OG Pro Controller we have with the Switch One. There's like a sleeker material on the back. It has like a satin feel to it. The whole thing smooth. Yeah, I like holding it. Different colors on the the top. The the back buttons uh being embedded in it, I think, is great. They feel so good. I love how the back buttons are the back paddles, right? Like they're just a part of like the hand, I guess, like kind of on the handle on the controller. get in the way. Don't get in the way. And also feel my big complaint with back paddles usually is almost like I got to kind of reconfigure how I'm used to holding a controller. Not with this one. Like it's right there, right? I maybe you accidentally pressed it a couple times, but I think once my brain figured it out, I was like, \"Okay,",
            "start": 1123.84
        },
        {
            "text": "how I'm used to holding a controller. Not with this one. Like it's right there, right? I maybe you accidentally pressed it a couple times, but I think once my brain figured it out, I was like, \"Okay, cool. This works perfectly. I can't wait to actually like program this and have on my own.\" Um, we played with the camera a little bit. Yeah. What were your thoughts with that? I think it was an unfortunate environment because the lighting was just all over the There was a giant red light shining down on us that was definitely messing with the the camera like reading us and also Roger was filming us play and like it was kind of catching him all over the place. It was kind of chaotic, but I was kind of into it for what it was. I was into the concept cuz we did this the Mario Party Jamberee uh mode with Bowser, right? Where it is like you're playing these on camera games and it's based on your movement in real life. Um, I think the ideas are fun, but yeah, like it's the thing with video",
            "start": 1160.8
        },
        {
            "text": "uh mode with Bowser, right? Where it is like you're playing these on camera games and it's based on your movement in real life. Um, I think the ideas are fun, but yeah, like it's the thing with video game console like camera iterations going back all the way to the eye toy of like, all right, is this going to work with the lighting? Like, what is going to be the thing that throws this off? And more than that, it's like, let me just say this. I'm not buying this thing. You know what I mean? It's like, I have no idea in actually getting this camera. But like, uh, I was very impressed with how wide the angle was and how good it was at capturing people, finding faces, and, you know, grabbing us. Um, but yeah, it was not opportune uh situation. But having said that, I was kind of surprised with how well it worked. I just don't think that uh many core gamers necessarily are going to be like running out to buy this, but I think for all the game chat integration and stuff they're talking",
            "start": 1197.68
        },
        {
            "text": "with how well it worked. I just don't think that uh many core gamers necessarily are going to be like running out to buy this, but I think for all the game chat integration and stuff they're talking about, like that's going to serve an audience and I think there's going to be a lot of people that get really into that stuff, like I think this was a wise call for Nintendo to do. Um, having that extra USB slot on the top, never would have expected it would be for a camera that Nintendo is selling, but yeah. Yeah. I mean, we should probably talk price, right? 450. Not shocked by that price. Higher than I expected, but still in the realm of where I thought we we might end up. Yeah. Yeah. I mean, same. Honestly, I kept going back and forth between is it going to come out at $400? Is it going to come out at $500? I think 450 kind of hits where I did expect and based on the features we got, right? Like I when I go through the list, I think I, you know, I'm with you of like, man, I wish it was",
            "start": 1236.96
        },
        {
            "text": "come out at $500? I think 450 kind of hits where I did expect and based on the features we got, right? Like I when I go through the list, I think I, you know, I'm with you of like, man, I wish it was OLED, but I also didn't really expect the OLED at the same time. So, when I go through and we got way better storage than we did in the previous one, we got games, we got Cyber Punk running pretty well on this thing, right? Like overall as a hardware package, I'm not mad at the price considering where we're at right now with handhelds. Getting my hands on it, seeing the screen, seeing all that. Like, I look at this and I'm like, that price seems reasonable like that. I I understand where the money's going and all of that. Um, the software side of things, that's a different conversation. That's a different conversation. That's not what this video is. We're talking about hardware here. Quick shout out. want to give amiibo support still. That was something that I feel like a lot of the leaks",
            "start": 1275.04
        },
        {
            "text": "a different conversation. That's not what this video is. We're talking about hardware here. Quick shout out. want to give amiibo support still. That was something that I feel like a lot of the leaks and rumors were like, \"Oh, we're probably ditching that.\" But new amiibo are coming out, so that'll still be supported. Uh, we saw the box art of a lot of the stuff. I hate it. I'm just going to say it. I hate how much of the top of it is taken up by the the red logo stuff. It's like I know they want to differentiate, but not my fave. Yeah. Not my I don't think I I got to see see any of that. I've just seen the logo on the Mariners jerseys. People are happy about those, but it's just real big. Yeah, I don't like that. Yeah, you know. Oh, yeah. Dumb Tim nick, but I got to do it. Um, any final hardware thoughts? Oh, the magnets. We didn't talk about the magnets. Oh, yeah. We didn't talk about God. We have to talk about the magnets. That's the most important thing. We almost missed out on",
            "start": 1311.52
        },
        {
            "text": "hardware thoughts? Oh, the magnets. We didn't talk about the magnets. Oh, yeah. We didn't talk about God. We have to talk about the magnets. That's the most important thing. We almost missed out on that, dude. Um, so incredibly impressed with how much they stick. I One of my least favorite things about the Switch is how loose the JoyCons feel on it. 100%. And uh that's true whether it's my Ultra Cons or when I buy brand new ones and put them on within 2 days they feel loose. These aren't loose, man. You know what? When I say pre when I said premium at the top of this, I think that was specifically the thing that really stuck out the most in terms of that feel, right? Like it felt sturdy. And I'm so used to my my Switch One not feeling sturdy in the way that you're talking about. And when you clap on the uh Joy-Con, the Joy-Con 2 onto the Switch 2, right? Like it claps on there. You don't even press a button to clap it on, right? The magnets automatically connect it and then you press",
            "start": 1348.4
        },
        {
            "text": "you clap on the uh Joy-Con, the Joy-Con 2 onto the Switch 2, right? Like it claps on there. You don't even press a button to clap it on, right? The magnets automatically connect it and then you press the magnet to kind of like plop it off. I think the one thing in terms of feel is that it does feel like a plop. Yeah. Yeah. When you take it off, which is fine. Like I'm not mad at it. Like do what you got to do. It's a little limp. It's a little limp. It's like it's one of those things where it's like, \"Oh, I have some gusto when I'm taking this thing off.\" But it's fine. Yeah. That is It's so funny cuz that is the dumbest complaint of all time. But you're what I'm saying. You're so right, man. Yeah. But uh otherwise, like it feels so sturdy. Like surprisingly sturdy. Um, so I I love that. I think it's great implementation. I'm excited to see where it goes in the future. But, um, yeah, man. I think also I guess just talking about hardware, uh, there was no new JoyCons, right? Whether",
            "start": 1386.64
        },
        {
            "text": "I think it's great implementation. I'm excited to see where it goes in the future. But, um, yeah, man. I think also I guess just talking about hardware, uh, there was no new JoyCons, right? Whether uh, shown or anything that we got to look at colors wise. It was just those two. So, we'll see what else is out there. Um, we got to see the case. Oh my god. Sorry. I know I'm going a little long on this cuz we have a bunch of these to do. I got to talk about the GameCube controller. Oh, talk about it. just just a little cuz we're going to talk more uh in in a GameCube uh Games Cast, but um I got to play extensively with it. I can't believe after all these years, we're finally going to get a real Nintendo Gamecube controller that is wireless with rumble. Uh we had the Wave Bird back in the day. We've had many iterations of different Smash controllers or whatever, but they were always wired. Um I'm just really happy about this. It felt great. It has um additional buttons that are are great",
            "start": 1423.76
        },
        {
            "text": "We've had many iterations of different Smash controllers or whatever, but they were always wired. Um I'm just really happy about this. It felt great. It has um additional buttons that are are great and all the switch stuff. So, the home button, the new C button for the chat thing, but also it finally has an L1 button, uh, which has been lacking from the controllers. Yeah. So, you can use it as just a pro controller. That broke my brain. Like, there was a point where I was like, \"Oh, how do I get, you know, hop out to game selection or whatever?\" And they're like, \"Oh, press the L.\" I looked I was like, \"That's that's not right. That doesn't exist.\" Yeah. Gaming controller still feels light as ever. It still has the the triggers just still feel have that nice little like springy bounce to them. big fan. Can't wait for more. Um, but stay tuned because we're going to be doing a whole bunch more um previews of stuff. We're going to talk Metroid Prime 4 Beyond. We're going to talk Mario",
            "start": 1463.36
        },
        {
            "text": "them. big fan. Can't wait for more. Um, but stay tuned because we're going to be doing a whole bunch more um previews of stuff. We're going to talk Metroid Prime 4 Beyond. We're going to talk Mario Kart World. Um, we're going to talk um about a whole bunch of Oh my god. Donkey Kong. Uh, banana. What's it called? Bonanza. Bonanza. The banana. You know what I mean? It's not bonanza with a Oh, it's banana with an a, baby. All right. Anyway, stay tuned. We're going to have to do a whole bunch more of these. It's going to be great. Follow on YouTube, listen on podcast, do all the great things. I love you all. Goodbye.",
            "start": 1502.4
        }
    ]
}