{
    "id": 13919,
    "video_id": "MAgRnTDLNs8",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "The Upcoming Games You NEED to Know About - Kinda Funny Gamescast",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page -  https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nTime Stamps:\n00:00:00 - Start\n00:04:27 - Housekeeping\n00:09:04 - Andy’s Steam Wishlist\n00:11:54 - Void/Breaker\n00:23:49 - The Hollow Knight-Like Section\n00:28:51 - Morbid Metal\n00:39:42 - Important Updates\n00:42:03 - SuperChats\n00:44:09 - Towerborne\n00:48:24 - ABYSS x ZERO\n00:53:18 - Neverway\n00:55:38 - Jump Ship\n00:59:04 - Lost Skies\n01:04:01 - SuperChats\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744832580,
    "duration": 4298,
    "transcript_chunks": [
        {
            "text": "[Music] Andy, what's wrong with me? Cuz I look over in the chat, I see Pages Inc. say, \"Ah, that's hype. If I say too much about my job on here, I docked myself.\" And that immediately makes me want to stop this show and find out everything I can about Pages Inc. cuz first off, it's Pages spelled P A I G E S. Their name is likely pink. So their name is Paige. Inked. Are they Are they a comic book inker? Yeah. You know what I mean? Is that what they're doing? Is that what we're writer? Oh, I was thinking like uh Inc. is a tattoo artist. Also possible. Yeah. Yeah. Yeah. That's that's that would be it too. I I went to pages in I feel like it's like a hobby. They like journaling. So you think it's you think it's the written word is what they're inking. They literally inking pages. Yeah. But you have people who I mean like we all saw Dogma. You're a tracer. Like you you know I mean like people who ink comic books. That's what I would go with. No, I work for the government pages inc. Oh,",
            "start": 5.95
        },
        {
            "text": "you have people who I mean like we all saw Dogma. You're a tracer. Like you you know I mean like people who ink comic books. That's what I would go with. No, I work for the government pages inc. Oh, damn. Isn't that a chasing the constitution? Those are the pages. You know what it is? Thank you. I got dogma on the brain. They're doing a live event here. I keep forgetting to put into When is that? Uh May 21st, I think. I'm down for that. Let me know when we start the show. What's up, everybody? Welcome to the Kind of Money Games cast. I'm one of your hosts, Greg Miller, alongside Forbes 30 under 30, aka New York Game Awards nominated, aka Fighting Game Poppy. It's blessing out of YoYay Junior. Can you believe they gave me Forbes 30 to30? I can't. What did I do? I sat here talking about video games. Well, I mean, you know, I think everybody in the video game category that's not making video games like, \"All right, what are you doing?\" There's talking. That's what I think about us every",
            "start": 50.4
        },
        {
            "text": "games. Well, I mean, you know, I think everybody in the video game category that's not making video games like, \"All right, what are you doing?\" There's talking. That's what I think about us every day. Yeah. These people are watching this. We're talking. You know what I mean? We're just talking. We're just about things. Huh? We're listening. You know, they're listening. We're We fill up their day with I know. I'm aware of the relationship. I know. Comedy and hope. Hope despair. Those are the two comedy and hope. That's it. That's all we got for you up there. Of course, that is the Hispanic Arthrop Texas street Latino Heat. Clicking heads and ripping them to shreds. The globe trotting head shot and root and toot and three-point shooting nitro rifle from Twitch.tv. Andy Cortez. Wrist is feeling better. Is it nice? No. Like it's still [ __ ] up. Yeah. Ain't that what happened to your thing? I wore it at night. Uh, keep your arm regulated. Too many people make fun of you and said you look",
            "start": 93.4
        },
        {
            "text": "better. Is it nice? No. Like it's still [ __ ] up. Yeah. Ain't that what happened to your thing? I wore it at night. Uh, keep your arm regulated. Too many people make fun of you and said you look like you were jerking off. Um, no. That's what I've been saying. I just realized that's why I've been saying it in gym when I get home. I realized I didn't need it during the day. Like I need it for the hours that I'm unaware of what my wrist is doing. I don't want to like get caught sleeping in a weird angle and wake, you know, sometimes you wake up and your arms asleep. You're just like, \"Oh god, man. That's like really [ __ ] up for a while.\" I think, you know, I feel that. Got to kind of protect myself. Can I use it during the day since you're not using it during the day? Wait, what? Can I use it during the day while you're wrist? Yeah. You want to use your wrist? I'm sorry. That was a good one though. That's a good joke. Barrett's like, \"I'll volunteer to keep see what's what your wrist",
            "start": 130.48
        },
        {
            "text": "it during the day while you're wrist? Yeah. You want to use your wrist? I'm sorry. That was a good one though. That's a good joke. Barrett's like, \"I'll volunteer to keep see what's what your wrist is doing at night.\" Unaccounted for wrist time for wrist hours. I wake up 7 and 1 half hours of footage. How's everybody doing? You having a good day? Doing great. Yeah, doing great now. Great episode of kind of funny games daily out there. Bless. Always always a pleasure to listen to you and Mike out there doing it. Me and Mike love to yap. Yeah. Yeah, you do. Andy, you've been running around. I haven't seen you at your desk. I know you've been up to stuff prepping the stream. Yeah, GTFO today. Really exciting. I finally, you know, it's it's kind of a the the timing is kind of odd cuz you may think, oh, there's been a lot of sponsored streams. This is probably sponsored as well. This is not sponsored. This is just me being super stoked about the upcoming Den of Wolves and always wanting",
            "start": 169.6
        },
        {
            "text": "think, oh, there's been a lot of sponsored streams. This is probably sponsored as well. This is not sponsored. This is just me being super stoked about the upcoming Den of Wolves and always wanting for the last year or two wanting Greg to play GTFO with us cuz I think he would dig the chaos and the horror aspect and it's just one of those cool kind of co-op games. Um, and yeah, it was awesome for them to want to be like, \"Hey, let's we want to play with y'all.\" Yeah. If you've missed this, when we did the preview of Den of Wolves last week, two weeks ago, uh, and two weeks ago, I guess, since I wasn't here last GDC. Yeah. Yeah. Uh, the devs were in the chat and they were so stoked to hear Andy talking about it and then talking about GTFO. They were very gung-ho on playing with us, so we actually made that happen. Not a sponsored thing at all. Just a little organic moment from the Games Cast now to the stream today. But I digress. We're not here to talk about that. We're here to talk",
            "start": 209.6
        },
        {
            "text": "actually made that happen. Not a sponsored thing at all. Just a little organic moment from the Games Cast now to the stream today. But I digress. We're not here to talk about that. We're here to talk about the biggest topics in video games. Whether they be reviews, previews, or things we need to talk about. That's what we do here on the Kind of funny games. Each and every weekday, we run you through those topics and have a great time doing it. If you like that, well, we'd like you to pick up a Kind of funny membership. Remember, with your Kind of funny membership, you can get all of our shows. That's more than 80 a month adree. And of course, you'd get your daily dose of me, Greg Miller, in a series I call Greg Way. It's 15 to 20 minutes of content, meaning you get an hour-long podcast from me each and every week. All for supporting an 11 person small business trying to entertain you. We bring you comedy and hope. Was that it? It sounds like despair and despair. Despair in",
            "start": 250.16
        },
        {
            "text": "podcast from me each and every week. All for supporting an 11 person small business trying to entertain you. We bring you comedy and hope. Was that it? It sounds like despair and despair. Despair in parenthesis. There's a healthy healthy dose of despair around here. Of course, if you have no bucks to toss our way on patreon.com/kindfunny, youtube.com/kindfunnyames, Apple or Spotify and get your membership. No big deal. You can watch us record the show live for free on youtube.com/kindfunname twitch.tv/kindofunnygames. And of course, Andy, if you have Amazon Prime, you have Twitch Prime. Don't forget to subscribe each and every 30 days. They don't remind you about it, they take it away from you. Uh, give some subs, too. Have some fun. And why not? Uh, today we're talking about a whole bunch of different games. Our w we we kicked it off with my wish list a few weeks ago of Steam games that I had forgotten about. We all like that so much we want to go through Andy's wish list of games.",
            "start": 285.12
        },
        {
            "text": "of different games. Our w we we kicked it off with my wish list a few weeks ago of Steam games that I had forgotten about. We all like that so much we want to go through Andy's wish list of games. Of course, I want you to shout out games you haven't uh heard us talk about, things that are on your wish list. You can do that on youtube.comkindfunnames as a super chat to be part of the show as we go. One of those kind of random topics that we weren't really show we weren't really sure where to take it and it just kind of became Greg's wish list thing. Yeah. And then afterwards those is like I feel like I got the most feedback on that Games cast out of all the other ones when we whenever we do reviews or previews. Obviously, you get, you know, feedback from there saying like, \"Hey, great episode today or whatever.\" But that one, I feel like the most amount of people reach out to me saying that [ __ ] was cool. I want more of that from you all. Just getting awesome recommendations for",
            "start": 326.08
        },
        {
            "text": "episode today or whatever.\" But that one, I feel like the most amount of people reach out to me saying that [ __ ] was cool. I want more of that from you all. Just getting awesome recommendations for stuff that people haven't heard about. You're welcome. Yeah, I did it. You did a great job. How was the pace? You know, the what now? Core. It's one of the You say it like Are we going to get away? No, we're going to we're going to tear me apart about it. Remember, somehow we talk all day long. Uh, live talk shows is what this 11 person small business does. You already got kind of funny games daily, which was of course your Mario Kart World predictions. Uh, they went way longer than they expected to, which I appreciate it. There's good conversations. Remember, there is a Mario Kart Direct or Mario Kart World Nintendo Direct. Yeah, thank you very much. Tomorrow, we'll be live reacting to it on a delay. So, we're not watching it at all. 10 a.m. we'll watch it live. Do the games cast",
            "start": 368.16
        },
        {
            "text": "or Mario Kart World Nintendo Direct. Yeah, thank you very much. Tomorrow, we'll be live reacting to it on a delay. So, we're not watching it at all. 10 a.m. we'll watch it live. Do the games cast reaction onto your programming day. Uh after this you are getting your final Daredevil Disney Plus season 1 spoiler cast. I'm very excited to talk about this. Go through. I heard you almost watched it. Yeah, I started cuz I I I have my Daredevil like podcast I like to listen to that break down episodes. I really thought you were about to say I have my Daredevil podcast. Wait, what? I record. Yeah, I talk to my homie. Uh as you know as you listen Yeah, you're a listener, right? Um, but yeah, no, I I like started it last night and I was like, h, it's 11:00. I'm tired and also like I'm talking a lot tomorrow, so I want to get good sleep. Uh, and so I decided not to. But like right when I get home, I'm going to put it on while I clean my house. I got lots to say. I'm looking forward to that.",
            "start": 407.68
        },
        {
            "text": "lot tomorrow, so I want to get good sleep. Uh, and so I decided not to. But like right when I get home, I'm going to put it on while I clean my house. I got lots to say. I'm looking forward to that. It'll happen right after this. So responsible of you cuz I just I just get in bed. I'm like, I just couple runs of Blueprints. Like what's the Oh, dude. Blueprints has been throwing me off. Like my my thing now is that I had to play Blueprints in the background or doing something else. And so like literally I took my steam deck while while I took my car to the car wash and I dropped my car. There's not that much time. It was like a detail. Like it was like a detail. I'm like laying on the horn behind him like take it out of neutral. Go like an hour into a run and I'm like the lights blinking green and you're like where I'm bad cars all dry. Uh after uh that spoiler cast for Daredevil Born Again, we will be playing GTFO with the devs and we're very excited about that. If you're a kind of",
            "start": 452.96
        },
        {
            "text": "green and you're like where I'm bad cars all dry. Uh after uh that spoiler cast for Daredevil Born Again, we will be playing GTFO with the devs and we're very excited about that. If you're a kind of funny member, today's Greg Way is 15 minutes of me talking about Stars in the Bank and if the drama is real or not. I've been shocked by how many people want to know the inside kayf baseball on Stars in the Bank and I I answer it all today. I air it all out for you. Uh thank you to our Patreon producers Anatoli asked, Delaney Twining, Carl Jacobs, and Omega Buster. Today we're brought to you by Imperial Factor and Shady Rays, but we'll tell you about that later. For now, let's begin the show with what is and forever will be topic of the show. Andy Cortez, Andreas Cortez, see, as you said, I changed the game when I came out and showed my wish list. You did so much to change the DNA of this very company on this day. standard daily Greg and Abraham Lincoln. I want they did so much for the",
            "start": 491.6
        },
        {
            "text": "changed the game when I came out and showed my wish list. You did so much to change the DNA of this very company on this day. standard daily Greg and Abraham Lincoln. I want they did so much for the country. I want to know what is on your Steam wish list. I want to know how you treat your Steam wish list. What are you adding it during, you know, the showcases, the presentations later? Are you doing it off of Steam NextFest? You are a connoisseur of games. You play a wide variety of things and you play so much based on streaming so much that I'd love to know how you handle this and what you what has caught your eye and what you've put out there. Um, so I I've been a lot better about it lately in the same way that I use that website backlogged. They don't have an Android app. I know it sucks, right? We got to get an Android up on that. Um, but I've been I've been getting better about sort of tracking what I play throughout the year. Yeah. That way when we get to go discussions, I don't",
            "start": 545.56
        },
        {
            "text": "right? We got to get an Android up on that. Um, but I've been I've been getting better about sort of tracking what I play throughout the year. Yeah. That way when we get to go discussions, I don't have to just look through my Steam play log or whatever. I like I like having a list of things that I'm kind of making my way through. Um, but the way that I have been I've been getting better about wishlisting things. I think just the way us as a company have kind of drilled it into people's heads. It's also just been naturally and habitually drilled into my head of you see something cool, wish list that [ __ ] not only for your own edification, but to help out the developers and it helps out a lot uh for their trending lists and all that for Imperial today, right? like the ads that go, we are very big on calling out the wish list because of course that's something we're taking from the GDC streams and conversations with independent developers here to actually working with them. Yeah. And",
            "start": 592.4
        },
        {
            "text": "very big on calling out the wish list because of course that's something we're taking from the GDC streams and conversations with independent developers here to actually working with them. Yeah. And being a GDC was a great thing as well cuz busting out the Steam app when somebody's busy playing a game at I don't know the Mix or something, right? If somebody's playing a game at the Mix and I know I won't really have a chance to play it, I I'll just bust out my Steam app on my phone, type in the game, hit wish list, and bam. Like I just add it, right? It's becomes a lot e uh pretty easy right there. But I would say also just a lot of showcases. I think I've I think maybe a year ago when we had another one of these showcases that were always you know sometimes you get that sort of mentality of ah this could have been an email bug and just put but I've totally turned my my way of thinking on that because I don't remember things. I have the worst memory of all time. And so for me, even if",
            "start": 630.72
        },
        {
            "text": "of ah this could have been an email bug and just put but I've totally turned my my way of thinking on that because I don't remember things. I have the worst memory of all time. And so for me, even if these this could have been an email showcases, those are still super helpful to me to get my eyes on something and going I'm such I'm such a visual person that I go, \"Oh, I remember this game. We saw this or whatever.\" And all of those smaller showcase really put me on to a lot of games. And so I was playing a game, which is going to be the first one that I'm going to talk about, uh, called Void Breaker. Void Breaker was on the Triple I initiative showcase and I had somebody in my chat as I was playing this go, \"Man, Andy, you turned me on to The Witcher. How do you always like hear about these weird games?\" The Witcher uh or not The Witcher, sorry. Sorry. I had never heard about Cyberpunk 2077 about GTA or Call of Duty. Andy, man, I saw Greg's face and I was like, \"What the hell was",
            "start": 672.64
        },
        {
            "text": "these weird games?\" The Witcher uh or not The Witcher, sorry. Sorry. I had never heard about Cyberpunk 2077 about GTA or Call of Duty. Andy, man, I saw Greg's face and I was like, \"What the hell was this?\" Uh this guy, he was like, I you put me on a witchfire and I had never heard of that. How are you, what is And I was like, it's just showcases. It's part of our job. Naturally, we're going to be more into these newer, unheard of titles. That just kind of comes with the with what we do every day. But Void Breaker far and away is my most anticipated. I'm assuming this year early access. I don't fully know all of the details on it, but Void Breaker, this looks awesome. Void Breaker was on the triple eye initiative thing and of course it looked awesome and there was a lot of other stuff that looked awesome. I played that other game that I was really um stoked about uh Metal Eden which is uh the game by the Ruiner devs and Metal Eden was good but I wasn't blown away by it. I was just like",
            "start": 716.88
        },
        {
            "text": "looked awesome. I played that other game that I was really um stoked about uh Metal Eden which is uh the game by the Ruiner devs and Metal Eden was good but I wasn't blown away by it. I was just like I'm like hell yeah I'll play this whenever it comes out. Voidbreaker has I I can't really even overexaggerate with with how excited I am for this video game. Void Breaker is a rog light first-person shooter with and if you're an audio listener, I'll just describe it like this. Go watch the video. This looks rad. It's the control sort of telekinesis grab gravity function where you're grabbing things to throw and destroy enemies with. It's that ability from control. It's awesome gunplay. Um, and it is the bullet hell attack patterns of Returnal mixed with the destruction of the game called the finals. I don't know how a lot of people haven't necessarily even played the finals, but the finals has insane destruction where you can be on the top floor doing a mission and if they people can just",
            "start": 768.88
        },
        {
            "text": "I don't know how a lot of people haven't necessarily even played the finals, but the finals has insane destruction where you can be on the top floor doing a mission and if they people can just like, you know, explode the floor underneath you, which is their roof, and you will crumble down with them. It has all that destruction. But the coolest part for me about Void Breaker is it's not just you're not destroying things just because it's cool and and it looks awesome. It's how you weaken the enemies quicker. It's how the the their shields break and I think the sound design is freaking fantastic whenever you that there's such a cool feeling of seeing a horde of enemies coming to you knowing you have a gigantic platform floated above you. You toss a grenade up there and all of the debris drops real in a realistic fashion, you know, physics- wise, and you see all the the debris dropping on them and you hear all of those little sound effects letting you know that you are critting all of",
            "start": 822.4
        },
        {
            "text": "real in a realistic fashion, you know, physics- wise, and you see all the the debris dropping on them and you hear all of those little sound effects letting you know that you are critting all of these and they are stunned now. And they are going to be taken out easier with your weapon. It It's insane. It's It's unbelievable how well it plays, how good it looks, how um it's made by one dude. One other dude made one dude made all the music. one dude made all of the game. Um, I'm [ __ ] so blown away by this where after every sort of encounter I'm just like, \"God damn, dude. This is a video game right here.\" And it's a it's rog light in nature. Has sort of a uh kind of reminds me of uh like maybe ghostrunner in its narrative. There there's also some weird stuff where whenever you're in the game, uh you're in this kind of weird dome and this big monolithic AI talks to you and he's like, you know, you're here to do a task or whatever the [ __ ] And then you eventually you kind of go to",
            "start": 870.64
        },
        {
            "text": "game, uh you're in this kind of weird dome and this big monolithic AI talks to you and he's like, you know, you're here to do a task or whatever the [ __ ] And then you eventually you kind of go to your home base and then your gun kind of starts talking to you and you're like, why is my gun talking? And the gun's like, life too. Hi Life, too. Exactly. Yes. And it's like, go to go to the basement. They can't hear us there. And you're like, oh [ __ ] what's this all about? And then you find a dead body in the basement with like a little consciousness chip and it's the dude who was there prior to you who's now trying to talk to you and help you. And so it has like some narrative hooks. I'm not sure how deep it'll go but has more than I was expecting to be honest looking at it cuz the gameplay looks awesome right now. Everything you're saying and again if you're audio listener like it's like almost monochromatic but then it's got this neon green in it and this yellow in it and you're",
            "start": 920.56
        },
        {
            "text": "looks awesome right now. Everything you're saying and again if you're audio listener like it's like almost monochromatic but then it's got this neon green in it and this yellow in it and you're using this cool ass tether like this looks awesome. the the the one of the coolest parts about not only all everything that you've seen obviously it's all just so badass and it feels great and uh the enemy variety there. Not to say that there's like the most astounding amount of enemy variety, but there's a lot of enemy attack pattern variety where suddenly you'll, you know, you have that rog light sort of thing blessed where you get to the end of a platform and there's there will be if you see in the distance out there the little skull icon. Those are the signs to tell you go this way for the boss or or no, go this way for like a mini boss, go this way for whatever challenge and you'll get this little treasure box and it sort of like lets you know what's coming up ahead, right? And one of the",
            "start": 964.0
        },
        {
            "text": "or or no, go this way for like a mini boss, go this way for whatever challenge and you'll get this little treasure box and it sort of like lets you know what's coming up ahead, right? And one of the coolest things is when you get to the end of a run, you get your little treasure box or your loot crate or whatever the [ __ ] and it'll have these little node these modules that you upgrade your your [ __ ] with. I I don't know if I gave Barrett the best uh time code, but there will be a time code where UI pops up. Oh, probably here actually. So, here are the these are the upgrades, right? And typical stuff. Bless. You get like my [ __ ] right here. Three options to upgrade. Some of the ones later on will uh connect a a like a fire between projectiles. So, if I shoot like left, right, you'll see a line connecting those bullets as they go out. It's [ __ ] crazy. But right here, if you could pause right here, Barrett, this [ __ ] is what takes it to the next level because you can kind of",
            "start": 1004.0
        },
        {
            "text": "see a line connecting those bullets as they go out. It's [ __ ] crazy. But right here, if you could pause right here, Barrett, this [ __ ] is what takes it to the next level because you can kind of you can only equip these nodes or these powerups in those, right? Anything that's Xed out, you can't use, right? So, any of those white things are those boxes that you could put your power-ups in. The power-ups may be um ice ammo or anytime clip. Yeah. Yeah. All that stuff. Faster reload or the one that I had that was really neat where if things if destruction is falling down, if I blow up a wall or blow up something, it will some of the destruction will be little ice bombs that'll drop near enemies and will freeze enemies. So, there's a lot of different modifications there. But what's super sick about this uh sort of modification setup is it's not only powering up things. You can also get upgrades to go like maybe I don't need this power right now, but I will get this little node which",
            "start": 1056.72
        },
        {
            "text": "sick about this uh sort of modification setup is it's not only powering up things. You can also get upgrades to go like maybe I don't need this power right now, but I will get this little node which makes the uh so like it's hard to explain. It's super hard to explain, but you see the arrow on the bottom or no, do you see the the red arrows pointing up and down with the yellow to the right? Do you see that on the screen right there? So, that means that it cancels out. It It'll mean that those red squares, you can't put anything in there if you eventually unlock those. But if you put something to the right of it, it becomes extra overpowered. Okay. So then the one on the very very bottom middle where it's like the two red arrows left and right with the green pointing up. I'm sort of like planning out, okay, I might be able to put a power in between those to where it's not only getting powered up by the left node, it's getting powered up by the by the bottom node. And it's like extra",
            "start": 1106.08
        },
        {
            "text": "planning out, okay, I might be able to put a power in between those to where it's not only getting powered up by the left node, it's getting powered up by the by the bottom node. And it's like extra overpowering this. Mhm. and it can break the game in some crazy [ __ ] ways where I eventually had an acid rounds thing that breaks down enemies a lot faster. And I had one of those setups where, you know, you could it was two different nodes that were powering up a node. So, it was getting like quadruple powered at this point. And this final boss right here at the very very end was just getting extremely melted. And the bosses are very much like they remind me of Returnal, but the the enemy health bar going down so fast. And you see the little green ticks underneath the health bar. Those are the acid buildups, right? You can kind of multiply uh and kind of build up. I was like, \"Holy [ __ ] I can't believe I got through that boss phase so quickly.\" And then phase two begins and the damage",
            "start": 1158.0
        },
        {
            "text": "acid buildups, right? You can kind of multiply uh and kind of build up. I was like, \"Holy [ __ ] I can't believe I got through that boss phase so quickly.\" And then phase two begins and the damage is harder and the patterns are a little bit tougher. But it was just wild how quickly I was able to find a way to get extremely overpowered. And obviously this game, I think, is launching in early access. So that's what Steam page says. Yeah. Yeah. Right now they're doing the play test. Yeah. Yeah. The play test is available right now if you're on Steam. But the, you know, you got to assume a lot of these things will get ironed out numbers wise and push a couple numbers here and there. But I I I just cannot explain enough how great this game is and needs to be played by anybody who cares about control or rogue lights or first person shooters or Returnal. Like it has all of these amazing elements. Named a lot of things I like. There's not one weakness here, which is like kind of a There's",
            "start": 1205.68
        },
        {
            "text": "control or rogue lights or first person shooters or Returnal. Like it has all of these amazing elements. Named a lot of things I like. There's not one weakness here, which is like kind of a There's always a first person shooter type deal. Even with Metal Eden where I'm like, ah, this definitely didn't feel satisfying, but it looks great. Gunplay feels good, but it's lacking blah blah blah. the I cannot say enough great things about Void Breaker. You sold me on get on getting to the sooner cuz I had this um like I had the play test downloaded on my PC for the last few days cuz I also saw it at the Triple Eye Initiative. But it's the weird thing of the ordering of like I saw Metal Eden first and so like I'm kind of like, \"Oh, Metal Eden is on the brain right now.\" And then Void Breaker came through. I was like, \"Okay, another one of to like kind of put in this bucket.\" But hearing you talk about it and like talk like get into some of the specifics of how it works, I'm like, \"Oh [ __ ]",
            "start": 1248.48
        },
        {
            "text": "through. I was like, \"Okay, another one of to like kind of put in this bucket.\" But hearing you talk about it and like talk like get into some of the specifics of how it works, I'm like, \"Oh [ __ ] this sounds [ __ ] awesome.\" Yeah. I just went through and requested play test as well. Uh they have here as a recent announcement on the 11th, so almost a week ago, 19,000 play testers in 24 hours. That's awesome. Void Breaker play open play test is running right now on Steam until the 24th of April. It it it's just so satisfying. Like knowing that you're kind of in the heat of battle and going, man, I can Oh [ __ ] I if I lure all of these enemies and kind of kite them towards here, there's so much destruction to weaken all these dudes. And the sound effect and sound design, music's great, too. which is very kind of like cyber punk just so like that sort of just pumping adrenaline type [ __ ] that that it if we just did an episode only on this that would like I I could end the wish list",
            "start": 1288.48
        },
        {
            "text": "which is very kind of like cyber punk just so like that sort of just pumping adrenaline type [ __ ] that that it if we just did an episode only on this that would like I I could end the wish list right here, right? Um but Void Breaker, please go support that cuz I want this game to be awesome and to be seen by a lot of people because it blew my mind. Um, and the if you request the play test when I did it, it granted it immediately like like you're automatically and so if you want to play it, you can play it right now. Yeah, if you're on PC, this is not one of those like I hope I get in type deals. I think it's only up for another week or so. Kind of running. Okay. Kind of running 10 days. Okay, 10 days. That's that's plenty of time. But yeah, this game rocks. Uh, I cannot freaking wait for whenever the early access date is cuz you you beat the first boss and then it hits you with uh Bless. Do you remember did you ever play the Steller Blade demo back in the day? Yeah. Where when you",
            "start": 1327.6
        },
        {
            "text": "whenever the early access date is cuz you you beat the first boss and then it hits you with uh Bless. Do you remember did you ever play the Steller Blade demo back in the day? Yeah. Where when you beat that boss, they get you that sizzle reel of like here's all the stuff kind of a trailer mini trailer. You get that mini sort of sizzle reel at the end of beating this first boss. And I was just so bummed out that I was done with it. Right. That's always a sign of a great game. Yeah. Uh fun fact, too, this is being published by Playstack. Um who I would say is like kind of an underrated publisher currently. I forget if they did I'm I'm on their page. Yeah, they did do Botro. So this is the Billetro publisher. They also published uh Rise of the Golden Idol and Case of the Golden Idol and like even as I scroll through they have other abiotic factor which I've heard quite a bit about. That was a good one. Yeah. Uh Mortal Shell which came out like quite a few years ago. But like Playstack's",
            "start": 1370.8
        },
        {
            "text": "even as I scroll through they have other abiotic factor which I've heard quite a bit about. That was a good one. Yeah. Uh Mortal Shell which came out like quite a few years ago. But like Playstack's been doing the damn thing, right? Bella last year. It seems like this could be another hit for them if um you know everything comes out right. Like good for them. They have a good eye for curation. Yeah. Got Andy. Super stoked about Void Breaker. Um the next two are kind of uh along the same It's for anybody who's a fan of Hollow Night. These next two games, it's one that I talked about last year. Feel like you're enjoinging a song right now at a concert like this one. This go like turning the guitar like this one's going to go out to anybody likes Hollow Night. Uh yeah, this that and the fans know like oh [ __ ] get excited or whatever. I love Hollow Night. Uh the first game is called Croworn, which is one I've already kind of shown off and talked about, but uh game rocks. It is um also",
            "start": 1407.68
        },
        {
            "text": "know like oh [ __ ] get excited or whatever. I love Hollow Night. Uh the first game is called Croworn, which is one I've already kind of shown off and talked about, but uh game rocks. It is um also being published I think by the same people who are publishing Hollow Knight um or at least the PR people same PR are the same. Yeah. So Croworn kicks ass. It was a Kickstarter game a long time ago and they are still in development. They always put out updates with new type of uh like play tests that you can kind of hop in, new things to check out. But they're constantly working. They're constantly added. It seems like it's another silk song where it's just going to take a long time to make this game. But I love the animation style. Really great art. The b Yeah, the the art's fantastic. It looks like I mean, it just looks like Hollow Knight. But the I love the idea of you being this sort of uh Crow Eene the Crow Bloodborne looking dude with a you got a scythe and a gun and the gameplay is",
            "start": 1447.28
        },
        {
            "text": "like I mean, it just looks like Hollow Knight. But the I love the idea of you being this sort of uh Crow Eene the Crow Bloodborne looking dude with a you got a scythe and a gun and the gameplay is fantastic. The boss fight patterns were a lot of freaking fun. So, Corworn is one of those. And then Morning Star is another one of those. And this time, you're not a crow, you're a little owl. And Morning Star, I couldn't find a trailer for cuz I think it's still trying to be kickstarted. Okay. But they have a Steam page. Um, and Morning Star, very similar art style, looks freaking fantastic. Um, you're a cute little owl. And again, it's, you know, a lot of a lot of teams once Hollow Knight sort of set that standard going for that art style where it's kind of dreamy, kind of ethereal, bloomy looking, but I just love the little dude. I've loved I've love following them on Twitter because they have a lot of This is definitely one of those Twitter games that I've seen a lot and uh they post a",
            "start": 1494.4
        },
        {
            "text": "but I just love the little dude. I've loved I've love following them on Twitter because they have a lot of This is definitely one of those Twitter games that I've seen a lot and uh they post a lot of updates and little clips and I think they recently hit like 10,000 wish lists and you know, they're really stoked about the development of it. So, this game looks rad as well. Um, and there's not a whole lot to say other than that. It's just, hey, these are two seemingly kind of Metroid Vania hacken slash games that are going to challenge you boss fight-wise and are going to have probably awesome music. Like, I mean, whatever this enemy is looks sick as hell. That big ass owl. Um, I don't know. I just really really enjoy when devs can like innovate on the emulation and try to like push whatever that other team did. Can we do that better? I think that's so that's such a cool challenge whenever devs are like I want we want to do that. We know this looks like Hollow Night. We know that if",
            "start": 1544.08
        },
        {
            "text": "that other team did. Can we do that better? I think that's so that's such a cool challenge whenever devs are like I want we want to do that. We know this looks like Hollow Night. We know that if you just saw we got inspired by this and now we're putting our take on it, our twist on it. We're doing this thing to make it different. Yeah, exactly. I wrote down a note to myself game clone game for game showdown. Cone Sworn or Crowsworn Morning Star. I don't know what the game is, but there is some game here of like games that are inspired by other like by other games kind of thing. Yeah. But yeah, like what do you call it? What what was the what was the topic? Oh, game cloner Greggy. No, that's terrible. That's terrible. That's bad. You know, same or same or lame. No, I feel I don't understand the game yet, but there's something there with like remember when you were in school in English class, you had to learn about like the root words and like all right, here's the or like you know what",
            "start": 1588.88
        },
        {
            "text": "the game yet, but there's something there with like remember when you were in school in English class, you had to learn about like the root words and like all right, here's the or like you know what I mean of like origins. There's something about origins or root words or DNA or lineage. There's something going here. See the game? Here's the game. Doppel Gamer. That's Oh, [ __ ] Yeah, that's not bad. That's not bad. That's not bad cuz then like see I wonder so what are you you're going to read a title of a game and then we have to guess what I've not figured out the rules yet but now like I mean as you talk about it right of like the etmology kind of thing I think it would be almost like it's a different game as I explain it but I would have like the final product like a final game in a lineage and it is you tracking back like all right what is like the first game that I'm going to say in this lineage right so like let's say as a random example it's like Last of Us to Uncharted to I",
            "start": 1630.48
        },
        {
            "text": "lineage and it is you tracking back like all right what is like the first game that I'm going to say in this lineage right so like let's say as a random example it's like Last of Us to Uncharted to I don't know what's inspired Uncharted. Tomb Raider. Oh yeah, to Tomb Raider. Yeah, that's actually a good point. Yeah, Tomb Raider, right? Like I was going to try and make bring back Last to Banjo somehow, which I think I could, but like Oh, I'll figure it out. I'll work it. I'll work. I like it. I like it. You may need to keep talking cuz I need to sneeze. I feel sneeze. Well, you said entomology and it reminded me of men's donuts. So, you could have your chair there. My foot pushed off. Oh, yeah. Entalology where we have to eat a donut before we answer a question. Think about it. And who whoever can swallow their donut first. I'm sure nobody's going to choke on the show. I posted through I posted an Audible Barrett um in assets as well that I didn't put on the show. Wish list is coming",
            "start": 1668.08
        },
        {
            "text": "can swallow their donut first. I'm sure nobody's going to choke on the show. I posted through I posted an Audible Barrett um in assets as well that I didn't put on the show. Wish list is coming in so hot. He's building it while so hot. Uh but this is one that you all have talked about on on Games Daily. This is also on the Triple Eye Initiative. Morbid Metal published by Ubisoft. What? Really? Yeah. I had no idea until legitimately right now when I looked at I was looking for the trailer and I saw it was on Ubisoft's channel. I was like, why is it there? And then I opened up the Steam page to wish list it cuz I had forgotten to and Morbid Metal is published by Ubisoft and this was on the Triple Eye Initiative and it is another insanely cool highpaced fast action uh hacken slash sort of cyberpunk game where you are essentially a cyberpunk looking Ronin, right? You got that that cool sort of hat and you are just juggling enemies in midair. I want you to know earlier on games daily Mike",
            "start": 1709.2
        },
        {
            "text": "game where you are essentially a cyberpunk looking Ronin, right? You got that that cool sort of hat and you are just juggling enemies in midair. I want you to know earlier on games daily Mike said something and Bless is like you know what I look for in games. Describe a game I would like and everything you just said Andy of a cyberpunk ran I like that's an Andy. Absolutely. Give a dude a sword in a cyberpunk world. Put some neon lasers on there. Yeah, you're all set. What's up or what's up? No, I'm just I I can't find anything about you. Oh no, here you go. Ubisoft and screen. Ubisoft and screen. This is from like eight hours ago by the It's on their studio page. You stop on the screen. You just announced Morbid metal. Get the [ __ ] out of here. Pop up. Uh Morbid Metals early access. Calm down. It's okay. No, man. I'm tired. I couldn't stay awake. Now I got pops like YouTube page. It's weird. That's Yeah, I'm trying to figure this out cuz I went to the Steam and it didn't say",
            "start": 1756.24
        },
        {
            "text": "Calm down. It's okay. No, man. I'm tired. I couldn't stay awake. Now I got pops like YouTube page. It's weird. That's Yeah, I'm trying to figure this out cuz I went to the Steam and it didn't say published by Ubisoft on the Steam, but yeah, I'm on Ubisoft's website now and yeah, it's them announcing the Moretal early access summer launch. And on Ubisoft's YouTube page in the description says developed by Screen Juice in Unity and published by Ubisoft. Maybe this is a recent ass acquisition. I'm texting you or something. I got to figure this out. So anyway, this game it's like we're diversifying. This game has was already shown on Games Daily at one point. I think sometime probably the day after the actual triple eye initiative, but the uh yeah, I just love the way it looks visually and it has a lot of those bullet hell sort of uh makings where in the you don't really ever see the dude avoiding the bullet hell stuff like you would in in Returnal, but in that in one of those boss fights",
            "start": 1795.04
        },
        {
            "text": "has a lot of those bullet hell sort of uh makings where in the you don't really ever see the dude avoiding the bullet hell stuff like you would in in Returnal, but in that in one of those boss fights as you're this sort of Ronin character is doing a midair move that defies gravity, there's a lot of projectiles right underneath the dude right air and yeah, I just I bless I'm at this point right now where I'm just so pissed off and I talk about all the damn time. Just always mad. We're all angry here. Um where it's like we just give us another division. That's one of my things, right? Yeah, I agree. Just give me another stop funding games like this and make another division. This is cool. This is cool. Julian, stop making Star Wars games and make another division. All right, now we're cooking. I I you know I just want another sort of co-op shooter third person type deal gadgetry going with your friends doing there's just a lot of awesome experiences we had in the Division 2 that I miss",
            "start": 1841.36
        },
        {
            "text": "I I you know I just want another sort of co-op shooter third person type deal gadgetry going with your friends doing there's just a lot of awesome experiences we had in the Division 2 that I miss Hunter what's up have you heard about Monster Hunter I mean look I love Monster Hunter but it doesn't have Division type juice in terms of like what I was looking for we're not walking around Washington DC yeah we're not in New York going after Joe Pharaoh remember that one like there's some [ __ ] up crazy missions in the Division 2 that were just like stunning I was Man, they are [ __ ] cooking right now. So anyway, that's one thing that I Space Museum. I'm going to remember that. That it's one thing I really really miss. Forget. And then my other thing that I'm pissed off about, always angry, is that like why have there not been any more Returnal Clones? Oh man, you're cooking. Like you're cooking. What? Why? Do you know what I love? Give me more ripoffs. Mike, another another thing for",
            "start": 1890.0
        },
        {
            "text": "is that like why have there not been any more Returnal Clones? Oh man, you're cooking. Like you're cooking. What? Why? Do you know what I love? Give me more ripoffs. Mike, another another thing for Mike for you to add to the list of things that Blessing is into. I like bullet hells. Like bullet hells like big old orbs that are coming at you. Shout out to Near Nema had that [ __ ] for days. Have you Have you heard about the Mitsune fight in Monster Hunter orbs coming out there? Who can forget? Come on back. Come on, Bus. He looks like a big [ __ ] snake. Back up. That's one reason why I'm super stoked about Doom: The Dark Age is seeing these enemies hit you with a wave of five different projectiles, but the third one in the row is the one you have to parry. And just like that sort of mid strategy is is awesome. So, it's like, why are there no more like Returnal clones? It's been a long time. Return to Returnal. Yes, Eternal Return. Remember that one game? I think that was an Eternal",
            "start": 1929.76
        },
        {
            "text": "strategy is is awesome. So, it's like, why are there no more like Returnal clones? It's been a long time. Return to Returnal. Yes, Eternal Return. Remember that one game? I think that was an Eternal Return. There's no way there was a game called Eternal. I think so. I'm pretty sure. Look it up. If I'm PlayStation, I'm suing. Look it up. Eternal Return. I'm pretty sure it's a game. Oh, wow. It is. Yeah. Eternal Return. It sure is. Eternal Return is a And this came out in 2023. Holy [ __ ] Is a freetoplay two 2.5D perspective battle. It's not even a Returnal like though. Yeah. No, I don't think 2.5D perspective battle royale game. I just remember the name. Here's the other the other thing I want to uh chew on just for people out there. Hey. Hey. Hey game developers. You're making games right now. You're probably making a game. I would love for y'all to make the Division 3 style game, but just rip off the [ __ ] of like just steal Bungie's marathon art style. Oh, okay. just completely",
            "start": 1973.28
        },
        {
            "text": "now. You're probably making a game. I would love for y'all to make the Division 3 style game, but just rip off the [ __ ] of like just steal Bungie's marathon art style. Oh, okay. just completely rip it off. Give me a character creator because, you know, it's clear that Bungie Marathon is not going to be the game that I want and I will still play it. I just wish it was a different genre. That's, you know, that's a discussion for another time. But let's just rip off that art style, please. Andy, what's stopping us from just going back to The Division 2? They put more stuff in. There's more stuff going on. There's nextG patches. Well, I I would have to start off because I'm on I'm on PC and I just made it just reignited my love for shooters, right? Sure. Sure. How do you feel about Arc Raiders though? Is that gonna give you stoked for Arc Raiders, but it's not the same art style as The Division or as as Marathon? Okay. But it's also an extraction type shooter. It's not Oh, yeah. So,",
            "start": 2020.72
        },
        {
            "text": "though? Is that gonna give you stoked for Arc Raiders, but it's not the same art style as The Division or as as Marathon? Okay. But it's also an extraction type shooter. It's not Oh, yeah. So, that's the same genre, isn't it? It's not a sort of a co-op story campaign going through missions and things like that. We need more Dude, we need more Space Marine twos. are yeah our um fair enough cover shooters is that what they call them like the third person you get behind cover are those done with like are we past the prime are we past the era cuz I feel like that was I would say the division is a cover shooter that was like so three 360 PS3 is where it felt like every game wanted to be that Gears and Mass Effect yeah uh Army of Two Uncharted Kanan Uncharted did they do that in like where it's press a button to then like get behind the I feel like we don't get those nowadays as much. Yeah, I think you're right. I mean, we get them like Gears. Yeah, Gears is coming, but I think it was Gears",
            "start": 2064.08
        },
        {
            "text": "press a button to then like get behind the I feel like we don't get those nowadays as much. Yeah, I think you're right. I mean, we get them like Gears. Yeah, Gears is coming, but I think it was Gears Prime was 360 Xbox One, right? I'll take Gears Prime. A word from our sponsors. Yeah, that's true. Uh, I was more weird. Socks fan says Division 2 DLC showcase April 24th. That true? Look at that. I'm going to look in that. And while I look at that, I'll remind you, of course, that yes, the ads are coming. Remember, if you love us, we'd love you to pick up a kind of funny membership either on patreon.com/kindfunny, youtube.com/kindfunny games, Apple or Spotify to get all of our shows ad free, get a daily podcast from me, and of course, get good karma for you for supporting a business you love that gives you 80 episodes of content plus each and every month. But right now, you're not using your benefits. So, here's a word from our sponsors. This episode's brought to you by Imperial. We've",
            "start": 2109.52
        },
        {
            "text": "that gives you 80 episodes of content plus each and every month. But right now, you're not using your benefits. So, here's a word from our sponsors. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins, as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shields and the powerfully ranged cannon.",
            "start": 2150.72
        },
        {
            "text": "features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shields and the powerfully ranged cannon. With a deep ability system, extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode is brought to you by Factor. Make this your best season yet with",
            "start": 2196.96
        },
        {
            "text": "Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode is brought to you by Factor. Make this your best season yet with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. Greg Miller has been loving how simple it is to enjoy his Factor meals as he's rushing between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully prepared. Perfect for any active, busy lifestyle. Factor powers your day with satisfying breakfasts, onthe-go lunches, premium dinners, and guilt-free snacks and desserts. Factor can help you feel your best all day long with wholesome smoothies, breakfast, grab-and-go snacks, and more add-ons. Multiple people here at Kind of Funny have been loving their experience with Factor. And guess what? You can, too. Get started at factomeals.com/kindofunny50 off and use code kind",
            "start": 2245.36
        },
        {
            "text": "and more add-ons. Multiple people here at Kind of Funny have been loving their experience with Factor. And guess what? You can, too. Get started at factomeals.com/kindofunny50 off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's code kind offunny50 off at factormeals.com/kindfunny5050 off for 50% off plus free shipping. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal",
            "start": 2290.8
        },
        {
            "text": "If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast supports. Y'all know I've been outside a lot playing Pokémon Go and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Rays is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com, use code funny to get 35% off polarized sunglasses. And we're back. Uh, and yes, according to Tom Clancy's The Division over on X, save the date. Join the Division 2 showcase on April 23rd to learn about the Battle for Brooklyn DLC. The timing and YouTube premiere link will be shared soon. Stay tuned. Think Jay-Z is going to be there. Oh [ __ ] Oh, my other favorite wrinkle about that is that of course I",
            "start": 2341.2
        },
        {
            "text": "Battle for Brooklyn DLC. The timing and YouTube premiere link will be shared soon. Stay tuned. Think Jay-Z is going to be there. Oh [ __ ] Oh, my other favorite wrinkle about that is that of course I just wanted to go right to find out. So I went to The Division 2's like web page and their latest news article is from February 24th, 2025. They're not even updating this thing. I guess that's not true. That's their banner one. There's an April 10th one, but that's about the Division Easter egg event. I also have another important update before we jump. Riley 21 says, \"Didn't The Division 2 get a rogue?\" This is a super chat. Super chat to be part of the show. Didn't The Division 2 get a rogike mode last year? Uh, I vaguely remember that, Andy. I'm saying, let's go back. They've got to have a thing. They got have a thing. They got to have a thing now where you get it on PS5 and they boost you to whatever and you can just run with us. Can I play it on Steam? I don't think they have play.",
            "start": 2390.8
        },
        {
            "text": "a thing. They got have a thing. They got to have a thing now where you get it on PS5 and they boost you to whatever and you can just run with us. Can I play it on Steam? I don't think they have play. No, don't make me come play on Steam. That sucks. I got I got the platinum. You know what? For you, I'll do it. You want to do that? On the 23rd, are we going to run? We got to run some division battle for Brooklyn. [ __ ] You want it? There's so much stuff to play. But like, man, I'm sorry. The the Pokemon Nuzlock's gone on too long. Nobody cares. All right. 15. Oh, you mean here? Oh, yeah. Not at home. God, I got to do things. I don't play Monster. I got some apparently somewhere Oblivion's coming out that week. I got a lot going on myself. All right. Uh, old game's old, Greg. That's true. But now it's new. Looks good. The next thing I want to bring up, really quick, we have an important update from Pages Inc. to bring it back to the top of the show. Thank you very much. They say, \"My",
            "start": 2430.16
        },
        {
            "text": "But now it's new. Looks good. The next thing I want to bring up, really quick, we have an important update from Pages Inc. to bring it back to the top of the show. Thank you very much. They say, \"My uh username is a multi-layered pun. My hands are tied to pages inked to bring you back. Uh Homestick at Space Camp by Fallout Boy, but then they're also inked. So my inclination of what inks meant.\" Wow. Yeah. Right out of the money. Paige is So we know Paige is in. That's crazy. And works for the government. Roger. What? I need you to go to this blue sky post we're showing right now. Reverse image search it. Find out what page it does of the government. All right. See? See? Bless. I would have thought it was they're trying to teach us about ink. So, it's pages inc ed like education. Oh, yeah. Pages pages inc education. That's where I would have gone with it. Before you jump somewhere else, I do want to give you the super chats because we've had a few. We said at the top, of course, be",
            "start": 2472.16
        },
        {
            "text": "Pages pages inc education. That's where I would have gone with it. Before you jump somewhere else, I do want to give you the super chats because we've had a few. We said at the top, of course, be part of the show. Write in yada yada yada. Uh, I like this one from Mason who gave an incredibly generous super chat. Thank you so much. Hey guys, just found your channel recently and love the content. Y'all rock. I wanted to shout out to all of you. Kronos the New Dawn gameplay looks great. Uh I have it pulled up over here. We talked about this a lot on this was this is a new story in KD. They dropped a new trailer today. Oh, did they? Kronos the New Dawn is a pulse pounding thirdp person survival horror game where time is your deadliest weapon and your worst enemy. Survive a brutal future. Dive back in Yeah. Go dive back in time and stop nightmarish creatures from emerging into unstoppable abominations. This is where you were talking about a dead space like Right. Yeah. Yeah. coming from",
            "start": 2514.32
        },
        {
            "text": "back in Yeah. Go dive back in time and stop nightmarish creatures from emerging into unstoppable abominations. This is where you were talking about a dead space like Right. Yeah. Yeah. coming from Blubber team as well. This is their new IP uh that they're bringing out. The long this is one we had heard of or seen a long time ago, right, of like a chess game, right, where they were sitting there and all this weird stuff from Blubber. God, this looks so [ __ ] fire. This looks awesome. Like this. I I think I don't like the name though. I think it's a bad name. What's it called again? Kronos. Kronos. The new dawn. It's very forgettable for me. You'll eventually like it because it sounds it it I get it confused with Sorrowos. Yeah. Yeah. Yeah. which also isn't super distinct. But like I think I'll remember Soros more than Kronos also sounds too much like time. Time. Yes, which it is time. You're right. But there have been other things called like that imply Kronos. Kronos trigger or",
            "start": 2555.28
        },
        {
            "text": "think I'll remember Soros more than Kronos also sounds too much like time. Time. Yes, which it is time. You're right. But there have been other things called like that imply Kronos. Kronos trigger or invoke Kronos. As much of a scary Kronos trigger. No. Who said that? No. As much of a scaredy pants as I am. That look that's something I'm going to want to play. you're going over it. My next recommendation on the list is a uh is a game that isn't necessarily that I'm something that I'm like clamoring to play for, but this is more for recommendations because we have a I say our audience skews older, right? Yeah. We have a lot of uh listeners out there and viewers that have kids and this is a game that has been out since last year in early access, but it's getting a real big kind of all right let's we're reuning everything and sort of rethinking the whole thing and they are super stoked about it and that is Towerorn. Tower swear to God this game what the [ __ ] just keeps coming up. We",
            "start": 2594.88
        },
        {
            "text": "let's we're reuning everything and sort of rethinking the whole thing and they are super stoked about it and that is Towerorn. Tower swear to God this game what the [ __ ] just keeps coming up. We had a whole we had a whole segment on Games Daily yesterday about Farborn of like it having a release date coming up at the end of April, but we people Paris is playing it at night with Phil Spencer and I feel like we've been talking about it since January. Like what the [ __ ] is going on with the game? Yeah, it's had this it's had that Xbox preview. This is going to be the first time I've seen the gameplay of it. This is crazy. Is this a beat him up? It It's a beat him up and it has like a lot of um I would have I would have told you it was a survival game. A lot of the I mean, of course, I thought tower defense game. Like that's, you know, when I sat down at GDC to play it with people or with the devs there, I was like, I thought this was a wow, I thought it was a tower defense game. This",
            "start": 2641.6
        },
        {
            "text": "tower defense game. Like that's, you know, when I sat down at GDC to play it with people or with the devs there, I was like, I thought this was a wow, I thought it was a tower defense game. This doesn't look at all what I thought it was going to be. And I've heard Paris mention it a whole bunch. And um right now the devs are um I don't know if the full big sort of you know reset of it all has come out yet where they have kind of retuned a whole lot of things and the devs are like super stoked about where it's going. But the reason I recommend it for for this show especially because it has local co-op, local couch co-op, and it seems like such a cool game to have be like baby's first beat him up like because of the way that it does not only character creation but also character customization, getting new loot, having these kind of fun boss fights, and also bless the I think they were mentioning that the they have a lot of devs on the combat team that were from the the Killer Instinct",
            "start": 2678.32
        },
        {
            "text": "getting new loot, having these kind of fun boss fights, and also bless the I think they were mentioning that the they have a lot of devs on the combat team that were from the the Killer Instinct team. And so there's a like they're like we know it looks very cartoony and kind of like, you know, kid-friendly and stuff, but the combat can get real deep if you wanted to in terms of how things get comboed together. And are you enjoying this? Huh? This isn't your type of game, you said, right? So I played it at GDC and I had fun with it for sure. I I don't think it look but this is more for people I would say that whenever they go, man, I need a game to play with my kid that isn't like overly violent or whatever. I think this is something that because it is local couch co-op, it's something that a I could totally see a family just like go four player co-op or whatever and um having these cool moments with beating the bosses, going back to the hub world, buying new loot or whatever. It it",
            "start": 2725.68
        },
        {
            "text": "a I could totally see a family just like go four player co-op or whatever and um having these cool moments with beating the bosses, going back to the hub world, buying new loot or whatever. It it just seems like one of those games that could work for a a certain audience. Even if even if it may not be something that I'm super super stoked for, when I played it, I was really really impressed. and the devs being like, \"Yeah, this big reset we're coming up with, like, we're so stoked. We just can't, it's not pushed live yet.\" And whenever we are testing it, we're like, \"Ah, man, I wish I could play on the new build instead of the the older build, right?\" Um, it it's just something that I think I would recommend to parents out there who are looking for something that isn't going to be overly violent or something that doesn't require multiple consoles and TVs. You can just play couch co-op. I like I would have gone through a list of genres before before I would have I would have told you",
            "start": 2767.52
        },
        {
            "text": "violent or something that doesn't require multiple consoles and TVs. You can just play couch co-op. I like I would have gone through a list of genres before before I would have I would have told you that this is a a beat him up game and like watching the gameplay for audio listeners, right? Like it is like when I when we say beat him up like the flow of it is Streets of Rage, but it's in a more fantasy like setting. Yeah. And it looks really cool. It looks really fun. There's another one though. I'll say bad title for the game. Yeah, I agree. Tower very much invokes like either tower defense or you're building a thing. When I sat down with them, I was like, \"Oh, I've heard pairs talk a lot about this.\" Cuz was it the Xbox Mixer? Yeah. And I was like, I didn't know that's what if I knew if I knew that that it was this genre, I would have played it. Yeah. Like I I think it's really cool and I'm just I was stoked to see how excited the devs were to be like, \"Man, we are so excited about",
            "start": 2808.24
        },
        {
            "text": "I knew that that it was this genre, I would have played it. Yeah. Like I I think it's really cool and I'm just I was stoked to see how excited the devs were to be like, \"Man, we are so excited about this new shit.\" Like it things work really really great now. So Towerorn in early access now. The one-time reset is arriving on April 29th. So that'll do the whole thing as they then that's update six they call it. And I guess that launches us directly into it being out there. Yeah. with resets for Towerborn Steam Founders Access on April 29th. Yeah, it seems very akin to Cyberpunk Bless doing like their 1.5 tools and everything reset where they're like, \"Hey, the we have a GTA wanted level now. Skills are completely retoled. Like it's it seems like they are completely resetting everything and they are super stoked about it and um yeah, I think it's just I think it's something that that people should check out. I didn't expect to go that long and it's sorry for you. Oh yeah. Well, they",
            "start": 2843.92
        },
        {
            "text": "and they are super stoked about it and um yeah, I think it's just I think it's something that that people should check out. I didn't expect to go that long and it's sorry for you. Oh yeah. Well, they people wanted a short podcast. Yeah, sorry. They love it when it's 4 seconds long. You know what I mean? That's so true. Um, another one that I will bring up from back on the doc Barrett is Abyss Zero. I don't know if it's Abyss X0, Abyss Cross, but this is from I like the art style. Awesome. Abyss Time Zero. This is from the devs of Unsighted, which was a top-own um sort of adventure action hacken slash game. incredible pixel art style and they said, \"Hey, for our next game, we want to make a 3D game.\" And they've been developing this for a couple years. I believe it's two developers. I'm not sure if the team has grown since they made Unsighted Punk. Um, it is such a sick ass kind of nostalgic looking art style. Very, very basic with how it's, you know, the textures look and things look",
            "start": 2887.92
        },
        {
            "text": "sure if the team has grown since they made Unsighted Punk. Um, it is such a sick ass kind of nostalgic looking art style. Very, very basic with how it's, you know, the textures look and things look very low style to it on purpose. It looks so [ __ ] sick. And it is a I mean they're going for a a hacken slash sort of um action adventure game in this sort of I guess post-apocalyptic world. I think the character reminds you of kill a kill bless you know. Explore an expansive world in this 3D Metroid vania with carefully crafted dungeons and stylish combat. Take control of two different characters faded to battle each other. Code name A and code name Z. Legendary heroes with unique abilities that change how you fight and interact with the environment. This is cool. What's funny is I very recently was like, man, I could I'm my nostalgia brain is kind of desiring something that is in like an N64 PS1 sort of art style and I I've been like looking at my library of N64 games that may or may",
            "start": 2936.16
        },
        {
            "text": "was like, man, I could I'm my nostalgia brain is kind of desiring something that is in like an N64 PS1 sort of art style and I I've been like looking at my library of N64 games that may or may not be on a device that is allegedly Nintendo Switch Online, you know what I mean? Like going through there and being like, \"What do I want to go back and play?\" Or like is there One of the games I was looking at was Merchant 64. I don't know if you guys have seen this one, but it's like a store merchant kind of simulator game, but it's in the art style of N64. I was kind of looking at that of like I want something to bring me back to that specific era cuz that was when I got into video games, right? Like I was N64 was my first console as a very young child. Yeah, the Mega Man Legend calls out call outs in chatter totally dead on. Yeah, this is Yeah, this is giving me that though. Like it's that era, but like maybe more Dreamcasty, like it it almost feels like 32 or not 32-bit, sorry, like",
            "start": 2982.16
        },
        {
            "text": "call outs in chatter totally dead on. Yeah, this is Yeah, this is giving me that though. Like it's that era, but like maybe more Dreamcasty, like it it almost feels like 32 or not 32-bit, sorry, like between 64-bit and like PS2 era type type stuff with with a very colorful art style and combat that like kind of exceeds what they were doing at that time. But I like it. I [ __ ] with this. Oh yeah, this looks awesome. I I um I highly recommend anybody to follow them on I don't know if they're on Blue Sky, but I definitely saw I I heard of I discovered them through Twitter because of Unsighted and Unsighted looked like a it was sort of a top down 8-bit pixelated sort of uh hacken slash game with dodges and parries and it it reminded me of like a newer version of Hyperllight Drifter and I was always super stoked about it. But the um they post a lot on Oh, they are on blue sky. Nice. All right, perfect. So, let me go check them out on Blue Sky because they are constantly posting new things",
            "start": 3022.0
        },
        {
            "text": "always super stoked about it. But the um they post a lot on Oh, they are on blue sky. Nice. All right, perfect. So, let me go check them out on Blue Sky because they are constantly posting new things in progress, new things in development. And it's just I love following developers progress and saying like, \"Check out this new thing I'm gray boxing right now.\" And it's like the coolest maneuver, you know, a traversal mechanic or something like that. It's just um it really exciting to kind of see this game progress over the years. So yeah, that game is called Abyss Time Zero, Cross Zero, X0. Who knows? A good pick. Ver I just dropped Merchant 64 into assets for you. Uh but basically they describe it on their Steam page as a tiny um tiny retro inspired traveling merchant game. Take control of merchant as you buy goods at low prices and sell them in different towns at higher prices. And so it really is you are in this N64 world as a merchant going around buying things and then traveling",
            "start": 3071.2
        },
        {
            "text": "of merchant as you buy goods at low prices and sell them in different towns at higher prices. And so it really is you are in this N64 world as a merchant going around buying things and then traveling to different towns and selling things and just trying to like build like build up currency. Adding that to my list as well. Abyss Cross Zero. Oh, then it also came out like two weeks ago. Oh [ __ ] March 31st is when Merchant 64 released. Is it a Moonlighter type? Seven bucks. Yeah. Mer 64 is a tiny retro traveling merch. I mean I think it's I would say maybe not like Moonlighter cuz it seems way more straightforward. Yeah. I don't know if there's combat in it is or not. Yeah, I think it is really easy. It's just a merchant the whole time. That was cute as hell. A teeny tiny adventure. This is a small game designed to be delightful. Short adventure with multiple endings. Steam Deck compatibility unknown. The next game on the list is a game that was also on the eye initiative, which is",
            "start": 3119.44
        },
        {
            "text": "is a small game designed to be delightful. Short adventure with multiple endings. Steam Deck compatibility unknown. The next game on the list is a game that was also on the eye initiative, which is like, wow, what a how quickly that became something to keep an eye on. Yeah. It was just last year was their first one and now it's and you laughed them out of the building when they did You're like, you're not you're not going to make it. You're not going to make it in this business. Good luck. Um, this game is called Neverway. Uh, Never is from the pixel artist from Celeste. Oh, and this game looks totally blessing and Barrett style as well. This is uh the tone that they're going for. Oh, disaster. Peace. Hyperlight Drifter right there. like this this game just seems kind of like a dream come true, but it's got this just awesome sort of art style with really cool color palettes that they use. I'm not sure if it's kind of a life simmy uh deal, but then you also have some adventuring as",
            "start": 3156.88
        },
        {
            "text": "true, but it's got this just awesome sort of art style with really cool color palettes that they use. I'm not sure if it's kind of a life simmy uh deal, but then you also have some adventuring as well. Um, and I think it's really what got me excited about it was, oh [ __ ] it's the Celeste artist. That's really that's awesome. But then you have these cool little key art moments with uh characters and it's just very sort of Yeah, it's kind of life simmyi, but there's some dark [ __ ] happening as well. Yeah, I think the thing for me with life sims is like a lot of it is like the presentation and like the vibe that'll get players in, right? And I think so many of the games go for the cozy thing. I kind of like how nostalgic this art style is and kind of like how it it feels darker in a way. It feels darker and it feels more game boyy uh in like some of the in the art style than like the other games. And I even though I'm not necessarily a life sim person, I would kind of like to just",
            "start": 3208.64
        },
        {
            "text": "It feels darker and it feels more game boyy uh in like some of the in the art style than like the other games. And I even though I'm not necessarily a life sim person, I would kind of like to just exist in this world. And it seems like it has a lot more stuff going on with it too that I want to I want to see what's up. Yeah. The description on Steam says, \"After quitting her deadend job, Fiona starts over on a farm and and becomes the immortal herald of the dead god. Make friends, fight through horrors, and pay your debt in this nightmarish life sim RPG.\" Where'd you get this case from? Oh, this is my SF Bags, baby. Come on. I've been using the same SF Bags format for since Vita. So, Vita, Switch, Steam Deck, Rag Ally, sfbags.com. Remember, they gave us a bunch of stuff to give away on the anniversary stream. Oh, nice. They're local. They're great. Is Do they have a physical store or is it all online? No, it's all online. SFBags.com. You can go. They got everything. Yeah, the game is",
            "start": 3256.88
        },
        {
            "text": "anniversary stream. Oh, nice. They're local. They're great. Is Do they have a physical store or is it all online? No, it's all online. SFBags.com. You can go. They got everything. Yeah, the game is called Never Wait. They made them for Playdate. That's how like in the in the weeds they are for making I never hear about that. sold one and a half of those. Remember when like the the playdates were stolen on that truck or misdeled or whatever? They just showed up some random thing. Wow. Yeah. You go to their they have a gaming cases thing. I used their backpack for a long time, too, and then it broke. So, not because of them, because of me. I need this. Okay. Um I'll you know what? I'll call this my last one. Okay. There's a couple of other ones. Um but I'll I'll go with this one. This game is called Jump Ship. And Jump Ship is a one to four player co-op game where you are commanding a spaceship, traveling through space, landing on planets, and doing like firstperson shooter type",
            "start": 3300.88
        },
        {
            "text": "game is called Jump Ship. And Jump Ship is a one to four player co-op game where you are commanding a spaceship, traveling through space, landing on planets, and doing like firstperson shooter type missions. Um, I just love the idea of commanding a spaceship with friends and have, you know, them so and so being on the gunner, but the fact that you can kind of do pirate type ship of like land, you know, going to flying to another ship and landing on there and trying to take whatever they have. Um, it just seems like a game that's insanely uh ambitious and I don't know exactly how it'll hit all of these goals being a really small developer, but they're going for a lot of different modes of gameplay. It's not just the first person shooting on with the boom box this guy's carrying. Oh, I would I thought it was a uh like a rocket thing or something. Oh, maybe it's a skin for a rocket launcher. Maybe it was a boom box. Yeah, I don't know. So Oh, it is a boom box. So part of me is So part of",
            "start": 3342.4
        },
        {
            "text": "I thought it was a uh like a rocket thing or something. Oh, maybe it's a skin for a rocket launcher. Maybe it was a boom box. Yeah, I don't know. So Oh, it is a boom box. So part of me is So part of me is wondering that, you know, you're on a spaceship, you're you're commanding space, you know, your spaceship and you're shooting at other things uh out in the in the world or whatever. But then when you land, it kind of reminds me that it's it kind of reminds me of um oh gosh, re like not the older version of Repo. What was the game before Repo? Multiplayer game where you would Oh, like one of those like streamer games. Yeah, I know which one you're talking about. Were you like it's the content creator one? No, not no not not a content warning. Uh Lethal Company. Thank you, chat. Oh, there you go. So, I think that's maybe what the boom box is. Like in Lethal Company, you land, you know, you just are trying to take random items to go back to your ship to make money. And I think that",
            "start": 3399.84
        },
        {
            "text": "you go. So, I think that's maybe what the boom box is. Like in Lethal Company, you land, you know, you just are trying to take random items to go back to your ship to make money. And I think that that's maybe what the looting is here where you're landing, you're shooting [ __ ] and you're maybe like, \"Let's get the [ __ ] out before all the enemies are sort of chasing us.\" And maybe you could shoot them. or maybe you just decide to get out and kind of go back to your ship. Um, and yeah, so Jump Ship seems like one of those games that could be a lot of fun with friends. The uh description on Steam says, \"Jumpship is a mission-based co-op FPS for up to four players where you are the crew of a spaceship. Transition seamlessly from crewing the ship to on foot exploration and spacew walks. Engage in intense battles both on the ground and in space, and always keep your ship upgraded and intact.\" I I it just sounds so cool to be able to to not only loot stuff that you know you're looting",
            "start": 3444.88
        },
        {
            "text": "Engage in intense battles both on the ground and in space, and always keep your ship upgraded and intact.\" I I it just sounds so cool to be able to to not only loot stuff that you know you're looting stuff to kind of have that on foot firsterson shooting action, but that loot is going to go towards making your ship better. And I just I love progression like that. I that to be able to see the fruits of your labor and go, man, our gunner our shield is a lot better now and we have a better we have better cannons on our ship because of all that stuff that we were able to loot. I I think that's such a cool thing. Um, in addition to what we streamed yesterday, which was a sponsored stream, I know, so take it for take it for what it's worth. But Lost Skies, when we played that [ __ ] yesterday, was [ __ ] blowing my mind cuz it's it was the second time we streamed it as a sponsored thing. But Lost Skies is a similar sort of co-op survival game, and I love survival games. But Lost Skies near",
            "start": 3485.04
        },
        {
            "text": "was [ __ ] blowing my mind cuz it's it was the second time we streamed it as a sponsored thing. But Lost Skies is a similar sort of co-op survival game, and I love survival games. But Lost Skies near the end of yesterday's Vaude Bear. I don't know if you can pull it up, but as we get towards the ship building part of it and seeing the way the ship building works, cuz the game has the most incredible grappling hook like ever. It It's the most realistic grappling thing you'll ever feel in a game. The physics work incredibly well and they mentioned that it was the first thing that they developed. So that's why it feels so good to use. But uh Oh, maybe fast or rewind like maybe 20 minutes or so. I'm um yeah, keep on rewinding cuz you'll see. Yeah, like right here. Uh so the the whole purpose of it is to land on these different sky islands and build a a ship or whatever. And the as you're building it, it sort of pops up in the sky, right? And from when it's up there in the sky, you shape",
            "start": 3531.4
        },
        {
            "text": "of it is to land on these different sky islands and build a a ship or whatever. And the as you're building it, it sort of pops up in the sky, right? And from when it's up there in the sky, you shape how you want it to look. And it's essentially an airship that you put sails on or whatever. Okay. But the the way that the building was working as they were building it for us because we were kind of running low on time. This idea of man, we are going from island to island. Let's go park our ship over there. Let's land. Let's take out enemies. Let's loot whatever they have there. Let's make our ship better because we need space for this on our ship. Right? So the the amount of variety you could do with your ships and the amount of ships you can make to be like, \"All right, this is our big traveling ship, but we also have this one little fighter one that's more used for taking on these gigantic sort of enemies.\" I don't know if you could scroll back towards like maybe the middle of of the",
            "start": 3579.16
        },
        {
            "text": "ship, but we also have this one little fighter one that's more used for taking on these gigantic sort of enemies.\" I don't know if you could scroll back towards like maybe the middle of of the Vaude Bear also cuz the the grappling of it is just so freaking fun. Um because it's legitimately like you grapple towards all these floating rocks. Yeah. Here it is. And so I I had gotten like a little too far down here, but it works exactly how you would want it to work. And none of it is one for one. So it all kind of can feel chaotic if you had the I I jumped way too soon right there. But then the the way it works and letting go of the grapple and like kind of zipping yourself towards the target to what you grappled is so much freaking fun. And then at one point once we finally set sail on our ship, we were grappling on the back of our ship and just being pulled by it. Like it is so freaking cool. And it's such a very specific reference, but it reminds you of like when you have advanced",
            "start": 3624.4
        },
        {
            "text": "ship, we were grappling on the back of our ship and just being pulled by it. Like it is so freaking cool. And it's such a very specific reference, but it reminds you of like when you have advanced swinging on on Spider-Man 2 for PS2 where like kind it's way more like just hanging around on the on the spiderweb or whatever. Yeah. It's less kind of automated and more like just free form and and I I freaking love that. So, this game was one that I didn't I didn't even put on the list, but this is one that I was like, \"Oh, [ __ ] I want to play this this weekend cuz it's it was a lot of fun.\" And again, we were sponsored by them yesterday, but I I had a great time with it. And I love survival games as well. Were you adding stuff on your wish list there? I'm Well, it's I think if I didn't I bought Merchant 64, but if I didn't download Merchant 64 right away, I know I'd forget and it would be like months from now. I'm like, \"What is it?\" Ah, so I made sure I download. Do you have Do you",
            "start": 3673.28
        },
        {
            "text": "bought Merchant 64, but if I didn't download Merchant 64 right away, I know I'd forget and it would be like months from now. I'm like, \"What is it?\" Ah, so I made sure I download. Do you have Do you have your Is that your RG? It is. Do you have it set to where you turn it on and it automatically goes to Steam? No. Oh, gotcha. I like where I like the Windows of it. Oh, good for you. Yeah. Yeah. Having the Xbox there and everything. I know. I know. I'm totally like the I was reading reviews and stuff about it and like I'm totally the outlier, but it's like I I I'm so impressed with the ROG Alli X and the interface and the mouse on the stick and double tapping on icons. It just for what I want of just being a little game machine that can do Xbox and window or Xbox. Yeah, Windows and, you know, Steam. I'm like, damn, this worked out really, really well. You get that Ubisoft launcher on there about the EA. No, no, I'm not too worried about those yet. Maybe one day. I forget if it was on",
            "start": 3716.8
        },
        {
            "text": "Steam. I'm like, damn, this worked out really, really well. You get that Ubisoft launcher on there about the EA. No, no, I'm not too worried about those yet. Maybe one day. I forget if it was on this show or if it was skipped anywhere I was talking about bringing my Steam Deck to the car wash. I think it was here. It was like a when you when you do show two shows back to back, it's all it's one show in my brain. Um, but in the way that you just turned on your ally and start making sound when I was in like the waiting room for waiting my waiting for my car to get washed and detailed. I turn on my Steam Deck play blueprints and I forget that like the bootup sequence to my uh Steam Deck is the PlayStation 2 like bootup sequence and like I turn it on and it's the volume is all the way loud and so you just hear the and like there's like five other people that are just sitting there and I'm like I got to wait for it to go through cuz it can't turn down the volume until it finishes. And so",
            "start": 3756.48
        },
        {
            "text": "so you just hear the and like there's like five other people that are just sitting there and I'm like I got to wait for it to go through cuz it can't turn down the volume until it finishes. And so I'm like, I'm sorry. We're being attacked. I'm playing blueprints. I'm glad it wasn't the I I used to have the port. It could have been better. I love the vampire survivors one on my Steam Deck. And that's the one where it's like, you know, usually if I'm not on a plane or here or whatever, if I'm using those, I'm in bed. And so it's that thing always of like that dice roll of Jen's rolled over and it's dead quiet in the room. And she's always so annoyed with me playing video games at night in general. So I always try to be so quiet and it's like the [ __ ] trying to mute as fast as I can. My headphones aren't hooked up yet to Sorry. Sorry. Uh before we get out of here, I want and great, by the way, great pick, Andy. Hey, thanks. These are some great games and I know you didn't get through",
            "start": 3796.88
        },
        {
            "text": "aren't hooked up yet to Sorry. Sorry. Uh before we get out of here, I want and great, by the way, great pick, Andy. Hey, thanks. These are some great games and I know you didn't get through all of them, so I appreciate that. Uh we have had a lot of people super chatting with games they want us to know about. Jordan White super chatting said y'all should check out Ethra. It's capital E lowercase tr I'm sorry, TR uh A capital A. E. Crashed. Damn, I was going to go with Oh, that's the sequel to Europe, but I was like, that's not how it's going to work. It style looks really cool. It's like a 2D 3D open world. Ethra is an RPG/adventure uh an open world game that revolves around uh the misadventures of two characters, Bob and Veil. Both will explore the land of Ethra and uncover a thousand-year lie that would all that the world already forgot about. That's cool. Very cool art style. I love I I love these sort of nostalgia pixel 2.5 traditional pixel art and a 3D world shouldn't be done",
            "start": 3836.24
        },
        {
            "text": "lie that would all that the world already forgot about. That's cool. Very cool art style. I love I I love these sort of nostalgia pixel 2.5 traditional pixel art and a 3D world shouldn't be done like me fellow super chat I don't know if this counts but I'd highly recommend Super Mario a Pokemon ROM hack where you play as Mario catching enemies from the NES era until now funny writing amazing sprite work and great music like we show footage of that Nintendo I agree and like look that up like maybe we delete this section of the the the podcast. Maybe we don't bring it up. Chat be cool. Uh, Living Legends super chats and says, \"Hope we get to see uh new Shinobi AOV gameplay soon, which is that 2D sides scrolling shinobi, right, that they age of vengeance.\" Oh, yeah, that's what it is. Gotcha. I mean, I'm more excited for Ninja Guiden Ragebound. True. Fair. Devs of freaking uh uh Blasph. Uh AK98 says, \"Andy, you got to check out Wildgate from Dream Haven.\" Have you heard of this one,",
            "start": 3877.92
        },
        {
            "text": "I mean, I'm more excited for Ninja Guiden Ragebound. True. Fair. Devs of freaking uh uh Blasph. Uh AK98 says, \"Andy, you got to check out Wildgate from Dream Haven.\" Have you heard of this one, Andy? No. Wildgate is a PvP multiplayer shooter that bends tactical ship to- ship, I'm sorry, blends that Steam's so small. Uh tactical ship-to-ship combat with fast-pac action. Evade deadly environmental hazards, search for powerful weapons and ship upgrades, and be the first crew to escape with the artifact. Dot dot dot or the last revealed. Yeah, Key revealed this. And the reason why I didn't love the art style it reminds me uh a lot of um everything. Yeah, but kind of uh um the Rick and Morty one. What was the one we just talked about? Yeah. High life. It kind kind of gives me that sort of vibe with the shading and the textures, but like it's not make or break for me. It was just one that I wasn't immediately in love with, but it's those same trappings of let's all be on a ship together.",
            "start": 3928.32
        },
        {
            "text": "with the shading and the textures, but like it's not make or break for me. It was just one that I wasn't immediately in love with, but it's those same trappings of let's all be on a ship together. We're I'm driving it. You are on the cannon, so I need you. Like that level of of cooperative sort of uh gameplay is so I think thrilling and exciting to me. But then being able to get off this ship and then have another vertical of like this is another part of the game and now you're on first person shooting and we're looting and stuff. Another ringing endorsement of the one and only Andy Cortez, the tastemaker we call him around here. Wow. DMC K747 super chatted and said, \"Been out of loop with new games recently, but checked out Witchfire on early access after hearing Andy talk about it the other week.\" Check out The Witcher. Have you heard about this other one? The Witcher, dude. Yeah, Witchfire is another one that I need to get back to, but if that if Witchfire comes out this year, it's",
            "start": 3986.88
        },
        {
            "text": "week.\" Check out The Witcher. Have you heard about this other one? The Witcher, dude. Yeah, Witchfire is another one that I need to get back to, but if that if Witchfire comes out this year, it's like in a contender spot with a bullet. There's like no there's no doubt to me that it'll likely hit a contender spot for me. And then our final super chat and recommendation comes from CJ Splitzon who says, \"Anyone kind of funny excited for The Altars: Flying Under? I've dropped a link in the document and then over on the same page. lists it as. Explore an emotional sci-fi game with a unique blend of survival, adventure, and base building elements. Help Jan, uh, the sole survivor of an ill- fated space expedition, create alternative versions of himself to escape a hostile planet and tackle personal turmoils with this unconventional crew. I am. Um, it's something I definitely want to check out. I think the art style is fantastic and we've been seeing about the altars for a long time. Yeah.",
            "start": 4031.44
        },
        {
            "text": "turmoils with this unconventional crew. I am. Um, it's something I definitely want to check out. I think the art style is fantastic and we've been seeing about the altars for a long time. Yeah. And uh it seems like one of those that isn't my necessarily my gameplay sort of jam. Yeah. But neither is something like blueprints which you know there's a lot of games that are always kind of out of the norm that still hit because they are so good. And I hope this is one of those cuz the way that the sort of base building kind of looked a lot like Fallout Shelter. I'm like I don't know if I necessarily want that. June 13th which is rough. Coming up quick. Everything 13th. Everything's coming out in June. I have uh Barrett, one more. Oh [ __ ] I have one more. We got Daredevil to review. Yeah, I mean, you know, Natty and Chad says, \"Blue Prince is boring.\" You're boring. You're boring. Yeah, damn. They do say witch fire is good, but which very very good. Um, this last one I want to throw out",
            "start": 4076.96
        },
        {
            "text": "mean, you know, Natty and Chad says, \"Blue Prince is boring.\" You're boring. You're boring. Yeah, damn. They do say witch fire is good, but which very very good. Um, this last one I want to throw out is a I don't know if anybody here played Loop Hero. I did. Yeah. which always sounds like a freaking rhythm game, but it's a uh an idol sort of auto battler. And this is another auto battler for uh a game that it's kind of a weird one out of nowhere cuz Berserk Boy is a 2D sidescrolling Mega Man type game. Looks great pixel art style. This game is called Berserk Bits, and it's an auto battler that you just kind of put at the bottom of your screen while you do other [ __ ] And I I I'm blanking on the name of the game that kind of popularized this cuz there was another sort of auto life simmy thing that it was designed to just be at the bottom of your menu of your screen or your monitor while you do work above it. So, it's just kind of one of those ADHD things of, yeah, let this game kind",
            "start": 4124.32
        },
        {
            "text": "thing that it was designed to just be at the bottom of your menu of your screen or your monitor while you do work above it. So, it's just kind of one of those ADHD things of, yeah, let this game kind of auto battle retirement. Everybody's saying Rusty. Oh yeah, Rusty's Retirement. Thank you. And um that's sort of started becoming a bit more popular. People were going, \"Oh, this is there's kind of a market for this where people are into these sort of games that you can kind of just have playing in the background and progressing your little dudes while you're not clicking anything. They're just doing [ __ ] as you're doing other work.\" And uh Berserk Boy was a game that I I enjoyed. It wasn't something that I was like necessarily super in love with, but the I love the art style cuz it is just straight up Mega Man in, you know, the year 2025. And this idea of having just these little dudes just automatically doing stuff while you're doing other things. Maybe I'm drawing something or",
            "start": 4179.6
        },
        {
            "text": "just straight up Mega Man in, you know, the year 2025. And this idea of having just these little dudes just automatically doing stuff while you're doing other things. Maybe I'm drawing something or whatever the hell on my PC. I think it's a neat concept. Well, hell yeah, Andy. Thank you for bringing all these amazing games to our attention. Thank you. Thanks. Good wish list, Andy. and good suggestions from you in the super chat. Thank you for being here live. Remember, we do Games Cast each and every day after kind of funny games daily where we run the nerdy news you need to know about right into the biggest topics we need to talk about. Of course, after that we stream some games, sometimes review Daredevil, and do so much more all on youtube.com/kindfunname, twitch.tv/kindfunname, Apple and Spotify and podcast services around the globe. No matter where you get the show, please consider like, subscribing, and sharing. If you want to go the extra mile, and you can. We'd love your",
            "start": 4219.6
        },
        {
            "text": "and Spotify and podcast services around the globe. No matter where you get the show, please consider like, subscribing, and sharing. If you want to go the extra mile, and you can. We'd love your financial backing. Pick up your kind of funny membership on patreon.com/kindfunny. YouTube.com/kindfunny games. Apple or Spotify to get all of our shows adree. That's more than 80 a month. And your daily dose of me, Greg Miller, in a series I call Gregway each and every weekday. For now, we got to go talk about the man without fear. But until next time, it's been our pleasure to serve you.",
            "start": 4261.4
        }
    ]
}