{
    "id": 13957,
    "video_id": "n1ORGBT7JTc",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Joey Noelle",
        "Roger Pokorny"
    ],
    "title": "Switch 2 Pre-Orders Were a DISASTER! - Kinda Funny Games Daily 04.24.25",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nToday after, KFGD, you’ll get:\n- GAMESCAST - Ghost of Yotei Trailer Reaction, Hopes and Dreams \n- After Gamescast is Andor Season 2 Episodes 1-3 review with Tim, Barrett, Saige and… maybe Carboni???\n- Then the STREAM is Marathon Closed Alpha\nIf you’re a Kinda Funny Member:\n- Today’s Gregway is all about Greg’s LEAST favorite piece of content he’s ever done. AKA: his biggest on camera regret!\n- Friday, the Elder Scrolls Online Podcast - A Kinda Funny Gamescast Limited Series is BACK with episode 2!\n\nTime Stamps:\n00:00:00 - Start\n00:05:29 - Housekeeping\n             -  The Roper Report   -\n00:08:45 - Switch 2 Pre Orders were a clusterfuck\n00:33:11 - Ghost of Yotei Gets a Release Date\n00:43:06 - Until Dawn Movie Review w/ Joey!\n00:49:08 - Unannounced Blade Runner Game Canceled At Supermassive Games\n00:54:11 - Wee News! \n01:00:21 - SuperChats & You‘re Wrong\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745518459,
    "duration": 3864,
    "transcript_chunks": [
        {
            "text": "Today's stories include Switch 2 pre-orders were a nightmare, Ghost of Yotay has a release date, and our Until Dawn movie review. We'll have all this and more because this is kind of funny games daily. [Music] What is up everybody and welcome back to kind of funny games daily for April 24th 2025. I'm Roger Porny and today I'm joined by PAX East's 2025's keynote speaker Greg Miller. Hello Roger. How are you? I'm doing great. How are you doing Greg? I'm excellent. Oh I don't know if you know I have three stars. These were Tim stars. Technically I have seven stars. just some would call an instrumentable game showdown lead going into the finale, right? Seven to Tim's four now is what it is. Is that what it is? I mean, you do you forget the finale is how they work. I think it's three. Three. He has three. Oh my god. Do we want to pull it up? I'd love you to pull it up if you start. There it is. Hold on. Yeah. You don't want to be team purple though. I will say that uh because that was",
            "start": 7.52
        },
        {
            "text": "He has three. Oh my god. Do we want to pull it up? I'd love you to pull it up if you start. There it is. Hold on. Yeah. You don't want to be team purple though. I will say that uh because that was pre-recorded yesterday. I did accidentally show this scene earlier this week and thankfully no one noticed. Oh, did you? Somebody said something that they they somebody was like, \"Oh, they ruined it earlier in the week.\" But I didn't. Yeah, it was one person. It was mainly because we were focusing on Andy's one star and I forgot that this was already updated. It's fine. You could have just You could have totally played it off, right, of just like is this what will happen? God, how bad must it suck to be Andy? You know what I mean? Only one star and it's mine. I honestly think he loves being under the radar cuz he's seen what a living nightmare Stars in the Bank was for Tim. And if you thought that was bad, let me tell you, last night tucking myself into bed doing the thing where I got a",
            "start": 60.16
        },
        {
            "text": "under the radar cuz he's seen what a living nightmare Stars in the Bank was for Tim. And if you thought that was bad, let me tell you, last night tucking myself into bed doing the thing where I got a stifle on the cuz I'm laughing so hard at what I'm gonna do if I win the championship. Like, if you thought Stars in the Bank was annoying everybody, wait until you're part of the championship celebration. That belt everywhere. Oh, wait till you see what I have planned already. There's some calls I need to make to the city. Oh, no. Uh, you bring up Paxis. Yeah, of course. I am the Paxis keynote. It's coming up. It's coming up real fast. I had a a conversation with the one, the only Benstar today on the road. Thank you very much. Thank you. A round of applause for me and Ben Star. If you are not familiar, they said, \"Hey, Greg, do you want to come do the PAX East keynote?\" I said, \"Sure, that'd be a lot of fun. I love PAX East.\" I was there for the first one and many of them until I got",
            "start": 100.56
        },
        {
            "text": "not familiar, they said, \"Hey, Greg, do you want to come do the PAX East keynote?\" I said, \"Sure, that'd be a lot of fun. I love PAX East.\" I was there for the first one and many of them until I got sick. And they were like, first one? I was at the first PAX East. That's how old I am. Covered it for IGN. It came Pax West went for a while before they did Pax East. Uh I was like, \"Yeah, it'd be great.\" And they're like, \"Yeah, you know, you could do we know you can talk, but we've found success before with fireside chats where someone interviews you.\" And I was like, \"Oh, that's interesting.\" Cuz especially coming off Chicago, especially somebody who does a Greg way every day. I feel like I talk about myself a lot. And Raj, you know, again, I think the best interview I've ever had that I wasn't I didn't do, right? Maybe the best interview period. I don't know. But the most interesting someone's ever been talking to me is when you interviewed me during the 9th anniversary of Kind of",
            "start": 138.64
        },
        {
            "text": "I wasn't I didn't do, right? Maybe the best interview period. I don't know. But the most interesting someone's ever been talking to me is when you interviewed me during the 9th anniversary of Kind of Funny, right? Or maybe it was the launch of the studio when we did the the Hot Ones episode. You had such insightful questions, stuff I never would have gotten to on my own. I was like, you know what? That's a way more interesting thing. So, I ran through the who's going to be at Paxis, who could be great, who knows kind of funny, who knows me, and of course, of course, the one and only Ben Star from Final Fantasy fame, from now Clare, obscure, expedition 33 fame from being the Bellatroof faced guy. But Ben's going to come interview me. So, we had a call today about like what do we want to do and how do we want to do? And that's why you have work to do now because of course, we just gave it all to you. But Ben's got a really good idea, an interesting idea for a Paxis keynote to get to",
            "start": 170.0
        },
        {
            "text": "do and how do we want to do? And that's why you have work to do now because of course, we just gave it all to you. But Ben's got a really good idea, an interesting idea for a Paxis keynote to get to some new stuff. But they updated the Paxis schedule. Barry, can we see this please? I need to know who the [ __ ] is writing the pax paxis schedule because it sounds fine. Story time with Greg Miller. Thursday, May 8th, 11 p.m. main or 11 am main theater. For a decade, Greg Miller has managed to make shouting about video games into a full-blown 11 person company called Kind of Funny. That's nailed it. Perfect. That's true. Join us for our storytime keynote. It's Final Fantasy 16 and Claire Obscure. Expedition 33's Ben Star interviews Greg about his 18-year career, winning a game award, and games journalism in general. Then parenthesis. That's right. All caps. The famous one is interviewing Greg. Weird. I mean, I mean, the famous one is interviewing Greg. Period. Weird. Period. In",
            "start": 204.8
        },
        {
            "text": "and games journalism in general. Then parenthesis. That's right. All caps. The famous one is interviewing Greg. Weird. I mean, I mean, the famous one is interviewing Greg. Period. Weird. Period. In parenthesis. That's what go to the next image. It's alphabetical. But see again, why is Ben getting the first photo? You know what I mean? Ah, it's alphabetical. You know, I get it. But I mean, what the [ __ ] Who's writing the goddamn copy forcible? And then also remember since we're talking about Paxis, I am hosting a second panel at Paxis. I am doing uh the Mafia the Old Country or Mafia the Old Country panel. There's a little uh Instagram video they put out today talking about the gameplay trailer coming on May 8th to get you ready for May 8th at 2 p.m. uh when I do the uh panel there. We will be hosting that here on our channel. So at 11:00 a.m. Pacific time when you normally would get the one, the only kind of funny Games Cast, you'll in fact get this panel and then you'll get Games",
            "start": 239.04
        },
        {
            "text": "will be hosting that here on our channel. So at 11:00 a.m. Pacific time when you normally would get the one, the only kind of funny Games Cast, you'll in fact get this panel and then you'll get Games Cast. This isn't taking the place of content, just being there for it. That's awesome. Yeah, I'm excited. Me, too. Yeah, Paxis. I haven't been in a long time for Paxis. Yeah, I'm excited that you actually just meet a famous person. Like that's really cool. And like you can hang out with him. Maybe How many stars does Ben Star have? H Yeah, he did kind of [ __ ] you. He's so famous. Oh yeah, he did. Did he win that episode of Game Showdown? So perfect. It doesn't matter. It doesn't matter who won it cuz you know what? Then he won me this star. That's true. This has been Star. Get me a Sharpie. Well, Greg, we'll talk more about your stars, I'm sure, later on in the show. But remember, this is Kind of Funny Games Daily, where each and every weekday we run you through the nerdy news you need",
            "start": 287.92
        },
        {
            "text": "Well, Greg, we'll talk more about your stars, I'm sure, later on in the show. But remember, this is Kind of Funny Games Daily, where each and every weekday we run you through the nerdy news you need to know about live on YouTube, Twitch, and podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, and on and now uh Spotify and Apple Podcast to get all of our shows ad free, watch us record them live, and get a daily exclusive show. for a chance to be a part of the show. Submit your thoughts and opinions as YouTube super chats as we go. And I want to hear about them about how hard it was for you to get a switch to last night. I'm sure we're going to be sharing some horror stories and some war stories as we go. Little housekeeping for you. We're an 11 person business all about live talk shows today after KFG. You'll get uh a little Games Cast which is all about our uh Ghost of Yote trailer reaction, hopes and dreams for",
            "start": 325.12
        },
        {
            "text": "for you. We're an 11 person business all about live talk shows today after KFG. You'll get uh a little Games Cast which is all about our uh Ghost of Yote trailer reaction, hopes and dreams for that game. That's right. Andy and I have not seen the latest trailer. We're going to react to it live. Yeah. And we're gonna talk a little bit about of course the release the release date in the deluxe edition. Sure. But I want to talk about what's happening with this game, what we want from this game, what'll make this game special. I'm excited. Why we're excited about this game. Maybe Andy wasn't didn't connect as much with Assassin's Creed. I got a whole thing planned. Don't worry about me. You don't get three stars like this and not playing a show. God, he's got a whole thing planned. That's exciting. After Games Cast is Andor season 2, episode 1 through three review with Tim Barrett, Sage, and maybe Carboni potentially. It's it's in the air. We'll see. You think it's, you know, you think",
            "start": 365.76
        },
        {
            "text": "After Games Cast is Andor season 2, episode 1 through three review with Tim Barrett, Sage, and maybe Carboni potentially. It's it's in the air. We'll see. You think it's, you know, you think it's a great idea when you cast someone on a show that's involved with Star Wars and then there's a Star Wars celebration in Japan. You're like, \"Well, this this makes Why is everybody that I know in Japan? You know what I mean? It's crazy. Everybody's in Japan, bro. Except for me. It's [ __ ] up. You've been there, though.\" Yeah, but like not enough. Then the stream is Marathon Closed Alpha. The boys, the Jabroni boys are going to head back in there and see what that game's all about. If you're a kind of funny member, today's Gregway is all about Greg's least favorite piece of content he's ever done, aka the biggest on camera regrets. Friday, The Elder Scrolls Online podcast, the kind of funny GameCast limited series is back with episode two, and that is not a on camera regrets. No great show.",
            "start": 397.12
        },
        {
            "text": "aka the biggest on camera regrets. Friday, The Elder Scrolls Online podcast, the kind of funny GameCast limited series is back with episode two, and that is not a on camera regrets. No great show. Matt Fior and Rich Lambert from the ESO team are back with Greg and Mike uh and talking all about the 10-year journey. The episode starts with the game's rough launch and review scores before finding the ESO audience and building the playground they wanted. Come for the deepest dive of Greg's career Friday on all of our Games cast feeds and Bethesda's YouTube. You got to check this one out. I watched it the other day and it is a great episode. They go in depth and I love uh Matt and Rich's uh the way they compliment each other on this podcast because they are remembering things as they go on like, \"No, no, actually this happened before launch. This happened after launch.\" I mean, it's crazy. they've been together this entire way. We're talking about 10 years of this game plus, right? But I",
            "start": 433.44
        },
        {
            "text": "\"No, no, actually this happened before launch. This happened after launch.\" I mean, it's crazy. they've been together this entire way. We're talking about 10 years of this game plus, right? But I mean, also the fact that you have pre-development and what was going on, how long they've been working on it, and then this is insane. Yeah, it's wild stuff. Uh, thank you to our Patreon producers, Anatoli AA, uh, Delaney Twining, Carl Jacobs, and Omega Buster. Today, we're brought to you by Imperial and Aura Frames, but we'll tell you about that later. For now, let's begin with what is and forever will be the Roper Report. It's time for some new. We have five stories today. A baker's does it. Story number one. Switch to pre-orders. We're a cluster. [ __ ] Uh, we're just going to talk about it. Let's just have a [ __ ] conversation. When I when I started throwing links in here, I was like, this is like this is like Regis and Kelly. I don't know who's Kelly. I don't know who does it with Kelly",
            "start": 482.16
        },
        {
            "text": "just have a [ __ ] conversation. When I when I started throwing links in here, I was like, this is like this is like Regis and Kelly. I don't know who's Kelly. I don't know who does it with Kelly anymore. If Kelly even does it. Michael Strahan. Michael Strahan and Kelly. Is it Michael and Kelly? Whatever. Regious and Kathy Lee where they just talk. It's just talking now. It's the It's the American Idol guy now. What's Ryan Serest? Is he still there? I have no idea. Randy. Oh, her husband now does it. That's [ __ ] up. What's his name? And what do they call the show? Cliff. Kelly and her husband. Kelly and her husband. Uh, last night Switch 2 pre-orders went live at 900 p.m. PST midnight EST. The best coast EST. Don't do that. You live here now. I mean, well, you know, everything's based off of it. You know what I mean? You fell in love here. Yeah, exactly. Yeah, that's exactly I didn't do any of those things here. That's crazy. A lot of weight here. [ __ ] yeah, Greg. [ __ ] yeah. Uh",
            "start": 528.08
        },
        {
            "text": "of it. You know what I mean? You fell in love here. Yeah, exactly. Yeah, that's exactly I didn't do any of those things here. That's crazy. A lot of weight here. [ __ ] yeah, Greg. [ __ ] yeah. Uh went live. Went live on Target, Best Buy, Walmart, and I think that's it. You nailed it. Yeah. And then we were just all together trying to get this thing. Greg, did you get any? I did. Uh I was able to finally get it on Target. Yes. Uh, I had I don't know what happened to me, but I was cursed where I refreshed Best Buy like as Wario 64 the goat obviously. Round of applause for Wario 64 is Wario put up the hey, you can join a Walmart waiting room line. I had just casually fresh Walmart was put into that line and I was like, \"Oh my god, awesome. I'm here early. That's amazing.\" And I just left it open and I was like, \"I'll put on my phone, too, just to make sure. Who knows how any of this works?\" You know what I mean? Uh, I was refreshing Target non-stop. Walmart was uh I already said",
            "start": 570.4
        },
        {
            "text": "left it open and I was like, \"I'll put on my phone, too, just to make sure. Who knows how any of this works?\" You know what I mean? Uh, I was refreshing Target non-stop. Walmart was uh I already said Walmart. Best Buy was refreshing. They didn't have it up forever, right? That was a whole thing. One of the many links we I we tossed out here uh uh was I think it was Dan Adelman's uh Blue Sky post of like it's awesome to see all these sites fail in their own unique way. They're all failing us in a very unique way. Uh it was the idea that like, okay, cool. So, I'm in the Walmart waiting room and I got there early. That's awesome. Uh, I'm in Target and I can see it and I got it in my cart right away. But then it was the constant fail fail fail of not being able I I I you know beforehand I spent all you know not night but I spent a good enough time going through updating payment methods, updating addresses, shipping addresses, making sure everything's locked in. Yeah, we had the",
            "start": 619.04
        },
        {
            "text": "I spent all you know not night but I spent a good enough time going through updating payment methods, updating addresses, shipping addresses, making sure everything's locked in. Yeah, we had the conversation at the office of like, hey everybody do like we got to we got to lock in. Everybody got to update your thing, make sure you're here. And we were all doing it. So we were ready. So, like I had it all set and then, you know, I got it into the cart in Target and then when I finally could load the cart, it was like none of that information was there. So, I'm handwriting it every time and then entering the credit card every time and then it would fail on some other thing and fail. Weird one with Target where it would just not do my address, right? So, I had to hand type it, but it wouldn't even like the autofill would wasn't even my autofill wasn't working for me either. Yeah. Yeah. Yeah. And so, then it was like, \"Okay, cool.\" And then it just kept failing kept failing. Walmart's",
            "start": 658.08
        },
        {
            "text": "even like the autofill would wasn't even my autofill wasn't working for me either. Yeah. Yeah. Yeah. And so, then it was like, \"Okay, cool.\" And then it just kept failing kept failing. Walmart's still in the waiting room. Uh, you know, I'm I I'm waiting on uh Best Buy to do something. They're doing jack [ __ ] Finally, like I'm bitching about target a bit online and people just keep clicking the button once you get to this one part which is where I was and just click and click fail fail fail fail and think and finally it was like here's the confirmation. Yeah. And I didn't get the email right away. I did get the email hours later. I was like fantastic. Oh yeah. Then finally at some point Best Buy was like here's the waiting room and I got in the waiting room for Best Buy. But around that time was when every like I got mine at Walmart. I got mine on Walmart. And you were like yeah we're in the Walmart waiting room. Leans says it has two minutes left. I'm like where are you? I",
            "start": 690.56
        },
        {
            "text": "that time was when every like I got mine at Walmart. I got mine on Walmart. And you were like yeah we're in the Walmart waiting room. Leans says it has two minutes left. I'm like where are you? I screenshot. I'm like, \"Where are you seeing 2 minutes?\" And you screenshotted back and I was like, \"I've been here for 35 [ __ ] minutes and I've never had that pop up.\" And so, like, I refreshed and did it and quit and came back. Never could get it. Never get it. Were you in the waiting or was Lea in the waiting room like right at 9? Yes. Right as it happened. So, what I think happened is that everybody, she was like one of the first people there. So, then I gave her a time and then everybody else Well, no. So, I loaded in 2 minutes before 9:00. So, I was like real early and I was like, \"Yes, like I'm going to be one of the first people.\" And like, yeah, I never got a timer. I waited like 45 [ __ ] minutes and yeah, right as I got into my thing, Walmart was uh essentially like [ __ ] in the",
            "start": 722.72
        },
        {
            "text": "I'm going to be one of the first people.\" And like, yeah, I never got a timer. I waited like 45 [ __ ] minutes and yeah, right as I got into my thing, Walmart was uh essentially like [ __ ] in the bed and then was telling me that both like the bundle and the console itself was sold out. But right as that was kind of like falling apart, Best Buy um I got into like opened up the line or whatever. Like 9:20 on the dot, which is kind of [ __ ] up that they said it's going to it's going to open up at 9:00 and then they're just like, \"Oh, 9:20 actually.\" At least I mean my Best Buy waiting room just pin wheel forever. I went and took a shower and I left it on the toilet. Like you know what I mean? Like maybe that and like no I just never did. Best Buy was my last saving grace because like both Target was like that never fixed for me no matter how many times I like refreshed and re-entered in my information. Walmart kept telling me it was sold out. And then Best Buy was like, \"All right,",
            "start": 758.08
        },
        {
            "text": "Target was like that never fixed for me no matter how many times I like refreshed and re-entered in my information. Walmart kept telling me it was sold out. And then Best Buy was like, \"All right, this is my like last saving grace for the night. We'll see.\" And then it was finally like at like 10:45 uh they were like it it gave the little refresh like I was like it was my turn in line but they needed me to sign in again. Ah, y and I was like, \"Okay.\" So, they're like, \"Oh, like, you know, we'll text you to give in a login code or whatever.\" And I send I put in my number and I never get a text. And I'm like, \"Fuck.\" I like I need to think fast and Alyssa was already asleep. So, I put in her number, got her phone, and actually text her number, get that in, and then put in my card info. And then I get declined and I'm like, \"What? What?\" And then three minutes later, uh, you know, I'm still in my car. the time is ticking down, right? And then uh I finally get a text from Bank of America",
            "start": 796.88
        },
        {
            "text": "then I get declined and I'm like, \"What? What?\" And then three minutes later, uh, you know, I'm still in my car. the time is ticking down, right? And then uh I finally get a text from Bank of America that's like, \"Hey, hey, this weird activity. I don't know. You never buy things. Really [ __ ] weird.\" Uh and they're like, \"Is this cool?\" And I'm like, \"Yes, please. It's cool.\" Uh and then uh got that in and thankfully uh was able to get one after waiting for nearly. One of the things interesting I and because I got so I got this target one, I eventually got the confirmation email. I'm like, \"Okay, but obviously I want to try and everyone I could still get because I I know how this is going to go. First off, we're trying to take care of it here at the office in case you didn't need it, if somebody needs it.\" And then it's also a thing of like I'm sure my cousins are going to text me in 3 weeks and be like, \"Man, you can't can't get a switch.\" You know what I mean? My my friend back in",
            "start": 839.36
        },
        {
            "text": "somebody needs it.\" And then it's also a thing of like I'm sure my cousins are going to text me in 3 weeks and be like, \"Man, you can't can't get a switch.\" You know what I mean? My my friend back in Missouri who's got three boys who are going to want this, but doesn't understand what's going on. I eventually did get Walmart through Hooker Kirk or whatever to do it. Got it in, bought it, but then I got the email that was, \"Your delivery is canceled, Greg. We're sorry. some items you ordered exceeded our quantity limit. So, they had to cancel your orders. Like, ah, you know, that's what happened. I was able to order through Walmart. I got the confirmation, delayed, and then cancellation all within 2 seconds of each other. Yeah. And then this morning, GameStop went stop went live and it was that idea of like, I'm going to just try cuz why not or whatever. And then that was I I put I blue sky the [ __ ] GameStop.com is down. You know what I mean? It was it just completely [ __ ] the bed.",
            "start": 882.96
        },
        {
            "text": "that idea of like, I'm going to just try cuz why not or whatever. And then that was I I put I blue sky the [ __ ] GameStop.com is down. You know what I mean? It was it just completely [ __ ] the bed. an event on the road. I was like at stop lightss as I do check the internet and I was able to get in. What? You should not be doing that. Stop lights. I'm fine. It's got a mount. Sucks. That's where people get pulled over. That's how people get. I got a mount on at a stoplight. I mean, you guys realize I record Greg while I Greg Way while I drive the [ __ ] car. What? I thought that was a set. Uh, anyways though, I uh got it down and it popped and I got it into the cart on GameStop and I got to the checkout there and then it was just like that. It was like it was like every third one would crash or whatever. And so it's like it would only accept Apple Pay, but it kept crashing, crashing, crashing, and then eventually was just out of my cart, gone. It was done. Uh, so Greg, I didn't I",
            "start": 920.56
        },
        {
            "text": "crash or whatever. And so it's like it would only accept Apple Pay, but it kept crashing, crashing, crashing, and then eventually was just out of my cart, gone. It was done. Uh, so Greg, I didn't I didn't get one. I didn't get two. I got three. You know what I mean? Come on, everybody. Let's go. Uh, and I'm gonna resell all the No, I'm kidding. Joey Joey gets one. Uh, Bless gets one. I get one. And Lena got one. So, I guess the the Porny Household got four of them right there. So yeah, no, I was locked the [ __ ] in and this was my moment to shine. Uh, so I was gaming the system and I figured it out by the ending of it. A specific way to get uh Target to work. So I had the Target app going on there. Yeah, the Target app for me was like it was better in ways and was worse in ways than the than in the browser experience, right? Because I could get it in my cart, but I couldn't actually like I would go to do ad payment and it would just load and it would die and I couldn't I couldn't go",
            "start": 954.88
        },
        {
            "text": "than in the browser experience, right? Because I could get it in my cart, but I couldn't actually like I would go to do ad payment and it would just load and it would die and I couldn't I couldn't go through. Yeah. So, what I would do, I would put it into my cart through the app, then go to the computer and then check out. So, I was able to do that twice in a row. Damn. Really? Cuz I had it in the cart and I was trying to check out on the app and I couldn't do that. I was just like, \"Yeah.\" So, I was just able to like I figured it out. I was like, \"Okay, cool. I'm in the matrix.\" So, then I was also Yeah. So, we had At one point, I used my Target Circle cash or whatever. I was like, \"Take the 20 bucks off. You know that I've shopped at Target before. It's been a while, but you know that.\" Hey, come on. You know me. Come on. Put me to the front of the line. Uh, yeah. So, then we had that going. Uh, we were also on Walmart. Liam, you know me. You know me. Come on, please. I love Target.",
            "start": 999.84
        },
        {
            "text": "Hey, come on. You know me. Come on. Put me to the front of the line. Uh, yeah. So, then we had that going. Uh, we were also on Walmart. Liam, you know me. You know me. Come on, please. I love Target. Uh, we we got through a Walmart. Lana got hers through Walmart. Uh, and then I also went through Walmarts, and I got I got another one there. So, yeah, I got one through Walmart, two through a Target, and then another one through Walmart for Jason Trier, Blue Sky today that he was in line at GameStop, and he said there's they have 80 in this store and we there's only 20 of us in line. He's like, better odds than the website. Yeah. So last yesterday we're I was talking to Mike and Mike was like, \"Man, after this all shits the bed, everybody's going to line up at the Daily City GameStop. Everyone's going to be ready to go.\" And I'm like, \"Mike, I don't think that's the time anymore.\" Like, I don't think we're in this era where people are going to go outside their house and and wait on in a",
            "start": 1033.04
        },
        {
            "text": "going to be ready to go.\" And I'm like, \"Mike, I don't think that's the time anymore.\" Like, I don't think we're in this era where people are going to go outside their house and and wait on in a line just because you can just refresh on a Discord and figure out the best way to do it. Like people are that that would be going into that line would be uh the people that are on that Discord. So Mike actually did end up getting one online and then also went to a GameStop out outside and audio listener. We have the screenshot thanks to the subreddit. This man is insane. The only person out there BT dubs Mike in his camping chair in the parking lot at GameStop. Mike, you are an insane person. I love you. Shout out to me and Cody, my main man Cody number one in line right now. In line right now, Cody is in the front. I checked on him this morning. How many people are in line behind him? About 60 to 70, I would say. 130 at our local GameStop available. So, I don't think they're going to sell",
            "start": 1070.08
        },
        {
            "text": "Cody is in the front. I checked on him this morning. How many people are in line behind him? About 60 to 70, I would say. 130 at our local GameStop available. So, I don't think they're going to sell out moment of at 11:00. I think you have a little bit of playroom here, but shout out to my main man Cody. We showed up when, Roger about 10:30, 11. He said first people showed up, Mike, about 5:00 a.m. I left him at about 3 3:30. So, Mike, what did I say yesterday that you you gave me [ __ ] about? I said, when did I say people would start showing up? You did say 4 to 5. And I said, Roger, you're crazy. and Greg. Yeah. I I thought that we'd have a midnight launch release. I thought this would be the one, the last one. Yeah. I think they're dead. I think I think the midnight launch release is over. I think the biggest question I have for you right now is Yeah. You checked in on Cody. Checked in on Cody. Why aren't you there right now? Man on the street. Discord us. Why are you over there",
            "start": 1110.48
        },
        {
            "text": "over. I think the biggest question I have for you right now is Yeah. You checked in on Cody. Checked in on Cody. Why aren't you there right now? Man on the street. Discord us. Why are you over there right now? Get the second window up. Interview everybody. How they feeling? What are we excited about? Oh my god. Greg, you're a man of the people, Greg. Just walks away. I don't know if he's floating or not to give an answer. Yeah, you have you have a demo now anyway, right? Yeah, he's got a demo right now. He's wanted to come in. He just wanted to come in. But yeah, shout out to Mike for doing that cuz that is fun. I I I've always yearned for the days that you've told me about and I've seen online of like people would show up and be excited about this CRT smash being so sad at the PS4 launch because I I was there at the midnight release at a Best Buy and I was like, man, I was such a deep podcast Beyond fan back in the day and I was like, there has to be like a Beyond person. And there",
            "start": 1151.92
        },
        {
            "text": "because I I was there at the midnight release at a Best Buy and I was like, man, I was such a deep podcast Beyond fan back in the day and I was like, there has to be like a Beyond person. And there has to be people that are like deep in this. And everybody in the line is just like, I'm excited for Madden. I'm excited. Like they're just like the most normal people in the world that are not into any of this. They just want the PS4. They didn't know about Kelly. They did not know about Kelly. They didn't know about I doubt it. I didn't know about it. Um, so yeah. No, it's I think that's dead. Like we're going to People are going to be there. Of course, you say that, but there's 60 to 70 people lined up right now. Like it's still I mean it's a different kind of vibe and like I I I This is like the biggest thing in the world. Like you have too many options. you have too many options on how to get it. And I think that's the one downside. I talked about it before we went out here of like I'd",
            "start": 1191.6
        },
        {
            "text": "the biggest thing in the world. Like you have too many options. you have too many options on how to get it. And I think that's the one downside. I talked about it before we went out here of like I'd love that parallel universe where yeah, it is like for some reason online just ain't the thing. And we are broadcasting live from the parking lot right now. We've brought donuts and pizzas and we're hanging out where it's like a meet and greet, but it's all I guess I want to ask that question right for you, Greg. You are a man of the people. You you're old. You're a man of the people. Uh and you also you like that you like you like the idea of being there and giving out the donuts and hanging out, but you also watch all your movies at home. you would like the idea of movie theaters to go away so you can just watch everything at home. So like you're you're leaning into the bit a bit. Yes. I wish day and date digital existed. I don't need movie theaters to die. Yeah. But the idea being that",
            "start": 1224.8
        },
        {
            "text": "so you can just watch everything at home. So like you're you're leaning into the bit a bit. Yes. I wish day and date digital existed. I don't need movie theaters to die. Yeah. But the idea being that you like your comfort uh but you also like the idea of being with the people and hanging out. So like what where is the middle ground? Do you think this is the right way to go about this or would you I mean the the thing about this is that I can't believe it's 2025 and the dotcoms are still this bad at this where it is just anarchy. Everything's melting. Everything's I'm not a back-end tech person. I'm not just add more servers and it'll be fine. I know it's all complicated. I understand all that. But I think such a part of this is just like I know, don't get me wrong, every corporation's evil or whatever, but I know Nintendo and Amazon don't get along, but I think back to when I ordered the PlayStation 5 and it was just on Amazon. Click click. Okay, it's done. You know what I mean? Like",
            "start": 1259.68
        },
        {
            "text": "or whatever, but I know Nintendo and Amazon don't get along, but I think back to when I ordered the PlayStation 5 and it was just on Amazon. Click click. Okay, it's done. You know what I mean? Like last night I I I don't remember and maybe I'm wrong. Tell me if I'm wrong and there was a big deal with uh PlayStation 5 yada yada yada Amazon crashing or whatever. Cuz like last night I was very much like 8:55. I'm like, \"Cool, I'll be done at 9:05 and I'll go play some Monster Hunter.\" Yeah, I'll go play some Oblivion. And then you jump cut to 9:55 on Slack with you guys. I'm like, I need to [ __ ] shower. I'm exhausted. I don't want to wake Jen up showering and all this other stuff. It's just like this [ __ ] sucks. Like I can't believe that we are still the main Target and Walmart and GameStop and are just this bad at it. Like how how can we not have a system that just you go there and like you have the lines but they don't don't work for me. Like what the [ __ ] Like how are we what is",
            "start": 1300.96
        },
        {
            "text": "and are just this bad at it. Like how how can we not have a system that just you go there and like you have the lines but they don't don't work for me. Like what the [ __ ] Like how are we what is going on? And I saw somebody early before we went live. Obviously everybody was commiserating. Yeah. going on about their problems here and it was the idea of like oh man sneakerheads know this drama and it's like this so this isn't like a this is an unheard of thing like this exists how do we still not have a better system of getting online and getting in line and not everything melts down to where I don't know your credit card information I'm 404 I'm crashing I'm doing this yeah it it's a tough one especially with the scalpers right everyone coming in at the same time and all trying to vive for the same product product I don't yeah I don't think that there is to me at least for this like I expected the worst. I expected not I did not expect the 95. I expected the 11 p.m. still fighting for",
            "start": 1337.6
        },
        {
            "text": "the same product product I don't yeah I don't think that there is to me at least for this like I expected the worst. I expected not I did not expect the 95. I expected the 11 p.m. still fighting for again. Everybody's confirming. Yeah, PS5 on Amazon was fine. So, I I just got so baited by that of what the Amazon servers can do. This was my second only like midnight pre-order or, you know, like a pre-order attempt, right? And yeah, I remember the PS5 being like a little stressful leading into it because we didn't know. And then I remember that being like maybe a 15minute endeavor. It was crazy. Um, I have some super chess here. I went to Costco. I was hoping just, you know, I opened up the Costco window, put Switch in there. I was like, god damn. Yeah. No, I was actually thinking about that. I was like, what if I can just get some hot dogs and just wait at a Costco really quick? That'd be amazing. Uh Jordan Vickers uh super chats and says, \"I waited three hours in GameStop, was second",
            "start": 1377.6
        },
        {
            "text": "I was like, what if I can just get some hot dogs and just wait at a Costco really quick? That'd be amazing. Uh Jordan Vickers uh super chats and says, \"I waited three hours in GameStop, was second in line, and got my pre-orders.\" That's exciting. That's exciting. Uh, Gold uh Fish Boy uh Leit says, \"My brother and I uh both got Mario Kart World bundle.\" Hell yes. Uh, our flow says, \"Got two online at Walmart and I went uh to GameStop this morning and did it in person just in case Walmart falls through. If uh if not, it goes to a friend.\" I love this. I love that everyone's just giving it to friends and we're hanging out. We're helping this out, you know. Don't scout this [ __ ] Don't scout this. Give it to I think Yeah. I mean, for our audience in particular, I remember for PlayStation 5 and uh maybe Switch One even, it was the same deal of Reddit threads, Facebook group, whatever. You It wasn't like I'm trying to flip this for a profit. As much as I have the opportunity to be here and",
            "start": 1421.36
        },
        {
            "text": "uh maybe Switch One even, it was the same deal of Reddit threads, Facebook group, whatever. You It wasn't like I'm trying to flip this for a profit. As much as I have the opportunity to be here and get it, I'm going to get it. Yeah. Hell yeah. Uh, Pugles says, \"What feels better, Greg? Securing your switch or securing the dub to the season of Game Showdown?\" I mean, 100% the three stars and securing the dub for Game Showdown. Yeah, like I was very much like even at like 905 when everything was [ __ ] I had that thing of like, well, do I just walk away? Like I care, but not this much. And I know y'all are going to get I think this is before any of us had it. That's why I was so very committed where it was like, Tim needs to have one. Yeah. You know, Bless needs to have one. You need to have one. Like I want to make sure the Nintendo hardcore are all set for this. Yeah. Like I'm excited for a cart, but I can play. You already got one. Don't worry about it. You got one. You got one. You",
            "start": 1460.96
        },
        {
            "text": "one. Like I want to make sure the Nintendo hardcore are all set for this. Yeah. Like I'm excited for a cart, but I can play. You already got one. Don't worry about it. You got one. You got one. You got one. You got three. Yeah, but you know, he's already given them away. I need He's not even charging those people for him. He said, I like the idea of you you saying that we just get all of our switches and we just show it to Tim. We're just like, [ __ ] Tim finally got them. Uh let us continue a little bit and talk more about Oh, I want to bring up uh Daniel Ahmad on Twitter. Uh brings up this is horrible news. Yeah, it brings up the the uh the idea of talking about the servers, talking about everything melting down. Uh he says, \"All the Switch 2 bundles come with a download code. Mario Kart World is 24 GB. Most games come on a game key card and require a download. The Switch 2 launches globally on the same day. I am not a religious man, but I ask you all to pray for the eShop servers",
            "start": 1497.44
        },
        {
            "text": "World is 24 GB. Most games come on a game key card and require a download. The Switch 2 launches globally on the same day. I am not a religious man, but I ask you all to pray for the eShop servers on June 5th. That that to me was the scariest [ __ ] in the world. I was like, \"Oh, I didn't think about that side of it.\" Yeah, it's going to be very interesting on launch day to get all of our switches here and all of us be so excited and then all of us be like, \"All right, who's are we using on set to play Mario Kart?\" All right, everybody else clear the [ __ ] runway, get that on there, and then it's going to be plug it into Ethernet and hope it the stream doesn't eat [ __ ] for games daily and everything else while we try to download this thing, I assume. Right. Yeah. And who when is when is all the stuff going to come, right? Are we actually going to get it on that day? Is it going to be delayed? Exactly. Or for the Best Buy boys, we go to Sword pick it up. Oh yeah, I'm not a Best Boy.",
            "start": 1535.04
        },
        {
            "text": "all the stuff going to come, right? Are we actually going to get it on that day? Is it going to be delayed? Exactly. Or for the Best Buy boys, we go to Sword pick it up. Oh yeah, I'm not a Best Boy. So my pitch for that day, too, is maybe we delay content that day so we can go pick it up. Sure. I like that. Well, I got I think content from Best Buy. I like that. Turn on the phone Best Buy. Remember that jingle? That was That was a jingle from quite a while ago. Uh and then one more thing from Mario 64. Uh talking about pre-orders and all this stuff. My Nintendo store US update on release date delivery. Delivery by June 5th is not guaranteed. invite email may arrive after the Switch 2 launch. So, I saw some people in the comments being like, \"Hey, this is actually not like a new update.\" Like, it's just kind of like whoever's in the line, you you will get a link to buy it eventually. It just might happen afterwards. It wasn't like ever guaranteed guaranteed. Uh but either way, that",
            "start": 1575.92
        },
        {
            "text": "Like, it's just kind of like whoever's in the line, you you will get a link to buy it eventually. It just might happen afterwards. It wasn't like ever guaranteed guaranteed. Uh but either way, that does suck because I feel like that should be the way that you pre-order all this stuff. I feel like it should all should be through Nintendo. They have a system where we can figure out the scalpers. we can go straight to the people that actually want this console and we'll actually play it. Uh so the way that this is rolling out is is kind of disappointing because it seems like the lesser way to do it. It does not seem like the the instant way to actually play this cuz these are the people that actually have ESO. I mean ESO uh NSO that are actually playing the stuff, right? I don't know. Looking through all these super chats makes me so angry. Thank you all. So many super chats have done it. But like this one here, Albert had to help my daughter with a school project before her bedtime. I",
            "start": 1619.6
        },
        {
            "text": "through all these super chats makes me so angry. Thank you all. So many super chats have done it. But like this one here, Albert had to help my daughter with a school project before her bedtime. I forgot about pre-orders. Was upset. Went on Best Buy at 1050. No issues for me. Get [ __ ] Albert. What? All right. That's crazy. That's crazy. That's crazy. Just uh Justin with a an R shoved in the center. Uh Best Buy online went smoothly for me. No issues. Get out of here. Come on. I'm still I could still be in that waiting room right now. Reminds me of Switch One where I didn't even try to pre-order. I just went into the office the next day and I was like, \"Anybody got extras?\" And then the homie Alexio was like, \"Yeah, I got an extra like [ __ ] yeah. Thanks for doing the work for me.\" I I was so mad at Best Buy cuz they started kicking people from the [ __ ] queue. Yeah, that's that was the most frustrating thing. So, I was there 9:20 on the dots and then we had Lance is over my",
            "start": 1655.28
        },
        {
            "text": "I I was so mad at Best Buy cuz they started kicking people from the [ __ ] queue. Yeah, that's that was the most frustrating thing. So, I was there 9:20 on the dots and then we had Lance is over my shoulder watching and then it refreshes. I'm like, \"Oh, oh.\" And then just they just kicked me out and they did that for a bunch of people. So, that [ __ ] sucks. Best Buy. Best Buy is on my [ __ ] list, but not Target because I got two of those from there. Mikey's got a good one here. A very sweet one. My sister-in-law passed away last week. Managed to get two. Walmart and Target. Giving the other to her eight-year-old son, my nephew. He's going to be hyped. That's amazing. That's beautiful. That's a beautiful Yeah, I have not told Ben about this. I was trying to get Ben to go to bed because it was a swim night last night so he's going to bed late. So I'm in the room at like 8:20. Yeah. I'm like you. But it's like I knew if I mention this every day will be Is the switch two here yet? Is it",
            "start": 1690.8
        },
        {
            "text": "was a swim night last night so he's going to bed late. So I'm in the room at like 8:20. Yeah. I'm like you. But it's like I knew if I mention this every day will be Is the switch two here yet? Is it switch two time? It's going to be like that. Oh yeah. So what's your plan for this? Are we Are you I'm [ __ ] I'm [ __ ] Yeah. I'm [ __ ] big time on it because of course SGF is that weekend. So, we'll go to LA and we're going to play a bunch of games there, which means that I can't introduce him to it on Thursday and then take it with me for the entire weekend to SGF when I'm playing on a plane. You know what I mean? Yeah, you have to kind I think what I'm going to have to do is do the big trench coat and just hide it. I would like to, and this is without talking to Jen. Yeah. I would like to maybe that week after SGF, right? you know, he's got a second half of it there. Do a thing where I pick him up early from school, you know, and and take him home and then we just play all day long.",
            "start": 1724.48
        },
        {
            "text": "maybe that week after SGF, right? you know, he's got a second half of it there. Do a thing where I pick him up early from school, you know, and and take him home and then we just play all day long. That's awesome. I love that. So, you're getting one Switch though. Switch two. You're I mean, I would have bought two if I could have, but like Yeah, I would have done the same thing of buy two and then does anybody need one and feel it out? But I think for as hard as this has been and whatever, I'm going to keep when Mario 64 puts up this is happening, that's happening. I'm going to still keep trying to get them for the same reasons. But if I ended up with two, like inevitably this the Miller household is going to have two switches, so it'd be easier to do one. She she is very much like similar vein when we were talking about it ahead of time. I was just like, should I get one at launch? Ah, like you'll have one. She's like, I'm not going to be compelled, I think, to jump into anything. If",
            "start": 1762.64
        },
        {
            "text": "vein when we were talking about it ahead of time. I was just like, should I get one at launch? Ah, like you'll have one. She's like, I'm not going to be compelled, I think, to jump into anything. If there is, like we can obviously pass it around. You know how our lives are. It's not like I'm going to be playing Switch 24/7. I'll be on to something else to review, etc. And so on. And we'll all be playing card as a family. So that'll be fun. Yeah. Hell yeah. Hell yeah. Well, I'm sure we'll talk more about that and a lot of other stuff on the kind of funny docket, but before we do that, we'll tell you a little bit about our sponsors. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the",
            "start": 1795.28
        },
        {
            "text": "sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. the acrobatic glaive, the defensive but devastating mace and shields, and the powerfully ranged cannon. With a deep ability system, and extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for",
            "start": 1831.68
        },
        {
            "text": "combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode's brought to you by Araf Frames. If you haven't called your mom in a while, here is your reminder to do it. But then, if you want to go above and beyond, Mother's Day is coming up and I have the perfect gift idea. Our frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order",
            "start": 1882.72
        },
        {
            "text": "up and I have the perfect gift idea. Our frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Trust me, Gia's dad does. Greg and Kevin and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about two minutes to set up a frame using the Aura app and I know that from experience. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aframes.com to get $35 off plus free shipping on their bestselling Carver matte frame. That's afra. Support this show by mentioning us at checkout. Terms and conditions apply. Hi everybody. Greg Miller got so mad at me that I got three switches that he left the show. It's just going to be a oneman show",
            "start": 1928.24
        },
        {
            "text": "this show by mentioning us at checkout. Terms and conditions apply. Hi everybody. Greg Miller got so mad at me that I got three switches that he left the show. It's just going to be a oneman show today. Talking about story number two. Ghost of Yote gets a release date. Leave soon to be champs back with another iced coffee. Can he do three iced coffees to match his three stars? We'll find out. Oh my gosh. Ghost of Yote gets a release date. This is from Andrew Goldarb at PlayStation The Dark Knight of News. I love it. Uh, of course, we're going to have a Games cast after this talking all about uh our thoughts and hopes and also a trailer reaction for Ghost of Yotay. Very excited about that. The blog post reads, \"We are so excited to announce that Ghost of Yotay comes to PlayStation 5 on October 2nd, 2025. It's been nearly 5 years since we shipped Ghost of Sushima, and in that time, we've been hard at work at making Ghost of Yote something special. While the stories are unrelated, it's",
            "start": 1977.08
        },
        {
            "text": "2nd, 2025. It's been nearly 5 years since we shipped Ghost of Sushima, and in that time, we've been hard at work at making Ghost of Yote something special. While the stories are unrelated, it's important to us to make this a worthy follow-up to Jyn's journey. And we can't wait for you to experience Atsu's quest for vengeance later this year. Today, we can also reveal the pre-order that pre-orders for Ghost of Yote begin next week on May 2nd, and you'll be able to choose between multiple different editions, including our amazing collector's edition. So, of course, they have like the digital deluxe edition, uh, and a bunch of things, but I want to show off the collector's edition, which has the cool stuff. Uh, if we can look at that for a second. You're good. You're good. I'll read a little bit about it. This, uh, package includes, first of all, it's, uh, $250. Jesus Christ. $250. Uh, does it include the game? Let's see. This pack edition includes It does digital deluxe edition. You're",
            "start": 2024.96
        },
        {
            "text": "bit about it. This, uh, package includes, first of all, it's, uh, $250. Jesus Christ. $250. Uh, does it include the game? Let's see. This pack edition includes It does digital deluxe edition. You're getting the digital game. You're getting the game. uh all of the pre-order bonuses, all in-game items from the digital deluxe edition and a digital copy of the game as well as replica display edition of Atsu's ghost mask. The mask is built to scale with Jyn's mask from our Ghost of Sushima collector's edition. If you have both, they look great next to each other on a shelf. Uh and then he has the dimensions of it. But yeah, I I That's cool. That's cool. I I am This is This is like Yeah. the 250 physical. We're going to be Yeah. Here it is. Seriously insane. And I like that they have the the the par the digital deluxe edition is just 80 bucks. So you have the SE $70 game base 80 buck uh digital deluxe with some of the the bonus content you see and then this 250 physical if you're a psycho.",
            "start": 2071.04
        },
        {
            "text": "par the digital deluxe edition is just 80 bucks. So you have the SE $70 game base 80 buck uh digital deluxe with some of the the bonus content you see and then this 250 physical if you're a psycho. Yeah. In a good way. Yeah. I mean I like the mask. That's cool. So yeah, that's I mean they where do you stand on collector's editions? Like are you ever like jazzing to get one? Joan's going to get one? No. I think it's been a long long time in chat. You could probably tell me honestly you probably know better than I do over the last time I was like, \"Oh my god, a physical edition.\" Cuz I've had so many dreams come true that then end up being like, \"All right, well, I got this trash.\" You know, and I'm just I'm not a collector. I don't need things and like things. That's why I'm always for I've been about the digital res revolution for comics and games and movies for so long. It's just like I don't want a bookshelf full of plastic [ __ ] You know what I mean? Was there a moment that that",
            "start": 2114.72
        },
        {
            "text": "been about the digital res revolution for comics and games and movies for so long. It's just like I don't want a bookshelf full of plastic [ __ ] You know what I mean? Was there a moment that that changed for you? Was that like were you like ever when you were younger? Yeah, when I was a kid, of course. I think you wanted all that. And I had a bunch of statues and Superman stuff in the bubble banana cuz I could just it's all stored in my dad's attic right now, right? And then I moved to San Francisco, lived in a shoe box, had absolutely no money, and was like, I don't want my entire DVD collection there anymore. I don't want that thing. And so I'm not yucking anybody's yums if you're the opposite way of it, but it's just that thing of like I look at I it's in there's a deep therapy session here, I guess, of just like getting anything you covet eventually is just a thing. You know what I mean? But like me trying to get the Switch to will inevitably be than me playing the Switch 2 for",
            "start": 2158.32
        },
        {
            "text": "here, I guess, of just like getting anything you covet eventually is just a thing. You know what I mean? But like me trying to get the Switch to will inevitably be than me playing the Switch 2 for years and years and years. How often, how little doesn't matter, right? But it's more the fact of like I look at my shelf uh next to my uh units, right? And I have I have the few statues I have and I have like a Batman Catwoman Hush statue that I think is gorgeous, right? But I look at it and it's just like why did I spend the 200 300 whatever dollars it was on that statue? It's nice and I like it, but it was like you got it out of the box and I put it down. I'm like it's you know what I mean? And it's like I guess it's a conversation too about like you know how you lay out a room and this that and the other and where you're putting things up. But it's just like that's not something I need. So like video game collector's editions have always been that where it was like DC Universe online. I",
            "start": 2196.04
        },
        {
            "text": "and the other and where you're putting things up. But it's just like that's not something I need. So like video game collector's editions have always been that where it was like DC Universe online. I I I can't wait for this game. Yes, I'll buy the digital deluxe or the the collector's edition and then I get this not great Batman statue I didn't want and it's like on my desk at IG. Like that was I think one of the big things for me of like when I came to IGN in 2007, we were working in Brisbane in a real giant office building. So everyone had these gigantic desks. You had like privacy. We had a wall and a hutch and you watch like old Gamecube TVs and you see I have just Superman action figures and Ghostbusters [ __ ] and posters up. Then we moved downtown San Francisco's and you lost those walls. So then it was just all right, what do you want to put on your desk? So, I brought home a box of like Superman action figures, Ghostbuster, Mini Mates, all this stuff. It was just like and",
            "start": 2243.76
        },
        {
            "text": "walls. So then it was just all right, what do you want to put on your desk? So, I brought home a box of like Superman action figures, Ghostbuster, Mini Mates, all this stuff. It was just like and then eventually that all went to Goodwill or got given away and and then like to go work from home, the props became, all right, they're in the spare bedroom or they're bleeding off into the living room and everything. I don't want this crap. And like then the other the other uh office above the comic shop, we'd put it up on shelves. Nick would get mad. It's just like there's just nowhere for it to go. And then what joy is it inspiring? Now, I say all this in the I'm the guy with the fullsize Ghostbuster trap and PKs and proton packs, but like that's like my one I still do that I'll buy whatever those collectors are going to be. To jump back to video game collector's editions, I just think for the most part, and this is just me speaking, so much of it is there's usually maybe if best case",
            "start": 2289.28
        },
        {
            "text": "those collectors are going to be. To jump back to video game collector's editions, I just think for the most part, and this is just me speaking, so much of it is there's usually maybe if best case scenario something in a collector's edition that I'm like, \"Oh, that's cool. I like that one thing.\" Which is the nice part of this job of we get these collector's editions. I get to take that one thing and put the rest in the kitchen table and everybody takes what they want from it kind of thing. But I think, you know, for like Sucker Punch in particular, right, like I didn't do the Ghost of Sushima collector's edition. I don't remember what was in it. Apparently a mask. I never would have wanted that. But I did do the Infamous 2 collector's edition, right? To get that messenger bag that was there. And that was cool, you know. But eventually it got given away, right? Because it's not that great of a bag. I know. It's like cool looking, but it didn't hold as much. But they always come with",
            "start": 2325.84
        },
        {
            "text": "And that was cool, you know. But eventually it got given away, right? Because it's not that great of a bag. I know. It's like cool looking, but it didn't hold as much. But they always come with patches and and you can never justify the price of it, right? Like I always I always look at I think it was recently the um limited run of uh Yakuza because there's such little Yakuza and like a dragon merch out there that I'm like okay anytime something comes like I need to get something and then I just I look at that price I'm like I just can't justify it. You know what I mean? I know. I I I'm the same thing with you where I have my little areas of like, oh, I have like a little Yakuza, you know, DVD or whatever, Yakuza Zero from Japan. And I have like the magazine that you guys got me, which was awesome. But then I don't I don't need more things cuz I honestly my house is just full of uh Sunny Angels and uh Hello Kitty merchandise. Like that is all Leanza and it's taking up the house. Any",
            "start": 2362.88
        },
        {
            "text": "awesome. But then I don't I don't need more things cuz I honestly my house is just full of uh Sunny Angels and uh Hello Kitty merchandise. Like that is all Leanza and it's taking up the house. Any Lubu? What? Any Lubu? Oh, no. Okay. But she Yes, eventually. But no. Yeah, she's she There's been stories about people stealing Laboos off of people's persons. So, it's a big deal. Can I see a Laboo? I don't know. Yeah, let's see a Lubu. Let's see a Lubu. Oh, when we went to the mall uh uh where they sell Laboos, they were out of Luboo. I'm going to keep on saying Luboos. Uh we we walked out of the store out of the uh Pop Marta. Yeah, we walked out of the Pop Marta and then this guy just cost us. He's like, \"Hey, you guys want some Lebus? I'm selling LeBoooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo.\" And I'm like, \"No, we're good. Please, sir, walk away from me.\" What a culture San Francisco has. It's incredible stuff. It's incredible stuff. Yeah. So, no, I",
            "start": 2400.16
        },
        {
            "text": "And I'm like, \"No, we're good. Please, sir, walk away from me.\" What a culture San Francisco has. It's incredible stuff. It's incredible stuff. Yeah. So, no, I I collector's editions just don't do it for me, but I'm just not that type of gamer. I I am the digital I want that thing, the the costume, the whatever. Like, you know, the when the Monster Hunter stuff dropped this week for the Blossom Festival, right? Like, and then I immediately went to the store. I don't like the like digital deluxe editions. It makes me feel like I'm cheating. I don't like it. Yeah, there's always that part where especially Yeah. like a vowed I think did that where it was like we got the code for review it came with digital and so it's like there was like a badass sword in there and so it was that thing of like I don't want to use this cuz it's going to break the cycle of leveling in the game where all of a sudden I have the better thing the better gear I just like cosmetics I like looking cool and like",
            "start": 2440.4
        },
        {
            "text": "I don't want to use this cuz it's going to break the cycle of leveling in the game where all of a sudden I have the better thing the better gear I just like cosmetics I like looking cool and like you know really quick I I started playing uh Ghost of Shima recently and apparently the code that I had was the digital deluxe edition so they give you a special horse and every time you walk up to the horse it just says the name it says the horse it just says in parentheses digital deluxe edition like next to the horse and I'm just like [ __ ] that Uh, story number if I can. What do you think of the release date? October October 2nd. Uh, good. I mean, I that seems like the right place to do it. You just got to get it out, right? I feel like if we just keep on kicking the can eventually something else would fall there. I mean, something will Where's GTA come out? Yeah, I know. In October. Oh [ __ ] Is that the rumor? you know, well, not even the rumor, but it is one of those interesting",
            "start": 2474.32
        },
        {
            "text": "else would fall there. I mean, something will Where's GTA come out? Yeah, I know. In October. Oh [ __ ] Is that the rumor? you know, well, not even the rumor, but it is one of those interesting things of, you know, that is another more like AAA big Sony title. I don't, they probably don't know when GTA is coming out, but I feel like if you're feeling confident enough to be like, \"All right, let's put it here.\" When GTA I believe five was what, September, October? I don't know. Yeah, I don't know. We'll see. It's an interesting obviously it's still firming up. You can look ahead out there, right, and see September Hells Us on September 4th, Borderlands September 23rd, Marathon September 23rd, and then now Ghost coming in October 2. Wow, we're filling up that year. Yeah, we are starting to get some Somebody in the chat say this is GTA territory. And I just like that gives them September on GTA territory. That's why Yeah, Metal Gear Delta, right? Dropping August 28th. They're like,",
            "start": 2509.28
        },
        {
            "text": "to get some Somebody in the chat say this is GTA territory. And I just like that gives them September on GTA territory. That's why Yeah, Metal Gear Delta, right? Dropping August 28th. They're like, \"We'll give you some space there, GTA.\" It's really nice if Sony to drop this game on my mom's birthday. Oh my gosh. Oh my gosh. Happy birthday, Barrett's mom. Story number three, Until Dawn movie review with Joey Noel. Joey, so fun. Joey and I went to go see Until Dawn. We did at AMC Metreon. But yeah, you're going to talk more than Oh, the screen has everything. Oh my god. What's going on? Uh, I'm going to do a little synopsis really quick. Uh, this is for the movie. One year after her sister disappeared, Clover didn't realize that was her name. Can we talk about that? Sometimes they call her Clover and sometimes they call her Culver. Really? I feel it's very back and forth. It was very distracting the whole movie. Clover uh and her friends head to the remote valley. The remote valley",
            "start": 2555.12
        },
        {
            "text": "her Clover and sometimes they call her Culver. Really? I feel it's very back and forth. It was very distracting the whole movie. Clover uh and her friends head to the remote valley. The remote valley where she vanished to search for answers. Exploring an abandoned visitor center, they soon encounter a masked killer who murders them one by one. However, when they mysteriously wake up at the beginning of the same night, they're forced to relive the terror over and over again. Uh, this movie is currently sitting at a 58% on Rotten Tomatoes and a 53% on Metacritic. Woof woof. Not great. Joey, what did you think about this movie? Um, this movie is an Until Dawn movie in theory rather than in a potential Until Dawn game. You know what I mean? That's what it feels like. Um, it I think that if I would have gone into this not knowing the game or not expecting anything tied to the game, I would have had a better time. It's definitely more in the vein of a happy death day. It's funnier than you",
            "start": 2604.72
        },
        {
            "text": "would have gone into this not knowing the game or not expecting anything tied to the game, I would have had a better time. It's definitely more in the vein of a happy death day. It's funnier than you think it's going to be. Is it? Or did we just laugh at things that weren't actually supposed to be funny? We laughed more in this movie, I guess, is what I'm It was a mistake for us to sit next to each other because we were the only ones just dead silent and just like a line of dialogue would come out that was not meant to be funny, I don't think. But it was very funny. Very funny. Yeah. Yeah. Um, they definitely took things that are in the Until Dawn game, a group of friends, sisters, a mysterious location, but they didn't actually take any of the parts of that that we love from Until Dawn. No. Yeah. The way that I liked the premise of it again, like the idea of like them dying and then coming back to life, but I also think that this was very much an excuse for David S. Samberg, the",
            "start": 2651.36
        },
        {
            "text": "No. Yeah. The way that I liked the premise of it again, like the idea of like them dying and then coming back to life, but I also think that this was very much an excuse for David S. Samberg, the director of this movie, to then just do a bunch of different horror genres that he wanted to tackle in this one movie. Uh, it feels very disjointed. I think that's the best way to describe it because of that premise. It's a fun premise. It's it's a funny idea and it it keeps the movie going and I don't know how long the movie was, but it felt pretty short. It was like 145. It It flew by for me. I was I I was going by I was having a good enough time by the end of it where I was not like checking my watch or anything. But the weird thing about it is the best thing about the movie is the worst thing because every night they're dying and there's a new monster essentially, right? But then eventually that new monster, they have to stop doing that premise and then they're like, \"No, here's actually",
            "start": 2695.52
        },
        {
            "text": "because every night they're dying and there's a new monster essentially, right? But then eventually that new monster, they have to stop doing that premise and then they're like, \"No, here's actually the real monster of the movie.\" And they didn't have enough time to set that up because any good horror movie is one that takes its time and builds and builds and builds and then finally has the explosion at the ending, right? Where this movie doesn't really do that. It just kind of starts, stop, starts. It feels like a bunch of short films inside of this larger Until Dawn. Yeah, it gives me It's like a little bit of a Happy Death Day like we're going to die over again and figure out the It sounds so great. Yeah, it has a little bit of cabin into cabin in the woods, like a little bit meta and like things are changing and all that kind of stuff, but like it doesn't nail anything. I think the most confusing part and like maybe this is on me for not watching the trailers. chat can tell me if",
            "start": 2739.68
        },
        {
            "text": "like things are changing and all that kind of stuff, but like it doesn't nail anything. I think the most confusing part and like maybe this is on me for not watching the trailers. chat can tell me if the trailers are any different. But like I think it's a weird call to like have a group of friends like you have in the game, but have it not be any of those people. You have sisters, but it's a different dynamic and the scenario is like you have enough connections that you are leading people down one path, but then you kind of left turn immediately and you're like, \"Oh, this isn't at all what I thought it was going to be.\" Yeah. I will say the the cynical aspect of it, right, where I it is kind of like an until dawn in name only. I mean, there's connections, right? They do have connections in the movie, but there are two two. Yes. Uh, but I will say I am never going to turn my nose up at a director taking millions of dollars from uh a massive studio to do a bunch of really cool practical",
            "start": 2778.72
        },
        {
            "text": "the movie, but there are two two. Yes. Uh, but I will say I am never going to turn my nose up at a director taking millions of dollars from uh a massive studio to do a bunch of really cool practical effects. And that's what this is. Like it there's a lot of good practical effects. And if you guys should watch uh Pony Smasher is his YouTube channel, but the director David F. Sandberg started off as a YouTuber doing like short films. He did Lights Out and then Annabelle and um the Shazam movies, but he was a YouTuber first and foremost. And he did a video before this movie came out where he's like, I was just super [ __ ] excited to do practical effects. And you see you feel you feel the excitement in that and I will again this is not a bad movie. I would say this is a six out of 10. Like that's that's where I'm at. I give it two out of five on Letterbox. Okay. So a four out of 10. Damn. Yeah. I I I I thought it was totally like so much of my criticism is that it's just not until done.",
            "start": 2818.08
        },
        {
            "text": "that's where I'm at. I give it two out of five on Letterbox. Okay. So a four out of 10. Damn. Yeah. I I I I thought it was totally like so much of my criticism is that it's just not until done. Sure. And I I get that if it had a different name, I would have had more fun with it. It was funny playing watching this with Leanza who only watched Until Dawn and never watches slasher movies, but she's like, \"Man, this movie is so Until Dawn.\" I'm like, \"You're just talking about any generic slasher.\" You know what I mean? Like, so as a generic slasher film, you like it? Uh, I thought it was this is this is a movie that I would watch when I was 16 with a group by a group of my friends. We'd laugh at the entire time. Got it. Okay. It's It's totally a serviceable like put on in the background, have a a decent enough time. It's not e agregious or bad or anything. I think that there are just movies that have done that better more recently. Like Bodies, Bodies, Bodies, I think, is a better The",
            "start": 2862.0
        },
        {
            "text": "a a decent enough time. It's not e agregious or bad or anything. I think that there are just movies that have done that better more recently. Like Bodies, Bodies, Bodies, I think, is a better The writing of this movie is rough. Yeah. Um, so I Yeah, obviously as a two out of five, I didn't love it, but I hope we get a real Until Dawn movie with the characters and the scenarios and the story lines that we actually like. Yeah. Well, maybe. And maybe we'll get another Until Dawn game, and then they'll make an Until Dawn movie, too. It really does just kind of feel like we're setting up. Yeah. Yeah. Maybe we'll just do another moot game instead. Well, thank you so much, Joey. Thanks for having me. Thank you, Joey. Bye. Round of applause, Joey. No, everybody. I don't care what you say. I like her. That was supposed to be private. Story number four, unannounced Bladeunner game canled at Super Massive Games. Talking about Until Dawn. Uh, this is from Mike Straw at Insider Gaming. An",
            "start": 2897.76
        },
        {
            "text": "I like her. That was supposed to be private. Story number four, unannounced Bladeunner game canled at Super Massive Games. Talking about Until Dawn. Uh, this is from Mike Straw at Insider Gaming. An unannounced Bladerunner game that had been in development at Super Massive Games has been cancelled. Insider Gaming has learned that Bladeunner Time to Live Time was a character focused cinematic action adventure game where you are the only Bladeunner in 2065. The game would feature a 10 to 12-hour singleplayer story that per documents sent to Insider Gaming under the condition that they not be made public. Involved a compelling story blending the philosophical themes of Bladeunner with kinetic action adventure gameplay. That's cool. Uh that's me saying that the game began the article just goes, \"That's cool. That's pretty sick.\" Uh the game uh began pre-production in September 2024 with the core team comprised of those who worked on the Corey. Uh pre-production was scheduled to end in",
            "start": 2942.8
        },
        {
            "text": "goes, \"That's cool. That's pretty sick.\" Uh the game uh began pre-production in September 2024 with the core team comprised of those who worked on the Corey. Uh pre-production was scheduled to end in March 2025 with the end of prototyping by September 2025. Uh the full release was planned for September 2027 on PS5, Xbox Series X series consoles, PC, and the 10th gen Xbox and PlayStation systems. Uh really quick, what was the what was the game? A third-p person action adventure game, Bladerunner Time to Live, would see players uh play as So Lang, a vintage model Nexus 6 inexplicably still alive well beyond your limited lifespan. Quote, \"Journey from the teeming undersity of New Zurich 2065 to the eerie rem Jesus Christ.\" Eerie remnants, I got lost. I got lost. I got lost. Remnants. Oh, sorry. AR remmits and the forgotten world beyond. The description from the documents, quote, \"Under orders to retire Rev, the mysterious and ruthless leader of an underground replicant network, you are",
            "start": 2993.12
        },
        {
            "text": "AR remmits and the forgotten world beyond. The description from the documents, quote, \"Under orders to retire Rev, the mysterious and ruthless leader of an underground replicant network, you are betrayed and left for dead in a brutally hostile environment.\" Uh, and it goes on uh to say that as far as the reason for the game's cancellation, it was said that Bladeunners uh rights owners, Alcon Entertainment, is to blame. Specific details on what Alcon may have done aren't published to protect the sources of the information. It's understood that the game was canceled late last year. Two Blade Runner games in development. Huh. Yeah, there's this one or was in development. Yeah. Yeah. Yeah. And then the Annaperna one title. Interesting. Interesting. Yeah. When I saw this, I was like, is this the Annaperna one? No, it's not. This is a separate thing. Bladerunner 2033 Labyrinth. Super Massive Games just kind of interests me um as a company and like where they're going and the things that",
            "start": 3046.72
        },
        {
            "text": "the Annaperna one? No, it's not. This is a separate thing. Bladerunner 2033 Labyrinth. Super Massive Games just kind of interests me um as a company and like where they're going and the things that they're doing. This seems like it is less of a Corey situation. Maybe I don't know if it if it had combat or if it if it was more of a cuz it's just this action adventure type deal. Uh but they're doing this. They were doing this. They have directive 8020 which is it's still in the um anthology the house of Yeah, they've kind of put that at the bottom of it rather than making it a big part of it. But that's still happening. And they had a success with the quarry. They did uh the casting of Frank Stone which was the Dead by Daylight uh game. Was not good. That was not good. And then now they're doing Little Nightmares 3, which is [ __ ] bizarre. Uh, so the fact they're they were also making a Bladeunner game is just they're interesting and I I I like them a lot and I like what they do and",
            "start": 3094.4
        },
        {
            "text": "doing Little Nightmares 3, which is [ __ ] bizarre. Uh, so the fact they're they were also making a Bladeunner game is just they're interesting and I I I like them a lot and I like what they do and they clearly have found like this rhythm of making things that are cool that people like in this uh this horror genre, but it's kind of interesting that they were making a Bladeunner game that they got. Yeah, 100%. Right. I mean, you want to talk about being an independent studio and being one of those ones that's not independent in, hey, we're in a garage or we're four people who went to college together. Super Massive is a independent studio that is making a lot of games trying to make success, right? Try to keep it all going and apparently doing quite well at it because they've been around a while, right? Um, so yeah, it's interesting to see them diversify as much as you're referencing, right, with Yeah. Directive 8020 being one of these games we know them so well for, but then yeah,",
            "start": 3133.52
        },
        {
            "text": "a while, right? Um, so yeah, it's interesting to see them diversify as much as you're referencing, right, with Yeah. Directive 8020 being one of these games we know them so well for, but then yeah, Little Nightmares 3 then working on this, you I like to see them branch out. Uh, I like to see them hopefully pump their brakes. I think that's been the biggest thing, right? where the Dark Pictures Anthology we love around here, but you love knowing what you're getting. You're not going to get usually a nine, right? You're going to get something that's in those seven sixes. All right, cool. I It's a schllocky horror movie. I'm enjoying it. I'm not enjoying it. There's a bunch of technical problems or frame rate dips. Whereas wanting to see them take a break and you know, when the Cory came that was such a surprise of, hey, here is a 2K backed big budget Corey one with all the celebrities Stadia or was it supposed to be on Stadia? I forget. I forget the Stadia connection. Uh but yeah, like",
            "start": 3170.88
        },
        {
            "text": "was such a surprise of, hey, here is a 2K backed big budget Corey one with all the celebrities Stadia or was it supposed to be on Stadia? I forget. I forget the Stadia connection. Uh but yeah, like to see them take their time it seems with Directive uh and then have Little Nightmares and then even trying this even though it didn't it never came to fruition. It was never announced, right? It's more that's one of these things is a peak behind the curtain. I just hope they're doing well. I like to see them continue to be weird and do their own thing and try new stuff. Yeah. Hell yeah. But if the Bladeunner game came out, that would have been huge. Would have been huge news. But I'm tired of of everything big. [ __ ] If I It's not as easy as you make it because then I look at the thing and I'm like, what am I saying? Then it's about something whatever. If I wanted something smaller, say the tiniest news I need to know about, where would I go? You'd go to the last story, the Wii News",
            "start": 3207.6
        },
        {
            "text": "I'm like, what am I saying? Then it's about something whatever. If I wanted something smaller, say the tiniest news I need to know about, where would I go? You'd go to the last story, the Wii News Channel, where we cover all the tiny small little itty bitty news stories you need to know about. We news time, everybody. It's from Noble. Bethesda. Bethesda. Bethesda Namcom. Uh, Bethesda gave the entire Sky Oblivion modding team game keys for The Elder Scrolls 4 Oblivion Remastered. That's how you [ __ ] do it, y'all. That's how you do it. There's so much concern with the Oblivion announcement coming up for that Sky Oblivion team. All the amount of work they've put in, of course, modding Skyrim to be Oblivion. It's nice to see Bethesda still being like, \"No, y'all are cool. We're trying to take care of you.\" And then next week, they shut it down. This is your severance. By taking this, you have agreed you will stop making it. This is the fine print. Uh, LG smart TVs are now Xboxes for",
            "start": 3244.56
        },
        {
            "text": "take care of you.\" And then next week, they shut it down. This is your severance. By taking this, you have agreed you will stop making it. This is the fine print. Uh, LG smart TVs are now Xboxes for owners of LG TVs running latest webOS 24 and newer, including 2022 OLED TVs and select 2023 LG smart TVs, which received a firmware upgrade. You can download the Xbox app from the app store. I saw Paris bitching about. He's like, \"Oh, I got the C1.\" Suck your money. I don't even know which one I have. Uh, IGN. Oh, man. I can't believe they said that about me. I don't have enough Xboxes. We hate you. We hate you, Paris. I don't hate you, but I hate you. No, Paris. IGN uh says that uh EA College Football 26 has a release date of July 10th for PS5, Xbox Series, and no PC or Switch to release announcement. I'm going to be very interested to see how this one performs. Remember last year, EA College Football 25 runaway success? It was the most bestselling game of the year. Yeah, it was like it",
            "start": 3291.28
        },
        {
            "text": "I'm going to be very interested to see how this one performs. Remember last year, EA College Football 25 runaway success? It was the most bestselling game of the year. Yeah, it was like it did crazy crazy numbers because of course we had been waiting so long for another college football game. So here we are one year later, we're on this annualized track. How does this one sell comparatively? Yeah, we'll see. We'll see. And is it even, you know, is there a sizable amount of changes here that we can get excited about or people just going to be like, I already bought the game like this? I mean, my hope I bet Yeah. You know, is there something that comes to mind that you really want? You know how this always goes. It's college, the new rosters, new schools, new this. I think it'll really come down to the stuff Mike and I Mike really bang the drum bitching about last time around and criticizing. I shouldn't say bitching, but you know what I mean. But like where are the fight songs? Where",
            "start": 3343.04
        },
        {
            "text": "down to the stuff Mike and I Mike really bang the drum bitching about last time around and criticizing. I shouldn't say bitching, but you know what I mean. But like where are the fight songs? Where are the where's the pomid circumstance on that? Uh you know their ultimate team mode is it just called ultimate team? I forget. Uh you know was very lackluster and not cool. Have they gone and like put more love and care into that? There's plenty of room to improve. So, I do think that they'll be giving you the reasons of why you should care, but it'll really come down to we've added in more things, more traditions, more of this that'll be representing the even smaller schools. Put it on PC, cowards. Liam Dulan, all you want to do is play Mind Sweeper. You don't want to play. You don't want to play football. It's a good game, Greg. Uh, it is confirmed that you can use the GameCube controller with other Switch 2 games. This is directly from Nintendo through Nintendo Life. Uh, the Nintendo",
            "start": 3382.8
        },
        {
            "text": "play football. It's a good game, Greg. Uh, it is confirmed that you can use the GameCube controller with other Switch 2 games. This is directly from Nintendo through Nintendo Life. Uh, the Nintendo Gamecube controller is designed for use with the Nintendo Gamecube, Nintendo Classic, collection of games and is an optimal way, optional uh, way to play those games. Since it doesn't have all the buttons and features found in other controllers that can be used with the Switch 2 system, there may be some issues when playing with other games. The Nintendo Gamecube controller can only be used on Switch 2 and is not compatible with Nintendo Switch. Cozy Mystery Adventure Detective Dotson out on PC console version coming later this year. Previewed that uh coming out of not SGF, GDC. Yeah. Uh they also did the little thing for us one time where they animated me and Bless is an opening or whatever. I I enjoyed the I enjoyed what I played at uh GDC. So I just want to give him a shout out here. Oh",
            "start": 3420.24
        },
        {
            "text": "did the little thing for us one time where they animated me and Bless is an opening or whatever. I I enjoyed the I enjoyed what I played at uh GDC. So I just want to give him a shout out here. Oh yeah. Warorn releases in early access on June 17th. Grandma No. Watches 22nd of May on PC. I saw that press release come through like that's too good of a title for a video game for me now. Can we see a trailer? You can't you can't put in a link for a trailer. Can we see grandma know? Well, I know you're great at you always compliment yourself and how you are bringing up everything. You know what I mean? Look at that. He's got it. Super rare. Wall ride. There's grandma. She's on the phone. Grandma knows. Grandma knows that a gun. I love that we have no idea where this trailer's about to go. I'm so scared. All right, baby. Oh, they're dropping the baby off. Okay, so it's a babysitting adventure. kills the baby. From the kiddos that brought you job simulator Rick and Morty VR. Whoa. Oh, [ __ ]",
            "start": 3462.48
        },
        {
            "text": "scared. All right, baby. Oh, they're dropping the baby off. Okay, so it's a babysitting adventure. kills the baby. From the kiddos that brought you job simulator Rick and Morty VR. Whoa. Oh, [ __ ] yeah. Okay, I messed with it. I messed with it. It's a grandma simulator. Yeah, you're just grandma simulator. Oh, she gets stung by the bees. Oh, no. Whoa. Okay. A little 2D. I like that. The mail knocked her over. Robocop Rogue City. I'm asking for a code. Un Give me a code, too. Unfinished. Robocop Rogue City unfinished business. The future of law enforcement returns to duty on July 17th. I couldn't tell where this title ended or started. I think it's just called Rogue City Unfinished Business, maybe. I don't know. Um, the Pokemon Company Group announced that the next expansion for Pokemon trading card game Pocket Celestial Guard Guardians will be available around the world starting April 30th, 2025. God damn it. And the final story here, Waterfield Designs opens pre-orders for its cult",
            "start": 3501.44
        },
        {
            "text": "card game Pocket Celestial Guard Guardians will be available around the world starting April 30th, 2025. God damn it. And the final story here, Waterfield Designs opens pre-orders for its cult favorite cases, the City Slicker and Magnetic Gaming Case, each custom fitted for the new Switch 2. Every time uh I bring out my Switch or Steam Deck or whatever, somebody goes, \"Oh my god, what a great bag.\" And I always say, \"Oh, it's sfbags.com. I've been using them since the VA, and I've been using the form factor of the City Slicker case since the Vita, so I will be using this as well. Can't recommend them enough. Uh, sfbags.com. Austin T says 129 is crazy. Your money is your money. But I will call out the fact of I have the Veto one, the same leather case that it is still is in mint condition, not because I didn't use it because it's so good. Do whatever you want with it. I'm not telling you how to spend their money. But they're the ones that do the backpacks and the gaming cases and all",
            "start": 3544.56
        },
        {
            "text": "not because I didn't use it because it's so good. Do whatever you want with it. I'm not telling you how to spend their money. But they're the ones that do the backpacks and the gaming cases and all the crazy stuff that are meant to be of a nicer variety, but they always protect my stuff. This is not an ad. I just [ __ ] love sfbags.com. Yeah, we've been in the market for uh a new Switch carrier for Switch 2. So, might get that one. Looks good. And that is the end of of Wii News art. Little super chats for you. We have a lot here, so I'm not going to be able to get to all of them, but we're going to try. Uh Azie Olivo asks, \"When is Tim's open casket viewing?\" I would like to know this, too. Uh when I'm done with him on the season finale of Game Showdown, there'll be nothing left for the casket. All right. Gia doesn't need to see that. It's so true. [ __ ] What she needs to see is a real man. She'll see that when I win game showdown. I hope she's in the audience. I'll make her watch.",
            "start": 3592.8
        },
        {
            "text": "casket. All right. Gia doesn't need to see that. It's so true. [ __ ] What she needs to see is a real man. She'll see that when I win game showdown. I hope she's in the audience. I'll make her watch. Screaming off camera. Kevin's holding her back. Uh CJ Splitz on says, \"Rod, how is the game dev going?\" Uh, pretty slow. Pretty slow, but we're learning. We're learning. You still doing stuff with that? Yeah. Yeah, in the background. It's just, you know, it's a lot of [ __ ] going on, but yeah, I'm learning. It's it's it's tough. Uh, but I'm having a good time, though. That's all that matters. That's all that matters. That's all that matters. Get out there and have some good time. Uh DC uh Dcash114 says Best Buy crew can pick up at midnight. There you go. You can't no delay the content. Just go pick it up at midnight. Bang. Well, we're going to be up super late, you know, uh picking up this no sleep stream. I'm down for that. Yeah. I'm down for that. Uh damn, there's a lot of super chats.",
            "start": 3635.04
        },
        {
            "text": "pick it up at midnight. Bang. Well, we're going to be up super late, you know, uh picking up this no sleep stream. I'm down for that. Yeah. I'm down for that. Uh damn, there's a lot of super chats. Uh Riley 21 says, \"I do wish collector's editions came with steel books again or some kind of option to. I love my Destiny 2 which came with a bag that I plan on having on have the VO artists already have Nolan North. Gotcha. You're gonna get them signed. Okay, sure. That's awesome. Uh yeah, I do wish there was Steel Books never did it for and again I'm the game. Give me the physical game with it or give me like a You know what they should do which people [ __ ] hate but I would love it. Just give me a fake game. Like give me like a disc that doesn't have anything on it. Graham cracker. Oh, gracer discs you can eat. I love Yeah. Now we're cooking everybody. Now we're at Phil Spencer. That's a free idea. That's a free idea right there. DM him. Uh Barkley says, \"Roger, your your own camera",
            "start": 3673.6
        },
        {
            "text": "discs you can eat. I love Yeah. Now we're cooking everybody. Now we're at Phil Spencer. That's a free idea. That's a free idea right there. DM him. Uh Barkley says, \"Roger, your your own camera skills have grown so much this last year. Way to go, big homie. Appreciate the whole kind of funny crew.\" Thanks. That's very sweet. Thank you very much. Uh Sean McApplin as says, \"As a father to a child with Down syndrome, I recommend checking out Wildwood Down as there is a steam demo. Also, Peanut Butter Falcon is a great movie. Hell yeah. I never watched Peanut Butter Falcon. I know. Uh Kevin loved it. Yeah. Yeah. Cuz every time we play Cinny Tune Riddle, he always says, \"Panar Falcon.\" Wild Wood Down. Step into the hilariously twisted world of Wild Wild Wood Down. Jesus. A sidesplitting comedy thriller featuring a protagonist with Down syndrome. Oh. Inspired and voice acted by the dev's childhood friend. Perfect for fans of P-N-C adventure uh genre uh and newcomers looking for a heartfelt",
            "start": 3720.0
        },
        {
            "text": "thriller featuring a protagonist with Down syndrome. Oh. Inspired and voice acted by the dev's childhood friend. Perfect for fans of P-N-C adventure uh genre uh and newcomers looking for a heartfelt ride. Oh yeah. And the last one I'm going to read here is from Snow. Just took lunch to GameStop uh GameStop hop near work. Got extremely lucky. I scored one at a shopping mall. Keep trying y'all. Thank you so much for writing in. And congratulations on getting a Switch, too. If Mike wasn't so committed to doing the work I assigned to him, he would be there live right now getting a Switch. It's [ __ ] up. He has to playing games. Like, who cares? You know what I mean? Oh, I got this preview Greg booked me for. I should stay here for that, bro. We should have said, \"Hey, maybe we don't book him cuz what if we need him go to a GameStop at 11:00 a.m.?\" We need him to do that. do coverage for a console he doesn't care about. Uh I want I want that 280p shitty 3G is going to hear what we're",
            "start": 3763.84
        },
        {
            "text": "him cuz what if we need him go to a GameStop at 11:00 a.m.?\" We need him to do that. do coverage for a console he doesn't care about. Uh I want I want that 280p shitty 3G is going to hear what we're saying to him. Uh and guess what Greg? We have no you're wrongs cuz we're perfect. We're perfect everybody. Uh well everybody this has been kind of funny games daily where each and every weekday we run you through the nerdy news you need to know about live on YouTube, Twitch, and podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch us record them live and get a daily exclusive show. Enjoy the games cast next, which is going to be the ghost of Yote trailer reaction and the stream after that. But until next time, it's been our pleasure to serve you.",
            "start": 3806.32
        }
    ]
}