{
    "id": 13885,
    "video_id": "O1Mt1HYD0cA",
    "show_name": "Gamescast",
    "hosts": [
        "Blessing Adeoye Jr.",
        "Roger Pokorny",
        "Jason Schreier"
    ],
    "title": "Blue Prince: The First Game Masterpiece of 2025?! - Kinda Funny Gamescast",
    "description": "This episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nTime Stamps:\n00:00:00 - Start\n00:01:28 - Housekeeping\n00:05:06 - Blue Prince Review\n00:31:19 - What Was THE Moment?\n00:37:37- Steam Deck\n00:39:06 - Any Negatives?\n00:44:38 - SuperChats\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744053834,
    "duration": 3181,
    "transcript_chunks": [
        {
            "text": "[Music] What is up everybody and welcome to the kind of funny games cast for Monday, April 7th, 2025. I'm Roger Bourney and I'm joined by blessing Addie YoYay Jr. Good day Roger. And number one video game journalist in the world, Bloomberg's Jason Shrier. How you doing, Jason? That is offensive to Andy. I Yeah, listen. He's not here. You know what I mean? He's not hanging out with us. So, whoever's in the room first, number one. But if you guys are both on a podcast together, then we have to figure it out. We have to break the pool number. We have to break the pool queue and we you guys are fight. How you doing, Jason? How you doing? One of us can be one and the other one can be a Oh, I like that. I like that compromise right there. Compromise that. This isn't This is an exciting one. Uh, Blueprints has been in the air. It's a It's an indie game that kind of has been bubbling in the background. And after Jason Shrier's uh tweets, not tweets, blue skies, what do we call them now? Posts.",
            "start": 6.02
        },
        {
            "text": "has been in the air. It's a It's an indie game that kind of has been bubbling in the background. And after Jason Shrier's uh tweets, not tweets, blue skies, what do we call them now? Posts. Posts. Post. Yes. SK. I don't like that. I don't like the skates. Uh you you've been kind of hinting towards your thoughts and then today embargo went up and it's it seems like a game of the year contender. Seems like a game of the generation contender. So, I'm excited to talk about that. But I want to get into our housekeeping before we get into the actual review because this is the kind of funny games cast where each and every weekday we get together and talk to you about the biggest reviews, previews, and top topics in video games live on YouTube, Twitch and podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast to get all of our shows ad free. Watch us record them live and get your daily exclusive",
            "start": 55.28
        },
        {
            "text": "love what we do, support us with the kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast to get all of our shows ad free. Watch us record them live and get your daily exclusive show. for a chance to be a part of the show. Submit your thoughts and opinions as YouTube super chats as we go. Uh a little housekeeping for you. We're an 11 person business all about live gaming talk shows. KFGD was about the weird Nintendo decisions with the Switch 2 and that was also with Gary Widow. So that's a one that you got to watch and listen to. It's a great episode. Uh after this, of course, is going to be our Pokemon Nuzlocka. And this Friday, very exciting, we kick off the Elder Scrolls Online podcast, a kind of funny Games cast limited series. Uh, join Greg, Mike, Zeni, Zenamax Online Studios studio director, uh, Matt Fyro, and the, uh, Elder Scrolls Online game director, Rich Lambert, as they start an unflinching four-part show about the highs, lows, successes, and failures of",
            "start": 95.76
        },
        {
            "text": "Studios studio director, uh, Matt Fyro, and the, uh, Elder Scrolls Online game director, Rich Lambert, as they start an unflinching four-part show about the highs, lows, successes, and failures of the 10-year game. Greg calls it the deepest dive in of his career and it all kicks off this Friday as your normal games cast as well as on the Elder Scrolls Online YouTube. We never get this level of depth from developers, so don't miss it if you want to know how games really get made and keep going. This is awesome one. Uh I had the pleasure of editing some of it. And from what I've heard and talking to the developers themselves, like this is an exciting one. And as somebody who has never played Elder Scrolls, they really go deep. And it's interesting to hear like the background of like the highs and the lows. Uh and they're very candid about it. So look forward to that on Friday. If you're a kind of funny member, today's Gregway is with Mike and Chris Anka. So I'm very excited to hear",
            "start": 139.44
        },
        {
            "text": "highs and the lows. Uh and they're very candid about it. So look forward to that on Friday. If you're a kind of funny member, today's Gregway is with Mike and Chris Anka. So I'm very excited to hear about that one. And thank you to our Patreon producers Anatoli as uh Delaney Twining, Carl Car Carl Jacobs, and Omega Buster. Today we're brought to you by Better Help, but we'll tell you about that later. For now, let's start with topic of the showt. Blue Prince review. I'm gonna do a little overview summary and I'm gonna kick it to one of you. You guys can fight over who wants to give me like the actual pitch of this game. Let's just do that. I'm not going to read the summary because the summary is like weird and it's like very like it doesn't really say anything. So, like who wants to give me the pitch? I I I'll go first because I think Jason's gonna go deep because Jason's way deeper into the game than I am. Um, but I want to start with man blueprints. What a game that is after my",
            "start": 183.76
        },
        {
            "text": "me the pitch? I I I'll go first because I think Jason's gonna go deep because Jason's way deeper into the game than I am. Um, but I want to start with man blueprints. What a game that is after my heart. So, this is one where we got the codes a little bit of a while ago. Um, I got I think on day one of us having the code, uh, Greg Miller text me and he's like, \"Bloops is your type of shit.\" Yeah. And I and I thought it was just a first person puzzle game cuz if you know me, first-p person puzzle games are my [ __ ] You know, I love a manifold garden. I love an anti-chamber. I love the witness. I love games where it is just like walk around an environment and just put together the pieces of how everything works and figure out the puzzles, right? I love those kind of games. when I boot up blueprints, start playing it a little bit, and immediately it hits you with the premise of you are a kid who is tasked with um go into this manor and getting to a certain room. You got to get to room 46",
            "start": 224.8
        },
        {
            "text": "start playing it a little bit, and immediately it hits you with the premise of you are a kid who is tasked with um go into this manor and getting to a certain room. You got to get to room 46 of this manor. That's like the easy premise. That's like the the easy mcguffin. That's the goal. Yeah. Um, the twist to it is that when you enter the manor, you have three doors that you can enter and every room you enter is randomized and you draft what room you're going to go into. So, you're giving you're given three choices uh of rooms. You pick one and then you just kind of keep going with that, right? Some rooms might have one door and so you go out that door and pick another choice of whatever three rooms, but you keep going. Um, on top of that, there is a step system where uh, every single time you enter a room, you go down a step, right? And so, you start off with 50 steps. Every time you enter or exit a room, you lose a step. And so, when you lose all your steps, you get too tired and",
            "start": 262.48
        },
        {
            "text": "you enter a room, you go down a step, right? And so, you start off with 50 steps. Every time you enter or exit a room, you lose a step. And so, when you lose all your steps, you get too tired and you have to call it a day. When you call it a day, what happens is that you start over. And it's a rogike structure where you uh uh finish your day, you go back the next day, and uh, the house is starting from scratch. you then start drafting rooms again. Um, it is a puzzle game, like a first-person puzzle game, rogike slashdrafting game that is like taking these different elements of game design, putting them into one thing. And when I tell you that I'm [ __ ] obsessed with it. Uh, I'll pass to Jason in a second, but to give you my quick impressions, I've played about 16 hours of this game and it is not enough. Like the sad part for me coming into this review is that I really wanted to finish this game over the weekend and I got real close and then I just like I I wasn't able to get that",
            "start": 311.92
        },
        {
            "text": "it is not enough. Like the sad part for me coming into this review is that I really wanted to finish this game over the weekend and I got real close and then I just like I I wasn't able to get that perfect run to actually get there. The sadness that I felt when I came into the office and I said, \"You beat Blueprints.\" And you just looked at me and said, \"No.\" And I really wanted to have it beat for this review. I feel like I'm almost there, but even I think when we talked to Jason, right, like after I beat this game, I'm not done with this game. After I roll credits with this game, there's still I can still feel that there's so much for me to explore, look into, figure out. Um, but yeah, like I've only gotten to play 16 Hours cuz we had South at Midnight Review. We had the Nintendo NYC thing that we did. We had uh uh I think even First Berserker, I was still playing it. Like there's so much happening. But once I like once the hooks of this game got into me, I've not been able to let",
            "start": 355.36
        },
        {
            "text": "that we did. We had uh uh I think even First Berserker, I was still playing it. Like there's so much happening. But once I like once the hooks of this game got into me, I've not been able to let it go in the last week and I'm I'm obsessed with it. You have a score? I mean a tentative score. Yeah. On the kind of funny review score, the patented uh kind of funny review scale. This is super tentative cuz like I feel like once I actually beat the game, my score could very much very well go up. Right now I'm at a 9 out of 10. Wow. Uh it go up. Oh yeah. Wow. There's no way it's going down. Like that's the thing is this game is so my [ __ ] and I'm so obsessed with it and I think it does everything that it's doing so well, but there's still so much for me to uncover. But after 16 hours, I am leading 16 uh I am leaning towards a nine out of 10. Uh Jason, you have been Mr. Blueprints, the Blueprints himself. uh you've been talking about this game forever uh and uh you put up a few uh blue",
            "start": 393.2
        },
        {
            "text": "leading 16 uh I am leaning towards a nine out of 10. Uh Jason, you have been Mr. Blueprints, the Blueprints himself. uh you've been talking about this game forever uh and uh you put up a few uh blue skies if Bear can pull them up that I I think are incredible and you've been really talking this up. But I just want to hear your general impressions and also like let's just start off with the number that I want to hear cuz I've heard it before. How many hours do you have in this game? Yeah, so it's fun hearing Blessing talking about finishing the game. Um I have 141.5 hours. Um a lot of that. Okay, a couple things about that number. First of all, so I rolled credits at like 17 hours. So around around where you are, blessing, you probably have the credits the credits in sight. Literally, I can see the vision of like what I need to do to roll credits. Um I think when you when you roll credits, uh you will find yourself like, \"Okay, cool. I I achieve this objective of getting to room 46.\"",
            "start": 431.6
        },
        {
            "text": "see the vision of like what I need to do to roll credits. Um I think when you when you roll credits, uh you will find yourself like, \"Okay, cool. I I achieve this objective of getting to room 46.\" Cuz that's that's the objective, right? like you're trying to get to this room that seems unattainable and um because of the the story is essentially that the stipulation of your great uncle's will is that if you reach this room that seems unattainable, you will inherit the entire manor and become the new baron of Mount Holly's manor. That is the name of this this estate with its evershifting rooms. Um and so you you hit that point and you're like, \"Okay, this feels like a satisfying ending, but wait a minute, there are a few things that I'm still trying to figure out.\" out and then you might poke something here and find something here and then you might discover, oh my god, there's an entire new mystery surrounding this thing and then there's another another mystery around this thing. Um,",
            "start": 477.84
        },
        {
            "text": "something here and find something here and then you might discover, oh my god, there's an entire new mystery surrounding this thing and then there's another another mystery around this thing. Um, and I think that something it's worth saying, I haven't really articulated this elsewhere, but I think something it's worth saying is that this is a a very heavy story game. And it's kind of like the story, a lot of the story is hidden and you have to really kind of put the pieces together yourself and investigate it and become this um little amateur policeman investigator uh going around and reading books and letters and diaries and trying to figure out um the story of all these different generations of people who have lived in this house or occupied this house in some way. And that is really like one of the most appealing parts of this game is really diving into that. And that is the stuff you start to I guess get hints at when you're first trying to reach room 46, but then you can go way",
            "start": 522.0
        },
        {
            "text": "one of the most appealing parts of this game is really diving into that. And that is the stuff you start to I guess get hints at when you're first trying to reach room 46, but then you can go way deeper into after that. Would you do you feel comfortable giving it a score on our kind of funny review scale? Oh yeah. I mean, come on. This is one of the best games I've ever played in my life. Like I I just I want to be clear about that. Like there have been these periods of my life. So, I've I've I've been very privileged over the course of my career to been have been getting early codes of games and being able to play games early for a very long time now. And occasionally, you'll have this moment um where like you're playing something and you start texting with some other people who are maybe playing early copies and maybe trying to be like like try to kind of um uh let your thoughts materialize, crystallize a little bit in your head, and you'll be like, \"Holy [ __ ] like this is",
            "start": 565.12
        },
        {
            "text": "maybe playing early copies and maybe trying to be like like try to kind of um uh let your thoughts materialize, crystallize a little bit in your head, and you'll be like, \"Holy [ __ ] like this is legitimately one of the best experiences I've ever had.\" It happened to me with Breath of the Wild. It happened to me with um Elden Ring. Uh it's happened to me with a a couple other games over the years. Um and this is one of those games. This is like an alltime great. So obviously it's a 10 out of 10. Like I don't really think uh I saw a funny Reddit comment uh earlier today cuz all the reviews went up this morning. I saw a Reddit comment from someone uh and no no shade on him. I just thought this was funny. Who was like, \"This is one of the greatest games I've ever played. 90 out of 100red.\" And I thought that was pretty funny. But yeah, this is this is truly a masterpiece. Um I think it's not just the game of the year for me. It's like one of the greatest games ever made. So I and I",
            "start": 605.76
        },
        {
            "text": "And I thought that was pretty funny. But yeah, this is this is truly a masterpiece. Um I think it's not just the game of the year for me. It's like one of the greatest games ever made. So I and I think what you're saying about narrative, right? And like this is actually a narrative game is where I'm like I think my score is going to go up over time because I didn't really start caring about the game narratively until maybe my last four hours of gameplay, right? Like I very much was looking at it as background stuff cuz to Jason's point, it is very hidden and it is very obscure when you're reading a thing and it feels like you're just reading nonsense because you don't really have much of a grip of what is going on in the world, what is going on in like the family tree, who these people are. Um, and it feels like background dressing until you realize that it's not. It feels like I'm 11 hours into the game, like super early on. Like I haven't even gotten past the first main area that",
            "start": 645.6
        },
        {
            "text": "are. Um, and it feels like background dressing until you realize that it's not. It feels like I'm 11 hours into the game, like super early on. Like I haven't even gotten past the first main area that apparently opens up the rest of the game. Uh so yeah, all the story stuff that's there, I'm like I'm looking through it trying to find answers to puzzles, but I'm not looking at it as a story yet. So that's that's interesting to hear that it's such a story game. Yes. And I'm fascinated to hear what Barrett has to say because Barrett texted me over the weekend again adding to my FOMO that he beat the game. Of course. Barrett, what do you think? Uh, as someone who is not a puzzle poppy as we uh describe here, uh, I like puzzles in games. I like puzzle games. I don't really gravitate towards them. I echo everything Jason has said. There are so many moments in this that really like you think you understand the game and then something else clicks and then you have a whole new understanding of",
            "start": 687.52
        },
        {
            "text": "I echo everything Jason has said. There are so many moments in this that really like you think you understand the game and then something else clicks and then you have a whole new understanding of what you can do, what the possibilities are, what puzzles you're putting together that might not help you get to the next step of your main objective, but help in other fascinating territories that are uh spruceed throughout the game. Um I yeah, I think this this is a 10 out of 10 masterpiece. And I think that might be the first time I'm saying that on our new review scale. Um, there's so many moments that like the the other thing that like really stood out to me is how many Christmas morning moments this has where you put something together and then the solution you think is going to happen is like 10 rooms away and the anticipation of like walking back and putting something together and then like you get to unwrap the present of like, \"Holy [ __ ] I solved it.\" And it's not just a like,",
            "start": 729.04
        },
        {
            "text": "like 10 rooms away and the anticipation of like walking back and putting something together and then like you get to unwrap the present of like, \"Holy [ __ ] I solved it.\" And it's not just a like, \"Ah, [ __ ] awesome. I got this like new item or whatever. It's like you [ __ ] put that together. And that feeling is created time and time again. And I I think that mixed with the rogike nature of it uh mixed with the story that I think is Yeah. At first definitely feels very like here's a way to deliver you puzzles, but then you start putting together the more like indications of what has happened to this family. All of that mixed together, I think, is superbly done for someone who doesn't gravitate towards this genre. Um, and so for those out there who might be hesitant to try this game because they haven't they didn't gravitate towards The Witness or they didn't gravitate towards uh The Outer Wilds. I I would say you should at least check this out because I didn't either uh for those",
            "start": 776.4
        },
        {
            "text": "they haven't they didn't gravitate towards The Witness or they didn't gravitate towards uh The Outer Wilds. I I would say you should at least check this out because I didn't either uh for those games. And this is this is my The Outer Wilds. This is my The Witness. And like I absolutely adore it. Uh I posted um when I woke up this morning like it's gonna take a lot for any game to uh take away kind of game of the year crown from this game for me this year. Yeah. I think you bringing up the witness and then also talking about the Christmas morning feel, right? Like one of the things that has hit for me while playing this game on a little bit of like I guess a macro level of the way how well and how interestingly it's designed is it I'll hit a wall on a thing but have so many more options of things to do. And I want to answer a question from Chad of like what are the really good beef right says what are the puzzles what are you doing in the game right so like to break it down a little",
            "start": 824.64
        },
        {
            "text": "of things to do. And I want to answer a question from Chad of like what are the really good beef right says what are the puzzles what are you doing in the game right so like to break it down a little bit like we mentioned you're opening doors and when you open a door you're drafting rooms uh that you want to go into there are different types of rooms there are bedrooms there are hallways there are um greenhouse rooms right there are red rooms which typically have bad effects for you right but each room kind of contains uh uh different effects in different items you are picking up keys you are picking up um gems you are picking up coins. Coins you can spend on things. Uh gems help you uh unlock certain types of rooms that are a bit more of like the rarer rooms or a bit more of like the more useful rooms. Uh keys will get you into certain doors that are locked. And you'll learn about that as you play the game. But basically, you are you walk to a door, it gives you three options, and",
            "start": 871.2
        },
        {
            "text": "useful rooms. Uh keys will get you into certain doors that are locked. And you'll learn about that as you play the game. But basically, you are you walk to a door, it gives you three options, and you'll see like all right, this is a bedroom which gets me this one gets me plus 10 steps, but it doesn't have any doors and so it's a dead end. So, if I if I draft this bedroom, I know that that is like I can't go more. I can't uh continue to explore this path. Okay. Well, I have a Oh, there's a greenhouse room here. If I draft this, I'm I know I'm going to get a shovel or I know I'm going to be able to like dig dig up holes or whatever it is, right? Oh, this is a hallway and so it has many exits. And so I think the really smart thing that it does is it has kind of like a I can almost play this game on a piece of paper, right? If I drew out a grid of I like five by I don't know, let's say 5 by 10. Uh, if I drew out a five or I think it's 5 by9 technically, but if I drew out a 5 by9 grid and",
            "start": 911.68
        },
        {
            "text": "game on a piece of paper, right? If I drew out a grid of I like five by I don't know, let's say 5 by 10. Uh, if I drew out a five or I think it's 5 by9 technically, but if I drew out a 5 by9 grid and literally was just picking up cards that had different exits and different stuff, like that's kind of what the game is of figuring out what exits are going to get you into the thing that you into like to the destination that you want to get. At the same time, there's also this first person walking sim feel of like you're not playing this game on a mat. You're playing this game in first person. You're actually entering these rooms. And when you enter the rooms, sometimes you'll find surprises. Sometimes you'll find an item that lets you do things that you didn't realize that you could do, right? Like I'll find an item that is a magnifying glass. And so now I can look at pages a bit more uh uh with a bit more detail and find hidden secrets and like pages that I pick up, right? Or like I'll",
            "start": 959.6
        },
        {
            "text": "Like I'll find an item that is a magnifying glass. And so now I can look at pages a bit more uh uh with a bit more detail and find hidden secrets and like pages that I pick up, right? Or like I'll find an extra key. I'll find coins. I'll find a metal detector that'll help me find coins on the floor. Um, and so there's this like real-time effect of all right, I have this like laid out on paper puzzle that I'm solving of how to get to this place, but then at the same time I'm actually doing real exploration in these in in these spaces and I'm finding surprises and I'm finding terminals and I'm finding different things. Um, and to bring it back to the witness thing, right, like of always having something to do, there would be plenty of times as I'm playing this game where I there was a it was such a good mystery, right, where I put together this mystery that I've been trying to figure out for 25 days of this game because this game is like divided up into days. I'm on day 25 and I know",
            "start": 1000.56
        },
        {
            "text": "was such a good mystery, right, where I put together this mystery that I've been trying to figure out for 25 days of this game because this game is like divided up into days. I'm on day 25 and I know what I want to do, right? I got to go and I got to dig in this spot. All right, I got to find a shovel and I got to dig in this spot. And so I start playing as and as I'm going I am like I'm looking for spec I'm looking specifically for a shovel, but I am like finding other things where I'm like, \"Oh man, I really want to pull on thread A, but thread B is not calling my name because I am like I am I'm on the way to to to room 46.\" Like I am like, you know, barreling towards my ultimate objective. And like it's a thing of it gives you so many so many different things to pull on, so many different puzzles to solve at the same time. Um, I don't know if that makes sense. Like that brings me back to the witness kind of thing of the witness does the same thing of, \"All right, I hit a block",
            "start": 1041.36
        },
        {
            "text": "puzzles to solve at the same time. Um, I don't know if that makes sense. Like that brings me back to the witness kind of thing of the witness does the same thing of, \"All right, I hit a block here, but if I go over here, I'm going to have something else, right? Oh man, this reminds me of this thing. I'm going to go solve it over here.\" It is really satisfying to the brain. Yeah. Jason, what was it that to let me let me expand on that a little bit to try to kind of frame it for people. I think maybe the best way to think about how this game actually works and function is that you have to think about it on different layers. So on one layer is the room drafting the blessing was talking about where you have to think about your layout of the room and you have to make sure you're not getting any deadends and also you're not going to get stuck over here. You're going to have enough keys to make it all the way over here. Um you have enough gems you can draft the highowered rooms you might",
            "start": 1085.28
        },
        {
            "text": "any deadends and also you're not going to get stuck over here. You're going to have enough keys to make it all the way over here. Um you have enough gems you can draft the highowered rooms you might need over here. And then on top of that you also have all of these little other goals that you are thinking about as you go. So let me give some concrete examples of that. Right? So there's a room called the billiard room that you can draft pretty early. And in the billiard room, as you're exploring it, you'll notice that there's this dart board. And in the start board, there are a bunch of different colors and you're kind of you look at it and maybe you can interact with it. And the first time you see it, you're like, \"What is this? I have no idea.\" Okay. Then you kind of file that away in the back of your head. Maybe 20 minutes later, you get to another room where you find a piece of paper and it has a little diagram in the corner that kind of looks like the billiard room. And then you",
            "start": 1121.12
        },
        {
            "text": "back of your head. Maybe 20 minutes later, you get to another room where you find a piece of paper and it has a little diagram in the corner that kind of looks like the billiard room. And then you get the magnifying glass from somewhere else. You bring it to that room with a piece of paper. Use a magnifying glass on it. And then you see that it's explaining what to do with that dart board in the billiard room. So now you file that away too. And then now you know as you're going through this drafting process, maybe this time, maybe the next day, maybe in a future day, you know, okay, now I know next time I go to the billiard room, I know how to play around with that puzzle and interact with it better. So, think of it as kind of like um this room drafting rogike where in every room you are just kind of accumulating information and then using that to interact with in other rooms to solve just uh hundreds and hundreds of puzzles both big and small. Um the big ones are like how am I going",
            "start": 1155.2
        },
        {
            "text": "just kind of accumulating information and then using that to interact with in other rooms to solve just uh hundreds and hundreds of puzzles both big and small. Um the big ones are like how am I going to get into room 46 which seems like it's impossible to get into or like some other big things that you'll get down the road. And then the smaller ones are like how do I get into this billyard? Another good example is like there's a boiler room that you'll find pretty early in the game and the boiler room um can provide electricity to things and then you'll start to realize that some rooms actually need electricity to be used. And then as you're going through your room drafting process, you'll also be filing away in the back of your head, oh, okay, I want to draft a boiler room and I want to put it I want to connect it in some way to this other room that requires power because that will help me solve a puzzle over here. And just imagine like one of the reasons you need a notebook for this",
            "start": 1192.08
        },
        {
            "text": "it I want to connect it in some way to this other room that requires power because that will help me solve a puzzle over here. And just imagine like one of the reasons you need a notebook for this game among among there's several reasons you need a notebook, but one of them is even just to kind of file away all the goals that you want to solve on each subsequent run. And there are so many of them that like even if you get stuck on one and you're like, \"God, I found this freezer and I really don't even know what to do with it. Like I'm stuck in here. Everything seems frozen. How do I get out of how do I how do I um find all the mysteries in here?\" um you could just file that away and not worry about it for like two more hours and do other stuff. And there's so many different things you can be doing. And then on top of that, there are as you go, you'll find like all sorts of different answers to or hints at these problems. So like there's nothing in the game or almost nothing in the",
            "start": 1234.08
        },
        {
            "text": "can be doing. And then on top of that, there are as you go, you'll find like all sorts of different answers to or hints at these problems. So like there's nothing in the game or almost nothing in the game that has only one possible um answer to it. Like you'll find hints just sp like uh sprawled out throughout the entire mansion um that'll lead you down all sorts of different rabbit holes. And the rabbit holes get deeper and deeper the more you play. And like like I said before, like by the time you've reached room 46 and rolled credits, you'll still have in your notebook so many different tasks and goals and things you want to learn about or see more of that like it's really I I I will be surprised if many people stop after rolling credits because there's just so much to do and it is so eternally satisfying. I just want to say, by the way, when I said 141 hours before, like a lot of that was was spent just kind of like slamming my head against the wall trying to find uh solutions to",
            "start": 1272.72
        },
        {
            "text": "eternally satisfying. I just want to say, by the way, when I said 141 hours before, like a lot of that was was spent just kind of like slamming my head against the wall trying to find uh solutions to puzzles or like experimenting and stuff like that. But not a single one of those hours felt like it was wasting my time. And there's nothing I hate more in video games than game like when I'm feeling like, oh my god, this [ __ ] game is just throwing like filler enemies at me um to extend to like pad the the hour count. Like this is not one of those games. This is one of those games where like I have spent 141 hours on it and I do not regret a single minute of that. Like it is such a delight to play through this entire thing. And the main reason for that is because you're just constantly having so many of those um goals and just like endorphin rushes and aha moments every time you solve one of those goals and you just feel like a genius every time. and they get a lot more elaborate and",
            "start": 1319.04
        },
        {
            "text": "so many of those um goals and just like endorphin rushes and aha moments every time you solve one of those goals and you just feel like a genius every time. and they get a lot more elaborate and they get a lot trickier and it gets to the point very very deep in the game where you might want to start talking to some friends or like asking for clues elsewhere. But um most of the game you can do all by yourself and it is just so constantly satisfying uh that it's just a pleasure to play. Uh yeah, I just wanted to add like uh Jason uh kind of breaking down the puzzles. very much feels like um escape room type of things and like how things are laid out and like subtly clued into you and like trying to or you know um guide you to certain things and how you're putting things together. It feels very escape roomy in in that aspect. Also, Jason, it's funny that you mentioned the boil of the room uh being something you get early on. I don't know if you meant that in terms of you've been playing",
            "start": 1359.36
        },
        {
            "text": "escape roomy in in that aspect. Also, Jason, it's funny that you mentioned the boil of the room uh being something you get early on. I don't know if you meant that in terms of you've been playing 140 hours, but I didn't get that until like 30 30 minutes to an hour before rolling credits uh for the first time. So, I was like, ah, here's this thing that I've like other rooms have mentioned so many [ __ ] times. I have not gotten it yet. And so there again there's that fun aspect to it of as well of like the rogike kind of more random nature to it which I think sometimes felt conflicting and frustrating but for the most part I was surprised at how well um it did kind of gel together. Uh cuz I think when you try to put together a rogue light with uh puzzle uh elements that are very escape roomesque it's like how does how does that work? And it's surprising how well it's pulled off here. Yeah. So, there are a couple reasons that work, I think. One is that I mean, you you said it yourself.",
            "start": 1407.28
        },
        {
            "text": "it's like how does how does that work? And it's surprising how well it's pulled off here. Yeah. So, there are a couple reasons that work, I think. One is that I mean, you you said it yourself. You were able to get to room 46 without the boiler room. So, like the fact that there's so many different paths to accomplish all these goals, I think helps make the RNG and the randomness of it all feel less frustrating. The other thing is the more you play, the more abilities you will get um in all sorts of different ways to manipulate the RNG and like only be able to draft or like make make some of the rooms you want more common, make some of the rooms you don't want less common. You can play around with that in all sorts of different ways um as you go through the game. There's a room called the study, for example, that lets you use gems to reroll rooms. And so you can really just like keep r-rolling as long as you can find gems. And so there are a lot of kind of tips and and tricks like",
            "start": 1451.84
        },
        {
            "text": "the study, for example, that lets you use gems to reroll rooms. And so you can really just like keep r-rolling as long as you can find gems. And so there are a lot of kind of tips and and tricks like that. Um I think a good way to think of this, again, if people are just a little bit confused, I think a good way to think of this might be like a rogike where um the progression is through knowledge. So, like the best way to make it through like the the way you make it through the game is by learning things and understanding things the way you do in Outer Wilds where like if you know Outer Wilds, you finish it and you have to finish it in under 18 minutes. That's how you beat the game. And this is similar to that. There is a little bit more of mechanical stuff that just kind of carries on through. There are some things um a fair number of things actually that like uh permanently remain even as you're doing new runs. Um, there's a lot of kind of alterations you can do to the manor that",
            "start": 1491.6
        },
        {
            "text": "through. There are some things um a fair number of things actually that like uh permanently remain even as you're doing new runs. Um, there's a lot of kind of alterations you can do to the manor that will stay on indefinitely, permanently. Um, but aside from that, the more knowledge you have, the quicker it will be, the easier it will be to get through each run, the less RNG will matter to you, and the less kind of little moments of frustration that you'll have. Yeah. And I think this is one where I, as we're talking about it, I think a lot of people will be like, \"Oh, this is a big brain game. Like, you're going to need a lot of knowledge to to play this thing.\" I think the game does a really good job of the more you pick it pick it away pick away at it the more it'll give you in terms of trying to figure out what is what is going on with the thing right like I think a good example would be uh uh last week right as me and bear are having water cooler conversations about it Barrett's",
            "start": 1530.16
        },
        {
            "text": "trying to figure out what is what is going on with the thing right like I think a good example would be uh uh last week right as me and bear are having water cooler conversations about it Barrett's like have you figured out how to do this thing I'm trying to figure out like the day and time of the thing and I'm like oh yeah no I haven't figured that out yet and then as I was playing this weekend I hit a thing where I was like oh this is how you tell the time right and I text Barrett I'm like yo I figured out I didn't tell him what it was but I was like I figured it out cuz Barrett had already figured that part out, right? And then like a few hours later, I find another way to tell and I'm like, \"Oh, that's interesting.\" And then the same thing with the date where I like I found a room and I was like, \"Oh, this is where they tell you what.\" And then like a few hours later, I find another I'm like, \"Oh, interesting.\" Same with the billiards puzzle where I the way I solve the billiards",
            "start": 1571.2
        },
        {
            "text": "I was like, \"Oh, this is where they tell you what.\" And then like a few hours later, I find another I'm like, \"Oh, interesting.\" Same with the billiards puzzle where I the way I solve the billiards puzzle was like kind of just like looking around the room and being like, \"All right, this thing seems like it's pointing toward this. Let me try.\" Oh, okay. There you go. But then as I'm playing legit 10 hours later, I find like two different ways where they're like, \"Oh, no. this is exactly how to solve this puzzle over here. Yeah. I didn't even know that existed until now. I was just kind of looking around and being like, yeah, I just You thought it was just like a useless room or something? No. No. I figured it out how to do it, but I didn't realize that there was like a way to like tell you, hey, this is exactly how to do it. So, that's really cool to hear this. Yeah. This to me is like uh again, I'm only 11 hours into it, but it's like the definition of like the playground game like",
            "start": 1601.92
        },
        {
            "text": "hey, this is exactly how to do it. So, that's really cool to hear this. Yeah. This to me is like uh again, I'm only 11 hours into it, but it's like the definition of like the playground game like for me of like animal well was that last year of like talking to Andy every day and being like, \"Oh, how did you do this?\" Like, \"Oh my gosh, you found this. Oh my like this is that, but like times a million.\" It's really cool. It's crazy. Like I I talked to Bless a little bit during uh like the review period. Uh Alyssa was super busy this last week, but she had moments where she would sit down and be like, \"Yo, this game looks really interesting.\" And like kind of help me with some like logic stuff every once in a while, but for the most part, I played this on my own. And it was cool to see kind of like the final steps putting together of like, oh, I think there's like at least like 10 different ways to get to this point in the game that is like required to like, you know, uh roll credits.",
            "start": 1634.48
        },
        {
            "text": "of like the final steps putting together of like, oh, I think there's like at least like 10 different ways to get to this point in the game that is like required to like, you know, uh roll credits. And it was seeing all of that come together and having no idea how the other parts work. It's like so cool and exciting and I can't wait to hear like other people's stories on how they got to certain places. Like yeah, it's it's incredible in that way of uh being like the the schoolyard. Let's talk about all of our different experiences. It's worth noting that unlike Animal Well, where you need to work with other people to solve um the puzzles and it's kind of like deepest layer, in this game you can do everything yourself. There's no ARG aspect to it. There's no like um puzzle where every single player gets a different piece or anything like uh some of the stuff that was in Animal Well, which I love by the way, but I think some people uh felt a little bit burned by Animal Well because a",
            "start": 1667.92
        },
        {
            "text": "player gets a different piece or anything like uh some of the stuff that was in Animal Well, which I love by the way, but I think some people uh felt a little bit burned by Animal Well because a lot of the reviewers were playing in a pre-release Discord and like had a very different experience than like your average gamer is going to have. I think this is very very different. And so, like I said earlier, there is a point there was a point where I felt like, \"Oh man, I can't do this myself.\" like my brain is not big enough to be able to handle some of the stuff myself. And I started talking to some other people who were like as far as I was, which still to this day, I mean, all the reviewers that you saw, I'm sure they all got credits or like got got deep into the game, but like there are maybe three or four or five of us who have gotten like as deep as I have. Um, and it's pretty pretty wild. But like a lot of that stuff I was not able to do by myself. Not because the game forces you",
            "start": 1714.56
        },
        {
            "text": "maybe three or four or five of us who have gotten like as deep as I have. Um, and it's pretty pretty wild. But like a lot of that stuff I was not able to do by myself. Not because the game forces you to work with other people, but because I found it too difficult to work with by myself. And I think that like people will find it helpful to maybe ask for nudges and clues from friends or internet forums or Reddit or whatever. Um, if they choose to go like all the way down the rabbit hole of this game, but most of it you can do on your own and will have the best experience by doing on your own because you don't want things to be spoiled for yourself. A lot of the the enjoyment comes from the discovery of it all. I want to keep on talking about blueprints, but before we do that, remember the kind of funny membership on patreon.com/kindfunn or youtube.com/kindfunny games gets you this show ad free, but you're not watching through the kind of funny membership. So, here's a word from our",
            "start": 1752.0
        },
        {
            "text": "kind of funny membership on patreon.com/kindfunn or youtube.com/kindfunny games gets you this show ad free, but you're not watching through the kind of funny membership. So, here's a word from our sponsor. This episode is brought to you by BetterHelp. We all know that therapy can feel like a lofty investment, but we also know that there's nothing better to invest in than yourself. The state of your mind is just as important as your physical health. Let's talk numbers. Traditional in-person therapy can cost anywhere from 100 to 250 per session, which adds up fast. But with BetterHelp online therapy, you can save on average up to 50% per session. Therapy should feel accessible, not like a luxury. With BetterHel, you pay a flat fee for weekly sessions, saving you big on cost and on time. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. And it isn't just",
            "start": 1795.36
        },
        {
            "text": "of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. And it isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. Your well-being is worth it. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindafoney. better betterhelp.com/kindafoney. And we are back. Remember y'all write in with your super chats if you have any questions about the blueprints or just in general just life gaming whatever. We're here to answer your questions. Uh transitioning talking about the blueprints. I want to ask is there was there a moment without spoiling anything too heavily that it clicked for you? Right. Was there was there that specific moment that you remember or was just kind of the whole",
            "start": 1841.92
        },
        {
            "text": "want to ask is there was there a moment without spoiling anything too heavily that it clicked for you? Right. Was there was there that specific moment that you remember or was just kind of the whole experience as a whole? Barry, you want to go? You popped up. For me, it was you very early on you unlock a room. Um, and it's not really like the like puzzle clicking, but it was just something about this one cut scene you get from a room and you see yourself on a camera and you slowly point to yourself on the camera and I was like, \"This is so stupid. I love this.\" And uh not really a gameplay moment, but there was just like something with that vibe uh of the that moment in that cut scene where I was like, I'm messing with this. I don't know why yet, but I I am. Uh I'll get back to you if there was a an actual like puzzle moment where I was like, oo [ __ ] Yeah. Yeah. That's the thing is I think that there are the there are other cut scene moments that for sure had me like, all right,",
            "start": 1889.52
        },
        {
            "text": "there was a an actual like puzzle moment where I was like, oo [ __ ] Yeah. Yeah. That's the thing is I think that there are the there are other cut scene moments that for sure had me like, all right, what's what's up? Like what's going on here? And I don't want to talk to deeply about them, but yeah, I had similar ones. And then I mean I think for me immediately I was in but I think it was just the more that I played and the more I continued to just pick up new things or see rooms where I'm like oh I didn't know that there was this room in the game the game has a way of just continually unraveling and continually opening up uh opening up. And the way that Jason's talking about how like it's like there's like five people so far that are impressed that are like that deep in the well of like discovering the bulk of what the game has to offer. There was a moment uh probably halfway through my playthrough so far where I accidentally broke a thing and like not I didn't break the game, it",
            "start": 1932.8
        },
        {
            "text": "discovering the bulk of what the game has to offer. There was a moment uh probably halfway through my playthrough so far where I accidentally broke a thing and like not I didn't break the game, it was I broke an item in the game that I didn't realize was breakable and then an item fell out and I looked at it and I was like what the [ __ ] is that? And I've still not I've not been able to put that item with anything else and I didn't know that that thing was breakable. I just accidentally pointed the camera to it and then saw the icon of like, \"Oh, you break this.\" I'm like, \"What the fuck?\" Um, and it's secrets like that where I'm like, \"What is what is this leading to? Does anybody else know about this thing?\" Like, that's the thing is when we go off when we when we uh finish the show, I'm going to ask Jason like, \"Yo, do you know what this thing is?\" We we did have a whole conversation like off air just about you you'll you'll know it when you uh when you get to it. Okay. I know",
            "start": 1971.2
        },
        {
            "text": "I'm going to ask Jason like, \"Yo, do you know what this thing is?\" We we did have a whole conversation like off air just about you you'll you'll know it when you uh when you get to it. Okay. I know you're know it when you get to it. I I I finally remember like there was the moment for me like because I was already like gradually like falling in love with this game. Constantly thinking about it, constantly thinking about like do I have time to do like a run tonight or whatever. So many nights uh up until like 3:00 a.m. just getting lost in this game. Right. There was a moment, it was near the end, like my final hours uh of beating the game or beating getting the main objective where I discovered a huge puzzle that I don't think has any relation to like getting to room 46. And it again changed my like kind of understanding of the manner and uh kind of how I view it. And that was the moment where I was like, \"Yeah, this game [ __ ] This game really fucks.\" And that was like hour 14. But",
            "start": 2012.64
        },
        {
            "text": "my like kind of understanding of the manner and uh kind of how I view it. And that was the moment where I was like, \"Yeah, this game [ __ ] This game really fucks.\" And that was like hour 14. But at that point, I was already like really into it. But that just opened up this whole like Jason saying like kind of one of those Breath of the Wild moments where you're like, \"Oh my god, this is insane. I can't believe this game is doing this type of stuff.\" Oh. Uh yeah. You know what actually where early on it clicked for me was uh there's a room that you get early on in the that is the utility room. And in there there's just like a handful of switches where you can turn power on and off to certain things. And then there's like a there's another thing that I've still not figured out that involves colors that I'm sure bear and Jason know that I've still not I still don't know what that does. Um, but learning about like what I can do with those switches, again, very early puzzle in the game,",
            "start": 2057.56
        },
        {
            "text": "colors that I'm sure bear and Jason know that I've still not I still don't know what that does. Um, but learning about like what I can do with those switches, again, very early puzzle in the game, at least for me, I assume for most people will be. Um, but figuring out like, all right, if I to turn this thing on and I go over to this room over here and then press this button and then like, oh, that reveals a whole thing for me. Like, for me, that was the start of, oh, I see what they're doing here with this game. Like, this is this is deep. like this is a thing where there's a lot of interconnectivity to how a lot of the manor uh works and how a lot of the different rooms work together. Um and that was like a cool first puzzle to solve for me. How about you? How about you Jason? Yeah, I think it's some story stuff. I don't want to spoil it too much, but like there's uh a book that you can find pretty early on um by uh by an author named Marian Marold and it's called The Red Prince. And",
            "start": 2099.6
        },
        {
            "text": "it's some story stuff. I don't want to spoil it too much, but like there's uh a book that you can find pretty early on um by uh by an author named Marian Marold and it's called The Red Prince. And you look at that and you're like, \"Oh, that's funny.\" like this game is called The Blueprints and there's a book called The Red Prince. And then you read it and you're like, \"Oh, this is cute. This is adorable little children's book.\" And then maybe you find a note somewhere else that like alludes to the fact that Mary and Margold uh was pressured into changing the ending of the book and you're like, \"Oh, interesting. What's the deal with that?\" And then this starts you on this whole narrative rabbit hole where you learn what's up with all that and you learn a whole lot from there. And uh you learn a lot about the world that you live in. And uh I think it it speaks it speaks quite highly of this game that uh playing it makes me want to explore not just the manner and its surroundings but",
            "start": 2143.04
        },
        {
            "text": "learn a lot about the world that you live in. And uh I think it it speaks it speaks quite highly of this game that uh playing it makes me want to explore not just the manner and its surroundings but also the world that this all takes place in which is just phenomenal and full of lore and culture and history and um is as it's as rich as any really great novel. It it's a very literary game in a way that I really appreciate. That that for me was was what really hooked me is the narrative stuff. Like I said, it's secretly like a novel um underneath a a masterpiece of a puzzle game. Can I can I tell you, Barrett, the trailer that you just played just solved a puzzle for me? Oh, [ __ ] I'm sorry. No, no, not in a bad way. No, like this. It's like the the trailer doesn't spoil anything. It's more so like something just finally clicked. Something just clicked in my brain where I was like, \"Oh, [ __ ] That's what that thing was.\" Uh and so that's exciting for me. Also, al also I want to uh",
            "start": 2186.08
        },
        {
            "text": "more so like something just finally clicked. Something just clicked in my brain where I was like, \"Oh, [ __ ] That's what that thing was.\" Uh and so that's exciting for me. Also, al also I want to uh shout out a chat uh that came through earlier. Somebody was asking about Steam Deck. I've been playing the bulk of my uh uh game on Steam Deck. So, like during the the review process for a lot of Steam games, uh cloud saves aren't turned on yet. And so, I started playing it. I played like the first two hours on my work computer and then realized that cloud saves didn't work. And so, I was like, I'm going to start this over. Like, I think this is going to be worth me starting over. And so, I started over my Steam Deck, played about uh 14 hours on my Steam Deck, and it works pretty well. Um like there's some frame drops here and there, but for the most part, it works pretty flawlessly. And I think it's a perfect Steam Deck game because it's not it's not actiony. It's not twitchy. It really",
            "start": 2232.88
        },
        {
            "text": "there's some frame drops here and there, but for the most part, it works pretty flawlessly. And I think it's a perfect Steam Deck game because it's not it's not actiony. It's not twitchy. It really is just you walking around opening the rooms, right, and like picking things. And yeah, it's perfect on Steam Deck as far as I'm concerned. For sure. Uh I know we're talking about all the positives. Is there any negatives here? Is there anything here that you're like, I wish this game did this wrong or this differently or whatever. Is there anything that you guys can think about? I I wish you could walk a little faster. There is. You can hold the sprint button. Yeah. Well, there is that. I wish that button was a little f just a little faster. Just a little. Yeah. My only complaint um and this I imagine will be a common one is that there's no way to suspend a run. So like if you if suddenly your toddler needs you in the middle of the night or whatever and you have to stop playing, you have",
            "start": 2267.6
        },
        {
            "text": "I imagine will be a common one is that there's no way to suspend a run. So like if you if suddenly your toddler needs you in the middle of the night or whatever and you have to stop playing, you have to give up on potentially a good run, which is very annoying. There should be a way to just suspend it um and come back to it. Even if they don't want you to be able to save in the middle of runs, which I understand, there should be a suspend button, which hopefully will get patched in. That's one of the things with Steam Deck that was a benefit to where I can just put my Steam Deck on sleep mode and then come back to it later. But then also, I'm sure this would be optimized more over time where I'll turn the game back on and it that's where like it would be a bit more fraudy. And there was one run where I would open a door to a room and then like it would just be like none of the things would pop in for like a good 5 seconds and then finally the room pops in and that stabilized after a",
            "start": 2306.72
        },
        {
            "text": "one run where I would open a door to a room and then like it would just be like none of the things would pop in for like a good 5 seconds and then finally the room pops in and that stabilized after a while of playing. Um, but that's another benefit of the Steam Deck is that yeah, I was able to suspend the game a little bit. I think for me if I'm thinking of a thing that um like a downfall of it, I don't have anything big. I just have like very small nitpicks. One of them uh being that there are Jason alluded to this earlier that there are permanent things that you can like unlock slash like things that you can do uh during the game that it's like all right cool that's set now. Some of those things aren't communicated like some of them are like if you pick up an item where it's actually I don't even know if there's permanent items if a lot of the things are communicated. There are some key things where I'm like, \"Oh man, I made I did all the work to get back to here so I could do this",
            "start": 2342.88
        },
        {
            "text": "don't even know if there's permanent items if a lot of the things are communicated. There are some key things where I'm like, \"Oh man, I made I did all the work to get back to here so I could do this part of the process. I didn't realize that I only had to do this thing once.\" Yes. And that [ __ ] me on a run and it made me really upset. There like they they do such a good job of telling you very specific things of like, \"Hey, this is a permanent unlock.\" And then there are a couple of things that I noticed that like were also permanent, but that wasn't communicated. if you're going to do that and have that kind of like permanent moment like there should be a bit of a like hey this thing you just did also permanent type of thing I definitely get that frustration and there was a couple of times where I'm like I'm I just did a thing and I hope it's a permanent thing and I'm just going to assume that it is and I'm going to try doing something else going off the the fact that I am",
            "start": 2382.08
        },
        {
            "text": "of times where I'm like I'm I just did a thing and I hope it's a permanent thing and I'm just going to assume that it is and I'm going to try doing something else going off the the fact that I am starting a new day and hopefully this thing stayed the same and it's like oh thank god thank god that plus it's the thing where I don't even know if this is a nitpick or more so just like this is the way the game needs to be designed where sometimes those rooms can get kind of tough as far as like when you when you you have your three that pop up and I'm like ah damn you're not giving me many ways to like I've hit so many dead ends which is part of the experience right and then like I've also hit so many locked rooms and like I do not it's not a nitpick it's more so like I wish I was in the room for the balancing just to hear how they came down on like how they balance certain things cuz it is it a thing of like you want to push players a bit further as far as like making sure that you're",
            "start": 2422.24
        },
        {
            "text": "for the balancing just to hear how they came down on like how they balance certain things cuz it is it a thing of like you want to push players a bit further as far as like making sure that you're picking up resources like a lot more res resources earlier. Do you want to make sure that like you're really thinking you're the anxiety is on 10 for when you know you only have one path left and you might unlock like three dead end rooms and like your run is [ __ ] Um but that's just like I I think that's just the game. Yeah. And I think I from again for me 11 hours uh very early on in the game that was the only thing that was like a little bit disheartening for me of like building of building the the the perfect layouts and then just constantly being like stuck and I'm like ah I need to get better at this game but I'm like I do I have the patience right now? I don't know. I will come back to this game and I will play it. But yeah, in the early runs at least for me it became a little bit",
            "start": 2464.0
        },
        {
            "text": "better at this game but I'm like I do I have the patience right now? I don't know. I will come back to this game and I will play it. But yeah, in the early runs at least for me it became a little bit disharting and like to even like you know go against my own point that I'm making here. I there are strategies that like kind of unlock in your brain as you play of all right I'm not going to draft this room earlier because this is this room has a lot of exits so I'm going to save it to when I get further up or oh man this dead end room is really useful for the items that are in it and so I'm going to build out in a way to where I'm putting that dead end room in like a corner or something. Um, so I think that's the methodology by how they design it. But I still run into so many things where I'm like, \"Fuck, man.\" Like, there's nothing I could do about that. Come on. Come on. There are books you can find in the game called drafting guides that help you with the strategy part of it all. And",
            "start": 2502.56
        },
        {
            "text": "like, \"Fuck, man.\" Like, there's nothing I could do about that. Come on. Come on. There are books you can find in the game called drafting guides that help you with the strategy part of it all. And yes, I mean, a lot of these complaints, I think you kind of are just part of part of getting good like you're going to have frustrations as you try to get good at the game and you find out that you are not good at the game and you have to get better at it. I think uh that's inevitable with a game like this. And you definitely I mean there are definitely moments when you might feel like oh my god I I'm making no progress. But a lot of times you are making progress. It's just knowledge progress. And a lot of times um even when you feel like oh man I have such a good layout here. I don't want to draft a dead end here or whatever. A lot of times just drafting a room you've never seen before is the way to go no matter what because you will learn something new from there that could potentially",
            "start": 2541.92
        },
        {
            "text": "draft a dead end here or whatever. A lot of times just drafting a room you've never seen before is the way to go no matter what because you will learn something new from there that could potentially help you in another room that then like unlocks some crazy thread for you that sends you down a whole different direction. So, uh, again, that if you keep in mind the entire time that like as long as you gain knowledge on a run, it doesn't matter that it ended prematurely, that I think is a helpful way of of kind of approaching the game in the early stages of it. I like that. Yeah. Uh, Charlie in the chat says, \"How's the music/ atmosphere big for me in these kinds of games?\" Amazing. Yeah, I agree. 10 out of 10. Yeah, there are these music swells when you like get to something cool or something big that are just truly incredible. and the way like crazy. Sorry, go on. There's like crazy uh uh what's the instrument? It's like a bass bass sachs or something like there's some crazy crazy",
            "start": 2578.96
        },
        {
            "text": "big that are just truly incredible. and the way like crazy. Sorry, go on. There's like crazy uh uh what's the instrument? It's like a bass bass sachs or something like there's some crazy crazy instrumentals. It's it's awesome. And the way like mood shifts uh mood changes will happen depending on like a certain like room you walk through or something like it it feels so seamless and you know there will be some times where I'm just like I'm vibing out and then like a music change will happen. I'm like I'm stressed. I'm real stressed. I don't know why I'm so stressed. It's uh the vibes are immaculate. Yeah. And like I like the art style a lot too. I think at first I was like, \"All right, cool. It's a cool art style.\" But the more I played, the more I was like, \"Actually, there is something about the art that just works. It's simple, but also like I don't know. It's It's just very well done. I like looking at this game.\" Uh little super chats for you. Uh Alex Frasier uh says in super",
            "start": 2622.56
        },
        {
            "text": "about the art that just works. It's simple, but also like I don't know. It's It's just very well done. I like looking at this game.\" Uh little super chats for you. Uh Alex Frasier uh says in super chats, \"Jason, is this is this the is this one going to break my brain like Baba is?\" You did played that one from your recommen recommendation from an old uh split screen app and it defeated me. Um I would say it's not as hard as Baba is you for the most part. Again, there's some like really late highlevel stuff that I think you might need some collaboration with other people on it, but there's nothing quite like the just like nesting logic puzzles of like some endgame Baba's you stuff. Um so no, not quite to that extent. And like like we've all been saying, the first big ch a big chunk of the game is not super difficult. Like it's really satisfying and and fun and um really requires a lot of observation. I think observation it requires a lot more than like intelligence or logic or anything",
            "start": 2665.04
        },
        {
            "text": "is not super difficult. Like it's really satisfying and and fun and um really requires a lot of observation. I think observation it requires a lot more than like intelligence or logic or anything like that. There is some logic and there's some math and um but it's all pretty rudimentary stuff. I I so I would say no. In general, I think Baba isu is a much harder game. Yeah, Baba Zu is one that uh defeated me, but I kind of want to go back to because that was years and years ago and I've evolved as a puzzle Poppy over the years, Roger. I've leveled up and so I really do want to go back to Baba Zu, but I think the difference is that Baba is you like the puzzles are like these programming puzzles, right? Like that is a type of puzzle. Uh uh blueprints has a lot of different kinds of puzzles, right? And so I think in the way that if you're not great at one kind of thing, you can usually get around it by being good at like thinking in a different way or like you know you might be good at",
            "start": 2715.36
        },
        {
            "text": "right? And so I think in the way that if you're not great at one kind of thing, you can usually get around it by being good at like thinking in a different way or like you know you might be good at math or you might be good at like putting two and two together in other ways, right? Like there's so many different types of puzzles to chew on in blueprints that you're kind of always making progress. And to Jason's point, right, like you're the the game is knowledge, right? are gaining information that's going to help you figure out the next thing which is I think just inherently a bit more easier or a bit more I guess progress inducing than Bob is you where it's like yo if you don't know the solution you might you might just be stuck for a second. Yeah. Uh one last super chat uh from Devon says quick resume would be a suspend but only on Xbox of course. There you go. Uh any final thoughts as we're rounding out this episode? Uh want to go around the table and just see what you guys you",
            "start": 2756.16
        },
        {
            "text": "says quick resume would be a suspend but only on Xbox of course. There you go. Uh any final thoughts as we're rounding out this episode? Uh want to go around the table and just see what you guys you know if any final thoughts anything we missed out on? Who wants to go first, Jason? Yeah, I mean, I think everybody needs to just play this game. It's really an incredible experience. Um, I've never played anything like it or I've never had a game like really um worm its way into my brain quite like this one. For the last month, I got code. About a month ago, it has been all I can think and talk and like breathe about. Um, 141 hours. Just to put that number in perspective a little bit, that is with I was gone a week for GDC. Um I was like I was in Boston for a long weekend. That's like I I have played an obscene number of hours of this game because I just don't want to be doing anything else. Like there was one night when um I remember there was one night when I only realized it was past",
            "start": 2796.4
        },
        {
            "text": "played an obscene number of hours of this game because I just don't want to be doing anything else. Like there was one night when um I remember there was one night when I only realized it was past midnight. I usually go to bed at 10:00 p.m. cuz I wake up at like 6:00 or 6:30 cuz I have small children. Um, there was one night where I didn't I I only realized that I was up past midnight because I got the email saying that our new episode of Triple Click, our podcast had gone up when it always goes at midnight. And usually the email I wake up to that email, but this time I got that email live as it happened and I was like, \"Oh my god, like how did I stay up this late playing this game?\" Um, this is just one of those types of games. And so yeah, I mean it it wouldn't hurt to take off a couple of weeks uh if you're planning on Yeah, I mean I agree with that. There was a moment where uh during the Nintendo New York event where I'm playing I'm playing Mario Kart World and I'm playing it. I'm",
            "start": 2847.44
        },
        {
            "text": "of weeks uh if you're planning on Yeah, I mean I agree with that. There was a moment where uh during the Nintendo New York event where I'm playing I'm playing Mario Kart World and I'm playing it. I'm having a blast, but I'm like what if what if I was at what if I was at back at the hotel playing blueprints right now in the middle of the preview. In the middle of the preview, I was like thinking about blueprints. I was like putting together puzzles in my head. Um yeah. No, this is one like hearing Jason talk about it has me so excited to continue on, right? Cuz like again I'm knocking on the door of finishing the main puzzle and rolling credits hopefully. Um, but even beyond that, I'm still like there's still so much going on in the world that is being built in just this manner that like I really I I think I will also continue playing. I don't know if I'm going to get to 140 hours. Um, cuz man, you know, you know what I mean? Like I don't know if I if games, you know what I mean? Like",
            "start": 2891.6
        },
        {
            "text": "really I I think I will also continue playing. I don't know if I'm going to get to 140 hours. Um, cuz man, you know, you know what I mean? Like I don't know if I if games, you know what I mean? Like there are other things I I want to play as well, but yeah, I I I don't think most people will cuz like a lot of those hours were me smashing my head against the wall because there was nothing. Like there's no guide online and there are very few people who have gotten as far as we have. Like it got to a point uh where we were talking to like someone who had play tested the game and played hundreds of hours of it and they had been a little further than we had and that's how we got a little bit more guidance. But like most people will not have that much time because most people will not be in that situation. They'll be able to get a little bit of guidance from a friend or from the internet and so they won't have to like really slam their heads against the wall the way that I did. That is one",
            "start": 2927.92
        },
        {
            "text": "situation. They'll be able to get a little bit of guidance from a friend or from the internet and so they won't have to like really slam their heads against the wall the way that I did. That is one thing I I want to mention. Right. I remember uh when The Witness came out, there was like a podcast that mentioned this and I really took it to heart of don't look up uh online guides for this game. This is one where if you need help, you know, keep picking away. There are like books that you'll pick up that are kind of guides in this game already or talk to a friend and have water cooler conversations. I think those are the two things that you should do, right? Keep playing or talk to a friend. Um I there have been puzzle games that I play where like the moment I look up a guide, it's just it just killed the experience for me of like, damn, I cheated I cheated myself. I cheated the game. No, obviously like I would say I would say keep playing and talk to a friend until you hit a certain",
            "start": 2964.88
        },
        {
            "text": "just killed the experience for me of like, damn, I cheated I cheated myself. I cheated the game. No, obviously like I would say I would say keep playing and talk to a friend until you hit a certain point when you're like in endgame mode and that at that point you might need a little bit of outside guidance. But yeah, I mean it's better when that guidance comes from a friend who can kind of do it in an oblique way rather than just telling you the answer. Exactly. Or asking on like a receti or a Reddit or something like that where you could be like, \"Hey, like I'm I'm stuck on this blah blah blah blah.\" Um, but yeah, I mean there is a point unless you're like a super smart genius. Uh, I think most people run into a point where they need a little bit of guidance. Um, which is fine, I think. And yeah, asking a friend is the best way to go because they can kind of do it in a in a vague way where they don't actually spoil the entire experience for you. Barrett, final thoughts? Th this game",
            "start": 3000.32
        },
        {
            "text": "And yeah, asking a friend is the best way to go because they can kind of do it in a in a vague way where they don't actually spoil the entire experience for you. Barrett, final thoughts? Th this game might ruin other games for me uh just for the time being in terms of like I like we got codes a month ago as well. Uh, but yeah, I've been so busy with like uh working on this Naughty Dog video and other projects and that like I didn't start it until like a week ago. Um, and it was one of like when I like figured out the main puzzle and like knew there was so much left of the game uh past that, I was like, man, I really wish I started this earlier and had more time with just this game cuz, you know, now I'm already kind of just the nature of our work. I'm moving on to other stuff and like but all I can think about is this game and I'm like god [ __ ] it. Damn it. Like maybe I got to stop playing this other thing to go back to blueprints because I can't stop thinking about it. So, uh yeah,",
            "start": 3040.48
        },
        {
            "text": "all I can think about is this game and I'm like god [ __ ] it. Damn it. Like maybe I got to stop playing this other thing to go back to blueprints because I can't stop thinking about it. So, uh yeah, just give yourself to this game, you know, just just let it kind of wash over you a little bit. Uh and uh yeah, I think it's day one game pass and maybe PS+ so yeah, just dive in uh when it comes out later this week. Hell yeah, everybody. Blueprints coming out soon. Coming out soon. Three days from now. Three days. Oh, three days from now. Everybody check it out on Game Pass. Also on PS+ and Steam, and you can buy it everywhere else. Uh remember, this has been the kind of funny games where each and every weekday we get together and talk about all of the biggest reviews, previews, and topics in the video game space live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the Kind of Bunny membership on Patreon or YouTube to get all of",
            "start": 3086.88
        },
        {
            "text": "in the video game space live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the Kind of Bunny membership on Patreon or YouTube to get all of our shows ad free. Watch us, record them live, and get a daily exclusive show. Catch today's KFGD on YouTube or podcast services. And of course, after this, I think it's kind of funny podcast. I screwed up. Kind of funny podcast is right next after this. Uh, thank you so much for watching. Thank you so much, Jason Shrier, for hanging out with us. Jason, anything you want to talk about? Anything you want to plug? Uh, yeah. I mean, I'm going to be going way more into this game on Triple Click later this week, so people can check that out. Should be fun. Hell yeah. Everybody, until then, it's been our pleasure to serve you.",
            "start": 3129.04
        }
    ]
}