{
    "id": 13961,
    "video_id": "QnR7h1YYGpw",
    "show_name": "Gamescast",
    "hosts": [
        "Tim Gettys",
        "Andy Cortez",
        "Barrett Courtney",
        "Roger Pokorny"
    ],
    "title": "Clair Obscur: Expedition 33 Review - Kinda Funny Gamescast",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\n00:00:00 - Start\n00:01:00 - Housekeeping: Today no KFGD, and After this is a very special Gamescast Motohide Eshiro Onimusha 2 \nThen In Review Alien and Predator: Prometheus\nToday’s Gregway Video Game Console Launch HORROR Stories is 23 minutes\nFriday, the Elder Scrolls Online Podcast - A Kinda Funny Gamescast Limited Series is BACK with episode 2!\nThank you to our Patreon Producers: Anatolii Ast, Delaney Twining, Karl Jacobs, & OmegaBuster\n00:05:05 - Topic of the show: Clair Obscur Expedition 33 Review\n00:06:00 - Barrett’s review  \n00:09:00 -  Andy's review\n00:11:00 - Roger’s review\n00:16:22 - Tim’s Thoughts\n00:26:55 - Ads\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745432708,
    "duration": 3828,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome to a kind of funny games cast that I am incredibly excited for uh both as a host and as a listener of what is about to go down today because we are doing the CLA obscure expedition 33 review. Of course, I am your host Tim Gettys. I'm joined today by a rare appearance on the desk by Barrett Courtney. Hold me back, Tim. Hold me back, Tim. Cuz all I want to do is turn this games cast around and turn it into a screencast cuz I want to talk about Andor so goddamn mad. We have to wait till tomorrow. We have to wait for tomorrow for Andor. Here's the deal, everybody. Andor is dropping three episodes a week uh for the next four weeks. And uh that's a lot of pages of notes, Tim. I'm excited. I'm very excited. But we're not going to be reacting uh we're not going to be doing the screencast the day after. It'll be either the the next day or even the following day depending on the week depending on our schedules. We're going to try our best to get all done. It's a lot",
            "start": 0.18
        },
        {
            "text": "the screencast the day after. It'll be either the the next day or even the following day depending on the week depending on our schedules. We're going to try our best to get all done. It's a lot of it's a lot of Star Wars content every week. It'll be tomorrow that we're talking about on all of that. Andy though, how are you? Uh I'm I'm doing great. Tim, you've I mean you really [ __ ] up putting game of the year uh episode yesterday instead of today. I loved it. You know what I mean? I loved us having to talk on that episode. Just be like, \"Yeah, this is where we're at.\" Just knowing that this episode was coming and of course rounding out a group today it is the taste maker Roger Porn. Hi everybody. No, don't do that. I don't like that. I don't like that. Uh but I do like this kind of cast. You know what I mean? Um this is the kind of funny games cast. Each and every weekday we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch,",
            "start": 56.8
        },
        {
            "text": "You know what I mean? Um this is the kind of funny games cast. Each and every weekday we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the kind of funny membership on Patreon, YouTube, Spotify, or Apple podcast to get all of our shows ad free and you get a daily exclusive Gregway. For a chance to be part of this show though, please submit your thoughts and opinions as YouTube super chats as we go. So, if you have any thoughts about any of our experience with Clare Obscure Expedition 33, please get those in. Little housekeeping for you. We are an 11 person business all about live talk shows. Today there's no kind of funny games daily because we're doing a very special double dose of kind of funny games cast. Uh we had the embargo for this. We were all so excited about the game that we wanted to be as close to it as possible. So we wanted",
            "start": 100.96
        },
        {
            "text": "we're doing a very special double dose of kind of funny games cast. Uh we had the embargo for this. We were all so excited about the game that we wanted to be as close to it as possible. So we wanted to get that out. But also uh the embargo dropped for a interview that I got to do uh with Moto Ishro, the director of Animusha 2, uh both the original PlayStation 2 game and the upcoming remake. So u I'm very very honored, very excited. This is one of those like holy crap lifetime. can't believe I'm doing this type things. Um, how how fast was your heart beating at like the beginning of it? Like how bad were the nerves? I was very nervous. This was one of those ones I was like out of my comfort zone for sure. I was talking to Roger about it for like a week just letting him know how like, hey, we're doing this, you know, but hey, we made sure to support you. Everyone here supported me as well as they possibly can. Um, and I just want to let everybody know that even if you're not interested",
            "start": 140.8
        },
        {
            "text": "we're doing this, you know, but hey, we made sure to support you. Everyone here supported me as well as they possibly can. Um, and I just want to let everybody know that even if you're not interested in this, please watch it. Watch it live. You're not going to want to miss it. It's a good show. It uh has some twists and it has some turns that you won't expect. And I just promise you, you're gonna want to watch this one. We'll talk about Ghost of Yote getting a PlayStation blog release date tomorrow tomorrow on Games Daily. But you're going to want to watch this one all the way through live to the very end. Uh but then after that, the day is not over. We're returning to Alien and Predator in review with Prometheus, a movie I'm very excited to talk to the boys about. If you're a kind of funny member, today's Greg way is video game console launch horror stories. It's 23 minutes of Greg going through some of his worst gaming moments. I gotta watch that one. Uh then this Friday, The Elder",
            "start": 181.28
        },
        {
            "text": "member, today's Greg way is video game console launch horror stories. It's 23 minutes of Greg going through some of his worst gaming moments. I gotta watch that one. Uh then this Friday, The Elder Scrolls Online podcast, the kind of funny Games Cast limited series is back with episode two. Uh super cool because, you know, we we don't often get to do a lot of developer stuff here at Kind of Funny, but whenever we do, it's very special. So to get both the Oni Musha 2 thing and even more of The Elder Scrolls Online this week is very special. I I watched that episode uh yesterday, and it's a great episode. They really go so super in depth about the highs and a lot of the lows uh and kind of a second introduction to Elder Scrolls Online with the console release. So really good stuff. The entire series [ __ ] great. Yeah. Oh yeah, you ran this. You I I directed the the episodes and as someone who has no intention of ever playing this game, it's like it's really fascinating stuff. So make",
            "start": 224.4
        },
        {
            "text": "series [ __ ] great. Yeah. Oh yeah, you ran this. You I I directed the the episodes and as someone who has no intention of ever playing this game, it's like it's really fascinating stuff. So make sure to tune in when episodes drop. So you can check all of that out on the Games Cast feeds or even on Bethesda's YouTube on Friday. Thank you to our Patreon producers, Anatoli asked, Deli Twining, Carl Jacobs, and Omega Buster. Today, we're brought to you by Imperial and Aura Frames, but we'll tell you about that later. We got to get into it. The topic of the shows, Claire Obscure Expedition 33 is upon us. This is a game that uh we first saw last year. Game Awards, I think. So, Summer GameFest, perhaps. Summer Game Fest. I want to say it was Summer GameFest and uh we looked at it, we're like, \"Wow, that looks like incredibly ambitious.\" Uh we heard Ben Star's voice in it. We're like, \"Wa, this looks so cool.\" But we had a lot of doubts, you know? We were like, \"Okay, the more we heard about",
            "start": 261.68
        },
        {
            "text": "that looks like incredibly ambitious.\" Uh we heard Ben Star's voice in it. We're like, \"Wa, this looks so cool.\" But we had a lot of doubts, you know? We were like, \"Okay, the more we heard about it, like, it's a $50 title. It has a very small team. Um it looks beautiful. There's a lot going on. Unreal Engine 5. Can they pull this off?\" Developer Direct also like made me even more nervous just to realizing how small this team is. this being their first uh game together as a team. Um seeing all of the different inspirations they're pulling from, can they live up to all of that? It was the Xbox showcase during uh Summer Gamefest last year. That makes sense. Uh so yeah, that that was not that long ago. Less than a year ago, we first heard about this game. Now we have played this game. The three of you have beat this game. Correct. Correct. I have not. I am woefully early in the game just due to how busy I've been. And I hate that because every single free moment I've had, I've been",
            "start": 312.0
        },
        {
            "text": "three of you have beat this game. Correct. Correct. I have not. I am woefully early in the game just due to how busy I've been. And I hate that because every single free moment I've had, I've been playing this game. And every moment that I haven't been free, I've been thinking about wanting to play this game. I absolutely adore this thing so much. There's so much about it that I absolutely love. And I can't wait to hear you guys talk about everything about it and to see if it all continues to be as good as it has been to me so far. I love it so much that even 10 hours in, I was like, \"Fuck this. I need to pre-order a physical copy of it.\" I want to support this team. This game is fantastic. So, uh, that is my my my very quick thoughts on it. Uh, cuz I have not beat the game yet, but I This is one of those ones that I'm like, this is for me. I didn't I I couldn't rush it for the review, but also I'm not going to. Good for you. I'm going to play this game and see it to the end. I am",
            "start": 353.84
        },
        {
            "text": "This is one of those ones that I'm like, this is for me. I didn't I I couldn't rush it for the review, but also I'm not going to. Good for you. I'm going to play this game and see it to the end. I am enthralled. But enough about that. Who wants to start off with their official review on the kind of funny scale of Clear Obscure Expedition 33? I'll start. Barrett wants to start cuz I I feel like I was one of the more vocal doubters of this game. Uh especially learning how small this team was after the developer direct. Like I I I think we knew how small they were before that. But you weren't the biggest doubter though. I'll talk about it. I'll talk about it. Maybe I was justified. You know what I mean? Let's talk about it. Uh and yes, especially seeing like all of the different games that they're pulling from uh feel it wears a lot of its inspirations on its sleeve. I know, you know, um a lot of like Final Fantasy 8 inspiration in terms of like world map kind of stuff or 10 in terms of",
            "start": 397.44
        },
        {
            "text": "pulling from uh feel it wears a lot of its inspirations on its sleeve. I know, you know, um a lot of like Final Fantasy 8 inspiration in terms of like world map kind of stuff or 10 in terms of story and combat. Yeah. Yeah. Um um and then like Persona in terms of like uh mainly just like presentation in combat for the most part. Um and then also twitchy uh action games as well. And it's like how is this all going to come together? And you know, I will gladly eat crow on my doubt. Uh uh what it's um fire what's the dev's team uh dev team Sandfall Interactive. This team should be incredibly proud of this first title that they've made together. This is a nine out of 10 amazing game. Um it really goes for a lot of bold swings that I think make it stand out in a lot of ways in terms of storytelling and world. And then in terms of gameplay, this is like one of the most satisfying combat systems I've interacted with in a long time. Um, it being turnbased, but it also being kind of akin to a",
            "start": 440.08
        },
        {
            "text": "and world. And then in terms of gameplay, this is like one of the most satisfying combat systems I've interacted with in a long time. Um, it being turnbased, but it also being kind of akin to a Mario RPG or Mario Paper Mario, right? In terms of timing on making your attack stronger or uh parrying and dodging to uh completely kind of uh negate damage from enemies. A lot of that is uh very intense, but it comes together in a very satisfying way. Um I think so there are some things that I have a little gripes with that like really hold it back from being like a masterpiece uh to me, but I think for a first game from this team um for a game to come out less than a year after Metaphor Refantasio for it to stand out in so many ways with it being similar weirdly in in some ways as well. Um, I I I think this is a fantastic game. People should absolutely uh pick it up this week uh and try it out. Andy Court says, \"Uh, yeah, I'm right there with Barrett. I think that this game could have just",
            "start": 493.12
        },
        {
            "text": "I think this is a fantastic game. People should absolutely uh pick it up this week uh and try it out. Andy Court says, \"Uh, yeah, I'm right there with Barrett. I think that this game could have just set us all up for a disappointment and really bummed us out because of how incredible it looked for those first few showings visually and what it was doing uh with combat.\" And I mean, I have great news for a lot of people. They made turn-based combat good finally. Guess what happened? What about created to be on this episode? Took them 50 years. You know what I mean? Metaphor. No. Um, no. But for real, for real. It's, uh, god damn. Like the I'm saying this right now. I need people to already start, you know, drumming up support for not only a lot the voice cast fantastic. Jennifer English knocks it out of the goddamn park. Shadow Cox as well. Everybody's just so damn good. Um, but art direction, this game needs to win everything art direction wise. I can't believe I or just it needs to be",
            "start": 549.12
        },
        {
            "text": "it out of the goddamn park. Shadow Cox as well. Everybody's just so damn good. Um, but art direction, this game needs to win everything art direction wise. I can't believe I or just it needs to be nominated. It's such a incredibly imaginative game in every sort of level and every area you're at is just so pretty to freaking look at. Uh, and I would say sound design cuz damn when you when you nail those parries and when you nail those counters. But uh but maybe not implementation of sound design because sometimes it's like goddamn going to go deaf with how like much you're ramping up the the volume in this part. Just tune it down a couple decibels, you know, a couple dBs here and there, but um like even some of the crazy attacks, it um the true souls fans will know this, y'all. You know, when you roll into a shitload of jars and it's the same sound effect playing over each other a million times, like whenever there's a lot of parries and attacks, you'll get like that. It starts to get",
            "start": 603.04
        },
        {
            "text": "you roll into a shitload of jars and it's the same sound effect playing over each other a million times, like whenever there's a lot of parries and attacks, you'll get like that. It starts to get crunchy. Yeah. And it's like, oo, I don't like you almost like popped his little speaker right there. Um, but the game is just a a phenomenal experience. I I want more. I can't wait to go back to it. Uh, I want to play it on the harder difficulty. It's just Yeah, I want to go back to New Game Plus. so much fun and so great. And I I think early on, even in my first 5 hours, first four or five hours, I was just like, \"Wow, I I haven't felt this way about a narrative in a long time in a video game.\" Like, I haven't really kind of been this gripped by an experience um in in a good while, and I really really enjoyed my experience with it. I would give this uh a 9 out of 10 as well. Amazing experience. Oh my god, this makes me this makes me so happy because like internally with where I'm at now,",
            "start": 652.64
        },
        {
            "text": "really enjoyed my experience with it. I would give this uh a 9 out of 10 as well. Amazing experience. Oh my god, this makes me this makes me so happy because like internally with where I'm at now, I'm like this is an eight out of 10 that I [ __ ] love. But oh my god, hearing this for you guys, this is fantastic news. Roger Piccorn, take us home. You know, I'm the biggest hater of Expedition. No, I I count I counterpicked this game. Uh because how many times have we heard the story, right, of a small team of XAA devs that come together and they're like they're shooting above their weight class, right? They're like, \"Hey, we have all these inspirations. here's a trailer for our game. It looks amazing. It's like, okay, preview of the game feels good, but like how is the actual full game going to feel? So, I took the risk and I bet against this small team and I am so happy that I was completely wrong. Uh this game is really really great. Uh it is uh not only a story that resonated with",
            "start": 700.4
        },
        {
            "text": "to feel? So, I took the risk and I bet against this small team and I am so happy that I was completely wrong. Uh this game is really really great. Uh it is uh not only a story that resonated with me. Uh I have some not gripes, but just the where we ended with the story I don't think hit as much as the journey to the ending, if that makes sense. Interesting. Uh but the gameplay blew me away. I mean, I'm with Andy, right? I'm not necessarily a turnbased person. Turn-based combat is kind of a turnoff. Uh, mostly, I mean, that was kind of a a miracle that Metaphor pushed past it with the story and everything to get me to a place where I love that game so much and made it a 10 out of 10 for me. But the way that they mix the turnbased elements of it with the parrying system, it's almost like a rhythm game. Like, I'm I was literally playing rhythm heaven in order to get better at this game because my rhythm is so bad. Uh, yeah, it it pushed me to become better. It pushed me to uh really fall",
            "start": 743.04
        },
        {
            "text": "game. Like, I'm I was literally playing rhythm heaven in order to get better at this game because my rhythm is so bad. Uh, yeah, it it pushed me to become better. It pushed me to uh really fall in love with each of the characters and not not only in terms of the story, but also in terms of their gameplay structure and the way that each of the uh individual characters work. Uh I by the ending of it, I was able to okay, well, this character does this thing. Okay, well now I'm going to play differently and adjust everything about my perks and the way that I uh uh go through a story battle and change my team up. Like I was so deep in the Duffy that I even with Metaphor, I was not like that. I was like just rolling the same characters and I was just praying to God that it would work out. I was so deep in in it with with this. Something I just want to shout out before I lose this thought is like it's so impressive how fun they make each character with all of their different abilities cuz",
            "start": 785.92
        },
        {
            "text": "so deep in in it with with this. Something I just want to shout out before I lose this thought is like it's so impressive how fun they make each character with all of their different abilities cuz yeah, usually in an RPG, you know, you love your crew, you love the entire crew, but you know the four, you know, like who you're rolling with for pretty much the entire game. And it was very impressive how much I was actually changing team compositions to fit a battle uh or to uh you know just go out and grind a little bit and like prioritize other people just cuz it was fun just to play it with all of these different character styles. Yes. Uh so overall this this game is really great. There's a lot of little things that I think have added up on top of me not hating the ending at all. Like I I really enjoyed the story. it just didn't emotionally impact me as much as the journey to the ending of it. Uh so that mixed with the little things uh gets me to a really great video game. So that's an",
            "start": 825.52
        },
        {
            "text": "enjoyed the story. it just didn't emotionally impact me as much as the journey to the ending of it. Uh so that mixed with the little things uh gets me to a really great video game. So that's an 8.5 for me. Okay. I could see a lot of moments where two months down the line where we see a lot of games kind of act games as servicey where they they can iron out some of the small little nippics I have uh just mechanics wise. There's a couple moments where I'm trying to fast travel back to a spot. It's like I got to run through this area again because I had to go back to my camera. So, it's like I could see little things like that getting getting ironed out just uh some quality of life stuff. But, um yeah, that's that's kind of where I'm at. Where you at? Oh, sorry. Oh, sorry. Uh really quick just for um just to kind of hammer this point home of just like how much this feels like other things but still feel feels uniquely itself. Uh Maria on Blue Sky uh posted it. It's like the turn-based uh",
            "start": 869.52
        },
        {
            "text": "for um just to kind of hammer this point home of just like how much this feels like other things but still feel feels uniquely itself. Uh Maria on Blue Sky uh posted it. It's like the turn-based uh gameplay and UI of Persona 5 was mixed with the pairing importance of Seiro and the atmosphere of the Near series. And even then, there's so much that's unique to Clare Obscure. I'm dead serious when I say please do not look up on anything story-wise before playing, which I would hammer home as well. Like the story is goes in places that I was not expecting. And like in the first 8 hours, I was like this is like a good solid thing. I'm kind of like confused on the tone of the game a little bit. I think the onboarding into the world is a little weird, but once you get to kind of like one of the first major beats, it's just all gas, no breaks from there on out. And it's really impressive how they were able to keep that up for 30 hours essentially. I I do think that a word that's come up a",
            "start": 912.48
        },
        {
            "text": "first major beats, it's just all gas, no breaks from there on out. And it's really impressive how they were able to keep that up for 30 hours essentially. I I do think that a word that's come up a couple times is unique. And that is something that is so appealing to me about this game where you can compare it style-wise to a lot of things or or even gameplay-wise to this or that or the inspirations are clear in so many ways. But I really think that in almost every single one of those ways, it rises above to be its own thing. And there's something about like Andy brought up the art direction and of course the stylish uh battle system and all the UI is just super cool to look at and all of that. And also pretty easy to look at as well. Not perfect. I think some of the menus can get a little bit uh cumbersome and overwhelming mainly because there's a lot of fake words, you know what I mean? And having to remember what is what. Like that can get a little hard. But um still absolutely",
            "start": 956.24
        },
        {
            "text": "bit uh cumbersome and overwhelming mainly because there's a lot of fake words, you know what I mean? And having to remember what is what. Like that can get a little hard. But um still absolutely stunning and never not fun to look at. Uh to me the thing that impresses me so much is the fashion sense of this game and like the kind of world fashion even like it that to me is so unique and like there's somebody there that has like a a sense of art design and character design and costume design that is so next level and unlike anything I've ever but that's the thing though is it's like I I we don't see this in games, right? Like whether like whether this is a brand new unique thing or this is how the Frenchies are dressed, they're nailing it. And I think that that goes so far. You can use the word Frenchie. Well, like I don't know. Can you not? Whatever. I'm sure I'm related to some French person at some point. [ __ ] fine with it, you know. But uh either Hey, I'm giving them compliments.",
            "start": 997.52
        },
        {
            "text": "word Frenchie. Well, like I don't know. Can you not? Whatever. I'm sure I'm related to some French person at some point. [ __ ] fine with it, you know. But uh either Hey, I'm giving them compliments. They dress great. They dress great. Um, but what I uh I keep saying this, but like this game story-wise and character-wise, it reminds me of Final Fantasy 10 with a different fashion sense. And that is like such a amazing compliment cuz like I think they look so damn sick in this game. Yeah. Yeah. Uh yeah. In terms of also Final Fantasy, I think like one small thing is uh world navigation was one thing that kind of held me back of like this game reminded me a lot of the Final Fantasy remake games in terms of like hey here let's uh you know oh you want to get up that cliff let's have you like kind of slowly jump from like little like grab hold to little grab hold. I think like exploring around can feel a little bit weird but then they also like to bring it back to a compliment. They also",
            "start": 1041.44
        },
        {
            "text": "kind of slowly jump from like little like grab hold to little grab hold. I think like exploring around can feel a little bit weird but then they also like to bring it back to a compliment. They also kind of lean into it and have fun with it like uh you know the there is some small platforming and that's really just like here's a really big platform jump to this other big platform and it feels a little stiff and stuff like that you know it feels like Kingdom Hearts it it it feels a little bit by like Kingdom Hearts and then you go out and explore the world and then I stumbled upon you know an only up challenge in the middle of this game and it was like oh they knew what they had here in terms of what this game feels like because it does kind of feel like only up and then there's just like, \"Yeah, do this only up challenge.\" And again, that's a gameplay uh side quest fun thing to show off just like how weird this uh this game gets with everything. Um, but it feels earned. Something you",
            "start": 1088.08
        },
        {
            "text": "\"Yeah, do this only up challenge.\" And again, that's a gameplay uh side quest fun thing to show off just like how weird this uh this game gets with everything. Um, but it feels earned. Something you brought up to me, uh, talking about like the jumping and and kind of movement in this game, uh, was the how the climbing feels very similar to Final Fantasy 7 where there's all these just like kind of like grapple holds and you just jump to it and you hold left and it just jumps to the next and it feels very PS1, but it looks very PS5. Uh, and that is it's funny because like I I find that charming. I don't find that bad. Like it's it's funny that like kind of even making the the jumping from climbing on mountains even simpler than an Uncharted or something like that, try to not make it look like this beautiful cinematic thing, instead making it kind of feel more classic JRPG, I feel really adds to the the novelty of this. But I I will say that there's like I can maybe count the amount of",
            "start": 1130.24
        },
        {
            "text": "this beautiful cinematic thing, instead making it kind of feel more classic JRPG, I feel really adds to the the novelty of this. But I I will say that there's like I can maybe count the amount of times that you're climbing on stuff in on two hands. Like I I I think early on there are a lot of like kind of those little lattery moments, but I expected them to be in every level all of the time non-stop. And like it doesn't happen as much as I thought it would cuz they will sometimes replace it with the uh that little uh when you shoot up like that, you know, you're kind of like teleportation rope or whatever. Yeah. Whatever that is. But like I I think early on I thought I was going to be climbing non-stop in this game. I felt like I was it. No, I I guess not not me. I I didn't really feel like it was happening as much as I thought it would be like I would in a Jedi survivor or something like that, you know? And that's what I felt about a lot of the smaller negatives about like the",
            "start": 1170.88
        },
        {
            "text": "like it was happening as much as I thought it would be like I would in a Jedi survivor or something like that, you know? And that's what I felt about a lot of the smaller negatives about like the gameplay and the map and all that. We had a lot of conversations, Tim, you and I, about the fact that there is no map in any of the specific worlds that you're in, right? there's an over map for, you know, the entire uh world, but when you're in like an area, there's no map of like, hey, here's what how any of this works. And for me, I got lost like a few times, right? But it never like hindered my experience. It is something that I noted and I was like, I wish there was a map. That would be nice. But it didn't like stop me dead in my tracks and made me feel like, oh man, this game needs a map. And the same thing with the climbing, right, where I was like, ah, it's it's whatever. I could take it or leave it. It didn't like it didn't feel like it was happening all the time for me. Yeah.",
            "start": 1222.0
        },
        {
            "text": "map. And the same thing with the climbing, right, where I was like, ah, it's it's whatever. I could take it or leave it. It didn't like it didn't feel like it was happening all the time for me. Yeah. They're just like kind of little like, hm, okay. like I could see already see the tweaks of whatever they want to do for a followup to this game. You know, there's absolutely no HUD. I think that's kind of like where it begins and ends where it's like there's no map, there's no compass, there's no little thing at the top like showing any type of direction at all. Um, clearly a choice. I don't think it was the right choice and maybe I'm just a complete [ __ ] idiot. directions horrible. And I'm not saying it's not, but I legitimately have wasted at least 3 hours in this game running around thinking that I'm looking at the same portal, but it was actually the portal on the other side of an area and everything just looked so similar. Granted, there's reasons for it, I guess, like in terms of",
            "start": 1258.48
        },
        {
            "text": "that I'm looking at the same portal, but it was actually the portal on the other side of an area and everything just looked so similar. Granted, there's reasons for it, I guess, like in terms of what that area was without spoiling anything. Still, I wasted my time like and it's like I would have rather not do that, but definitely sounds more like a me problem than to the extent that you guys had. The only negative just here, right? because there's so much positives here. I just I just want to get it all out. The only other negative that I want to want to say is I do think this game does need some type of restart the boss fight because this game is so not just the boss fight, just fights in general. Just fights in general. Yeah, just because this game is so based on parrying like you have to learn how to precisely parry every enemy and every enemy is unique, right? They have different u parrying uh time windows that you have to focus in on. You basically for every boss battle I've had",
            "start": 1295.68
        },
        {
            "text": "to learn how to precisely parry every enemy and every enemy is unique, right? They have different u parrying uh time windows that you have to focus in on. You basically for every boss battle I've had to fight them at least twice to three times, right? just to get it and understand it in order to beat the boss. So, it is grueling and annoying when you you you're on the first one, you do really well and then you're like, \"Okay, cool. I have to restart it, go to the start from the checkpoint and walk all the way to the person and then restart and then have to deal with all their animations.\" Like, we need to get back skip through cut scenes over and over again. Stuff like that. Yeah, I think with this this is like one of the main reasons of like why I to me even though I nine out of 10 I think this is an amazing game. You should absolutely pick it up and support this in studio. It was one of those like, man, this is rough for this game to come out so soon after Metaphor cuz Metaphor",
            "start": 1332.56
        },
        {
            "text": "think this is an amazing game. You should absolutely pick it up and support this in studio. It was one of those like, man, this is rough for this game to come out so soon after Metaphor cuz Metaphor introducing that mechanic of like for different reasons that game if you go into a fight not paying attention and even a little unprepared, it's like, oh, you're [ __ ] up in like 30 seconds and then they introduce a thing that was like hit L3 to restart the battle. I think some circumstances might change a little bit in terms of like RNG stuff and I felt myself so many times instinctually doing that in this game because yeah it it the flow of this game is very interesting and again unique uh because it feels so it feels very souls like it feels very uh action uh from soft like where a lot of your time grinding is more so learning and recognizing these new enemies that you're being introduced to in a new area. And I want to point out something real quick before we lose it. Nice blight",
            "start": 1370.16
        },
        {
            "text": "of your time grinding is more so learning and recognizing these new enemies that you're being introduced to in a new area. And I want to point out something real quick before we lose it. Nice blight says, \"Oh, I'm out. I'm not a Perry Poppy.\" They have a story mode. They do have a story mode and I highly recommend it. Uh just cuz I think this game is amazing. You should absolutely check it out. Like uh but yeah, this game is tough. But uh I think with that comes like a weird pacing balancing in terms of exploration and uh fighting enemies. Um that I don't know. I I I really wish I think that little addition could have helped a lot in terms of exploring around and becoming familiar with stuff and not having to do the runup to a boss every time. And sometimes like the auto save being really weird where like right before let's say like I just died from an optional boss and I'm like, \"All right, I need to change my load out. Cool. I changed it.\" And then I go fight the boss and then the",
            "start": 1414.96
        },
        {
            "text": "weird where like right before let's say like I just died from an optional boss and I'm like, \"All right, I need to change my load out. Cool. I changed it.\" And then I go fight the boss and then the auto save brings me back to right before I changed my party dynamic and I'm like, \"Ah, [ __ ] come on, man.\" Uh, so there's just like little things like that that it feel a bit rough, but despite that amazing wish, I wish that they rendered their pre-rendered cut scenes at a higher resolution. Oh, that's like that's like one only one of my main things cuz there there's not a whole lot of them. Granted, they do a lot of real-time cutscenes so that you see your characters with their hair, with their outfits, and you know, lot the little customizations like that. Um, and they always look great cuz I think that the game fidelitywise is unbelievably stunning to look at, but then it'll every once in a while, maybe like five times throughout the whole my, you know, 27 hour experience will cut to a",
            "start": 1461.52
        },
        {
            "text": "I think that the game fidelitywise is unbelievably stunning to look at, but then it'll every once in a while, maybe like five times throughout the whole my, you know, 27 hour experience will cut to a pre-rendered cut scene and it it looks like it's in 480p and it's rendered really nicely. Obviously, they put, but you know, it's like, y'all heard of AV1? Like that's me. You know, I'm sure like, you know, cut scenes are going to add a shitload more to file size, and I understand all that, but uh it it was always kind of a bummer running into those because of how much muddier the experience looks. Also, if you're going to do like the custom outfits and stuff or cutscenes, do it for the full game, not for like two or three cutscenes that are like more important story mode. Like, let me see my my customized characters and my group and all this stuff. It's very weird to be like, \"Oh, I guess that's what this person is supposed to look like, and I haven't seen that in 20 hours.\" It's so",
            "start": 1504.48
        },
        {
            "text": "my my customized characters and my group and all this stuff. It's very weird to be like, \"Oh, I guess that's what this person is supposed to look like, and I haven't seen that in 20 hours.\" It's so weird. Uh, so, and you just said 27 hours your time with this game. You roll credits. Roger. 23 24 around there. Yeah. 32. I did a lot of side stuff uh at the end that I was trying to get these two to to do before uh uh Embargo, but I know it was a kind of a uh they're trying to get it. I ended up doing the like the more the real important ones near the end. Okay. Yeah. There's like and that's the other like just to give another compliment is like everything feels so important in this world and how it all ties together in really in really cool ways I was not expecting this game to do and I found myself just even after finishing the game doing so much around the world just to get more out of stories or characters uh even knowing what the resolution was all going to be. It it's it's really",
            "start": 1549.36
        },
        {
            "text": "myself just even after finishing the game doing so much around the world just to get more out of stories or characters uh even knowing what the resolution was all going to be. It it's it's really cool what they are able to do with this world. Yeah, man. I can't wait to keep talking about it. Can't wait to keep playing it. Uh, but we're going to have to wait to do that after a word from our sponsors. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins. as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be",
            "start": 1595.92
        },
        {
            "text": "ruins. as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. the acrobatic glaive, the defensive but devastating mace and shields and the powerfully ranged cannon. With a deep ability system, and extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful",
            "start": 1636.8
        },
        {
            "text": "by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode's brought to you by Araf Frames. If you haven't called your mom in a while, here is your reminder to do it. But then, if you want to go above and beyond, Mother's Day is coming up and I have the perfect gift idea. Our frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Trust me, Gia's dad does. Greg and Kevin and a ton of people",
            "start": 1686.08
        },
        {
            "text": "it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Trust me, Gia's dad does. Greg and Kevin and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about two minutes to set up a frame using the Aura app. And I know that from experience. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aframes.com to get $35 off plus free shipping on their best-selling Carver matte frame. That's afra. Support this show by mentioning us at checkout. Terms and conditions apply. Joe Henry liked my tweet. It's pretty cool. He believes in you. He believes in me. He believes in you. He's such a handsome man. If I feel like if I were a 65year-old mother, I would just be like, \"What a handsome young man that is.\" What's a handsome young boy that is? I would like pinch his cheeks. You're a handsome young fella. You know, even the",
            "start": 1732.72
        },
        {
            "text": "a 65year-old mother, I would just be like, \"What a handsome young man that is.\" What's a handsome young boy that is? I would like pinch his cheeks. You're a handsome young fella. You know, even the granny's believe. Everyone, we got some super chats I want to get to uh to inspire some conversation here. Uh cognitive clip says, \"Clear obscure hype. Let's go. Uh Tyler Pace says, \"This game looks absolutely amazing. I still can't believe Roger got slapped on a plane.\" That that made me laugh right before I had to go up and I was like, \"That's that's incredible.\" These days you wouldn't though. You're so good at pairing now. You have just popped up there with that. Um they still haven't messaged me by the way. Jet Blue, you know what I mean? They just never never mess anything. Wow. Uh Relish Police says, \"Anyone try on cloud? Thinking about input timing.\" I did. Uh I play played probably a few hours in cloud. I mean, you can figure it out. You can get there, especially if you play it on",
            "start": 1781.6
        },
        {
            "text": "Police says, \"Anyone try on cloud? Thinking about input timing.\" I did. Uh I play played probably a few hours in cloud. I mean, you can figure it out. You can get there, especially if you play it on easy. Cuz the basically the big thing about story mode is that doesn't necessarily make like the enemies weaker or anything like that. It gives you a little bit like they're higher timing. Yeah, higher timing and then they they're a little bit weaker when they when they attack you. So, yes. Yeah, you can you can play on cloud. You can figure it out. Um, something I want to talk about is the the party because I've been very fascinated so far with not just the characters and like how the stories and dynamics, which I'm very obsessed with, but how, again, here's the word again, unique each of the the characters seem. Like I love that maybe later in the game this changes, but each character has something about them, like an ability set that is theirs. And I I feel like that so far has been",
            "start": 1820.8
        },
        {
            "text": "the the characters seem. Like I love that maybe later in the game this changes, but each character has something about them, like an ability set that is theirs. And I I feel like that so far has been very rewarding for me to want to actually switch them out and have your party of three be like the right party to go into a battle. Even if I don't necessarily need it to win, it's more just like for the extra added fun of it of like getting the strats and understanding how to use uh each of the different kind of like and it's not just abilities. It's like entirely different in terms of like how like their skills all work in tandem together. Yeah. And like the fun is minmaxing it all. Like uh Lun here uh she has this uh system called stains which um you know if she uh does certain attacks she'll kind of gain four uh kind of different um elemental elemental kind of things and then certain attacks will feed off of different color elements and then those attacks will be higher. uh you have",
            "start": 1860.48
        },
        {
            "text": "kind of gain four uh kind of different um elemental elemental kind of things and then certain attacks will feed off of different color elements and then those attacks will be higher. uh you have uh that's all the stuff that really scares me whenever we get into games like this and you do run into other party members and like you know not recruit then they just they join or whatever and there may be some fighting styles that are a bit confusing at first cuz Andy's not using Growlin Pokemon. I I don't use I'm not I'm not [ __ ] tail whipping nobody to lower their defense, right? In this game I did and I loved it. Yeah. And Barrett mentioning the different fighting styles, there are other characters that will do weird [ __ ] that like in at first turns me off and I'm like, I don't want to learn this system. This seems annoying, you know? Like I I I just want to attack. And then I fell in love with it because of how awesome it is. And I really [ __ ] up not putting a certain party member",
            "start": 1904.32
        },
        {
            "text": "this system. This seems annoying, you know? Like I I I just want to attack. And then I fell in love with it because of how awesome it is. And I really [ __ ] up not putting a certain party member into my party until near, well, I say near the end, but it was, you know, it was still like I still play the last seven hours with them or something like that. But I regretted not doing that sooner because I was so worried about just having to learn something. Just learn, Andy. Just learn something. But I'll tell you what, I didn't need to learn pairing. God damn, I'm [ __ ] good. So like I'm so good at this game. It's crazy, man. I I would say just uh just to loop it back really quick to the different um abilities and the way all of their unique systems work. I think it's really impressive of like it doesn't feel overwhelming just because I think they they do a bit of um good synergy. It's synergy but also pacing in terms of onboarding new characters and different play styles and stuff. And",
            "start": 1957.92
        },
        {
            "text": "it doesn't feel overwhelming just because I think they they do a bit of um good synergy. It's synergy but also pacing in terms of onboarding new characters and different play styles and stuff. And maybe like at first you don't click with somebody like uh uh there's a character who um gets introduced kind of uh later on in the game that I wasn't feeling uh right away. And then I had to use him as a backup character cuz if you have your kind of first three in your party die, you get a second chance, but it's everybody else who isn't in that first party. Which by the way, that was a huge pop for me when I was like a man, it's over. I was like, \"Oh [ __ ] we're back.\" And that send in the reserve team. set in the reserve team and like that being a legit strategy sometimes for some bosses where it's like I can get this boss down to here with this crew and like maybe get the the second team to come in and then learning like being forced to learn like oh [ __ ] now I have to learn how to",
            "start": 2002.24
        },
        {
            "text": "it's like I can get this boss down to here with this crew and like maybe get the the second team to come in and then learning like being forced to learn like oh [ __ ] now I have to learn how to play as this character who has um you know certain attacks are going to be stronger each turn through like a random RNG system and learning how to minmax even that stuff I was like oh this is fascinating and satis satisfying. Uh yeah, the uh I I wanted to bring up real quick or you go first cuz I No, I was just going to say my advice to anybody who's playing this game is to uh really go in depth and and switch out your team members because I have the same thing, right, where I had a few characters that were the reserve team and then by the end of the game I was like, \"Fuck, I I I massively [ __ ] up because I under I finally gave them a chance and I was like, oh no, I understand how to play you guys now.\" Uh because everybody is viable. Everybody uh has their own uh unique thing and I I fell",
            "start": 2046.08
        },
        {
            "text": "up because I under I finally gave them a chance and I was like, oh no, I understand how to play you guys now.\" Uh because everybody is viable. Everybody uh has their own uh unique thing and I I fell in love with CL. Like that was my character. That was the character that I always had in my uh main her abilities are [ __ ] crazy. But then once I like I gave her up for a little bit. I was like, \"Okay, let's put in the other who how can these other people do?\" I was like, \"Oh [ __ ] they're actually really good if I put in the time and the effort to learn them.\" Shout out to my boy uh Manokco who is just goat. But it's a little overwhelming at first. Just a little over because going back to what Tim said, there's a lot of fake words, a lot of words that like they're saying out there and like I don't know what that means. It takes a while to to kind of ingest. And that's where I'm taking the conversation next is luminas and pictos. We got to talk about this. We got to talk about this. We",
            "start": 2089.12
        },
        {
            "text": "I don't know what that means. It takes a while to to kind of ingest. And that's where I'm taking the conversation next is luminas and pictos. We got to talk about this. We got to talk about this. We looked at this preview during the Xbox developer preview and it was developer direct developer direct and it was laotted as something that is such a positive because look at how deep you can get into customizing how you are approaching combat with a system of luminas and pictos. And we saw a screen and I'll you know the biggest menu screen. The worst thing you could have showed anybody cuz it had 90,000 different choices and it they were all a bunch of different words and it's at the point where I'm looking at them where I'm like well I'm sure there's a bunch of duplicates or something, you know, like how you have multiple items. No, there was not. They were all they were all different items. And I looked at that and I almost vomited. Like I was like this sucks. I don't want this. And once",
            "start": 2121.36
        },
        {
            "text": "like how you have multiple items. No, there was not. They were all they were all different items. And I looked at that and I almost vomited. Like I was like this sucks. I don't want this. And once you get the hang of what the system is, so what it what luminas and pictos are, a luminina is an ability, a passive, right? And it might be, hey, every time you parry correctly, you get some health back, which I am all about the leech. I love leeching in games. If I could suck some health back, I do that in every video game possible. And if it's something parry related, holy [ __ ] even better, right? So I equip. So, I equ I equip the Lumina, right? And if I do five complete encounters with that Luminina equipped, that Lumina becomes a picto that is then available for anybody in my party to equip. And it's ability sharing essentially. It's ability sharing. You're car. So, but you have to unlock it for every for in order for everybody else to use it. And then as you're making through your",
            "start": 2169.12
        },
        {
            "text": "And it's ability sharing essentially. It's ability sharing. You're car. So, but you have to unlock it for every for in order for everybody else to use it. And then as you're making through your journey, you're finding all these little picto slots. And then suddenly you have your character Lun or Robert Patterson. He's got 33 picto slots. And then you might see that if you have 33 picto slots, it costs 20 pictos for that insanely cool uh pictos that's like really OP and awesome. And you're kind of doing the thing where it's like, hey, you have $15. What what's your NBA roster? LeBron's $5 and [ __ ] you know, goddamn Ilgowskis is $1. And you're kind of you're doing that push and pull and you're doing the minmaxing of I have 33 pictos available right now. Oh, actually I have two more that I didn't unlock. Let me apply those. I have 35 now. And that sick ass ability is 10 uh pictos. I'll put that in. So now I have 15 left. And then the other one, this one. Ooh, I one Ptos. It cost one",
            "start": 2224.08
        },
        {
            "text": "I didn't unlock. Let me apply those. I have 35 now. And that sick ass ability is 10 uh pictos. I'll put that in. So now I have 15 left. And then the other one, this one. Ooh, I one Ptos. It cost one picto those to get AP back for every dodge, every correct dodge. Put that in. That's a one. That's a no-brainer. Holy [ __ ] For early game, that's like such a a no-brainer type [ __ ] And it's the stuff that those systems seemed really overwhelming and kind of cumbersome and I was like, I don't really want to [ __ ] with this. And then I [ __ ] with it heavy. It is so cool. I I will say and like in the beginning hours, it's not that huge page of a bunch of different like uh luminas or sneaks up on you. It sneaks up on you because like I I would say in the first couple hours being onboarded into that system, you're like, \"Okay, I get it. It's ability sharing. You know, you only get three slots per character to fully equip uh a Luminina, right? Luminina. And then once you Yeah, like Andy",
            "start": 2270.72
        },
        {
            "text": "into that system, you're like, \"Okay, I get it. It's ability sharing. You know, you only get three slots per character to fully equip uh a Luminina, right? Luminina. And then once you Yeah, like Andy was saying, once you get through a certain amount of fights equipping that specific Lumina, then that ability becomes sharable through the Picto system. And in the first few hours, you know, you're picking up a couple or whatever. And then you're like you have your party comp, you have them all equipped with certain things and you you know you've unlocked the picto version of it. So you're all you're feeling good and then you don't check in for like 15 hours and then you open up that menu and you're like what the [ __ ] Dude, even then though like this is the type of game where I when I play RPGs in general normally I'll, you know, set my equipment from the start, play for a while, and I don't like to change in menus after every battle. I know some people do that stuff. It's like I like",
            "start": 2315.84
        },
        {
            "text": "RPGs in general normally I'll, you know, set my equipment from the start, play for a while, and I don't like to change in menus after every battle. I know some people do that stuff. It's like I like to like get through a little bit and then after I get to a like challenge or something back to something like you like to turn you like to um complete like seven quests in World of Warcraft, then you go back to turn them all in. It's like, \"Holy [ __ ] I just gained like nine levels.\" Then you get to look at everything and like put it together. And my god, it's been so satisfying cuz every time I've done that, I become so much stronger the next time where the next battle I get into, I'm like, I am attacking for so much more damage at this point. And like that feels good, you know, like it's satisfying to like put the work in, get stuff, and then be able to And when I say put the work in, I don't just mean the battle system. I mean actually like looking at the menus and trying to decide I'm",
            "start": 2353.52
        },
        {
            "text": "to like put the work in, get stuff, and then be able to And when I say put the work in, I don't just mean the battle system. I mean actually like looking at the menus and trying to decide I'm going to give them this, I'm going to give them this and see how it all plays out. Like it's been very great for me. It's like oops all fun stuff, right? Like I go to the I go to the perks and it's just like I'm just call them perks cuz that's that's the easiest way to look at it. Uh, and it it is just all the fun modifiers that you expect. Usually you get with weapons. And you do have modifiers with weapons, but uh, yeah, being able to go in there and be like, okay, well, now fire damage is, you know, 50% more critical. Oh, also I updated this character. This character is like my all about critical hits, right? So I can I can mix that all together and now I'm getting 100% critical hits. Like you can really get in there and do some wild stuff. I will say it is very like a lot. It's it becomes a",
            "start": 2394.8
        },
        {
            "text": "hits, right? So I can I can mix that all together and now I'm getting 100% critical hits. Like you can really get in there and do some wild stuff. I will say it is very like a lot. It's it becomes a lot. And I don't think I mean it starts a lot. The UI needs to become I don't know how do you make that UI better, but it needs to be better. I I don't know how to organize it. When you go to that menu, it is just all of them unorganized. I think they like by default they instead needed to do the sorting system in terms of like here's defensive stuff like here's a drop down. They have the sorting is very limited. It's like alphabetical by level by power. That's it. Yeah. But but then there's the it's not only that but then they have the subdivision of sorting where you could do all of that stuff either either alphabetical by level or by power and then they have a submen of sorting like Barrett just mentioned which is offensive only defensive only support only. I I agree that I I'm on both",
            "start": 2430.32
        },
        {
            "text": "either either alphabetical by level or by power and then they have a submen of sorting like Barrett just mentioned which is offensive only defensive only support only. I I agree that I I'm on both sides of the argument where I think that it is still kind of that there are enhancements that can be had and can be done, but they still gave at least in my opinion a lot of ways to try to manage the mess. I think maybe honestly Roger, it's like the for me it's the the use of the word energizing and all like once you play it enough you realize that the word energizing is their key phrase for giving you AP and your AP is your moves and your more powerful moves cost more AP and then obviously healing is for heals. And I I kind of wish like either maybe they were colorcoded or maybe the the pre that word of like energizing was like not bolded and the other word I don't know what you have to do but there they still did a decent amount. What I wish I wish there was one more sorting option where",
            "start": 2474.72
        },
        {
            "text": "word of like energizing was like not bolded and the other word I don't know what you have to do but there they still did a decent amount. What I wish I wish there was one more sorting option where it up top showed me all the ones I have equipped and then showed me all of them by power. And that was like you know that was one little option that I wish I could kind of mix and match sorting wise. Um, and yeah, I do think that it can it could definitely be overwhelming at first. And I think once you get sort of the systems down, then I I had so much fun finding a late game Pictose and being like, oh, this could really really change some [ __ ] And then being like, well, let me go fight five people so that I can unlock it for everybody, you know? And that was the difference between me hurting at a boss and just being like, I'm just getting destroyed. What's going on my with my with my perks, right? let me check them out. And then I had an awful moment where I'm at the like the second and",
            "start": 2529.6
        },
        {
            "text": "at a boss and just being like, I'm just getting destroyed. What's going on my with my with my perks, right? let me check them out. And then I had an awful moment where I'm at the like the second and the last boss and I'm just getting destroyed by CL's just getting destroyed and then I'm like, \"Okay, let me just go check.\" And then for some reason I had nothing equipped like no. But it was it was nice. It was nice relieving moment where I was like, \"Okay, at least this is what's wrong. It's not on me. It's not on me.\" Uh but yeah, no, going through that and finding all the all the stuff is really fun. It's a good time. For me, it was like the for my personal experience, it was it was the perfect level of difficulty because I first tried everything, but it was hard. Yes. And that's like you first tried everything. Everything but by the like by the last like 20 hours of the game. In the beginning, I was I would die to somebody when I wasn't equipping [ __ ] and didn't really fully",
            "start": 2575.52
        },
        {
            "text": "you first tried everything. Everything but by the like by the last like 20 hours of the game. In the beginning, I was I would die to somebody when I wasn't equipping [ __ ] and didn't really fully understand the pictos and the luminas and all that stuff. But by the end of it, I was like one boss that took me at least 10 tries. I crazy. It was okay. Yeah. Yeah. That's crazy. And legitimately, I beat it. I was like, I'm [ __ ] goat. Like, but it was still hard. Oh, yeah. And I And I loved that I was having to revive and I was having to crucially use an ability that adds shields to people and all of that stuff just working in tandem. It was a It was a [ __ ] orchestra. You were locked in. It was a musical just experience using all of the abilities that every character has, right? Cuz you know, some characters have like the shield thing, but they also do a lot of fire damage, and you're like, I'm just going to do fire damage. No, no, you're using the shield and you're using the fire.",
            "start": 2615.76
        },
        {
            "text": "know, some characters have like the shield thing, but they also do a lot of fire damage, and you're like, I'm just going to do fire damage. No, no, you're using the shield and you're using the fire. you're just really maxing every single my girl Myel getting into her [ __ ] grandiose stance or whatever and but a virtuous stance, but it only happens if uh if an enemy if I use that move and an enem is on fire, then she goes uh virtuous stance and knowing that that's 200% extra damage mixed in with this [ __ ] ridiculous move that is so like you have to have like enough AP, but like having another ability that's just automatically getting her AP. Oh my god. singing, man. Singing legitimately by the end of it, I had some Luminos and some Picto Luminos and some Picto uh equipped that were um where every character was getting heals from everybody if they were healing and I was getting health back from counterattacks and I was getting health back from parries and it was I was just like it",
            "start": 2664.72
        },
        {
            "text": "where every character was getting heals from everybody if they were healing and I was getting health back from counterattacks and I was getting health back from parries and it was I was just like it sounds like a pyramid. Yeah, dude. But again, for the fun of like minmaxing, dude. Lun [ __ ] You could drop a nuclear bomb if she's in my ass. Lun was my tank. Lun could not die if I tried. That's awesome. I need to talk to you guys after this. She was resing every like you could not kill this woman because I was like parrying non-stop and it was it was a great freaking time. Yeah. And I just kicked so much ass. It kicked so much ass and I wanted on the record that you know like I struggled with this game and I've beat games like Seiro and I'm just I'm not god tier like uh Andy. I just want it on the record cuz I know people in the comments are going to be like, \"Ah, they're not gamers.\" We're all gamers in our own gamer. Some of us are gamers less than others. And I [ __ ] love this",
            "start": 2708.88
        },
        {
            "text": "it on the record cuz I know people in the comments are going to be like, \"Ah, they're not gamers.\" We're all gamers in our own gamer. Some of us are gamers less than others. And I [ __ ] love this parry system. Like it is so satisfying and so fun. When you nail it, it feels so good. And when you don't, you know what you [ __ ] up. And I I think like you guys have said this a couple times now. Yeah. Sometimes it's like it gets a little weird. There are some enemies where I'm like, I still don't understand you. Oh, really? Yeah. Oh, yeah. But so far I haven't got there. But Tim, frames win games with Nvidia. This is true. I'm playing on PS5. This isn't sponsored. Uh, you know, but I got my 240 Hz monitor. I wasn't even getting that many frames, but still like I I the the once getting those parries down, getting the timing down, and I really also enjoyed just like kind of adding in a new mechanic later on. It It's nothing completely gamechanging, but a way to sort of freshen up enemies.",
            "start": 2756.48
        },
        {
            "text": "parries down, getting the timing down, and I really also enjoyed just like kind of adding in a new mechanic later on. It It's nothing completely gamechanging, but a way to sort of freshen up enemies. And some of these boss fights, I was just like glowing to Roger about one of the early major boss fights that has nothing too crazy about it mechanically, but they do really interesting things to keep the boss fights fresh. Yes. And more importantly, creative to where you go, \"Wow, that'sique. I love that you're doing that right here. That's great.\" Uh, man, there's a couple of things I want to touch on here. One is uh the the charm and the weird of this game. Like it is so clearly inspired by the games that we've mentioned already, but like you'll turn a corner and there's just the funkiest looking thing that is so out of place. And like Kevin has like something on screen right now. I'm not talking about this. But I mean earlier we saw in Andy's like kind of first couple hours. There was",
            "start": 2794.4
        },
        {
            "text": "thing that is so out of place. And like Kevin has like something on screen right now. I'm not talking about this. But I mean earlier we saw in Andy's like kind of first couple hours. There was just a mime. Yeah, there was just a mime. And let me tell you, don't [ __ ] with the mimes. Terrifying. Run away from the mime. There's such weird [ __ ] and it doesn't feel out of place. Like and then another classic JRPG thing, you go and you find this new area and it has such a life to it. It has a community and characters and a language even and there everyone's talking to each other and there's a vibe to it that you'll remember for the rest of your life that that place from this game was like that. And that is as high such a vibe that we're going to be if if any game is sort of smells like expedition, we're going to be like that's kind of like expedition. You know what I mean? This is going to be the baseline for a new type of vibe. Yeah. And also the humor of it all. Oh, I got to talk",
            "start": 2843.52
        },
        {
            "text": "expedition, we're going to be like that's kind of like expedition. You know what I mean? This is going to be the baseline for a new type of vibe. Yeah. And also the humor of it all. Oh, I got to talk about that cuz that took me threw me through a loop cuz the game starts off pretty light and then it gets really [ __ ] dark. Like I'm talking about like the first like like 15 minutes like like five minutes. Yeah, exactly. Whatever. And then Yeah. And then it gets so [ __ ] dark and then it starts getting very funny out of nowhere. And it is like a very genuine and weird funny. I like it it threw like I it felt out of place the first couple of times of like yo we've just gone through some terrible stuff as we've like kind of mentioned in like our preview and stuff and then you know Charlie Cox is like starting to like crack jokes. I'm like what the what the you were just about to die like 20 minutes ago whatever. But eventually I think like there is that weirdness at first that is slowly",
            "start": 2886.16
        },
        {
            "text": "is like starting to like crack jokes. I'm like what the what the you were just about to die like 20 minutes ago whatever. But eventually I think like there is that weirdness at first that is slowly kind of earned and the more this game kind of reveals itself of how weird it is um I think the more that feels right at home. Like there's a group of uh critters in this game called gestals and their whole minions. They're they're like essentially minions but they kind of look like um those like wooden figure like wooden figure dolls or whatever. Yeah. And like their whole kind of uh um their whole thing their whole thing is just fighting. They just like to fight through fights. We fight through fights. Yeah. They uh like I I do want to keep on kind of harping on how charming the writing was cuz I was talking to just so many different NPCs in one of these uh areas and legitimately like chuckling at every single line that these characters are saying in random different spots. Um, so not only",
            "start": 2923.44
        },
        {
            "text": "I was talking to just so many different NPCs in one of these uh areas and legitimately like chuckling at every single line that these characters are saying in random different spots. Um, so not only do I think the the writing is super sincere and earnest in a lot and emotional in a lot of different moments, but they also just have a really good a really great sense of humor, I think. Yeah. And I I'm I'm starting to get to the the more humorous elements uh in in my playthrough right now. And like we're talking about the gestals and stuff like that stuff's funny, but even getting through that, there was a a moment where so far the story has been very serious and very very very big. It's heavy. And there was a moment where like two of the girls are just giving Charlie Cox's character [ __ ] And I'm like, I love this. Like it feels it feels authentic. It reminds me of the writing in the Final Fantasy 7 remake games that I've given so much praise for loving the dynamics between these",
            "start": 2976.16
        },
        {
            "text": "And I'm like, I love this. Like it feels it feels authentic. It reminds me of the writing in the Final Fantasy 7 remake games that I've given so much praise for loving the dynamics between these characters cuz they feel like real. And uh I I just love it because I think it gives like really quick for the video video watchers, they're like trying to find their friend and their friend just gets [ __ ] killed like nothing. And then like 15 minutes later, Charlie Cox like cracked a joke. And like at first it's like kind of weird. Sorry, just to go back to you. No. Yeah. Yeah. I just I'm I'm very very into into that stuff. There's a moment with my boy Monokco and another character that it it it got me so hard in terms of laugh like it hurt uh how much I like laughed at it. Uh and I think that's like the cast again just [ __ ] nails it and like the rapport all of these people kind of have with each other. Uh, and also knowing that they're probably recording silo in booths. Just like the way",
            "start": 3021.28
        },
        {
            "text": "like the cast again just [ __ ] nails it and like the rapport all of these people kind of have with each other. Uh, and also knowing that they're probably recording silo in booths. Just like the way that they're able to kind of bounce off each other's energy, um, when it all come together, uh, is really [ __ ] awesome. Yeah. The, uh, emotional moments though, like that for me is what brought this game up from wherever it was and then to the stratosphere because there are some moments where the most he the heaviest [ __ ] happens. And I think I've played RPGs and I've played games that kind of push past it a little bit. like we feel the motion and then we're just we're on to the next thing, right? And then we run. Yeah, exactly. That's my favorite game of all time. Um, but we sit with a lot of that sadness and we really like explore it and even when we do push past it, that's part of the story because it's like why are we pushing past this? Like that is kind of the crux of this whole",
            "start": 3065.12
        },
        {
            "text": "of that sadness and we really like explore it and even when we do push past it, that's part of the story because it's like why are we pushing past this? Like that is kind of the crux of this whole game, right? Is the these expeditioners have a goal and they are they're going for it even if people die, even if horrible things happen. Um, and the way that they keep on bringing up that emotion, that grief, it it it's very poetic and it happens at the right moments. And then they also balance it out with the very strange and weird moments at the right at the right time. So, it's it's a delicate balance. And at the beginning, I was I was like, man, I don't know if you're going to be able to do this. This is it's also a French game. I'm like, I don't know how it's going to translate. Like, how is this going to do? And it it does a great job, huh? Yeah. You know me. Come on. Eddie's the only one that didn't say anything. You know what I mean? Um, yeah. A couple more super chats I want to get",
            "start": 3109.04
        },
        {
            "text": "this going to do? And it it does a great job, huh? Yeah. You know me. Come on. Eddie's the only one that didn't say anything. You know what I mean? Um, yeah. A couple more super chats I want to get to. I saw this uh sentiment shared a lot here. A question from my homie uh Paige synced in chat in Twitch chat. This comes from download says, \"Are there ways to influence the story, i.e. dialogue choices or different party comps. You can talk to characters more.\" Yeah. And that uh comes with some rewards. Yeah. There's there's a you know, not to get too into it, there's a very thin friendship system. Uh that is another like one of my uh bigger critiques. It feels very like um very flat and very like we have to have this. We have to this is like this is the type of game we're making. And I I I think that's like one of the the weaker elements of the game, but you're not really doing like it's not like a persona where you're hanging out with a friend and it's like, oh, if I make the wrong",
            "start": 3143.76
        },
        {
            "text": "I think that's like one of the the weaker elements of the game, but you're not really doing like it's not like a persona where you're hanging out with a friend and it's like, oh, if I make the wrong choice here, if I say something this person either doesn't want to hear or not going to land with them, I'm not going to get as many friendship points. yada yada yada. It's literally just you're going to start up a conversation with your friends at camp and then you're going to go through just like a a conversation, not really picking a dialogue, but you can choose who you're hanging out with, who you're not hanging out with in that sense, but you're not really changing the story, I would say. Yeah, you you're picking dialogue, but I they are leading to the same place, I would say. But if anything, it's a method to introduce a newer ability and mechanic kind of later on in the game to where I I didn't know that these things were going to happen. I was like, \"Yeah, of course, I want to talk",
            "start": 3192.88
        },
        {
            "text": "it's a method to introduce a newer ability and mechanic kind of later on in the game to where I I didn't know that these things were going to happen. I was like, \"Yeah, of course, I want to talk to these NPCs cuz I really enjoy hanging out with them and I love their dialogue and I enjoy the character writing. So, yes, I want to hang out with them and see what happens.\" And then the more I did that, then it's like friendship level unlock three and then this new move. I was like, \"What the [ __ ] is this new move?\" and having those things upgrade and get better was like, \"Oh, cool.\" At first, I definitely felt like, \"All right, well, this is definitely not as in-depth as I assume that they would want.\" Like, if they had a bunch of world, they presented in a very weird way where all of them are kind of available to do their next level all at the same time. So then it's like a weird like, all right, well, if I want to get them all to a certain level to unlock a new skill or whatever, I",
            "start": 3233.84
        },
        {
            "text": "are kind of available to do their next level all at the same time. So then it's like a weird like, all right, well, if I want to get them all to a certain level to unlock a new skill or whatever, I got to hang them out with them all tonight before I want to go out back and grind. So then that also causes a very weird like I'm not really in the mood to do this, but I should do this type of thing. So yeah, which made me like kind of deterred me from doing it, right? Because there were so many moments where we're at camp and I'm like, man, we just had a crazy story moment. Like I just got to see that through. Like I don't want to hard stop the story. But I did like talking to the characters and being able to have those connections. because I didn't even know either like of like was there even going to be an upgrade? Was there some incentive for me gameplay-wise for talking to these people? I just enjoy talking to them. I love talking to them. Every chance I get, oh, I'm here for it and I",
            "start": 3280.72
        },
        {
            "text": "going to be an upgrade? Was there some incentive for me gameplay-wise for talking to these people? I just enjoy talking to them. I love talking to them. Every chance I get, oh, I'm here for it and I want to hear what you have to That's me in Mass Effect where it's like I'm going back to the Normandy every time to see and Garris is still doing his, you know, calibrations and like I I enjoyed talking to them, but the fact that it was also mainly just a way to give you this upgrade to an ability was like, oh [ __ ] okay, this isn't just a kind of pointless exercise. Um, getting to the rest of the super chats here, uh, before we close things out, think about if you guys have anything you want to get to. Um, we got Demon Hacker saying, \"Are the dominoes finally falling, Tim?\" Bro, they've been falling. And I feel like, again, we've said this before, Xbox bought the entire game store. The dominoes are now theirs. They can throw the dominoes around anyway. They want really Xbox's Domino,",
            "start": 3314.48
        },
        {
            "text": "falling. And I feel like, again, we've said this before, Xbox bought the entire game store. The dominoes are now theirs. They can throw the dominoes around anyway. They want really Xbox's Domino, though. Well, that's the thing is like it's on Game Pass. So, I feel like at the end of the day, like giving Xbox the credit of getting this game to people and their strategy and presenting the game and co-arketing, burying it with Oblivion. Horrible. That's horrible. But all of that, like, yes, the dominoes are are absolutely falling. Um, and I really quick, um, it it it only feels weird just because, you know, they were part of the developer direct in January and if they were part of a normal showcase more recently that was 30 different games and stuff like that, I I could get it. But the fact that like they were recently a part of a developer direct that showcased five different games. Um, that felt like kind of a big mories first parties as well. And then for Microsoft to kind of turn",
            "start": 3358.0
        },
        {
            "text": "that like they were recently a part of a developer direct that showcased five different games. Um, that felt like kind of a big mories first parties as well. And then for Microsoft to kind of turn around and be like, \"All right, well, we're going to shadow drop the remake of like one of our uh biggest games in history the same week to take out all of the oxygen of the air.\" I think that's kind of the more annoying thing. You know, y'all who are watching this are probably going to eventually play both. Uh, but I'm I think more about the conversations for, you know, my friends who are kind of in between normies and us, right, who are texting me all about Oblivion yesterday. I don't know like unless I tell them specifically, I don't know if they're going to naturally find out about Expedition because of this thing. So it it's that it feels so emblematic uh emblement emblematic emblematic of the uh industry for an indie studio to come out with such a unique fun new thing uh this week only",
            "start": 3397.2
        },
        {
            "text": "because of this thing. So it it's that it feels so emblematic uh emblement emblematic emblematic of the uh industry for an indie studio to come out with such a unique fun new thing uh this week only to have all of the oxygen be taken out uh of the room by a corporation who has been withering away in terms of uh fun uke uh unique creative ideas in the last decade uh with a remaster. And so that's the that's the frustrating thing. Play Expedition 33. I mean, that's the takeaway. Again, a $50 game or on Game Pass. Like, how the [ __ ] is this game $50? How? Yeah, like that. I'm I How did 30 people make this [ __ ] Why didn't they have 33 employees? Like, come on, guys. Come on. Um, but I I do hope that, you know, throughout the rest of the year that this that hype will kind of circle back around because I I mean, even now it reminds me a lot of metaphor last year where you see that big ass graphic on social media with all the nines and tens all over the place and I I think word of mouth",
            "start": 3442.24
        },
        {
            "text": "because I I mean, even now it reminds me a lot of metaphor last year where you see that big ass graphic on social media with all the nines and tens all over the place and I I think word of mouth will help this game a lot and I really hope it does because they deserve it and more. 100%. Yeah. 100. I think people will boot up Oblivion and be like, \"Oh, it is an old game.\" Like, it does feel old like an old game. Not that's not hating on it, but you know, Exhibition is a is a brand new video game. And and I know that like, you know, people like, \"Ah, they're different enough and all this stuff.\" And even Mike said yesterday, the game's good, people flock to the game. I hope that for this game, you know, there are also situations like Titanfall 2. So, like I just again, it's too early to really say, but also Doom comes out next month, too. So, it's like there's no room for, you know what I mean? The dominoes are falling. They're in a rock place. It's It's tough now when there's just so",
            "start": 3497.12
        },
        {
            "text": "say, but also Doom comes out next month, too. So, it's like there's no room for, you know what I mean? The dominoes are falling. They're in a rock place. It's It's tough now when there's just so much. Um, but again, play this game. Yelling says, \"Still crazy that Robert Patson isn't in this. It's crazy, dude.\" Again, it feels like they had a contract originally with him and then he was like, \"I'm going to make a movie.\" It was so funny cuz I think I I I went to Blessing. I was like, \"This guy looks like Robert Pat, like, bro, I've been saying that like like it does. It just looks like I got to admit to you guys, I don't know who you're saying looks like Robert Pence.\" Gustav Gustav the main guy. He looks like What are you talking about? He looks so much like Robert Patson from Good Times specifically with the beard. Tim, it's like when I play Liza P and everybody goes, \"Oh, Timothy Shalom.\" It's that with Robert. Everybody's like, \"Robert Patson. Robert Patson.\" People in the chat",
            "start": 3538.08
        },
        {
            "text": "specifically with the beard. Tim, it's like when I play Liza P and everybody goes, \"Oh, Timothy Shalom.\" It's that with Robert. Everybody's like, \"Robert Patson. Robert Patson.\" People in the chat been calling him Mickey 33 and it's so good. That's hilarious. That is Robert Patton. Look at that man. That's Robert Patson with a mustache. He just sees Gustav, bro. He sees the character. He sees the game. He sees Charlie Cox. I'm not used to seeing this man with a beard. Okay, you're right. You're right. Yeah. Um, good movie. I'll take it. Yeah. If you watched Good Time, that's a good movie. No, I have not. Oh, that's a good Batman. He doesn't look like Batman. Ju just to re-echo some stuff that I said during the preview period. um that I loved how during the preview it felt I was really worried about whenever big Hollywood actors uh are in games cuz necessar that doesn't always transfer one to one for one but I was so blown away and so ecstatic with Charlie Cox's performance in this",
            "start": 3572.56
        },
        {
            "text": "worried about whenever big Hollywood actors uh are in games cuz necessar that doesn't always transfer one to one for one but I was so blown away and so ecstatic with Charlie Cox's performance in this game uh during that preview period and I that still that's still I still feel the same way as I did during that preview period. He is incredible. The whole voice cast is amazing and when they get emotional, you feel that [ __ ] They Jennifer English I I think will be nominated for a lot of performance awards for her uh for her role as Myel. She was incredible. Shadow Heart and she kills it here, man. So good. I didn't know that. Yeah, I think she's fantastic. Yeah, I don't think this tops Blueprints for me in terms of game of the year. I think again a game has to do a lot uh to overtake blueprints, but I will say I would be surprised by the end of the year if this isn't my favorite story of uh in a video game this year. Admiral Edward says there are a lot of costumes. Yeah, I wasn't",
            "start": 3613.68
        },
        {
            "text": "blueprints, but I will say I would be surprised by the end of the year if this isn't my favorite story of uh in a video game this year. Admiral Edward says there are a lot of costumes. Yeah, I wasn't feeling a lot of the optional costumes. I had like them kind of mix and match like the kind of main costumes and looks, but anything that was kind of like out of the ordinary, I was like, nah, feels too weird. Yeah, it was a little too weird. Too immersion breaking. Everybody's too hot to be switching around like that. Like I I I just went with the color changes, the white and the black. That's what I did too because you end up getting like a a white color variant of the suit that you wear and like I did the thing that Barrett did where I just kind of mix and match. Might be tough though cuz I was only able to find it for the women of the group. I wasn't able to find it for they split costumes up into like a bunch of I like it. I like it. Give it to me. Give it to me. Let Let me go find",
            "start": 3663.76
        },
        {
            "text": "I was only able to find it for the women of the group. I wasn't able to find it for they split costumes up into like a bunch of I like it. I like it. Give it to me. Give it to me. Let Let me go find all this stuff. Yeah, I made one of mine a super baddy mime and I'm so about it. Whoa. So about it here. Also Kirsty Ryder as as Lun. Another amazing performance from Sefue I believe. Really? I think so. Cool. Uh and then the final one here. Cowhan Fudka says, \"Uh, no, we talked about Game Pass. It's actually insane.\" And no was K. I don't know what you're quite saying, but hey, you can play this game on Game Pass. And you should if you have Game Pass. And if you don't have Game Pass, it's worth $50. You should definitely buy it. Buy it. Support the devs. PlayStation. It's on everything. Yeah, it's on everything which I didn't know until we got codes. I was like, \"Oh, it is on PlayStation.\" Huh? Like cuz that's just the market metaphor too, right? Like Yeah. I was like, \"Oh, it's a",
            "start": 3701.76
        },
        {
            "text": "Yeah, it's on everything which I didn't know until we got codes. I was like, \"Oh, it is on PlayStation.\" Huh? Like cuz that's just the market metaphor too, right? Like Yeah. I was like, \"Oh, it's a PlayStation game.\" Didn't realize that. Yeah, she was Karoki in in Sefue. Well, everybody, that is our review of Expedition 33. Obviously, we are very very high and I can't wait to keep playing it. Um, and I want to hear all about your journeys with it as well in the comments below. Are you hyped to get this one going? Please let us know. Like I said earlier, we have a great day of content coming up. Uh, we're about to get into our second game cast of the day. It is my interview with the director of Oni Musha 2 and Oni Musha 2 Remastered and my preview of Oni Musha 2 Remastered as well. Um, and you're going to want to stay tuned and watch this one live. Uh, the end is very, very something. You know what I mean? But I want you to be there. I want you Today's going to be one of those days",
            "start": 3745.6
        },
        {
            "text": "and you're going to want to stay tuned and watch this one live. Uh, the end is very, very something. You know what I mean? But I want you to be there. I want you Today's going to be one of those days where you're just like, I was there when Tim interviewed the director of On Musha, too. And I swear to that. I swear that to you. Okay. And then after that, Prometheus in review. But until next time, love you all. Goodbye. [Music]",
            "start": 3782.4
        }
    ]
}