{
    "id": 13873,
    "video_id": "rR2_P4yi_b0",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "Zelda: Breath of the Wild's Switch 2 Edition Won't Include DLC - Kinda Funny Games Daily 04.11.25",
    "description": "This episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nWe’re here to talk about video game news!\n\nToday after, KFGD, you’ll get:\nToday's the day: The Elder Scrolls Online Podcast: A Kinda Funny Gamescast Limited Series is here!\nJoin Greg, Mike, ZeniMax Online Studios Studio Director Matt Firor (FI-roar), and the Elder Scrolls Online Game Director Rich Lambert as they start an unflinching four-part show about the highs, lows, successes, and failures of the 10-year-old game.\nThe episode is already up on Bethesda's YouTube channel, but you can catch our version as today's Gamescast on both our channel and podcast services stepping the globe.\nGet ready for the deepest dive into development you'll ever hear!\nThen the STREAM is Steel Hunters w/ Mike and Andy\nIf you’re a Kinda Funny Member:\nToday’s Gregway is from Bless\nThank you to our Patreon Producers: Anatolii Ast, Delaney Twining, Karl Jacobs, & OmegaBuster\n\n00:00:00 - Start\n00:03:00 - Housekeeping\nThe Roper Report   -\n00:10:10 - The Legend of Zelda: Breath of the Wild's Nintendo Switch 2 Edition Won't Include the DLC - Rebekah Valentine @ IGN\n00:39:20 - Ad  \n00:40:40 - Toys For Bob ‘would love to work on a new Banjo-Kazooie’ - Jordan Middler @ VGC\n00:49:20 - Mafia: The Old Country’s release date has appeared online - Jordan Middler @ VGC\n00:52:40 - Indiana Jones And The Great Circle Is Getting Some Impressive PS5 Pro Enhancements - Darryn Bonthuys @ Gamespot\n00:56:30 - Wee News!\n00:58:00 - SuperChats & You‘re Wrong\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744395627,
    "duration": 3837,
    "transcript_chunks": [
        {
            "text": "[Music] Today's stories include Breath of the Wild Switch 2 upgrade won't include the DLC. Boo. Toys for Bob would love to work on Banjo Kazouie. Yay. And Mafia the Old Country's release date might be revealed. Cool. Barrett, you know. We'll have all this and more because this is kind of funny games daily. [Music] What's up and welcome back to kind of funny games daily for Friday, April 11th, 2025. I am Tim Gettys. I'm joined today by blessing at Jr. Good day, Tim. It's a really good day. It is because Joey Noel just texted me some very important information. Kevin, there is a link at the top of this dock. Kevin just made a sound. If you could bring it up, I would appreciate it because uh everyone here needs to know that on this glorious day of Friday, April 11, 2025. Is there a surprise drop? The band M2M Wait, wait, wait. Where where's the link? Cuz it's not on assets on the top of the top under intro runs. Sorry. Yeah, I Yeah, I didn't hear you when you um the band M2M, the artist",
            "start": 0.82
        },
        {
            "text": "drop? The band M2M Wait, wait, wait. Where where's the link? Cuz it's not on assets on the top of the top under intro runs. Sorry. Yeah, I Yeah, I didn't hear you when you um the band M2M, the artist M2M, you might know them, bless from Pokemon, the first movie soundtrack. Okay. Yes. Okay. Yes. They put out the banger, Don't Say You Love Me, the lead single from Pokemon, the first movie. Did it make any sense? I don't know. Why? Why was this the the single? But was it a banger? Yes. Did I listen to it all the time on cassette and then later on CD? Absolutely. Why did they put out a new version of it in 2025? I don't know, you know, but I'm so happy. You know why? Good for them. You know, they know how to get them clicks. Get them clicks. This is how you're going to get the clicks, everybody. You know, you like, come on. I I need some I need a guaranteed hit. I need something that's going to bring the fans back in. What do I do? I remaster my song from 25 years ago and put it back out",
            "start": 59.44
        },
        {
            "text": "You know, you like, come on. I I need some I need a guaranteed hit. I need something that's going to bring the fans back in. What do I do? I remaster my song from 25 years ago and put it back out that I know everybody's going to love. It's going to be a hit. Grant Kirk Hope, keep making Ranger Kazouie remix albums cuz I'm going to listen to every single one. Please do. And M2M, just do your thing. I'm so happy for y'all. Everybody go check out M2's Don't Say You Love Me 2025 edition. Tell me how it is. I haven't had time to listen to it yet. So, I don't even know. The M2M version's version. Good lord. How you doing, though? Uh, I'm doing really well. I'm excited for uh today. It's Friday. It's the end of the week. I get to go home, you sleep in, rest, you know, decompress. But before I do that, I get to play a game I've been looking forward to today on stream. That one and only Fifu, aka Rematch. God. And it's it's such a shame that it's actually a good name. Rematch. It is. You know,",
            "start": 103.12
        },
        {
            "text": "that, I get to play a game I've been looking forward to today on stream. That one and only Fifu, aka Rematch. God. And it's it's such a shame that it's actually a good name. Rematch. It is. You know, cuz FIFU is right there. And it's like that's great, too. But like Rematch is good. You're going to play it today. And let me tell you, this is a whole it was a whole thing where yesterday on the show I was teasing the the fact that like, hey, we might be playing a game. I'm not sure. I don't know if the date changed or if I misread the email that I got a few weeks ago about the beta that's happening, but like I got the codes and they're like, \"Okay, cool. Doesn't go live until 3:00 a.m.\" And I was like, \"All right, cool. We're not streaming this today.\" Then I get in today and I look at Kevin because I'm like, \"Yo, what's happening on the stream?\" Because I look at the calendar and it say it says one thing. I uh Kevin then mentions or Kevin said that like yo the title on the YouTube is",
            "start": 142.16
        },
        {
            "text": "because I'm like, \"Yo, what's happening on the stream?\" Because I look at the calendar and it say it says one thing. I uh Kevin then mentions or Kevin said that like yo the title on the YouTube is saying a blueprints related thing and I'm like Kevin what's going on? I thought we were playing rematch. No, it said soccer and puzzles. Yeah, puzzles. But like it but then Kevin was like ignoring the soccer part. But you also said that Mike said that the the thing doesn't open until 3 p.m. to which I look at you and I'm like no it says 3:00 a.m. I I read this thing multiple times. Is I was concerned that was 3:00 a.m. last night. Correct. Last night. Yes. So that means right now it's game time the beta is happening and we're streaming that [ __ ] That is so awesome. I'm happy because under the sweatshirt, here's the reveal, everybody. We got I'm wearing I'm wearing my Chelsea jersey. Good. All right. I'm so [ __ ] excited for rematch. I am so excited for you. I mean, I was so excited",
            "start": 181.28
        },
        {
            "text": "the sweatshirt, here's the reveal, everybody. We got I'm wearing I'm wearing my Chelsea jersey. Good. All right. I'm so [ __ ] excited for rematch. I am so excited for you. I mean, I was so excited yesterday that I made a big deal cuz I in the chat it was breaking news that we got a release date for all this and I was excited to to share that with you. But you already [ __ ] knew. I already knew. I didn't know when the release date was, but I I wasn't surprised when we were pulling it up. I was like, it's going to be some rematch, though, cuz I know what's going down today. That's awesome. Yeah. So, that's the stream today, everybody. Stay tuned for that. It should be a lot of fun. But this is kind of funny games daily where each and every weekday we get together to talk about all of the video game news that you need to know. If you like that, and I know that you do, you should get the kind of funny membership. It gets you the shows ad free. It also gets you the daily exclusive",
            "start": 221.6
        },
        {
            "text": "the video game news that you need to know. If you like that, and I know that you do, you should get the kind of funny membership. It gets you the shows ad free. It also gets you the daily exclusive Gregway. Uh, every single day we put out a uh a substantial piece of content talking about your questions, talking about whatever the hell we want to. I think today it might be a snow bike mic special. So, we'll see how that all he hasn't responded to my DM yet. We'll see. Or it might be Bless. It might be one of us. It might It's somebody. It's going to be somebody cool. Uh, it won't be me. I'll tell you that. Did you actually ask him to to do it? Yeah. After yesterday, he asked you like a million times to do it. Yeah. But no, here's the thing. I am I I'm making a shift in my schedule to be on the stream today, which means I have less time. But guess what? You know what I mean? Mike is there to help out where he can, and he doesn't know how to say no to things. So, I had I take advantage",
            "start": 254.16
        },
        {
            "text": "the stream today, which means I have less time. But guess what? You know what I mean? Mike is there to help out where he can, and he doesn't know how to say no to things. So, I had I take advantage of that. So, I need to go. That was the darkest I've ever seen. Bless. I'm like, well, he doesn't know how to say no. He doesn't know how to say no to things. So, I sometimes I got to take advantage of that when I can. And that might mean Yeah, but he doesn't respond to text. So, you're going to have to ask him in person. Oh, all right. I'm going to ask him in person. Kev, the chat is saying there's an issue with my mic. I I I'm trying to figure it out. I don't hear it in my headphones. Let me go to the other room and like because it could be the Is it YouTube or is it Twitch? Chad, let me know. Are you on YouTube in the issue with the Mike is fine? Says Twitch, so maybe it's YouTube. I I did just get a response from Mike who says, \"I don't know how to say no to things, so of course I'll",
            "start": 294.64
        },
        {
            "text": "Are you on YouTube in the issue with the Mike is fine? Says Twitch, so maybe it's YouTube. I I did just get a response from Mike who says, \"I don't know how to say no to things, so of course I'll say yes.\" There we go. That's our guy is coming from Mike today. Speaking of of Snowike, Mike, uh, real quick, I want to say a lot of people have been asking um if we're going to do a follow-up to his Final Fantasy 10 first half review now that he's beaten the game. The answer is, of course, we are. So, next week, we me and him will be doing another one-on-one talking all about Final Fantasy 10. I watched his entire VOD last night of him beating the game, and I was crying right along with him. It is a Y'all need to go check out Mike's uh ending of Final Fantasy 10. The whole stream's amazing, but the end, the final hour is like it. The amount of emotion, every emotion possible is there. I didn't know Final Fantasy 10 was like that. Oh, yeah. I didn't know it was one of them ones. Oh, it's one",
            "start": 334.56
        },
        {
            "text": "the end, the final hour is like it. The amount of emotion, every emotion possible is there. I didn't know Final Fantasy 10 was like that. Oh, yeah. I didn't know it was one of them ones. Oh, it's one of them ones. I might have to check this game out at some point. You might have to, Bless. God, you should. I can't believe this is happening, everybody. Final Fantasy 10 is back. Good for y'all. Oh, man. Remember, we are an 11 person business all about live talk shows. Today after Games Daily, you're getting a whole bunch of incredibly cool stuff. Starting off with Games Cast. It's what we've been hyping up for a while now. It is The Elder Scrolls Online podcast, a kind of funny Games cast limited series. Greg, Mike, Zenamax Online Studio studio director, uh, Matt Thyroar, and the Elder Scrolls Online game director, Rich Lambert are starting an unflinching four-part show about the highs, lows, successes, and failures of the 10-year-old game. Uh, the reviews are out. People are loving it.",
            "start": 374.88
        },
        {
            "text": "Online game director, Rich Lambert are starting an unflinching four-part show about the highs, lows, successes, and failures of the 10-year-old game. Uh, the reviews are out. People are loving it. People are already watching this um somewhere. Really? No, you're making that up. No, I'm not. I saw on Reddit people are watching it. It might have been their on the Elder Scrolls channel. I'm not sure. But you know what I need you to do? Watch it on our channel and then watch it on their channel cuz we worked really hard on this and we're really proud of it. But no, legit people seem super stoked about it. I saw multiple people saying like we were talking about the last week, even if you aren't an Elder Scrolls Online player, this is going to be a good show. This is going to be a good deep dive into the behind the scenes of video game development and also celebrating an amazing series 10 years uh for this game. So awesome stuff. Check it out then. And then after that, the stream is going",
            "start": 414.32
        },
        {
            "text": "into the behind the scenes of video game development and also celebrating an amazing series 10 years uh for this game. So awesome stuff. Check it out then. And then after that, the stream is going to be rematch aka Fifu with Mike and Andy and Bless. Yeah, of course. Yeah, I played it. I played just two seconds of it just to get in the practice mode. Wanted to make sure that I was right about the the fact that the beta is live. Uh but then also just to move around a bit. Yeah. Feels right. I'm so excited for you. Uh if you're a kind of funny member, you'll get today's Gregway that um thanks to Mike is going to be by Mike and thanks to our Patreon producers Anatoli Ast Delaney Delaney Twining, Carl Jacobs, and Omega Buster. I continue to struggle with the Anatoli Ast there. So, has Anatoli written in to please write in because I want to pronounce this correctly. Please do that to me. Uh today, we're brought to you by BetterHel, but we'll tell you all about that later. For now, let's",
            "start": 449.44
        },
        {
            "text": "written in to please write in because I want to pronounce this correctly. Please do that to me. Uh today, we're brought to you by BetterHel, but we'll tell you all about that later. For now, let's begin with what is and forever will be the Roper Report. It's time for some news. Five stories today. Baker's. Let me tell you, Kevin's been in a great mood ever since he discovered Blueprints. That's really what happened. Yeah. And I don't want to go on too many tangents, but I I do have I actually think it was like just the morning before that. What happened? No, I don't know, but like I was really happy and then I discovered blueprints, you know. Wow. They compounded it. Yes, it all builds on. I have a quest for everyone in the chat right now. We have a question that needs to be answered. And I am a simple simple man that doesn't understand how things work. PlayStation has the cloud. The PlayStation Portal now has cloud access. His blueprints, if you have PlayStation Plus, I shouldn't",
            "start": 491.56
        },
        {
            "text": "And I am a simple simple man that doesn't understand how things work. PlayStation has the cloud. The PlayStation Portal now has cloud access. His blueprints, if you have PlayStation Plus, I shouldn't know the answer. I shouldn't know the answer to this. I can't be playing Blueprints everywhere. We need to know for Kevin Ko so we can play Blueprints everywhere on the portal. Is blueprints cloud compatible on the PlayStation Portal? Somebody please let us. You're going to bring me into a meeting room and be like, \"Hey, look, I know this is a fun place, but it's people are all talking about how much you're playing.\" You know what I mean? That is going to happen. Like Tim, as somebody who is currently addicted to blueprints, it's going to it's going to take over Kevin's life. Yeah. Yeah. It's going to be a problem. I don't know. My first solo run felt People are saying yes, Kevin. People in the chat are saying yes. It's gonna be It's be dangerous. Uh, people are saying it's going to be",
            "start": 540.8
        },
        {
            "text": "going to be a problem. I don't know. My first solo run felt People are saying yes, Kevin. People in the chat are saying yes. It's gonna be It's be dangerous. Uh, people are saying it's going to be Breath of the Wild all over again. God, remember I was like, \"Hey, so have you seen any good cases for your portal and you're like, \"What the [ __ ] would you need to take it outside for?\" I knew I knew it was bad when I um woke up to a text from Kevin this morning. And Kevin just sends me a screenshot of his game. He's like, \"Look what I did.\" I'm like, \"Oh, he's in. He's in.\" Because I never get random texts from Kevin. Speaking of Legend of Zelda: Breath of the Wild, Nintendo Switch 2 edition won't include the DLC. This comes from Rebecca Valentine at IGN. And plus, let me just tell you, the hits keep coming. They keep coming. They just keep coming. I can't wait to talk about this one. This is an interesting one to talk about. Uh, aren't they all though? This one even more so, cuz I'm not",
            "start": 580.32
        },
        {
            "text": "keep coming. They keep coming. They just keep coming. I can't wait to talk about this one. This is an interesting one to talk about. Uh, aren't they all though? This one even more so, cuz I'm not that I'm of two minds with it, but I might be. Listen, you know what I mean? Like, I might be a corporate apologist. Everyone strap in amid continued frustration and confusion from fans about how much the Nintendo Switch 2 and its games are going to cost them, especially in the United States where that seems to be perpetually in flux. We just learned about yet another charge that may not have been obvious to everyone at first. Zelda Breath of the Wild Switch 2 edition does not come with the expansion pass, meaning you'll have to pay an additional $20 to to play the new DLC. Sorry, not new, to play the DLC on the new system if you don't already own it. Uh, that might sound like a no-brainer, but let me explain. Since the announcement of Switch 2's games and their pricing last week, there's",
            "start": 621.68
        },
        {
            "text": "play the DLC on the new system if you don't already own it. Uh, that might sound like a no-brainer, but let me explain. Since the announcement of Switch 2's games and their pricing last week, there's been no end to the confusion about how it's all going to work. Uh what we currently know is that if you already own this uh Breath of the Wild on Switch, you can play that game on your Switch 2, including the DLC if you've already purchased it, no problem. However, there's also a Nintendo Switch 2 enhanced edition of Breath of the Wild. I want to [ __ ] shoot myself. Uh it comes with improved visuals and performance achievements, as well as support for the new Zelda Note service in the Nintendo Switch online app. If you already own Breath of the Wild, you won't get these features automatically, but you can purchase an upgrade pack for $10 to get access to all of that. Are you following everybody? Cool. So, that leaves folks who don't own the game yet at all, but might want to purchase it",
            "start": 660.72
        },
        {
            "text": "but you can purchase an upgrade pack for $10 to get access to all of that. Are you following everybody? Cool. So, that leaves folks who don't own the game yet at all, but might want to purchase it on the Switch 2, they could purchase the Switch 2 enhanced edition of Breath of the Wild for $70, $10 more than the game initially retailed at. So, basically the price of the original game and the pack, but it won't include the DLC pack. So, you won't have access to that. If you want access to that, it's another $20 on top of that. So, $90 for the full Breath of the Wild 2 Nintendo Switch 2 experience. I said something's wrong there. You [ __ ] get it. This is according to a statement from Nintendo who told IGN, quote, \"The Legend of Zelda: Breath of the Wild Nintendo Switch 2 edition does not include The Legend of Zelda: Breath of the Wild expansion pass DLC. I [ __ ] hate it here. The DLC is available as a separate purchase.\" So, go for it. I don't I don't even have a rant about this. It's",
            "start": 699.36
        },
        {
            "text": "The Legend of Zelda: Breath of the Wild expansion pass DLC. I [ __ ] hate it here. The DLC is available as a separate purchase.\" So, go for it. I don't I don't even have a rant about this. It's more so questions about what our expectations are around upgrades, around weird Nintendo decisions, and around what we want out of this, right? Cuz like I think when I when I look at a an enhanced edition of a game, typically I'll say a lot of the time, if not most of the time, when you're getting that either I don't even want to say complete edition because they've they've never framed this as a complete edition. They're saying this is the next gen edition of this thing. Most of the time for AAA companies that does come with a DLC. It almost is packaged like a complete edition or a game of the year edition which comes with DLC or something like that, right? This isn't that. Of course, this is them being like, \"Hey, you're getting the Nintendo Switch 2 version of Zelda Breath of the Wild. If",
            "start": 733.36
        },
        {
            "text": "edition which comes with DLC or something like that, right? This isn't that. Of course, this is them being like, \"Hey, you're getting the Nintendo Switch 2 version of Zelda Breath of the Wild. If you want the DLC, pay the money for for for the DLC.\" I'm not thrilled with that, but I'm also not mad at that just for the sense of like like, \"All right, cool.\" Like they want us they we're mad that they're not including a DLC where the thing that's not being presented is including the DLC. Yes, I agree with you. Yeah, entirely 100% I agree with you. I also think this is stupid and it should include it. And I don't disagree with that. I just I don't think this is that big of a deal. I do think this is a perfect example of what I was talking about yesterday of just like God Nintendo, you could just not do this. you could just like not have things for people to scrutinize and rip apart and like yeah, is this kind of shitty? Sure. I think it's pretty low on the kind of shitty scale. That's the",
            "start": 783.92
        },
        {
            "text": "not do this. you could just like not have things for people to scrutinize and rip apart and like yeah, is this kind of shitty? Sure. I think it's pretty low on the kind of shitty scale. That's the thing is I think out of all the shitty parts of their messaging and all the stuff they've done so far, this is like the bottom of the totem pole where I look at this and I'm like, \"All right, cool.\" Like I I own the I bought the DLC when it came out. So, I'm like not I guess I'm not worried about it. That's my thing is I'm also like if you're somebody who's in the market Well, I guess this is Yeah. If you're somebody who's new to buying Breath of the Wild, I don't know. It's just a weird thing of you we paid for the DLC any like this changes nothing. Yeah. I guess in my mind it I mean again it's a it's always a weird thing that Nintendo can slightly enhance uh games sometimes not even at all. Sometimes take the features away and then charge more. And they've done that time and time again",
            "start": 825.84
        },
        {
            "text": "a it's always a weird thing that Nintendo can slightly enhance uh games sometimes not even at all. Sometimes take the features away and then charge more. And they've done that time and time again over the years. And this is another example of it. um they have I think that this goes back to what we were talking about yesterday of there's always going to be pain points going from generation to generation uh when you're trying to have features cross the line when you're trying to have games cross the line and account cross the line all of that and with the NSO and how it allows you to get certain expansion passes like the Breath of the Wild one wasn't one of those I don't think cuz that was like so early in the Switch DLC I feel like they should add it there to me is like that's what should happen is that that see that would be a smart move. Yeah. And doesn't seem like they're doing that. Um instead they're allowing you to buy this if you want it. You don't need to buy it. Was the DLC",
            "start": 862.24
        },
        {
            "text": "happen is that that see that would be a smart move. Yeah. And doesn't seem like they're doing that. Um instead they're allowing you to buy this if you want it. You don't need to buy it. Was the DLC even that substantial? That's the thing is I wonder if Nintendo looks at it and it's like well it's just it it wasn't that Well, I guess for me I don't look at that DLC as like, oh man, it must play. Oh man, we're missing out on the Breath of the Wild DLC. Like it was very fine DLC, but I'm in there for more of the core exper. It wasn't Shadow of the Earth tree or anything like that, right? Exactly. It wasn't the Cyber Punk DLC. And now again, having said all this, I still stand by it should be there. Like it's like just because we're just like, h it's not like we didn't love it that much or whatever, it still should be there. Like this is silly that we're putting out like the definitive edition of of Zelda. They're not calling it that. But like they never said definitive. They didn't. But",
            "start": 907.12
        },
        {
            "text": "it still should be there. Like this is silly that we're putting out like the definitive edition of of Zelda. They're not calling it that. But like they never said definitive. They didn't. But I mean when they're adding they're adding [ __ ] Zelda maps and like here's an app, here's GPS. It's like Zelda notes. Put some respect on Zelda notes. They're desperately trying to like add value to this thing, right? Like I think that Breath of the Wild is probably one of the weirder examples of things that they're adding and even then it's unclear about like do you even need to pay for this [ __ ] or can you just get the Zelda apps on in the app notes in the in the Nintendo app? I I know where you're going. No, I know. I know you are. It's just like it's all confusing. Just saying these same words over and over. It's just like so [ __ ] silly. But uh yeah, I don't know. This is This is one of those ones where Yep. It's another weird Nintendo decision. I get it. It's still weird and I don't",
            "start": 945.84
        },
        {
            "text": "over and over. It's just like so [ __ ] silly. But uh yeah, I don't know. This is This is one of those ones where Yep. It's another weird Nintendo decision. I get it. It's still weird and I don't know why they wouldn't just freaking do what people expect them to do cuz they're Nintendo. They don't do what people expect them to do. And this is where I cuz I had a new story in here that I was reluctant to put it in and then at the last minute another story came in so I took that one out. Um but one of the stories that I had on the Roper Report was another one from Video Games Chronicle uh by Jordan Midler titled um um it's is well it's basically talking about a Shawn Leaden quote right where he says quote if it's the only place to play Mario you buy it. former PlayStation boss reacts to $80 uh Nintendo games. And it kind of gets into the conversation of like Nintendo and the value of which um the value that Nintendo wants to put their things at and their the audience's willingness to",
            "start": 983.36
        },
        {
            "text": "uh Nintendo games. And it kind of gets into the conversation of like Nintendo and the value of which um the value that Nintendo wants to put their things at and their the audience's willingness to play to pay that value because it's Mario and Zelda and Pokemon and this stuff, right? Like I think too, and this come comes back to the super chat from days ago that was like why does Nintendo get a pass on this [ __ ] I don't I I think there is I think there's a double standard and I think to some extent possibly they've earned that double standard just based on the company they are and who they are and it's going to piss people off. Yeah. But also like what pass are they getting if we're really being real if if every time they do something like this every pissed off like that's that's what they're not getting a pass from. But but here's the thing I'll say is that like there's we'll see when it when all the cards are on the table but like this this is still going to sell really well. I",
            "start": 1021.52
        },
        {
            "text": "they're not getting a pass from. But but here's the thing I'll say is that like there's we'll see when it when all the cards are on the table but like this this is still going to sell really well. I think the software is still going to sell really well. It might not hit the peaks of what the Switch One sales were because of price or whatever, but I still think that like to to like to the example of not to use Gary Gary Wood as the example, but I think Gary Wood is indicative of what a lot of people are, which is we sat here and we complain about the welcome tour price and then Gary's like, \"Well, yeah, I'm still going to buy it.\" That's a Nintendo like that's the Nintendo power. No pun well pun intended. Pun intended, everybody. And I I guess my question then becomes, thank you so much for the smoke. Um, is is it different with Nintendo? And like I guess for people watching, right, like do you give them a pass because they're they're Nintendo with this kind of thing? I honestly I I",
            "start": 1065.76
        },
        {
            "text": "for the smoke. Um, is is it different with Nintendo? And like I guess for people watching, right, like do you give them a pass because they're they're Nintendo with this kind of thing? I honestly I I think that like the the giving a pass is a abstract concept that we could apply to stuff, but it doesn't actually mean [ __ ] because at the end of the day, like giving a pass is just do I want to buy a product or not? Is it worth it to me? And sometimes you even buy the product and you're like that wasn't necessarily worth it, but I wanted it so I did it anyway. I guess it would be are you more willing to buy the thing from from Nintendo? Like if another company was to go was to go this route. No. No, I am not. Like just no. It's do I want to play? Nintendo has the games I want to play. That's all that it is. Yeah. But so I'm not more willing to because it's Nintendo. In fact, I say if if a game came out on multiple like an old game was re-released on multiple systems, I'm not going to",
            "start": 1105.36
        },
        {
            "text": "all that it is. Yeah. But so I'm not more willing to because it's Nintendo. In fact, I say if if a game came out on multiple like an old game was re-released on multiple systems, I'm not going to buy the Nintendo version because it's going to be lesser then. So I think that's a perfect example of it, right? But Mario only on Nintendo. But that's what I'm talking about Mario because it's on Nintendo. But that's what I'm saying. I'm talking about Okay, maybe I'll take Nintendo out of it, right? Nintendo has the about 3D Allstars. But you're still going to buy 3D Allstars. Yes. Because I want it and I'm happy I bought it, which is why they're valuing it that way. That's the thing is like they know at the end of the day it's what we pay what we pay our money for, right? It's like the things that they know that we're going to shell out for and that's why the stuff is $80 because guess what? We're going to be mad about it, but we're still going to buy it. We're still going to pay the money.",
            "start": 1146.56
        },
        {
            "text": "they know that we're going to shell out for and that's why the stuff is $80 because guess what? We're going to be mad about it, but we're still going to buy it. We're still going to pay the money. The $80 thing is what I'm I'm most fascinated by of like years from now, what's the landscape going to look like for video games? Like, is this just going to be the new standard? Because like when uh what was it? Was it NBA 2K was the first $7 PS5 title? I mean, last week I've seen so many people be like, \"Oh, where was this energy for PlayStation?\" Listen to any games daily around that time. We were like, \"Holy [ __ ] this is the beginning of a new standard.\" Here we are now. It's just that's the new standard. Nintendo's now raising that up, which we're all like, \"What the fuck?\" I don't think any of us are giving it a pass. Sure. At all. Like, that's insane that it's $80. I also get it. Think about where we're at in the world, but also I don't know if 3 years from now when we're looking at",
            "start": 1182.72
        },
        {
            "text": "of us are giving it a pass. Sure. At all. Like, that's insane that it's $80. I also get it. Think about where we're at in the world, but also I don't know if 3 years from now when we're looking at the first three years of the Switch 2, what are games going to be priced? The fact that Donkey Kong is $70 is bizarre to me. That's the question. How much is Kirby Air Riders going to cost? How much is um Do we have a price for Pokemon Z? I forget if they've already said, but how much is that going to cost? Right? Like what is the baseline? Is Mario Kart 80 because it's Mario Kart like is that saved for the cream of the crop or is 80 now going to be the uh the base thing? I just think that's so weird. Like again, we have a Mario Kart Direct coming next week. Yeah, that I think is going to answer a lot of questions. We played Mario Kart. We get I think that we understand the scope of it a little bit better than just watching the the announcement trailer or whatever. like actually getting your",
            "start": 1220.24
        },
        {
            "text": "a lot of questions. We played Mario Kart. We get I think that we understand the scope of it a little bit better than just watching the the announcement trailer or whatever. like actually getting your hands on it, you're like, \"Okay, I see I see what they're doing here.\" Yeah. $80 though, like how is that going to be how is a Mario Kart $80 worth $80 to Nintendo and they're presenting it that way, but and again because Nintendo's so [ __ ] weird and won't talk about the [ __ ] We don't know this for a fact, but let's just assume that the Super Mario Odyssey team's Donkey Kong game is lesser than how. Yeah, I mean, that's a really good question. Like, that's that's a really good question. And I think even separating it from the Super Mario Odyssey team, I think just looking at it as the way Nintendo wants to look at it as far as, hey, we're not telling you who's developing these games, cuz we think all of our games should be treated equally. We think all of our games are on a equal",
            "start": 1263.52
        },
        {
            "text": "way Nintendo wants to look at it as far as, hey, we're not telling you who's developing these games, cuz we think all of our games should be treated equally. We think all of our games are on a equal level as far as how we value them, as far as how we uh look at the how we want f them to be presented to fans. We want fans to be excited for all of our games. However, Mario Kart World is 80 and Don Kong Banance is 70. Like there's some methodology there. It could be scope. Maybe the Donkey Kong game is maybe smaller. Like maybe that's an eight hour game and we don't we're not going to realize it until we get there, right? Like maybe it is the fact that they look at Mario Kart World as oh we put a lot of budget and a lot of time into this thing. We think people are going to spend 50 to 100 hours playing this game. Yeah. Which does make sense cuz it's Mario Kart, right? And like Donkey Kong Bonanza isn't that. I mean, it's just wild that in Nintendo's recent history, the two games that",
            "start": 1309.44
        },
        {
            "text": "hours playing this game. Yeah. Which does make sense cuz it's Mario Kart, right? And like Donkey Kong Bonanza isn't that. I mean, it's just wild that in Nintendo's recent history, the two games that they've given a premium price point are Tears of the Kingdom and now Mario Kart. Yeah. Like, one of these things is not like the other. Unless it is. Unless Mario Kart World is about to be so much bigger than we expected. Like, is there going to be a massive campaign mode? I mean, do you think it is just the fact that Mario there it's the it's more about demand than even scope, right? Like I think Mario Kart I Nintendo doesn't really talk about budgeting, do they of like how much? Yeah, I guess nobody really talks about budgeting in the video games industry cuz I do wonder what that looks like versus a tier of the Kingdom or Breath of the Wild, right? Like cuz us playing Mario Kart World, there is so much charm. There's so much detail. There is so much that just production in it and it's",
            "start": 1344.72
        },
        {
            "text": "versus a tier of the Kingdom or Breath of the Wild, right? Like cuz us playing Mario Kart World, there is so much charm. There's so much detail. There is so much that just production in it and it's not nearly as I assume again us having not played more than you know 30 minutes, right? Like I I can't assume it's anywhere near the scope of a Breath of Wild Kingdom, but I wonder if it is just like, hey, we minmaxed budget in a different direction as far as what you're getting production-wise out of this thing and we know the demand for a Mario Kart. It's always the high or it's been the highest selling title of our platforms for a few generations now. Mario Kart is the topest tier of Nintendo. So, we're going to give it that topest premium, the highest premium price that we can give it. Yeah. I mean, it's a it's a bizarre call. I think I I think it is $80 Mario Kart is I think the most surprising thing to come from uh the any of the Nintendo news in the last week and that includes a new",
            "start": 1387.2
        },
        {
            "text": "I mean, it's a it's a bizarre call. I think I I think it is $80 Mario Kart is I think the most surprising thing to come from uh the any of the Nintendo news in the last week and that includes a new from software game. Can I bring in this uh Sean Leen article? read it. So, this again, this is Jordan Midler. Uh, it reads, \"Former and from Video Games Chronicle, it reads, \"Former PlayStation executive Sean Leaden has said that Nintendo's first party IP is strong enough to mitigate the sticker shock of $80 games.\" Leaden, who is chairman of the company's Worldwide Studios Group when he left Sony in 2019, recently appeared on the playerdriven podcast to discuss, among other topics, the Switch 2. Leaden, who has been outspoken previously about the troubles the games industry has faced while trying to balance production costs with the player expectation of games pricing, shared his thoughts on Nintendo's decision to price Nintendo Switch 2 above Switch 2 games above $70. Quote, \"They poked",
            "start": 1428.24
        },
        {
            "text": "to balance production costs with the player expectation of games pricing, shared his thoughts on Nintendo's decision to price Nintendo Switch 2 above Switch 2 games above $70. Quote, \"They poked through the ceiling of price elasticity where we thought none existed before. Recently, it went to 70 and people went crazy. I think Nintendo is pulling the band-aid right off and saying, \"Look, uh, quote, \"Look like it's look looks like it's $80 for a Frontline game on the new platform.\" Uh, end quote. Lane also discussed how Nintendo leverages IP to negate some of the negative reactions to the increased price. Quote, \"But right here, you see it. Wow, that's kind of a hefty price hike from Switch One to Switch 2. Wow, $80 for a game. If it's the only place you can play Mario, then you get your wallet out and you buy into it.\" that first party exclusivity kind of mitigates the sticker shock, if you will, of these price hikes because you want the content so bad. Uh, end quote. And then the",
            "start": 1472.0
        },
        {
            "text": "wallet out and you buy into it.\" that first party exclusivity kind of mitigates the sticker shock, if you will, of these price hikes because you want the content so bad. Uh, end quote. And then the article goes on to talk about how, yeah, we've only had prices so far of Donkey Kong Bonanza, Mario Kart World, and Nintendo Switch, too. But like I I think there's a point there, right, as far as we in the conversations we've had uh in recent times, we've talked about GTA 6 and how GTA 6 could be 80, 90, $100, right? And that's one of the only games that we think could get away with coming out for that price or at least starting the avalanche of games going up in price in that way. I think we were kind of not looking at Nintendo as being the ones, but to to some extent I think they kind of make sense for it, right? Like $80 Nintendo games, they're already I think Nintendo is already like so I don't even know the word I'm looking for. I like I want to say exclusive. I want to say premium. I",
            "start": 1517.52
        },
        {
            "text": "sense for it, right? Like $80 Nintendo games, they're already I think Nintendo is already like so I don't even know the word I'm looking for. I like I want to say exclusive. I want to say premium. I want to say I guess like prestige as far as how they treat their titles that I think they can get away with it and people are going to be mad. People are going to be upset, but people will still pay the price to play a Mario Kart or play a Zelda or play whatever it is that they're going to charge $80 for. Yeah. I I just I it's so complicated because of just the financial realities of the world right now that I think does change so much of this where I if it weren't the case, I don't think Nintendo would be charging $80 for their games. that's not their MMO to go higher like than others. Like there in the the past like of course there are outlier examples over the last couple decades, but I think more so there's examples of Nintendo trying to be $10 less than the competitors and like trying",
            "start": 1564.32
        },
        {
            "text": "in the the past like of course there are outlier examples over the last couple decades, but I think more so there's examples of Nintendo trying to be $10 less than the competitors and like trying to come in at that um more available open space. I mean, even just look at the Wii, right? The power of the Wii and the the choices that they made to essentially just have it be a glorified GameCube with different features, right? like where we're at now. This is the closest example, and I've said this a million times, of Nintendo actually playing catchup to be in the same ball game as the other guys. Like with the the advancements in PC gaming and how this the scale is kind of like widened in terms of like you as high budget and high production as video games are getting, there's still a desire and need to have them run on lesser quality machines. And we're finally getting to a point that a Nintendo machine is is there with the other guys. And I think that so much of the value of what",
            "start": 1606.56
        },
        {
            "text": "and need to have them run on lesser quality machines. And we're finally getting to a point that a Nintendo machine is is there with the other guys. And I think that so much of the value of what Nintendo's been able to do is create amazing games that don't need to be the most realistic looking things with art, ray tracing, and all this stuff because they don't need that stuff. They have the art style. They they are they make games with a budget in mind to just make magic and then sell that thing. And with everything that they've been doing uh with announcing the Switch 2 of like, yo, 4K, 120 fps, HDR, all this stuff, it's like some of these things are mind-blowing that we spent months talking about they're not even going to have some of this stuff or maybe they won't or whatever, but they freaking do now. And I think that it's crazy that we're getting multiple games being shown like we played Metroid at 120 frames per second. That's wild. And guess what? The game is not as pretty as",
            "start": 1652.16
        },
        {
            "text": "freaking do now. And I think that it's crazy that we're getting multiple games being shown like we played Metroid at 120 frames per second. That's wild. And guess what? The game is not as pretty as Halo Infinite. Sure. Yeah. you know, but who gives a [ __ ] Nintendo are hitting that point of like we have like Nintendo games are now going to technically run great. That's the biggest win ever, right? But I feel like that's the thing is like we've been talking so long about making games like hit the right level. We talk about ballooning budgets of PlayStation and how expensive Spider-Man 2 was and all this [ __ ] and it's like meanwhile Nintendo's bumping out classic after classic, right? With where we're at now though, I just feel like that $80 that's overzealous for this. I just feel like it's anti- Nintendo. It's anti the way that they have done things in the past. And maybe that's the price of getting all these fancy acronyms, the HDRs and 4K. They're not acronyms. Yes, they are.",
            "start": 1694.16
        },
        {
            "text": "it's anti- Nintendo. It's anti the way that they have done things in the past. And maybe that's the price of getting all these fancy acronyms, the HDRs and 4K. They're not acronyms. Yes, they are. Yes, they are. 4K is not, but whatever. Um, do you get what I'm saying? I I I just feel like it's it's it's this I think it's still in the um aligned with I guess more recent generations of Nintendo when I look at um like 3DS and Switch and stuff of people people being like man these Nintendo games never go on sale and when they do it's $5 off when I want to buy the next Pikmin, right? Like I think Nintendo one of the things that they do is they desperately desperate is pretty much a word, right? But like I guess like aggressively try to maintain the value of their games higher than other games so they can look at it and go, \"Hey, guess what? Mario is always going to you're always going to pay the price for Mario, right? You're always going to pay the price for a Nintendo IP because we value",
            "start": 1740.16
        },
        {
            "text": "they can look at it and go, \"Hey, guess what? Mario is always going to you're always going to pay the price for Mario, right? You're always going to pay the price for a Nintendo IP because we value them that much. Without IP, we're not much as Nintendo, right? We got to make sure that we can always charge a high price for these things.\" And I I I think that's been their MMO for like the last decade of of Nintendo. And yeah, maybe that is changing with the acronyms that you're talking about, right? Like maybe it is like the technological leap. Nintendo looks at that and goes, \"Well, shit.\" But I also think it is just the state of the world, right? Like I think it is just the economy and where we're at worldwide with money where [ __ ] just needs to go up because of these words we don't like like inflation and now tariffs, right? Like I think that all I think it all is this delicate math that they're playing. And for Nintendo, the response to that math and Am I I don't want to go too",
            "start": 1783.76
        },
        {
            "text": "like inflation and now tariffs, right? Like I think that all I think it all is this delicate math that they're playing. And for Nintendo, the response to that math and Am I I don't want to go too far with this with u uh uh with this comparison, but I'll I'll I'll step in there, right? For PlayStation or for Xbox, like starting with Xbox, right? I think the way you respond to that math is go is going, \"All right, Indiana Jones, Doom Dark Ages, I all of our games, they're releasing on PlayStation, PC, everywhere.\" I think PlayStation goes, \"All right, we're putting Horizon on PC. We're like expanding into live service. We're doing these things to try and make sure that we can still build those steps to the future and still existing and not going out of business because the [ __ ] takes uh uh [ __ ] costs a lot of money and we got to pay our share shareholders. For Nintendo, I think they're for them it is strengthening and going what is our identity and what is going to bring us the most",
            "start": 1822.72
        },
        {
            "text": "[ __ ] costs a lot of money and we got to pay our share shareholders. For Nintendo, I think they're for them it is strengthening and going what is our identity and what is going to bring us the most money as Nintendo for what makes sense for what our business is. Our business is IPs and exclusivity. Let's raise the prices. like let's make people pay $80 for a Mario Kart and like I think it's gonna pan out for them. I think they're I mean it's gonna pan out. Yeah, that that's not a question at all. It's it's more my question is the actual why and I don't know that we'll ever get that answer. But like I truly believe that it has more to do with just the financial state of the world than it does Nintendo being like Mario Kart should be $80. Sure. But is it that uh means to an end of being able to just justify it and then it creates a new standard? I think all of it's included. Yeah, we'll see for sure. But yeah, it's the fact that Donkey Kong's 70 very bizarre to me. We have some super",
            "start": 1862.56
        },
        {
            "text": "to just justify it and then it creates a new standard? I think all of it's included. Yeah, we'll see for sure. But yeah, it's the fact that Donkey Kong's 70 very bizarre to me. We have some super chats I want to get to before we move on from this. Um, Azio Olivo says, \"I never get to watch live, y'all. Bless Luther video just dropped.\" I know. I I got into the work uh and I Roger was talking to me and as he started talking to me, I saw my phone and I saw the YouTube notification from Kendrick Lamar. It immediately paused cuz whenever you get a YouTube notification from Kendrick Lamar's YouTube channel, it's some kind of like something is going to change your life. Last time it was an album. The time before that he buried Drake. Yeah. So I was like, \"Roger, hold on a second. We got to watch this Luther video.\" Uh Zeke Speak says, \"Dude, what the [ __ ] Bless. You look so good in a soccer jersey.\" Like, \"What the [ __ ] my man? You're certified freak mode right now.\" Certified freak",
            "start": 1904.72
        },
        {
            "text": "this Luther video.\" Uh Zeke Speak says, \"Dude, what the [ __ ] Bless. You look so good in a soccer jersey.\" Like, \"What the [ __ ] my man? You're certified freak mode right now.\" Certified freak mode. I appreciate it. Thank you. I used to uh I was a big Chelsea fan in middle school uh because of DDR Droba. He's the soccer player, African soccer player that played for Chelsea. And I also just love the I mean, come on. Come on. The blue good colors. Come on. Uh then we have Hey, Kuya J saying bless. And who's your super soldier serum dealer? Planet Fitness. There we go. Uh, Planet Adcon says, \"Blated birthday tax have been off all week and finally getting a chance to sit down and watch you lovely people. Keep it up.\" Thank you so much, Planet. Happy birthday. Uh, Robbie Rob says, \"The enchantment is a DLC itself.\" I don't know what he's talking about. Yeah, I can't figure it out. The enchantment is a I don't remember an enchantment in Breath of the Wild, but I don't know. Uh, the",
            "start": 1944.56
        },
        {
            "text": "enchantment is a DLC itself.\" I don't know what he's talking about. Yeah, I can't figure it out. The enchantment is a I don't remember an enchantment in Breath of the Wild, but I don't know. Uh, the Swallzo says, \"The problem is that each penny pinching story from Nintendo has a compounding effect and its impact on sentiment cannot be seen in isolation.\" Yeah. And again, I think it's less the money and it's more just like them the the anger of miscommunication at this point. And then related to money as well, like when a lot of these stories are little things here and there where it's like, \"So, you're telling me if I want to buy all of this [ __ ] it's going to cost an extravagant amount of money?\" And like, it's like the answer is yes. Yes. Yeah. Like, that's what it's going to be. Yeah. Um, Scarlett Libre says, \"I want to thank you guys for having these podcasts get me through a month's worth of overtime at work. I lolled on the Nintendo Canada and Banana Man episode. And tomorrow,",
            "start": 1980.4
        },
        {
            "text": "Um, Scarlett Libre says, \"I want to thank you guys for having these podcasts get me through a month's worth of overtime at work. I lolled on the Nintendo Canada and Banana Man episode. And tomorrow, uh, Gaming Lounge has its grand opening in my hometown. Shout out to Scarlet. I thought about issuing an apology to Canada the other day. I mean, you went a little hard. I'm going to be real. I I and I was getting tweets from Canadians.\" Yeah. And I was like, I've never seen y'all be mean before. It's dude, it's they're far from being so serious. Here's the thing. But I think here's the thing I want I do want to say, right? I just love that damn Maple Leaf. I mean, they do, but also like it's I think it's also bad timing cuz Canadians are very mad at the at um um United States Americans right now. Yeah. Hey, sorry about that. You know, I we fought we fought against this. We were like, \"No, he's a bad bad man.\" But yeah, like hey, I don't mean I don't mean it in a nefarious way. I also hate",
            "start": 2021.84
        },
        {
            "text": "Yeah. Hey, sorry about that. You know, I we fought we fought against this. We were like, \"No, he's a bad bad man.\" But yeah, like hey, I don't mean I don't mean it in a nefarious way. I also hate Donald Trump with all my being. I'm on y'all's side. Yeah. But sometimes I like to laugh. Yeah. the the only thing that what I thought was funny is just like I I was ignorantly unaware uh or like didn't think about the fact that there's Nintendo of other places that don't have development studios. That's my only thing. And then the fact that they had the leaf on it that is very funny objectively. It's Yeah, come on. Let's laugh, guys. It's a depressing time. Let's find ways to have joy. Uh, we have Shaggy Sasquatch saying, \"People keep yelling that every game should be everywhere, yet the only one doing that is Xbox and they're hemorrhaging money. Nintendo keeps exclusive, have a massive war chest and quality games.\" I want it very clear that there are so many opinions about all this stuff. I",
            "start": 2058.96
        },
        {
            "text": "doing that is Xbox and they're hemorrhaging money. Nintendo keeps exclusive, have a massive war chest and quality games.\" I want it very clear that there are so many opinions about all this stuff. I want my opinion clear that I don't think every game should be everywhere. I think that every publisher and developer and hardware manufacturer needs to have a strategy that they commit to and they check in on and they make sure it's working. And that's why I don't think there's a double standard when I in the same breath can say Xbox games should be everywhere and PlayStation games should be exclusive because PlayStation has that strategy and they've proven they can make it work. Xbox tried too many strategies at once which I think then created the situation where it's like all right well now your only choice is to be everywhere to sell these games cuz the games are not selling on Xbox alone. These are just facts. This is not a PlayStation versus Xbox thing. This is a PlayStation has made",
            "start": 2103.36
        },
        {
            "text": "your only choice is to be everywhere to sell these games cuz the games are not selling on Xbox alone. These are just facts. This is not a PlayStation versus Xbox thing. This is a PlayStation has made exclusive games work on its system and until they don't just is what it is. But guess what? They're putting their games on PC and they're finding success there. We're going to see that more and more. That's a strategy changing. That's a good thing. Do I want should everyone be able to play every game possible everywhere? Yeah, I think that's the dream world, right? That's the dream world. Sure. But this is a [ __ ] business and there there has to be choices made and business relies on sound business strategy. Period. I think some PlayStation games should be on Xbox, but that's just me. Yeah, put Hyris 2 on the [ __ ] Xbox. I mean, again, I agree with that that there's strategy there that I think would make sense, but it's not the same. Uh, Casual Vader says, \"Being mad about them charging",
            "start": 2144.16
        },
        {
            "text": "Hyris 2 on the [ __ ] Xbox. I mean, again, I agree with that that there's strategy there that I think would make sense, but it's not the same. Uh, Casual Vader says, \"Being mad about them charging 80, but still buying it is the pass we're giving them.\" All right. Uh, Alex J. Sandaval says, \"Is it possible that Nintendo marked up Mario Kart World by $10 as a way to preload DLC cost instead of having later tracks being a booster pass sold separately? Could this be the closest thing to date for live service of Mario Kart? Oh, brother. Strap in. You're gonna pay for that DLC track, bro. And it's gonna be insane. It's gonna be like $50. Possibly. Yeah, honestly. Yeah. Prepare to pay those DLC costs and prepare to look at the sticker uh price for that thing and be like, yo, what the [ __ ] Why am I paying her tree prices for this for for two and a half tracks? Not even not even a full Grand Prix, Tim. You're getting half a grand for $40. Half a pre. Do you think there'll be a subscription",
            "start": 2185.84
        },
        {
            "text": "am I paying her tree prices for this for for two and a half tracks? Not even not even a full Grand Prix, Tim. You're getting half a grand for $40. Half a pre. Do you think there'll be a subscription service? Uh, I mean, honestly, they do it right. Switch online. Yeah, exactly. That's what it should be. Um, that's Jordan in the chat says, \"Wait, Tim, I thought exclusives were bad like Hades 2.\" This is another conversation last week. Y'all need to stop. Y'all are poking the bear right now. It's just so [ __ ] funny. Like, I again, another thing I want to make clear cuz for some reason people can't listen to the entire conversations that we have here. I don't want Final Fantasy to be exclusive to PlayStation. I want Final Fantasy 7 remake and Rebirth and whatever the next one is to be on Xbox and PC and now Nintendo Switch. I want it to be everywhere. There is no double standard. Does that feel good? Feels good to me. It feels Listen, I feel good about that. Feels great. It's it's the",
            "start": 2229.2
        },
        {
            "text": "and PC and now Nintendo Switch. I want it to be everywhere. There is no double standard. Does that feel good? Feels good to me. It feels Listen, I feel good about that. Feels great. It's it's the impossible thing of We talk about these things in multiple ways at the same time, right? We talk about what we want as the audience. We talk about what we want as fans. We talk about what we what our perception and what our opinions are about the business and strategy and all this stuff, right? And I think people often conflate all that together and think that when I say I don't know when I say Nintendo um when I when I say for example, I guess here, right? I think Nintendo's making the right Nintendo decision to not go to be exclusive and to like maintain the value of other things. I think $8 is bad, right? But like yeah, I could see the business there. That's not necessarily me being like Nintendo should charge $100 for Zelda and do all this [ __ ] right? Like I think you can say both",
            "start": 2270.24
        },
        {
            "text": "$8 is bad, right? But like yeah, I could see the business there. That's not necessarily me being like Nintendo should charge $100 for Zelda and do all this [ __ ] right? Like I think you can say both things at the same time, but naturally the people who are watching and listening sometimes are going to like conflate those. I've seen enough Twitter clips where people will take what I say out of context and I'm like, \"All right, people just don't want to listen to the thing.\" Yeah. God. Uh Christian JPEG says, \"Boo Chelsea, goers.\" Shut the [ __ ] up. There's not a soccer team named Gooners. I'm I'm looking it up. Um are they in the Premier League? That probably didn't. Mr. Hawk says, \"I've got to give a super chat for the beautiful Chelsea jersey Bless is wearing, even though I'm still jobless.\" Dragba is the goat. Good luck on the search. Believe Mr. Oh, I didn't know Arsenal fans are called Gooners. Oh, that's hilarious. That's Why hasn't Gary Wood brought that up? Everybody, we're",
            "start": 2312.48
        },
        {
            "text": "Dragba is the goat. Good luck on the search. Believe Mr. Oh, I didn't know Arsenal fans are called Gooners. Oh, that's hilarious. That's Why hasn't Gary Wood brought that up? Everybody, we're going to get to story number two right after a word from our sponsor. This episode is brought to you by BetterHelp. We all know that therapy can feel like a lofty investment, but we also know that there's nothing better to invest in than yourself. The state of your mind is just as important as your physical health. Let's talk numbers. Traditional in-person therapy can cost anywhere from 100 to 250 per session, which adds up fast. But with BetterHelp online therapy, you can save on average up to 50% per session. Therapy should feel accessible, not like a luxury. With BetterHel, you pay a flat fee for weekly sessions, saving you big on cost and on time. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers",
            "start": 2352.0
        },
        {
            "text": "weekly sessions, saving you big on cost and on time. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. And it isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. Your well-being is worth it. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindafoney. better betterhelp.com/kindafoney. And we're back. And we're back. Story number two. 40 minutes into the show. Toys for Bob would love to work on a new Banjo Kazouie. This comes from Jordan Midler at BGC. A super chat question for you. What would you like Toys for Bob to work on next? Toys for Bob said it would love to work on Banjo. In an interview with content creator Canadian Guy, uh, Toys for Bob studio head Paul",
            "start": 2397.04
        },
        {
            "text": "for you. What would you like Toys for Bob to work on next? Toys for Bob said it would love to work on Banjo. In an interview with content creator Canadian Guy, uh, Toys for Bob studio head Paul Yan was asked which developers or IP would the studio love to work on? I think it's and this is not a joke. I think it's Canadian guy. Yeah. Yeah. You said like it was like eh. Yeah. But it's more like you know, you know what I mean? That's what they do up there. That's what they do up there. That's that's their word. That's their word. Like if I say I'm a bad guy. Yeah. We can't take that. That's theirs. There's so many. And sorry, this is why this this is why we make jokes. Quote, there's so many. And that's one of the exciting possibilities of being independent, uh, said Yan. One company we'd like to work with that we're already working with, Team Xbox. They've been a great partner and they also have a very interesting roster of characters that Toys for Bob could have a lot of fun with. The",
            "start": 2446.64
        },
        {
            "text": "to work with that we're already working with, Team Xbox. They've been a great partner and they also have a very interesting roster of characters that Toys for Bob could have a lot of fun with. The Honey Bear is the first one that comes to mind. I think we can all agree Banjo's been hibernating long enough, right? The rareowned platformer hasn't seen an installment since Banjo Kazoui. Nuts and Bolts, which was released on 360 15 years ago. No, honestly, that doesn't sound long enough. Really? Yeah, Nuts and Bolts sounds like a different generation ago. Like five generations ago, man. In 2020, Spencer said that any revival of classic Rare franchises were up to Rare itself. However, speaking to VGC this summer, as part of an extended interview to mark Banjo's 25th anniversary, a group of original Rare team members said they weren't expecting a new game anytime soon. Cool. I mean, this is like It is fun that they're actually saying it. You know what I mean? Like to have Toys for Bob",
            "start": 2491.52
        },
        {
            "text": "original Rare team members said they weren't expecting a new game anytime soon. Cool. I mean, this is like It is fun that they're actually saying it. You know what I mean? Like to have Toys for Bob straight up say Banjo's name. It's like, all right, I don't think it necessarily means anything, but it also doesn't not mean something. Tony Hawk 3 and four are coming out in a couple months blast. Anything is possible. Uh, Activision's IPs, Microsoft's IPs, any way you want to look at it now, there's so many of them. I think all options are on the table. And we're still in that state of chaos, I think, of the acquisitions still not being like fully like figured out in terms of like who's working on what and who falls under who and all that stuff. But I do think sooner than later that stuff will get ironed out and we're going to get like a new lineup of Xbox announcements, right? That that was like now that South of Midnight is out, you know what I Like I feel like we're starting to get",
            "start": 2530.32
        },
        {
            "text": "will get ironed out and we're going to get like a new lineup of Xbox announcements, right? That that was like now that South of Midnight is out, you know what I Like I feel like we're starting to get that the I'd say we're like halfway through this like the the last generation of Xbox titles and I think we're going to start to get a whole bunch of new announcements, right? What do you What do you think they're working on currently? Toys for Bob Spyro. I mean that's the thing is I I Spyro 4 would have been my bet. They were working on a Crash 5 and then that got canned at some point. So I don't know. Like I'd be I'm just excited for whatever Toys for Bob's working on. I think that they've earned it at this point of just like whether it's a brand new I think it's a 3D platformer. If if you're if you're to put your CEO hat on like your to let's say your Toys for Bob studio CEO hat on and you you're coming off some wins, right? You put out uh Crash 4 quite a few years ago. People love it.",
            "start": 2568.24
        },
        {
            "text": "if you're to put your CEO hat on like your to let's say your Toys for Bob studio CEO hat on and you you're coming off some wins, right? You put out uh Crash 4 quite a few years ago. People love it. It was great, right? And you're trying to figure out what you're doing next and you're now independent. you have access to these Xbox IPs. What are the IPs or what are the games you pick from a business standpoint? I mean, it's just pure business. It's Crash Bandicoot. Oh, before a a new Banjo. I I think a Crash outsells Banjo. Oh, I I I know that hurts for people to hear. I just I just think it's a numbers game. Having said that, they've done Crash recently, so I can I can see them not wanting to over rely on it. You know what I mean? Also, like Crash Rumble, I don't think like set the world on fire in any way. So, it's like you definitely don't want to get back to the point we were at a couple generations ago where like Crash games were a [ __ ] joke. You know what I mean? Crash as a",
            "start": 2616.72
        },
        {
            "text": "on fire in any way. So, it's like you definitely don't want to get back to the point we were at a couple generations ago where like Crash games were a [ __ ] joke. You know what I mean? Crash as a character was a joke. Um, but yeah, I think that uh a Crash game would sell better. But I I think that in terms of IP value, in terms of like Xbox value, Banjo's the move just because it's like goodwill bringing something back that's exciting. Do you think there's like a latent I know this is always an impossible thing to measure but like fan desire for a new Banjo like the return of Banjo Kazoui like I I because I agree with you as far as I guess like overall Crash is as an IP is just a bit more I guess like business makes more business sense than Banjo because Crash has been active you know Crash has an audience that's going to return to it or whatever right and like maybe Crash is a bit more mainstream than Banjo but I think there is like just the sense of Banjo's been gone forever. We've",
            "start": 2664.96
        },
        {
            "text": "has an audience that's going to return to it or whatever right and like maybe Crash is a bit more mainstream than Banjo but I think there is like just the sense of Banjo's been gone forever. We've not gotten a traditional Banjo game since Banjo Tuili in like 2000 or some [ __ ] right? Like I feel like a new Banjo in 2025, 2026 has the potential to like it does take over. I also think that uh the expectations for Banjo are going to be way higher and way more difficult to to meet than a Crash. Crash 4 came out and I'd say more than than less, people were like shocked that it was good. Yeah. You know what I mean? Because I feel like so many people, a Crash Fant, like, oh, this game's actually good. Yeah. You know, whereas like Banjo, I think it's like, oh, we're talking about nostalgia goggles. These are some of the best games of all time, right? Following up on that is a a much tougher cell. I agree with that. Yeah. Yeah, I think that just for the nature of the kind of platformer is I",
            "start": 2711.68
        },
        {
            "text": "These are some of the best games of all time, right? Following up on that is a a much tougher cell. I agree with that. Yeah. Yeah, I think that just for the nature of the kind of platformer is I think Crash when you're talking about making a new Crash game, right? Like there's more linearity there, right? Like I think Crash is a bit more dialed in as far as what you can do with a new Crash nowadays, whereas Banjo, you're almost going up against a Mario Odyssey. Like you're kind of going up against like these platformers that are more explorative and more like collectathon based. And I think there's I think there's more work to be put into making them like way more work to be put in making a new Banjo versus a new Crash. Yeah. And uh we didn't talk about Spyro, but I also think Spyro has a lot of juice in it as well. I think Spyro out of those three, I think Spyro might be on might be at the bottom of the list. I see. I don't know because I I think specifically for Toys for Bob, yeah,",
            "start": 2756.64
        },
        {
            "text": "lot of juice in it as well. I think Spyro out of those three, I think Spyro might be on might be at the bottom of the list. I see. I don't know because I I think specifically for Toys for Bob, yeah, I think Spyro makes the most sense. And Spyro is the one that I think has earned the the follow-up sequel from Toys for Bob the most. Um I think Toys for Bob did the Spyro Reignited trilogy. I want to say yes. I I always keabs will correct me here, but like I always get it wrong of like which of the studios did what. Yeah. Uh with Box and all them, but um I'm pretty sure they did. Anyways, the fact that this many 3D platformers are being talked about at all bless is a good thing. I'm 100% we living in a very good time for platformers. Amen. Uh Riley says Toys for Bob and the Conquer IP. I feel like we got to get B before we get Conquer. I I don't think they'll be right for Conquer. I forget. I had an idea for Conquer and I I forgot what it was. I'll think on it though. There's like a There",
            "start": 2796.88
        },
        {
            "text": "like we got to get B before we get Conquer. I I don't think they'll be right for Conquer. I forget. I had an idea for Conquer and I I forgot what it was. I'll think on it though. There's like a There is a developer that is right for Conquer that we've mentioned before on this show. Was it the High for Life people? I don't think it was. Or High Off Life. I mean, they could make I think their humor fits High on Life. Thank you. Yeah, their humor actually kind of fits Conquer, but there there's a studio there. I just don't think that Toys for Bob is the one. Yeah, I agree totally. Uh we have Vult Dasher talking about the last thing. Why put Hell Divers 2 on Xbox to sell five copies? It's a console that doesn't sell games, unfortunately. I while that is true for a lot of things, I do think Hell Divers is the type of game that could sell on an Xbox. Yeah, I agree. I think multiplayer shooter games th those should be everywhere. That's just how this goes, man. We need the community. Uh Memo",
            "start": 2845.08
        },
        {
            "text": "Divers is the type of game that could sell on an Xbox. Yeah, I agree. I think multiplayer shooter games th those should be everywhere. That's just how this goes, man. We need the community. Uh Memo in the notebook says, \"Y'all, my show last night was [ __ ] lit. Y'all need to go next time. Love you, KF crew.\" Congrats, man. Yeah. Yeah. Uh Kab says, \"Spyro 4. I edit some of CG's vids. He's really cool.\" Awesome. Nice. Uh, and then DMCK says, \"Banjo Kazoui Nuts and Bolts was my jam. By no means the best of the series, but I had so much fun when I was younger messing around with crazy stuff. Toys for Bob making any platformers a win though. Super good remakes.\" That's my thing. It's like anything they do, whether it's Crash, Spyro, Banjo, or a brand new IP, I'm here for it, and I think they're going to nail What would you do if um we get to the end of the Xbox Game Showcase and we get Xbox Games Publishing, Toys for Bob, and then a trailer for Banji Kazooi Nuts and Bolts 2. Yeah. Tough.",
            "start": 2885.04
        },
        {
            "text": "going to nail What would you do if um we get to the end of the Xbox Game Showcase and we get Xbox Games Publishing, Toys for Bob, and then a trailer for Banji Kazooi Nuts and Bolts 2. Yeah. Tough. Yeah, that's that's tough. I believe in Xbox right now, man. I I believe in the next round of games they're going to show. Like I think it's going to be I think we they the dominoes bless have been fallen. Yeah, we are in the midst of it. This is good. I think this is like one of the best times for Xbox games and I think they're going to continue it. Hell yeah. And I think they're going to find success with it, but we'll see. Story number three, uh, Mafia: The Old Country's release dates appeared online potentially. This comes from Jordan Middler at VGC. Some marketing material has leaked. Developer Hangar 13 and publisher 2K called The Old Country the start of a new crime saga for the acclaimed mafia franchise. Set in the 1900s Sicily, the game follows Enzo, who survives a childhood working",
            "start": 2925.44
        },
        {
            "text": "Hangar 13 and publisher 2K called The Old Country the start of a new crime saga for the acclaimed mafia franchise. Set in the 1900s Sicily, the game follows Enzo, who survives a childhood working in the island sulfur mines and finds himself with the opportunity to join Don to Torres's crime uh family. The game scheduled for 2025, but it might be August 8th. August 8th. August 8th. The information was likely planned to be released following PAX East, which will see developer Hangar 13 premiere new gameplay from the game and presumably the release date. August 8th. Cool. Yeah, the 2025's really starting to like clear up in terms of like what's happening and pretty damn exciting. Times like this I still I I wish I still had the Blessing Super fun game release calendar. Yeah, cuz now I'm trying to place it of like what's happening around that time. I know Metal Gear Delta is in August, but is there much else so far in August? Chat, let me know. I I've I saw today and I I don't know where",
            "start": 2974.88
        },
        {
            "text": "to place it of like what's happening around that time. I know Metal Gear Delta is in August, but is there much else so far in August? Chat, let me know. I I've I saw today and I I don't know where this information came from. Um but I saw someone saying that Kirby and the Forgotten Land with the extra stuff is August. which I think is interesting cuz I I think we all kind of assumed that would be launch. Yeah, I did at least. But I guess I could see them they're just going to piece me out. It's kind of crazy like after all the speculation we've done of like how they're going to handle it switch one to switch two stuff. It's like they're literally just doing what they did with the Wii U to Switch. I'm just like, hey, every couple months we're going to release the games again. You're going to buy them. You're gonna buy them again and you're gonna like it. But at least they have they if you there's an upgrade path and all that stuff. Um, and you can still play your old game on the new",
            "start": 3020.56
        },
        {
            "text": "to buy them. You're gonna buy them again and you're gonna like it. But at least they have they if you there's an upgrade path and all that stuff. Um, and you can still play your old game on the new thing, which is right. I can still play Kirby on my Switch, too. Backwards batable. Oh, yeah. Yeah. 100%. Yeah. Yeah. Yeah. Scared me for a second with your pause there. I was like, what were you saying? I just I get confused with the amount of [ __ ] switches and twos and numbers and all that stuff. Um, I take two or um 2K I should say. They like PAX East a lot. Borderlands got like a lot of PAX East stuff. You're right. And I wonder what that I don't I wonder if this is part of that of like, hey 2K, we just see PAXis as like a good place to reveal things. But I I have questions. If you work at 2K, just want to let me know why y'all [ __ ] with Paxi so heavy. Let me know because I also love PAX, you know? And like I remember I remember I wasn't in the room for the Borderlands 3 reveal at",
            "start": 3057.04
        },
        {
            "text": "at 2K, just want to let me know why y'all [ __ ] with Paxi so heavy. Let me know because I also love PAX, you know? And like I remember I remember I wasn't in the room for the Borderlands 3 reveal at PAX East, but I remember seeing the line and being like, damn, that's crazy. And then um Randy Pitchford was in there doing magic tricks. Well, he does. Being like, yo, why won't the trailer play? and started blaming the people running the show. And I was like, \"Randy, chill.\" All right. They're doing their best. Do you remember this? It was hilarious. Randy, oh my god. Uh, Vult Dasher says, \"Sending the last super chat to say thanks. Tim and Bless combo's the best and always engaged with chats. Thanks both of you for being you.\" Thank you, V. Uh, and then we have, uh, Jesus Rivera saying, \"Nintendo has our OG gaming childhood held for ransom. They know we have the money. Vote with your wallet.\" Uh, Pixel and Thing says, \"Tears of Kingdom, and Breath of the Wild upgrades are free for NSO",
            "start": 3097.36
        },
        {
            "text": "has our OG gaming childhood held for ransom. They know we have the money. Vote with your wallet.\" Uh, Pixel and Thing says, \"Tears of Kingdom, and Breath of the Wild upgrades are free for NSO peeps. We're talking about the Breath of the Wild DLC, the Champions Ballad, I think it was called.\" Yep. Um, that's the thing that we need to know. Does that come with NSO or not? Story number four, the final story is Indiana Jones: The Great Circles getting some impressive PS5 Pro enhancements. This comes from Darren Bonto at GameSpot. Uh, Indiana Jones coming to PS5 on April 17th or 15th as an early access bonus for premium and collector's edition pre-orders. And several of the new features for the game on Sony's platform have been revealed. That includes PS5 Pro features that will distinguish it from other console versions including Xbox. Starting in the controller department, the Dual Senses Hap Dual Senses haptic feedback and adaptive triggers have been tied to several parts of the game,",
            "start": 3139.68
        },
        {
            "text": "from other console versions including Xbox. Starting in the controller department, the Dual Senses Hap Dual Senses haptic feedback and adaptive triggers have been tied to several parts of the game, including combat exploration and using indies tools. Uh Bethesda added via the PlayStation blog that the controller's light bars connected to in-game actions with some examples being the LED light pulsing yellow if NPCs are searching for you or red if your health is low. Wow. On the performance side, but to explain that the game will benefit from numerous technical features like frictionless loading, selective installation, and SSD optimization on PS5 and Pro. The game targets a stable 60 frames per second on PS5 consoles. And if you find yourself stumped by any of the puzzles, you can consult the community game help hub. Really? Why? Why? Out of all the games that don't do anything, Xbox supporting PlayStation like they're a first party developer. That's crazy. That's wild. I think there",
            "start": 3184.4
        },
        {
            "text": "the community game help hub. Really? Why? Why? Out of all the games that don't do anything, Xbox supporting PlayStation like they're a first party developer. That's crazy. That's wild. I think there are PlayStation first party games that don't have game help, I'm pretty sure. Uh, and then here's where things get a little crazy. On PS5 Pro, the game will also have impressive visual enhancements. A native 4K 60 mode. Wow. Uh, and advanced rate tracing. Bethesda says machine games work to ensure that this version of Indiana Jones was optimized for the Pro and it was capable of delivering higher and more consistent frame rates. Zam Wow. That's crazy. Wow. I I'm very excited to see Digital Foundry break all that stuff down cuz PS5 Pro I feel kind of needs a win in terms of like I the narrative around it has been pretty bad with a lot of the the pisser stuff is seemingly not hitting the way people want it to. But I also just we're starting to get the new waves of games that are actually",
            "start": 3225.44
        },
        {
            "text": "around it has been pretty bad with a lot of the the pisser stuff is seemingly not hitting the way people want it to. But I also just we're starting to get the new waves of games that are actually like built knowing about this whereas like I think it was a more retroactive for previous games. So I I think that Indiana Jones is probably going to be a good example to look at as like a test bed of what things are going to be like going forward for first and third party games. Yeah. I wonder I mean I I'm I'm very fascinated by is there like a cording process to third parties for how deeply you integrate your features with like PlayStation native things like the game cards thing for example maybe maybe Bethesda and machine games were like oh actually no we want to do this but I when that happens I view that more so of like a I wonder if PlayStation was like hey we'll give you better placement on the store we'll give you like XYZ perk if you support these features so we can talk about it.",
            "start": 3269.76
        },
        {
            "text": "I view that more so of like a I wonder if PlayStation was like hey we'll give you better placement on the store we'll give you like XYZ perk if you support these features so we can talk about it. Same with the PlayStation 5 Pro stuff of like, hey, if you optimize it for PS5 Pro in these ways, like we'll help you out in XY XYZ ways. I I'm sure that's there's like a level I mean, I'm sure it's not just that, right? But like I'm sure there's a level of that kind of back and forth happening, but yeah, it happening. It this is totally normal because it is Bethesda and like Bethesda already has that relationship with PlayStation, right? And I'm sure for Xbox it's going to be the same thing, right? But it is just interesting of all right, cool. Xbox is making a thing and it's going to work really well on a PS5 Pro. Like that's [ __ ] awesome. Yeah, it really is. Uh Alex Frasier says the pro version of AC Shadows is a huge win. That's I haven't heard much about that game uh uh in terms of",
            "start": 3317.52
        },
        {
            "text": "well on a PS5 Pro. Like that's [ __ ] awesome. Yeah, it really is. Uh Alex Frasier says the pro version of AC Shadows is a huge win. That's I haven't heard much about that game uh uh in terms of this. I want to look into that though, but because that is a good example of a new game that came out post PS5 Pro release. Yeah. Right. Um so yeah, cool stuff. Uh you know what? I think I saw Greg playing that in the living room. Yeah. And like every time I glanced over I was like that looks incredible, man. That's Xbox games looking great on PS5 Pro. Big news. Blast. Huge. Huge news. If I want to know some small news, where would I look? You'd go to our last news story, the Wii News Channel. We cover all the small news items you need to know about it. Nude items. Small nude items. Everyone small items. Uh, Night School Studio Auction Free released a new game this week. Black Mir Thronglets is now available on mobile via Netflix. What are we doing? What are we doing? How the mighty have",
            "start": 3356.72
        },
        {
            "text": "small items. Uh, Night School Studio Auction Free released a new game this week. Black Mir Thronglets is now available on mobile via Netflix. What are we doing? What are we doing? How the mighty have fallen. Uh from Noble, Minecraft's user numbers jumped over 30% after the movie premiered. Even more evidence of what we've been saying, man. Also, when I say mighty, I mean like Black Mirror. I'm not talking [ __ ] about Oxen Free. Oh yeah. Nice to go. Even though this is weird, but also I could see that's You know what? That is interesting. Hey, we made Oxen Free. We made these games that people these indie games that people love and adore and Netflix is like, \"Yo, can you make a game for our show? Can you make a game that I'm sure is probably an in show in world game and then spit it out into its own thing?\" Mighty of Fallen. Mighty of Fallen. Yeah. Uh, new Sega Genesis games are now on the Switch online expansion pack. Uh, Esat, City Under Siege, Super Thunderblade. Hell yeah. And",
            "start": 3400.96
        },
        {
            "text": "into its own thing?\" Mighty of Fallen. Mighty of Fallen. Yeah. Uh, new Sega Genesis games are now on the Switch online expansion pack. Uh, Esat, City Under Siege, Super Thunderblade. Hell yeah. And Street Rage 1, hell yeah. Elena joins Street Fighter 6 as a playable fighter on June 5th. Crazy from the Switch launch day. Uh, Infinity Nikki launches April 29th on Steam. Awesome. There we go. That's it, dude. People love that Infinity Nikki. They do. Every every other day, that's a lie. But every now and then, I run into people and they're like, \"Yo, I put in 100 hours in Infinity Nikki.\" Yeah, that's a lot, man. I try to tell y'all. God. Um, let's see what we got here. Tyler Paprik says, \"Tim, I don't play many platformers, but I also fell in love with the story and vibe of South of Midnight. What other game should I try? Not Kaa.\" So, this is interesting. I wouldn't call South Midnight a platformer. And I don't know why not Ka because Kana is the game I would recommend. Maybe they've",
            "start": 3439.36
        },
        {
            "text": "What other game should I try? Not Kaa.\" So, this is interesting. I wouldn't call South Midnight a platformer. And I don't know why not Ka because Kana is the game I would recommend. Maybe they've already played Ka. If you've already played Ka, help me out here, Bless. For South of Midnight type games, I mean, it's it's one of those things of what do you like about South of Midnight? Do you like the story and the world? Do you like the art style? Do you like the like action adventure gameplay? Cuz like if you're saying you like the action adventure gameplay, I'm like yo, play God of War cuz it's going to blow your mind. People in the chat bring it up. Hi-fi rush. And I think that's actually a really really good call there. I like that. Um, if you like the setting, it's it's different, but uh Mafia 3, that's a game that takes place in New Orleans. That's a game I've not played it. I know Barrett Bear has played and I've listened to like Austin Walker talk about it on podcast about how",
            "start": 3491.52
        },
        {
            "text": "uh Mafia 3, that's a game that takes place in New Orleans. That's a game I've not played it. I know Barrett Bear has played and I've listened to like Austin Walker talk about it on podcast about how well it tackles that story u of those characters during that time. Dude, we're getting some banger answers here. We got uh well, Shaggy Sasquatch says psycho that Barrett would uh definitely back. Um CJ Splitz saying Ratchet and Clank. I think that's a really good one as well. Sure. Yeah. Um and uh Stretch Caramel says Kingdom Hearts on easy. That's actually a pretty good call, too. Like very similar like light platforming, but it's more just about like the combat and story and stuff and Yeah. Yeah, I think those are good. Uh Gerald Derivia says, \"Happy Friday, Bless. I need your rematch character to be named Tom Steamboat.\" All right, I'll do it for you. Wait, can you name your We'll get into it. We'll see. Uh Chris Dorson says, \"Thought you guys may be interested. The YouTuber Summoning",
            "start": 3530.56
        },
        {
            "text": "to be named Tom Steamboat.\" All right, I'll do it for you. Wait, can you name your We'll get into it. We'll see. Uh Chris Dorson says, \"Thought you guys may be interested. The YouTuber Summoning Salt just uploaded which Summoning Salt.\" I think Andy likes them. Uh just uploaded part one of his documentary on the Mario 64 120 star speedrunning category. Oh, wait. Summoning Salt is the guy. This is such a stupid thing to say. He's the guy that puts out documentaries on YouTube about speedrunning games. I've watched a couple of them. Very excited about this because obviously 120 star speedrun in Mario 64 might be the peak of human accomplishment. Yeah, I'm not mad at that. Yeah. Yeah. I mean, you're I mean, one of these Mario speedruns, yes, is the peak of of accomplishment. I remember my first time seeing somebody do the backwards long jump up the stairs. That [ __ ] blew my mind. Y blew my blew me away. Uh, it's time for you're wrong. Let's see what we got wrong today. Um, oh, Robbie",
            "start": 3572.8
        },
        {
            "text": "time seeing somebody do the backwards long jump up the stairs. That [ __ ] blew my mind. Y blew my blew me away. Uh, it's time for you're wrong. Let's see what we got wrong today. Um, oh, Robbie Rob says, \"My super chat said enhancement, not enchantment.\" My bad. My bad. That's amazing. Are you [ __ ] with me? I can't even find Tim's Look at Tim's literally scrolling through the super chat. He's all checked. Heck, Robbie's right. You just You just misread it as enchantment. Yeah, brother. Hey, come on, bro. Look at that [ __ ] No, no, that clearly Hey, there. It clearly says enhancement. I don't know what to tell you. All right, man. Kab says, \"Tim got it correct, but I wanted to list it out for everybody. Crash Insane trilogy was Vicarious Visions. RIP. Spyro Reignited and Crash 4 with Toys for Bob. kind of RIP. And then Crash Team Racing Nitro Fueled was Box. RIP. Gotcha. Yeah. Um Oh, this one is interesting from NA. Uh Bless you might be unintentionally meshing 2K and Gearbox.",
            "start": 3616.16
        },
        {
            "text": "Toys for Bob. kind of RIP. And then Crash Team Racing Nitro Fueled was Box. RIP. Gotcha. Yeah. Um Oh, this one is interesting from NA. Uh Bless you might be unintentionally meshing 2K and Gearbox. Gearbox is owned by 2K now. Yeah, but that wasn't until relatively recently. Gearbox has always hosted big PAX East theater shows each year, which of course includes Borderlands News. Other than Mafia this year, I can't remember previous years where 2K itself had such a big showing at PAX East. I when did 2K own like acquire Gearbox? Because I maybe I thought that was that's been longer than it actually has been. I thought that that was for a while. I thought it was a while too. I'm going to look into this. I thought that was a while. That was hella long ago cuz Borderlands 3 was published under 2K and then maybe I mean maybe Borderlands 2 wasn't p. No, that was too chat. Are super chat. Are you sure? Or not super chat. Sorry. This is your wrong person. Are you sure? I'm going to look into",
            "start": 3681.52
        },
        {
            "text": "2K and then maybe I mean maybe Borderlands 2 wasn't p. No, that was too chat. Are super chat. Are you sure? Or not super chat. Sorry. This is your wrong person. Are you sure? I'm going to look into this because I appreciate it. But also, you are you could be right that like this mafia thing is very much an off case and like I I think that's more of the likely scenario. It's just it's just a matter of like I don't see many studio like AAA studios revealing big info about games at PAX East in particular and I know Gearbox has loved PAX East. Yeah. So I do wonder if maybe Gearbox infected them in some way where they're like infected. Yeah. They're like, \"Oh no, this is actually a great place to reveal stuff.\" But I don't know. H. Well, everybody, we did it. Another week of kind of funny games daily in the books. What a great one. We only went 3 minutes over. Wow. That's crazy. That's awesome. I thought we were [ __ ] No, man. Here I What's funny is that I'm surprised we spent so much uh",
            "start": 3724.56
        },
        {
            "text": "daily in the books. What a great one. We only went 3 minutes over. Wow. That's crazy. That's awesome. I thought we were [ __ ] No, man. Here I What's funny is that I'm surprised we spent so much uh time on the first news story cuz I was ready to before the show look at you and be like, \"Yo, we should just ask for a bunch of super chats because we're gonna get through this shit.\" We got them though. And we still got them. That was a great show, everybody. Fantastic. We had fun conversations. We're about to have more today, including Elder Scrolls Online. That's about to play now. And then after that, he's playing a little bit of that rematch. Oh, yes, I am. With his character, Tom Steamboat. Yes, I am. Till next time, it's been our pleasure to serve you. Hey, hey, hey. [Music]",
            "start": 3771.12
        }
    ]
}