{
    "id": 13968,
    "video_id": "tpsSEkufAvk",
    "show_name": "Gamescast",
    "hosts": [
        "Andy Cortez",
        "Roger Pokorny"
    ],
    "title": "The State of Video Game Movies - Kinda Funny Gamescast",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nTime Stamps:\n00:00:00 - Start\n00:04:45 - Housekeeping\n00:13:43 - Roger Watched the Minecraft Movie\n00:34:06 - SuperChats\n00:35:36 - Video Game Movies Dreams\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745263201,
    "duration": 3616,
    "transcript_chunks": [
        {
            "text": "[Music] Hey gamers, welcome to the Kind of Funny Podcast for April 21st, 2025. The Kind of Funny Podcast. That's what I said. Okay. I'm Andy Cortez joined by Roger Courtney. What up? What up, Andy? What up? Happy to be on the Kind of funny podcast today. Yeah, we're we're talking about uh you know your your favorite apples. We're ranking apples today. Finally. Um Roger, you had a an interesting weekend, right? Because your younger brother was visiting. Yeah. And we got to meet the younger brother that we've all been told about for so long. Yes. Reys. Reese. Reese Porn. You always said that your younger brother was really cool. Yes. And I and I understood why. Yeah. Uh cool dude. Cool dude. uh wears a lot of uh uh suits. Lot lot of accessories. Yeah. A lot of accessories. Uh he wore a suit to the office, which I told them don't like, you know what I mean? Like this is the the opposite of a place to wear a suit. But he's like, \"No, I want to show out.\" You know what I mean? He's all",
            "start": 7.05
        },
        {
            "text": "to the office, which I told them don't like, you know what I mean? Like this is the the opposite of a place to wear a suit. But he's like, \"No, I want to show out.\" You know what I mean? He's all about Margella. He's all about all these like fancy brands that I don't even know. Yeah. I don't even know if they're real. Don't even know they're real or not. He wore a suit I was like, \"Isn't that the guy that they didn't they weren't going to put in Tony Hawk, but they ended up putting him back?\" Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Benella. Um, and uh, he wore a suit on an airplane because he thought he heard saw a Tik Tok that if you wear a suit on an airplane, they're going to move your seat and give you like first class, which not true. Not true. He wore suits and he got put in the middle seat twice. Wait, wait, wait, hold, hold on, hold on. Okay, wait. Yeah, there's a lot of He got put in the middle seat. What do you mean? Like he didn't he didn't pay extra for the [ __ ] like the",
            "start": 60.88
        },
        {
            "text": "seat twice. Wait, wait, wait, hold, hold on, hold on. Okay, wait. Yeah, there's a lot of He got put in the middle seat. What do you mean? Like he didn't he didn't pay extra for the [ __ ] like the seat placement. So they just automatically put him in the middle seats and then he thought he'd get out of it by work. Southwest. Is this a Southwest? No. Delta. Like I don't know how he's getting put in these [ __ ] middle seats. How is he not selecting a seat? I don't get that. I don't know. He said he has to pay extra. I don't know what's happening here. But yeah, he said that he he loves wearing suits. Like yesterday again like I we wake up, we go out 10:00 a.m., right? He wears a full [ __ ] suit. And I'm like, \"Bro, are you gonna change for this flight because you have a seven-hour flight at 900 p.m.\" And he's like, \"No, I'm gonna wear this suit the entire time because maybe they move my seat.\" That's psychotic. That's a psychotic thing. But again, it's like, you know, talking to him",
            "start": 98.64
        },
        {
            "text": "at 900 p.m.\" And he's like, \"No, I'm gonna wear this suit the entire time because maybe they move my seat.\" That's psychotic. That's a psychotic thing. But again, it's like, you know, talking to him for just 30 seconds when you two arrived on Friday or Thursday or whatever day it was. Um, yeah, it was very much like, oh yeah, you two are brothers. You two are brothers. And even though like you wouldn't do the suit thing, there's something about this suit story where I'm like that is Roger. Always trying to get around something. Always trying to get something for free. Yeah. No, he's he's he's exact. He's definitely my brother. But the entire time we were together, I I felt like such an old person. He's only four four years younger than me. So I'm 26. So he's 20. That's how 21 22 I think he's 21. Uh so yeah, the entire time he would just call me uncunk. He would say he he he would he would say I'm unc status. Damn. He says that I'm a I'm a millennial coded kid. Uh I'm born in 99.",
            "start": 137.28
        },
        {
            "text": "he's 21. Uh so yeah, the entire time he would just call me uncunk. He would say he he he would he would say I'm unc status. Damn. He says that I'm a I'm a millennial coded kid. Uh I'm born in 99. Definitely not millennial coded. Uh but he says I'm millennial coded. I'm not a millennial, but I'm millennial coded. Um with the actions and the things I do mostly because I just I just don't really drink. I don't really smoke that much. I'm not cool like him, right? I'm not not smoking. I thought Jenzie I thought Jenzie wasn't drinking. We're back now. What? So yeah. No. Well, his I guess he's like a younger Jenzi, right? Uh, so he's 2003 there. We had a few years where we were like, man, maybe we beat all the demons, right? Where we're like, we're not going to be the smoking rates went down, drinking rates went went down, everything went down. But then vaping went up, right? So then we just started vaping and then we just started smoking cigarettes again. And then and then just [ __ ] uh",
            "start": 179.44
        },
        {
            "text": "drinking rates went went down, everything went down. But then vaping went up, right? So then we just started vaping and then we just started smoking cigarettes again. And then and then just [ __ ] uh DraftKings, you know what I mean? Just DraftKings just ruined the entire uh generation. And then we just started gambling. All that people are gay is gambling. Oh, they're gambling. that and also Counterstrike skins and stuff. Counter-Strike skins. Skins. Okay. So, yeah, that started the gambling addictions. And then we just went down the thing. I'm not gambling, but like a lot of people I know are What What got him back to drinking? We We got smoking and gambling. I mean, you know, you can't smoke a heater without a beer. You know what I mean? You can't smoke a heater without a beer. So, yeah. No, we're just going backwards again. So, yeah, he's he looked at me. He's like, \"Yo, you're uncoded. You're millennial coded.\" Uh, so I just kind of get bullied by my brother as he just stunted on",
            "start": 223.92
        },
        {
            "text": "No, we're just going backwards again. So, yeah, he's he looked at me. He's like, \"Yo, you're uncoded. You're millennial coded.\" Uh, so I just kind of get bullied by my brother as he just stunted on me the entire week. So, it was kind of sick. And we watched the Minecraft movie in 40x. So I'll tell you about that. Can't wait to talk all about that because this is the kind of funny games cast or the podcast each and every weekday we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, support us with a kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast to get all of our shows ad free, watch us record them live, and get a daily exclusive show. I don't know what the Gregway is today because it's mine. It's me. Oh, it's Yeah, I uh 20 minutes of my Wrestlemania 41 review. Did I like it? Did I hate it like Snowike Mike? Tune in to find out. I the the",
            "start": 262.48
        },
        {
            "text": "know what the Gregway is today because it's mine. It's me. Oh, it's Yeah, I uh 20 minutes of my Wrestlemania 41 review. Did I like it? Did I hate it like Snowike Mike? Tune in to find out. I the the there was a definite sort of absence of threat today with Greg not with Greg being off. I don't know where he's where he's at. I don't know why he's not here. Yeah. Um, but I am so glad that at no moment music won't play up above because Tim's not here either. So, it's like there's an absence of and an absence of a reason for a threat. But you're here though. Like he could technically cash in on you. Like that's always in the cards. Like he one star. No way. Like why not though? He he can get you to negative stars. That's [ __ ] Then you have to owe a few hundred to cuz every star is $100. Oh [ __ ] Oh [ __ ] Oh [ __ ] That's a false alarm though. That's a false alarm. I uh just like kind I I I had to do quite a quite a venting sesh about my Game Showdown performance. Who? To my chat. Oh.",
            "start": 299.6
        },
        {
            "text": "[ __ ] Oh [ __ ] Oh [ __ ] That's a false alarm though. That's a false alarm. I uh just like kind I I I had to do quite a quite a venting sesh about my Game Showdown performance. Who? To my chat. Oh. And you know I had a great time on Game Showdown and I'm happy that this is my final season. Oh, is that something you're announcing? I'm happy that So Mike Michael will be replacing me. Uh he's more he's more entertaining. Yeah, look at that. I mean, this is my one star. This is the star that you've gotten. That is the one star. Um yeah, I had a great time. And and and I think the way that I look at it, Roger, it's like, you know, kind of feudy was my game. Was it? It was. KDG, where are the stats? KDG has the stats. I was really good at kind of feudy. Okay. But then when it get folded in when when it's trivia questions and you're the person competing doesn't remember the [ __ ] word bagel or or you know like I just don't have a good memory. Roger. Me neither. Yeah. Like the amount of",
            "start": 350.96
        },
        {
            "text": "when when it's trivia questions and you're the person competing doesn't remember the [ __ ] word bagel or or you know like I just don't have a good memory. Roger. Me neither. Yeah. Like the amount of times that I'm on a podcast. How many times does it happen when we're on a games cast and I go ah that [ __ ] what what's that game called? I just don't remember things. Right. And when that's the whole gist is like you got to remember things and I also have the least amount of gaming knowledge between the two. So I'm really at like a double negative sort of thing. But also it also it's a line of questioning here. It's a line of questioning and I'm doing I'm doing this venting um right now because um uh I think um Blessings is maybe at a doctor's appointment or something like that today. So I'm going to do this while he's not here cuz I can't Roger and I are also heavily involved in the show as well. I can't I can't face him and look him in the eyes. Okay. Okay. Um, and also chat, don't",
            "start": 408.32
        },
        {
            "text": "I'm going to do this while he's not here cuz I can't Roger and I are also heavily involved in the show as well. I can't I can't face him and look him in the eyes. Okay. Okay. Um, and also chat, don't get mad at me if you all vote on me for the Twitch points. Like, that's this is your fault. You should know by now. Yeah, you should definitely You should never vote on me. I never I don't remember things, right? I don't know how I got the Leica Dragon pirate Yakuzu in Hawaii. That was awesome. Like, that should go dap you up for that one. That was That should have won me the whole match. But here's the thing. It's got tunic though. Remember that? He did get tunic. That was sick. Remember the one time on the non-sanctioned game that wasn't even official where I was the only one who nailed the Metacritic hit on Bloodborne? Oh [ __ ] Yeah. And we didn't even get We didn't even think that was going to happen. So that wasn't even an official game and I'm the only one who's done it. Yeah. It",
            "start": 453.28
        },
        {
            "text": "Metacritic hit on Bloodborne? Oh [ __ ] Yeah. And we didn't even get We didn't even think that was going to happen. So that wasn't even an official game and I'm the only one who's done it. Yeah. It was not an official game. It was before we came back from break. Like it was an in between season. Yeah. Yeah. So So here's my here's my problem with line of questioning. Let me take a a sip for my monster blue Hawaiian energy drink. Okay. Sponsored. Not sponsored, but man, this is my favorite one. I've been buying this one a lot. Here's my problem with the line of questioning from Game Showdown. Um, first off, anybody getting mad at me for not understanding that question and not knowing the answer, I played Securiro 3 years ago. And not only did I play it, I streamed it, which already puts me at an even more of a disadvantage for information penetrating the brain. You're entertaining. You're entertaining. I don't I barely remember things and if I'm streaming [ __ ] not a not a chance not",
            "start": 488.08
        },
        {
            "text": "at an even more of a disadvantage for information penetrating the brain. You're entertaining. You're entertaining. I don't I barely remember things and if I'm streaming [ __ ] not a not a chance not real. So the it's the way that the questioning was happening that I feel was like a little bit maybe unintentionally sinister by blessing to say in the Sangoku era whatever for that not to be a word for him to omit but then to go Japanese waring factions blah blah blah in the land of blank can't say that word Andy cuz it's a spoiler and you were like sushiva I'm like well I don't know what the you know if Sangoku is not enough of a spoiler, but this blank word is too much of a spoiler. I I I can't think too hard about this and go with something else cuz if it's Ghost of Sushima, I'm going to hate myself. Yeah. Yeah. So, I'm like, it's probably Ghost of Tsushima if that's the word that you're omitting, right? And for it to be Asha and that's too much of a spoiler. Would that have helped you",
            "start": 531.92
        },
        {
            "text": "myself. Yeah. Yeah. So, I'm like, it's probably Ghost of Tsushima if that's the word that you're omitting, right? And for it to be Asha and that's too much of a spoiler. Would that have helped you if you heard that? It would have. Yeah. So, but Sang Goku, I don't know that word. But like, aren't you just proving exactly what why he blanked it? No, but like honestly, if he left he left in the word that didn't give you the answer, but he left out the word that would have given you the answer. Honestly, if he cut off the prompt too soon, if he cut off the prompt sooner, I maybe would have guessed Seiro and been like, \"Yeah, it's like it's this is a question.\" But but when you do in the land of blank too much of a spoiler, but how is like like then don't say Sang Goku or come up with a different game with no like I got to omit this word. Chat also says to be fair, Sang Goku era isn't when Ghost of Sushima takes place. Yeah, but how the [ __ ] do I know that? Like how the [ __ ] do I know",
            "start": 586.96
        },
        {
            "text": "game with no like I got to omit this word. Chat also says to be fair, Sang Goku era isn't when Ghost of Sushima takes place. Yeah, but how the [ __ ] do I know that? Like how the [ __ ] do I know that? You know what I mean? I don't know things. And to go back a little bit of those games. We still we still do feudy. Like we got like three episodes. I haven't been on a feudy in ages. Okay. And when I do, I do well because there's that, you know, there's a random fan. There's a random fan element, you know. Huh. Interesting. I mean, that's my problem with that's my problem with the line of questioning. Okay. Yeah. That they give you a question that you didn't know. Yeah. Like, give me stuff that I know. That's so true. You know, cuz they give Yeah. Tim's like, you know, it's a me blank. Exactly. We got Yeah. We got to make it. That's what his question was. I think, you know, [ __ ] like that. Who says yip cha you know what I mean? Exactly. Not. So that's what So like I had a great time",
            "start": 635.76
        },
        {
            "text": "We got Yeah. We got to make it. That's what his question was. I think, you know, [ __ ] like that. Who says yip cha you know what I mean? Exactly. Not. So that's what So like I had a great time on Game Showdown. Yeah. It's a great episode. And I'm looking to I'm looking forward to filling in for people next season. Whenever. Yeah. Interesting. Yeah. Yeah. Yeah. Interesting. I don't know if Mike would want to play. He's a streamer. We don't know what he's doing. We don't know what Mike is doing. What's his deal? We have no idea what he's doing. Asha doesn't give away Sakura, but Sushima gives away Ghost of Sushima. Yeah. Thank you. Thank you, pixelated soul. Are they agreeing with you? Yeah, they're agreeing with me. Yeah. Yeah. Yeah. Yeah. Oh, yeah. Oh, absolutely. This is UNC status right here. I'm just like I'm I'm just I'm tired of it. I'm tired of being bad at a game that I know I'm bad at and further exacerbating my knowledge that I'm bad at remembering things, you know. Yeah.",
            "start": 675.36
        },
        {
            "text": "here. I'm just like I'm I'm just I'm tired of it. I'm tired of being bad at a game that I know I'm bad at and further exacerbating my knowledge that I'm bad at remembering things, you know. Yeah. But you remember how salty you are about this. Yeah, of course. Yeah. You'll never forget that. Of course. Absolutely. Uh we're 11 person business all about live talk shows. We had a kind of funny games daily earlier with Jericho and Stack Mike. And after this, we got the kind of funny podcast and a sponsored stream of Allen Wake 2 sponsored by Nvidia where Mike and uh Nick will be showing you just how freaking gorgeous that video is. They're going to afterwards they're going to still stream a little bit and talk a little bit. Little Mike and Nick in the afternoon. Little Mike and Nick in the afternoon. If you love what we do, support us with a kind of funny membership on Patreon. Uh and for a chance to be a part of the show, submit your thoughts and opinions as YouTube super chats as we go.",
            "start": 714.64
        },
        {
            "text": "If you love what we do, support us with a kind of funny membership on Patreon. Uh and for a chance to be a part of the show, submit your thoughts and opinions as YouTube super chats as we go. So, make sure you got them super chats in because I know there's gonna be a lot of recos about video game movies. Oh, I like that. There's a lot of movie heads out there. I'm not one of them. I did I did see you. I not to spoil anything, but I did see you. I walked past your desk and you were looking at directors and I saw a big photo of Bong Jungho just you were just staring at it. You're just ho movie inside. What could he make? That's what I'm thinking. Inside. Inside's where I'm at with that. Okay. I like that. Uh thank if you're a kind of funny member once again you have Rogers Greg Gray and thank you to our Patreon producers Anatoli ask Delaney Twining Carl Jacobs and Omega Buster. Today we're brought to you by Imperial and Aura Frames but we'll tell you about that later. For now let's",
            "start": 757.2
        },
        {
            "text": "thank you to our Patreon producers Anatoli ask Delaney Twining Carl Jacobs and Omega Buster. Today we're brought to you by Imperial and Aura Frames but we'll tell you about that later. For now let's start with the topic of the shows. Roger watched the Minecraft movie in 40X and his review is about to happen now. But first, I just want to read from Variety real quick from Rebecca Rubin because as of yesterday 420, smoke them up. Smoke them if you got them. Minecraft surpasses $720 million at the global box office. Now, it did get taken down by Sinners over the weekend domestically, which is great for Cougler and Co. Yeah. Uh but yeah, Minecraft $720 million. That was pretty damn fast. Yeah, it is going to hit that billion dollar mark. see a lot of people going, \"Hey, we gotta just embrace the chicken jockey.\" Popcorn going all over the place. [ __ ] do it. Yeah. And then, you know, like it's bringing movie theaters back right now. This is like something we got to capitalize on.",
            "start": 795.52
        },
        {
            "text": "the chicken jockey.\" Popcorn going all over the place. [ __ ] do it. Yeah. And then, you know, like it's bringing movie theaters back right now. This is like something we got to capitalize on. Meanwhile, you got 17-year-old kids like having to clean up popcorn the night before they go to class. So, Roger, you got to watch this in 4DX. Yeah. Which is at our Regal Theater, right? The one. Yeah. Don't dox me, bro. How dare you? You know what I mean? How [ __ ] dare you. People are going to show up and wait for me now. You're going to go to the Regal Theater. That was like one of the biggest mistakes I remember thinking of. Whatever was it what holiday was it that we took Carl Jacobs there and it was like we forgot President's Day or something. We forgot kids were Yeah, it was President's Day and it's like, \"Oh my god, there's so many kids off from school right now.\" And everybody had the moment as we're walking up. She's like, \"We're It's President's Day. It's filled and we're bringing",
            "start": 850.56
        },
        {
            "text": "and it's like, \"Oh my god, there's so many kids off from school right now.\" And everybody had the moment as we're walking up. She's like, \"We're It's President's Day. It's filled and we're bringing Carl Jacobs and Chandler from Mr. Beast to an theater.\" They got stopped so many times. So many times by a bunch of kids. So you got to watch M. Was it was it with your brother? Yes, it was my brother. It was his second viewing. And also the second time that he's watched the Minecraft movie in a full suit. So yeah. So it's the suit is not just a bit like it's just happening all the time. He's wearing the suit. Well, it's like the Minions movie when everybody was wearing the But it's unironic for you know what I mean? Like he's just wearing a suit all the time. So it doesn't really matter where Sunday best. Sunday Best. Uh yeah, I saw 40X. Uh if anyone doesn't know what 40X is, uh first of all, it's a [ __ ] experience. If you have a 40x uh compatible theater around you, you got to go. You",
            "start": 889.92
        },
        {
            "text": "Sunday best. Sunday Best. Uh yeah, I saw 40X. Uh if anyone doesn't know what 40X is, uh first of all, it's a [ __ ] experience. If you have a 40x uh compatible theater around you, you got to go. You got to run to your theater right now and watch any movie you can in 40X because don't even look it up because it is an incredible experience. Gavvatarus in the Twitch chat says, \"40x, we throw the popcorn for you.\" Yeah. Which is a good a great call right there. Yeah. So 40x is exactly what you expected, but even crazier. Uh it is a handmade tailored experience where the seats move and adjust uh based on what's happening on the screen. It also has uh water that spurts in your face and wind turbines and uh they start whipping the back of your feet. Strobes. Yeah. Strobe lights. Uh fog machines. Uh it is a true 40x 40 experience almost like you would find in some type of like Disney ride or something like that. Yeah. So imagine a roller coaster where you sit in pods of four. Yeah. That's how",
            "start": 925.04
        },
        {
            "text": "Uh it is a true 40x 40 experience almost like you would find in some type of like Disney ride or something like that. Yeah. So imagine a roller coaster where you sit in pods of four. Yeah. That's how the theater is where it's all pods of four. Uh and that like that's how you know that if you sit towards the front, you're going to get all the splash. You know what I mean? Yeah. Yeah. But it's actually individual splashes. That that's always the biggest thing is when you take someone to 4DX for the first time, there's a there's a big thing. The only the only feature the only turn on and off button in the entire uh seat setup is water on, water off. That's all they show you. So my brother sits down and it just says water on. And he's like, \"What? I don't know what to do with this. Leave it on.\" I told him, \"Leave it on.\" Uh so yeah, I I was first of all just not a believer in 4DX in general. But I think the last two times I've went to 40X, I've become a full believer. I love 40X. I",
            "start": 967.68
        },
        {
            "text": "it on.\" I told him, \"Leave it on.\" Uh so yeah, I I was first of all just not a believer in 4DX in general. But I think the last two times I've went to 40X, I've become a full believer. I love 40X. I enjoy. It's a This is my second time watching a movie for the first time at 4DX, if that makes any sense. So, I saw Godzilla minus one for the first time in 4x. So did I. That was not the right way to watch that movie. But Minecraft, absolutely the right way to watch that movie. Uh I Captain America the right way to watch the movie as well. Yes, that was my second time watching. Did you watch it for the first? No, you didn't watch it for the first time at 40x. No, it was the second time. Yeah. Yeah. But Minecraft movie, guys, I want to be honest. No, [ __ ] Christ. I'm not It's not even a bit, y'all. I love this movie. I had a great time watching the Minecraft movie, and it is like It's a really good adaptation of the Minecraft world, man. I'm serious. Like, so, okay, let's just start off.",
            "start": 1006.16
        },
        {
            "text": "y'all. I love this movie. I had a great time watching the Minecraft movie, and it is like It's a really good adaptation of the Minecraft world, man. I'm serious. Like, so, okay, let's just start off. It's a seven out of 10. It's not like the greatest movie I've ever seen. It's not like mind-blowing. It's not whatever. It's I'm not going to look at you and say that it's changed my world, but I'm gonna I would be lying to you if I look if I looked at you and said I didn't have an awesome time in the theater. Of course, that is with the 40X, right? They're throwing me around in this theater. The original headline for this, which you might have caught, was Roger got beat up by the Minecraft movie because I was like, \"Oh, it's a funny headline.\" And Greg was like, \"Let's put it up there.\" And it isn't not true. Like, I did get beat up by this movie. There are moments where they're flying me across like I I got scared. You get you're get giggly. Giggly. And then I also just got genuinely",
            "start": 1047.72
        },
        {
            "text": "it isn't not true. Like, I did get beat up by this movie. There are moments where they're flying me across like I I got scared. You get you're get giggly. Giggly. And then I also just got genuinely scared at one moment. We Yeah, we had the giggles. I'm I'm I was sitting next to you. Yeah, you weren't in my pod when we w Captain America, but there's a there was a moment where I like Roger's full body like did that with his his left arm just flinging and then we just like we're dying of laughter. So you there were dangerous moments like that in the theater. Uh yeah. Yeah. There was one moment where uh you know I don't want to spoil the Minecraft movie, but like people are flying around. People are flying around on something, right? They're flying around. There's maybe some 69ing happening. Gonna put it out there. It's true. What's happening? some 69ining in the air while people are flying. What's this movie rated? To find out the 40X was they put the X in 40X. Oh wow. Okay. Uh no, there",
            "start": 1084.48
        },
        {
            "text": "put it out there. It's true. What's happening? some 69ining in the air while people are flying. What's this movie rated? To find out the 40X was they put the X in 40X. Oh wow. Okay. Uh no, there there's some flying around and yeah, there is it's like on they're on a firework and there's fireworks happening and there's strobe lights and we're going up and down and the theater's like moving and shaking and there's uh Thank you. Cory Cutney in the chat says I think you can spoil the Minecraft movie. Yeah, I you know I you guys should watch it because it's directed by Jared Hess who is the director of Napoleon Dynamite and uh Natural Libre, right? So which is you're you're like okay that's a little weird. It makes this movie so much more watchable like in a in a real genuine way because the human element of it is so reminiscent of specifically Nacho Libre less of Napoleon Dynamite. There's like a lot of references to Napoleon Dynamite throughout the movie but the Nacho Libre of it is so",
            "start": 1128.04
        },
        {
            "text": "human element of it is so reminiscent of specifically Nacho Libre less of Napoleon Dynamite. There's like a lot of references to Napoleon Dynamite throughout the movie but the Nacho Libre of it is so apparent for a few things. The first thing is there are a ton of human characters, right? And Jared Hess refuses to have an ounce of genuine sincerity in the entire film and it's for the better. That is the reason why this movie is so good in my opinion because he doesn't he does the generic like uh you know, oh, we have to have an emotional beat where this character like finds themsself or whatever. But it's they don't really do it. They just make fun of the fact that they're doing it in order to do it. If that makes any sense. Uh it's it's a lot more satirical in nature in the way that they handle the human characters uh specifically with Jason Mamoa's character and uh Jack Black's character. Jack Black and Jason Mamoa are basically cartoon characters as you can expect, right? So that's",
            "start": 1169.84
        },
        {
            "text": "handle the human characters uh specifically with Jason Mamoa's character and uh Jack Black's character. Jack Black and Jason Mamoa are basically cartoon characters as you can expect, right? So that's fascinating because Jared Hest uh director of Nacho Libre immediately you go, \"Oh, that's the Jack Black connection. That makes sense.\" But then the reports were that Matt Barry was originally supposed to be Minecraft Steve. Yes. Yeah, that was I think there was some scheduling thing which I don't honestly believe. I feel like that's like the studio being like, \"No, you got to put Jack Black. We need Jack Black. We need Jack Black.\" Yeah. Um but this is honestly I I I think Jack Black is great in this movie. And specifically because I think a lot of people look at Jack Black now and they're like, \"Oh, it's like we know what we're getting, right? It's the generic Jack Black, you know, he's going to go over the top crazy with it.\" But there's a specific quirkiness of Jack Black that you get",
            "start": 1213.28
        },
        {
            "text": "\"Oh, it's like we know what we're getting, right? It's the generic Jack Black, you know, he's going to go over the top crazy with it.\" But there's a specific quirkiness of Jack Black that you get from certain directors. Sometimes you get like the generic Jack Black from like Jumanji who's really good, but he's just like, you know, quirked up, you know, he's he's saying every line really loud and and doing anything crazy. But then you get like the weird Jack Black with a little bit of like that Nacho Libre essence to it. And that's what you get here. You get it's like the it's the percentage of line reads with while making a certain face. Yes, exactly. Uh there's you can tell that Jack Black is having a good time here and he is he's able to be full Jack Black in all of this. uh in in a way that I it it tickled me. It didn't tickle any of the kids. The kids would not find Jack Black or Jason Mamoa in the human world funny at all. Wait, how old are these kids? Oh, I was it was in a pack",
            "start": 1257.12
        },
        {
            "text": "that I it it tickled me. It didn't tickle any of the kids. The kids would not find Jack Black or Jason Mamoa in the human world funny at all. Wait, how old are these kids? Oh, I was it was in a pack theater full of like maybe like 8-year-old, nineyear-olds. Like these kids were not laughing. They were not laughing at Jack Black or Jason Mamoa in the real world. They only laughed at them in the Minecraft world specifically when there was a Minecraft adjacent element or there was a uh butt joke. They love the butt jokes. Anytime there was anytime Jason Mamoa said, \"Oh, you're too close to my butt, Jack Black.\" Which happens a lot. Jen Alpha loves butt jokes. They love the butt jokes. They love the butt jokes, which I get. But the first So even silly slapsticky stuff that Jack Black may be doing in the in the beginning of the movie. No, not really. And now I'm confused with you saying in the human world and the Minecraft world. Yeah. Are do they ever turn into Minecraft looking",
            "start": 1294.64
        },
        {
            "text": "may be doing in the in the beginning of the movie. No, not really. And now I'm confused with you saying in the human world and the Minecraft world. Yeah. Are do they ever turn into Minecraft looking characters? No. No. No. No. No. No. They go from the human world like the regular world to the Minecraft world as humans. Like a Jumanji thing. So, hold on. Hold on. Wow. I mean, this could be massive spoilers, but Minecraft Steve existed in the real world. Yes. At one point. Oh, I thought he was just sort of the sherpa for the Minecraft world when they when the humans arrived there. No, no, no, no, no. So, so yeah, I guess it's it's the first five minutes of the movie, right? But like Minecraft Steve is just Steve in the real world. He's a kid. He's a He's a little kid who wants to go to the mines. His name is Steve. He's Jack Black. He wants to go to the mines. They're like, \"No, no kids can go in the mines.\" He grows up, has a shitty job, and he's like, \"Wait, I need to fulfill my",
            "start": 1335.68
        },
        {
            "text": "the mines. His name is Steve. He's Jack Black. He wants to go to the mines. They're like, \"No, no kids can go in the mines.\" He grows up, has a shitty job, and he's like, \"Wait, I need to fulfill my childhood dream. I need to go to the mines.\" He goes to the mines, he starts mining, [ __ ] finds the portal to Minecraft world, goes to the Minecraft world, and he lives in the Minecraft worldass for a very long time. Okay. Yeah. So, then it's like he is like kind of like the the uh the Jumanji. Yeah. Yeah. Robin Williams Jumanji situation. So, yeah. And then he's stuck in the Minecraft world and then Jason Mamoa and the kids have to come in and save him or figure out what's going on there. So yeah, it's a it's kind of a dual location movie. Minecraft world, human world. Minecraft world. How did you feel about uh Valkyrie Ray not showing up in the movie because she was really angry at Jason? Yeah, that was that was that's that's wild, right? Like that's crazy, dude. Apparently he was just",
            "start": 1377.36
        },
        {
            "text": "you feel about uh Valkyrie Ray not showing up in the movie because she was really angry at Jason? Yeah, that was that was that's that's wild, right? Like that's crazy, dude. Apparently he was just being really rude to everybody and she was like, \"Yeah, it's kind of a shame.\" He called him out and then they just cut her out of the movie. So I mean, there has to be some truth to that. That sucks. That sucks. Really unfortunate. That sucks. Um but I justice for Vaky, right? You know, that's what I'm saying. The biggest thing for me that makes this movie good and like a really good adaptation of the source material. They don't talk down to the source material. Like the the I think the first instinct at least I would have as like a hack movie director writer would just be like, \"Well, everything's a block. Why is everything a square?\" Like just start laughing at the thing a little bit and then eventually have the characters just fall into the world and like fall in love with it. They treat",
            "start": 1415.2
        },
        {
            "text": "a block. Why is everything a square?\" Like just start laughing at the thing a little bit and then eventually have the characters just fall into the world and like fall in love with it. They treat the Minecraft world with such reverence and love like in a real way. Like there there's so many references to every single little thing that you can find the the blocks the in jokes and also like the gameplay of it like the adaptation of the first night of Minecraft. So when the characters get in there spoilers I guess we're doing [ __ ] spoiler cast here. The characters get into the Minecraft world and they have like the moment where after 20 minutes it becomes like nighttime, right? And they make jokes about how fast the night cycles or whatever. It becomes nighttime and it becomes like a horror movie, right? Where they're like, \"We don't know what to do. We don't know how we have to make like a fort or whatever.\" and they capture that first night. I I don't know if you remember your first",
            "start": 1454.56
        },
        {
            "text": "movie, right? Where they're like, \"We don't know what to do. We don't know how we have to make like a fort or whatever.\" and they capture that first night. I I don't know if you remember your first time you played Minecraft and it turns to nighttime. I was really young when I played Minecraft. I guess I should preface that and say that. I don't know when you first played Minecraft. I was like nine, 10. It It must have been a long ass time ago and then I didn't really ever go back to it until kind of more recently with kind of funny. But I I I feel like I probably hopped in hearing [ __ ] hearing Greg and Alano talk about it, you know, like it was a long time ago. You know, I was I I fell in love with Minecraft when I was like 9 or 10. And I remember like literally it was it was I was so young that I would like go onto the Xbox Live Arcade and try to find the knockoff Minecraft games because it wasn't even on console yet. Like I was trying to play it like that. Uh so I I loved",
            "start": 1492.16
        },
        {
            "text": "was so young that I would like go onto the Xbox Live Arcade and try to find the knockoff Minecraft games because it wasn't even on console yet. Like I was trying to play it like that. Uh so I I loved Minecraft and I grew up with it. So I I remember vividly the first time I played with my friends and like it turned to nighttime and I had to figure out how to deal with the skeletons and the creepers and that fear. They capture that so perfectly in the uh first in the very beginning of the movie. Uh, so it's like it's little moments like that that add up on top of the weirdness of like Jennifer Culage uh in this movie is so funny. She's in the movie. Yes. She plays the vice principal uh of this movie and she has the it is the weirdest subplot plot because I could tell I could feel the vibes that this was about to be cut. Like I could feel the vibes of like Jared Hessa being like no this has to stay in the movie cuz no children laughed at it. No children laughed at it. It is not funny to",
            "start": 1529.04
        },
        {
            "text": "that this was about to be cut. Like I could feel the vibes of like Jared Hessa being like no this has to stay in the movie cuz no children laughed at it. No children laughed at it. It is not funny to any child. It is the funniest thing in the world to me and Leonza and Rea because it is it is just Jennifer Kulage and spoiling it. She falls she falls in love with a villager in Minecraft. The Minecraft villager comes out of the portal like he's the only thing that goes into the real world like after they go back in and then she hits him with uh her car and then she just falls in love with him the entire movie. They just cut back to it like out of like in the middle of an action scene. They'll just be like, \"Here's Jennifer Coolage on a date with the villager from Minecraft.\" And then they're just falling in love. It is incredible. Jared has to be like, \"This is for me.\" Literally, it is for it is for him. It is for the weirdos. And there is just good humor in here. Like there's there's",
            "start": 1568.64
        },
        {
            "text": "just falling in love. It is incredible. Jared has to be like, \"This is for me.\" Literally, it is for it is for him. It is for the weirdos. And there is just good humor in here. Like there's there's moments of just like the human characters interacting that works well. Uh and then without the Minecraft of it all is just is just funny because Jared Hess is a good director and knows how to write comedy. Uh, but I will say my negatives real quick. You know what I mean? The negatives of the Minecraft movie. We didn't need any of the kids. We needed to have the kids just because it's a kids movie. We could have just had Jason Mamoa and Jack Black and we would be totally fine. They just got to kind of ignore all the other characters. Jake Jack Black and Jason Mamoa are the heads are the leads of this movie. Everyone else just kind of falls into the into the wayside. Um, and the set design is gorgeous. It's beautiful. It's awesome. But is it how much of is it practical? Do you think a lot a",
            "start": 1608.64
        },
        {
            "text": "this movie. Everyone else just kind of falls into the into the wayside. Um, and the set design is gorgeous. It's beautiful. It's awesome. But is it how much of is it practical? Do you think a lot a lot a lot is practical? like they are interacting with the chest like every time there's a chest he's opening it up and picking up things like it's a tactile element to to the movie and the crafting of it does feel not real but you know like they're picking up actual physical things uh and there are moments where it's like clearly that is Jack Black on a on a st sound stage with like the characters behind him green screened but uh there's a fair amount of like practical stuff going on there. It's It's an impressive movie and like in a way that again I I understand we want to [ __ ] on it cuz Chicken Jockey and all that stuff, but I will say by the way, Chicken Jockey didn't get a huge laugh in our theater. No way. Kids didn't freak out. They're not on TikTok probably. No, they were they",
            "start": 1646.08
        },
        {
            "text": "Chicken Jockey and all that stuff, but I will say by the way, Chicken Jockey didn't get a huge laugh in our theater. No way. Kids didn't freak out. They're not on TikTok probably. No, they were they were people were recording. I guess they just maybe were so desensitized to it. You know what I mean? They're just like I don't know. Or or they heard the calls for people to chill the [ __ ] out and they're like super respect or maybe it was the 40X like got them all [ __ ] up. You know what I mean? Like rattled their little brains. I don't know what concussions. Yeah. Yeah. A little bit of a concussion. has uh do you think enough time has like obviously when when we talk about pop culture and memes and I think back to eight years ago where a meme would last a good year and a half have we already crossed a it's it's a week it like chicken jockey is no longer funny I could see that like that's already cringe yeah I think so I I think I think we've gone there but also I know it's late",
            "start": 1683.92
        },
        {
            "text": "already crossed a it's it's a week it like chicken jockey is no longer funny I could see that like that's already cringe yeah I think so I I think I think we've gone there but also I know it's late because the screener that I went to or I think the maybe the one afterwards they had specifically on the website a Minecraft movie 40x chicken jockey experience. That's what they were calling it. So it's like okay we've already we're already washed. We're already washed. Like so once once corporate gets involved it's done. Don't try to make me like this. Yeah. It's done. It's done. Uh once the brands start tweeting about it. Yeah. Exactly. Once they they have to I think I saw them like try to do like the popcorn bucket like too late to like they're trying I'm like no it's over now. Uh well I know real quick. I know that AMC start came out with the warnings. Oh, in the beginning like or maybe it wasn't AMC, but other theaters came out with warnings beforehand be they didn't show mine. They",
            "start": 1721.92
        },
        {
            "text": "real quick. I know that AMC start came out with the warnings. Oh, in the beginning like or maybe it wasn't AMC, but other theaters came out with warnings beforehand be they didn't show mine. They were don't 40x is a is is a wild west. You can do whatever the [ __ ] you wanted for it. You can talk. You can stream. You can you can you can live stream on TikTok. It doesn't matter. We don't We were laughing and talking so much. I am such an [ __ ] about that. Like I do not want to talk on a theater. I don't want anyone on their phone. 40x [ __ ] do whatever you want. I do not give a [ __ ] That's how I That's how I felt after the few several shakes in Captain America. And then I think I turned to to like to our group and was like, \"Why do they care if I use my phone?\" This is the most insane experience of all time. You just you look at the sea of people just do like coordinated shifting. And this is the last thing I want to say on the Minecraft movie before we move on is that, and this is",
            "start": 1762.32
        },
        {
            "text": "of all time. You just you look at the sea of people just do like coordinated shifting. And this is the last thing I want to say on the Minecraft movie before we move on is that, and this is going to get people mad, but I stand by it. We celebrate the Sonic movies in a real way of like they are they are great for the source material. They they they adapt Sonic as a character really well. But what they don't do, and they've gotten better over the movies, takes them three movies to finally get there, is they don't really adapt the world of Sonic as well, right? Because we don't go to Green Hill Zone. We don't we it's just all these characters are in the real world and then we slowly are getting all the characters in the real world and now eventually we'll get to Green Hill Zone like four movies down, right? The fact that this movie takes all the human characters and throws them in the Minecraft world and has so much reverence and love for the world of Minecraft literally in like the",
            "start": 1801.36
        },
        {
            "text": "movies down, right? The fact that this movie takes all the human characters and throws them in the Minecraft world and has so much reverence and love for the world of Minecraft literally in like the deepest of like the most like shallow surface level [ __ ] of like creepers, but then also like the most like hardcore like nerdy [ __ ] that you can find. Like there's so many Easter eggs. I think it does the I think it is more accurate and uh pure to the source material than it is than Sonic is to its source material. And I mean that for real. like and it it it's not better movie necessarily, but it is more like, hey, this is an adaptation of the source material in a more direct way than Sonic is to its source material. So, wow. Take that for what it is. I really enjoyed this movie and I thought it was pretty cool. Well, we're going to be talking about more video games and more movies after a word from our sponsors. This episode's brought to you by Imperial. We've told you all how",
            "start": 1837.36
        },
        {
            "text": "I thought it was pretty cool. Well, we're going to be talking about more video games and more movies after a word from our sponsors. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shields and the powerfully ranged cannon. With a deep",
            "start": 1879.28
        },
        {
            "text": "a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shields and the powerfully ranged cannon. With a deep ability system, extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode's brought to you by Araf Frames. If you haven't called your mom in a while,",
            "start": 1926.0
        },
        {
            "text": "Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode's brought to you by Araf Frames. If you haven't called your mom in a while, here is your reminder to do it. But then, if you want to go above and beyond, Mother's Day is coming up and I have the perfect gift idea. Aframes are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Trust me, Gia's dad does, Greg and Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. And I know that from experience. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aframes.com",
            "start": 1974.24
        },
        {
            "text": "to set up a frame using the Aura app. And I know that from experience. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aframes.com to get $35 off plus free shipping on their best-selling Carver Matt frame. That's a rafra.com. Promo code kind of funny. Support this show by mentioning us at checkout. Terms and conditions apply. And we're back and we got some super chats. We have a $2 super chat from Yelsing who says, \"Batty Andy and Papa Raj, severely underrated duo. Thank you, Yeling. That's very That's very kind of you. Thank you. Uh we got Riley says, \"When 40x doesn't work vis 40x doesn't work visually cuz I'm blind in one eye.\" A but it isn't always even a 3D movie, right? Yeah, sometimes it is though. Like this this Sorry, I should say the chicken jockey experience was 3D for me. So yeah, sometimes they've been doing that a lot lately. I think we saw Captain America in 3D. You're right. They try to like put it all",
            "start": 2019.44
        },
        {
            "text": "I should say the chicken jockey experience was 3D for me. So yeah, sometimes they've been doing that a lot lately. I think we saw Captain America in 3D. You're right. They try to like put it all together cuz I think they can charge like an extra like $8 on top of like the 3D and 4D. Man, it's You go watch a movie in 4x. Yeah. Like you you may not be able to eat lunch for that week. No, it's it's going to be a $38 experience. Uh Alex Frasier uh says, \"I love that Greg's music now creates a Pavlovian response from the entire Kind of funny team.\" Yeah, it's scary. I knew it was a bit that he was that Barrett was doing, but still there was a part of me that was like maybe maybe it isn't. It still hit you and made you, you know, have a little bit of fear. Mhm. Um Oh, Jesus Christ. Oh [ __ ] Um, so Raj, you gave me a link that kind of shows a bunch of movies that are in in development. Yeah. You want to read some of them off to me? Yeah, sure. I mean, well, we have this week or next Yeah,",
            "start": 2073.2
        },
        {
            "text": "so Raj, you gave me a link that kind of shows a bunch of movies that are in in development. Yeah. You want to read some of them off to me? Yeah, sure. I mean, well, we have this week or next Yeah, this week, uh, we have the Until Dawn movie, April 25th. Very excited for that, actually. Weirdly enough. Did you're looking at me like, I didn't know there was an Until Dawn movie. I I did know because I saw it pop up on Twitter again. Or maybe I'm just getting ads for it, but it's that, you know, it it does seem like they're kind of going for a vibe that is totally not what the game is. No, not at all. Yeah. Uh it does seem a lot more It reminds me of Cabin in the Woods. The sort of tone that they're going for. Yeah. Where you know that one girl has the worm in her face and like the guy tries to get it and it goes back in. She's like, \"What the hell?\" Like it doesn't really seem like they're going for source material at all. No, but they do got You know the whole premise of it, right? They",
            "start": 2114.64
        },
        {
            "text": "get it and it goes back in. She's like, \"What the hell?\" Like it doesn't really seem like they're going for source material at all. No, but they do got You know the whole premise of it, right? They have the dude in it, you know? They have the guy which Oh, yeah. Yeah. Yeah. The scary guy or whatever. Big Lowski. The what? I said the big Labowski. Yes. You said the dude. So Oh, okay. The the the old guy. You know what I mean? The um that guy. Storm. No. Don't blaspheme Cabin in the Woods. No, but it feels like they're trying to do something analogous to that. Yeah, I don't know the premise to it, Rob. Oh, yeah. So, the premise of this one, which is kind of interesting, is that every night, I mean, it's the same. It's the thing of Well, no, it's actually not the the the idea behind the original Until Dawn where every night uh in this movie they it restarts and it's a different horror like theme. So, yeah, which I think is kind of interesting just from like a movie perspective and and",
            "start": 2160.56
        },
        {
            "text": "Until Dawn where every night uh in this movie they it restarts and it's a different horror like theme. So, yeah, which I think is kind of interesting just from like a movie perspective and and the director is David F. Sandberg, who is the director of like the Shazam movies and he's also the director of uh Annabelle and Lights Out. Um I don't care about those movies at I just care about him as like a director because he's a YouTuber like first and foremost and he does a lot of like behind the scenes of like how he started out like originally like he would do like you know I'm making this indie film and now he's like even when he's doing Shazam 2 he's talking about it right about the behind the scenes so he seems very excited about this so I'm I just wanted to see him have a win so I'm excited for that purely not as a video game movie doesn't seem like an actual adaptation during the YouTube says andy thinking Cabin Fever with the skin crawling stuff no I'm thinking Cabin in the Woods",
            "start": 2200.72
        },
        {
            "text": "for that purely not as a video game movie doesn't seem like an actual adaptation during the YouTube says andy thinking Cabin Fever with the skin crawling stuff no I'm thinking Cabin in the Woods I'm thinking the the different genre genres of horror and the different, you know, Cabin in the Woods has slasher. It's got, you know, weird sort of monster stuff. Uh, moving on, we have Mortal Kombat 2, which is October 24th, 2025. Uh, yeah, we're just looking at the movies, but yeah, they're Twisted Metal. There's like TV shows and stuff we can we could skip past really quick, but yeah, Mortal Kombat 2. I mean, whatever. I'm maybe this is the one that's actually good. We have uh what is his name? Carl Urban. Keith Urban. Carl Urban. Keith Urban's a singer, right? Singer. Yeah. Yeah. Yeah, he's married to Nicole Kidman. Sure. Cool. He's the one with the hair. He's got the hair. Mike just said in the background, \"Yeah, yeah. Yeah. Uh, okay. Yeah, whatever.\" Johnny Cage. I mean, it's going to",
            "start": 2240.4
        },
        {
            "text": "married to Nicole Kidman. Sure. Cool. He's the one with the hair. He's got the hair. Mike just said in the background, \"Yeah, yeah. Yeah. Uh, okay. Yeah, whatever.\" Johnny Cage. I mean, it's going to be cool to see Carl Urban in that. I I did enjoy Mortal Kombat 1 for what it is. I I thought that it was a perfectly okay movie with kind of, you know, some fumbles here and there with the main character not really digging like why is he an OC? You know what I mean? Why is he selfinsert? Weird. That was the first movie I saw back from the pandemic. Like I like went to the theater. I was like, \"Man, I'm back. [ __ ] maxed up, maxed up, maxed up. Let's go.\" I just had a [ __ ] full panic attack just because it was like it was like it was a pandemic still technically like you know what I mean? Like I was just like [ __ ] So Mortal Kombat and it's just never going to be You should have watched it with us at Tims. I was in New York. Ah yeah. Uh Five Nights at Freddy's 2 December 5th 2025.",
            "start": 2281.28
        },
        {
            "text": "Like I was just like [ __ ] So Mortal Kombat and it's just never going to be You should have watched it with us at Tims. I was in New York. Ah yeah. Uh Five Nights at Freddy's 2 December 5th 2025. Crazy that they're already banging out a new one. Feel like that was yesterday. [ __ ] I forgot the day. Feel like that was yesterday. I forgot the first one. What was the first one? The first one popped the hell off in theaters. Yeah. But it was also weird cuz that was that was a day and date Peacock release as well, which is crazy. I guess everyone just forgot didn't know what Peacock was, so like I guess we'll see in the theater. Don't want to sign up for that one. Uh, Street Fighter March 20th, 2026. A [ __ ] I should look up the director of that one. Do they have it right there? Uh, oh no, that's not true. Danny and Michael Philipp. I don't think that's true anymore. I think Street Fighter movie director. I don't know. But uh yeah, it was supposed to be the people that did uh talk to",
            "start": 2320.24
        },
        {
            "text": "that's not true. Danny and Michael Philipp. I don't think that's true anymore. I think Street Fighter movie director. I don't know. But uh yeah, it was supposed to be the people that did uh talk to me, but now it's it's somebody else. So, this doesn't sound like a good idea. Yeah. I mean, I don't I just don't I don't really see the angle. I don't know. I don't know anything about Street Fighter. I'm going to be honest. Like, I don't know. I mean, I remember watching the Street Fighter movie back in the day, and even as a dumb kid, understanding and realizing this is not this is not a good movie. Like, and it was so easy to entertain kids back then. Like like I thought Mortal Kombat Annihilation was a good movie back in the day, but I remember watching this with the goat, rest in peace, Ronald Julian, being like, \"This movie sucks.\" And why is there it is? You know, the uh the funniest thing was like the one American guy, Guile was the guy from Brussels, John Claude Vanam. Oh [ __ ]",
            "start": 2358.4
        },
        {
            "text": "Ronald Julian, being like, \"This movie sucks.\" And why is there it is? You know, the uh the funniest thing was like the one American guy, Guile was the guy from Brussels, John Claude Vanam. Oh [ __ ] you're right. Hilarious sort of thing. So funny. Yeah. I don't know. We'll see. I mean, I don't have any hope for it, but I mean, I don't think that there's I think there's a world where you can make it just really cool, like just focus on the fighting and just make that like really flashy and neat, like almost like a Scott Pilgrim type deal. But I'm not I'm not hyped for a Street Fighter. Uh, Super Mario Brothers Movie 2, April 3rd, 2026. That's fire. That's going to be good. We're going to we're going to see Yoshi there. He's going to be there. Oh, yeah. Who else is making an appearance here? What other Who is missing? Roselina. We're not going to space yet. Yeah, space has got to be the end of the trilogy. Roselina. No, her name is Roselina. I was like, I know there's a singer named",
            "start": 2401.52
        },
        {
            "text": "What other Who is missing? Roselina. We're not going to space yet. Yeah, space has got to be the end of the trilogy. Roselina. No, her name is Roselina. I was like, I know there's a singer named Ros, but I I I love the sacredness in which you hold we can't go to space yet. You can't go to space yet. Got to build up the third. That's the third movie right there. That's the third movie right there. I I mean I I feel like you also do you get into the whole lore of like is Roselina their child from the future and all that [ __ ] I don't think they give a [ __ ] I think is that what really what that is? I think so. I forget at this point. I forget if that's a meme or if that's real like a real hinted at Wario and Luigi Scoop Ball says no you wait while Luigi rather you wait you wait I think you could do you you focus on Yoshi for the second movie you could do Yoshi and all of his Yoshi buddies right so and then the third movie is Wario and while Luigi and the fourth movie we go to space",
            "start": 2446.72
        },
        {
            "text": "you could do you you focus on Yoshi for the second movie you could do Yoshi and all of his Yoshi buddies right so and then the third movie is Wario and while Luigi and the fourth movie we go to space you got are you mentioning the word Diddy no he's Puff Daddy Moving on to the next one. The Angry Birds Movie 3. Get out. Did you know they made a second one? Get the [ __ ] out. Did you know these movies pretty good and have like like kids really like this movie? These movies like it's a big deal. Who Who is this? Cuz I know Blue Sky went out of not Blue Sky. Uh um what's the development studio? Um my [ __ ] Oh, I know who you're talking about, Andy. Hold on. cuz they they they went away. You know, it's it's another, you know, DreamWorks, Pixar. It was the third one that was always like, ah, they're the worst, but they were actually kind of low-key goed. Blue Sky is owned by Disney now. Oh, they were called Blue Sky. Okay. Um Oh, okay. I see what you're saying. Illumination might be So,",
            "start": 2486.24
        },
        {
            "text": "they're the worst, but they were actually kind of low-key goed. Blue Sky is owned by Disney now. Oh, they were called Blue Sky. Okay. Um Oh, okay. I see what you're saying. Illumination might be So, this is Illumination. Is it Illumination? No, it's not. It's uh Columbia Pictures. Yeah, apparently they're making animation. And Roio Animation, which I think is just the company that makes Angry Birds. I can't believe I pulled that out of my ass. I can't believe I knew Roio. See, I would I might replace you on Con. I might do it. I might do it. I might do it. John Rice, uh, who did Beous and Butad do the universe directs the screenplay. Awesome. That's kind of sick. I didn't know they made I didn't know they made it, too. Apparently, these movies kind of go to with the kids. So, like, you know what I mean? I'm trying to not be unk status anymore. I'm trying to be down with down with it. So, man, you hanging out with your brother really [ __ ] I might be up. I might be up now. We might be",
            "start": 2538.64
        },
        {
            "text": "what I mean? I'm trying to not be unk status anymore. I'm trying to be down with down with it. So, man, you hanging out with your brother really [ __ ] I might be up. I might be up now. We might be into Angry Birds movie 3. So look out for the review January 29th, 2 days after my birthday. You think this movie will hit, you know, coming out 8 years after the second one. Um, you know, I think the these kids are going to now bring their kids. Everyone's birth rate's getting younger. They are. Yeah. Uh, Raj, I'll be honest with you. You're, you know, you're the youngest, most informed here to a certain degree. There's some stuff that you, I'm shocked you don't know that I know about. Yeah. But you saying I didn't know Barry Bonds was like alive still. I thought he was I thought he was like a 1920. Oh, but that's not even a Gen Z thing. I'm just saying like there's like some Tik Tok trends that I know about that I'm like, how did you not know about that? But uh you saying UNK status just",
            "start": 2577.52
        },
        {
            "text": "1920. Oh, but that's not even a Gen Z thing. I'm just saying like there's like some Tik Tok trends that I know about that I'm like, how did you not know about that? But uh you saying UNK status just gave me the feeling that I saw Nick say status and I was like this that this feels old. I'm telling you, I might be I might be status. You might be you saying it though is I might be a little bit Sonic the Hedgehog 4 March 19th, 2027. Uh, a little bit of longer waits between actually no. Yeah, three years in between the movies. That's usually it's two years between the Sonic movies. So, they're taking their time with this one. Well, three came out kind of at the end of 2024, right? Yeah, that's true. That's true. So, I guess that is two and a half years. That's how time works. Um, I never saw two or three. Same. I think I probably should. You should fix that. I'm I'm excited for the next one, but it's also like I don't know. It's diminishing returns a little. I just don't got time. Oh,",
            "start": 2614.64
        },
        {
            "text": "two or three. Same. I think I probably should. You should fix that. I'm I'm excited for the next one, but it's also like I don't know. It's diminishing returns a little. I just don't got time. Oh, [ __ ] I was going to spoil [ __ ] I don't want to spoil [ __ ] Uh, Legend of Zelda TBA. Okay, now we're getting into TBA [ __ ] Also, Fallout season 2. Very exciting. Witcher season four and five. Great. Uh, Legend of Zelda movie. TBA. Uh, that's uh the Rise of the Kingdom of the Ape. No, Rise of the Planet of the Apes. No, Kingdom of the Apes. Kingdom of the Planet of the Apes. Kingdom of the Planet of the Planet. Kingdom deliverance of two. Uh, so that's the ball is the name of the director, bro. We be balling, bro. And that that movie rocked. I don't really have a whole lot of hope for whatever this movie is going to be. I just it's just a hard thing to kind of translate. Which is why in our recommendation list, Roger, all I could think of is a Zelda movie by Hayamiaki, which is the",
            "start": 2656.32
        },
        {
            "text": "this movie is going to be. I just it's just a hard thing to kind of translate. Which is why in our recommendation list, Roger, all I could think of is a Zelda movie by Hayamiaki, which is the least um which is like the least um or I think like the most overused like man, this director and this franchise would go together so great. Uh, that's why I just want an animated movie. I don't want Yeah, a real person, real life movie. But but get Miyazaki out of here. Take him out. Put in Gendi Tardikovski cuz that's that's someone who No, but I don't want that. I'm thinking more just art style. I don't want that art style. But I think Tardikovski can lend uh lends himself more with being able to tell a story without maybe the protagonist talking a lot, you know, which I think you could capture that energy. I I do think about so many of sequences in Miyazaki films where they just let you sit there. Yeah. With with environments and and u moods and tones and then I think of obviously amazing",
            "start": 2698.0
        },
        {
            "text": "that energy. I I do think about so many of sequences in Miyazaki films where they just let you sit there. Yeah. With with environments and and u moods and tones and then I think of obviously amazing action in Monoke and it's like I want that. I want that. It's tough, right? Because I wouldn't even say Miyazaki because I want Miyazaki if if he ever makes another movie which I don't know if he will uh to do whatever the [ __ ] he wants and like have that personal connection. I would look to just Gibli as a whole because they make Gibli has made movies without Miyazaki. They just sadly aren't as good. So I I wish that they were able they had that like ability to be like, okay, we have Miyazaki doing his own things, but we can also do something of a similar caliber over here, but they just have not been able to do that, which sucks. Um but yeah, I mean I I'm lightly interested in this one. Um people said Aier in the chat who was like he's producing it. That doesn't mean anything, right? I",
            "start": 2750.0
        },
        {
            "text": "not been able to do that, which sucks. Um but yeah, I mean I I'm lightly interested in this one. Um people said Aier in the chat who was like he's producing it. That doesn't mean anything, right? I mean like he's produced a lot of the bad Spider-Man movies but also all the good ones, right? So it what does that mean? Right? He's just the guy that's making making the moves, making it happen, right? Also, just because just with my idea of Gendy Tardikovsky directing it, doesn't mean it has to be the art style of Samurai Jack. I'm just saying as a storyteller, as a director. Yeah. And I think that would be a great pair. I think he also did the Hotel Transennsylvania movies. Tardikausski. Really? I swear in my life. Let me look that up. Look that up. Look that up. Let me know. Let me know. You better not swear on your life. I swear on my life right now. I can't lose you right now. Uh Shaggy Sasquatch. He did. Roger's alive. I'm alive. Roger staying alive. That's what I'm saying. He can he",
            "start": 2793.04
        },
        {
            "text": "better not swear on your life. I swear on my life right now. I can't lose you right now. Uh Shaggy Sasquatch. He did. Roger's alive. I'm alive. Roger staying alive. That's what I'm saying. He can he can make he can make some bangers and he can make some Hotel Transennsylvania. So, you know, it is what it is. Uh Shaggy Sasquatch says in the chat, \"Roger Oh, [ __ ] God damn it. Fuck.\" Oh, yeah. He says, \"Fuck fuck.\" I lost it, everybody. Never mind. He was He's dunk. Oh, no. Roger is the youngest 45-year-old YouTuber on their third uh channel we've ever seen. I've often thought that. On my third channel. That's very specific and a very good dig. I like that. Moving on. Let's just go through a bunch of them really fast. Ghost of Sushima, TBA, Horizon Zero Dawn, TBA. Uh, Hell Divers 2, TBA. Uh, sure. I again, I one of those. We'll believe it when we see it. Uh, I when they're finally into Exactly. Kosushima seems like the easiest one in my mind because it's just like I don't know. It's I",
            "start": 2830.64
        },
        {
            "text": "sure. I again, I one of those. We'll believe it when we see it. Uh, I when they're finally into Exactly. Kosushima seems like the easiest one in my mind because it's just like I don't know. It's I see that movie. It's It feels like a very cinematic video game as I'm playing it. I can see it as a movie. Uh, what a great story. Yeah, great awesome turns in that. Um, you also had some recos in uh on this little dock. You want Splintercell from Chad Stelski. Tell me about Chad Stelski. I know he's about John Wick guy. [ __ ] me. No way. Yeah. So that would that to me is like the perfect way to go about this. They've they're doing a [ __ ] Let me just get on the soap box real quick. Seafood Chad Stelski. We're doing the animated show that's been in the [ __ ] works for years now with Splinter Cell. I think it's called Death Watch now or something like that. Death Organization. Whatever. It's with uh uh what's his face? Uh he's he's uh Saber-Tooth. Saber-tooth and Wolverine Origins. He's",
            "start": 2868.8
        },
        {
            "text": "Cell. I think it's called Death Watch now or something like that. Death Organization. Whatever. It's with uh uh what's his face? Uh he's he's uh Saber-Tooth. Saber-tooth and Wolverine Origins. He's also uh Ray Donovan. Yeah, they're doing it with Ray Donovan. I look at him and I'm like, you're Ray Donovan. Yeah, Lee Shriber. Lee Shriver. Uh so he's the voice of Sam Fischer in the animated show. I'm like, that's cool. That's really cool. He's an older Sam Fisher. I just that to me that was supposed to happen years ago. I remember when I was a little kid in the Chaos Theory disc, they had a teaser for a movie being produced by Universal and people were like, \"Oh my god, is George Clooney going to play like that's how old this is.\" Like George Clooney was going to play Sam Fischer. But man, I I we we're doing [ __ ] Watchdog movie that's already finished apparently that's happening. Like why are how are we not doing anything with Splinter Cell? It's just such an easy slam dunk for me. We",
            "start": 2913.12
        },
        {
            "text": "I we we're doing [ __ ] Watchdog movie that's already finished apparently that's happening. Like why are how are we not doing anything with Splinter Cell? It's just such an easy slam dunk for me. We just need more spy movies. This is the one that I want to talk about really quick. Gears of War by Alex Garland. That is like my I thought about this yesterday. I'm like this is the perfect connection here because Alex Garland, if you don't know, is the director of uh ton of things Xna uh Civil War Annihilation uh uh devs the TV show Devs. Uh he is an incredible author and uh director and also he directed uh Dread which he's like the secret director of that movie. Um, not tech not technically, but he is. Uh, he would be perfect for a Gears of War movie because Gears of War needs to have most it needs to mostly be a uh space version of Saving Private Ryan. It needs to be dark, gruesome, and you need to feel like you are part of the cogs. Uh, and I feel like our Alex Garland, I know Alex",
            "start": 2955.36
        },
        {
            "text": "it needs to mostly be a uh space version of Saving Private Ryan. It needs to be dark, gruesome, and you need to feel like you are part of the cogs. Uh, and I feel like our Alex Garland, I know Alex Garland would be able to tackle that perfectly. Uh, that is one that also has been in development since I was like 8 years old. We need to [ __ ] fast fasttrack that and figure that out. Dave Batista is getting too old for this. He's not. No, he can't do it. He's getting too old. He can't do it anymore. Um I had written down that I would love to see Alex Garden uh Alex Garland tackle Control by Remedy. I mean, obviously I think that you would want um you would want Remedy closely involved. But I just think Alex Garland has such a such a great like idea for real heady type [ __ ] like the stuff that's really gonna kind of [ __ ] with you. Especially with Annihilation where like Annihilation feels like a dream and that's what control feels like. I only watched half of it. I was too scared.",
            "start": 2999.04
        },
        {
            "text": "that's really gonna kind of [ __ ] with you. Especially with Annihilation where like Annihilation feels like a dream and that's what control feels like. I only watched half of it. I was too scared. Really? Oh, the last half is really good. You got to finish that up one day. I was too scared. Um, do you have another one? Cuz the other ones are just kind of Well, you wrote Astrobot DreamWorks and I was like, I would love to see a Hollow Knight sort of adaptation by by just like the Puss and Boots animation thing that sort of really cool action. Um, I don't really know how dialogue or anything would be presented, but even if you were just to make like a a 12minut short, I would just be super stoked about seeing anything visually like that. And then, uh, yeah, I thought the the reason I was looking at Bong Junho is cuz I was thinking of the movie Inside or or The Game Inside from Play Dead. Uh, cuz Bong Juo loves his uh loves his like worker rights type uh, you know, movies against the",
            "start": 3048.0
        },
        {
            "text": "looking at Bong Junho is cuz I was thinking of the movie Inside or or The Game Inside from Play Dead. Uh, cuz Bong Juo loves his uh loves his like worker rights type uh, you know, movies against the man. Um, so I thought that would be kind of a neat one. So, you wrote down what happened to Sly Cooper. Why would you bring that up, Andy? Oh, man. That's why the [ __ ] that's a That's a tough You typed it. I don't know why you wrote that down because man, Sly Cooper, like we had the We had the trailer. We had a trailer for a movie and it looked it looked beautiful. It looked perfect. Looked like the perfect movie that I've ever wanted. Most perfect movie I've ever wanted. And it's not happening. Why would you do this to me, Sony? He was so furry. He had So, he was so Did you remember this? Remember this trailer? No. Love the trailer. Look how beautiful this is. It looks like it it does look like a movie that we might need to remake in terms of like the character designs are just a little",
            "start": 3087.68
        },
        {
            "text": "this trailer? No. Love the trailer. Look how beautiful this is. It looks like it it does look like a movie that we might need to remake in terms of like the character designs are just a little weird, but it's just the vibe. I love these guys. Wait, so this never came out? No, this never came out. This was announced Clank came out. Yes, it was. And nobody saw that movie. Yeah, it was announced around the same time. And then I I think I I've been reading into this for years now and they said that this was not ever a real movie. This was just like a test thing that they did and they released it and said, \"Here's the trailer for the movie.\" And it was never in actually in production. So yeah, we're never getting it. Sly Cooper's dead forever. But that would be my my my real quick. The state of video game movies. We have all these adaptations, everything in the air. Is it good? Is it bad? Is this where you want it to be? Or are we just doing too much, Andy? I don't think that well I think",
            "start": 3130.96
        },
        {
            "text": "video game movies. We have all these adaptations, everything in the air. Is it good? Is it bad? Is this where you want it to be? Or are we just doing too much, Andy? I don't think that well I think we're just so early on the precipice of it all where we're finally starting to get ones that are worthy of existing where back in the day they were just always going to be bad. I I'm excited for it because they are going to become more and more uh prevalent and there's going to be some good ones there. There's still going to be ones that I would prefer. Like when I watched the Mari movie, yeah, I thought it was a beautiful movie. I thought it looked amazing. I still to this day, if I could wave the magic wand, I would have uh [ __ ] the Lego Movie crew do the Mario movie. I I I think that the humor could have worked for kids and adults instead of just mostly kids. And there's a couple of jokes in there for the adults cuz I thought that the writing of that movie was really disappointing. I",
            "start": 3168.08
        },
        {
            "text": "humor could have worked for kids and adults instead of just mostly kids. And there's a couple of jokes in there for the adults cuz I thought that the writing of that movie was really disappointing. I just I wanted to enjoy it as a 37y old man. Yeah. And I just or 35, however older I was when I watched it. I just when I look at the the Lego movie and I think they're just so they're written so creatively and so well and there's like such a good earnestness to it. I feel like the Mario movie lacked a lot of heart and whatever. I think there's a lot of other franchises that can be done by, you know, Phil Lord and and Miller, but obviously they're really busy with Spider-Man. But I just think like that whole crew could really really kick ass. Now I'm super pumped about the possible prospects of Seth Rogan's Squad who did the Ninja Turtles movie. Like I like that movie is amazing and so funny and it's got such a good tone and vibe to it. And now I'm just thinking about how many franchises",
            "start": 3224.96
        },
        {
            "text": "of Seth Rogan's Squad who did the Ninja Turtles movie. Like I like that movie is amazing and so funny and it's got such a good tone and vibe to it. And now I'm just thinking about how many franchises can be done by both of those teams and be and be done well enough to where you're not just excited that it exists, but you're excited because there's good there's good [ __ ] there. There's good comedy. There's great dialogue, you know? Yeah. Are they attached to anything that we know of going forward? No, I don't know. I mean, I know they're doing the Donkey Kong show or movie or something like that, but that's they're not connected to Yeah, they're that's just Rogan voicing him. Um, I'm trying to think of an IP that like that crew would like for video games that would be like really good for that crew. Let us know chat. Let us know cuz I know live action becomes the kind of default, but I I think like there's so many opportunities for animated stuff, I loved even though I didn't love",
            "start": 3271.52
        },
        {
            "text": "for that crew. Let us know chat. Let us know cuz I know live action becomes the kind of default, but I I think like there's so many opportunities for animated stuff, I loved even though I didn't love the the the necessarily the writing or the toner or any of it, but I still think back to during the pandemic when they made that 3D remake of the Pokemon movie. Yes. On Netflix. It was like a Netflix exclusive type deal. Yeah. And it had such a cool art style. I'm like, \"Oh, I want I can't wait for more of this.\" And we never got more of it. They came out with the little hotel show or whatever. That's great, though. That's different. Um I I never Well, I guess I just want a proper Pokemon movie that isn't Pokemon, that isn't Detective Pikachu. I want like a a proper thing that I could be sort of visually stunned by because I love the art style in that Pokemon movie. Another thing that I I would want that is not animated related, but I would love for Denville New to do a Mass Effect",
            "start": 3314.08
        },
        {
            "text": "sort of visually stunned by because I love the art style in that Pokemon movie. Another thing that I I would want that is not animated related, but I would love for Denville New to do a Mass Effect trilogy. Oo, I just want that. I want to see that universe realized in a on the big screen with, you know, real actors and prosthetics for Garis or like whatever it is. I want I know they're working on that. I remember talking I don't know who's in charge of the Mass Effect thing, though. I know that it's just been kind of the rights have been purchased for Amazon, I think. Yeah. Um, I I want to see I really hope that show pops off and is awesome and is everything I want it to be because I love that universe means so much to me and I think there's so much good storytelling you can have in that world. Hell yeah. Well, if you want earnestness, you should watch the Minecraft movie in 4DX because a lot of earnest beauty in that the importance of being earnest. So true. $10 super chat from T.",
            "start": 3355.84
        },
        {
            "text": "world. Hell yeah. Well, if you want earnestness, you should watch the Minecraft movie in 4DX because a lot of earnest beauty in that the importance of being earnest. So true. $10 super chat from T. Taylor O says, \"Had to race to my laptop to super chat for the Alex Garland dreams. Top three of my directors and y'all are right on the nose. Love this episode.\" Oh, another one. Thank you, Taylor, for your $10 super chat. Really appreciative of that. Another one that I wanted to bring up was even though I've never seen the movies, I've just seen a lot of clips through Tik Tok and stuff. Robert Edgar's Bloodborne. Like, come the [ __ ] on. Oh, yes. That's a great one. That's a great one. I don't know what it is, but I just like the the the the visual concept and I mean he love he only does movies that are period pieces, so that's perfect. Yeah, that movie takes place in London. Yeah, he loves it. Yeah. Um, also I wanted to shout out just Den Denuv got me thinking I would love him to also",
            "start": 3402.72
        },
        {
            "text": "that are period pieces, so that's perfect. Yeah, that movie takes place in London. Yeah, he loves it. Yeah. Um, also I wanted to shout out just Den Denuv got me thinking I would love him to also do some sort of uh adaptation of the Prey like reboot. H the Prey. Prey. Like the like the reboot of Prey, like the franchise. The game. Yeah, the game. You were thinking about the movie. I was thinking about the Predator movie. Oh, yeah. No, no, no, no. Like, think about like that like Oh, that would be awesome. [ __ ] space science fiction. Those That's Alex Garland, too. Have them both do uh Garrett with a $2 super chat says, \"We also have a live action Gundam movie coming out starring Sydney Sweeney, baby.\" What? Oh, yeah. Well, she signed on for it. I don't know like how legitimate any of it was. She is the Gundam. They climb in. Uh I started last night on Amazon Prime mobile suit Gundam Gex. No, here's how it's spelled. Roger. It's Gundam. Check. Capital G lowerase Q. UX. That's how it's",
            "start": 3446.0
        },
        {
            "text": "She is the Gundam. They climb in. Uh I started last night on Amazon Prime mobile suit Gundam Gex. No, here's how it's spelled. Roger. It's Gundam. Check. Capital G lowerase Q. UX. That's how it's spelled. Uh I didn't really get too far in it. It was a little too late. But that show exists. Oh, and I also started Barrett Lazarus. Oh, cool first episode. Cool first episode. You watch the others or you just No, it was just that cuz I was like, you know, I was, you know, sometimes you sit in that bean bag chair and you're like, what else can I watch while I'm here? You know what I mean? Uh, also I watched a lot of stuff last night. Obviously, The Last of Us uh happened. Um, I watch clips from those. No spoilers there, but my mom was texting me a lot and so was my dad. They were unrelated. No, it was all about The Last of Us. It was all about The Last of Us. Uh Kebabs with a $5 super chat. Thank you. Kebab says, \"I'd be remiss to not mention my Ratchet and Clank movie and PS4 game edit. I",
            "start": 3494.24
        },
        {
            "text": "it was all about The Last of Us. It was all about The Last of Us. Uh Kebabs with a $5 super chat. Thank you. Kebab says, \"I'd be remiss to not mention my Ratchet and Clank movie and PS4 game edit. I spent over a year on it. You can find internet archive.\" Oh [ __ ] that's awesome. Internet archive. Uh and that's all for our super chats. Thank you everybody for joining us on this episode of the Kind of Funny Games cast. What are your movie recommendations? Who are your dream director and uh video game pairups? Let us know in the comments down below or just leave a comment for the algorithm. Anyway, if you're watching live right now, click the like button. It make it a habit. Click that like button every time. It saves it cost you nothing and it helps us out with getting our videos in the algorithm. We greatly appreciate all support. We will be uh we'll be back tomorrow with more gaming news and games daily and games cast, but after this we're going to do a kind of funny podcast. The",
            "start": 3550.64
        },
        {
            "text": "algorithm. We greatly appreciate all support. We will be uh we'll be back tomorrow with more gaming news and games daily and games cast, but after this we're going to do a kind of funny podcast. The actual kind of funny podcast, the real one. We'll see you then, gamers. Goodbye.",
            "start": 3590.88
        }
    ]
}