{
    "id": 13966,
    "video_id": "XbdpmYJPiFk",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Mike Howard"
    ],
    "title": "Mike & Nick Play Alan Wake 2 Powered by GeForce RTX 5090 and NVIDIA DLSS4 #rtxon  #geforcepartner",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745279132,
    "duration": 10285,
    "transcript_chunks": [
        {
            "text": "[Music] in three, two. Yo, what the heck is going on? Kind of funny best friends. It's your guys Snow Bike Mike and Nick. Let's do it again. Hey, what up everybody? It's Mike and Nick in the afternoon and we're back on a lovely Monday with a very special sponsored stream for today's afternoon broadcast. Nick, we're teaming up with our friends over at Nvidia once again to show off all the coolest, latest, and greatest tech with their GPUs. And today we're playing Allen Wake 2. I'm excited about this. Yeah. Uh because this is not a game that you would naturally associate with me. Uh, but I pic I picked this because I have I have heard people talk about Alan Wake for a very very long time. I know it's mostly a story driven game. I know there's uh it's it's not a vibe that I would naturally gravitate toward uh because it's not a first-person shooter and all that jazz, but I something about this is intriguing to me. And so when Nvidia reached out and said, \"Hey, what games you guys want to",
            "start": 0.4
        },
        {
            "text": "toward uh because it's not a first-person shooter and all that jazz, but I something about this is intriguing to me. And so when Nvidia reached out and said, \"Hey, what games you guys want to play?\" I was like, \"Throw this into the mix and and I and I want to give this a fair shot and and really experience it.\" I like that, Nick. I I am just like you. I have not played Alan Wake 2. Uh, of course, control. Did you play some control? I played some control. Super awesome. They call this the remedy verse now because control, not directly tied to it, but like it's got some it's got some entanglement here that you'll get to see. I like I like things to be entangled. Yes. And it's exciting to see what this team with remedy and of course Sam Lake have created with Alan Wake 2 returning after so long. The question was, can they bring it? And Nick, I'm happy to say they brought it big dog. I'm excited for this. And so today with Nvidia, we've teamed up with them to showcase, of course, the",
            "start": 61.84
        },
        {
            "text": "so long. The question was, can they bring it? And Nick, I'm happy to say they brought it big dog. I'm excited for this. And so today with Nvidia, we've teamed up with them to showcase, of course, the GeForce RTX 5090 series and all of its capabilities. Of course, today we will be playing with DLSS4 and Nvidia Reflex. So Nick, before we kick it off, Yes. usually we have Andy talk about the visual triangle and how you don't have to sacrifice frames to of course win games, get the very best picture quality, and get the best out of your performance here, right? You don't have to sacrifice thanks to Nvidia GeForce and RTX, right? RTX on with the LSS4 now uses all of the power of your GPU to be able to multiply the frames to get you more frames without sacrificing the picture quality that you know you want so bad. That's why we love them. So, let's go over to options. Let's turn that thing on, you and I. We're going to go into the settings, you and I, and we're going to turn on DLSS4 and",
            "start": 100.4
        },
        {
            "text": "know you want so bad. That's why we love them. So, let's go over to options. Let's turn that thing on, you and I. We're going to go into the settings, you and I, and we're going to turn on DLSS4 and we're going to showcase how many frames we're getting throughout this. And so as you take a look on your screen right there, you have resolution upscaling TLSS right there. You can use the frame generation 2x, 3x, 4x. Of course, us being on the 5090, we can crank that all the way up to the 4x if we want to get the most frames possible and still keep that visual quality that we want. Of course, if any kind of funny best friends out there want to learn more about Nvidia and what they're doing to give you the very best in your video gaming, you can type an exclamation point. Nvidia and the exclamation point GeForce anytime throughout. The Nightbot will give you a command where they're showcasing over, let me get this right, 700 RTX games and apps that now use Nvidia DLSS 4 and beyond. So,",
            "start": 149.04
        },
        {
            "text": "point GeForce anytime throughout. The Nightbot will give you a command where they're showcasing over, let me get this right, 700 RTX games and apps that now use Nvidia DLSS 4 and beyond. So, check that out. Uh, Nick, I'm excited. I'm ready to jump in and have some fun here. Man, I got everything's on high. This is going to be so fun. Texture resolution ultra. You don't have to sacrifice lighting on high. Look at I love that they give you the little spot. This is what it's going to look like. I can't wait to feel this global illumination on high. Heck yeah, ladies and gentlemen. Now I have the anxiety though, Mike. Yeah, there's two things that give me more anxiety than anything in this office. One is when I forget to turn my control back to in to inverted before the stream starts cuz I know that everyone's going to make fun of me. And then two is anytime I change a setting in the menu. Yeah. And then I hit escape and I forget to confirm it. Did it save it? Did it save it? So, I'm just",
            "start": 191.44
        },
        {
            "text": "that everyone's going to make fun of me. And then two is anytime I change a setting in the menu. Yeah. And then I hit escape and I forget to confirm it. Did it save it? Did it save it? So, I'm just going to hit escape. I assume it did. We're gonna find out together. If it didn't, I will go back and we will turn it back on. Am I doing a new game or continue game? We are going to go to a new game. Brand new experience, you and I. You got sound. Feeling good. Sounds good. You know what we haven't done? Let's check in with the audience. Let's see how they're doing. Okay, cuz it's Monday. We're going to get right to the game play. We talked about the Nvidia sponsorship. We talked about RTX on, but we want to make sure we want to make sure everybody just we check in really quick. It's Monday. How we feeling, chat? How we feeling? I see Langley Amley's in the chat. Langley, good. Love seeing Langley. I'm sure he enjoyed the kind of funny podcast. Jaw's in the chat right there. J Shaw, what's",
            "start": 235.68
        },
        {
            "text": "we feeling, chat? How we feeling? I see Langley Amley's in the chat. Langley, good. Love seeing Langley. I'm sure he enjoyed the kind of funny podcast. Jaw's in the chat right there. J Shaw, what's good? Of course. Tyler 1700 says, \"Make it green for Nvidia in the background.\" Turn it on. Make it green. I love that. What else do we got up in here? Who else do you see? Uh, I mean, I see a lot of the usual suspects. Shout out to the YouTube chat over there. Uh, I see Ramire's RJ Jam over there. Uh, what's going on, guys? Hey, shout out to everyone, by the way, that came out to my show at Punchline uh last week. And we had a few of uh of the friends of the show come out to Punchline and say what's up. And it was great to see people in person. And I noticed I was like, \"Oh, there's a couple people in the front row.\" I was like, \"Oh, that's great. That guy's got one of our old school hoodies. That's great.\" And then I was like, \"Oh [ __ ] it's Olive Party. What's up?\" Oh, snap. Oh, snap.",
            "start": 271.92
        },
        {
            "text": "people in the front row.\" I was like, \"Oh, that's great. That guy's got one of our old school hoodies. That's great.\" And then I was like, \"Oh [ __ ] it's Olive Party. What's up?\" Oh, snap. Oh, snap. That's awesome. Come on, everyone. So, shout out to that. Ignasio Rohos came out to one of my shows. Ignasio. Which was super fun. He came out to the showcase last night. Had a great time. I gave Tim a DVD of some anime that he wants him to watch. homework, Mike, of cuz I didn't realize that Ignasio Rojos makes lasers. So I said, \"You have of course have to watch the definitive scientific movie about lasers. Real genius starring Val Kilmer.\" And he goes, he said, \"Nick, is that another one of your stupid movies from the 80s?\" And I said, \"Agnosio, you're no longer allowed to talk to me anymore. I'm going to kick you right in the shin right now. Kick you in the kick you right in the shin, Ignasio.\" Uh, but that was super fun and it's fun to see everyone. We're having a great day. If you",
            "start": 310.08
        },
        {
            "text": "I'm going to kick you right in the shin right now. Kick you in the kick you right in the shin, Ignasio.\" Uh, but that was super fun and it's fun to see everyone. We're having a great day. If you guys watched the podcast that we just did before this, it was yet another banger classic airing of grievances episode. So good. So you guys can get into that. And it it is just shenanigans. Pure shenan shenanigans. I'm trying to ping Kevin because the chat is saying that the gameplay on their stream is um frozen. And I can tell that from what I'm looking at is I have the home menu and you're on a different menu. No, let me go and check my Let's check uh OBS here. Where is that streaming from? uh over here. Okay. So, I want to check OBS there. It must It probably died there. Yeah, it did. So, go ahead and stop streaming there and then you can start streaming again. That should be fine. Thanks, Chad. Good sh Good looking out, Chad. Uh I want to give a shout out to Pete Well for subscribing at",
            "start": 347.12
        },
        {
            "text": "ahead and stop streaming there and then you can start streaming again. That should be fine. Thanks, Chad. Good sh Good looking out, Chad. Uh I want to give a shout out to Pete Well for subscribing at the tier one level for 68 months, Pete. You're one month away. And of course, uh Captain Kobe Jack has subscribed for 45 months straight with that tier one sub. Thank you guys so much. Uh Archestro has subscribed actually with this Prime membership. Remember guys, if you have Amazon Prime and you want to support our channel, you get one free Twitch gaming subscription, which can go to us. It can go to anyone. Just make sure you guys use it every month cuz it's a nice little bit of change. Uh that's free for you and good for the creators out there. Scooby-Doo said, \"I did not forget that I Prime, which means I have Twitch Prime and I give it to my favorite stream team.\" Thank you, Scooby-Doo, for that Prime resubscription. Torment 619 has subscribed with Prime as well for 35 months. Said,",
            "start": 389.52
        },
        {
            "text": "which means I have Twitch Prime and I give it to my favorite stream team.\" Thank you, Scooby-Doo, for that Prime resubscription. Torment 619 has subscribed with Prime as well for 35 months. Said, \"Hey, Nick, when are you going to do more?\" Nick Lock. Torment 619. The Nicklock continues and potentially finishes tomorrow. I believe we're coming back and we are going to attempt to finish Pokemon Soul Silver tomorrow uh with our uh team of six. We're hoping to do that uh tomorrow, which will be fantastic. And if not, of course, we'll try to continue the next day. Uh I do think we have some fun stuff uh planned for the run at the end of the week. So, we're hoping to finish Pokemon uh this week uh because honestly, it gives me it gives me nightmares. Give me a little It's been giving me a lot of I had a nightmare that the Terminator was chasing me this morning. Um and that he found me and then I woke up by I was like, \"Damn, that was a tough nightmare.\" But it was Arnold Schwarzinger's",
            "start": 427.52
        },
        {
            "text": "of I had a nightmare that the Terminator was chasing me this morning. Um and that he found me and then I woke up by I was like, \"Damn, that was a tough nightmare.\" But it was Arnold Schwarzinger's Terminator from like the 1980 movie. Yeah. And I was like, \"That's pretty.\" He looked pretty cool in that cool. Mike, did we find our illustrious producer? Kevin is walking in as we speak. He's going to take a look at it and he's going to get that kicked back on. Talking about dreams, I had a pretty good dream. Yeah. Dream went on vacation. I was sailing a boat. sailing a boat. Me and JD Neil, we were sailing a boat off the coast, having a great time, stopping at different beaches. You know what I love is when you get on a boat, you know, the boat life. Uhhuh. There's certain areas on the coast where you pull up a special restaurant maybe. Yeah. You know what I mean? It's just like this. The only only way you can get to this if you had a boat. Boat life. I love it. And I love that. I love",
            "start": 467.76
        },
        {
            "text": "where you pull up a special restaurant maybe. Yeah. You know what I mean? It's just like this. The only only way you can get to this if you had a boat. Boat life. I love it. And I love that. I love that idea. I love the boat life for you. Yeah. I think it's OBS on that one, right? No, it's still OB. Where's the [ __ ] When's the game? Uh, that one. Yeah, there you go. There we go. Bolt life, baby. Well, Kevin's gonna figure this out while we talk to the chat. Kevin's going to kick it back on us, right? Kick it back on. Langley says, \"Chicle show was just amazing all around, especially meeting other KF friends out there.\" Hey, that is awesome, Langley. You got a chance to go to that. Greg invited me to that Chicago show cuz I was in Chicago. I told you I was like there. I said I just can't be bothered. I said, \"Don't call me.\" Actually, what I really said was I was like, \"Greg, you get enough of me during the week.\" Yeah. Yeah. You don't need me. He would have put you right to work.",
            "start": 508.0
        },
        {
            "text": "be bothered. I said, \"Don't call me.\" Actually, what I really said was I was like, \"Greg, you get enough of me during the week.\" Yeah. Yeah. You don't need me. He would have put you right to work. Vacation with your family. Yeah. He would have. And you know what? It would have been nice, but you know, it's it's in the past now. It's in the past. In the past, Mike, how was your Tahoe weekend? Nick, we got a Target. Some sort of Oh, you did. We got a Target. I know you're going to love that. Paradise. Is How big is the Target in Paradise? Small. That's perfect. It's like just a little bit bigger than the city target. Yeah. But still too small to be a real Target. We're good. Okay. Electronics has about like four TVs. Well, the look at the electronics in the Target is is suffering. We'll just say that. Is it a dying situation? Yeah, I I mean literally I went the other day and I was like, \"Oh, I just need to get some like I just need to get a little tiny um one of those like uh watch",
            "start": 548.48
        },
        {
            "text": "just say that. Is it a dying situation? Yeah, I I mean literally I went the other day and I was like, \"Oh, I just need to get some like I just need to get a little tiny um one of those like uh watch batteries.\" I had like a little thing at home that I had to like put the battery in a little controller. Yeah. And uh the guy's like, \"Yeah, man. We're just out of batteries.\" Oh. I was like, \"Really?\" And he goes, \"Yeah.\" He's like, \"This is all the batteries we have.\" And I swear to God, it was a it was a case roughly the size of this this table. Okay. Right. Glass in front with the little hangers where the batteries hang off of. Right. And there was like one offbrand box of double A batteries left. It wasn't Energizer and it wasn't Duracell. It was like battery life brand or some weird crap like that. And I was like, dude, Target is going downhill. But they still got the store in store Starbucks. That's Yeah, you know that. Oh man, we love that Starbucks. Now Mike, we're going to jump",
            "start": 586.56
        },
        {
            "text": "like that. And I was like, dude, Target is going downhill. But they still got the store in store Starbucks. That's Yeah, you know that. Oh man, we love that Starbucks. Now Mike, we're going to jump back in. Now we've realigned ourselves. We've kicked on DLSS4. Thanks to our friends over at Nvidia for sponsoring the stream. We're going to get the very best of our out of our gameplay. Thanks to that GeForce RTX 5090 inside of Nick's computer right now. So, you are going to experience the very best. If you want to learn more about the 700 games supported, you can of course type an exclamation point GeForce or Nvidia throughout today's stream. Click on that Nightbot link and go learn more from the big blog post. Of course, we'll get to show off a lot of cool Nvidia tech and games that are utilizing the very best out of these G Force experiences and graphics cards. And let's turn this thing on. I think Kevin is tweaking one more little setting here. Mike, audio is not for no reason. Audio",
            "start": 626.4
        },
        {
            "text": "the very best out of these G Force experiences and graphics cards. And let's turn this thing on. I think Kevin is tweaking one more little setting here. Mike, audio is not for no reason. Audio is not coming through. We're going to we're going to take a look at that. We're going to turn on this audio. The older 98 just says tariffs. Big hammer. Is that because is that what we're talking about? The batteries tariffs. Do you think maybe we should team up with Big Hammer and Camelli, you and I, and get another Call of Duty night in with the boys? That stream was so fun. And it's a great stream. I think we should. I tell you what, I'm going to go home and play tonight a little bit more of too. Cyberpunk. You're deep into cyberpunk. You love cyberpunk and you know cyberpunk uses the very best of Nvidia. I tell you what, we did we did a great Cyberpunk uh stream thanks to our friends in Nvidia and that really that really reignited my my love of that to the point where my buddy I was going",
            "start": 666.8
        },
        {
            "text": "of Nvidia. I tell you what, we did we did a great Cyberpunk uh stream thanks to our friends in Nvidia and that really that really reignited my my love of that to the point where my buddy I was going back and forth with a couple my friends that play it and uh I've just been like you know you know how when you're into something you kind of seed it out and if anyone takes the bite see who's my friend goes my last Cyberpunk 2077 build was a crypto female maxed out intelligence stealth netrunner with a with a tier five silence Lexington to mop up mistakes and I said and I quote that was the dorkiest Coolest thing you could have ever said right there. I'm so excited for that. All right, guys. Without further ado, here we go. And I'll just Maybe I'll play on normal. What do you think? Story or normal? Nick, you may play on whatever difficulty you like. If you don't want to get brought down by roadblocks or some challenges, hit story mode. Let's enjoy the story. If you want to have a little",
            "start": 708.0
        },
        {
            "text": "normal? Nick, you may play on whatever difficulty you like. If you don't want to get brought down by roadblocks or some challenges, hit story mode. Let's enjoy the story. If you want to have a little bit of challenge, normal. Let's go a little challenge. I might dial that back. I might regret that. Okay. Okay. Let's get into this. Back to the beginning, we all come to a story with hopes in back to the patients looking for an answer. Sometimes it would be better to live with that hope without ever knowing the full story. [Music] In a horror story, there are only victims and monsters. Oh, and the trick is not to end up as either. But trapped by the genre, we are all ripped to pieces along the way. This is not the story I hoped it would be. This is not the ending I wanted. This story will eat us alive. This story is a monster. And monsters wear many faces. It's a dead deer. Oh dear. [Music] Oh no, this man's having a problem. [Music] Oh, that's a hairy back. That is some Look at that.",
            "start": 751.36
        },
        {
            "text": "eat us alive. This story is a monster. And monsters wear many faces. It's a dead deer. Oh dear. [Music] Oh no, this man's having a problem. [Music] Oh, that's a hairy back. That is some Look at that. Thanks to our friends over in Nvidia, we can really see that back. That looks like me when Roger turns the thermostat up to 74. You're just suddenly naked. You're just shirtless, stumbling through the dying. Please, someone help me. Oh my god. Is this my character? Oh, I guess I'm playing. Is this naked guy? Yeah. Look at his Look at his butt. Can I turn him around? Oh yeah, you can. Let's not do that. This is sponsored. Yeah, let's keep it Let's keep it Let's keep Moon out. Okay, let's just focus on the moon. Yeah, let's let's just look at the sky. Look at the sky, guys. Let's not Oh, that makes it worse. That makes it worse. Ah. Oh, please. Can you hear me? Oh, that's never a good sign. That can either be good or bad. Bet someone's flashing a light on you. Yeah. While you're naked",
            "start": 820.2
        },
        {
            "text": "makes it worse. That makes it worse. Ah. Oh, please. Can you hear me? Oh, that's never a good sign. That can either be good or bad. Bet someone's flashing a light on you. Yeah. While you're naked coming out of a lake. I don't think anything about this is good. God, Mike, is that better? Negative. Still no sound. He's working on it. Okay. Or Mike. Okay. God, this game's gorgeous. Look at that. Let's take a second look, folks. That nice little lighting coming through. Holy canoli. Running at 178 frames per second right now. the awesome power of our 5090 that I will steal. I will Oh. Oh. All right. You can't be doing stuff like that, guys. It's a Monday. Oh, he fell. He fell. And now I'm looking straight inside of this guy. He's going on a little walk here. A little jaunt. I'm make this poor guy run. This guy hasn't joged in years. I can tell. Mike, when's the last time you went for a run? Been like 382 days. I got to start jogging. Oh no. I got to move a little bit more. Okay. Oh, we",
            "start": 895.04
        },
        {
            "text": "guy run. This guy hasn't joged in years. I can tell. Mike, when's the last time you went for a run? Been like 382 days. I got to start jogging. Oh no. I got to move a little bit more. Okay. Oh, we got to get you moving, Mike. Hey, I didn't think we had jump scares like that. Got them. We're here. I assume I got to go over this thing. No, maybe this underneath. No, I got to keep going straight. Just go straight. It's coming. All good, I think. How's it looking on your end? You get audio. I'm getting something. I'm cooking. Sorry. Oh no. Help me. I'm naked. Oh, these guys have knives. That's bad. I got to run toward them. I can take three guys. Oh, those are shadow people. Not this guy. Oh, that one's real. This guy's in me. Oh, shoot. I got to run. Oh no. Well, I died. I think you're supposed to die. Hunting season. Oh. Oh. Oh. So, you chose a very scary game to play. We are the tree. Watch the lights. Where's the rest of the stuff? I need to finish this. I'm coming. I'm done. What the",
            "start": 997.8
        },
        {
            "text": "to die. Hunting season. Oh. Oh. Oh. So, you chose a very scary game to play. We are the tree. Watch the lights. Where's the rest of the stuff? I need to finish this. I'm coming. I'm done. What the [ __ ] [ __ ] That's a way to start a video. We're not going to talk about We got to talk about that, huh? Talk about that. Let's have a conversation about that. You and I definitely got to talk about this cult in the woods that's going on here. Yeah. The cult of the tree. [Music] Tough day for that guy. It's a tough way to start the week. That's not good. Allan Allen Wake. Number dose. The revenge of Allan Wake. Well, that's a hell of a way to start. That's a badass way to start. Great. Great. Hey, kiddo. How are you? I'm good, Mom. How are you? This trip might take a little longer than I thought. I'm sorry I've been gone so much lately, Logan. Oh my god. Mom, it's not your fault. People get all murdery. What happened? Just work stuff, right? We just found a naked dude. Yeah. Not good.",
            "start": 1073.2
        },
        {
            "text": "I'm sorry I've been gone so much lately, Logan. Oh my god. Mom, it's not your fault. People get all murdery. What happened? Just work stuff, right? We just found a naked dude. Yeah. Not good. Night Springs here. Mom, it's so good. No spoilers. I'll let you get back to the show. You were supposed to wait and watch with me. I love you both. This is what happens when you go on work trips. Mom, love you, too. And say hi to Casey. Tell him to stop brooding so much. Logan. Casey brood. I will. This game looks amazing. Yeah, there he is. There's the man. There he is. Logan thinks you should try cheering up. Snarky kid. Wonder where she gets that from. It can't be a coincidence that another body turns up just as we arrive in town. Feels like the killer's leaving us a message. I'm glad you're on this case with me, Anderson. It's right up your alley. You should take lead. Think of me as the backup. Okay. Any words of advice? Catch the killer. Nothing that would cheer anyone up. That FBI jacket",
            "start": 1180.0
        },
        {
            "text": "case with me, Anderson. It's right up your alley. You should take lead. Think of me as the backup. Okay. Any words of advice? Catch the killer. Nothing that would cheer anyone up. That FBI jacket is so cool, dude. I was just thinking the FBI jacket is so we need badass kind of funny FBI jacket park. I think it's illegal to be an FBI agent like pretend like you're one but I think we'll be fine. We can get away with it. It's Will. Thank you for that that subscription. You're one for 48 months is four years. Love you guys. Love you right back my friend. Uh shout out to Matthew said Nick. How the show's going this weekend? The show's went wonderfully this weekend. We ended with the showcase that I got to host a punch line and that was a real real good real fun show. Where's the deputy? And then uh a bear. The glove bomb asks, \"How much do you guys know about uh Allan Wake lore?\" Goose Egg Zero. Zero. Seen anything about this game? I know that this guy is a real guy. That's a real game.",
            "start": 1257.28
        },
        {
            "text": "then uh a bear. The glove bomb asks, \"How much do you guys know about uh Allan Wake lore?\" Goose Egg Zero. Zero. Seen anything about this game? I know that this guy is a real guy. That's a real game. Yeah. Does he also do the the voice for this character? No, I don't think Sam Lake voices it. Actually, I know for a fact he does not. So Sam Lake doesn't voice it, but he is the character model. Look at that. Yes. Uhhuh. Isn't that wild? Now, does he have a production company called the Lakehouse? Because that would be sick. That's kind of cool. Or if he were to start a group of basketball players, would they be called the Lakers? I can go. Got them. Let's take a look at this map. It's pretty simple. Witches ladle. The crow's footooth Hills. Oh, the witch's hut. Okay. Tasty. Yeah. All right, let's go take a look at this dead guy's drinker. Oh no. Oh yeah, this game is gorgeous. Just remember he was in the water. Hey. Oh, is he going to be bloated? Oh, cuz the shrinkage. Yeah, you like",
            "start": 1308.4
        },
        {
            "text": "let's go take a look at this dead guy's drinker. Oh no. Oh yeah, this game is gorgeous. Just remember he was in the water. Hey. Oh, is he going to be bloated? Oh, cuz the shrinkage. Yeah, you like that. Cuz of the shrinky PBD. The shrinkage. The shrinkage. The shrinkage. Said you'd be coming by to take over the case. You're half right, Anderson. Look at how dope. These are that badass jacket. You see this look? Everybody looks good in this. I'm in charge. Anderson. I'll be leading this case. Her name is Saga. Pretty cool, right? Sick. Super cool. Shoot. Sorry about that, ma'am. I I'm Deputy Mulligan. Yeah, Mulligan. Why don't you get out of my way before I draw my weapon on you? Damn [ __ ] going to show up. Mulligan. Federal agents right here. Thornton. My partner Thornton down at crime scene. Yeah, Thornton's an idiot. We know. It's not what you call the sharpest axe in the shed. That here? What do you mean? Are they with you? Oh [ __ ] They didn't hear me, did they? Were there any",
            "start": 1364.96
        },
        {
            "text": "scene. Yeah, Thornton's an idiot. We know. It's not what you call the sharpest axe in the shed. That here? What do you mean? Are they with you? Oh [ __ ] They didn't hear me, did they? Were there any witnesses? Yeah, couple out of towners. I wonder what they were doing sneaking around the woods at night. I mentioned the city folk. It's pretty suspicious. Not that we have anything against city folk, cried Thornton. But don't worry, Sheriff Breaker took him back to town a while ago. I want to see the body. How do we get there? Look at the body. I don't need I don't need a situation report from this po sheriff. Oh, wow. Yeah, I'd say I'll throw a fed I'm a feder's closed since the area was fenced off. The store the a blue streak reference or It definitely wants to go tell Roger that. He'll be so happy to hear it. That's a good movie, though. Before we meet scene, there's time to review the facts of the case so far. Make sure I'm seeing the clues clearly. Take a look. As Andy would say,",
            "start": 1420.8
        },
        {
            "text": "be so happy to hear it. That's a good movie, though. Before we meet scene, there's time to review the facts of the case so far. Make sure I'm seeing the clues clearly. Take a look. As Andy would say, let that soak in for a moment. You can access the case board inside the mind place. Yeah, well, that doesn't sound good. You got to go in the mind. I got to go into the mind place. Deep into my mind. Andy, I'm going to get deep into my mind place. My version of the mind palace technique. Whoa. Clues and work the case. Saga's a badass again for each case. Using each field office as a model in my head. Okay. Okay. Let's go to the case board. Yeah. Thanks. Everything we know about the previous murders. Oh, was this from Alan Wake one? Another look. No, I think this is just what's happening at the lake. Okay. This is the lake house. Can we talk about that for a moment? So, she goes into the mine place. Yeah. Aka the mine palace. I go into my mind palace a lot during podcast when Anniey's",
            "start": 1481.92
        },
        {
            "text": "the lake. Okay. This is the lake house. Can we talk about that for a moment? So, she goes into the mine place. Yeah. Aka the mine palace. I go into my mind palace a lot during podcast when Anniey's talking. Yeah. So, what what does it look like when you're in the mind palace? Does it look like Nick in real time is zoning out or like what is she doing? Is she doing this? Is she Yeah. You look over like Saga's having a seizure again. She's like the eyes roll back into her head. She wakes up. She's like, I got it. It looks like one of those computers, like human computers, computing stuff in Dune. That stuff is crazy. Computers, computing stuff in Doom. You know what? I got there at the end. I got there at the end. Is that Heraldo Rivera? Oh, yeah. Ed Lane, dentist, stab wounds, bloated, bruising on the chest. Oh, that's not the homie that got. Okay, then Piery Wolf, store owner, bruising, heart removed, strange tattoos. Wendy Davis, teacher, body bloated, large chest wounds. Whoa. Oh,",
            "start": 1538.08
        },
        {
            "text": "on the chest. Oh, that's not the homie that got. Okay, then Piery Wolf, store owner, bruising, heart removed, strange tattoos. Wendy Davis, teacher, body bloated, large chest wounds. Whoa. Oh, okay. That's the guy I just was. That's a murder method. All victims reported missing in 2020 2010. No other comm it looks like a scars guard. Killer profile. How do I move around this thing? I got to move. No, I want to move this way. Okay, let's move over. Cool. All right. Done. I'm done. Cases. Goals. Good cases. Good. Good. Cases. Oh, okay. Yeah. Let's do this. escape. I've escaped. We got to leave the mine palace. Okay. How do I What do I have to go to the Let's get out of the mine palace. I hear you. A little little cluttered. The mine palace. Well, I think that's like what home base would look like, right? Like she's basing it off of the current field home base, which is this like small little mountain cabin. Oh, you think the mine palace changes every time? Yeah, I think so. I think it",
            "start": 1580.8
        },
        {
            "text": "like, right? Like she's basing it off of the current field home base, which is this like small little mountain cabin. Oh, you think the mine palace changes every time? Yeah, I think so. I think it does. I think it does. Pretty cool. That's uh that's the daughter we just talked to, right? And that's that's our that's our partner who's in a Now, here's the rule. Yeah. Here's the rule. You never bring pictures of family to to the mine palace. To the mine palace or to home base because the bad guys are going to find it. They're going to get inside your mind. They're going to get inside your mind palace. Someone smokes cigarettes. They're already cool. Let's get out of the mine palace. I see you're already hard at work, Anderson. Close to cracking it. We're just getting started. Let's head down the hill to the crime scene. A different voice actor for that man. We were just talking about this. We're not sure. Sure. Yes. Uhhuh. It is a different voice actor. It's not Sam Lake speaking",
            "start": 1634.08
        },
        {
            "text": "down the hill to the crime scene. A different voice actor for that man. We were just talking about this. We're not sure. Sure. Yes. Uhhuh. It is a different voice actor. It's not Sam Lake speaking though. Did that Was that the character from the first one though? Wasn't that the character from Alan Wake one or is that Alan Wake? Um, who's Alan Wake? I think he was the guy at the start that I'm Alan Wake. I really I really did expect to be introduced to Alan Wake maybe off the rip here, but I'm excited to meet him. It wasn't the guy with the piece of leaky, was it? No. No, I don't think so. That's not Alan Wake. Andy, have you played this game? And with some dinker and some butt. Did you see the dinker? Yeah. And with the awesome power of DLSS, we saw the guys back here in like real good uh resolution. We didn't have to sacrifice quality. Andy, he walked away. This is why Andy does these spons. Tweet this at your friend. You okay to jump down? I'm not that old. Cuz they're not",
            "start": 1671.2
        },
        {
            "text": "good uh resolution. We didn't have to sacrifice quality. Andy, he walked away. This is why Andy does these spons. Tweet this at your friend. You okay to jump down? I'm not that old. Cuz they're not windbreakers, Mike. They're like thick parkas. Yeah. And I like that about that, right? Because like if we're out in the if we're out in the woods, I wanted I wanted to be a little thick. Yeah. Let's take a look at this little clearing right here. Nice. Looks good. I like this game. I like the coloring of this game. You can tell they they've kind of taken steps to make sure that it feels like it's filmic, cinematic. Yeah. With the coloring, right? Bright. It's kind of dingy and Yeah, that's that Sam that's that Sam Lake and Remedy special. You know, that's what they're known for. It's great. Mike, would you ever be a special investigator for the FBI and investigate like serial killers like this? Do you think you could do that? Be pretty scary. No, I don't think I could. I'd make a great",
            "start": 1715.44
        },
        {
            "text": "Mike, would you ever be a special investigator for the FBI and investigate like serial killers like this? Do you think you could do that? Be pretty scary. No, I don't think I could. I'd make a great driver, though. If they did. Oh, you'd be a good driver. Yeah. If they need me to drive from point A to point B, I could do it. You think they put up a tarp, Mike? Got to put up a tarp. I think Mike, I think you can put up the tarp. The tarp guy. Yeah, give me the tarp, man. I take it. That's me at your service, ready to get this case solved. Now, the bodies behind the store. Come on, I'll show you. Oh god, this looks amazing. Which body do you think we're going to see first? I think it's the I think it's the guy that got killed. You think it's the guy? Yeah, I think it's our our friend the Scarsgard psychon. [Music] You forgot the witches ladle. Look at that. Look at that volutric lighting coming through. Look at that. You got to just not say words. Look at the god rays. But it is. Is it",
            "start": 1774.32
        },
        {
            "text": "psychon. [Music] You forgot the witches ladle. Look at that. Look at that volutric lighting coming through. Look at that. You got to just not say words. Look at the god rays. But it is. Is it really? Yeah. [Music] No way to know. It's really pretty. It's in the literally in the thing. He's going to show it to you right now. Watch this. Go. I saw it earlier. They were like, \"Look, volutric lighting. Look at that. See that right there? Set it to low. Set it to low. Take a look. Let's see what it looks like now. Oh, it changed. Did you see that? Yeah. See, now it's like one stream. Wow. Nick, with your research. I know. I know. Well, a lot of these trims are from when I tried desperately to learn how to do uh 3D graphics. Okay. Uh and then I was like, that's for smart people. You know how to do 3D graphics? I know how to do 2D graphics very well. 3D graphics are when you have to deal with all this stuff like all these options right here. This is these are all like when you really get",
            "start": 1819.56
        },
        {
            "text": "to do 3D graphics? I know how to do 2D graphics very well. 3D graphics are when you have to deal with all this stuff like all these options right here. This is these are all like when you really get deep in the curtles, right? The volutric lighting. Yeah. The like the the global illumination. Oh, that's super cool, right? So, you can see like the difference here. You can see actually let's let's turn this low for a second. Let's see what that looks like. Okay. Yeah, you can definitely tell we got to get back up. Always get back up. Ultra. First off, shout out to this game being optimized. Super. How nice that looks. This like a little fog on the ground here. Look at that. That's so pretty. It's really Oh, they didn't put up a tarp. Mike, you owe me five bucks. Oh, yeah. They didn't have one in the budget. Don't go at a different angle. Go at a different angle. I don't want to see that. Is this angle good? No. Is this angle the good angle? Thanks, deputy. No tarp. You owe me a coffee.",
            "start": 1867.6
        },
        {
            "text": "in the budget. Don't go at a different angle. Go at a different angle. I don't want to see that. Is this angle good? No. Is this angle the good angle? Thanks, deputy. No tarp. You owe me a coffee. Okay, let's start by examining our guest of honor. They left his heart here. Yeah, they ripped him out. Of the previous murders. They took his heart out, but they left his speech leaking intact. Yeah, not a sexual crime. No, not not that. No, no. What an awful copy it'd be. The peach leaks intact. This is not a sex crime. Clearly uh they're not the sexual sex stuff. Not a sex thing. Nobody got off here. Nobody got off here. Oh, look. Kevin, I'm sorry. They want me to look right. They got to look at this guy. Got to look right at the body. Ritualistic. Let's go into the mine palace. Back to the mine palace. Okay. Oh, there we go. Cauldron Lake murder scene. There we go. Put it up there. Body turns up just as we arrive in town. She's in this nice sweater. Coincidence? Christmas themed. I like",
            "start": 1916.8
        },
        {
            "text": "palace. Okay. Oh, there we go. Cauldron Lake murder scene. There we go. Put it up there. Body turns up just as we arrive in town. She's in this nice sweater. Coincidence? Christmas themed. I like that. It is Christmas themed. Oh, consistent with previous murders. We put that there. It's uh Okay. Thanks, guys. Look around. Yeah. Okay. Is it consistent with other murders? You looked at the other murders before. How'd they look? They sure, I guess. Similar. Okay. I imagine so. Yeah. What am I doing wrong here? There. Okay. Continue. Okay, we did it. Okay. And exit the mine palace. Okay. I really got to go through this door every single time. I think you're going to have to do this a lot. Okay, good to know. We're all enjoying it. I think it's a big part of the game. My goals here. One of the Okay, this is investigator. It's fun. Yeah. All right. So, we talked about this guy. You can collect clues from the body. Let's look at this. The killer left the heart right next to the body. Yeah.",
            "start": 1971.44
        },
        {
            "text": "Okay, this is investigator. It's fun. Yeah. All right. So, we talked about this guy. You can collect clues from the body. Let's look at this. The killer left the heart right next to the body. Yeah. strap this guy. Cargo straps holding him down. Ah, yeah. Inside stab wound, chest cut open, heart removed. I put it on my mind palace. You got to go pretty deep to do that. Go into this. See, look. We got to put these up, Mike. Put them up. Put them up. Put it up. String it up. Okay. Okay. It's kind of scary. You got to get it up there. I got to try to get it up there, right? I have no idea what it is. Do you think maybe you put it up there so the string can attach to different angles? Is that what it is? Oh, right here. Like this. What did he do? Great question. It's a great question. Oh, I got it. Okay. This is a puzzle. I see. Oh, okay. I see. Newly discovered codes will be placed on the open. Uh, question. Okay. Maybe here. Cargo straps used to restrain victim. Okay. Uh, heart found. I",
            "start": 2034.4
        },
        {
            "text": "it. Okay. This is a puzzle. I see. Oh, okay. I see. Newly discovered codes will be placed on the open. Uh, question. Okay. Maybe here. Cargo straps used to restrain victim. Okay. Uh, heart found. I mean, it seems pretty straightforward, guys. Yeah. Yeah. Put it down then. I mean, maybe that's all you had to do. Guess so. Yeah. Okay, we're done. You nailed it. We nailed it. We solved the case. Solved it. It was the to It was the tow straps the whole time. Everybody knew it. It was This guy was attacked by cargo straps. That's crazy. The cargo straps are alive. We got to go to the local wear the the local workshop. Go to the Home Depot. Who's buying these cargo straps? That's right. Point me in the direction of the cargo strap killer. I don't understand how to drop these. I don't know. I don't know either. I've never played. I've never played. I've never played. Drop with the click. You don't You don't click it. No, it's You got to grab it and then I kind of I'm trying to drop it, but",
            "start": 2083.92
        },
        {
            "text": "know either. I've never played. I've never played. I've never played. Drop with the click. You don't You don't click it. No, it's You got to grab it and then I kind of I'm trying to drop it, but it's not let me Maybe on the thing. See, I would have thought you would have put it above it like a little little straight line. One, two, three. I mean, I can move it around, right? So, come back here. Yeah, maybe I do this. Previous murders. It's crazy that I drew one line to the other ones. Yeah, I really just kind of put that. I didn't do it. Yeah, I And you would have thought like previous with the other murders would have been the chest wound cuz everybody else kind of had like these crazy cuts. You don't have any open questions, right? Yeah. I don't think so. Put it on there. Nick, what is that? What am I looking at? That's a heart. Yeah, that's the heart. The other thing. That's an open chest wound. That's Oh, looks like you can put that one down at the bottom. Underneath it. Dress",
            "start": 2138.0
        },
        {
            "text": "is that? What am I looking at? That's a heart. Yeah, that's the heart. The other thing. That's an open chest wound. That's Oh, looks like you can put that one down at the bottom. Underneath it. Dress maybe. Chad, what am I doing wrong? Put on the yellow question. Where is the yellow question? Here. Consistent with other writers. Uh, no. Did you put the first one on that? We just didn't notice. Removed from chest. I must have by the river. I don't remember that. Okay. Murders, but this time the heart and the straps were left behind. More clues to work with. This makes four murders that we know about. Four. Okay. And oh, the victim, the killers, guys. Who are they? Who is who? What's happening? Learn more about the victim. Let's get out of the mine palace. Okay. Okay. Wait. Cases. Oh, go. Okay. Got it. We're doing it. Okay. We're in there. We're in there. We're deep in the mind palace. We're in the mine palace. F cases. You are now free to examine the case board. Okay. Yeah. Can I open",
            "start": 2174.64
        },
        {
            "text": "Got it. We're doing it. Okay. We're in there. We're in there. We're deep in the mind palace. We're in the mine palace. F cases. You are now free to examine the case board. Okay. Yeah. Can I open this up? Can I open this up? Love that. Can I open this up? Can I open this up? Okay, we're just going to exit the mine palace. We don't need this anymore. We're going to go look at the guy Shvance again. I think there's a lot of a lot of information that we have not mined from this guy's good, you know. Yeah, of course. Of course, of course. We need names. Who killed him? I mean, the local cops should know, right? Multiple people were here. It should. I mean, we have we have I think we have his name. Unless this isn't the same guys, but No, I think this is a fourth guy now. Yeah, this is a fourth killer. Let's look around here. There's gasoline cans. No one would leave these here. Those are very expensive. Jerry cans. Let's look around here. I hear on Tik Tok you get them pretty cheap. Like",
            "start": 2223.04
        },
        {
            "text": "killer. Let's look around here. There's gasoline cans. No one would leave these here. Those are very expensive. Jerry cans. Let's look around here. I hear on Tik Tok you get them pretty cheap. Like you getting Tik Tok ads for jerry cans? No, but I'm not buying anything off Tik Tok shop. I still haven't. I'm afraid logged. They really don't want people coming in here. Coming in or out? Like up that path? Inhaling it. Oh, let's look around. We're just going to look around. Canvas the area, as they say. Yeah, I like that. Look at how nice this looks. Jeez. Soak it in. Soaking it in. This is a Oh, look. This is like that that just like the gate from Jurassic Park. Only one way to find out. Back to work over here. Can we Okay. Hey guys, I'm just Agent Anderson and Agent Casey FBI. We'd like to come in and ask a few questions pertaining to an investigation. Why is she British now? Not currently available. Access is restricted without their permission. Nice talking to you, too. Wow. This",
            "start": 2272.0
        },
        {
            "text": "to come in and ask a few questions pertaining to an investigation. Why is she British now? Not currently available. Access is restricted without their permission. Nice talking to you, too. Wow. This guy's a Okay, this guy's a not nice person. Those are recording. No, this guy's not letting you into the lakehouse. I'm getting in that lake house. That's DLC. I'm getting in. Oh, that is DLC. That's DLC. It is DLC. Actually, I've seen it. What's this? Where are we at? What's this? No one would leave picnic chairs like this. I would never You always pick up your trash, too. Creepy twig sculpture. Oh, that's a dream catcher. You know what I mean? Like, it's all right. A creepy twig sculpture. Yeah. Just like totally insensitive. Just immediately went to that. Remind me of a dream I had. About a deer drowning a lake and then a big man came out of that and then they cut his heart out. No. What's he got in his mouth? Didn't he have something a second ago when you were like right up on it? I",
            "start": 2332.72
        },
        {
            "text": "a deer drowning a lake and then a big man came out of that and then they cut his heart out. No. What's he got in his mouth? Didn't he have something a second ago when you were like right up on it? I think those are whiskers. Those are whiskers. Oh, yeah. You're right. But there's this thing. You see that cool logo right there? Yeah. Yeah. Triangle. I got a t-shirt with that logo on it. Do you? That's There's a lot of them around here. Too fat to wear it. Look at this. I've been there. Just got started, Mike. You're amazing. Look at that. Okay, that's cool. It's all over the place. Must be a sign. Must be some sort of puzzle. I didn't know they did it in different uh lineups, too. That's pretty wild. Yeah. I mean, that's uh Maybe it's like pointing like up. Well, these are the Oh, wow. Good job, Mike. Something like that. You know what I mean? See anything over there? You think it's pointing to a clue every single time? I just throw things out. You know what I mean? What if? What if? I",
            "start": 2385.04
        },
        {
            "text": "job, Mike. Something like that. You know what I mean? See anything over there? You think it's pointing to a clue every single time? I just throw things out. You know what I mean? What if? What if? I have Oh, look at this. Let this be a warning to you fellow trapers. They say lake is a caldera, something formed by an erupting volcano or the sink calls it leaves in its wake. Allan wake. But what if that's not true? What if something else, something less natural, much more man-made, intentional? I I say the lake is not formed. It's designed and it has purpose. The lake is a hiding place. Beneath the calm surface lies a secret machinery ready to be activated at the press of a button or a D-pad. And then and the people with the button, they're in that big house by the lake prepared. I know it. First drawing water line. Real caldera is made of lava. Volcano lava. Second drawing water line. Engineering structure. Strange machines. Dang. Cool. I just uh can I can I keep these things? They had",
            "start": 2428.56
        },
        {
            "text": "First drawing water line. Real caldera is made of lava. Volcano lava. Second drawing water line. Engineering structure. Strange machines. Dang. Cool. I just uh can I can I keep these things? They had to kill this guy cuz he knew too much. He knew too much. God doesn't design. Start scratching the surface. You got a problem. It's true. Maybe the world's flat. Exactly, Kevin. Exactly. Hey, Casey, what's the forest's favorite shape? Please, Anderson. Just one case. Triangle. A triangle. I don't get it. Yes, you do. These two have a great partnership. How long you think they've been partners? Eight years, minimum. It's been three days. You don't get this kind of camaraderie and rapport back and forth. You're not allowed to send send that kind of joke unless you've been together, right? Exactly. A triangle. Oh, it's a triangle. I get it. See, perfect for a Monday. I'm going to go back to the uh Yo, what's this guy? What's this guy's de man? Just looking at canvasing here. Back to the",
            "start": 2479.84
        },
        {
            "text": "A triangle. Oh, it's a triangle. I get it. See, perfect for a Monday. I'm going to go back to the uh Yo, what's this guy? What's this guy's de man? Just looking at canvasing here. Back to the general store. Oh, we got to go back this way. Sorry. This does look like a kind of an idealic place you'd hike when when it's like warmer out, you know, and maybe there's less dead bodies. Okay. Yeah. Yeah. Yeah. Yeah. Yeah. This is not the ideal place to hike right now cuz there's a lot of murders going on here. Any idea who the victim is? Oh, I sure do. His name is Nightingale. He was FBI. Came to town about 13 years ago. Whoa. I haven't heard a word about him since. Was that his only name? Just Night andale. No first name, no last name. Just Night and Gale. That's what they called him. Oh, Robert Night andale. Yes, you probably knew him. Brothers in arms. Oh, and sisters. Nightingale. Crazy. Cool. All right. Well, go to the mine palace right in front of this guy. Hold on. So, you knew Alic.",
            "start": 2531.52
        },
        {
            "text": "Night andale. Yes, you probably knew him. Brothers in arms. Oh, and sisters. Nightingale. Crazy. Cool. All right. Well, go to the mine palace right in front of this guy. Hold on. So, you knew Alic. Go to the mine palace right in front of this guy. Just go mine palace with this guy. Just let him know what we're doing. But yeah, I ran into him a few times at Quanico. Never worked any cases together. After his partner got killed in the field, he went off the deep end. Got the boot pretty quick after that. Quanico is a cool place. Like a cool name. You know what I mean? It's like, oh, where were you? I was at Quanico. The bureau let him go. I only know the rumors. Depression. Booze. Booze led to paranoia. Paranoia led to suffering. in his head, chased ghosts. And is that Yoda? Yeah. Guess he ended up here. I bet there's more to that story, but no happy ending. Nightingale went missing 13 years ago, 2010. The same as all the other victims. The calara makes me wonder what was going on that",
            "start": 2587.76
        },
        {
            "text": "ended up here. I bet there's more to that story, but no happy ending. Nightingale went missing 13 years ago, 2010. The same as all the other victims. The calara makes me wonder what was going on that year. Probably something this town wants to forget. Okay, so we got a connection there. Put that in the mine palace. Put it in my mind palace. Mike wants you to go to the mine palace so badly. Put that palace. I don't think you're ready for it. I'm in. What? He just said that like you said like five times. No. Yeah, but I like cuz now we have the victim. Cheers me up. Oh, not the worst. Mom, this is a great mine house. That's cool. Let's go back over here. We're going to go to the case board, everyone. Look at the map real quick. Take a look at the map. That's where we are. Cool. Map's awesome. Undiscovered map. Undiscovered map. We got more map pieces. That's a massive map. Big map, dude. We're about to get into it. Okay. Ready? So, the victim, right? No, we haven't learned about him.",
            "start": 2640.0
        },
        {
            "text": "Undiscovered map. Undiscovered map. We got more map pieces. That's a massive map. Big map, dude. We're about to get into it. Okay. Ready? So, the victim, right? No, we haven't learned about him. That guy. It is. That's that guy. What? Yeah, that's the guy. That's That's That's the guy who's dead on the on the table right now. Oh, no. Wait, that's Thornton. That's the No, Robert Nightale. Yeah, that's the guy. That's our guy. Or maybe that's what Thornton told us. That's Thornton. Yeah. He doesn't look the same. No, that's Robert Nightingale. Yeah. No, that's that's our friend that knows Robert Night. Yes. Came to Bright Falls 13 years ago. Dang. Go the killers. Multiple sets of footprints. Lots of activity here. It's unlikely killers worked alone. There's more people. And we know because we saw that cut scene. Yes. And because it it takes multiple people to tie up those truck ties. Yeah. You got Well, unless unless they're haunted. Unless they are operating on their own and those",
            "start": 2695.6
        },
        {
            "text": "we saw that cut scene. Yes. And because it it takes multiple people to tie up those truck ties. Yeah. You got Well, unless unless they're haunted. Unless they are operating on their own and those people were trying to stop it the entire time. We don't know. Was he killed here or brought here after? Pretty sure he was killed here. I saw it. That's a good question. That's a great question. Why would they display this out in an open public land? I think they want kids to see. They sent a sign. I think I saw something. It'll only take a minute. I'll wait here. What did I see? We got to track back, dude. We got to backtrack. When you're When you're an FBI agent, you're down to take a walk. You got to check every angle. I'm just going to go down a little and see cuz this is where he came from, I think. Or maybe not. We don't know. Wow. Delaney Twining writes in with the $5 super chat and says, \"Mike, I went to school in Northern Virginia, Mary Wash. There are multiple Quanico sites around",
            "start": 2741.36
        },
        {
            "text": "I think. Or maybe not. We don't know. Wow. Delaney Twining writes in with the $5 super chat and says, \"Mike, I went to school in Northern Virginia, Mary Wash. There are multiple Quanico sites around DC and Richmond. The feds were all over us. All around us. Yeah, either. I didn't know there was multiple Quanico sites. I didn't know that either. Quanico. What are you doing? I'm training in Quanico. Quanico. I am an FBI agent. This is a big ass tree. He was Johnny Utah. He was an FBI agent. He was the best of us. He really was. He was the best of us, bro. The chase of endless summer called to him, man. Really did. Best friends. I'm gonna go back up. The Bod Cipha spoke the words, man. He believed it. Zipa. He was like, \"Oh, man. Bodie. He's the Bifa.\" Bod's living a good life. He said, \"I want to live that life.\" Oh, is that where you jumped down earlier? Yeah, it might have been. Okay. No, it's not actually. No. Hi, Delaney as well. It's great to see you. Thank you for the super chat.",
            "start": 2789.68
        },
        {
            "text": "to live that life.\" Oh, is that where you jumped down earlier? Yeah, it might have been. Okay. No, it's not actually. No. Hi, Delaney as well. It's great to see you. Thank you for the super chat. Oh [ __ ] Why is she throwing a shoulder into that thing? Yeah, that was the That's what you learn in Quanico, bro. You got to go You got to go full in. Oh, rope. Nothing in here. Kind of a waste of your time. Subs. You're telling me there's nothing in the witches? Her spirit may still haunt the place. Bacon, thank you for the Prime Gaming sub for 11 months. Thank you, Bacon. Do we do we [Music] Jurassic Park. They got a new movie. Yeah, dude. I can't wait. Jurassic Park World 3 Dominion. Can't wait. Well, that was the old movie. Scarlet Johansson. Scar Joe's in it. Get her lots of money. Yep. She's doing her victory lap now. They're going to have water dinosaurs, too. That's super fun, dude. They always have the big water dinosaur. I love the big water dinosaur. I want to see more water",
            "start": 2855.04
        },
        {
            "text": "She's doing her victory lap now. They're going to have water dinosaurs, too. That's super fun, dude. They always have the big water dinosaur. I love the big water dinosaur. I want to see more water dinosaurs. Kevin, one of the most aggressive aggressive deaths we've ever seen from a dinosaur was that poor that poor lady. She did nothing wrong. She did nothing wrong. She was just put these awful kids and then she gets killed violently as a villain would. And what does that teach us? Never have kids. Oh no. Never say yes to your boss. Kevin, you have one more kid. You might get eaten by a giant water monster. I didn't get Why is this guy being a dick? He's being a D. This guy's not helping us. You're trying to be a cop, you know. Here. Waiting. Wait. Oh, what's up with the tripod? Someone was filming some that a crossbow. Probably sexual stuff. Oh, it's a tripod. No, I thought you already disproved it wasn't sexual. Well, all right. Cuz this piece of Leica is still attached. Yep.",
            "start": 2938.32
        },
        {
            "text": "was filming some that a crossbow. Probably sexual stuff. Oh, it's a tripod. No, I thought you already disproved it wasn't sexual. Well, all right. Cuz this piece of Leica is still attached. Yep. Otherwise, the mine palace, everyone. Back into the mine palace. We got to look at this. So, the killer stayed over for later. Oh no. Oh no. Why don't they for now? I guess maybe we got to find some more stuff. Mike, we learned something real cool. What have we learned? I don't have to go to the door. I can just hit exit in the Oh, yeah. The people were typing that in. Yeah, it's fine. Yeah, I mean, it also said that. I let him just play the game. Let me play the game, folks. Let him play the game. Okay, this is the triangle shop. See you in a bit. Take your time. The triangle like the visual. I'm assuming everything's just in this little area that I need to be at here. I don't think they want me going anywhere else. All right, we got the footsteps. Let's look at all the clues. tried that gate",
            "start": 2980.72
        },
        {
            "text": "assuming everything's just in this little area that I need to be at here. I don't think they want me going anywhere else. All right, we got the footsteps. Let's look at all the clues. tried that gate already. This is the spot. Zombie, thank you for the prime game. He sub for 14 months. Zombies ate Keegan. That's a good name. It's a big tree. I think I'm ready to render an opinion on who killed this guy. I want to walk around a minute. It's definitely Thoron. It's the cops. You think the cops are in on it? I mean, well, so far. Well, a small mountain town like this, right? Twist. If you're hiding four murders. Oh, wonder what's inside here. Around for a way to open this thing. Yeah, that'd be a great idea. Thanks. Wash hands. Take chicken out of fridge. Take a nap. Confused? Follow the steps. Oh, this guy had momento. Yep. It's a momento guy. Wash your hands. Let's go back in here. There has to be something fun in here. Can I open these stupid things? Check for the chicken in the",
            "start": 3022.08
        },
        {
            "text": "steps. Oh, this guy had momento. Yep. It's a momento guy. Wash your hands. Let's go back in here. There has to be something fun in here. Can I open these stupid things? Check for the chicken in the fridge. Oh, yeah. Good call. Can I open the fridge? Missing a heart. Nope. Is it in here? It's got that cooler. Yeah. Well, the heart's out there. Wash hands. Take the chicken out. Take a nap. Okay. So, maybe bed. [Music] But I mean, we do like one thing this brings to mind is like the sleeping naked. There's always the risk you have to run out in the middle of the wilderness. Yeah. You might get your heart cut out. And uh Exactly. This is why I jammies on. I love sleeping naked. All right. I like sleeping naked cuz like if I get up then they know, oh, he's naked. He means business. This guy's coming at me. This guy's crazy. He's wet. This guy's crazy. He is just a naked seal. Welcome back, Anderson. Okay. Well, I don't see any other clue. Did you find anything in that? No. I mean, I",
            "start": 3075.6
        },
        {
            "text": "guy's coming at me. This guy's crazy. He's wet. This guy's crazy. He is just a naked seal. Welcome back, Anderson. Okay. Well, I don't see any other clue. Did you find anything in that? No. I mean, I already looked in that room. Last one here. Okay. Blood on the table. The victim died here. I think that's everything. Okay, good. Now it's everything. Oh, figured it out. Not sure. I got to go to my Sam Lake. I got to go into my mind palace. Sam Lake. Okay. Heavy bleeders. We got to go back here. Heavy blood splatter. No, we got to put it on. Where's Okay. The victim. You don't think that's part of the killer? I think it's part of the killer. Yeah, maybe you're right. Look at that. Put it on there. Yeah. Done. indicating multiple killers. These are for late. Oh. Oh. Oh, they're here now. Oh, no. These are for later. Oh, okay. Maybe he was having a party. Oh, these are for later. Later. These are for later. Well, now it doesn't say later anymore. Now it says they're here. Yeah. Now it's",
            "start": 3135.6
        },
        {
            "text": "no. These are for later. Oh, okay. Maybe he was having a party. Oh, these are for later. Later. These are for later. Well, now it doesn't say later anymore. Now it says they're here. Yeah. Now it's game time. Now we're here, buddy. Well, what do we eat? Oh, okay. A victim thing. Oh, premeditated or spontaneous? Look at this. Well, they've been here for a while. It's definitely premeditated. Premeditated. And we've got those things. Where do you think she buys the string from? Michael's. I think she thinks Hobby Lobby. She strikes me as a Joann's Fabrics kind of personale. She had to stock up on that. Been missing for 13 years. Yeah, you need a lot of red. Do you throw away all the red string after every case? Yeah, because it's tainted, right? You don't want a certain length. Yeah, exactly. You can only have one length. That's true. She really filled up that wall quick. Get into the subject's head. See what they saw. What? Feel what they felt. Whatever I know about them to guide my",
            "start": 3188.52
        },
        {
            "text": "You can only have one length. That's true. She really filled up that wall quick. Get into the subject's head. See what they saw. What? Feel what they felt. Whatever I know about them to guide my intuition to a revelation. This is going to get scary. I can tell. Together. Profiling. Yeah, that's a interesting one. This is going to be fun. Here we go. We got to profile this guy. Uncip Missing person. Ritual murder. Profile complete. What do you think? Oh, boom. Case board profiling. Let's open it back up again. We just did this. Okay. Agent Nightingale has been MIA for 13 the year. How did he end up here? My mind palace up from the lake. That's not a lake. It's not a lake. It's not a park. He was there, too. You are not allowed in the lake until he says otherwise. Robert Nightingale came from the lake before his murder. Nightingale was chosen as the victim. Why? Why the switch? It goes click. Flick the switch. Lights are off, but somebody's home. Somebody's home. Somebody's home. They",
            "start": 3233.36
        },
        {
            "text": "the lake before his murder. Nightingale was chosen as the victim. Why? Why the switch? It goes click. Flick the switch. Lights are off, but somebody's home. Somebody's home. Somebody's home. They want me to go back into the trailer and eat some snacks. A nightingale a component. They didn't see him as a person. More like a container for something. Okay, we did it. Okay. Well, he he knows something about the lake, Nick. He that guy knows there's something inside that lake. Oh, I got to go back into the mine palace. These guys aren't prompting me to move on. Oh, okay. I clearly missed something. Okay, I clearly missed something. Let's look at the map. This is a map. A strange map. That's mine. I She didn't say that, guys. Just in case you're Let's look at the case part to the victim cuz the spoils. Okay. Oh, I got more pictures. Oh, okay. Victim came from where? I I came I can feel it came from the lake. But why? Why now after 13 years? Yeah. Victim came from Calder Lake. Okay. What was",
            "start": 3293.68
        },
        {
            "text": "spoils. Okay. Oh, I got more pictures. Oh, okay. Victim came from where? I I came I can feel it came from the lake. But why? Why now after 13 years? Yeah. Victim came from Calder Lake. Okay. What was he doing under the lake? Mike, is there a facility under the lake where the deer people torture big dudes? That's what that notebook said. Maybe we got to believe the notebook. We got to believe the notebook. I believe the writings of a man a mad man. The lake is connected to Nightingale somehow. Casey, let's take a look. Like you played this game before? No. Sounds good. This way, right? Right. Well, okay. Well, I'll just uh I'll just wait here. You stay here. Hickory Dan, we got to go down to the lake, Mike. It's over this way. Caldera Lake. Probably over here where it's lake. Okay. Probably where the water is. Which way are you going to point on this? I got to go this way over here, Mike. I thought he was over by the river side. Well, you know, cuz it said lake here. I was like, well,",
            "start": 3360.4
        },
        {
            "text": "where the water is. Which way are you going to point on this? I got to go this way over here, Mike. I thought he was over by the river side. Well, you know, cuz it said lake here. I was like, well, that's green. Yeah, he's got the He was following the river for a minute. Yeah. Look, you got to follow the river like it's a colon. It's like, oh, wow. Yeah. Yeah. Like it's like your this is your large intestine, small intestines, then your colon, then it poops right out. You just hit a left. You didn't know the Get out of this. Hit a left. Go north, left. You didn't know the next victim missing a colon. Yeah, this guy's They took out his lower colon. Let's go, Sam. I'm just calling this guy Sam. Come on, Sam. I think you guys found the colon cuz you're full of [ __ ] Wow. We should all do enemas together. We should go get like coffee enemas like doing Well, I do a coffee enem every day, but I just put it in my mouth first and it comes out. Okay. I don't think that's how animas work.",
            "start": 3410.28
        },
        {
            "text": "enemas together. We should go get like coffee enemas like doing Well, I do a coffee enem every day, but I just put it in my mouth first and it comes out. Okay. I don't think that's how animas work. Yeah, I'm down with that. Say the word. We'll stream it. Sure. So fun. Greg and I are supposed to get basectomies together. Yeah, he he pulled out. He worked out alone at night. He's like, maybe I want another kid. More spring breaks. Was here. Two spring break. The more kids you have, the more spring breaks. Grabbed him to the table, cut his heart out, but then they were interrupted by those witnesses. the bookers. There's a piece of paper on the ground. I didn't know trees got that big. Tracks barefoot. Nighting gales. Maybe they come out from under the boulder. It makes no sense. How did this tree get put here? Maybe it grows from the ground. Yeah. Why does it come out of my mind map? I got to mind board this guys. I'm sorry. Where did the victim come from? Okay. Tracks coming out of the",
            "start": 3449.6
        },
        {
            "text": "tree get put here? Maybe it grows from the ground. Yeah. Why does it come out of my mind map? I got to mind board this guys. I'm sorry. Where did the victim come from? Okay. Tracks coming out of the boulder. Got it. And then super weird. Okay, trail has gone cold. I think he came from the lake, but his tracks make no sense. Sense. Okay, get me out of this. Let's read the note. So, film Nick. A page full of text on one side, not a print out, written with a typewriter. Old school lines scratched out and edits added with a pen. Mhm. Like a manuscript. Exactly. Story. Exactly. Killer left. The killer left a message. It's for us. The You're all going to die next. What? I mean, a part of the story was one of their own. Yeah. FBI special agent Robert Nightingale. And then there was a page they found. The first step down into terrifying depths. Crazy. Reading the words. These words felt like a message. Felt like a message. Someone knew they were here. Someone playing a game with them. Is",
            "start": 3493.12
        },
        {
            "text": "found. The first step down into terrifying depths. Crazy. Reading the words. These words felt like a message. Felt like a message. Someone knew they were here. Someone playing a game with them. Is Allen writing a story about us? Are we a part of Alan Snap? Wow. Allan's the author of Maybe. Maybe. And why does Allan look a little like Jared Leto? He's got a look. Is he Letto look? Maybe. Is he Tron Aries? Someone's been watching us. He's Tron Aries. You nailed it. When are we making that movie? When's that movie out? Coming out soon. Can't wait. This is right up my alley. Nightingale came this way. Guys, I'm in a movie. He dropped this book. I'm in a book. You're in a game. The killers left it for us. But a game within a game. Kevin, let's go to the mine place. Take us to the mine place. Take it to the mine place. Anything else here? Yeah. Reading from words. Words. The mine place. I should profile that. As we take a look at the mine plays, why don't we take a quick moment and give you",
            "start": 3562.0
        },
        {
            "text": "it to the mine place. Anything else here? Yeah. Reading from words. Words. The mine place. I should profile that. As we take a look at the mine plays, why don't we take a quick moment and give you a word from our sponsors. Don't forget today's stream is brought to you by Nvidia. And we'd like to thank Nvidia for allowing us to show off Allen Wake 2 with DLSS4 and more. We'll talk about that when we return right after our word. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith. But those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these",
            "start": 3610.72
        },
        {
            "text": "But those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shield, and the powerfully ranged cannon. With a deep ability system, and extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith,",
            "start": 3654.64
        },
        {
            "text": "monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. wish list Imperial. This episode's brought to you by Araf Frames. If you haven't called your mom in a while, here is your reminder to do it. But then, if you want to go above and beyond, Mother's Day is coming up, and I have the perfect gift idea. Aframes are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Trust me, Gia's dad does, Greg and Kevin",
            "start": 3703.84
        },
        {
            "text": "online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Trust me, Gia's dad does, Greg and Kevin and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. And I know that from experience. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aframes.com to get $35 off plus free shipping on their best-selling Carver Matte frame. That's auraf frames.com. Promo code kind of funny. Support this show by mentioning us at checkout. Terms and conditions apply. And we're back into our mind palace. Ladies and gentlemen, take me to the mine palace. Take me to the mine palace. Now, Mike, what did that what did that guy say? Said, \"Take me to the ad palace, Mike.\" No. And I said, \"I took you to the ad palace.\" They're in the ads. He was like, \"Oh, remember this",
            "start": 3752.08
        },
        {
            "text": "mine palace. Now, Mike, what did that what did that guy say? Said, \"Take me to the ad palace, Mike.\" No. And I said, \"I took you to the ad palace.\" They're in the ads. He was like, \"Oh, remember this one case?\" Oh, my headphones were off the whole time. What do you And I was talking to you and you're like, we'll pick it up in the mine palace. Yeah, we'll figure it out for It's going to be fine. He's fine. I think somebody hid the trees. This guy's an old I don't know why I'm He's an old soul. He's literally talking over me. He's fine, Kevin. An old soul. That might have been a helpful hint. I don't know. That's a fairly straightforward game, Kevin. We're going to solve this by lunch. Yeah. I thought we were going to the lake, bro. Are you leading me to the lake? You made it back. Good. Okay. I hope you didn't get stuck in any of those big puddles. What? Want to punch this guy in his face. Down there, huh? Just like I said. We couldn't get down there. Asian Thornton. Deputy Thornton.",
            "start": 3797.92
        },
        {
            "text": "I hope you didn't get stuck in any of those big puddles. What? Want to punch this guy in his face. Down there, huh? Just like I said. We couldn't get down there. Asian Thornton. Deputy Thornton. Asian Thornton. What does that mean? Guy's name. This guy's an idiot. This guy's an idiot. All right. Well, I got to find another way down the lake, right? Do you think FBI agents like come to these local towns and they're like this this idiot cop over here% slowing down? I think that a lot of times it's not like it is an idiot cop but it's not their fault. They've never dealt with a murder before. Yeah, they're used to Well, this town has dealt with drunk and taking their their their tractors down the highway. Well, they got they got four murders they better be dealing with the FBI, homie. Yeah, you might want to call Quanico. All right, hold on. I got to go to the mine palace. Go to the mine palace. Kind of funny. Best friends, don't forget we are sponsored today by Nvidia, showing off DLSS4",
            "start": 3838.88
        },
        {
            "text": "might want to call Quanico. All right, hold on. I got to go to the mine palace. Go to the mine palace. Kind of funny. Best friends, don't forget we are sponsored today by Nvidia, showing off DLSS4 inside of Allen Wake 2 and so many other games. You can learn all about DLSS4, the power it brings with your Nvidia GeForce RTX 590 and beyond. Don't sacrifice frames to get the best picture quality, and don't sacrifice the best game quality and picture quality and performance by getting more frames. Get all of it. All of it. Give me yours. I love what you're doing here, Nick. I got a little thing on the bottom left hand side. I don't know what it's supposed to be. Does that say get to the car? Maybe. It looks like a wheel steering. No, it's an eyeball in the middle of a target. Eyeball. Looks like a coin. You got a coin? I think I have a coin. Two facing. It talk to me, old man. Tell me what to do. Sam Lake. Sam Lake. I guess I'll try to get to the lake again. Do we actually know what this",
            "start": 3886.4
        },
        {
            "text": "a coin. You got a coin? I think I have a coin. Two facing. It talk to me, old man. Tell me what to do. Sam Lake. Sam Lake. I guess I'll try to get to the lake again. Do we actually know what this guy's name is? No, it doesn't matter. His name is Fitzgerald. That's what I'm going to call him. Henderson or something. I feel like it's Anderson maybe. Yeah. See, if he says I'll be back in a second, it means I'm doing the wrong thing. So, I got to go back. Something I got something's got to be prompted around here. Oh, go to the mine place and press control. Figure out what happened to Night and Gale. That's so You had to go to the mine place. I'm in the mine place. No, no, that you just had to get the gold to kick on. Oh, I see. Maybe it's in the Nick. We We staring at that thing, bro. That thing's going to haunt my dreams tonight. Sorry, everyone. I hate it. It's just there now, dude. It's just there. It's just part of the game. In the background. It's an artistic choice. Okay. Yep. Let",
            "start": 3936.4
        },
        {
            "text": "going to haunt my dreams tonight. Sorry, everyone. I hate it. It's just there now, dude. It's just there. It's just part of the game. In the background. It's an artistic choice. Okay. Yep. Let me go back to the mine place. I think that little prompt says go to the mine place. We could have put him in tidy whies. Let's see here. Could have put him tight. I wish you brought your own or covered him in the in the tarp. Okay. Oh. Oh. Oh, okay. Here. Yeah. Manuscripts. Okay. I got that. See the It is my It's the See, this is Mike. An eyeball in the thing is the inner. It's your inner eye. I gota That's my third eye. That's my third eye. You got to open up your third eye. If you want to work for the FBI, you got to open up your third eye. Third eye blind. Do not touch it too much. I wish that you would step back from that ledge, my friend. You would understand. I would understand. I want to be clear, I hate this role in this. Remember was when Andy was in this room for 5 seconds. I tried to",
            "start": 3981.68
        },
        {
            "text": "would step back from that ledge, my friend. You would understand. I would understand. I want to be clear, I hate this role in this. Remember was when Andy was in this room for 5 seconds. I tried to drag him in and he quickly walked away. He got out of here so fast. He's a skilled boy. He's not stupid. You ever think about that? He's got skills. Stupid. Must. Her name is Saga Anderson. I got one of them right. What's the other guy's name? Bobby Buffet. Here we go. Let's put this on here. Anything. Bobby. Bobby. Bobby Bush. What was What was she always yelling about his girlfriend? She's the devil. She's the devil. That's exactly right. You nailed it. Devil, Bobby. She's the devil. Bobby Bush. She ain't the devil. Learn all about this. All right, let's show me. Never mind. Give me something's been put inside Nightingale's body. Let's tell the deputies to get the body to the town morg. Okay. The guy didn't hear that. That Oh, I wasn't paying attention. Is that what you just said to your",
            "start": 4021.44
        },
        {
            "text": "been put inside Nightingale's body. Let's tell the deputies to get the body to the town morg. Okay. The guy didn't hear that. That Oh, I wasn't paying attention. Is that what you just said to your partner two feet away from me? I won't be back in town for another week after Deerfest. Deerfest. Fest. Sick. That's spring break for him. He's got the bookers at the O Dear Diner in town. Oh, and I've got a key to the gate. It's a shortcut back to the parking lot just up the hill. Thanks, Dorian. short. I like him. You know what? He's come I really come around for it. He's trying his best. He's trying his best. Really come around for it. It would have been nice for him to give you that key earlier. When you remember when I tried this gate and he's like, \"Hey, I don't even know what that gate does. Hey, where's that gate go?\" Hey, where'd that gate go? Let's try that shortcut that I can't tell if we're playing the game right or wrong. Definitely wrong. Oh, I got a gun now. Kevin, go. Oh,",
            "start": 4080.96
        },
        {
            "text": "does. Hey, where's that gate go?\" Hey, where'd that gate go? Let's try that shortcut that I can't tell if we're playing the game right or wrong. Definitely wrong. Oh, I got a gun now. Kevin, go. Oh, wow. You just got strapped out of nowhere like Well, now you're in the danger zone. Now we're in the danger zone. Oh, we're stepping out of the public land. Well, stepping out of public land. Yeah. Okay, I figured it out, guys. There's a couple extra things we got to do. Seems like a nice house. Stepping out of public land. Wow. Treading on private property. His properties private. Deputies aren't exactly up to the task, but hopefully the sheriff will be more. I got another line. Do you really? Yeah, it goes. Whoa. We saw that man's private parts. He needed a little manscaping. What's in here? What's in here? Let's go in here. No entry. Do not enter. Yeah, I like to go places I'm not supposed to go, guys. [ __ ] We already got the keys to go in here. We're already too far deep. I got this",
            "start": 4132.48
        },
        {
            "text": "What's in here? Let's go in here. No entry. Do not enter. Yeah, I like to go places I'm not supposed to go, guys. [ __ ] We already got the keys to go in here. We're already too far deep. I got this case. Alex Casey movie lunchbox. Whoa. Alex Casey jokes about coincidentally having the same name as a fake detective. Oh, no way. It's those cheesy crime books. It's Casey. Casey is his name. Let's put the manuscript. Oh, what's this? I got a pistol. A pistols again. Okay. More bullets increased. Oh. Oh, I have like skill points, but I don't have enough. Okay. So, you find these little things in the things and they give you it. Yes. That's sickness. That is sickness. I don't have enough though. Langley M. Neely adding to the song, too. You're the best. Thank you, chat, for adding the chat. Thank you for adding to the fun. What'd he say? We can't see the chat. Oh, look at that guy's small dong. We said normal. That's an average dong lately. That's actually pretty big in some places. Okay,",
            "start": 4190.0
        },
        {
            "text": "you for adding to the fun. What'd he say? We can't see the chat. Oh, look at that guy's small dong. We said normal. That's an average dong lately. That's actually pretty big in some places. Okay, let's not Jesus Christ. Come on. Let's look at that lighting. Nvidia. Nvidia. Thank you for sponsoring us. It looks ridiculously good. That's the best part about it. It looks so good. So gorgeous. And we are just having so much fun. We had so much fun. We're going to go into town right now. We're going to do a little autopsy. Maybe I like the vibe of this. I'm going to be real with you. I think it's fun. Okay. Yeah. You're going to do the autopsy, right? Oh, yeah. We're going to really get in there. Yeah, definitely. We're going to get into this, man. Someone has to. This guy, by the way, this guy's like, \"Here's the key. Take the shortcut back to This is the same P.\" This is the same path. This is nothing. I don't think Wild Thornberry knows how what a shortcut. What do we see there? A lunch",
            "start": 4236.32
        },
        {
            "text": "like, \"Here's the key. Take the shortcut back to This is the same P.\" This is the same path. This is nothing. I don't think Wild Thornberry knows how what a shortcut. What do we see there? A lunch box and a fuse box. Like, there's not much going on there. I think I saw something. A minute. A lot of litter here. Yeah, but a lot of litter that apparently is waterproof. Yeah, very waterproof. It doesn't really matter. We're not reading it. So, yeah. This guy's like just Well, this guy's bird watching. What do you want him to You want him to bird watch? He's a pvo. I mean, I'm sure there's I mean, he's probably writing of like, I was bird watching, then I heard an old man scream. I looked down. They were chopping his hands off and I ran away. And I don't I'm not quite sure, but I think the harnesses were possessed by the devil. Let's head back to town. Thank you. I was like, I know there Okay, let's go to our car. That's a cool car. No, not that one. Let's go to Bright Falls. Bright",
            "start": 4290.56
        },
        {
            "text": "harnesses were possessed by the devil. Let's head back to town. Thank you. I was like, I know there Okay, let's go to our car. That's a cool car. No, not that one. Let's go to Bright Falls. Bright Falls. Great name for a murder place. Bright Falls. I like can't get that manuscript page out of my head. I've never seen killers reach out so directly before. I got to battle. Impressive work so far. With your technique, these hunches were moving fast. I wasn't sure about taking a case so far from home, but I'm thrilled to be here for this mystery. She's thrilled. I don't know if you be that excited. Yeah, that's kind of intimidating. I don't know about that first year. Dearfest08. Now I'm all set. Look at these guys there anyway. I want to walk to the Look how good that looks. Holy crap. That's so cool. The Crown Vic the dinosa. Look at that. Look at that. Look at those nice that marshmallow on that. They're the They're the uh thermos. We all know I love so much. Have you had today,",
            "start": 4333.36
        },
        {
            "text": "That's so cool. The Crown Vic the dinosa. Look at that. Look at that. Look at those nice that marshmallow on that. They're the They're the uh thermos. We all know I love so much. Have you had today, Charlie? You want You want to look at him and be like, you don't have to be in the suit this early. Yeah. Like, no one's here right now. They got hired to do a job. They're going to do it. Holy crap. Look how good that looks. Oh my god, that's beautiful. Yeah. So in just like Andy would. I'm going to do the cinematic thing. Do the cinematic thing. Oh, he's doing the slow pan, guys. Charlie Chad, no one taught him how to do this. He just knows and this is this is instinctual. Yeah, look at it. Look at the dodge. Look at the dodge now. Maybe you're doing great, Nick. I'm sorry. I'm not laughing at you. I'm not laughing at you. You got to be prepared, Nick. Soon enough, this game will pop off. Oh, seriously? Oh, yeah. Why do you have a gun in this gun? It's not going to pop off. I thought it",
            "start": 4403.04
        },
        {
            "text": "at you. I'm not laughing at you. You got to be prepared, Nick. Soon enough, this game will pop off. Oh, seriously? Oh, yeah. Why do you have a gun in this gun? It's not going to pop off. I thought it was a slope game. Look at this old classic truck. We don't make that color anymore, Kevin. No, that's a What are we calling that? We calling that olive green. Oh, it's vomit green. How about How about home on the range green? Is that not vomit green? I'm serious. I don't think I don't think there's a green called vomit green. Yeah, there definitely is. I would say that's baby. That's baby poop green. Baby poop. You know how you get too many apples? I can actually tell you from firsthand it's not usually green. Maybe. Is it a little yellow? Uh really early like the first couple days. Wow. Like a pale yellow. He's got a baby now, though. Yeah, it's definitely the killer. Look at that. Oh, pretty. He done it. Imagine you think about these like Yeah, these like east coast. Yeah, I guess this",
            "start": 4469.88
        },
        {
            "text": "a pale yellow. He's got a baby now, though. Yeah, it's definitely the killer. Look at that. Oh, pretty. He done it. Imagine you think about these like Yeah, these like east coast. Yeah, I guess this is west coast. This is like northwest Pacific Northwest. This would be crab fishing. Okay, so this would be like Maine. Yeah. No, no. Well, that's northeast. This is like Oregon coast heading up to Alaska. You know what I mean? Like Yeah. You'd be you'd be out there king crab fishing. Well, we can tell by where the sun is at, right? Yeah. Right. This is Seattle. Let's go. Now, do you think you would do it? Like, you watch the deadliest catch and you're like, I could be that guy. No, it's very dangerous. I could be that guy. FBI. Welcome to Bright Falls. How did you know we're FBI? What a super sleuth you are. Oh, thanks, man. Actually, you're pretty cool. Oh, yeah. A little coffee for you. Thanks, man. Nice to meet you, Sheriff. I'm Is that the guy from X-Men? I think you know this guy. I",
            "start": 4510.08
        },
        {
            "text": "sleuth you are. Oh, thanks, man. Actually, you're pretty cool. Oh, yeah. A little coffee for you. Thanks, man. Nice to meet you, Sheriff. I'm Is that the guy from X-Men? I think you know this guy. I believe it's Sean A. Yeah. This is agent Alex Casey. Tim Brinker. And let me just say I'm happy you two are here. Frankly, we could use That is him. Yeah. Yeah. You know, he's a twin. Now, I don't know if you know Nick. On top of that, he was also in a previous game from Remedy called Quantum Break where they mixed the video game with a real life TV show that he started. Yes. Is that right? In between video game. In between the video game, you would have like a episode of like real TV. That's cool. That's actually pretty rad. Yeah, it was pretty cool. We've looked at the case files you sent over, sheriff. Have you had many people besides the known victims go missing? Sure, but it slowed down ever since Copper Lake was fenced off. Let me guess. Missing person cases spiked around 2010. The",
            "start": 4558.56
        },
        {
            "text": "sheriff. Have you had many people besides the known victims go missing? Sure, but it slowed down ever since Copper Lake was fenced off. Let me guess. Missing person cases spiked around 2010. The fence was built just after. Yeah, that's exactly right. This kid's nailing it. This guy could be a good guy. I think he's a good guy. We might be able to rely on this guy. I got to go to my mind palace real quick. Cases. I think you definitely make out with him though. Oh yeah. Wait, where are the Oh, the previous murders. Cases. Alex Casey. Good looking champbox out here. Can't be a coincidence. Can't be a coincidence. Message. Another message. Oh, a whole new case. It's the case or the Alex Casey case. Oh, I thought it meant cold case. Oh, man. I think that was the name of the um That's good. The TV show. Yeah. Really? Yeah. Wow. Don't act like you're annoyed with me, lady. Jesus. Why? How are we dragging this to the tippy top? We have the ceiling at this. doing it wrong. My house and like",
            "start": 4607.68
        },
        {
            "text": "TV show. Yeah. Really? Yeah. Wow. Don't act like you're annoyed with me, lady. Jesus. Why? How are we dragging this to the tippy top? We have the ceiling at this. doing it wrong. My house and like you didn't need to do any of this. Yeah, exactly. This is not that hard a case to keep was there. He was clearly killed there. Alex Casey was a lunch box. Don't worry about the That's not It's not pertinent to the case. Look at this though. Do you think this is cold case? Cold. Cold. Cold. Oh, and it's iced. Ice cold. Crystal clear. No prompt. How much are you selling a bag ice for? $3. Who else to protect? Three bucks. Okay. Eight. If it's the big bag. Eight. Man, where were you on the night of the murder? Exactly. What's she doing? Sweeping in the middle of the What are you sweeping? Sweeping the streets. You say hey. You say hey to me. What are you saying to me? What are you saying to me, lady? Talk to me. Talk to me. All right, let's go to the mic. How do we get so worked up all the",
            "start": 4665.28
        },
        {
            "text": "the streets. You say hey. You say hey to me. What are you saying to me? What are you saying to me, lady? Talk to me. Talk to me. All right, let's go to the mic. How do we get so worked up all the time? Huh? Interview the witnesses at the diner. Got it. Let's rock. Okay, we're getting in there. Well, I'd like to talk to you. Take care. Hello. I'd like to talk to you. Oh, that guy's definitely down to talk. Are you too You two look insane. Why are you wearing matching shirts? Couples do that. We might want to talk with them. Let's put them on our list. Put them on a list. I'm going to talk to whoever they let me talk to. Nobody. A lot of open seats. A lot of people could talk to. Are you the Bookers? No. Are these the ones that saw the guy? I'm agent Saga Anderson. Are you the Bookers? That's us. I'm T. Can I have some of your pie? Hello, officer. Just saw guys pine headed. So, are we being charged with anything? Because if not, we'd love to get back to our hotel and decompress after",
            "start": 4728.72
        },
        {
            "text": "us. I'm T. Can I have some of your pie? Hello, officer. Just saw guys pine headed. So, are we being charged with anything? Because if not, we'd love to get back to our hotel and decompress after what we saw. Take a bath, scream into anything. We're not charging you. I just have a few questions. I see they're turned on. That's a problem. It's going to be a problem for me. Saga. I think they're just smart. So, what did you see in the woods? This naked dude came out of the lake. Whoa. He was acting crazy, shouting weird [ __ ] at us. He must have found something. Unless skinny dipping at dawn is a thing around here. Then we heard shooting. Oh, they cut him up. We ran into these psychosoles and deer masks. They were tearing into knives. Oh. Some kind of satanic cult. And then we bolted and called the cops. Oh my god. These are the eyewitnesses here. Yeah. These are the flashlight guys. Yo, you know what you got to do? Tell them to run because they're next. Yeah, you guys. I'm like, you",
            "start": 4774.08
        },
        {
            "text": "called the cops. Oh my god. These are the eyewitnesses here. Yeah. These are the flashlight guys. Yo, you know what you got to do? Tell them to run because they're next. Yeah, you guys. I'm like, you need to leave town. Heads up. Heads up. Go back. You sure you're going to be next? Whatever place you came from, whatever. Seattle, Portland, doesn't matter. Go to a major city. Get out of this [ __ ] podunk town. Oh, and then we found her. The whole thing was terrifying. What did you find? That's all. Did you miss part of it? No, she just shot him up. What word late last night? I'm a writer. True crime. We're here from New York doing some research on a I knew I spotted people from a big the big apple. I was down at the lake getting some details. Perfectly legal. Did you say Alan Wakeakeman listening here? Alan Wakeakeman missing here. It's the name of the game, dude. This is crazy. Do we find him? Th This is There's a lot of mind. This might be a good game. This might be a good game.",
            "start": 4828.24
        },
        {
            "text": "listening here? Alan Wakeakeman missing here. It's the name of the game, dude. This is crazy. Do we find him? Th This is There's a lot of mind. This might be a good game. This might be a good game. Minus the mind palace. I'm not digging the mind pals at this time to be honest with you. You got to organize your thoughts somehow. Everyone can hold so much information. Now video games ask you to write in a journal like Greg Miller. And I blame I blame that on Greg. We do it. It's crazy. Greg Greg started this journaling thing where now every video game tells me to freaking journal. What are the vickers telling me? You know why? cuz he's like if I write a little bit it would be like not a waste of time. The cult wants it's like doing math. Yeah. Tammy Finder's keeper is Ed. My publisher will want this on the cover. Tammy found something. What did you find? Belonging to one of the cultists. How did she know that? How'd you know that? How the hell did you know that? How did you get into",
            "start": 4880.08
        },
        {
            "text": "want this on the cover. Tammy found something. What did you find? Belonging to one of the cultists. How did she know that? How'd you know that? How the hell did you know that? How did you get into their mind palace? You're in their mind palace. Did they give you consent for that? Was built to hide what's there. They say the rider of But we're jumping around a lot. She's divining stuff. I think she might be psychic. No trespassing. Sweet. My book has questions. Pass the bolt cutters. They broke in for the sake of Tammy's book. Nothing to do with a murder. They were telling the truth. Oh, then you got to ride these people. Yeah, dude. We got to get You got to be like, I went into my mind palace and I know you did it. You don't even understand how No evidence, though. Crazy my mind palace is. So, you found something there, right? A necklace these cultists may have dropped. Got him. Okay. Wow. How did you put that together? It's evidence. You need to hand it over. Give me it. It's",
            "start": 4919.04
        },
        {
            "text": "is. So, you found something there, right? A necklace these cultists may have dropped. Got him. Okay. Wow. How did you put that together? It's evidence. You need to hand it over. Give me it. It's obviously around her neck. Oh, okay. Oh, it's the tree drop necklace. So, triangles. Oh, we never seen triangles like that. There's three of them. Prove to be helpful. Do me a favor. Stick around town for now in case we have any more questions. You're going to die. Oh yeah, Rose. Oh god. Saga. Saga Anderson. As I live and breathe. Oh, it's Greg incarnate. As I live and breathe. I will never see you back here after that awful, awful thing happened to your baby girl. What the hell? Oh no. How are you? Um, I'm sorry. Who are you? I don't know what you're talking about. It's me, silly Rose. This is tripping me out. Yeah. Yep. This lady is crazy. Think I do. And what horrible thing happened to my baby girl? She drowned. Your daughter. That's so weird. You don't remember? How do you know I have a",
            "start": 4964.24
        },
        {
            "text": "tripping me out. Yeah. Yep. This lady is crazy. Think I do. And what horrible thing happened to my baby girl? She drowned. Your daughter. That's so weird. You don't remember? How do you know I have a daughter? Oh, I know what this is. You're blocking out your traumatic memories. Oh [ __ ] She's repressing them all the time. No. Jesus. Sane just calls. Folks, if you bump into someone and they're repressing something, leave it. Leave it alone. It's none of your business. Leave it alone. You got to understand Rosie only seems to save five people every day. Yeah. You got to remember Rose. Rose is looking for a friend. How many How many pieces of rhubarb pie can you eat before you go a little [ __ ] nuts? Hey. Hey, Saga. You down to eat some of this pie? Hey, Saga. How's your dead daughter? How about some pie? Eat the feelings away. Let's eat the feelings away. That was crazy. Go to the sheriff station. Okay, I got to go to the case board here. This video game might be good. This Well,",
            "start": 5024.4
        },
        {
            "text": "How about some pie? Eat the feelings away. Let's eat the feelings away. That was crazy. Go to the sheriff station. Okay, I got to go to the case board here. This video game might be good. This Well, this video game might be good. Y'all get ready. Script pages. Oh, I didn't look at these. Okay, so these are all just these, right? I got to go to the mine board. Where do the bookers go? The victims. The murder method. Maybe it goes here. I got to put this somewhere. I got to put you somewhere. Damn it. All right, it doesn't matter. Go to the sheriff station. All set. You put that information about your daughter somewhere, maybe. Yeah, I'm going to lock that back away in the that little blind box. Yeah. Yeah. Yeah. My daughter really drowned in this lake. I got a lead. Looks like we're cult. The cult of the tree. The murder cult. [ __ ] Have you? How did she know it was a cult of the tree? Tree, sheriff. Only the urban legend cuz that uh triangle thing. Yeah, she was listening a little",
            "start": 5080.0
        },
        {
            "text": "The cult of the tree. The murder cult. [ __ ] Have you? How did she know it was a cult of the tree? Tree, sheriff. Only the urban legend cuz that uh triangle thing. Yeah, she was listening a little bit more than you were. We're not going to find out you're the grand wizard or something, are we? Oh, see D and D back in the day. Wizard was always my favorite class. The cops are always in on the always in a small town like this. They're definitely in on the cold. They're going to eat your teeth. Yeah. Classic. We're going to eat your teeth. Yep. Like tic tacs. Like tic tacang. Helps move things through the anus over to the lake. Oh snap. Anus breaks up the blockages. I really like waitress from the diner. Rosie. Rosie. She's off her rocker. She's a bit of a space gase. Yeah, we let her work there because she likes to poison people's food. She keeps us busy on the ground. She even knew my name. It was all very weird. Rose has a talent for saying you think she's psychic. You might be. It's",
            "start": 5122.56
        },
        {
            "text": "because she likes to poison people's food. She keeps us busy on the ground. She even knew my name. It was all very weird. Rose has a talent for saying you think she's psychic. You might be. It's best not to take a person. It's probably just like Saga. Okay. She just wanted to accept it. I forgot Saka was psychic. Yeah. Hey, boss. Corpse is down. You think she'd be more accepting then? That's what I thought. In the morg. All prep. I'd like to take a closer look as soon as possible. Lead the way, sheriff. New map. New map. Oh, this is the bright fall sheriff's. Look at that. Look at that light come through those shutters. This is sick. We appreciate the support, sheriff. How are you? They got a lot of sheriffs in here. You got to have more than one. I mean, this is like I'm talking like teens. Well, this is like one Well, most small towns have one cop per person. Yeah. Oh, you got to have one. Like, I'm over here like, \"Oh, there's probably only four of them.\" No, there's like 15. They",
            "start": 5176.96
        },
        {
            "text": "Well, this is like one Well, most small towns have one cop per person. Yeah. Oh, you got to have one. Like, I'm over here like, \"Oh, there's probably only four of them.\" No, there's like 15. They must be paying well in this town. Just going to go in here and take this. The investigation is being taken over. It's like crab fishing, the diner, and then the cops. Those are who are hiring in this town. Exactly. I personally work in the diner. I come from a food service industry. You and Rose losing your marbles. Rose losing their marbles together. You only had a tour guide. Also, it's bear season. That's amazing. A bear. This guy's a good actor. Help. This rocks. Somebody called for a tour guide. Oh, wow. Koscala Brothers Adventure Tours, unforgettable tour experiences at affordable prices. That's right. I'm Neil Makoscala, voted best coffee roaster/our guide by Coffee World magazine, and I'm here to give you the tour of a lifetime. This guy rocks. He's a coffee roaster. The government",
            "start": 5227.12
        },
        {
            "text": "That's right. I'm Neil Makoscala, voted best coffee roaster/our guide by Coffee World magazine, and I'm here to give you the tour of a lifetime. This guy rocks. He's a coffee roaster. The government has seized and restricted access to many local nature attractions. That is true, young, many local attractions have recently become fed up by the government. And that's why I did rain slickers like the killer from I know what you did last summer. We say [ __ ] the government. We have both cutters. Oh well, you think of everything and we'll take you anywhere. Okay, I think we're calling those guys. Yeah, we're definitely I think we're going to get a hold of those guys. We're going to the brothers. What are the What are their names? The go the brothers. We're really deep on this. That's a long video. You got to commit to it. Let's you and I make a video like this. Okay, I'd like that. We have everything you need to do that. Let's make a video about this, but using your Twitch Prime here on",
            "start": 5286.96
        },
        {
            "text": "video. You got to commit to it. Let's you and I make a video like this. Okay, I'd like that. We have everything you need to do that. Let's make a video about this, but using your Twitch Prime here on twitch.tv/confunname. Great call out, Mike. Don't forget, if you got Amazon Prime, you got Twitch Prime. And each and every 30 days, you can help support the team here at Kind of Funny Games by keeping the lights and mics on with your Twitch Prime gaming sub. tourist and it appears that I'm lost in the woods. We don't need to watch that again, but we do need to go to the the the Costa Lost Brothers. Yeah, we got to call. We did walk past them. The other ones in the in the coffee outfits. These guys are not a party. They're in the coffee outfits. Yeah, that's I think those coffee brewer/adventurers just like, \"Oh, snap. We do love coffee and we love adventure.\" Now, who's paying attention? Chris Anka. Yeah, got him. Chris is right back at you. He's still Chris Anka somehow. Way more than",
            "start": 5342.48
        },
        {
            "text": "just like, \"Oh, snap. We do love coffee and we love adventure.\" Now, who's paying attention? Chris Anka. Yeah, got him. Chris is right back at you. He's still Chris Anka somehow. Way more than he should. The morg is underneath the police station. Yeah, that's where they all always are. No way. Yeah, I No, I think the morg might not. Okay. Something about morgs. They always cheer me up. I can't feel the same. You're weird, Dracula. That That's an odd choice to say. That's an odd thing to say. Yeah. Hi. What'd he say? Something about morgs always cheer me up. Okay. Oh, Kevin. Lit now. Water now. Now there's more light on it. Oh, we brought the guy back. Oh, it looks a little bear. Okay, get in front of it, Sam Lake. Get in front of it, Sam. Look right at it. You know that. What was the cause of death? I can't find Oh, jeez Louise. Oh, yeah. That is uh inside his chest. What they leave inside his chest? It was his heart. There's writing on here. What's it say? Oh, okay. We'll look at all",
            "start": 5381.36
        },
        {
            "text": "of death? I can't find Oh, jeez Louise. Oh, yeah. That is uh inside his chest. What they leave inside his chest? It was his heart. There's writing on here. What's it say? Oh, okay. We'll look at all the writing on his heart. Yeah, they they tattooed it. Got to write somewhere. matters that the body shows signs of being submerged in water postmortem. It doesn't add up. For small, this looks like text. A tattoo. Night and Gale didn't strike me as a tattoo guy. Defensive wounds. He put up a fight. Let's go to the case board, everyone. This is getting juicy here. Case board, everyone. This is getting juicy. Oh no, I [Music] won. Now I don't know what to do with these people. Evidence. Yeah, we got to talk about those guys. We got to make sure. I would prefer them to leave town, but they're going to stay here and they're probably going to die because of it. Time to see what Nightingale's body can tell us. Okay, let's look at some pictures. Let's see what's written on it. Oh, here. Let's go",
            "start": 5436.72
        },
        {
            "text": "to stay here and they're probably going to die because of it. Time to see what Nightingale's body can tell us. Okay, let's look at some pictures. Let's see what's written on it. Oh, here. Let's go to this. The bruises, defensive wounds. Okay. Seems like we're Oh, bloated and jointed. Long-term exposure to water. How long do you need to be in water for that? Like a long time. Depends on the bloating, I think. Smudge text under the skin. It say can't read it. Can't make it out. ritual writing maybe [Music] think allelible words. Okay. Text is smudged. Looks inverted. Heart must have been marked before removal. Heart can't what? Okay, we're good. Chest ripped open. There's definitely something in his chest. Let's get in there. Just leave it there. Let's swim. Go. You've been watching a lot of Grey's Anatomy. You should be good at this. I get, dude, I'll cut this dude open. What do you think you're going to find? Something wet. Well, he's uncircumcised. Don't look at it. So, we've",
            "start": 5497.52
        },
        {
            "text": "a lot of Grey's Anatomy. You should be good at this. I get, dude, I'll cut this dude open. What do you think you're going to find? Something wet. Well, he's uncircumcised. Don't look at it. So, we've discovered that you told me European. Maybe not religious. Oh, it's a piece of paper. That's gross. Oh, they're shoving paper inside of them. That is gross. Or do you think they were looking for it? I don't know. You think he hid it in his chest? Hide it somewhere. It's another S. It's another Alan Wake page. Night and Gale hunted Saga. Saga didn't see her. The Taken could not see into bright light. Light hurt them, made them Jared Leto. Wait, that was important. Night and Gale had no heart, but here he was killing. Someone's created a [ __ ] up fantasy about us. Hey, hold on. We found these kinds of pages. I didn't think they were relevant to this case. You found bloody pages and you didn't think they were relevant? Yeah. Well, he didn't say inside somebody. Oh, I guess they're not",
            "start": 5564.2
        },
        {
            "text": "kinds of pages. I didn't think they were relevant to this case. You found bloody pages and you didn't think they were relevant? Yeah. Well, he didn't say inside somebody. Oh, I guess they're not bloody. Oh, we have a whole book we have to read now. You would have thought like, oh man, like work for tonight. They're writing about this person named Saga. I just got introduced to you. Oh, snap. Oh, shoot. No, no, no. Wait. Did they take him? Sheriff, they took him to his mine palace. Oh, that guy's alive. That guy's alive. Run, run, run. Shoot him with the base. Oh, shoot. He's strong. You think it's the same guy or they using his body? I think it's puppetry of the penis. Oh my god. It's a thing, Mike. It's a real thing, Mike. What just happened here? And the important thing is I don't know, but this guy's killing everyone in the sheriff. Yeah. All those [ __ ] That's why they have extra cuz people all every once in a while in this town, people come back to life, kill everyone. You hear",
            "start": 5617.08
        },
        {
            "text": "but this guy's killing everyone in the sheriff. Yeah. All those [ __ ] That's why they have extra cuz people all every once in a while in this town, people come back to life, kill everyone. You hear that? Something can't the fallen bright immediately. Immediately. Jesus. [ __ ] [ __ ] He's coming. No weapon. I'll try my gun on this guy first. He was just inside with you. Just stick in the light. Try to stay in the light. Avoid being be being detected by enemies. Oh, that's the opposite of normal. Okay, you stay in the light. I can't see you. Hot. Oh, man. He's stomping. See me if I'm in the light. Oh my god. Oh god. He's right there. Go, go, go, go, go, go, go, go. Got to get it back. We're just going to follow him. Okay. Safe havens will restore some of your health. If you leave If you leave or attack from a safe haven while in combat, it will become temporal and available. Okay. Move now. Let's move now. Oh god. I'm away from witch. Get out of my house. No, everything's fine. Oh,",
            "start": 5681.84
        },
        {
            "text": "leave or attack from a safe haven while in combat, it will become temporal and available. Okay. Move now. Let's move now. Oh god. I'm away from witch. Get out of my house. No, everything's fine. Oh, bullets. Oh, they call me three shot saga. I just crushed that. You really did. Wow. Wow. Wa wa. I didn't think I'd be so in. Wo. I'm crazy in. Wa. So much to talk about. Oh, it's the intro for the Oh, we have to watch this. This is like the Bond intro. Live and let die. James Bond. Alan Wakeake. Alan Wake. Not asleep. He's awake. It's Alan Wake. He's not awake. If he was, he could clean up the leaves outside. His name's a misnomer. This guy's got a dong. A little turtleneck on his tongue. Just a little one. Just a little one. Made me so uncomfortable. A little here. Why do you keep talking about his doll? What's happening here? That was crazy. That was cool. That was really good. [Music] Ellen, he's awake. Should I Should I skip this? Oh, there's a face. Is it Saga's face? No, it's the",
            "start": 5754.8
        },
        {
            "text": "about his doll? What's happening here? That was crazy. That was cool. That was really good. [Music] Ellen, he's awake. Should I Should I skip this? Oh, there's a face. Is it Saga's face? No, it's the guy's face. Just skip it. We're not We don't need to be That's just part of the game. I don't want to be scared. I mean, this is a tone setter right here. The older 98 really wants to see this. This is when they do this, Mike. Like, this is real. Oh, yeah. Yeah, you be up on stage. This is like fantagram. Unfair that Nick never got to be a DJ. I feel good. Just wait until me and Nick go to Coachella. It's going to be crazy. Like we're too old to be DJs. You get 28. Oh, no button pressing needed. We just dance the whole time. Just sweat, lose electrolytes. Yeah, it's like everything's pre-recorded. Don't worry about it, people. We're here to party. Okay. It's a long song. It's a whole song, actually. Yeah, it's about three and a half minutes. We're going tohead skip that. It's an artistic",
            "start": 5842.0
        },
        {
            "text": "Don't worry about it, people. We're here to party. Okay. It's a long song. It's a whole song, actually. Yeah, it's about three and a half minutes. We're going tohead skip that. It's an artistic choice. You got to commit to it. Yeah. He didn't have a heart, but he still got up. The page predicted all of it. That was crazy. Help me fight him. That was nuts. Did that actually happen? Oh [ __ ] Yeah, it happens. That was crazy. What? Now we have a new case file. We got We got a whole new case on our hands. Did that one guy just teleport out? He's dead. We have a naked man running the streets. Find a way in would be difficult. A ritual. He's just over there getting coffee with the colloco brothers. Stop the monster. You can read your collect manuscript pages in the mine place. Okay, cool. No. Cool. Oh, there's a radio, too. Oh, that's the song that we just listened to. Follow you into the dark. Was one of their own FBI FBI special agent Robert Nightingale gone missing here 13 years ago. 13",
            "start": 5905.84
        },
        {
            "text": "Oh, there's a radio, too. Oh, that's the song that we just listened to. Follow you into the dark. Was one of their own FBI FBI special agent Robert Nightingale gone missing here 13 years ago. 13 years ago. Now he had suddenly turned up only to be murdered in a lot on the very day of their arrival. Okay. And then there was the page. This page. The first page that they had found, not the last. The first step down into terrifying depths. Secret truths trembling beyond the threshold. Reading the words. These words felt like a message. Like a message. Was a message. Was a message. Someone knew they were here. What they were doing. Seriously, someone playing a game with them. A Game of Thrones leading them on. An invitation. Game of Thrones. Look at that. Look how good that looks. Yeah, that's in game. You think the audacity of this? No, cuz they do the video. It cuts to a video, right? That's like real, right? They knew it would end up hurting them. Real cool. That is cool. Moon was a",
            "start": 5955.92
        },
        {
            "text": "in game. You think the audacity of this? No, cuz they do the video. It cuts to a video, right? That's like real, right? They knew it would end up hurting them. Real cool. That is cool. Moon was a mess. Like a bomb had gone off. Oh, look, Kevin. It's like the Millennium Falcon saga. Didn't see the little cockpit. Yeah, that's that's my mind palace. could not see into this millennium hurt the darkness in the What's your uh what's your mind palace ever? I'm sorry. Come again. Yeah. Yeah. The Millennium. You heard me. You heard me as well. I go there in my mind. You go there in my mind. Chewy's there. They got that cool chest. Nightingale had no heart in his chest, but here he was killing a monster. My god. lurged out of balance. This is crazy. The mirror. This guy's just out here in the streets now killing people. It's true. He's just wandering this. The trick is, Mike, you got to make it look like an accident. I don't think I don't think a naked man who has been water logged for about a",
            "start": 6004.72
        },
        {
            "text": "now killing people. It's true. He's just wandering this. The trick is, Mike, you got to make it look like an accident. I don't think I don't think a naked man who has been water logged for about a week and a half can make it look like an accident. Now, ah, you don't believe in yourself enough. Yeah. Look at this little bed pan. Folks, if you have that much blood in your urine, you got to figure something out. You have bladder infection. Tell you what, that's you. You did something wrong. Bladder infection. Infection on the bladder. I'd love to blame this on mass hallucination caused by inhaling volcanic gas, but we both know that's [ __ ] This was supernatural. Well, I'm glad you were the one to say it. Now we can figure out a way forward. Right before things got crazy, Sheriff Breaker just vanished. Maybe the sheriff knew more than he was letting on. He seemed anxious, like he dreaded what was coming. One more mystery. The victim of a ritualistic murder turns into a monster. Is there",
            "start": 6059.12
        },
        {
            "text": "vanished. Maybe the sheriff knew more than he was letting on. He seemed anxious, like he dreaded what was coming. One more mystery. The victim of a ritualistic murder turns into a monster. Is there a connection? Looks to me like the cult of the tree is performing rituals to create monsters. Wow. Maybe. Wa. We need to start learning goal. Their purpose. The ex-presidents are servers. Whoa. Right back into the mine palace frames. Yeah, we got now we got the night skeleton. Monster light as a way to fight him. Pages predicting the future. There's no rational explanation. This is the case we must solve. Let's look at our new pages for later. Nope, for [Laughter] now. Saga had to pursue night and gill in. Okay, saga back at the Congen lake. Oh yeah, he's definitely going back for the lake. Yeah, he's going back on his lake. That's home base. Got to beat his ass there. Oh wait, he just ran away. Oh yeah, he did. Oh yeah, but it was but Kevin, it sounded like when you're you have wet feet on",
            "start": 6108.8
        },
        {
            "text": "he's going back on his lake. That's home base. Got to beat his ass there. Oh wait, he just ran away. Oh yeah, he did. Oh yeah, but it was but Kevin, it sounded like when you're you have wet feet on top. We need to head over there. Reminds me of your brother before anyone else gets hurt so much. My brother needs to go as Baron Harkining for Halloween. Coming out of coming out of the uh Oh, remember when he got up on the ceiling and he's just like what happened? He's like the bodies. Sheriff Breaker. Nightingale turned into some sort of a monster and there are offices down. You two handle things here. We need to get back to Cauldron. Okay, we'll just handle this. Those people act as if nothing happened. Well, she isn't finished. We'll do what we can, man. These guys are clearly the killers. I told you it's these two idiots. Yeah, those guys are definitely working. So easy to spot. Yeah, I could write Al. I could be Alan Wake. I'll get you a typewriter. You just keep typing away. These",
            "start": 6183.36
        },
        {
            "text": "I told you it's these two idiots. Yeah, those guys are definitely working. So easy to spot. Yeah, I could write Al. I could be Alan Wake. I'll get you a typewriter. You just keep typing away. These guys are the sheriffs of the year if they're not the killers. I tell you what, we just walked out of this room. Only witnesses to a massacre. They're like, \"Yeah, go ahead and take do the thing. Do the thing.\" That's all crazy talk. Monsters are That's You going to unlock the door for us, boys? You hear that [ __ ] I got to get the keys. Oh, never mind. Oh, okay. That's not a room we can go in. Yeah, we got to come back in here for the files. Oh, they got stuff in here. They got stuff in here. You think that you'd be able to be like, \"Hey, I need bolt cutters or just give me the key to this room.\" Yeah. You'd think that'd be helpful, man. Look at that. Stunning. Take a second. Look at that refraction off at the door. Just sitting at 179 frames as well. Just cooking right now. So many",
            "start": 6229.6
        },
        {
            "text": "room.\" Yeah. You'd think that'd be helpful, man. Look at that. Stunning. Take a second. Look at that refraction off at the door. Just sitting at 179 frames as well. Just cooking right now. So many frames. All thanks to our sponsor for today, Nvidia, showing off DLSS4. Getting the very best of our gaming experience. Thanks to the GeForce RTX 5090, DLSS4 is being optimized and used in over 700 games and apps right now. Can you call in, Casey? Smart choice, Anderson. So, this guy just he teleported away. He didn't even come through the streets. We need backup. Falls case. Whoever you can spare ASAP for a little walk down this [ __ ] Find night andale at the lake. The pages haven't been rung yet. We can't assume the person. He's a sidewalk guy. Yeah, I was like, uh, traffic going here, but might as well go by the letter of the law, bud. We don't want to get a ticket in this town. There's 400 sheriffs that work here. Well, actually, technically two fewer. Yeah, they're dead. They're dead",
            "start": 6273.2
        },
        {
            "text": "as well go by the letter of the law, bud. We don't want to get a ticket in this town. There's 400 sheriffs that work here. Well, actually, technically two fewer. Yeah, they're dead. They're dead now. They are gunsu. Technically too fewer. out. Two less actually, I think. Right. Yeah. I wasn't making fun of You might want to find those those witnesses and tell them to start running. No, I don't care about them. They're New Yorkers. They're big city kids. Yeah, they're big city people. They're big city kids. Nightingale was here 13 years ago. Oh, he's been holding stuff back. A writer. Oh, wake. Tammy mentioned him. She's writing a book on his disappearance. You know the detective character from his books, Alex Casey? Yeah, I've heard the jokes at the office. Cold case Casey. Oh, murder case Casey. Sorry, that's cool. What? The same name, similar job. Cold. Thinks of it. Annoyed me, but I want to be called Cold Cuts. That's what we call you, Mike. Cold cuts. You know what I've been",
            "start": 6337.84
        },
        {
            "text": "case Casey. Sorry, that's cool. What? The same name, similar job. Cold. Thinks of it. Annoyed me, but I want to be called Cold Cuts. That's what we call you, Mike. Cold cuts. You know what I've been having lately? What's that? Some white bread, cheddar cheese. Okay. Couple slices of turkey. Call it good. Okay. I love it. Love it. Just basic. Having them late at night. Late at night. That's uh that's good for you. It's good for your sleep. Just make just stack sandwiches up while you're watching while you're watching Into the Spiderverse on TikTok in 500 chunks. It's been It's been uh Minecraft. You've played a lot of Minecraft. Oh, the Minecraft movie. Minecraft movies. I always die cuz I heard it's terrible. Uh, you know what? It's made me laugh. It's made me laugh. You thought this case might be connected to him. His name does keep popping up. I just wanted you to have all the Oh, it's getting dark. Next time, given we find ourselves in the middle of a horror story. Oh, never mind.",
            "start": 6385.04
        },
        {
            "text": "might be connected to him. His name does keep popping up. I just wanted you to have all the Oh, it's getting dark. Next time, given we find ourselves in the middle of a horror story. Oh, never mind. It's uh morning. Oh, white van. White van is never good. This is definitely the van's van, right? No windows, so they can't see the body. The heart. Oh, okay. Okay. The page says Nightingale is in something called overlap. Need to figure out exactly what that means. Alien rides. So, sandwich. Yeah, nighttime sandwich. No mayo, you said though. No, but the way Mike described it, Kevin, is he was like, \"You know what I like to do? I like to take take a couple pieces of turkey, couple pieces of cheese, maybe a couple pieces of bread, and then I eat it at night.\" Well, if you put it together, it is in fact the same way. But in my brain, I legitimately thought he was eating the turkey first, then the cheese, then two slices of bread. I'm not entirely sure that's not the way he's eating it. It's",
            "start": 6442.08
        },
        {
            "text": "in fact the same way. But in my brain, I legitimately thought he was eating the turkey first, then the cheese, then two slices of bread. I'm not entirely sure that's not the way he's eating it. It's We'd have to verify, Mike. I love it. Shout out to Olive Party who writes in says, \"What do I order from spices?\" Uh, well, I like the orange chicken and white rice. Andy Cortez, I believe, likes [Music] General General Zho. Yeah, that's it. Um, beef, I believe, is what he gets. And then pages knows what will happen. Kevin Aex usually gets um or because they can see what's coming. The noodles. Possible things are happen. No one's getting the Kungpow chicken. I get the Kungpow chicken. Kungpow chicken for you. It's a Sichuan peppercorn, so it's got a little bit of a tingle in your mouth. If you see an old lady, you just tell her Snow White Mike says hi. She won't know, but she'll know. She'll know. You know what? Send her a video of Snow Whiteag Mike talking about her. Yes. Hey, if you get",
            "start": 6501.12
        },
        {
            "text": "see an old lady, you just tell her Snow White Mike says hi. She won't know, but she'll know. She'll know. You know what? Send her a video of Snow Whiteag Mike talking about her. Yes. Hey, if you get her, I'll FaceTime her. Andy Cortez gets Mongolian beef. Thank you, Chris. Refers to themselves as a cult. In my experience, they don't. We're not seeing the full picture yet. Mike, scoot a little to your left. I want to talk to these guys. Hey, buddy. Perfect. Hello, friend. How are you folks doing? I'm good, sir. How are you? Oh, it's our guys. Saga Anderson, are you two supposed to be here? It's a good name, Saga. I'm Makoscala. Fantastic to meet you. Hey, man. Great to meet you, too, my buddy. Steven here hired me to show him through the woods. He's in town on important government business fixing this impressive piece of hardware. I work for the FBC, ma'am. I'm authorized to be here and I bet you two are here about that murder. Nasty stuff. FB. We're not sure it's not a murder, sir.",
            "start": 6549.28
        },
        {
            "text": "fixing this impressive piece of hardware. I work for the FBC, ma'am. I'm authorized to be here and I bet you two are here about that murder. Nasty stuff. FB. We're not sure it's not a murder, sir. Cuz this guy's a demon that just killed This man is a demon now. We're not sure what the hell's going on. We think it might be the ratchet straps. Help us. Definitely the ratchet straps. Things brothers are kind of a household name around here. Speaking of, uh, if you're looking for some fun, stop by Watery. Just down the road from Bright Falls. There's our amusement park. There's that sounds horrible. And we offer a variety of guided tours, hunting, fishing, hiking, whatever strikes your fancy. You name it, we probably got it. Okay. I'm sure all of that's great. Thank you. Do you think they make a living off of that? Yeah, definitely. But I also think that they're not very good at any of those things. I love that. But why do you think they're doing the side job if they making a living off",
            "start": 6597.28
        },
        {
            "text": "a living off of that? Yeah, definitely. But I also think that they're not very good at any of those things. I love that. But why do you think they're doing the side job if they making a living off the first thing? I think they just have a lot and people go, \"That wasn't that great, but there's nothing else to do in this town.\" Now, a fun one. That guy's from the FBC. I believe that is something of the connected Oh, like control. Yes. I think that's a little little start of the hint of the shared universe. You're like, what the hell is this station? What's this do? Look at this. It's going to this weird bulb thing. Oh, that looks cool. That looks like has to warm up a little bit. Yeah, it's got, you know, this. Look at that. Look at the glare off these monitors. Look at that. That's nice. That looks good. Look at that. That's sick. So wasted on you is us. Let's talk more about that dude's shance. Yep. There it is. All right, let's let's see his doodle again. I tell you what, the",
            "start": 6646.16
        },
        {
            "text": "nice. That looks good. Look at that. That's sick. So wasted on you is us. Let's talk more about that dude's shance. Yep. There it is. All right, let's let's see his doodle again. I tell you what, the lighting in this scene is gorgeous. Mhm. Gorgeous. Yeah. What are we calling this? The golden hour right before it sunsets. Yeah. This would be magic hour. Yes. Golden hour, I think, is the rise of the sun. Magic hour is the Oh, really? across the horizon. But one thing feels really off breakers. This is when we need the wer. Don't interrupt me. Oh, don't I haven't I haven't seen the latest. No, no, no. You've already seen the wer. Yeah. Yeah. Yeah. You've already seen it. Um I like Baron Holds is a god of a human being or was a whole week behind them like that. Look at this little fog. I don't know. Not the kind of disappear. Okay. What do you think this table smells like with all this dried blood on there? Our crime scene copper. Never mind. Metal. that. Yeah. Yeah. Irony kind of. Are",
            "start": 6686.64
        },
        {
            "text": "know. Not the kind of disappear. Okay. What do you think this table smells like with all this dried blood on there? Our crime scene copper. Never mind. Metal. that. Yeah. Yeah. Irony kind of. Are those bullet casings? Did you see that? On the table or crazy in an overlap. So, how do we follow him? No. Oh, they're leaves. They're leaves. I was looking away. A little distracted. Okay, so we got to find our way. Maybe the Kokalof brother can tell us how to get to the lake. He tourists for money, not for just fun. Oh, we found him. I'll see where these footprints lead. Sounds good. You stay back there, friend. I don't like the night and gale is just loose. Oh, he's loose. Loose. Loose. Radio. He's Baron Hearkening. Loose. That's a great movie. It is a great What a What a great time to be alive with those movies right now. Movies. Yeah, those movies rock. All I've ever wanted. My life is so good. Jason Mimoa was in it. Batista's in it. Duncan Idaho. Guy named Duncan Idaho is in it. No, no,",
            "start": 6735.12
        },
        {
            "text": "with those movies right now. Movies. Yeah, those movies rock. All I've ever wanted. My life is so good. Jason Mimoa was in it. Batista's in it. Duncan Idaho. Guy named Duncan Idaho is in it. No, no, that's Jason Mamoa. Oh, okay. That's a cool name. An old timey name in their world. Oh, we found more. Yes, we found more of these. Oh, another cold case to hold my cold cuts. My fragments so I can upgrade my gun. Let me tell you about my sandwiches. Okay. Put a little mayo in there next time, you know. Yeah, Mike. Tomato mayo. I put mayo tomato. My favorite sandwich is turkey provolone cheese or yeah a white a white cheese if white cheese crazy a Swiss uh no I don't like Swiss and the cheese I like to eat the Swiss normal and then uh mayonnaise and tomato that's it sliced what kind of turkey do you like the honey roasted no I like the normal like deli turkey like the fresh cut ones they slice maybe pepper the pepper turkey okay a little yeah a little black pepper turkey on that delicious",
            "start": 6790.08
        },
        {
            "text": "do you like the honey roasted no I like the normal like deli turkey like the fresh cut ones they slice maybe pepper the pepper turkey okay a little yeah a little black pepper turkey on that delicious it's just delicious I'm a big fan of the uh bors head meat you know that fresh stuff that They give you Oh, watch out. We like it. But I like honey. I like honey roasted. You got to have honey roasted. Might even slap in a couple of chips inside of it, too, just for fun. Tell me about it. Put a couple of chips inside of this thing. What kind of chips? Uh, salt and vinegar Lays. I love them. Cheese ruffles. Cheese ruffles isn't a bad idea. Baked cheese. Queso Ruffles. I didn't even know they had queso. Me, too. And it's real good. That's the the chip that you can't stop eating. It's like not Is turkey just like the easiest go-to cold cut? It's a great source of protein. Just easy. Going to go to my wheels here. Follow night and trail. Well, I've already I've already screwed that up. We've",
            "start": 6845.84
        },
        {
            "text": "turkey just like the easiest go-to cold cut? It's a great source of protein. Just easy. Going to go to my wheels here. Follow night and trail. Well, I've already I've already screwed that up. We've lost the trail. This is why we The trail has gone cold. talked a lot out of nowhere quickly in the woods. I would get so lost so fast, man. Campers just leave their [ __ ] everywhere. Yeah, this town doesn't really respect the pack it in, pack it out mentality of camping. I like that you always know the right phrasing of that. Yeah, man. Smokey the Bear would not be pleased with us. Also, what's up with all this waterproof paper they got here? Like you said, that's a lot. That can't be good. A lot of waterproof paper. I mean, no. I guess you want it to break down. Probably. Unless it's plastic and it stays in your testies. Jesus Christ. That's what they say about my water bottles are doing to me. Yeah. Not good for you. Do you think that they're making them bigger, though? No. The testies.",
            "start": 6895.52
        },
        {
            "text": "and it stays in your testies. Jesus Christ. That's what they say about my water bottles are doing to me. Yeah. Not good for you. Do you think that they're making them bigger, though? No. The testies. Oh, no. They're definitely Hold on a second. Hold on a second. Hold on a second. Mike, just to be clear. No, they're not making your testicles bigger. Oh, damn. I thought it could have been a positive. Yeah, but it makes it more impervious to like impact though because there's more rubber up. Oh, in case somebody gives me the uppercut. Watch out. All right, I'm going to start at the I'm going to start at the beginning of these tracks and see what happens. I got to go back to the general store and you guys, we need to find We're going back to the general store. That's where the track started. Okay, this general store. Okay. Okay. This is the murder. Oh, man. It quickly went to night time. Yeah. Yeah. This is Oh, I don't think I've ever been inside the general store. This isn't where the",
            "start": 6949.36
        },
        {
            "text": "Okay, this general store. Okay. Okay. This is the murder. Oh, man. It quickly went to night time. Yeah. Yeah. This is Oh, I don't think I've ever been inside the general store. This isn't where the signs were. No, this is open now. Look at the cards, I guess. I don't think this is a good idea. Well, I got more pictures. There's one picture there. Mike, back me up. This is wrong. Right. Did you know this entire I don't like scary games. I'm uncomfortable the entire time. This whole mountain used to be an active volcano. Imagine the force it took to carve this crater out of the earth. Yeah, it's magnitude. There is a pretty rare, so be sure to take it in. Magneton. We're standing in the gaping m of hell. You got the gaping m. That's crazy. I used to love geology when I was in school. Thanks. I helped Logan build a great baking soda volcano for her science fair. Like that's cool. Who's Logan? Her daughter. Her daughter who may be deadity. I think I think she might be might be dead. You",
            "start": 6990.8
        },
        {
            "text": "I helped Logan build a great baking soda volcano for her science fair. Like that's cool. Who's Logan? Her daughter. Her daughter who may be deadity. I think I think she might be might be dead. You don't want You don't know about that. That's right. Mike, do we have general stores like this up in the mountains where you can just do laundry and hang out? Uh, yeah. Yeah. Yeah. Now, this is when you're getting really out there. This is like you would find this at Yoseite. Any national park that would be off the grid here or do you find No, no. Yeah. Yeah. Yeah. Susan would be here. Susan would be here. So, you she you come in, you kind of hang out. Susan and her husband Lou would be working here over the summer. They'd be like, \"Ah, Veil Resorts isn't paying us that much, but we love being here outside, you know.\" Yep. And yeah, you find this out in Yoseite. Probably Grand Tetons. Great word, Tetons. I love the Tetons. They're really nice. Yeah, they're nice. Big big. Huge. Huge. Huge.",
            "start": 7037.6
        },
        {
            "text": "here outside, you know.\" Yep. And yeah, you find this out in Yoseite. Probably Grand Tetons. Great word, Tetons. I love the Tetons. They're really nice. Yeah, they're nice. Big big. Huge. Huge. Huge. All right, so we're back at where the trail started. Let's find this. Let's look at this again. There we are. Okay, so here we are. And it goes cold right here. Okay. Oh, there they go. Yeah, there we go. Now we're on it. We stay on it. We had to concentrate a little bit. Look at you, Nikki. You think No. Yeah, but the last time they had like a cool logo inside of him, so I get it. I get it. It got so dark here. He's also like pointing straight down, so anything could just jump out and kill us. No, that's good. That's That way you can't jump out and can't be sneaked up on hurt us. Nick can't be sneaked up on this way. You tell him. Okay. Well, the music picked up. Yeah. Well, it's cuz the tracks are starting to go cold. Usually a good sign. We're good. I'm going the right way. He's going",
            "start": 7080.0
        },
        {
            "text": "be sneaked up on this way. You tell him. Okay. Well, the music picked up. Yeah. Well, it's cuz the tracks are starting to go cold. Usually a good sign. We're good. I'm going the right way. He's going back to the water. He's going to go in. The lake calls him. He could pull the map up. Cauldron. This place is a labyrinth. Remember movie labyrinth? I watch it every day. Into the water. Oh, here we go. Here. And we're into the water. We got to go. Definitely. Oh [ __ ] [ __ ] [ __ ] Christ. Jesus. I like the delay. God bless that delay. Nightingale isn't. That got you. That one hurt. He's in there for sure. Around Cauldron Lake. Wait, you think he's in our mine palace? No, he's in the lake. Okay. And the I just wanted to make sure that it [ __ ] up. He was in my mind palace. This is a safe place. Next stop, right, Mike? Calara Street station. You should always lock your mind palace up real tight. Night and seen those people, which is just locking up my mind palace. You got to give me a",
            "start": 7133.76
        },
        {
            "text": "place. Next stop, right, Mike? Calara Street station. You should always lock your mind palace up real tight. Night and seen those people, which is just locking up my mind palace. You got to give me a little more than that. You got to go. I want to be with you. Michael, we're not there. Palace palace. got locked up with a pal. Sorry. Go ahead. So, what what are these people doing? What are they doing, Mike? No, they're just locking it up. They're locking it up tight. They're locking it up tight. Oh, this is one of those leave a book take a book stations. Oh, yes. Nerds. This time, just leave a ammo. Grab an ammo. Yeah, it is. Makes sense to me. I'm sure this guy's going to jump out of the water. No, of course not. It's not this kind of game. Well, you got a flashlight, right? You're good with a flashlight. I'd be singing, you know. Yeah. Sing to yourself a little. Let him know you're coming. Let him know exactly where you are at. Yes. At all times. So he can eat your face when you're",
            "start": 7199.12
        },
        {
            "text": "with a flashlight. I'd be singing, you know. Yeah. Sing to yourself a little. Let him know you're coming. Let him know exactly where you are at. Yes. At all times. So he can eat your face when you're not looking. I don't think he's malicious. He killed two cops and tried to hunt. Yeah. We don't like cops. Ladle. I already saw this thing. Oh, it must be flooded down here. It is flooded. Oh, you can put your face in. Oh, she's missing her heart. She's missing her heart. Damn it, Kevin. Nick, she's missing her heart. There's no mystery in Cauldron Lake being named after his call in shape. And yet there are mysteries stories about the lake in being a gloomy doorway in underworld or of a witches of of a witch whose cauldron the lake really was. That's crazy. Hard to scroll up this. The the legend tells that when uh the affections of a local sheriff went unanswered, he accused the lady in question of having bewitched him. She was drowned, but her drowned ladle grew into a strange tree named",
            "start": 7253.04
        },
        {
            "text": "tells that when uh the affections of a local sheriff went unanswered, he accused the lady in question of having bewitched him. She was drowned, but her drowned ladle grew into a strange tree named witch's ladle. The woman returned uh to avenge her wrongdoers. If she was not a witch before she was, she was one now. She killed the sheriff drowning him in the lake. Then she took out his heart and locked in a box. With a heart, she would summon him for the lake to exact revenge on her behalf. Or so the legend goes. It's kind of hot. I've been locked in. I'll tell you one thing right now, ladies. If you're out there and a guy doesn't return your affections, cut his heart out. Cut his heart out. God, I'm looking for a girl to do that. Oh, I don't like that. No, that's that's probably that's a fire. I don't like that. No, it's swamp gas. What is that? That's swamp gas. Yeah, it's just got to let it out. It's got to breathe it out. No, no, don't breathe it in. These aren't the same tracks",
            "start": 7295.28
        },
        {
            "text": "a fire. I don't like that. No, it's swamp gas. What is that? That's swamp gas. Yeah, it's just got to let it out. It's got to breathe it out. No, no, don't breathe it in. These aren't the same tracks that were here before. They're headed into the tree, not out of it. You can toggle flashlight boost to increase damage to darkness and burn through uh the substance. Whoa. My flashlight burned the dark stuff away. Yeah, it did. It was covering another page. Now I'm going to place I thought I was going to do the Jedi survivor. Load next level. Oh yes. Load the next level. Everybody's like get through here. There's so many shimmy shakes. Shimmy shimmy. The witches. Why are they always shimmy shaking through rocks? The hell are you guys? Pages to lead to the overlap. Okay. Pages are going to lead to the overlap. Everyone, you think the overlap's good? No. I think the overlap is where things go to eat your brain. Yeah. Yeah. You do not want to be in the overlap. The overlap's not the vibe",
            "start": 7337.12
        },
        {
            "text": "lead to the overlap. Everyone, you think the overlap's good? No. I think the overlap is where things go to eat your brain. Yeah. Yeah. You do not want to be in the overlap. The overlap's not the vibe you're looking for on like a Monday night. Yeah, but like if you get lost in the flap, that's like getting lost in the alternate dimension. You know what I mean? Where you just do push-ups all day? Lost in this. You think that's what you're doing if you're getting stuck in an alternate dimension? Oh, push-ups all day. Just hoping that I get out of it. If I go in there with the rope and I pull you out, are you just swole afterwards? I'm so swole that you're like, \"Mike, I don't know if I can pull you.\" And I'm like, \"Nick, I've been trapped here for years. Nick, I weigh 250 of solid muscle. I'm geared up. I haven't had a sandwich in months. Please make me a turkey sandwich, but break all the parts apart so I have to eat them individually. Yeah. Trying your hardest. God bless you. God bless",
            "start": 7387.76
        },
        {
            "text": "geared up. I haven't had a sandwich in months. Please make me a turkey sandwich, but break all the parts apart so I have to eat them individually. Yeah. Trying your hardest. God bless you. God bless you, baby Jesus. I'm going to go to my mind palace real quick. Yeah, go to my mouse. Locate the witch's hut. Oh, I've been to the witch's hut. We've been to the witch's hut. Have we been to the witch's hat? Upstairs. Have you not been to the witch's hut? I don't remember the witch's hut. Mike, we've been to the witch hut twice. It's back this way. Okay. I love that. Look at you navigating this map so well, bro. I'm impressed. Look how slick everything looks. A lot. You're doing great, Nick. I'm proud of you. I can do this with my brain or with his balls. That means feelings. Here we go. We're going back up the path. Not sexual. Way to get out of the lake without dying. That's good. Thanks, man. That's not good. What's that? The things are just slowly rolling down the hill at you. No, it's",
            "start": 7423.12
        },
        {
            "text": "going back up the path. Not sexual. Way to get out of the lake without dying. That's good. Thanks, man. That's not good. What's that? The things are just slowly rolling down the hill at you. No, it's Look at that. I found the witch hut in 5 seconds. Oh, you did really well. Oh, I remember the witch's hut. Yeah, now you do. That was the door that slammed in front of us. Following up on a lead. Keep checking in. Roger. The page described the hut being lit and mentioned a fuse. Get the lights working in the witch's hut. Lighten up. Light it up. Light it up. Light it up. Hit them lights. So light it up. Remember that was used on every single NBA playoff commercial known to man back then. Dude, can we get Andy in here? Is Andy still around? I think I hear him talking. I'm going to ask him if he remembers that. What do you expect him to say? Yeah, 100% he remembers it. The fuse box is missing a fuse. It's missing a fuse. Locate the fuse in the immediate area. Turn on the lights. I like they",
            "start": 7474.48
        },
        {
            "text": "remembers that. What do you expect him to say? Yeah, 100% he remembers it. The fuse box is missing a fuse. It's missing a fuse. Locate the fuse in the immediate area. Turn on the lights. I like they say in the immediate area so my dumbass doesn't run around everywhere. Wait, I think I have a fuse, don't I? Oh, how do I get into my mine's inventory. Okay, it's got to be inside. Let's look inside first. Call Andy really quick. Be prep. Oh, did he leave? Yeah, he left. I'm so sorry. Well, I'm going to call him just to make him part of it. You know what I mean? He lo he hates this. He wants to be you know he had other commitments. His mind pals was calling me Andy. It's Mike, Nick, and Kevin and the live stream here on twitch.tv/count funnyames. How are you? I'm doing great. How are you Andy? We were just singing a song. I just want you to see if you remember. Fallout Boy took over the NBA playoffs intro music a couple years back with the that light. I'm up up up. Oh, you're on fire. Just",
            "start": 7531.36
        },
        {
            "text": "We were just singing a song. I just want you to see if you remember. Fallout Boy took over the NBA playoffs intro music a couple years back with the that light. I'm up up up. Oh, you're on fire. Just seeing if you remember that. You nailed that. You remember that? Can Can you give me another song that was used in like generic playoffs music times? I'm Yep. I remember that one. That's great. Andy, I got one more for you before you go. High hopes. You got to have high hope for a living. Remember that one? It's like we're there. Panic at the disco, dude. Love you, bro. See you later. Did you know it's panic of the disco? I did not know that. Panic at the disco. I can't ever tell when Nick's like had enough of our shenanigans. No, no. I love it all. I just I I was like looking for the fuse cuz I found a fuse, but it wasn't the fuse. You hate to see it. And I'm looking for these cool Oh, look at these Easter eggs. It's weird. Oh [ __ ] Allan is watching over us, everyone. Allan. Alan.",
            "start": 7580.0
        },
        {
            "text": "cuz I found a fuse, but it wasn't the fuse. You hate to see it. And I'm looking for these cool Oh, look at these Easter eggs. It's weird. Oh [ __ ] Allan is watching over us, everyone. Allan. Alan. Alan. Alan. Do you think he'll be in the next movie? Uh, you think I'm bringing back one more time? Sam Neil. Yeah. I don't think so. With Scarjo? I don't think he's Maybe he gets a photo. Maybe. He's like, that's my dad, Alex. How about the one guy who created Jurassic Park? Does he get a call back? You mean Michael Kryton? Yeah. Is that the guy with the white beard? John H. Probably someone will say he's got to have a He's got to have a call. Talk to him about it or whatever. Oh. Oh, break room is a place where you can save your progress. It's got a very weird like bing to it that doesn't match the tone of this video game. Bing. Bong. Yeah. Bing bong. It's like it's it's safe and nice. Well, this is easy. It's church. Got another p. Look at they got little pastries. Yeah, little pastries.",
            "start": 7638.08
        },
        {
            "text": "the tone of this video game. Bing. Bong. Yeah. Bing bong. It's like it's it's safe and nice. Well, this is easy. It's church. Got another p. Look at they got little pastries. Yeah, little pastries. Fun. Little coffee. Little P Mike on a cold day and you get back to the lunch. We got a little pri little coffee. Little dirty snowman. What's a dirty Oh Jesus. What's a dirty snowman? Dirty snowman's a little alcoholic beverage right there at the bar. Little little hot cocoa. Vanilla vodka. Line on the heart. Kalúa. Mix it up. A little bit of that. I brought you the heart. Amen, sister. All right. Show me the terror. Show me the terror. Through the hole in the sign. Saga pushed the heart through a hole in the side. Oh [ __ ] Remember the the lady? Oh [ __ ] Yeah. Remember the You got to push back in the She was in the lake. She was in the lake. She found Junk in the forest. Stepped inside the witch's hut. Something rushed through her. What is it? Familiar. She couldn't quite place it.",
            "start": 7691.28
        },
        {
            "text": "back in the She was in the lake. She was in the lake. She found Junk in the forest. Stepped inside the witch's hut. Something rushed through her. What is it? Familiar. She couldn't quite place it. Something. This game's a trip. Long forgotten. She tried to hold on to it, but it was it was already gone. Inside a bright light. Bright light. Big. He's reading it to us like nothing could hurt. But I might say it with him. Saga asinity. You nailed that. Pulled them from the darkness. A shift in reality. Dual Millennium Falcon cockpits. A coffee thermos. A shoe box. A mop and a bucket. It's like an owl's eye on the wall. And in the cabinet, another manuscript page. So cool. Witch's ladle. Towering over Saga. Watching her and the witch, the image of the witch in the sign. Night andale's heart, a cold, dead lump in her hand, lump in her hand. Her definition of sanity had changed since she arrived in this town. But she trusted the was forced to. Saga addressed the witch. I saw you looking at",
            "start": 7740.16
        },
        {
            "text": "a cold, dead lump in her hand, lump in her hand. Her definition of sanity had changed since she arrived in this town. But she trusted the was forced to. Saga addressed the witch. I saw you looking at him. Who's he looking at? He's looking at you. Why? Because I was reading. I was looking back in I'm giving this guy some background. Yeah, a little background. The words she had readage page. I brought you the heart, witch. Show me the terror. Show me the terror. Saga pushed the heart through the hole in the sign. This was the key. The tree was the threshold. Okay, I got to push the heart in the hole in the sign. Do you think we're just walking with the heart? Where do I get the heart from? We got to go back to We got to go back to the freaking morg. I would assume so, right? That's something you carry in your trunk, right? Yeah, I got the heart in my hand. All right. Well, I guess I'll go back. Go down to the lake. Back. I got to go to the lake, but I don't have the heart. What? Well,",
            "start": 7794.96
        },
        {
            "text": "you carry in your trunk, right? Yeah, I got the heart in my hand. All right. Well, I guess I'll go back. Go down to the lake. Back. I got to go to the lake, but I don't have the heart. What? Well, that's where the heart is. The heart's in the lake. Oh, no. That's where the witch's heart thing is. The whole thing is what I got. What am I asking? What do I got to put the heart? Where does he find the heart? Yeah, we don't know what the heart I don't know what the heart is. I don't like when he's not helpful. Maybe in the lake. This guy's got his heart. He put the heart back inside. They got to kill the guy. You think he put the heart back in? He put the heart back inside of him. He put the heart back inside of him. It had clues. Maybe it's in this. Take a bug. Leave a book. Yeah, I leave. Oh, shoot. Guys, the lights on now. I told you that's good. I told you. No, that means got a boss battle coming up. Oh, wait. Hold on. Hold on. Look at the ground. Is there something there? Right",
            "start": 7837.68
        },
        {
            "text": "Oh, shoot. Guys, the lights on now. I told you that's good. I told you. No, that means got a boss battle coming up. Oh, wait. Hold on. Hold on. Look at the ground. Is there something there? Right underneath the light. Never mind. Uh-oh. No, this is just safe. Look at how sick that looks, though. Yeah. Look at this. Look at this. That looks so nice. Look at the jacket. Maybe the light's the heart. No, this guy's going to pop up. I got to kill him. Good thing you're a shooter. Shooters never shoot. They always shoot. Oh. God damn it. All right, I got to go behind it. Oh, no. I went into the mine palace instead. Now I got to go behind this heart and stuff something in it. Get in that heart. I can't get there. No, you're not going behind. You got to shove it through it. I got to shove it through it. What do I shove through it? Chad, help him out. He needs to know where the heart is. Let us Chad, help him out. Heart is in the store. Jake is what? In the general store. Okay. Why would it",
            "start": 7871.72
        },
        {
            "text": "it. What do I shove through it? Chad, help him out. He needs to know where the heart is. Let us Chad, help him out. Heart is in the store. Jake is what? In the general store. Okay. Why would it be? Oh, it's where you buy stuff. Should I try to kill this light? [Music] Yeah. Imagine if the game actually responded to that. You'd be like, \"You're dumb.\" I bet you $5 it doesn't. Shoot it. Shoot it. Sam Lake. Come on. Come on, Lake. Come on, Lake. Did he miss? Come on, Lake. I never miss. I never I never miss. Chadwick Boseman. RIP. Rest in peace. No, definitely need it. All right. Pardon me. Why? I had a tickle in my throat. You sure did. It sound like a fake uh cough if I'm being honest with you. And I always am. Your word versus mine. I suppose that's the parking lot, right? Isn't this the general store? Picnic area. There we go. Damn, it's really flooding out here, guys. I'm really glad we did that whole um investigating the murder guy first. Yeah, he would have been real thick by now.",
            "start": 7942.88
        },
        {
            "text": "store? Picnic area. There we go. Damn, it's really flooding out here, guys. I'm really glad we did that whole um investigating the murder guy first. Yeah, he would have been real thick by now. Also, let me go to the map. People are saying you're navigating the woods very well. Thanks, man. General store right in front of me. Oh, shotgun. He's doing his best. Oh, shotgun. Caught off shotgun and a locked door. Bust that room down. Did you notice the circle next to it though on the other side on your map? Mike, what did it say? Uh, just like that thing. Yeah. Oh, I'm guessing I got to investigate this still. But this is where I Oh, this thing looks fresh. Oh, we took the guy away and they put the trees there, Mike. Yeah, that's shaman. No, I think they were under there already. Yeah, I think it was under his ass. Oh, we just didn't look. Well, yeah. Oh, yeah. Yeah, yeah, you're right. Crazy guys. We're two wild and crazy guys. Got two wild and crazy guys. Wild and crazy guys. I'm scared.",
            "start": 8017.52
        },
        {
            "text": "it was under his ass. Oh, we just didn't look. Well, yeah. Oh, yeah. Yeah, yeah, you're right. Crazy guys. We're two wild and crazy guys. Got two wild and crazy guys. Wild and crazy guys. I'm scared. You still watch SNL? No, I just catch the occasional clip that you know the one good sketch comes from something. I'm going the wrong way here. Where's the freaking general store? Was there ever a time where you're like, \"Yo, SNL's my [ __ ] I'm watching it.\" No, I was never an SNL like I have to be watch like tuned in um right off the rip. I I was never that guy. Never my thing. I should have gone the right way here. Where is the general store? Is behind me. Why am I missing this? This is the general store. How the heck do I get to the front of it? Yeah, I keep seeing like like I saw an article was like Bow and Yang, what's next for uh them after uh after who's that person? Oh, I have no idea. I know. I watched Wicked. I think Bowen's in that. Okay. I I believe so. Yes. Uh-huh. Uhhuh. It",
            "start": 8064.4
        },
        {
            "text": "was like Bow and Yang, what's next for uh them after uh after who's that person? Oh, I have no idea. I know. I watched Wicked. I think Bowen's in that. Okay. I I believe so. Yes. Uh-huh. Uhhuh. It was fine. Oh, shoot. This door's here now. Oh, [ __ ] Did the apple dance at Coachella. What's that? Big honor to do the apple dance with Charlie XCX. Uhoh. Jesus. That was a dear. That was a deer. It's okay. Forget about the apple dance. So, it's a dance you do for apple. Toggle flashlight to burn through dark through darkest surroundings. Okay. Huh. That took a lot of shots, bro. A monster like Nightingale. Cool. Do I need painkillers? I wasn't sure if just shooting was the right answer, but like always, it was. Yep, it always is. Turns out that was exactly what was needed. right now. Mike, let's steal his heart. Oh, we're going to take this dude. Oh, that's a great idea. We're going to chop your heart out here. That's how it works. [Music] Wow. Do I need the painkillers? How do I use the",
            "start": 8122.0
        },
        {
            "text": "steal his heart. Oh, we're going to take this dude. Oh, that's a great idea. We're going to chop your heart out here. That's how it works. [Music] Wow. Do I need the painkillers? How do I use the painkillers? Move them. Oh [ __ ] Look at this axe. Can I I wish you could take the axe. No bullets. Now, I appreciate these tree guys, but you got to figure like what you guys got to standardize this logo. It's all over the place. I think they mean different things. Yeah, I think they they got to mean different things. Like look up, look to the left. Right. This is where it's at. Was this guy in here the whole time? Grew bigger. Damn. Do you Are we not talking about the sound, dude? This is the achievement. A little ridiculous. It's a little ridiculous. Can you flip those? No, I can't. I can't interact. Cannot interact. In real life, you could with Come on, Sam. O, D got smelt with this whole place. There's definitely a steal his deer mask so he can blend in with the other bad guys. Such an",
            "start": 8199.44
        },
        {
            "text": "Cannot interact. In real life, you could with Come on, Sam. O, D got smelt with this whole place. There's definitely a steal his deer mask so he can blend in with the other bad guys. Such an easy solution. You know what I mean? I would immediately Oh my god, that would be the smartest thing you could do. Anybody asks it's like, \"Yeah, I stole this FBI code off off that guy.\" Like, why are you wearing this FBI coat? It's cold. Cold. I think you kill an FBI member, you steal their coat, right? Absolutely. I think if you kill an FBI agent and take their coat, you can become an FBI agent. And no, I heard that's how they reproduce. Uh-huh. Uh-huh. Where are It's like The Matrix with that guy, Agent Smith. Mhm. Man, what a movie. All of them. All nine of them. What a movie. Some of them weren't great. Uh, three of them. Yeah. Weren't great. Yeah, you nailed that. One of them was. All right. Well, let's see what Let's Go to our mine palace. Mike, go to the mine palace. I think we got some",
            "start": 8242.96
        },
        {
            "text": "great. Uh, three of them. Yeah. Weren't great. Yeah, you nailed that. One of them was. All right. Well, let's see what Let's Go to our mine palace. Mike, go to the mine palace. I think we got some interpret the pages meaning. Okay, cool. Let's go to this. We'll go over the pages. We got to interpret. Saga edged toward the broken door. Her gun ready. Flashlight aimed ahead. Night andale said it would be here. Mind Paris. Cauldron Lake store was overgrown. Left to rot. Saga thought out the That was the Apple dance. Let me see it again. I just, you know, once you sing it, you can't not do it. You know what I mean? Meanwhile, they played cards in the general store. Is that the is that when chapon goes f a c y say bubba? Who is it? Got to love chaon. H O T O G O. You can take me to go face to face with a cultist. Took over the world figure in a raincoat. What is that in his raised hand? I don't know, man. I don't know what she was saying. Somebody says, \"Don't forget the shotgun on the",
            "start": 8291.76
        },
        {
            "text": "to face with a cultist. Took over the world figure in a raincoat. What is that in his raised hand? I don't know, man. I don't know what she was saying. Somebody says, \"Don't forget the shotgun on the wall.\" Oh, yeah. Oh, let's get that gun. Let's get that gun, Chad. Those are the calls we're looking for. Shotty Bugatti. Yeah, shotty Bugatti. Am I in the shotty Bugatti? Oh, look at that. Hello, old friend. Oh, yeah. Let me just step over this dead body really quick. Oh, check with Lady uh Fontana at the counter for Okay, let's Okay. Okay, we can go to the counter. Okay. Okay. Okay. Okay. Okay. If you got a guess, guess the number really quick. Everybody take a guess. How many digits? How many digits? Three digits. Three digits. Everybody take a guess real quick. I got it. I got it. Well, you got to say it. You got to say it. Well, I mean, I'm waiting for everyone to get there. I'm ready. No, no, no. You go. Well, we're going to say them all now, and then whoever is right gets closest",
            "start": 8345.36
        },
        {
            "text": "you got to say it. You got to say it. Well, I mean, I'm waiting for everyone to get there. I'm ready. No, no, no. You go. Well, we're going to say them all now, and then whoever is right gets closest to the prize. Okay. What are you going to guess? What's your guess, Kevin? Yeah, I'll say it after you say it. Okay. What are you going with? You go. What are you going with? I'm going 421. 375. I was going to go 375. You son of a [ __ ] You son of a [ __ ] You make me laugh sometimes. Almost. Almost never, but sometimes. All right, let's go find this. Let's go find this thing. They'll find that number. Let's see who's Lady Fontana. Fontana. This is the 421 the day after 420. Did you celebrate 420 yesterday, Mike? Uh, no, no, no, no. It was 420 day. He's He doesn't do drugs anymore. I can't. He's clean. I think about Greg. Greg texted me last night, too. Scared me. You know, he just scares me. I'm watching you. Now, here's a real question for you guys. This is a lot ticket. If this is a",
            "start": 8395.76
        },
        {
            "text": "He's clean. I think about Greg. Greg texted me last night, too. Scared me. You know, he just scares me. I'm watching you. Now, here's a real question for you guys. This is a lot ticket. If this is a winning lotto ticket and you know you're you got $10 million on this ticket, do you even bother solving this murder? [ __ ] I leave. I quit. How about I quit? How about this? We take these lottery tickets. Do we take this lotto number? We actually buy a real life lotto. If we win, do we owe Sam Lake a million? No. I'll give him a million. Give him a give him a quick meal. No quick meal. Absolutely not. Did you remember all those numbers? There's a lot of sevens. 723. I think that was the last code. Try that one. Chat will tell us. They're They're on it. They're strong where we're weak. They compliment us. That's why we're the ultimate team. Oh. Whoa. It's like a real lock. Oh, yeah. I think I don't like that you're not like freaked out by this. A real lock. Yeah. It's scary. Why is it",
            "start": 8438.96
        },
        {
            "text": "compliment us. That's why we're the ultimate team. Oh. Whoa. It's like a real lock. Oh, yeah. I think I don't like that you're not like freaked out by this. A real lock. Yeah. It's scary. Why is it scary? This was Everything's a video game. Well, it's like this is a better lock than the other locks. I I The spinning dial locks to the right, then to the left, back to the right again. Oh, no. Combo logs. No, thank you. No, thank you. No, thank you. All right. Well, my the last code on the list and the first code on the list. I can't believe they were giving those to middle schoolers and saying, \"Good luck. Remember your code.\" Oh, man. I Dude, there were so many locks. I probably got cut off. You have what I mean? Like, yeah. How many locks are we? Don't forget update code. So, I tried 705 and 723. So, 713 and 717. Well, what's the pattern? I think is what they're saying. Oh, okay. The next one I see. So, you add I don't know. Five every time. No. Four. Having fun. What is the pattern?",
            "start": 8486.88
        },
        {
            "text": "and 723. So, 713 and 717. Well, what's the pattern? I think is what they're saying. Oh, okay. The next one I see. So, you add I don't know. Five every time. No. Four. Having fun. What is the pattern? I don't know. I'm playing a different game. Look at the lotto. Five. Look at the lot. Oh, the lottery tickets. That was 723. 723. No. 723. 945. Oh, you add five then 13. No. Oh, wait. Wait. 705. 713. Go back to the lottery numbers. Yeah. 0513. 1720. So it's 739. 739. I think I was the closest. 7395. That's a good one. Mike, what was your guess? Uh 421. Got him. That was a good puzzle. It's fine. No blueprints, you know. It's my boomstick. This is your boomstick, bro. Bring it on. Let's go, cultist. God, give me a puzzle. You know, I'll solve it. Quick slot for inventory. Oh, yeah. Let's do that. Let's do it slow, Nick. Do a decimal. Do we? Charm slots let you equip charms to enhance Saga's abilities. Only charms can be equipped in charm slots. Cool. Thanks, man. Okay, it's great. Uh,",
            "start": 8524.4
        },
        {
            "text": "that. Let's do it slow, Nick. Do a decimal. Do we? Charm slots let you equip charms to enhance Saga's abilities. Only charms can be equipped in charm slots. Cool. Thanks, man. Okay, it's great. Uh, okay. How do I do this into my little thing? I would like Hey, you got it. It's there. Move. I want to click quick slot it. Oh, that's smart. Yeah. And I'm going to quick slot this. That's very smart. He's played the game before. That's very smart. So, let's see if I hit one now. Is it three? Yes. Yes. Oh, he's back. I got How did I get the Oh, lot of people say he was never gone. That to be like two. Oh, there's no It's just three and four. Okay. So, I don't want that to be four. You double tap three if you want. Tap tap tap. Little three three. Dude, I'm [ __ ] I'm so ready to I'm locked in. Tell the deer guy to come back again. Hey buddy, you got some friends? I need some target practice. Practice. It's okay. I still got to find the stupid heart or what? People are saying uh do your mine",
            "start": 8599.76
        },
        {
            "text": "the deer guy to come back again. Hey buddy, you got some friends? I need some target practice. Practice. It's okay. I still got to find the stupid heart or what? People are saying uh do your mine palace. Oh, mine palace. Okay. Oh, I got to go to the thing. You got to interpret the pages. You got to interpret the pages. It's in a book. Reading rainbow. Read that book. Read that book. Are you going to show that to your child? Reading Rainbow. Absolutely. Reading Rainbow. Rainbow rocks, dude. Yeah. There. No. No. It's a Kevin's child. Yeah. Cuz like it's kind of like really old, so it's not like it's on TV. I think it's still on TV. Do you still go find it? Really? It's on TV. Oh, we Well, the internet, you know. Burton, dude. Porch. You just YouTube old things now, huh? Yeah. But also, I mean, that must be on some that's probably owned by Disney, right? Reading Rainbow. Reading Rainbow. Disney owns everything. Where is it now? To get into the overlap, I need to find Nightingale's heart.",
            "start": 8668.24
        },
        {
            "text": "that must be on some that's probably owned by Disney, right? Reading Rainbow. Reading Rainbow. Disney owns everything. Where is it now? To get into the overlap, I need to find Nightingale's heart. Read the line imprinted on it, plus the line on the page to the witch's ladle sign. Then push the heart through the hole in the sign. It's a lot of work. You already knew how to do that. Alex Casey lunchboxes. I don't think I Where do I put these? Oh, I need Nightingale's heart to get to the overlap. Overlap. Where is it? Cultist wouldn't close. It's in the morg. He was there, but he was risen. Nightingale was there. The opposite of sunspots. Who said that? That's not it. I don't have what I need to find Nightingale's heart. The scary voice just said, \"Who said that?\" Mhm. Nightingale's heart. Where is it? Meanwhile, they played cards in the general store. The witch had stolen his heart. Get out of my house. It's in ice box, bro. All good hearts, huh? General store in a fridge. Cool. I",
            "start": 8712.8
        },
        {
            "text": "Where is it? Meanwhile, they played cards in the general store. The witch had stolen his heart. Get out of my house. It's in ice box, bro. All good hearts, huh? General store in a fridge. Cool. I called it. I called it. I said it was back in town. He He did say it was in a fridge. In a fridge. Nice. Where the heck do I put these stupid things? Uh those probably go in that weird adventure slot that you had with uh you put these up before. Right there. Yeah, you're right, Mike. I got to be I got to be a little more zoomed out here. Yeah, you got to zoom in. The mine palace is a big place. Mine palace. It's also 360°. It's so huge. Very similar to the sphere. in Vegas. Where's this guy go? I've been there. Killer profile victims. That's so cool, Mike. I think that goes on the table next to the other jabronies. Oh, never mind. With an organized group of killers, the cult of the trees behind. I don't know how she's organizing all this. It's a lot. It's her mind palace. It's her mind",
            "start": 8781.6
        },
        {
            "text": "to the other jabronies. Oh, never mind. With an organized group of killers, the cult of the trees behind. I don't know how she's organizing all this. It's a lot. It's her mind palace. It's her mind palace, not We're just visitors. We're just visitors. Nick, you think your mind palace is a movie rental place? It's a It's the video is from my childhood. Yeah. exciting. But it has that little room back there that I'm not looking cuz I'm not old enough to look in there with the barn doors. But I was like, those should be bigger if you don't want me to see the porn boxes. Man, if we could just go back in time, walk through that Blockbuster one more time. I would give anything. You just never know when it's the last time. You never knew when it was. You know, they say there's a moment where you pick your child up for the last time, and I didn't know that about the Blockbuster. Picking up my picking on my VHS rentals. Actually, I do. I actually remember thinking like this is my last time I",
            "start": 8833.44
        },
        {
            "text": "pick your child up for the last time, and I didn't know that about the Blockbuster. Picking up my picking on my VHS rentals. Actually, I do. I actually remember thinking like this is my last time I watch. You think so? Oh, wow. Yeah. I'll never for I was too young to actually recognize that. like, \"Oh, it's over now.\" That's right. What' you say, Gab? Oh, nothing. I was just going to say you can call your dad and have him pick you up one more time. I might I might kill him. Yeah. No. No. He's going to have a hard time. I'm really big. Just to be clear, I never said it was going to be easy, but like it's like when will Andy's last time be picking me up. You know what I mean? I don't think he's ever picked you up. When will be the last time Andy picks me up? I got to sort these the right way. Okay, where are we going? The cult cult rituals. No, lady, don't get mad at me. None of this makes any sense. I hate I love I hate when she's just throwing [ __ ] at the so unfair. You know, we're",
            "start": 8866.4
        },
        {
            "text": "Okay, where are we going? The cult cult rituals. No, lady, don't get mad at me. None of this makes any sense. I hate I love I hate when she's just throwing [ __ ] at the so unfair. You know, we're not paying attention. We have no idea where these go. Lady, so mad at me. Not only that, but it reorganizes every time I put it back in. God. All right, let's think about this. Yeah, it's got to go. What's the cold school? Uhhuh. Can't do anything. Oh, got it. You Oh man, you're just unlocking so much. Unlock. You've had all this stored up. You got to get this out of your mind. This is me telling you where the what the words are so for the lady. Dude, I really have a lot here. This is like one of those where it's like you got to get that out of your system. You got too much shoved up in your mind, palace. Who's involved? What? Dude, this lady is not good at her job. I'm saying this right now. We're going to get it. There's too much stuff going on. We're going to get it. It's too much. You're",
            "start": 8910.96
        },
        {
            "text": "palace. Who's involved? What? Dude, this lady is not good at her job. I'm saying this right now. We're going to get it. There's too much stuff going on. We're going to get it. It's too much. You're also not good at her job. No, I'm terrible at her job. Yeah. Well, we're not FBI agents trained in Quanico. Quanico. Got to go. You know what I mean? You think Quanico just has a bunch of red red yarn? Definitely. It's all you get. There's a bunch of red. Where do I get my gun after you've mastered the red yarn? Here's your Polaroid camera and some red yarn. Figure it out. Oh my god. Solve a mystery. Who's involved? How about that? No. Okay. Colt rituals. I thought of another really good play NBA playoff song for Andy, but I won't call him again. But it's Fireball by Pitbull. You do it for us. Fireball. I'm Pitball. Fireball. I'm Pitball. And I don't even think he says anything but fireball the whole song. Oh no, he says I came. I conquered. I came or whatever. God, I love that guy. I",
            "start": 8962.0
        },
        {
            "text": "us. Fireball. I'm Pitball. Fireball. I'm Pitball. And I don't even think he says anything but fireball the whole song. Oh no, he says I came. I conquered. I came or whatever. God, I love that guy. I conquered. I came. Pimple, man. What a career. What a career. Shouldn't this be And who's involved? This might be a new one. No, that isn't that is that not Sam? Yeah, but it's a clue that someone gives you. He He told you something that's Wait, like supposed to go on one of these. H. It's got to be in the rituals, right? Cold symbols. No. Doesn't make sense. There it is. Why would it be there? Why would it be there? Why wouldn't it be there? Right. They're right. I like the chat. I like Yeah, Chad's expectation is low. Chat's having fun, which is the best part. I think a lot of people have come in going, \"Wow, I didn't think these guys would play this.\" And they're having a good time with us. Mhm. They meant should. The heart is somewhere in the general store. Okay. The freezer, right? We",
            "start": 9015.6
        },
        {
            "text": "in going, \"Wow, I didn't think these guys would play this.\" And they're having a good time with us. Mhm. They meant should. The heart is somewhere in the general store. Okay. The freezer, right? We We No, no, no. We know that, but we got to just like get So, I'm still building out these. But every one of these caves files is a new wall. What does it say, though? Where's the heart? It's in the general store. All right. That's an easy one to put there. Yeah, we figured it out. Perform the ritual opening. Okay, guys. Cool. Hey, guys. Look. Mine palace. Oh, got to burn through it. Oh, high beams on that bad boy. Oh, I ran into it. Juice. There we go. Give me that. Oh. Oh, you didn't have to go back to the main town. It's right here. No, I wasn't there. I saw the freezer. I was like, \"Oh, it should be in here.\" But then I didn't realize I had to go my mind clues together. So I come back and burn my cool flashlight so the heart would be there. Mine palace. Mine palace. Mine palace. Mine",
            "start": 9072.16
        },
        {
            "text": "should be in here.\" But then I didn't realize I had to go my mind clues together. So I come back and burn my cool flashlight so the heart would be there. Mine palace. Mine palace. Mine palace. Mine palace. Mine palace. I'm back on the case board. Why? Yes. No, I don't want that. Just give me the heart. I feel like I recognize this. The fridge. The heart. I knew it would be here. Like I saw it in a dream. Nope. This lady's living an insane life right now. Yeah. The witch. Any of this happens to you, you got to go to therapy. You got to go to Well, she's been repressing her feelings. Remember that. Who the hell is this guy who killed that guy? That's the deer man, right? That's not the dear man. Yeah, he had the mask on. No, Nick blew off his side. Yeah. Yeah, he blew the side off of that deer man. That guy That guy was here. Oh, he moved a little bit. People dead bodies move. Sometimes dead bodies move. Why is this guy here? He doesn't have a deer mask on. That's a good looking jacket",
            "start": 9111.44
        },
        {
            "text": "man. That guy That guy was here. Oh, he moved a little bit. People dead bodies move. Sometimes dead bodies move. Why is this guy here? He doesn't have a deer mask on. That's a good looking jacket though. You know, take it off. Put that on. It's like a render. Render. You go to the Renfair. You go Ren fair. You go pre-dressed or you go I'm going to go buy clothes there. Uh definitely pre-dressed. Nobody goes buy clothes there. Yeah, they don't. I think you buy clothes there for the next friend fair. Bro, but like no one does like buys a full outfit there. I thought that's what people do. Go in Nikes. Yeah, you go are you going in shorts and a t-shirt knowing that you're going to buy the rent fair outfits there? I'm 100% sure that's not the case. Are we not supporting the small businesses there? Absolutely. Well, just I mean you're not buying a full outfit. I thought we were buying outfits there. I know, but you are a psychopath. So where are we purchasing a Renfair outfit then? You you",
            "start": 9156.96
        },
        {
            "text": "Absolutely. Well, just I mean you're not buying a full outfit. I thought we were buying outfits there. I know, but you are a psychopath. So where are we purchasing a Renfair outfit then? You you cobble it together. Just from random what? Well, I mean it's the Renaissance. They didn't have stores. You have to make it yourself. You go out, you collect some twigs, some leaves, you buy yarn. It's just like Icarus. Oh man, we were making so much out of Nicar. Mark Ruffalo. The Buffalo. Mark Buffalo. Mark Buffalo. You guys killed him. So mad. Technically, I think he starved to death. Yeah, he starved to death. He needed a lot of food. You don't think that's far worse? We gave them so much food. Uhoh. Oh no. Cultist Chris Anka says, \"Nick, don't talk about acorus. You know you're not allowed to. I'm going to kill these guys. That's a lot of guys right in the chip. [ __ ] That's good. Okay. Okay. Oh. See, when they do that weird glary thing, you got to like go. You got to Yeah. You got to",
            "start": 9198.32
        },
        {
            "text": "to. I'm going to kill these guys. That's a lot of guys right in the chip. [ __ ] That's good. Okay. Okay. Oh. See, when they do that weird glary thing, you got to like go. You got to Yeah. You got to double down on him. Little phosphorus grenade in his chest. Yeah, dude. Well, cuz they it gets it gets the goo off him and then I can shoot him. It's pretty sick. Yeah. Shove the heart in the heart. Shove it in, lady. Do the key. Okay. See if it does something. Oh, no. I don't She's got to look. Oh, Peter. Use your hands. This is perfect. The wave crashed on the far side of the mirror. I brought you the heart witch. Show me the terror. Seems like this is what those people wanted to do. Yeah. Like I'm doing their work for them. Yep. Oh, you think I'm one of the cultists? The deer people are going to be pleased about this. Yeah. They're leading me into the darkness. They're like, \"Shit, she's doing it. She's doing it.\" Wow, that really worked. That was easier than I thought it was. Yeah,",
            "start": 9243.84
        },
        {
            "text": "going to be pleased about this. Yeah. They're leading me into the darkness. They're like, \"Shit, she's doing it. She's doing it.\" Wow, that really worked. That was easier than I thought it was. Yeah, exactly. Tre's up. All right, walk on through to the other side. Walk on through. Enter the overlap through the witch's ladle. Ew. All right, this is sexual. Oh, is the tree the witch's ladle? Yeah. Oh. Oh, that was cool. Casey, I think I'm in the overlap. Are you still on your way, Casey? Casey. Yeah, walkie-talkies don't work in the overlap. No, I do work in the overlap. Why would they solo? There's a lot of solo play here. Like, maybe she should have waited for her partner. Mom, help. Logan. Oh, no. Where are you? Oh, no. Those those memories are going to come back in Virginia. You're imagining things. [Music] I don't like this. Would you please help me? What was that? Wait, did I get turned around? Dude, this thing is crazy, man. Nightmare. It's looping my nightmare. Looping my",
            "start": 9325.12
        },
        {
            "text": "imagining things. [Music] I don't like this. Would you please help me? What was that? Wait, did I get turned around? Dude, this thing is crazy, man. Nightmare. It's looping my nightmare. Looping my nightmare. I hate you. You never want a looping nightmare. No, you don't, man. Unless it's like a cool nightmare. Oh, where you fight back and you win. Yeah, you just blast them when you're like, \"Finally, I get the rage out.\" You're the rage. Oh. Oh, it's the art. Oh, that was cool. Okay, this is cool. Like you see that it went 3D then un 3D. Ah, [Applause] the Rus was fighting again. Look at the lighting on this. This is awesome. Well, let me turn the flashlight off here so we can just appreciate this. Oh, turn off. Nightingale. Look at the red. It's good. Nightingale is here, so be prepared. Who escaped? Danger. Who is that? That's Alan. It's like they're coming in over a bad signal. Alan. Allan. Alan. Alan. He wakes up in the dream. Talking raptor. Nighting's badge. Oh, he's stocking",
            "start": 9385.88
        },
        {
            "text": "Who escaped? Danger. Who is that? That's Alan. It's like they're coming in over a bad signal. Alan. Allan. Alan. Alan. He wakes up in the dream. Talking raptor. Nighting's badge. Oh, he's stocking you up for something, Nick. I'm ready to rock, bro. Stocking you up. I don't need the badge, I guess. He's already dead. Night and Gale. Yeah. Yeah. Don't matter. If he's not, he will be shortly. His wife and family don't need the badge. They don't need the badge. I mean, you could put in your pocket for him. That'd be a real nice gesture, but whatever. Oh, [ __ ] You see him, Mike? Oh, yeah. You can't miss that pale body. That pale naked body. A lot of flesh, dude. Was like a subway station. Yeah. What is happening in this game? You're going underneath the lake into the hidden factory. Am I? You have to enjoy it, Nick. Oh, look. You see, Jedi survivor. Oh, he's loading a new area. Got to load. They thought they could trick us. Come at me, big dog. I'm ready for you. Oh, shoot. Oh. Whoa.",
            "start": 9497.36
        },
        {
            "text": "You have to enjoy it, Nick. Oh, look. You see, Jedi survivor. Oh, he's loading a new area. Got to load. They thought they could trick us. Come at me, big dog. I'm ready for you. Oh, shoot. Oh. Whoa. Nice dodge, bro. Oh, is he like getting way more rotten? He's getting stronger. He looks like a tree. Whoa. Where'd he go? Where'd he go? Where'd he go? Find him. Find him. Find him. Oh shoot. Oh [ __ ] What the hell? Run, Alan. Run. Need to get away. No, I know that, but I don't know which way to go. Run, Saga. Run. How about this way? I think it's the wrong way. Oh, cool. What's this? Oh, take a book. Leave a book. Take a book. Leave a book. Let's just get everything. Take a bullet. Leave a book. the lending library. Ah, shoot. You got me. You scared me. You scared me. Pound f E. Shoot him. Found that. Oh. Oh. Do you still have the shotgun? He just Yeah, I ran out of bullets. He gave you the tree. Ran into bullets, Mike. Well, guess what? That's why I get a second chance. Okay. Oh, you",
            "start": 9564.0
        },
        {
            "text": "Found that. Oh. Oh. Do you still have the shotgun? He just Yeah, I ran out of bullets. He gave you the tree. Ran into bullets, Mike. Well, guess what? That's why I get a second chance. Okay. Oh, you want to run it? You want to run it? I'll run it. No, you got I mean you got to beat this guy. You can't just roll up to a boss. You got one try. One try. One try. One try. That's why you get a second chance. You're not going to take me to the mine flap and not think we're going to get in it. Overlap, dude. This guy's ripping trees off to hit us. This guy's ripping trees off. Big dodge. Oh, I dodged wrong. He misread it, folks. He misread it. Let's try this again. You know what? You know what? That one doesn't count. That one doesn't count. We're going to get as many tries here. We're going to get get couch. We're going to get a count. Let's go here. Night and Gale hunt. Let's get a good dodge. Let's get a good dodge. Oh, okay. I did not think. Oh my god. Oh, okay. Maybe I got to heal up.",
            "start": 9629.2
        },
        {
            "text": "get get couch. We're going to get a count. Let's go here. Night and Gale hunt. Let's get a good dodge. Let's get a good dodge. Oh, okay. I did not think. Oh my god. Oh, okay. Maybe I got to heal up. What do you think's happening? No, I think you're just missing that dodge cuz the first time you did this, you did a great dodge, but like I think you got to dodge to the right. I think you got to dodge like forward left. do kind of feel like he's forward left is where you dodged last time the first time and he went hard right behind you. Oh, I got to beam him. People are saying maybe I got to beam him first. Just start shooting him right away. Okay. Oh [ __ ] that was crazy, bro. That is big old movie. Flashlight high beams. Yeah, he got him. Switch it up. Switch it up. Oh, shoot. Shoot him in the chest. over the schlong. I love it. I like it. Oh, okay. I got his ass. Good. That's good. But I am out of ammo. You don't need it. That's fine. Find the take a book. Leave a book. Yep. Is that",
            "start": 9670.0
        },
        {
            "text": "the chest. over the schlong. I love it. I like it. Oh, okay. I got his ass. Good. That's good. But I am out of ammo. You don't need it. That's fine. Find the take a book. Leave a book. Yep. Is that really where ammo was coming? I thought you were missing. No, it was. Yeah, it's back. It's back here. Okay, let's heal if you need to. And you're solid. You're solid. Good. Good. Good jump. All right, here we go again. I like when a game hits with Nick. Oh, he's not. He's got me. He's got me. I thought you had that. That's all right. That's all right. Blast his face with the light. Okay. Well, I thought I was just into it that time. Yeah, you really overstage your welcome on that. But I like the I like the aggression. Yeah, we're going to go ahead and We might drop the difficulty down on this. You know what? What? What? What if we call for the day? We come back with a different different energy level. Try one more time. One more try. One more try. One more try. We got this. One more try. I",
            "start": 9731.12
        },
        {
            "text": "You know what? What? What? What if we call for the day? We come back with a different different energy level. Try one more time. One more try. One more try. One more try. We got this. One more try. I got to blast him. You got to blast him. Gale hunt. Mighty Gale. You only need to beam him when he has his aura. Okay, there you go. [ __ ] That's good dodging. Oh, let's get our heal on. Oh no, he's still alive. Oh [ __ ] I don't know how to get a heal now. We got to get our heal on. [ __ ] Run. How do I use the heal? You might be in that circle. What the hell is that? Oh no. Yeah. How do I get the heal? I don't know, Chad. How does he heal? He's never healed before. He didn't have to. He's saying it. No, you 100% got to heal. Yeah, I definitely have to heal. You got to equip to heal. Okay, hold on. Yeah, when you went you went by, you clicked on the shotgun instead of a heal. Pretty good move though, I think. Okay, let's try this. Hold on. Right. Just remember, he's going to look to grab",
            "start": 9799.68
        },
        {
            "text": "on. Yeah, when you went you went by, you clicked on the shotgun instead of a heal. Pretty good move though, I think. Okay, let's try this. Hold on. Right. Just remember, he's going to look to grab you here. So, you're going to have to get a dodge before you get the choke slam or death. Okay, let's do another one. No touching. No touching. He'll know what that means. I love this. I love this. Hi, Techie Hos. How are you? All right, we're back to We're back to ground zero. We're all good. Step two. Now, remember, he's going to look to grab you. Nice dodge on the grab. Yep. Yep. Oh [ __ ] Oh [ __ ] Got the grab up. [ __ ] I got the grab up. I got the grab up. Let's dodge back. Yeah. Just get some room. Get some room. You're good. Coming in. Coming in. Coming in. That's all right. It's all right. Pound that F. Pound that F. Got to reload. Yep. Let's keep backing up. Nice. He's going to come at Oh my god, that was crazy. All right, heal. We need to find some ammo. Yeah, we need ammo. We",
            "start": 9880.08
        },
        {
            "text": "right. Pound that F. Pound that F. Got to reload. Yep. Let's keep backing up. Nice. He's going to come at Oh my god, that was crazy. All right, heal. We need to find some ammo. Yeah, we need ammo. We need to restock here. We don't know what Facely holds for us, so be prepared for anything. We're going to look around real quick. See if we can't find I don't know how he comes back. Now, how do I get my freaking I need more flashlight. Oh, I'm in the mine space. My flashlight ammo batteries. There we go. There you go. Oh, that's big. Wait, did we figure out the heels? Leave a book. Take a book. Take a book. Leave a book. Take these bullets. Leave these bullets. Nice. That's big. Be prepared. Oh, you're out of healing. Shoot. There you go. Get away from him. Get distance. Nice. Oh, you're good. You're good. Yeah. Yeah. Big distance. Nice. You're good. That's massive. He gave you the scar. That's incredible. That's how you know you heard him. All right, let's reload everything. Got a",
            "start": 9952.0
        },
        {
            "text": "good. You're good. Yeah. Yeah. Big distance. Nice. You're good. That's massive. He gave you the scar. That's incredible. That's how you know you heard him. All right, let's reload everything. Got a moment. That's a great job getting distance on him. That was big. Really well done. There's something down into your left back there. [ __ ] it. [ __ ] it. [ __ ] it. [ __ ] it. Too late now. Yep. [ __ ] [ __ ] is this guy? I don't see his ass. Oh, he's right there. Oh [ __ ] Good. You're good. You're good. Distance. Distance. Oh [ __ ] I'm caught. I'm caught. I'm caught. I'm caught up. I'm caught up. Good dodge. There you go. Get out of there. Oh [ __ ] Uh, the death remain. You're good. Get away from him. Yep. Got his ass. Oh, what? Oh, it's a gamer right there. Never stop shooting. Never stop. Never stop shooting. Mhm. Frames win games. They sure do. Thanks, Nvidia. If I wasn't at 78 frames per second though. I don't think I got to pull that one out. What is this? Who are you? Pass. I'm",
            "start": 10052.24
        },
        {
            "text": "Never stop shooting. Mhm. Frames win games. They sure do. Thanks, Nvidia. If I wasn't at 78 frames per second though. I don't think I got to pull that one out. What is this? Who are you? Pass. I'm sorry. FBI. I can hear you. Oh, I don't talk to cops. Cauldron Lake. Yes, I'm at Cauldron Lake. Where are you? How do you escape? I'm in danger. The darkness res danger. Thanks. Got it. Got it. Hey, is it my daughter? [Music] Are you okay? No, it's my fault. They got out with by Oh, is that Alen? Scratch. Sir, calm down. I'm going to need you to take a breath. He's He's changed the story. The presence. We must stop it before. Easy. Now, first things first. What's your name? My name is Alive Wake. I'm a writer. I You found him. Wake. Where did you come from? In the cold case files. You've been missing for 13 years. 13. It's the lucky number. The devil's number. Wow. What a game. It's a good game. It's a very good game. H TGO. And with that, that will end today's Monday afternoon stream. Thank",
            "start": 10127.44
        },
        {
            "text": "for 13 years. 13. It's the lucky number. The devil's number. Wow. What a game. It's a good game. It's a very good game. H TGO. And with that, that will end today's Monday afternoon stream. Thank you to Nvidia for sponsoring today's stream, allowing us to showcase DLSS4 with Allen Wake 2. There's even more titles that you can get the very best from your Nvidia GeForce experience. Don't forget to update those drivers. Go out there, play some games, and have some fun. Thank you for tuning in. We'll be back tomorrow with all of the live show content that you could ask for. See you then. [Music]",
            "start": 10227.52
        }
    ]
}