{
    "id": 13917,
    "video_id": "ywM8n0n56BY",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Andy Cortez",
        "Mike Howard",
        "Viktor Viklund"
    ],
    "title": "Greg Miller and Andy Cortez Play GTFO With The Developers!!",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page -  https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744888397,
    "duration": 6697,
    "transcript_chunks": [
        {
            "text": "Recording in three, two. Yo, what the heck is going on? Kind of funny best friends. It's your guy Snowike Mike back at it again with another kind of funny games afternoon streaming. Oh boy, do we have a special one for you. Andy, turn off your flashlight. Stay silent cuz it's going to get spooky and wild in here. We're back for more GTFO on a very special stream. You set this up, Andy. You were the one who kind of created this. What are we doing? Who do we got here in the room with us? We have Victor from 10 Chambers. Um, if y'all saw a recent Games cast where I talked about their uh, upcoming game Den of Wolves, which is a really cool I mean it very Payday inspired because these are a lot of the uh, desert the original Payday. And then they made GTFO, which is a game I had never heard of, but during the pandemic, Mike, I remember watching our friend Bruce Green playing GTFO and being like, \"Wow, that seems like a really kind of scary cool co-op game.\" and we played it and it has just",
            "start": 1.56
        },
        {
            "text": "but during the pandemic, Mike, I remember watching our friend Bruce Green playing GTFO and being like, \"Wow, that seems like a really kind of scary cool co-op game.\" and we played it and it has just a lot of cool innovative co-op things, but it's also just very scary. And I it's something that is so great for content because of the amount of times that somebody can screw something up and you know, we yell at each other, but it's something that I always wanted Greg to play. And uh yeah, as we were talking about uh Den of Wolves, some people in from 10 Chambers were watching the Games Cast and we're like, \"Hey, let's set up a GTFO day where we stream some GTFO so we can show you all why this awesome multiplayer game from a couple years ago is still like, you know, has a a nice fan base because a lot of people love the product that they put out.\" Yeah. And so now we're going to play with Victor from 10th Chambers. We're going to show Greg the game. Will you help Greg get in? Uh I've sent",
            "start": 46.16
        },
        {
            "text": "a lot of people love the product that they put out.\" Yeah. And so now we're going to play with Victor from 10th Chambers. We're going to show Greg the game. Will you help Greg get in? Uh I've sent him invites. So, it's, you know, the tab shift moment. Hit that play game right there. And then, uh, let's go get lost. Uh, Victor, of course, you today get to be our sherpa. I already got to spend some time with Victor, so I'm warmed up. But you're the captain today, big dog, so you get to call the shots. We're listening to you. And, uh, let's make a great time for the one and only Greg Miller on this one. Yeah. Let's keep in mind, Victor, that uh, this is Greg's first time, obviously. Uh, and I haven't played in many years, so it may as well be my first PC or something. Got it. I'm using this. You got the gyros on the dual sense here that I'm using to do this. This is I've never seen this before where I'm controlling it this way and I got a R2 to select things. That's crazy. They thought",
            "start": 90.8
        },
        {
            "text": "You got the gyros on the dual sense here that I'm using to do this. This is I've never seen this before where I'm controlling it this way and I got a R2 to select things. That's crazy. They thought everything over there. Uh so Victor, what Thanks for having me, guys. Yeah, thanks for thanks for caring, Victor. Thanks for watching the stream. Want to be a part of this. Absolutely. You know, I've been a big fan of of Kind of funny for a long time. you know, listen to your PlayStation podcasts ever since the beginning and uh kind of funny games daily for several years. So, uh yeah, really nice uh you know, I hope we're going to have a really nice time playing together. I'm excited. I think one thing I would love is maybe some recommendations. What are some things we should be equipping for our first little journey out there in GTFO? And I did see a question from chat say any uh possible keys to give away. I have a key I can give away to GTF. Oh, put it in the bowl. You're going to Andy's",
            "start": 132.24
        },
        {
            "text": "first little journey out there in GTFO? And I did see a question from chat say any uh possible keys to give away. I have a key I can give away to GTF. Oh, put it in the bowl. You're going to Andy's house. I'm going to put it in going to put it in the Twitch chat right here. Yeah, we'll see if we have a if I have a colleague of mine hanging out in chat. Maybe either YouTube or Twitch and they send out some codes. I don't know. Uh maybe they they they they usually do. So, I I hope so. I'll give one out right now. But yeah, let's let's check out our let's check uh our load out here. Uh, I'd say the tools, the the bottom left uh of those four icons that you see, uh, those are the the kind of class-based uh, things that you bring into your expedition. Uh, we don't want to bring the same thing. Um, you know, at least one biotracker would be good, but we don't need more than one. Um, mine deployers uh, is really good as well. Multiple turrets is always good. So, uh, I love the turrets. Yeah,",
            "start": 173.12
        },
        {
            "text": "Um, you know, at least one biotracker would be good, but we don't need more than one. Um, mine deployers uh, is really good as well. Multiple turrets is always good. So, uh, I love the turrets. Yeah, we have we have a good spread there. uh two turrets and uh mind deployer and a biot tracker. And then the weapons, you know, you got this your you got your primary and your secondary. Uh just bring whatever you know tickles your fancy. What whatever you want to bring. And if you got any boosters, those are the plus signs. Uh I see Greg has some boosters. I'll put a booster on. Put a booster on. Put a booster on it. Just inject it. All right. All right, I'm getting u you know, if you want to check check your apparel, you can uh change your clothes if you got it. Um and after that, just ready on up and we'll we'll do our cage drop. Mike, what weapons are you going with? Uh I'm going with an assault rifle this time around. I went with the short rifle. Uh a little bit more of a single shot",
            "start": 220.24
        },
        {
            "text": "on up and we'll we'll do our cage drop. Mike, what weapons are you going with? Uh I'm going with an assault rifle this time around. I went with the short rifle. Uh a little bit more of a single shot when me and uh Victor were playing earlier. And you know me, I got a spray and prey. So, I'm going to go with full assault rifle for us. All right. Assault rifle, too. We're going precision sniper. Yep. And I like the idea of a machine pistol. That sounds cool. Let's do that. And then uh make sure to ready up. And Victor will take us in to our first expedition. Oh, I don't want to apply this booster. This one uh get lowers my health. I'm not a big fan of that one. Let's do maybe not bring that, you know. Yeah, that's a good idea. There we go. So, we're playing the first expedition of the last rundown of GTFO. Uh that's what we're playing. Uh hopefully we get time to to to try out another expedition after this. We are ready. Jesus Christ, Victor. It's a scary game, man. This is a freaky",
            "start": 269.12
        },
        {
            "text": "rundown of GTFO. Uh that's what we're playing. Uh hopefully we get time to to to try out another expedition after this. We are ready. Jesus Christ, Victor. It's a scary game, man. This is a freaky game. Yeah. So, the cool thing I love, Victor, is that Greg hasn't like seen any of what the gameplay is or how any of it works. And I think it's just really cool and creative. Yeah. This is, you know, we want to convey to the player that we're you're forced down into whatever you're doing uh in DCFO. You're a prisoner uh sent down by the warden against your will uh to do uh dangerous stuff down here in the complex. Something has gone terribly wrong down here and nobody wants to be down here. Um so, you know, you're you're outnumbered, you're outgunned, you start uh you start the expedition with low ammo every time. Uh friendly fire is always on. Um, so you know those kind of stuff. Most of the enemies are are sleeping and you want to keep it that way by uh, you know, not shining a light on",
            "start": 314.72
        },
        {
            "text": "low ammo every time. Uh friendly fire is always on. Um, so you know those kind of stuff. Most of the enemies are are sleeping and you want to keep it that way by uh, you know, not shining a light on them and not you know, they're light and sound sensitive. So you you want to be mindful of that. Kevin, I lost light over here and I don't know if it's I don't like this. It was on purpose. He said lost light while I was messing with lights. Just make it a little darker. Make it a little darker, you know. Are you guys are getting moody over there? Just a little bit. Trying to. Yeah, they're messing with me. Victor, I cranked up my volume cuz I really love the sound design of this one. Yeah. Yeah, he did. He did a nice job. Fman did a nice job. All right, so uh good room to get a feel of the controls. Uh you're going to start uh hearing a monologue real soon from from one of the characters. Uh we're like deep into the story already by Runown 8. Uh so you know just be ready to to listen to",
            "start": 368.64
        },
        {
            "text": "Uh you're going to start uh hearing a monologue real soon from from one of the characters. Uh we're like deep into the story already by Runown 8. Uh so you know just be ready to to listen to to to him uh rambling on about weird stuff. Ram. How do I turn off? Cuz even on the game pad right now it's my head's connected to the gyros. How do I turn that off? Oh, you're actually Yeah, you're playing with the Dual Sense. Oh, he 100% is. Yeah. Yeah. Okay. Wow. I think you need to go into uh Steam and turn that off, to be honest. Oh, yeah. Here, let me do that. Let me do that. Sorry about that, dude. That's so crazy. I didn't know that the gyro did that. All right, hold up. Hold up. Gyro behavior as mouse. Turn that [ __ ] off. Oh, yeah. We We brought We brought a Dual Sense Edge and um the um Xbox uh what's the equivalent on? Elite controller. Yeah, Elite controller. Yeah, we bought each one of those for our press stores uh when we showed off rundown 8 of GTFO uh just to offer people that.",
            "start": 420.56
        },
        {
            "text": "uh what's the equivalent on? Elite controller. Yeah, Elite controller. Yeah, we bought each one of those for our press stores uh when we showed off rundown 8 of GTFO uh just to offer people that. Yeah. Uh the the choice to play uh with gamepad. I don't know how to turn it off. You want me to grab my Xbox control? Is it still doing it? Oh, no. Wait, hold on. Maybe we Maybe I disabled it. Nope. Yeah, maybe Xbox. Let's get him. Just snag the one. No, we got we got him in here. I guess you're going to use the matter wave projector. Thank you, Chief. You've used it before, but this time we'll know what we're doing. We're going to use coordinates. Yeah, we're burning through the monologue at least. So, we got that uh done. Whenever we have the the the controller up and running for Greg, I'll explain more once you find it. Thank you. There it is. Uh oh, yeah. F is the flashlight. I remember that. Yeah. Just get a feel of of where where the where the buttons are for you. Uh and typing on",
            "start": 472.96
        },
        {
            "text": "explain more once you find it. Thank you. There it is. Uh oh, yeah. F is the flashlight. I remember that. Yeah. Just get a feel of of where where the where the buttons are for you. Uh and typing on terminal. Uh I think we'll let uh you know Andy or or Mike do that or I can do that. We can definitely do that. Yeah, sounds good. Oh, some is this ammo on? Oh, so we're going purple ping, right? Uh yeah. Yeah, exactly. That's our way forward. Uh we need to secure the matter wave projector. That's our objective. We got it in the top left corner of the screen. Shout out to uh Vlad who's in the Twitch chat right now giving away some codes. Vlad, if you could if you could give do me a favor. Um maybe don't put the final letter of the code and then afterwards type like the final letter of the code is blah blah because I do know there's a thing of like Twitch bots that take the codes from chat. Yeah. Yeah, they just immediately get get kind of like swapped up or uh get, you know, they get pulled",
            "start": 527.76
        },
        {
            "text": "blah blah because I do know there's a thing of like Twitch bots that take the codes from chat. Yeah. Yeah, they just immediately get get kind of like swapped up or uh get, you know, they get pulled through. Great. Shout out to Vlad. Thanks, Vlad. Shout out to Vlad. Thanks, Vlad. All right, moving through here. Uh I think we're going to see some enemies past this point. So, uh yeah, let's open the door. Let's get the the All right, everybody stand in here and let's get the We're crouching, right? A lot of crouching and walking. How do I crouch? I can't figure out how to crouch. Um circle or right stick? No. You think so? this door left store. Yeah, that's the ping button. Hit the uh start and then go to uh settings at the top left. People are saying R2 game mapping. Hey, Kevin, you like the red crouch is action two, but like what the heck is that? What? People are saying R2, Mike, is that what you said? Yeah, that's what the chat said. I shot my gun. Shoot. I mean, you kind of not",
            "start": 591.44
        },
        {
            "text": "the red crouch is action two, but like what the heck is that? What? People are saying R2, Mike, is that what you said? Yeah, that's what the chat said. I shot my gun. Shoot. I mean, you kind of not crouch and my crazy guys not allowed to crouch. I I'm the crouchless class. Oh, shadow chicks just tricked us. That's why they're laughing down in the chat. Oh. Crazy. Okay, I see you. Tricking you. Craig, you tried R3? I have. Yeah, we tried R. I'll tell you what, the pistol design in this game, fantastic. I like that it takes up a lot of space. Cool looking. Really cool is the B button in this game. And you bind it to uh to maybe the ping uh rebind it uh to the ping button maybe or something like that. What? What? Uh let's see what also. Hi YouTube chat. Waking up the YouTube side of things. Hello YouTube. How are we doing on this lovely Wednesday? Hopefully you're enjoying the full day of live talk shows over here. Kind of funny. And hopefully you've made your way over to another piece",
            "start": 642.4
        },
        {
            "text": "Hello YouTube. How are we doing on this lovely Wednesday? Hopefully you're enjoying the full day of live talk shows over here. Kind of funny. And hopefully you've made your way over to another piece of live content that kind of funny as well. I kind of want to set it to uh R3 um left bumper. That's where like you type. Hi, friend. But I don't even know how I was I was moving between and weapons that way. Oh, left bumper. Yeah, you can cycle them. That's how I was. Oh, okay. Cuz it brings up the uh the terminal when I was doing that. Like you see like it brings up the typing down there. Oh yeah. Okay. What the heck is crouch on controller? Are your controllers inverted because of Nick? No. No. No. There's no like controller settings where you can see the layout. It says action two. Here. Let me let me do uh Have you tried hitting all the buttons? I have. You're so cool. Yeah. This is really unfortunate. I wonder if something happened uh since we switched between uh Dual Sense and then",
            "start": 702.64
        },
        {
            "text": "me let me do uh Have you tried hitting all the buttons? I have. You're so cool. Yeah. This is really unfortunate. I wonder if something happened uh since we switched between uh Dual Sense and then Xbox uh Midame. Uh hopefully that's not it. Oh wow. Check it out YouTube chat. The 10 Chambers team has come over to YouTube and they got some codes for you as well. Just like the PlayStation best friends. Very cool. Bruce Wayne Brady, thank you for the tier one sub for 39 months. Thank you Bruce Wayne Brady for supporting us here on Twitch. Might go out on your own. I'll do fine. You'll do fine. Victor knows. He taught me well. I could get out there. Yeah, I I get out. Well, I need moments with the team, but I'll get out there. I'll get out there on my own. I'll leave him. I don't Yeah, I don't I can't even like remap [ __ ] I want I think maybe something did [ __ ] up. We unplug the Do we want to quickly restart his game? Um I mean, I can try I can play with mouse keyboard if you want. No,",
            "start": 756.8
        },
        {
            "text": "I can't even like remap [ __ ] I want I think maybe something did [ __ ] up. We unplug the Do we want to quickly restart his game? Um I mean, I can try I can play with mouse keyboard if you want. No, let's try to restart. Don't Come on. Don't try to be cool right now. Be great. Let's re Let's restart the game. Everybody pause. Victor, we're going to restart. Restart it. Yeah. Okay. Let's exit the expedition. Exit my expedition. We're going to reset. That's the right thing to do cuz you know what? We're here to have make sure Greg has a real good time. He's so excited about this game. He's been talking about it non-stop. We almost play it last week. Greg vetoed that. We did almost play. He was not happy about that. I'm on the show. What are you going to play without? Yeah, we're going to play without him. We're going to play without him. And I was like, Mike, what are you doing? We're going to get our feet wet. We got to get back into it. But you know what? I had time with Victor. He",
            "start": 805.12
        },
        {
            "text": "play without him. We're going to play without him. And I was like, Mike, what are you doing? We're going to get our feet wet. We got to get back into it. But you know what? I had time with Victor. He taught me all the ins and outs, so I'm back. Inject back. I needed that. Let me see how low I get the lighting. Victor, what Red Bull do you got over there? I'm drinking the uh summer blue, the Juneberry. Uh this has been a been around for a little bit, but I like this sea blue edition. Uh yeah, it's just a regular Red Bull, but it's ice cold. Let me here for you. Okay, here we go. Here we go. Ice cold. Cracked it. There it is. Yep. You love the 11 p.m. Red Bull. That's That's a good Oh, yeah. Oh, 11 p.m. is right. Ah, here we go. We're having issues. Thank you to Vlad for gifting out some codes over to YouTube. Uh, Andy, if you need to go one-on-one with Victor, please let me know. But I can keep the conversation going with Victor in the audience. If you uh Let's just keep Let's keep it",
            "start": 847.76
        },
        {
            "text": "over to YouTube. Uh, Andy, if you need to go one-on-one with Victor, please let me know. But I can keep the conversation going with Victor in the audience. If you uh Let's just keep Let's keep it going. You sure? Yeah. And he's cooking. He's cooking right now. With the Xbox. So good. Yeah. Thank you to Vlad for gifting out those uh codes on both Twitch and on YouTube. If you get a code, make sure to say thank you and go out there and have some fun with your friends. Are we able to invite Greg right now? Uh I think me and Vlad already get backed out. Oh, you already backed out. My bad. Yeah, I I have a new lobby going. We got a new lobby. Okay. I'm honored, Greg, that you're playing mouse and keyboard for us today. Wow. You know, I feel you came all this way. I might as well try. Absolutely. I mean, it's going to definitely end with me dying a lot more, but I probably would have died anyway. I'll take care of you, Greg. I promise. Thank you. I appreciate that. All right. Invites have",
            "start": 894.8
        },
        {
            "text": "I mean, it's going to definitely end with me dying a lot more, but I probably would have died anyway. I'll take care of you, Greg. I promise. Thank you. I appreciate that. All right. Invites have been sent out to you and Greg. Andy and Andy. All right. And Andy, I just want to say thank you for the kind words about GTFO that you found it during the pandemic. That's really nice of you. Yeah. Yeah. We had a great time streaming it. We streamed it once on Kind of Funny and then me and Mike and uh some of our homies also streamed it at home. Yeah, we had a we had a good time. Sweet. Let me just get you something. Yeah, I appreciate it. Yeah, just uh you know, hook up on boosters and uh yeah, we got the Well, you know, I don't want to blame anybody here, Victor, but like somebody made me waste my boosters. So, you don't have any any left. I'm jacked up on both muted gold and aggressive boosters, so I'm good to go. I'm not going to blame anybody here. Somebody made me give up on my",
            "start": 939.2
        },
        {
            "text": "me waste my boosters. So, you don't have any any left. I'm jacked up on both muted gold and aggressive boosters, so I'm good to go. I'm not going to blame anybody here. Somebody made me give up on my boosters. Don't do it. Don't blame them. Let me just double check with my uh what my um All right, we're we're good to go. We're going to drop. I just don't want you I don't want you playing like Nick Greg where he moves his mouse 2 centimeters and he does like a 720. Got it. No, I don't want that. Yeah, it makes him really fast. Yeah, we're waiting for Greg to ready up. Oh, yeah. Go to uh lobby. All right, let's go. Let's do it. Let's do it. All right, let's start it back up again. Here we go. Another elevator drop. It's just got such a good like mood and lighting is great. Uh yeah, you know, it it takes you right into it. You boot the game up and it you're just in the rundown selection. The the there's no logos uh for for any like studio or even the game. I don't even know if GTFO is",
            "start": 980.64
        },
        {
            "text": "it it takes you right into it. You boot the game up and it you're just in the rundown selection. The the there's no logos uh for for any like studio or even the game. I don't even know if GTFO is like stated anywhere. Yeah, exactly. I'm like, do did we even put it anywhere? You know, that was that was early on. That was just like, oh, we want we we just wanted to bring the player like right into the experience uh immediately. I forgot about those computer terminals, Mike. Oh, man. Victor was on one with me earlier. It was awesome, bro. Yeah, it's it's fun to go back to remember. I love the doors where you have to follow all the patterns to unlock it. That immediately snapped in Andy when we were playing. And that's that's those are the mechanics I was talking about in Den of Wolves that has those moments too where it's like we need to stand in these three spots, you know, let's all like have these areas load or whatever. So, exactly to force the player around so they can't just like",
            "start": 1041.52
        },
        {
            "text": "has those moments too where it's like we need to stand in these three spots, you know, let's all like have these areas load or whatever. So, exactly to force the player around so they can't just like coop up anywhere. All right, let's just sprint around. We're playing Call of Duty. Yeah, get Greg uh familiarized with the buttons again. Make sure he's good. Uh it's Jesse asks uh what's Victor's role in 10 Chambers? Um I'm head of streaming and event tech. So I'm on the marketing side, but I started as as a office manager uh at the studio and then I was level designer for for a little while. So I've been around, you know, I got one expedition in GTFO. That's mine. That's awesome. Yeah, it's a run down seven. Remember, Greg, C is crouch. I'm already crouching cuz whoever who puts crouch on left control. We got to control. No, we put it on C. It's better. Wait, you're crouching on C? Yeah, that's I just Thank you, Victor. It's so much easier for me. Wow. Okay. Yeah. Yeah. outside of this.",
            "start": 1096.8
        },
        {
            "text": "control. We got to control. No, we put it on C. It's better. Wait, you're crouching on C? Yeah, that's I just Thank you, Victor. It's so much easier for me. Wow. Okay. Yeah. Yeah. outside of this. Yeah, you know, I'm just happy to be here. I'm not judging anybody. Especially for the games that got the run and the the sprinted slide, you know. Sure. It's hard to do the sprint to to control. It's easier for me to just like pinky on shift and then index on C. Yeah, I I immediately pivoted to this. Uh, hold up. I'm just going to go fix a thing here. Sorry to control the destination. It can take us somewhere. There's no virus, no creatures. I'll explain more once you find it. Oh, I love that you could also look at your homies and see how much ammo they have. Like, Mike, why are you taking that ammo? You have 98% ammo. I can pick up that ammo. So, sorry about that. I'm uh I'm late in the office and the alarm was about to go off. So, like a real life alarm that I had to, but I'm good to go",
            "start": 1149.6
        },
        {
            "text": "ammo? You have 98% ammo. I can pick up that ammo. So, sorry about that. I'm uh I'm late in the office and the alarm was about to go off. So, like a real life alarm that I had to, but I'm good to go for the rest of the stream now. Hell yeah. Sorry about that. Good. Oh, I've got Oh, winded from sprint. Okay. All right, boys. Open up this door. Let's go. So, again, the enemies are light and sound sensitive. Don't shine your flashlight at them. Don't hop around and sprint around them. A fully charged melee hit uh will take them out. Um a melee hit to the head. So you can hold down the left mouse button to charge your melee if you have it equipped. All right. You see when it's charged by the circle and the reticle will shrink when you're in range. So if the reticle shrinks down, you know that that's a hit if you release your your melee and he's just chilling. Okay, they're starting to Don't move. Stop moving. Stop moving. So when they start flashing red like that, Greg, it's don't move.",
            "start": 1207.12
        },
        {
            "text": "that's a hit if you release your your melee and he's just chilling. Okay, they're starting to Don't move. Stop moving. Stop moving. So when they start flashing red like that, Greg, it's don't move. Oh, you didn't even get to see it. That's scary. I was on mic. know they wake up and then they shriek and they wake everybody else up and you know you want to avoid a firefight in GTFO whenever possible cuz there are no ammo drops that you know the enemies don't drop anything so it's there's always a loss uh of you know red he's going red he's turning red Greg all right now we can keep moving and I also saw one way over here on the right hand side we could probably kill you know what Greg we going to melee this man maybe we melee him yeah just approach You'll see the reticle shrink. Dead. Dead. Nice job. There's also one over here at this door. I did a tutorial last week, Mike. And like at the tutorial, they just have a bunch of enemies kind of run at you. Man, I was [ __ ] scared. Wait",
            "start": 1262.96
        },
        {
            "text": "Nice job. There's also one over here at this door. I did a tutorial last week, Mike. And like at the tutorial, they just have a bunch of enemies kind of run at you. Man, I was [ __ ] scared. Wait until we open it up. It's going to happen. There's no enemies around here. But yeah, I guess we can go to this door first. Oh, you you tried out the tutorial in in GTFO. Yeah, I hadn't done it in a long time. Yeah. Yeah. Yeah. Yeah. All right. So, we're all in here now. Yeah. That probably should have should have been put in the game earlier. It was It's such a punishing game. So, yeah, we should we probably should have done it faster. I think it was in 1.0. It was in early access for 2 years. Who has the goo gun? Oh, I don't know. I don't I don't think we brought a goo sleepers alert them to hit this one. Andy, I don't like that said to do it. I watch the red. Get ready. Step up on the other ones then. Greg first Greg here. Oh, you need to fully charge it. Holy charged. Pull it down. We got",
            "start": 1311.28
        },
        {
            "text": "this one. Andy, I don't like that said to do it. I watch the red. Get ready. Step up on the other ones then. Greg first Greg here. Oh, you need to fully charge it. Holy charged. Pull it down. We got it. We got it. Did you wake up the Did we wake up the [ __ ] Who left the biotractor? Uh oh. I do. I do. Yeah. Tracker. Oh, there's just four in the next room. Okay. No. Okay. No one else woke up. Okay. No. Yeah, we're good. Four in this room to the right and then one kind of I guess over here on this flash on this door. Oh, it's like the bio trackers from Alien. Yeah. Yeah. All right. So, now stop for the tutorial. Yeah. So, how do I hold a button? Cuz I can't. If I touch the melee, he hits. Oh, no. No. Um, oh, if you don't if you the left mouse button, you hold it down. Andy's watching me. Yeah, there it is. There's that charge. Yeah. Yeah. All right. Let's see. Uh, you can't hold it down charged. Uh, so you have quick melee and then weak or hold melee. Yeah. Got exactly. So, you need to",
            "start": 1369.56
        },
        {
            "text": "there it is. There's that charge. Yeah. Yeah. All right. Let's see. Uh, you can't hold it down charged. Uh, so you have quick melee and then weak or hold melee. Yeah. Got exactly. So, you need to hold down a fully charged one and then hit the head. That that that'll take them out in one hit. The regular enemies. That is little hint right there. You want to hack the door? Hacking. Hacking, Mike. Oh. Oh. Oh, Mike. That's good, bro. Best. One of the best. That's good. I just love the hacking system. Best in the biz. Watch the lights. Watch the lights. Oh, yeah. [ __ ] Be careful. Now, this is a big room, so if we wake them up, we're going to wake a lot of them up. We'll try and take them out if they're in our way. Oh, right here. Right here. One right in front of me. Hold on. It's It's waking up. Oh, you hear like the little freaking Should I shoot you? The clicker stop. Should I shoot? Should I shoot you? Oh, stop buoy. Stop. Oh god. [ __ ] Yeah, I see him. I see him. Dead ski. And he",
            "start": 1425.68
        },
        {
            "text": "up. Oh, you hear like the little freaking Should I shoot you? The clicker stop. Should I shoot? Should I shoot you? Oh, stop buoy. Stop. Oh god. [ __ ] Yeah, I see him. I see him. Dead ski. And he got it. Good job, boys. Good job over there. Good kill. All right, let's see. Okay, I got one. And oh, let me bust out the biod cuz I see one here, but okay, that's the only one that's close byish. Damn, these stairs are steep. I don't know if it was a cliff or not. Yeah. Okay, so we'll let Greg uh Yeah, let me get it. I got another one. Yeah. Oh, I was going to hit in the ass. Good thing I put it out. Oh, thank god. Yeah, I have the Johnny Zazaki uh pose there. Oh [ __ ] Greg. Oh, well, I did what I said to do. You know, I hit you body. It was fully charged. The reticle shrunk. I don't know. Nobody's moving up top. I'm up top. Explain that so many times. You saw me do it, Kevin. Rewind the footage. I'm on the head. The thing shrank. Bam. Rewind it. Got to go. Check the tape, everybody.",
            "start": 1475.6
        },
        {
            "text": "Nobody's moving up top. I'm up top. Explain that so many times. You saw me do it, Kevin. Rewind the footage. I'm on the head. The thing shrank. Bam. Rewind it. Got to go. Check the tape, everybody. Rewind it. All right. You got one up there. You can do a retry on that one. I think he hit like the hit the clavicle maybe. And I'll get this guy for you, Kevin. Watch me. Yeah. Yeah. Watch. Get him. We're watching you. We're watching you, big Show us real good. So you want you want a clean head head shot, you know. Looking good. That's what you want. Oh, look at that. Look at that. Perfect angle. Wow. Look at that surgical precision. It's welcoming you. It's welcoming you. It's It's waiting for you. There we go. Got his ass. Got his ass. See, Greg, it was easy. You got him. And celebrate one shot. Oh, Greg. Greg, behind Greg. Why would you do that, Greg? You [ __ ] idiot. People want to see how the game works. People want to see how the game works. Oh, [ __ ] It's called get the [ __ ]",
            "start": 1539.36
        },
        {
            "text": "shot. Oh, Greg. Greg, behind Greg. Why would you do that, Greg? You [ __ ] idiot. People want to see how the game works. People want to see how the game works. Oh, [ __ ] It's called get the [ __ ] out. It's not called walk around, crouch all day long. Yes, it is. Let them know. Greg, are we here to have fun? Are we making a stream? Are we having fun? You know, Andy, I wanted to see how the game works. Thank you, Kevin. Kevin's always got my back. Mhm. Thinking about the entertainment value. I'll just take you out. Of course. All right. Nobody else is a wild attacker. We're safe. Should I shoot Andy, Kevin? No, don't shoot. I don't think there's friendly fire, Greg. I think if you shoot him, it's fine. Yeah, he said very He said at the top there's friendly fire. No, you know, a contest. If you want to see me tomorrow and the rest of the week, remember that one time? Tough time. We pushed him to the limit. What game was that? Rainbow. Oh yeah, that's right. Shotguns. What you say?",
            "start": 1587.92
        },
        {
            "text": "If you want to see me tomorrow and the rest of the week, remember that one time? Tough time. We pushed him to the limit. What game was that? Rainbow. Oh yeah, that's right. Shotguns. What you say? Okay, we have a baddy over here some. Oh, I can't ping. No. God dang it. I can't I can't ping. Don't wake them up. AR. Right. Did we clear out this room? No, there's one right there's one right in front of Greg, but I can't ping it. I see him. I see him. I got him. Don't worry. I'm He's doing red. Don't move. Who's moving? Mike, you're so far away. I'm so far. I'm not the one moving, that's for sure. I got overwatch. Oh, he's really waking up. Yeah, Greg. Nice. In one shot to celebrate. Oh my god, he's [ __ ] Christ. Clear room. Clear. Wild card. Andy, sorry. Nick isn't here to hold your hand and wipe your ass. Andy, get ready for game play. Okay, you got to celebrate. You know what? You don't get any more melee shots cuz I noticed a pattern of a celebratory shot after you. Oh god. One shot",
            "start": 1631.12
        },
        {
            "text": "wipe your ass. Andy, get ready for game play. Okay, you got to celebrate. You know what? You don't get any more melee shots cuz I noticed a pattern of a celebratory shot after you. Oh god. One shot to celebrate. Oh god. This is going to be us now. Right there. I like that. Andy, you should use the hammer. It uh it's like stealth kill. Oh, for the ones that are running at me. Yeah. It's not stealth. Yeah. To conserve ammo if you can. You know, if there's like one or two left, you can just take them out with a melee. You see any? I got the high viz flashlight. That's bright. Yeah, that's cool. Yeah. Got the power of the sun in your hands. The palm of my hand. All right, here we go. Oh, I'm closing the door behind us. 76 health. What? When are you all killing or I fell down the stairs? Oh, nice. I took damage. Uhoh. Uh-oh. There's a lot of people. Holy [ __ ] this room. Oh, it's a full room. It's a full My god. Now, Greg, we're not celebrating in this room. One shot to celebrate. Kevin,",
            "start": 1700.24
        },
        {
            "text": "I took damage. Uhoh. Uh-oh. There's a lot of people. Holy [ __ ] this room. Oh, it's a full room. It's a full My god. Now, Greg, we're not celebrating in this room. One shot to celebrate. Kevin, you say the word and I'll celebrate. You got to do something great. Sleepers. Sleepers. Be careful with your flashlights. So, Oh, yeah. [ __ ] That's right. A lot of baddies. Yeah, there's like Holy crap. Okay, there's like Oh god. Like nine of them at least. No, I two three four five six. Maybe they're in the next room, but there's a lot here. What happens, Greg? Yeah, Greg, would you like So, if I melee one, like right in Victor, I'm looking at Victor's screen with me. If I melee one of the two that are next to each other, does that make enough sound for the other to know or is that still silent? Uh, no. They they usually wake the death streak can wake close by nearby enemies up. So, we can do like simultaneous takedown. Got it. Oh, that's cool. We should definitely try that. Try that. All",
            "start": 1754.24
        },
        {
            "text": "Uh, no. They they usually wake the death streak can wake close by nearby enemies up. So, we can do like simultaneous takedown. Got it. Oh, that's cool. We should definitely try that. Try that. All right. Movie. Let me let me let me behind you. Uhoh. Uhoh. Did I The guy behind you? The guy behind you woke up. Oh [ __ ] I'm so sorry. That was me. Celebratory shots. God. Greg. Yeah, Kevin. You did the right thing. Greg, they woke up. What were you supposed to do? I I don't know why I'm in trouble. Why is he in trouble? He's in He's getting mad at me. My health's at 46%. Why is that? So weird. I There was a lot of action. I wasn't sure where the zombies ended and Andy began. We can't be doing this already. Just so you're just so you're clear. There was He was There was a lot of action, but he wasn't aiming at the enemies. Oh, I know. I know that there was no enemies that hit me. Must have stubbed my toe. The door uh to the to our way point uh has an alarm time to it. So if you try to pull",
            "start": 1800.88
        },
        {
            "text": "wasn't aiming at the enemies. Oh, I know. I know that there was no enemies that hit me. Must have stubbed my toe. The door uh to the to our way point uh has an alarm time to it. So if you try to pull this this this lever here, an alarm will sound and we'll have to you know stand walk around and and you know stand in these circles to to override the alarm. Enemies will spawn and uh you know come at us. If we press the tab button everybody we can check the map. So this is the door we came through. Oh look you can draw this. So we can have they're they're going to come through either here and down here. God. Okay. So, we can put mines. If anybody brought mines, we can put mines at the doors. I have mines. I would put mines at the doors. Yeah. Uh, so they break down the door. Oh, there we go. Yes. Yep. Obligatory. Uh, no. Genitalia. Yeah. Would you like that? Heck yeah. Heck yeah. I uh I healed everybody as well, so we got a little boat. I put up a sentry down there. Uh, we can have a",
            "start": 1855.12
        },
        {
            "text": "go. Yes. Yep. Obligatory. Uh, no. Genitalia. Yeah. Would you like that? Heck yeah. Heck yeah. I uh I healed everybody as well, so we got a little boat. I put up a sentry down there. Uh, we can have a sentry. Uh, maybe here. I just put down this corridor here. Uh, did anybody bring uh Let's see. I just got the bio. You got a sentry. I got a burst sentry. Yes, I do. If you press four on your keyboard. Yeah. And then look down on the ground. Yes. Do you want Where do you want it? Uh, just Yeah. Right there where you're standing. Perfect. Dropping it. Yep. Look at that. That sentry is going to shoot at enemies uh whenever it enters their line of sight. It's visualized in the laser there. So, make sure to pick that up once we're done in this room. Are do our flashlights have an energy on them? Battery. Battery. Yeah. Okay. We're not the Halo one master chief. All right, we're ready to rock. Let's do this. All right, I'm pulling it. Here we go. All right, everybody. Everybody in the circle.",
            "start": 1905.12
        },
        {
            "text": "Battery. Battery. Yeah. Okay. We're not the Halo one master chief. All right, we're ready to rock. Let's do this. All right, I'm pulling it. Here we go. All right, everybody. Everybody in the circle. Yeah, here we go. Secure the scan. Andy, don't shoot I will. And uh motion biot tracker. Can we get some tags on on Oh, yeah. Yeah. Yeah. Well, I don't know how to tag. I mean, I don't really see Oh, hold down the left. Hold down the left as soon as you see red dots. Oh, okay. You need to hold it down for it to charge up. And then you tag them for all of us. And the turret turret. Uh-oh. Yeah, they're coming from down there. So my turret is doing a little bit of in the mouth, but that's, you know, it's randomized for everyone. They can come from upstairs like you never really know. Yeah, there's some more upstairs. Oh, I think the turret got that. Or maybe Yeah. Can you Can you tag them for us if you see them? Yeah. Yeah. Yeah. [ __ ] Getting their asses. There we are. Easy peasy. Doors",
            "start": 1964.4
        },
        {
            "text": "some more upstairs. Oh, I think the turret got that. Or maybe Yeah. Can you Can you tag them for us if you see them? Yeah. Yeah. Yeah. [ __ ] Getting their asses. There we are. Easy peasy. Doors complete. Good. Nice work. Nice work. Everybody up my mind. And we didn't even have to go sit in all the the other security spots. Oh, there's a lot of people in the next room, by the way. Oh, yeah. and and uh for for the for the the gear and and uh dental wolves that can kind of be reclaimed from further further away. So that's been um you know streamlined a little bit for our next game instead of go walking back and like oh let's pick up the turret. Let's little RC car that drives it back. Maybe it's like the Alex gloves. You kind of flick your your wrist and it's like you're just in your hands immediately. I don't know. No, I don't. Sleeper right there. Don't screw it up, Andy. There's a lot. You know how to do this, right? Are we going to co-op melee him? Yeah. I'll make it happen. Can you",
            "start": 2017.12
        },
        {
            "text": "I don't know. No, I don't. Sleeper right there. Don't screw it up, Andy. There's a lot. You know how to do this, right? Are we going to co-op melee him? Yeah. I'll make it happen. Can you mark him? Uh, no, cuz they're not moving. Uh-oh. Uh-oh. Watch out there. Yeah, he's I'll take the one on the left here. Oh, he woke up. He woke up. [ __ ] Oh my god. Got this one. I think we're good. Yesesh. Baba. So, we need to uh input the command there. Uh query matter projector. I can do that uh in the Oh my god. A raptor. It's me. I'm not as good as my first time. There's a health right here. If anything, if you guys want to hit enter on the command here. Oh, great. Go come get the help. I put the I put in the command there. Enter. Someone want to approach the terminal. Health. Yeah. Go up to that terminal. How do I turn on my flashlight? Uh F. Oh, F. Yeah. For flashlight. All right. What's What's the computer thing? What is it? Uh, hit enter. Just hit enter there. Oh, [ __ ] Nice. There we go.",
            "start": 2080.8
        },
        {
            "text": "How do I turn on my flashlight? Uh F. Oh, F. Yeah. For flashlight. All right. What's What's the computer thing? What is it? Uh, hit enter. Just hit enter there. Oh, [ __ ] Nice. There we go. I prepared it for you. It's cool typing it in, though. It feels cool. He's typing it in, bro. He's typing. All right. Now, I have a health kit. All right. So now if you click when you're when it's up I think if you left click while it's up then you act and you use it. Yeah. And not look at anybody. You can use it on yourself. Just hold hold on. Oh E. Sorry. My bad. Thank you. E for use. There we go. E for everyone but you sharing. We need to go to zone 73. All right. So the past security door we just passed before this was a checkpoint. So, if we fail after this point, we can we can reload the checkpoint from here. Oh my god. Oh, it's nasty. Got to get real spicy. Uh Andy, I see you need some some uh some ammo. I'll give you some ammo here. Oh, thank you. Damn. I just have it. Look at that. That's",
            "start": 2142.32
        },
        {
            "text": "from here. Oh my god. Oh, it's nasty. Got to get real spicy. Uh Andy, I see you need some some uh some ammo. I'll give you some ammo here. Oh, thank you. Damn. I just have it. Look at that. That's crazy. Let's try and clear out the room. Uh we're looking for the Still looking for the Maway projector in zone 73. So, look for doors that lead to zone 73. Should we take out these dudes first? Mhm. Little co-op take down. I'll take out the floor one. Okay. I'm going to the standing one. Coming to you guys. Hey, I touched it. Okay. God damn it. I got my guy. I got it. Fell me. Look at you. What a pro, Greg. Thank you, Kevin. Oh [ __ ] Victor, I shot you in Oh my god. I killed Victor. I felt that. I killed Victor. Behind you. Behind you. You killed our guest. You shotguned him in the leg. No, I I watched it happen. I was busting out I was trying to bust out my uh the radar thing to left click and tag him. Save him. Bleeding out over here. Bleed him out. Get him. I got him. Arrest him. Well,",
            "start": 2196.16
        },
        {
            "text": "I watched it happen. I was busting out I was trying to bust out my uh the radar thing to left click and tag him. Save him. Bleeding out over here. Bleed him out. Get him. I got him. Arrest him. Well, he wasn't even dead. Oh, wow. There it is. Oh, there we are. I was like, the next item is my radar thing, but it wasn't. Got zone 75 over here, so not the left. All right. Yeah, we got a door over there and we got a door over there. 72 over here. Yeah, we're looking for 73. 72. Oh, we got some lockers here. Let's open up these lockers. Seemed like you took care of the threat, though. Now we own this place. This is 73. I found 73. Yeah. Greg, you're so good at this game. Like riding a bike, Ke. Yep. So, we we need a key card to unlock the door. I'll go back and check for key 466. Victor's now going to go back to the terminal, type it in, and he'll be able to ping it for us. Oh, yeah. That's just so cool. Yeah. You type in like search key or whatever the hell and it pops up on our radar.",
            "start": 2248.56
        },
        {
            "text": "going to go back to the terminal, type it in, and he'll be able to ping it for us. Oh, yeah. That's just so cool. Yeah. You type in like search key or whatever the hell and it pops up on our radar. It's qu key gray 466. That's so sick. All right. Gray with a E. Is that like a Is that the American spelling? I don't know. I think we mix it up. We sp Yeah, the color gray was the A, but I think like Grey's Anatomy Meredith Gray the last name the name. Yeah. 72. Zone 72. Top side. Right here, right? North. Oh, yeah. Yeah. Okay. Pulling out your map. Mike, that was cool when you said top side. Yeah, top side. Congratulations. I'm happy to announce class 3 alarm here. Okay. Big fight. That means Please be excited. Oh, somebody Andy, why would you do that? I wasn't ready. Everybody in the scan. Everybody in the scan. I was typing my Nick in the chat. I'm sorry. No. Why? I need to put these up. It's levity. All right. Put the Greg, put your They're coming. They're coming. I'm going to die. I'm",
            "start": 2315.92
        },
        {
            "text": "in the scan. I was typing my Nick in the chat. I'm sorry. No. Why? I need to put these up. It's levity. All right. Put the Greg, put your They're coming. They're coming. I'm going to die. I'm going to die. Can we get turrets down, Greg? Put the turret down. I'm down. And I'm down as well. Holy crap. [Applause] Oh my god. We're doing great. We're doing great. Oh my god. Oh, we got to run to the other thing. Oh [ __ ] Yeah, you need you need to be in the scan. You need to be in the scan to turn off the alarm for for the enemies to stop spawning. Tag the enemies with your motion tracker. Use uh down turrets. I got Victor. I got Victor. Just shoot. Just shoot. If you can't resto the other thing. Pull your lives together. Pull your lives together. Ammo. We got scans on the other side. Get to the other side. Quick, quick, quick. Tag the enemies, please. I'm in my zone. Andy, tag the enemies. Tag the goddamn enemies. Holy [ __ ] Somebody get in this zone. Oh, the other the fourth one right",
            "start": 2368.0
        },
        {
            "text": "the other side. Quick, quick, quick. Tag the enemies, please. I'm in my zone. Andy, tag the enemies. Tag the goddamn enemies. Holy [ __ ] Somebody get in this zone. Oh, the other the fourth one right here. Hurry up. Scan complete. Scan complete. We just need to survive now. Come on. I'm going to die. The door. We can do this. I have no ammo. I have no ammo on. They're afraid of the guns. If they see the gun, they'll think you have ammo. Use the hammer. In the grass. Oh man, look at that. That was That was good. Oh my. That was easy, guys. What happened to preparation? You know, some you got to just pull it. Wild card. I'm sorry. Sometimes you don't just have one. And Nick, you know, Greg got me excited. You know, Greg got me. GTFO. GTFO. It's not called Mary walked her lamb to school, Mike. All right. Get the [ __ ] out of here. Lamb chops. You know what I mean? Pretty good. Love a lamb chop. Okay. Okay. We want to sneak through this portion. Believe me. Oh [ __ ] We sure want to. We",
            "start": 2420.72
        },
        {
            "text": "All right. Get the [ __ ] out of here. Lamb chops. You know what I mean? Pretty good. Love a lamb chop. Okay. Okay. We want to sneak through this portion. Believe me. Oh [ __ ] We sure want to. We just need the key card. Okay. Cuz there are some big dudes here that we don't want to wake up. Got sleepers. I see a terminal. Uh, I think it's turn. Yeah, I'm right behind you, Victor. Those guys have gone to Stop. Stop. Stop. Andy, let's go hit this guy in the head. I'm way on the far right. Oh, you're right here, too. Oh, [ __ ] I'm getting my bat. I'm going to go hit this guy in the head. Don't tell the others. Oh, great hit. Great hit. Great attack. Turn off your flash. Key grade 466. I'm going to ping the key. There's two over here. There's two. Okay. Yeah, ping that [ __ ] I'll go for Crouchy. Crouchy. You go for Standy Standy. Okay, Andy. Be careful. Yeah, but Dra 466. Stop. You got to watch Andy. You got to watch. I've been playing the game. I know how to play the game. Andy, I",
            "start": 2479.84
        },
        {
            "text": "Crouchy. Crouchy. You go for Standy Standy. Okay, Andy. Be careful. Yeah, but Dra 466. Stop. You got to watch Andy. You got to watch. I've been playing the game. I know how to play the game. Andy, I know, but like I don't know their range. Don't worry. I got this. Where is it? Look for the ping. Look for the ping, boys. Oh, Andy, there's a guy behind me. It's left side. Things aren't good. Things aren't good, guys. Craig, there's a guy Andy. That's on me. You got the bioactor. You got to call that out. No, he can't see him unless they're moving. I lost Victor. There's Victor. Oh, this is the big guy. This is the big guy. Why would you do that? Oh god. Oh, there's two of them. Okay. Well, you doing all right. Listen, there were a lot of mistakes made by Andy, but I don't know for it. He could have told me the guy was back. I didn't know. I didn't know. I was just so scared. I was focused on the other guy. It's crazy. He has a bio. What if I crouch? Will he see me? Victor's shotguning",
            "start": 2530.56
        },
        {
            "text": "have told me the guy was back. I didn't know. I didn't know. I was just so scared. I was focused on the other guy. It's crazy. He has a bio. What if I crouch? Will he see me? Victor's shotguning people. It's pretty sick. Victor, I'm sorry that we Oh, Mike, you're still out of ammo. Oh, yeah. Go check out Big Corpse. Maybe he has ammo. Who is hurting me? Greg, I'm resing you. Oh yeah, you still have a bat. A hammer. Oh yeah. Holy [ __ ] We survived that. There's no way. So good. If there was a guy behind Greg, I had no way. I should look I'm not going to say I shouldn't be the radar guy. I I can't take that responsibility. Greg, you want me to? Greg, if I ever walked into your house and you were like, \"Hey, can you look after Ben?\" I'd be like, \"I can't.\" Yeah. Yeah. You know, you're not a radar guy. Mike, I think you'd make a great radar. Thank you, homie. Uh, the ping was over here to the left. Set up the ping again. Okay, perfect. Up the ping again. Oh [ __ ] Okay. Oh, there. Okay,",
            "start": 2574.24
        },
        {
            "text": "radar guy. Mike, I think you'd make a great radar. Thank you, homie. Uh, the ping was over here to the left. Set up the ping again. Okay, perfect. Up the ping again. Oh [ __ ] Okay. Oh, there. Okay, there it is. Yeah, there it is. In the other room. Yeah, it's through the door there to the left. We set a turret down right now before Andy pulls the thing. Should we? Well, no. We have to go in the room, right? Well, yeah, but won't that is There's no alarm in this one. Only one way to find out. Walk up to the door. Got an alarm, boys. Wild card. I'm not the one next to the door yet. I'll open it. There's a text to text communicator. Oh, no. You're good. You're good. It doesn't It doesn't have a lock. You're good. Okay. No, that's that's a light door. Yeah. Oh, careful with the lights. Oh, that's the enemies up. Big guys to your right. The enemies up. Holy [ __ ] Massive guy to your three enemies. Stop moving. Stop moving. Stop moving. Three. Tag them with the bio. I can't I can't see",
            "start": 2617.2
        },
        {
            "text": "that's the enemies up. Big guys to your right. The enemies up. Holy [ __ ] Massive guy to your three enemies. Stop moving. Stop moving. Stop moving. Three. Tag them with the bio. I can't I can't see anything. I can't tag. You're just saying things are over there. I can't tag them unless they're chasing us. That's when I tag them. You remember in Ernest goes to camp when he just recited that thing if the warrior was true the arrow wouldn't hit him. That's how I feel about this game. I'm going in. Wait. Going in where? I'm so proud of you. Go in. Quiet. I mean Andy can't give me any information. So I just got to your right. It's like right here. Yeah, that's where they are. Probably here. It's probably in here. Oh yeah. Oh my god. Stop flashing your light. Kevin, this whole thing is overblown nonsense. All right. No, they're right here. They're right here. I I just kept ping them. Well, yeah. You can't ping them because they ain't moving. No, you you can only ping moving enemies. No,",
            "start": 2658.4
        },
        {
            "text": "nonsense. All right. No, they're right here. They're right here. I I just kept ping them. Well, yeah. You can't ping them because they ain't moving. No, you you can only ping moving enemies. No, but like even my middle mouse won't let me like No, you you can only ping uh the middle mouse ping. That's only for doors and terminals and resource markers. Oh, okay. Gotcha. Big guy sitting on top of our uh there's a big guy who's literally standing on top of our key card, boys. Oh, great. Big big old versions of GTFO had we you could ping enemies, but that just ended us ended in players just clicking middle mouse button all the time. Yeah, it's like Apex Legends all over again. He's uh he's guarding the box. There's a big northwest corner 315. I can I can hit that lock. I have a lock meter so I can I can silently melt that lock. You ready? You want to see him, Andy? You ready? Yeah. I'm scared. Boom. That's him right there. That's where our key card is. Oh, the tall dude. Yeah. Uh, no it's",
            "start": 2700.08
        },
        {
            "text": "can I can silently melt that lock. You ready? You want to see him, Andy? You ready? Yeah. I'm scared. Boom. That's him right there. That's where our key card is. Oh, the tall dude. Yeah. Uh, no it's not. It's probably that one over there. Oh, yeah. No, that's the one we're looking at. Yeah, you're looking at or this one. And I have multiple lockers. Look at Look at our boy. Oh, that's a big boy. Big boy. Uh-oh. I only see that one. He's the only one though. This part is racing. Uh, yeah. No, nothing here as well. That could be the Red Bull. The 11 p.m. Red Bull. I just fell off a cliff, Mike. That could be. Yeah. Yeah. That might be the 11. I I just fell into a hole. Sound good. Andy is now downstairs in the basement. I didn't know this was a hole. Best of luck to you as we are we're now leaving. We're going to return to 74 73. You're probably better off without that to be honest. Andy, I got a glow stick. Do you want me to throw it to you? Uh-oh. Oh my god. What happened? Everybody",
            "start": 2746.16
        },
        {
            "text": "leaving. We're going to return to 74 73. You're probably better off without that to be honest. Andy, I got a glow stick. Do you want me to throw it to you? Uh-oh. Oh my god. What happened? Everybody run. Oh my god. Oh [ __ ] There's one downstairs. You can't jump that high. Ammo. I'm dead. I need ammo. You need ammo. Yeah, I need ammo. I desperately need ammo. Oh my god. He's behind me. Oh my god. Hit him with your hammer. You got ammo. You got there's two of them. This Mike, this is your moment. Go revive. Go. No. Go revive. No. Don't revive. Kill him first. Mike, you're doing great. You're doing so well. No heads on him. No heads. That usually 10%. Switching to pistol. Final 30 rounds. Got him. He's a goat. I'm going down. I'm going back to find the boys. Don't jump down. Don't jump down to Greg. Don't jump down to Greg. I thought it was a half wall, but it was a big wall. Oh, you fell down, too. I was running and it was like all hell broke loose. I just jumped. Yeah, that's the",
            "start": 2788.88
        },
        {
            "text": "down to Greg. Don't jump down to Greg. I thought it was a half wall, but it was a big wall. Oh, you fell down, too. I was running and it was like all hell broke loose. I just jumped. Yeah, that's the right call. Greg, you always jump. Got to jump. He died. You always jump. Figure it out in there. around four feet. Andy's pinged nothing. I don't know what. What do you want me to do? I can't. Don't revive me. But like, look at us. We survived. We did. We did. You know what I mean? Like, we did it. We're fine. I'm down. 20%. An ammo box in the key card box. So, that was just That was That was special right there. You big moment. So, how many blow hammer blows to take down the big boy? Um, if you hit them in the back, uh, it's three or four. Yeah, but there's no honor in that. Something like that. Yeah, exactly. True. I dress them like a man. Depending on what melee it is. If it's the hammer, I think it's three. I love the hammer. Now, Greg, why did you choose a bat? Uh, that was",
            "start": 2848.88
        },
        {
            "text": "like that. Yeah, exactly. True. I dress them like a man. Depending on what melee it is. If it's the hammer, I think it's three. I love the hammer. Now, Greg, why did you choose a bat? Uh, that was pre-selected and it kind of reminded me of like the dildo bat from Saints Row. I was like, \"Yeah, I can see that. I can see myself holding that. I don't expect what he's going to say sometimes. Well, I mean, if you look at it in the shadows, it gives off that kind of option. Mike, step back. I'm going to swing. Step back, Victor. Hit me. Everybody, you ain't going to hit me. I'm going to door 73. Let's go. I'm on the move. Let's play here. We'll play a game. Mike, I'm going to come hit you. Okay. No, stay away from me, Mike. Stay away from him. There's no friendly fire on melee. Oh, that's great. That takes away the fun. God. Does Does All right. Hey, there's a lock here. Does it shake them when you hit them? Is that an alarm, Victor, or is that just a normal lock? That's a normal lock. If",
            "start": 2901.04
        },
        {
            "text": "That takes away the fun. God. Does Does All right. Hey, there's a lock here. Does it shake them when you hit them? Is that an alarm, Victor, or is that just a normal lock? That's a normal lock. If you approach it, you can see it. Like, if there's no red text, there's no alarm. It says start security sequence. But also, real quick before we do this, there's a door right here that hasn't been open. That's what we came. I wasn't sure if there was like ammo in it or anything. Damn. All right. Ready? I'm going to hit it. Three, two, one. Oh [ __ ] ammo. I need someone. That's I need ammo. Um uh we need Andy up in here. Uh Mike, thank you, Victor. Saving the day. I got some glow sticks. I got glow sticks, too. Should we deploy them? Those are cool. The glow sticks are cool. What do they do? Can we throw them and the monsters chase them or? No, you just throw them kind of like near the monsters so you could kind of light your way so you don't have to like throw your flashlight. Got it. Or",
            "start": 2942.08
        },
        {
            "text": "we throw them and the monsters chase them or? No, you just throw them kind of like near the monsters so you could kind of light your way so you don't have to like throw your flashlight. Got it. Or they're not affected by a glow. Got it. Thank you. It's not UV light. Glow sticks are cool. Are they? Yeah. Not enough glow stick love in life. Yeah. There hasn't been also there hasn't been enough like technological advancements with that. Remember when kids were cracking the gold sticks and getting it in their mouth and stuff and then their mouth would shine? That's pretty cool. I don't think anybody outside of Colorado and Taho. People were doing that, dude. That raves all the time. We need more like nuclearpowered ones that last for No. No. You know, a couple thousand years. I don't know about that, Kim. That's Can you imagine a glow stick right now? It's like, oh, yeah. It's the go. My grandpa gave it to me. Yeah. 5,000 years. He was a boy. Pick up matter protector. This is it. Yeah.",
            "start": 2991.36
        },
        {
            "text": "that, Kim. That's Can you imagine a glow stick right now? It's like, oh, yeah. It's the go. My grandpa gave it to me. Yeah. 5,000 years. He was a boy. Pick up matter protector. This is it. Yeah. Should I pick it up? Cuz I don't have any ammo. Sure. Cuz I think when Yeah. Oh [ __ ] Andy, what did you do? Uhoh. What was that? Oh [ __ ] What happened? Why would you pick up the objective? Teleported. Oh. Oopsie. Andy, you got to stop touching the thing. Did you put it back? This looks like a nice place. All right, follow the way point. Send the battery away projector to uh Schaefer, our guy over the radio. Is he named for Tim Schaefer? If he is Tim Schaefer, yeah, I was Is he named for Tim Schaefer? Uh, no. That would have been cool. Uh, Tim Schaer love. I mean, he's still in dangerous territory. He is sue happy. He'll sue people on suing people lately. Y making stuff up about our friends. Yeah. Maybe I'll check with the narrative team. Maybe it is uh you know it could be. Do you ever sue",
            "start": 3032.96
        },
        {
            "text": "He is sue happy. He'll sue people on suing people lately. Y making stuff up about our friends. Yeah. Maybe I'll check with the narrative team. Maybe it is uh you know it could be. Do you ever sue the Scaravan people, Mike? You know what? I I I think they're pending right now. I think that the the email's been sent. Slide that in. All right, here we go. Insert matter wave projector. Nice. Okay, we're done. We need to just head to the exit of this. So, uh, once we pull the alarm here, if you approach it, you can see that there's a warning error alarm. Um, we can't turn that off. So, we're going to have to, uh, just run and, uh, avoid the enemies. That's easy. Wait. If you guys want to follow me, uh, once we open it up, uh, cuz, yeah, we're going to be in a hurry. All right, let's go. Let's do it. Here we go. I got glow sticks for fall damage. Throw it throw them at enemy. Fall damage. Yeah, be careful. So, flashlights on on this then. Flashlight's on. Yes. I'll give them the big",
            "start": 3091.68
        },
        {
            "text": "Let's do it. Here we go. I got glow sticks for fall damage. Throw it throw them at enemy. Fall damage. Yeah, be careful. So, flashlights on on this then. Flashlight's on. Yes. I'll give them the big flashlight then. Oh my god. They're behind us. They're behind us. They're coming up. I put down mines. Andy, that was a great mine. Oh my god, Greg. You almost fell right there. Hey man, I got I know the game's tricks now. I know what it's expecting of me. Can we get another mine behind this door? Close the door. Everyone through. Yeah. Here we go. Another mine. Great mind. Go, go, go, go, go, go. Was there supposed to be bad guys coming? Oh, they're coming. Oh, they're coming. Oh, they coming. We're like too fast. They're not on my radar, but we're going keep going, Victor. Don't worry about Andy. Okay, okay, go. Big flashlight. Opening the door. Worry about me. I'm in the front. Everybody in. So, you shouldn't worry about through. He got you, Andy. I don't think they're breaking through.",
            "start": 3144.16
        },
        {
            "text": "Okay, okay, go. Big flashlight. Opening the door. Worry about me. I'm in the front. Everybody in. So, you shouldn't worry about through. He got you, Andy. I don't think they're breaking through. They're not. They're not there. See any bi? No. That's great. That means they're coming here. They're definitely here. Andy, mark them. Mark them. I am. Oh, good. Let's go. Let's go. Door is opening. Door's opening. No, your turret, Greg. I got my turret. It's down. No, I Well, you left it. I need to kill the guys that are chasing us. Another mine here, please. mine. Oh, too late. Too late. Okay. No, we got it. I'mma die. Too slow with the bike. Too slow with the bike. Leave me behind. Okay. Okay. Holy [ __ ] We crushed it. Oh, okay. Well, they're going to come through. I didn't necessarily crush it cuz I don't have any ammo to do anything. Okay. Get your hammer out. Get your hammer out. We're making a final stand. We're making a final stand. You have ammo. Andy, you have Oh [ __ ] I have",
            "start": 3195.04
        },
        {
            "text": "it cuz I don't have any ammo to do anything. Okay. Get your hammer out. Get your hammer out. We're making a final stand. We're making a final stand. You have ammo. Andy, you have Oh [ __ ] I have ammo. I'm down. I'm resing you, Greg. Thank you, Andy. I got hit. I'm dead. I died. Sorry, Victor. No. That close. We were close. You just bragged real hard. We were close. Oh, we were Oh, man. Did we fumble that exit scan? God, we fumbled it so hard. You know, I would say we were at like 78 or something. 78% or something. I would say there was a lot of steps along the way that could have been avoided. Oh, do you think there were some other moments where we might have fumbled the bag? Yeah, I'm not looking at you, Mike, but Yeah, you can't. Well, you can't look at me on this one. That's for sure. Watch yourself. You know, you can't look at me. Uh, okay. I don't get get this bio tracker out of my hands. I'll be the bio tracker guy. be the mind. Make Craig do it. No, no. I'm great with the",
            "start": 3259.36
        },
        {
            "text": "Watch yourself. You know, you can't look at me. Uh, okay. I don't get get this bio tracker out of my hands. I'll be the bio tracker guy. be the mind. Make Craig do it. No, no. I'm great with the turret. I know what I'm doing. I like the foam gun. No, I'll go burst sentry. Okay. Sentry is a good Yeah, sure. Sure, sure, sure. I like sentry. Sentry. Sentry. I can do the mine then. Okay. Yeah. I feel like I would really like Mike had the the mind deployment moment right there. I feel like I would really really just choke in that moment. You don't think you'd excel there? That that content under pressure? just really really going to the restroom. Miller, I'm leaving on you. Sounds great. Lead player. It's me. Number one. He's our number one. Lead player. Uh let's see. Expect that last guy to spit at me like that. That's what killed me. Big plays. Yeah, that was uh the warm-up. Uh now we dive into R six C1. One of my favorite expeditions in this uh miserable game. Here we go. Got the",
            "start": 3312.32
        },
        {
            "text": "to spit at me like that. That's what killed me. Big plays. Yeah, that was uh the warm-up. Uh now we dive into R six C1. One of my favorite expeditions in this uh miserable game. Here we go. Got the revolver. Mike, which pistol you using, Mike? You using like the pistol? I like the regular pistol. Yeah. Yeah. I just love the look of it. I like the feel of it on the shots as well. There's some good feedback on that, dude. The DMR and Denn Wolves. Real good. Oh yeah. Oh crap. Just that single shot. Says, \"Oh yeah, he says.\" Yeah. The pistol as well. From soft. Thanks for the raid from soft serve. This is such a scary open. Yes. Very cuckooy. Very uh I have another code about to go out into the Twitch chat. The last letter of the code is the first letter in Tim Schaer's name. Don't get a suit again. Okay. Oh yeah. You got to be very careful with him. There it is. The last letter. tea. They say in the summer he likes to sue. He's in the corn fields trying to just prowling out there. Tim,",
            "start": 3364.24
        },
        {
            "text": "again. Okay. Oh yeah. You got to be very careful with him. There it is. The last letter. tea. They say in the summer he likes to sue. He's in the corn fields trying to just prowling out there. Tim, we got to make this video game. I'm getting ready to sue someone. Guys, got a long range flashlight. Oh, yeah. That shit's sick. All right. So, for this mission, we're uh we have to find three data cubes. Okay. Our goal is to go to hack this one. Hack it up 147. Checking out. We got a little nugget of intel from the warden of the of the prison that we were sent out of. The first data cube is in zone 147. Yeah, I got a tool tool refill in that little Victor in the chat. Sorry. that recharges the sentry and the mine deployer and the seafoam launcher as well. Victor in the chat, TJ says, \"Why did we never get this on console?\" Yeah, that's Yeah, I would have we would have loved to to bring it to console. It was never, you know, it had to be it would had to be reworked for for a little bit,",
            "start": 3429.92
        },
        {
            "text": "we never get this on console?\" Yeah, that's Yeah, I would have we would have loved to to bring it to console. It was never, you know, it had to be it would had to be reworked for for a little bit, especially the the terminal is kind of central to that thing to the keyboard. Yeah. why why it never, you know, um came to fruition cuz we were in the talks for it for for a while. Yeah. Uh I don't know actually, but it's Yeah, it's a bummer. I would have loved to to uh hunt for trophies in this. Oh yeah, that's my man. Yeah, but also you have such a great community over here. Like GTFO is one of those games I've heard about for so so long. Absolutely. Yeah, we we love our community and yeah, would have loved to to bring it to to consoles. Mike, how's that bio scanner looking? Bust out for you. I have um Oh my god. If we're looking at 147, I have a lot of resting bodies here. I have eight, 10, 11 resting bodies beyond the door frame here. So, be prepared for that. To even open the door, it's",
            "start": 3498.96
        },
        {
            "text": "have um Oh my god. If we're looking at 147, I have a lot of resting bodies here. I have eight, 10, 11 resting bodies beyond the door frame here. So, be prepared for that. To even open the door, it's a class 4 cluster alarm. Oh, yeah. We wake them up. Four ways scanned. Um 14 148 to 1454 has two resting bodies and I currently have a resting body far off to the west that's not near us. Mike, you're doing a great job with this room. He's calling some stuff out. Kevin, we're going to follow Victor here again. Resting bodies to the northwest. Hack on this one. Yep. Let's get Greg on the hack system on Don't put Greg on the hack once. Let's get him on the hat. Okay. Yeah, you're right. You're Greg, you're right. He's got to see this cool lock pick cuz I do like this lock right here. I'm hacking on this one. He's hacked on. Oh, you know what? Greg's great at golf games. He likes lockpicks, too. You got to just click whenever it hits in the blue. I have resting bodies in the northwest. Oopsy.",
            "start": 3554.08
        },
        {
            "text": "on this one. He's hacked on. Oh, you know what? Greg's great at golf games. He likes lockpicks, too. You got to just click whenever it hits in the blue. I have resting bodies in the northwest. Oopsy. But it's fine. Oh, Greg. Oh, it happens. It happens. You're fine. There's nobody There's nobody near us. They can't hear it. Oh, yeah. I got you. I got zero resting bodies at 14. Yeah. Nailed it. Nailed it. Yeah. Easy. I'm just tracking for pickups. Yeah. 143B dead ahead of you to your right is clear. You guys can go into that. 143B is clear. Yeah. 143B is clear. All out. Oh, the lighting is cool. Maybe we can try and tackle on this uh this first alarm scan then. Love that. I got a 143C one. No, I feel like that deserves a victory shot. I agree. Kevin, pop the tough. Oh my god. Jesus. Screw the hell up. Didn't wake anybody. It's fine. Was that a celebratory shot again? It was. Yeah, I did my first lock. Good hack. Yeah. Oh, wait. This is This just brought us back. Awesome. Makes sense.",
            "start": 3606.0
        },
        {
            "text": "the hell up. Didn't wake anybody. It's fine. Was that a celebratory shot again? It was. Yeah, I did my first lock. Good hack. Yeah. Oh, wait. This is This just brought us back. Awesome. Makes sense. Made me regret doing this so much. Awesome. All right, cool. That brought us back around. Okay, so we have mines. Uh, I'll I'll put up a mine here. Okay. No, that's a that's a bad one. Yeah. What doors do we think they're going to be coming through, Victor? Oh, I can tell you 1547 right here. Uh, 145 and 147. There's resting bodies in 148 through 154. So, they're definitely going to come through this one as well. I would say these two doors are definitely gonna have people coming through them because the thing you got to worry about, remember Mike, we would often get k shot by our own turrets and that's something we got to, you know, like the placement of the turret. Well, you know what? I take it back. Victor could correct me, but this 154 to 147 will not open cuz it's the door that we're",
            "start": 3669.28
        },
        {
            "text": "that's something we got to, you know, like the placement of the turret. Well, you know what? I take it back. Victor could correct me, but this 154 to 147 will not open cuz it's the door that we're unlocking. So, I would not worry about enemies coming from this side. Sick. Yes. And those security doors, the enemies can't, you know, bang them down. Yes. I want to put a turret down here. Okay. You're putting up a mine. Sick. I'm going to track, too. I'm very excited to track. Yeah, you just got to hold down that left click once they're moving. I'm waiting on I can't wait. I got Wait for the cool down. There's a couple of seconds of cool down until you can do it again. Um just checking if there's any other door that I can mine up um over Yeah. far over there. You think they're going to come from that far? I'll set I'll set one up here just just in case, you know? I love it. And then Yeah, let's let's group up. I'm ready for anything. I'm I don't know. Maybe this is one of those games.",
            "start": 3714.76
        },
        {
            "text": "from that far? I'll set I'll set one up here just just in case, you know? I love it. And then Yeah, let's let's group up. I'm ready for anything. I'm I don't know. Maybe this is one of those games. Ry's a traitor. I got to be careful. This isn't Among Us. There is not a You're making him waste med kits. I didn't know. Uh-huh. All right. Here we go. Elaborate. A medit. Oh, I'm going. I'm going. Where did those two going? Andy's taking me a wild goose chase. I want to shoot him. Okay. Be ready with the with the I'm scanning. I'm scanning. Yeah. and set up whenever we know where they're coming from. So, set up when we know. Go to your spots. I got left. One scan right ahead of us. Yep. Nice job. Somebody's missing the scan. It's you, too, right? We're not getting tagged. Enemies. There's ones down. There you go. There's tags. Oh, big guy. Big tags. I I'm Oh my god. Oh my god. Get your tags out. Oh, I do not like this burst gun. I did not know what this was. You have to charge it. Tags",
            "start": 3757.76
        },
        {
            "text": "down. There you go. There's tags. Oh, big guy. Big tags. I I'm Oh my god. Oh my god. Get your tags out. Oh, I do not like this burst gun. I did not know what this was. You have to charge it. Tags coming out. Tags coming out. We got more scans upstairs. I'm scanning. Yeah, we need tags behind you. Behind you. Behind you. Behind you, duck. More tags. More scans. It was pretty cool. More tags. Great job, Mike. Security scan downstairs. There's one. One more coming from the darkness. They're coming from the darkness. It's pretty cool. We got more scans. They're coming. There's a lot of them coming. Holy [ __ ] Do something. Oh my god. Scan. Scan yourselves. I have to shoot now. Oh my god. You sound just like more scans. I'm getting shot at. Shoot him. Shoot him, boys. What are you doing? All right, Mike. They're dead. They're dead. They're dead. Stay alive. Be because you're scanning a lot. I told you it's not an easy job, Mike. Come on, Mike. Do the scans. Do the scans. Revive us. Stand",
            "start": 3810.96
        },
        {
            "text": "right, Mike. They're dead. They're dead. They're dead. Stay alive. Be because you're scanning a lot. I told you it's not an easy job, Mike. Come on, Mike. Do the scans. Do the scans. Revive us. Stand the orange. Stand the orange. I have to kill this thing. [ __ ] you. Careful of my turret if I kill you. Oh, behind. My god, I thought that was you. Why are you not helping me? We're all dead. [ __ ] Just survive. Just survive. They're not scouting anymore. Please. You guys got to kill people. We got to scan him. If we can't see him with the BIOS, there's unbelievable scans going on here. Holy. We Yeah. Yeah. I think you did a great job scanning. The fact that they can't see these glowing red monsters with tendrils shooting. That was good, Victor. You know what? That was good. That was real good. That was real good. One more. Let's do it again. One more. Let's do it. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. We We need to finish that scan at least. Yeah. The minimum that scan. Okay. Let me",
            "start": 3880.08
        },
        {
            "text": "good. That was real good. One more. Let's do it again. One more. Let's do it. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. We We need to finish that scan at least. Yeah. The minimum that scan. Okay. Let me change my weapon cuz I did not like that weapon. The revolver or a different gun? No, the the uh the burst. I thought it was going to be like a three shot like Yeah, but it's a you have to like and you have to like charge. It's like the Spartan Spartan rifle. I thought my left click stopped working. Spartan laser sentry. I'll do the mine again then. Yeah. All right, let's see. Let's see here real quick. Uh machine gun, main weapon. This pistol's really nice. I like this. This pistol's pretty sick. I don't like that Greg's guy is tweaking out. Just like me. I'm role playing. Shoot. These little containment pods, they look real comfortable. Yeah, I wouldn't mind. Really? You two would want to be in a Yeah, I take a little nap in there. Oh, no. I've always liked the idea of little tiny like",
            "start": 3942.88
        },
        {
            "text": "containment pods, they look real comfortable. Yeah, I wouldn't mind. Really? You two would want to be in a Yeah, I take a little nap in there. Oh, no. I've always liked the idea of little tiny like pods to sleep in. Yep. The Japanese have it right. Like when I think of caps, the hotel. Yeah. Oh, yeah. That's too Kevin. We should start a capsule hotel. I'm down in your garage. Oh, no. Uh, above us right now. The space above us. Oh, above the room here. We could put a bunch inside the studio. No. Well, yeah. Above the gameplay lab and office. Greg is one of them. I don't know if Andy's a traitor or not. This is not a I don't know. It's my first time playing. Anything can happen. All right, let's get let's be successful here. I know we can do this. God, the environment is so awesome. So awesome. The lighting is incredible. Horrifying, but cool. Oh god, there's already monster. We already got Yeah. One, two, three. Mike, scan. Scanning. We have uh two. Scan them. They're not moving. Four.",
            "start": 4003.84
        },
        {
            "text": "The lighting is incredible. Horrifying, but cool. Oh god, there's already monster. We already got Yeah. One, two, three. Mike, scan. Scanning. We have uh two. Scan them. They're not moving. Four. Four sleeping ahead. Oh, Victor, just say that, you know. Yeah, he gets excited. Victor, he gets excited. Uh we have five total ahead of us. So, we have five total. I repeat, five. Let me see if you can do locked in. I'm going to I'm going for this dude on the right. Loud. Get ready. I'm Grace. Got to get the middle guy. Don't forget about the death. Oh, Victor, there's one to your left. All there's four here. Yeah. Victor's got three on the five. There's five. I got I got the these two. I got these two. He's got both. Greggy, I want you to go get the farthest one in the middle. Far far side for me. Over here. No. No. The one in the middle. All the way in the back. Oh, pooping. Yeah, he's pooping. Yeah. Get the guy. Get the pooper. You got it. Anything you want, chief? Thank you. And then",
            "start": 4057.52
        },
        {
            "text": "me. Over here. No. No. The one in the middle. All the way in the back. Oh, pooping. Yeah, he's pooping. Yeah. Get the guy. Get the pooper. You got it. Anything you want, chief? Thank you. And then I'll get this guy in the front left. Why is it all wavy around your We'll start charging on three and then once we're full fully charged, we'll just release. Okay. Drake's got to get out there, though. Yeah. It's going to take a while for good to get there. I got it. Victor, come on. It's like my fifth game. I got it. Yeah. Victor, does does moving also count as rotating your camera? No. So, it's just like it's just the crouching crouching like standing up and crouching down. That that counts as movement. Yeah. Yeah. Yeah. Yeah, I know, guys. It's his fifth game. He knows what he's doing. Everybody acting like it's do his thing. I didn't just come off the Games Cast truck. All right. I know what's going on. I'm playing the game, Andy. I've been here watching you. You're the one we should be",
            "start": 4100.96
        },
        {
            "text": "acting like it's do his thing. I didn't just come off the Games Cast truck. All right. I know what's going on. I'm playing the game, Andy. I've been here watching you. You're the one we should be watching for. I don't know if you're the traitor or not. Yeah. Who's the Who's the traitor? This one. All right. Which one is Mike planning to get? This one. Okay. Yeah. Yeah. I'm right here. Mike's going to let you guys do it. Wow, look at sneaking around. Man, this is great. This is going swimmingly. This guy is just active, you know. All right, I'm close. I wish my chest glide like that. Charging on three. One, two, three. Let's go. And then release when you're Mike just immediately did it. He He started on three. Start on three. release before. But no, you have to release when it's fully charged up. That's what Victor said. No, but he didn't. Andy, I can't edge it. I can't edge it that hard. Okay. Can't edge that. He didn't say to release, though. He just said, \"You can't control that.\"",
            "start": 4143.6
        },
        {
            "text": "up. That's what Victor said. No, but he didn't. Andy, I can't edge it. I can't edge it that hard. Okay. Can't edge that. He didn't say to release, though. He just said, \"You can't control that.\" Yes, you can. It's a longer weight. I don't think that's I can't control the opposite of that. Also, in the heat of the moment, you know, the hammer's head. You get excited. No, I know. I know. Why you move? Game face on. Let's lock in. Game face on. We got to take down this door, boys. That's our goal. I repeat, we have one ahead of us. One alive ahead of us. Currently sleeping. What did you say? We I repeat, you never said it the first time. You know, I just hope that both making Okay. All right. All right. I'm going to go for this guy. Yeah. Andy's got it. Andy's got it. Is it just one guy? Yeah. One guy. One guy. Nice job. Okay. Uh again, we have about 13 on the opposite side door here. That's counter. You think the suit they're wearing has any sort of We have one downstairs, Andy. We have",
            "start": 4196.24
        },
        {
            "text": "One guy. One guy. Nice job. Okay. Uh again, we have about 13 on the opposite side door here. That's counter. You think the suit they're wearing has any sort of We have one downstairs, Andy. We have a couple of them uh actively downstairs by the trailer here. Oh, yeah. So, if you and Greggy want to go down there along with Victor, maybe you guys can clear out the floor, but I count three downstairs. One close at the bottom of the stairs, two by the trailer. Um, yeah, I guess we go down the stairs slowly. Yeah, two by the trailer, one stairs. The ladder seems scary cuz you can't really see. Sure. Or your You guys ever wear a face mask with like a a plastic cover for the eyes? What? Like the the thing that you're The thing that your guys are wearing. Do you think any of us have in our life that would require that? Something going on in our life. Wake them up. This place will be swarming in a second. They get real hot. Real hot. Andy, come on. So if I kill this guy, he won't No, he's far",
            "start": 4245.52
        },
        {
            "text": "would require that? Something going on in our life. Wake them up. This place will be swarming in a second. They get real hot. Real hot. Andy, come on. So if I kill this guy, he won't No, he's far enough away. Okay. He won't death screech loud enough. Nice job. Okay, dead. Now those two closest by the trailer, they might be a little too close. You might have to handle them. A gas master. Oh man, I wish I had glow sticks. Yeah. Okay, I see them. Yeah, I can take the one in the shadows. Okay. Yeah, I get the one right up in front of you. Clear on the back side of the trailer. No one's here. Oh, there's no one here, Mike. Oh, my bad. I thought Yeah. No, just the two on that left side. Oh, locker. Yeah. You tell me when to charge. Victor. Oh. Oh. Oh. Oh. I'll count up top. One, two, three. Let's go. Got him. Nice job, boys. Great job. I want to hack this log. Is that it, Mike? Uh, yeah. That is all bodies accounted for here. You know, I forgot that I watched the video with like a slight",
            "start": 4301.68
        },
        {
            "text": "go. Got him. Nice job, boys. Great job. I want to hack this log. Is that it, Mike? Uh, yeah. That is all bodies accounted for here. You know, I forgot that I watched the video with like a slight lag. So, I think Mike might have started early. You know, we've only been doing this for 4 years. Three seconds behind for four years. The lag's new. Okay. We've only had two. [Music] I repeat, all of it is clear over here. We are clear. Damn, this game looks good. Damn. Oh, I also saw I will say this. I know like obviously our PCs are crazy are much stronger nowadays than they were, but I I I'm happy to see how much better the game is running cuz as much as we loved it back in the day, we we hit some like frame rate moments where it's like, \"Oh man, I wish this was running a little bit smoother.\" But it's so cool to see how far it's progressed. All right, I've arrived at the doorway. Thank you, buddy. Uh I'll pick up the tool refill. Uh, let's place the turrets. I can uh refill your turrets.",
            "start": 4354.56
        },
        {
            "text": "But it's so cool to see how far it's progressed. All right, I've arrived at the doorway. Thank you, buddy. Uh I'll pick up the tool refill. Uh, let's place the turrets. I can uh refill your turrets. Uh, no, wait. This wasn't it. It's another place uh that I left my tool refill. Where was it? Over here. I'm going to put a here. I'm going to put a turret right the freak here. That way it isn't in our way. And he stop moving for a second. Stop moving. Or what did you say? All right. I got two refill. Uh, who had uh the certain the sentries? It was um Greg. Greg and Andy. Where do you want it? Is that facing the right way, Andy? I mean, you can just put the sentry wherever the enemies are coming from cuz they're they're going to come from new places now. Okay. Uh, I'll just refill your ammo on that one. And I'll restock on this one as well. There we go. All right. Second try. Okay. Second try. Here we go. Let's go. Let's go again. Okay, we we want some tags. We want some enemy tags. Tags",
            "start": 4406.32
        },
        {
            "text": "that one. And I'll restock on this one as well. There we go. All right. Second try. Okay. Second try. Here we go. Let's go. Let's go again. Okay, we we want some tags. We want some enemy tags. Tags are going to be tagging. We start the [ __ ] list. Yeah, tagging. No tags. Tags are all coming from the the west. West downstairs. West tags are Make sure to get in your security zones. Coming upstairs again. More tags out. I got the upstairs ones. Uh yeah, next wave downstairs. One's on top of Greg. Banging down the door here. They're banging down the door over here. I love when Mike does the Howard demon. Oh my god, bro. Wow. Oh my god, there's two massive ones. Holy [ __ ] Walk him into the turret. Nice job. Great job. Okay, we're good. We're good. We're good. No scans available right now. No scans available. Scan out. Scan out. Two coming. We got tons to scan. There you go. That means I cool down. Holy [ __ ] [Applause] Oh my god. Scan out. There's so many of them. Oh my god. There's a",
            "start": 4460.48
        },
        {
            "text": "scans available. Scan out. Scan out. Two coming. We got tons to scan. There you go. That means I cool down. Holy [ __ ] [Applause] Oh my god. Scan out. There's so many of them. Oh my god. There's a lot. There's a lot. I like the way your gun sounds, Mike. Yeah, it warms up, too. It's got to warm up. Scan out. Scan. Scan out. Are we using the same terminology for your biotracker and the bioscans? Mhm. Yes, I think so. I think so. I think so. Yeah, it makes sense. This is funny as [ __ ] You get the door and I'm out. Oh, Victor, you and I are on two separate pages. Am I just going to Oh [ __ ] Everybody stop. Oh no, that has so many not shoot. Oh my god. Oh my god. Is that not what you're supposed to do? That is not what you're supposed to do. There's 13 unaccounted for bodies shooting. Well, the turret I don't want another firefight. Okay, the turret started firing. Seems like a great way to handle it. Thank you, Kevin. I mean, we're just wasting ammo that No, I mean, you're killing",
            "start": 4525.84
        },
        {
            "text": "the turret I don't want another firefight. Okay, the turret started firing. Seems like a great way to handle it. Thank you, Kevin. I mean, we're just wasting ammo that No, I mean, you're killing the bad guy. One body left. One body left. One baddy. That's what it's for. Yeah, Kevin, you know more than him for sure. We did it. We did it. We did it. I love Mike having that realization like we're on a different page right now. I'm scanning. No, you're we're scanning. Scanning. Scanning out. Scanning out. We don't have any scans. Like what? We have tons of scans. That's hilarious. That is hilarious. What do you mean scam? Somebody needs ammo. Uh, let's see. I need ammo. Yeah. Pulse. Andy, I'll give you some ammo. Uh, just a quick reminder to Greg Miller. It is 3:00. If you are busy, just please remember to stand right up and leave whenever you need to, big dog. We'll handle the rest. But with that, let's keep going, though. Oh, there's some health there. We got a health pickup over here.",
            "start": 4588.16
        },
        {
            "text": "remember to stand right up and leave whenever you need to, big dog. We'll handle the rest. But with that, let's keep going, though. Oh, there's some health there. We got a health pickup over here. I'm at 35. I'm going to heal myself. Who's a smart call? I'm 95. Greggy's at 64. I'll use the rest of it on Greg. How about that? That's a great call. That's good. I'll get you that. It's funny that you heal him and he shoots you. I haven't shot him once. Excuse me. You're saying ever? No, not ever. Fire out. The eastsoutheast combo has about seven bodies through the wall here. East southeast or what? Yeah, southsoutheast. I love southeast combo. Yeah, I love Greg going, \"Look, I'm getting better about not shooting Andy. Like, I'm working on it. It's just fun, you know. I'm working on myself.\" Quite what he said. Love it. Yeah, Chad pops out every time. Great. Moving on with Victor. Here we go. Did we pick up our turrets? I did. Oh, I did. Okay, sick. Oh, yeah. Don't open this door just yet",
            "start": 4642.32
        },
        {
            "text": "what he said. Love it. Yeah, Chad pops out every time. Great. Moving on with Victor. Here we go. Did we pick up our turrets? I did. Oh, I did. Okay, sick. Oh, yeah. Don't open this door just yet until I've explained what it does. Andy for through this door. Close to the last one. 2 4 6 eight. I have eight. I have eight. Easy. You took out way more than that. Sentry gun 60%. Okay, I'm I'm restocking uh refilling your your sentry. Oh, thank you. Uh, Greg as well. Kev dog, Kev, thank you for the prime gaming s for 35 months. Woo! Kev dog, Kev, fantastic. All right, so this door when we pull it, uh, there's going to be a that's uh what we call the trickle alarm. Uh, we can't stop the alarm. Um, but uh uh um until a few rooms in. There's a terminal like five rooms in where we can deactivate the alarm and the enemies will just keep on coming. And to get into that room, we need a key card. So, we need to run around in these rooms that are, you know, upcoming here, find the key card, and then",
            "start": 4696.08
        },
        {
            "text": "alarm and the enemies will just keep on coming. And to get into that room, we need a key card. So, we need to run around in these rooms that are, you know, upcoming here, find the key card, and then make our way to the door that that requires a key card, turn off the alarm. We need to do this real fast. Best of luck. So, is this a situation where it's like put your [ __ ] down if you have time or just shoot? Uh, you know what? You know, we'll we'll try and close doors behind us. I'll put up mines behind the doors. Use your turrets. But, you know, there's very easy for you to just forget it. Forget about it and and the turret is like two rooms away all of a sudden because we're going to be rushing around. Okay. So, follow my lead. Uh we'll try and find the the key card and make our way to the end again. We have eight bodies. Eight bodies confirmed on the next doorway. Get ready. Yeah. Just do just do uh melee and then switch to weapons real fast. Like try and take down one or two with",
            "start": 4753.84
        },
        {
            "text": "the end again. We have eight bodies. Eight bodies confirmed on the next doorway. Get ready. Yeah. Just do just do uh melee and then switch to weapons real fast. Like try and take down one or two with melee and then switch to weapons. There you go. I'll follow you guys. Scans out. That's a That was great job. Great job. Bio scan and bio through here. Through here. Let's go. Following Victor. Goodbye, boys. Everybody through. Let's go. Love y'all. Let's go through. Got your chickens. One, two, Greg's got resistance. Nobody's in front. Nobody's in front right now. Got through. Follow me. Ping. Up here. here. Up the stairs. I'm going out. Mike's camping them. Oh [ __ ] Hold on. We lost Victor. Oh, Victor went down. Mike. Yeah, he's moving. He's moving. I'm looking for the I'm with him. He's looking for the He's in a panic. We're all in a panic. Orange box or locker. Uh so just look look for for the orange resource. Maybe we can maybe we could ping it, but uh let's not do that. How about",
            "start": 4798.0
        },
        {
            "text": "looking for the He's in a panic. We're all in a panic. Orange box or locker. Uh so just look look for for the orange resource. Maybe we can maybe we could ping it, but uh let's not do that. How about uh what if I get on a terminal? What if I get on the terminal? I don't know the name of the key card. There's a lot of people here. Oh, that gun that gun's out of ammo. [ __ ] Victor, I'm helping you on the main main hall. Everybody to the main hall. Careful. Step in front of me. Back to the main hall, boys. Out of ammo. Sorry. Everybody group up on me. Let's go. Yeah, we're going. Oh, big guy scanning. Took him out. No, he's alive. He woke back up. Back up. He's down. He's down. He's He's down. I Let's see. Use ammo so quick here, man. Uh, okay. Moving on. Moving on. Looking for the key card. That bodies coming towards us. Bod's coming towards us. Mark them. Yeah, we need to uh Marks are out. They're on your tail. Purple and pink. Nice job, blue behind us. Blue behind us. Yep. Now one in",
            "start": 4856.56
        },
        {
            "text": "That bodies coming towards us. Bod's coming towards us. Mark them. Yeah, we need to uh Marks are out. They're on your tail. Purple and pink. Nice job, blue behind us. Blue behind us. Yep. Now one in front of us. Blue. Nice job, everybody. We're clear. We're clear. Great job. Some in front. Some in front. Nice. Nice. That guy still alive. Uh, three in front. Three in front. You can see him. Four now. Five. Damn, the music's good. Intense. Are they They came through here before. One behind. One behind us. One behind us. Back. Yeah, that's the way back. Okay. Get him, Andy. Hit him, [ __ ] Hit him, Andy. Clear right now. Clear right now. No bodies. Two bodies. Two bodies coming up. Southwest. Southwest. Boom. Boom. Boom. Oh [ __ ] Oh my. Nice job. My bad. My bad. You're good. You're good. You're good. I have no ammo. I'm going back to Victor. I'm falling back to Victor. Four bodies on Greg. Full bodies down. Greg's down. Greg's down. Back. Andy. I'll cover you. I have no ammo. Use your",
            "start": 4919.92
        },
        {
            "text": "good. I have no ammo. I'm going back to Victor. I'm falling back to Victor. Four bodies on Greg. Full bodies down. Greg's down. Greg's down. Back. Andy. I'll cover you. I have no ammo. Use your hammer. I have 13 bullets. I'm not leaving. Greg, I'm going for Greggy. We go get Greg. Yeah. Let's go. Let's go. I'm going to turn it down. You help us. Yeah. Yeah. Okay. Thank you for the revive. Run back. Follow me. Follow me. Okay. I'm scanning. I got nobody on the bio. That's good. Yeah, that roar means there's an enemy spawn. That's That's an enemy spawn. Oh [ __ ] Okay, let's go. Let's go through this door here. I'll put up a mine once we're through. Uh check I'm taking a look. Taking a look. Don't see anything right now. No bodies. No bodies. Mine is up. Okay, that's going to that's going to give us a couple for a little while. Check for if you see any any key cards. This is the locked door, I believe. Nice job, boys. Nice. He wants key. Y 774. That's the what key we need. Okay. So, I",
            "start": 4984.8
        },
        {
            "text": "to give us a couple for a little while. Check for if you see any any key cards. This is the locked door, I believe. Nice job, boys. Nice. He wants key. Y 774. That's the what key we need. Okay. So, I don't know exactly where it is. I put I put a turret up, but I have no I got 7. We got one. We got people in here. I got a key. Nice job. Got it. That's the key. Got it. 146. Okay. To the big room. Big door. Ignore this one right here. Yeah, I'm using it. Yeah, Greg's got it. Great job, Greg. Nice. Let's go through. Let's go through. Nobody's on the bio. Nobody's on the bio through this door. God, you're such a good recon guy. Oh, come on. Come on. Nobody more. Big guy. Scanned. Everybody door opening. Door opening behind us. Put my turret down, but I got killed doing it. Or maybe he didn't get down. No, it's down. Good. Okay, I'm going to shut down the alarm on the army. I got your back. Cover me. We got to get the Victor. Help me. Oh [ __ ] I don't have any. Oh, Victor, you're clear. Oh",
            "start": 5041.36
        },
        {
            "text": "down. No, it's down. Good. Okay, I'm going to shut down the alarm on the army. I got your back. Cover me. We got to get the Victor. Help me. Oh [ __ ] I don't have any. Oh, Victor, you're clear. Oh god, I'm picking up my turret. Picking up bioscanning. Nobody on the BIOS. Long way. Alarm is deactivated. Oh god. I'm pressing the buttons. Oh, there's a lot of [ __ ] to the next room. Champion. Mhm. The winner is just Wow. Oh my god. Oh my god. Oh my god. More. More. More. I'm back on the bio. Filters. I need ammo. We're clear. No, there's one on the bio. Just one. Just one. Just one. Got him. Got him. Great. Holy [ __ ] That was cool. I think we're doing all right. pretty pretty chill. Did we uh did we turn on a you know how you could do like a melee only kind of you know custom games in Fortnite and Halo and stuff? Did we do a lock melters only? Cuz I swear to God that's all I'm finding. Like I I there's a lock we can melt here but holy [ __ ] I need other things that is randomized",
            "start": 5098.72
        },
        {
            "text": "Fortnite and Halo and stuff? Did we do a lock melters only? Cuz I swear to God that's all I'm finding. Like I I there's a lock we can melt here but holy [ __ ] I need other things that is randomized like the placement of the resource boxes and lockers and what they contain. That's randomized for every run. So sometimes you're super unlucky with with the like the seed that you got. Yeah. And it's just like a bunch of like longrange flashlights and lock melters. Mike, um what's on the other side of this door right here, Andy? Uh nothing by you. I have a dead bio right now. Nobody's Nobody's being picked up at all. Okay, cuz uh all clear. I should be able to go. You're calling it bio? Dead bio. That's the scan. Biocan. Well, you know, it's a lot of changing the terminal. There's a million micro decisions being made right now. I'm trying my best. Oh, you guys are Oh, it just opened this door. Damn it. He's doing it. He's doing his best, Victor. You know, I throw terminology at everybody.",
            "start": 5167.04
        },
        {
            "text": "decisions being made right now. I'm trying my best. Oh, you guys are Oh, it just opened this door. Damn it. He's doing it. He's doing his best, Victor. You know, I throw terminology at everybody. It might be the wrong terminology, but you know, I appreciate I appreciate you, Mike. Andy gets it. He got it. All right, boys. Good job, everybody. Oh, okay. Now we're getting scared. No alarm. No alarm. So, don't worry. Don't worry. Nice. I think we're going to make this, everybody. 20 38 for you. 20 for you. 30 20. Oh, nice. I picked up Victor. Did you give me ammo or something? I think we're closing in on the first data cube. The first out of three. Okay. Got to read nothing. Uh, I found it. I'm not going to pick it up, though. Oh, why? Probably a smart move. Yeah. Yeah. Okay, you get it. You got it. Got it. Wait. No. Wait. No. Oh [ __ ] What do you mean? It wasn't time yet. We had to cool the room down. Maybe. No, we got it. I'm just kidding. I'm just kidding. He got us good gun. It said",
            "start": 5212.88
        },
        {
            "text": "got it. Got it. Wait. No. Wait. No. Oh [ __ ] What do you mean? It wasn't time yet. We had to cool the room down. Maybe. No, we got it. I'm just kidding. I'm just kidding. He got us good gun. It said heat 9. We need to survive here. Survive. Easy peasy. Okay. So, uh I got nothing on the Nothing on the readings. Oh, we're getting shot by Holy [ __ ] Now they're on the readings. Like the end of Halo Reach. Oh my god. I love Halo. Oh, Greg. They're like tentacle monsters. I know, right? Hot. You think they taste like octopus? I hope so. Oh my god. When they're fried and battered. Nothing on the readings. Oh yeah, deep fried. M. That sounds delicious. [ __ ] Got one on the reading. Yeah, just keep moving. You're You're That strategy is good. Keep moving. Okay. Fast movement. Try and take them out. The red eyes are are very vulnerable. I have no more ammo. Oh my god, baby. Oh [ __ ] So where are you guys getting sent when that happens? Whoa. Home world. Oh, three different responses. Made",
            "start": 5271.44
        },
        {
            "text": "out. The red eyes are are very vulnerable. I have no more ammo. Oh my god, baby. Oh [ __ ] So where are you guys getting sent when that happens? Whoa. Home world. Oh, three different responses. Made up things. All right. No, no readings. Another another door unlocked where we can find the second data cube. So, let's uh head on back. You just follow me. Uh we'll pick up some resources on the way. 104 on the way. I It'd be so sick if we just ran into like the ammo room, you know, just banged into the ammo room here. This is where the soldier stocked up. Following Victor souths southwest. Love that call out. Great call on you that no readings. Scan out. No scans. No scans. Oh, lockmelter. Yes. Okay. Lock melter. I got room to pick that up. Carry with us. Yeah, it's good if you're like in a in a hurry or if you're um sneaking around. Health. Someone needs health. We all need health. Yeah, Greg needs health and Andy needs health. So, slap it on both of them. Mike does. I just want one use",
            "start": 5327.2
        },
        {
            "text": "a hurry or if you're um sneaking around. Health. Someone needs health. We all need health. Yeah, Greg needs health and Andy needs health. So, slap it on both of them. Mike does. I just want one use health. So, Greg Oh, there's one use. Okay. I mean, put it on the captain. Yeah. Put it on the greatest. Absolutely. He's the goat. It was an honor, sir, to give you the health. Thank you. It's like I'm president. Got to protect the president. Damn. I just thought Victor was an alien. I got really Oh no. Ow. Yeah, it's having a great couple. Do not be jumping on the staircase. Don't [ __ ] around. Yeah. You know what I mean? You could roll your ankle ankle. Yeah. Snowike might just rolled his ankle. Lost 6% health right there. Those are crucial. Yeah, he really needs These are pieces I need. Six health that we could not afford to lose. Sorry, Greg. I think we I interrupted your lying. I don't remember what I was saying. It could have been Kevin. You were going to claim you weren't going to",
            "start": 5405.28
        },
        {
            "text": "health that we could not afford to lose. Sorry, Greg. I think we I interrupted your lying. I don't remember what I was saying. It could have been Kevin. You were going to claim you weren't going to hurt Andy or has haven't heard Andy once. I mean, that's the facts. Never. All right. Nice job, boys. Yeah. Nice job. Nice job, everybody. We're looking. No readings. No readings, too. Time for a victory shot. Victory. It's clear. You can do that. I can't. I have no ammo. Double checking. Oh, we got health here. We got health here. Let's give that to Andy. Yeah. And I mean, all of us desperately need that. Yeah. You got 38. Andy's got 40 now. Look at us. Look. Oh, man. Look at us. How are we going to possibly lose now? Exactly. We're so up right now. Things are Oh, a little treasure. Hold on. Little treasure. Little treasure for Andy. A long range flashlight and an artifact. I'll take the flashlight. Damn, that shit's bright. You want the artifact? [ __ ] Super bright, bro. It's awesome.",
            "start": 5459.76
        },
        {
            "text": "Little treasure. Little treasure for Andy. A long range flashlight and an artifact. I'll take the flashlight. Damn, that shit's bright. You want the artifact? [ __ ] Super bright, bro. It's awesome. Oh, you know what? I can't pick up the artifact. Yeah, I was picking up uh glow sticks. Uh just checking. Oh, you know what? I'd rather pick up more. And secured an artifact. Oh, snap. Okay. Yeah, that's awesome. Yeah, you trade those for boosters on surface level with the Oh, yeah. That's how you unlock boosters. Got to get the surface level. Greg, open up a door or something. Okay, next door. I see. Open. I got no readings, Greg. So, you're clear to open any door you want. Holy [ __ ] I woke up the room. Oh god. Okay, I woke up the room. I'm so sorry. I'm coming to Victor. I got a door over here. I'm opening. I got readings. Do not let them circle us. Mike's got scans. Didn't do anything. Where the hell? There's another door down there. Kevin, should I open it? For sure. Don't jump. You",
            "start": 5516.0
        },
        {
            "text": "here. I'm opening. I got readings. Do not let them circle us. Mike's got scans. Didn't do anything. Where the hell? There's another door down there. Kevin, should I open it? For sure. Don't jump. You know what they call this, right, Kev? Oh, up here. Lone wolf. Yeah, you're lone wolfing it for sure. Bullets over there. I'm sure they're fine. Oh, who was that? That was me. Oh. Andy, do you want to lone wolf with us? I think we're good. We're good. Yeah, I'm with you, Victor. Yeah, we cleared it out. Uh, let me take a look. They rushed around and yeah, the door was was broken down and there were people sleeping in here. Bodies are clear. Clear right now. It's exciting times. Absolutely. It's exciting times in zone 51, y'all. This is where the party's at. Damn. Still no readings, man. Greg's real far away. He's so mossy. Lone wolfing. Take a look at the map. He's lone wolfing. Let him lone wolf. You got to let him lone wolf. Terminal over here. Oh, sleeper over here. Yep. Coming at you.",
            "start": 5560.8
        },
        {
            "text": "real far away. He's so mossy. Lone wolfing. Take a look at the map. He's lone wolfing. Let him lone wolf. You got to let him lone wolf. Terminal over here. Oh, sleeper over here. Yep. Coming at you. You got one sleeper, two sleepers. You got two. One to the right, one to the left. Andy, maybe get in there with him. Take out the left. I'll go. Wait, where's the left? Oh, yeah. I see. Might be behind the pillar and such. Oh, screw. Oh, wow. Look at Victor helping you out right there. That's a real crucial glow stick right there. I need this dude to fall asleep. Hurry up, big dog. Oh, yeah. Let him sleep. There you go. How much mobility is Okay. None. How much what mobility? Like in this in these moments? You just got to stop. Yeah, you can only like turn your camera. Good job. We have one through the doorway to the north and one through the doorway to the south here. So, one on both doors. Okay, there we go. Looking clear. [ __ ] yeah. Greg up. Oh [ __ ] A lot of enemies here. One, two,",
            "start": 5613.04
        },
        {
            "text": "the doorway to the north and one through the doorway to the south here. So, one on both doors. Okay, there we go. Looking clear. [ __ ] yeah. Greg up. Oh [ __ ] A lot of enemies here. One, two, three. That's the door. Yeah, that's the door. We have three. We have three. Three sleepers confirmed. Two down below, one right ahead of us. Seems like a perfect time for Greg and Andy to go forth and get those two down in the pit. [ __ ] yeah. [ __ ] celebratory shot, man. I shot into the room and closed the door on you on me, dude. My [ __ ] awful. That's awesome. Listen, guys. Are we making a fun time? You know what I mean? You just survived tax day, everybody. That's another world. Come on. Oh, I thought it was a misclick. Oh, no. That was all. Oh, great. His hand was on the door stop as well. He was ready for it. All right. Uh, great job. Well, we got the doorway. Let's uh let's unlock it. Let's get there. Uh, yep. And that's a checkpoint as well. Yay. That's a checkpoint. Yeah. Yeah.",
            "start": 5664.48
        },
        {
            "text": "He was ready for it. All right. Uh, great job. Well, we got the doorway. Let's uh let's unlock it. Let's get there. Uh, yep. And that's a checkpoint as well. Yay. That's a checkpoint. Yeah. Yeah. It's We're going to we're going to be losing Greg right now, but we'll lost Greg. But we'll keep playing me and Andy, right? You cool with that? Let's do this right here. Uh well, can we scan without him? No. We need Nick. Somebody tap in Nick. We need you to come play, Kevin. Get Nick. Oh, Kevin. Yeah, we need you to play Kevin. Kevin, who do I leave it? Who do I game plan? Just leave it on Andy's. Leave it on Andy's and just get in. You're good, Greg. Keyboard. Thanks for Greg. We'll we'll let Victor Victor tell him that you appreciate you got I don't know the S word. Uh C is crouch. I don't crouch. Just so you know, Andy, he doesn't crouch. He's in my contract. Rouching is beneath me. I have one guy dead ahead of us. Let's keep it easy as we go in. There you go. How do I switch to uh",
            "start": 5724.72
        },
        {
            "text": "crouch. Just so you know, Andy, he doesn't crouch. He's in my contract. Rouching is beneath me. I have one guy dead ahead of us. Let's keep it easy as we go in. There you go. How do I switch to uh melee? Uh scroll wheel. Scroll wheel to the hammer. Let them sleep. Yeah, there you go. One, two, three on the keyboard. One is melee. Two is your primary. Three. Can I swing right now without making noise? Yeah. Yes. Melee does not make noise. Excellent. I'm going to I'm going to try. Kevin, get after it. Yeah, you're doing great. That is my only one on the reading. So, you are clear. Don't move. Don't move. I'm not moving. I'm not moving. I'm just double checking. Sorry. Let it ride. I know. I hear I hear another There's two more further ahead. There's three in this room at least. Yeah, there's four actually. Nice. One, two, three. One around the truck. Yeah. Two forward to the north. Yeah, I see two of them here. I'm going for the truck. He's got the truck one to the east. Victor and",
            "start": 5767.8
        },
        {
            "text": "four actually. Nice. One, two, three. One around the truck. Yeah. Two forward to the north. Yeah, I see two of them here. I'm going for the truck. He's got the truck one to the east. Victor and Kevin will get the two to the north. Sure. I got the one crouching down there. Yeah, northeast. Hold on. Yeah, I'm ready for this one. I'm I'm Yeah, I'm I'm getting there. Uhoh. Yeah. Oh no. He woke up. Uh-oh. Uh-oh. Here you go, Kev. Get after him. I got him. Yeah, you did. Anyone else? Anyone else? Oh my god, that was so scary. Nobody else regard anyone else. Okay, here you go, Kev. Did you see the Victor messed it up? Another long range flashlight. Yeah, I'll take that blame. I'll take that blame. I mean, that's where it goes. I'll take that blame. Put the blame on. All right. Good job, team. We're heading to 151. I got 151 in front of me. That's 148. What's that big scary door? Uh, what about this orange thing? Yeah. E, this door is in emergency lockdown. Unable to operate. Okay, we're not",
            "start": 5822.56
        },
        {
            "text": "heading to 151. I got 151 in front of me. That's 148. What's that big scary door? Uh, what about this orange thing? Yeah. E, this door is in emergency lockdown. Unable to operate. Okay, we're not worried about that. Checkpoint. The green marker means that it's a checkpoint door. So, we'll probably come back to it later on. Okay. Okay. That's that. What did I put down? Oh, glow sticks. Yeah, you're replacing the glow stick with something else. Sick. Um, con like a sticky maybe. A sticky. I don't know what that grenade. Yeah, I got If you throw that on a on a light door, you will uh sticky it up. So, I have four upstairs and forward. One creeper to the left that Victor's currently looking at. Two to the left. One might be through the doorway though. I'm trying to Oh, there he goes. A lot of bodies here. Sleepers. Should I not be running? No. Okay. Uh, they might be upstairs there, Andy, as you look up. I have four bodies over there. I'm going to toss up there. Yeah. Yeah, they might be",
            "start": 5875.2
        },
        {
            "text": "bodies here. Sleepers. Should I not be running? No. Okay. Uh, they might be upstairs there, Andy, as you look up. I have four bodies over there. I'm going to toss up there. Yeah. Yeah, they might be upstairs. There's also a downstairs. Thank you. I'm out. Yeah. Go on up with Andy. Excellent work out the enemies. Thank you. Four bodies uh through the door. We have a lot, but right now the closest one, you have three bodies near you guys somewhere. Either top level or bottom level. There's three stories there. He's got gameplay way too quiet and you way too loud. He doesn't know how to move that man. Holy [ __ ] There's a lot of people there. Anybody? We need all hands on deck for this door right here. On our left. On our left. On my left. Oh, no. I'm looking at it. Oh, you are. Okay. Hold on. He's coming. Nope. Somebody's We've awoken. We have awoken them. Just so you know, we have 100% awoken them. Yeah. Can we get tags? Yeah. Okay. Yeah. Tags out. One more downstairs. Oh my god. Got",
            "start": 5926.24
        },
        {
            "text": "on. He's coming. Nope. Somebody's We've awoken. We have awoken them. Just so you know, we have 100% awoken them. Yeah. Can we get tags? Yeah. Okay. Yeah. Tags out. One more downstairs. Oh my god. Got him. You guys, this is when the aswad stuff is real hard. Oh my god. Damn. I fell. Oh, Kevin. I didn't know. That was a tough fall. As of right now, we're clear. What's that noise? What's that noise? Uh, Victor's trying to block. Can I use boosters to worsen my hacking? Oh. Oh, I'm having a real real tough time. The last one is just one one slot. Oh no, that's that's badass. Holy [ __ ] But like I traded it for regen cap plus 89%. So cap is at 38%. Does anyone have any healing? Uh no, none of us do. I have healing. He just Oh wow. Can you tap me a little bit? Can you give me a little bit? Absolutely. There you go. Little bump. Little bump. Little bumpkate. Little bumpkate. Little bump. Here we go. We're just back up again. We are right back up, boys. God, it's crazy that you guys like",
            "start": 5968.8
        },
        {
            "text": "Absolutely. There you go. Little bump. Little bump. Little bumpkate. Little bumpkate. Little bump. Here we go. We're just back up again. We are right back up, boys. God, it's crazy that you guys like playing with this keyboard. I'm actually having a really good time with this keyboard. My hand hurt. It's already cramping. Maybe that's why Andy has a bad wrist. Somebody help him out. No, it's cuz he slept on it. Yeah. Sleeping on it. All right. How do I drop down a turret? Okay, there's a lot of people in here. Oh my god. Flashlight's off. Flashlight's off. How do you F for flashlight? That's it. Quiet sleepers. Crouch. Four. Mike, stop moving. There's currently four, seven, eight. They're way them. I not me. I was definitely Mike. Oh, that was a good call. Wait, can I reinforce this door? They're going to come through this door. Oh, you don't have to. You don't have to. We don't need them to save that. Save that. Okay. Should I put a turret up and then the mine slam? Oh, damn. Mine",
            "start": 6028.88
        },
        {
            "text": "They're going to come through this door. Oh, you don't have to. You don't have to. We don't need them to save that. Save that. Okay. Should I put a turret up and then the mine slam? Oh, damn. Mine takes care of a lot of them. Couple uh stragglers coming through. Yep. Just one on my reading. That's clear. That hurt. Clear on my readings. Far away. There's one. We got time. We got time. Looks like they're going to be through the door. Southwest 225. There's an upstairs door. This is horrifying. I have a good feeling we'll find ammo real soon. I got one over here by Victor on 151 door. Yeah, 151 is where the second data cube is. You can see it in the top left. Yeah, that's where we got to go. That's a second data cube. Oh, f. We doing stuff. Oh, it's empty. Took the ammo. Kevin, what? Why? He needed it. I'm the gunner. You're the guy I was shooting. He's got to take shots, bro. You got to take shots. We were all taking shots. I opened the container. I have zero ammo. Okay. And he just",
            "start": 6080.72
        },
        {
            "text": "He needed it. I'm the gunner. You're the guy I was shooting. He's got to take shots, bro. You got to take shots. We were all taking shots. I opened the container. I have zero ammo. Okay. And he just walked up and stole my stuff. Go to hell. Take your flashlight there, Mike. Yep. 104. Be careful. Flashlight's off. I'm coming into the ammo. I desperately need ammo. I finally got some. I haven't had any in the last 3 hours. No, Victor, just to be clear, he took that from me. So, what's up with this door? Can I open this one? Depends on what door you're looking at. Probably not. Maybe. Probably. You can open up any door. There you go, Kev. Open up. Yeah, he's fine. Hold on. Double glow sticks. Thank you. Okay. Okay. So crouching would get me caught right now, right? Andy, go to the right. Moving while picture will get the left going to the right. Standing up and crouching counts as moving as well. So be careful. We have a lot of human We have a lot of Two seconds, guys. Two seconds. I",
            "start": 6129.68
        },
        {
            "text": "Moving while picture will get the left going to the right. Standing up and crouching counts as moving as well. So be careful. We have a lot of human We have a lot of Two seconds, guys. Two seconds. I just need a moment here. This guy's got to jump. Uh, one has awoken. Okay, we're good. They're back to sleep. Back to sleep. Thank you. Thank you. Uh, Andy, you have a couple coming your way, so be prepared. Kevin, you might have some up. I have two in front of me. If you guys just Wait a minute. I think I can kill them all. I know you can. Andy just kill them all. Well, there's two of them. Oh, wait. I can't kill both of them, can I? If you're real fast, you can you can do it. I'm not real fast. I don't know how to use a controller like this. Okay. I I I can come I can come help you. Okay. Okay. Okay. Let's go upstairs. Let's help Kevin. I don't like the way you said that. Yeah, it's up through here. Yeah, I'll come help. Okay. Hold on. They're moving. They're moving. I hear them",
            "start": 6178.64
        },
        {
            "text": "Okay. Okay. Okay. Let's go upstairs. Let's help Kevin. I don't like the way you said that. Yeah, it's up through here. Yeah, I'll come help. Okay. Hold on. They're moving. They're moving. I hear them pulsating up there. Oh god, I was already crouched. Uhoh, I hit crouch. There you go. I'm going to crouch again. Okay. Is anyone coming? Uh, Victor and Andy are on their way. I'm here. I'm here. Okay, I'm ready to rock and roll. We got Oh. Oh. Oh. Don't move. Don't move. Don't move. Oh, Kevin. What happened? What happened? That's me. That's me. That's me. Everyone is still asleep. Nobody's moved. Okay. So nice to feel something, you know. Oh [ __ ] F. Yeah. Uh, you guys up above have about four people to five people. Yep. Yep. Vic, you got that one? Yeah, I got this one. I'm going to Oh my god, there's two up here. Uh-oh. No, no, don't. They're waking up. Woken three. Uh-oh. We're good. We're good. We're good. We got this. We got this. Everybody else is still asleep. You did good. You did",
            "start": 6219.6
        },
        {
            "text": "there's two up here. Uh-oh. No, no, don't. They're waking up. Woken three. Uh-oh. We're good. We're good. We're good. We got this. We got this. Everybody else is still asleep. You did good. You did very good. There's two more down at the bottom of the stairs towards me. You guys don't check up on these things to see if there's ammo. Yeah. Up on everything. Big dog. You got to check everywhere. Flashlight. [ __ ] Okay, good, good, good, good, good. My bad. I'll go left. Left. Okay, I I take I take the one. Uh crouching here. That way we can stay out of trouble. I'm ready. I'm I'm too far on. Yeah. Andy, you got to do it. Start charging on three. 1 2 3. Okay. Nice job. Beautiful. Beautiful. Clear. We have one beyond this door. There's going to be a lot beyond this door, but this is going to be a uh security door. Yep. Class four, too. Oh [ __ ] Class four. Class five. Oh Jesus. Oh Jesus. We We We know what happened last time. Oh my god. I can't weak. Do we even have How much ammo do we",
            "start": 6290.8
        },
        {
            "text": "be a uh security door. Yep. Class four, too. Oh [ __ ] Class four. Class five. Oh Jesus. Oh Jesus. We We We know what happened last time. Oh my god. I can't weak. Do we even have How much ammo do we have? Uh I have 60 bullets. I have two clips in my assault rifle, five clips in my pistol. And this burst sentry ain't worth a damn. I've got 11. But I have a lot of it. Shotgun shells. I think we can line up uh the doors around. I got I got a couple of mines. I'm closing doors on I also have that goo thing. Can I throw that anywhere? Yeah, that's true. Whenever we know what door they're started banging down on. You can reinforce. Uh yeah, but I'm real slow. So it takes them longer. Can Mike, can I open this door? Oh, no. You want them to break through first, Kevin, and then reg it, right, Victor? You said uh No, no, no. We want them as soon as we know Oh, which way they're coming? They want you'll see the doors like kind of banging on them that then you shoot that door. But Mike, is there",
            "start": 6342.32
        },
        {
            "text": "You said uh No, no, no. We want them as soon as we know Oh, which way they're coming? They want you'll see the doors like kind of banging on them that then you shoot that door. But Mike, is there anyone behind this door? Well, no, we we killed all these guys. So, we have to wait. So, can I open this? Yeah, you can open that one. I closed it for reinforcement. Okay. Sorry, I didn't Well, yeah, that's that's And so, then what we'll do is we'll start the scanned. I will mine every door. Okay. So, we have So, we have that uh for every door. It's a big moment. And then uh once we know you the one with the biot tracker, we'll keep track on that, Mike. And tag the enemies. And as soon as the enemies have been tagged and we know what door they're going through, we go for it. Uh Nick will go through and and and and you know, slam it up. That's you, Kevin. Yep. Kevin, sorry. Sorry. No, no, no. You're good. You're good. Don't We will We got upstairs, we got two downstairs, Kev, you know that.",
            "start": 6396.16
        },
        {
            "text": "and and and and you know, slam it up. That's you, Kevin. Yep. Kevin, sorry. Sorry. No, no, no. You're good. You're good. Don't We will We got upstairs, we got two downstairs, Kev, you know that. One left, one right downstairs, one upstairs. I mean, yeah, we can check the We can check the map. Uh just real quick, that's one too many button for me. Tab, I think, right? Tab. Yeah. So, we got uh that one's downstairs. Yeah, that's upstairs and that's downstairs. Okay. God, this is so cool. Did you see this? This is my dream, bro. Put me on a War Zone Call of Duty commentary. I'm [ __ ] John Madden in this thing, dude. Yeah. Okay, let's uh survive this. Yeah, let's [ __ ] do this. I mean, I'm going to try. We need everybody. We need everybody in at Right off the rip. Right off the rip. Kevin, be prepared to reg the door. So low on ammo. Oh, yeah. You just got to tell me what door, Mike. I'm I'm getting ready. All right, we got to run to where these scans are and stand in the circle. It's",
            "start": 6434.72
        },
        {
            "text": "be prepared to reg the door. So low on ammo. Oh, yeah. You just got to tell me what door, Mike. I'm I'm getting ready. All right, we got to run to where these scans are and stand in the circle. It's banging upstairs, I think. Upstairs, I think. Yeah, upstairs. 100%. Throw that grenade. I'm throw that [ __ ] grenade. Take it away. Stand the security skin, Kevin. Am I not? It works. Run down. Run down. Run down. Run down. Run down. Run down. ran down. So many bodies. Oh no, I have 2%. A lot of bodies. Another tag. Sorry. I'm coming. I'm coming. I'm coming. Laying out fire. I'm dead. One clip remaining. I'm I'm resing you. I don't think you should. No. We need everybody possible. Yeah, we all need to stand in these little spots. It's a terrible place to put my turret. I'm sorry. That's all right. We're fine. I think uh one coming. Yep. Big scan. Big scan. Everybody in the scan. It goes faster if everybody's in the scan. Get in there. Excellent turret. Excellent turret. I have no more",
            "start": 6484.08
        },
        {
            "text": "right. We're fine. I think uh one coming. Yep. Big scan. Big scan. Everybody in the scan. It goes faster if everybody's in the scan. Get in there. Excellent turret. Excellent turret. I have no more ammo. I died again. Melee. Just melee them. The scan is done. Scan is done. Just survive. Just survive. I'm dead. I'm down. Just a heads up. Don't [ __ ] die on me. We're all dead. Mike, no. Mike, leave my corpse. Mike, take him to Kite him down to my turret. Bring him down to my turret. I'm doing my best. Damn, this game is good. Let's give it up right now. Let's give it up. Let's give it up. Victor from 10 Chambers staying up late to play with us. Thank you so much, Big Dog. And thank you to Greg and Andy for the idea to come together and have some fun. And uh we truly appreciate everyone watching, supporting uh the team over at 10 Chambers for coming to play with us, especially Victor staying up on his late Wednesday night now into I'm sure early Thursday morning. Uh thank you homie so",
            "start": 6546.08
        },
        {
            "text": "supporting uh the team over at 10 Chambers for coming to play with us, especially Victor staying up on his late Wednesday night now into I'm sure early Thursday morning. Uh thank you homie so much, dude. Thank you so much for having me. It was a great time. Great time. Kind of funny. Uh so yeah, thank you for for having me. Everybody get excited for um for Den of Wolves, which is there's no date on anything yet, but if you like this sort of horror vibe, Den of Wolves is kind of a similar extraction thing. Uh single play or not single player, but it's not a multiplayer. It's all like just co-op uh multiplayer and uh a lot of similar sort of stealth things going on. Very very excited about that game. Yeah, check it out on Steam and Wishlist. Uh if you're at all interested, that wish list. Yeah, definitely wish list. Go support the devs. Check out GTFO if you and your friends want to jump into the fun now. Uh, thank you to 10 Chambers who gave away a bunch of codes and Andy gave away",
            "start": 6603.92
        },
        {
            "text": "Yeah, definitely wish list. Go support the devs. Check out GTFO if you and your friends want to jump into the fun now. Uh, thank you to 10 Chambers who gave away a bunch of codes and Andy gave away codes in the chat on both Twitch and YouTube. Don't forget to wish list their upcoming game. Go have fun. Denow Wolves right now uh over on the Steam store. And with that, it's time to say goodbye. That is the end of today full of content. We hopefully you had a great time. Don't forget tomorrow the boys will live react to the Mario Part Mario Kart Direct, but they won't do it until 1000 a.m. So, it's a normal day just with some fun goodies on top of that. So, tune in, have fun. We'll catch you all on the next one. Goodbye, everyone. Thanks. Bye, gamer. Bye. [Music]",
            "start": 6648.24
        }
    ]
}