{
    "id": 1724,
    "video_id": "3bwOD9tYqDI",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "First Games You Should Show Your Kids - Kinda Funny Gamescast Ep. 68 (Pt. 4)",
    "description": "What are the best games to show your kids?\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1462449601,
    "duration": 1175,
    "transcript_chunks": [
        {
            "text": "Kinda Funny Live 2 is happening May 28th and 29th, it's a 2-day event. The first day is going to be a completely ridiculous stage show what we have planned this year completely blows last year out of the water and I don't even know how that's possible cuz we were really stupid last year and this year's somehow even stupider. Day two it's going to be full day of meet and greets, we're hanging out with all of us, a bunch of Rooster Teeth people are there, Funhaus people are there, Achievement Hunter, it's going to be a grand old time, there's going to be some games to play, there's going to be signings, it's it's exciting, it's a really fun time, there's going to be exclusive merch. Oh yeah, this is definitely going to be exclusive merch. Go to KindaFunny.com to get your tickets today, there's a couple VIP tickets still available so make sure if you want one of those you act fast. Topic four of as always brought to you by the Kinda Funny forums go to KindaFunny.com SL topic",
            "start": 0.04
        },
        {
            "text": "a couple VIP tickets still available so make sure if you want one of those you act fast topic four of as always as always brought to you by the Kinda Funny forums go to kindofunny.com SL topic to submit your topic and we'll get to it just like we're about to do right now for my boy Juju that's J Jo okay so thanks for clearing that up yeah I want to introduce my kid to gaming okay what should I show them to set them down the path of greatness there's a big question I know and it's I like this is another reason I'm glad I don't have kids because I never have to worry about this you know what I mean but kids bring this the people this comes up a lot and I I'm always I don't know it's you know your child better you know what I mean like think about it this way right my gateway to gaming is Ghostbusters that's what I saw on the Toys R Us aisle that's what got me into it that's what got me in the door so I understand when people are like I'm going to do all the consoles in order and I'm",
            "start": 33.68
        },
        {
            "text": "Ghostbusters, that's what I saw on the Toys R Us aisle, that's what got me into it. That's what got me in the door. So I understand when people are like, \"I'm going to do all the consoles in order and I'm gonna have them play Mario and Metro and this and that.\" I'm like, \"I get that. I understand that.\" But does that really speak to what your child would want? I don't think it's necessarily wrong that well my kid loves Teenage Mutant Ninja Turtles and you're like, \"What's the best Ninja Turtles game on the market right now?\" And you give them that to see if they like the buttons and they like what's happening. And then start expanding their palette. Yeah, you know your child better than I do, believe it or not. And so I don't know his attention span or her attention span or how it all works out that way. That's what gets weird. I don't think you can go \"I like my initial reaction blanket\" I don't know kid I would do the most recent Mario yes that 3D World one so so that's my thing you're nailing on the head so the answer is",
            "start": 91.76
        },
        {
            "text": "I don't think you can go I like my initial reaction blanket I don't know kid I would do the most recent Mario yes that 3D World one so so that's my thing you're nailing on the head so the answer is Mario undeniably I don't think I think there's a whole bunch of other things that could be but I think Mario is the right answer um then the question becomes which one do you go with the modern one or you go with the original one there's definitely a train of thought that is oh they need to know where things came from I think that's the wrong train of thought I think you need to work backwards for that I think they will appreciate Mario 1 and Mario 3 and Mario World at some point if they get there that's the setting them down the right path I think Mario 3D World is actually a really great one because they can wrap their head around it pretty easily and it's pretty and it's cute and it looks great I would say Galaxy but Galaxy um just it's a a lot going on with Galaxys like and this sounds",
            "start": 127.48
        },
        {
            "text": "because they can wrap their head around it pretty easily and it's pretty and it's cute and it looks great I would say Super Mario Galaxy but Super Mario Galaxy um just it's a a lot going on with galaxy is like and this sounds weird Super Mario Galaxy is like a video game like there's things in there you like hopping and doing this and moving and trying to make jumps that I couldn't even make cuz I didn't I the **** perspective whereas I've been giving them a more normal a modern Mario that has all the sensibilities of the Marios we love works yep and I think Super Mario 3D World it's simple enough to like wrap your head around having said that you want to take that ultimate step and you really want to secure this mother in there down the path of greatness what you want to do is play Super Mario Galaxy and you want to give them the second controller cuz the second controller can just do all the Star Bits shoot things u i remember with Kevin's little brother back when he was three or four like this so this was like his first",
            "start": 167.12
        },
        {
            "text": "the second controller cuz the second controller can just do all the Star Bits shoot things u i remember with Kevin's little brother back when he was three or four like this so this was like his first video game experience I was playing Mario Galaxy because it had just came out and I was I was actually playing it gave him the second control he was shooting and stuff he he loved it like he fell in love with playing especially because he was playing with me and I think that there's a nice sense of just giving someone a controller and having them go is great and that's definitely a special thing but I think that the interaction the co-op that's what people love about video games and I think that if they're playing alone you need to be right there cheering them on that's obvious but when you're playing with them in a co-op game specifically like Mario Galaxy where it is a very simple thing that they're doing and everything you're doing looks impressive to them and like when they do something",
            "start": 208.04
        },
        {
            "text": "with them in a co-op game specifically like Mario Galaxy where it is a very simple thing that they're doing and everything you're doing looks impressive to them and like when they do something you're like yeah good job whatever that will get them hooked and addicted then as they grow up they'll become Super Smash Bros. Masters okay and it'll be awesome also Pat, upon you think so you think that's it I think that Final Fantasy VIII go for it Final Fantasy XIV one why I'm going to get eaten live in the comments for this one what is the **** Mech game I'm thinking original Xbox the giant controller the Steel Battalion Steel Battalion give him Steel Battalion and tell them like this is the pinnacle gaming has never been or will ever be and then they're be like this sucked I'm like a just kidding here's all this other awesome **** something great oh man that's hilarious Layman Elsa says else Layman else with the success of Portal and Portal 2 but no announcement of Portal 3 in the works",
            "start": 248.0
        },
        {
            "text": "Here's all this other awesome stuff, something great, oh man, that's hilarious. Layman Elsa says else Layman else with the success of Portal and Portal 2, but no announcement of Portal 3 in the works, why doesn't a smaller indie dev create a Portal clone? Ain to ukulele is to banjo; surely they can't have the rights to a game using Portals, and I would imagine it would sell 90% as well as an authentic Portal game if it was clearly a Portal clone. I think your numbers might be a bit off there; I don't think it'll sell 90% as well. I feel like there have been games that are similar - the woman who left Portal after Portal one, Quantum something like that (I'm almost there); where you... you oh I remember the Flashlights that they came out with; I'm going to Google but there - the answer is yes, there have been some, and it's a hard formula to nail. And you and you - I don't think like that one was all you were changing uh properties of things too, like taking a chair turning into a cloud and doing different stuff.",
            "start": 293.68
        },
        {
            "text": "some and it's a hard formula to nail and you and you I don't think like that one was all you were changing uh properties of things too like taking a chair turning into a cloud and doing different stuff like that so it wasn't exactly the same but it was exactly the same in a way but the problem with it P straight snoring right now I love it he's just a weird well it's not because he's asleep it's just cuz he's choking himself out cuz like it doesn't matter that this is completely there's no no reason he should try to sleep like this but he won't leave me so he's like I don't care that this is kind of killing me I'll do this whatever God oh this is going to drive me crazy but yeah they've done it before and like I don't think somebody could sue you for just using portals yeah they could they really could seeing as how we live in an industry right where like uh Portal had to change its name cuz rage was in it it's like okay yeah I know there's there's a lot of that stuff",
            "start": 340.0
        },
        {
            "text": "Could they really? Could seeing as how we live in an industry right where like uh, Phoenix Wright had to change its name because Rage was in it. It's like okay yeah I know there's a lot of that stuff going on also I think that biggest thing is that those games are not just good because they have Portal. Those games are obviously amazing because of the design and the philosophy behind them and all of the... it's like it's such a such a package and it's the puzzles are just pinnacles of game design so it's like just doing it again I don't think necessarily would be the right choice. I hope there's a Portal 3 that would be amazing, I would love there to be a port. Of course in Lego Dimensions, the level pack, it's a brand new Portal thing, new voice work, new stuff, new song at the end like that's highly recommended. Wolfenstein 47 how big do you think Pokémon Go will be basically could it be as big as Clash of Clans where even your parents who don't game are playing it I don't think it'll be that",
            "start": 379.0
        },
        {
            "text": "highly recommended Wolfenstein 47 how big do you think Pokémon Go will be basically could it be as big as Clash of Clans where even your parents who don't game are playing it I don't think it'll be that I mean I think Pokémon definitely has kind of a way of transcending ages and whatever but it's I don't think like parents are going to be playing Pokémon Go um I think it's going to be really big like it's it's kind of a no brainer right you like if you look at Pokémon sales numbers that's a franchise that is just killing I think it just crossed 200 million total um those are numbers those are real numbers you know they talk about the 3DS um lifetime sales for games and like obviously Pokémon X and Y are number one you look at the sales numbers for Pokémon on the GBA and they're just like it's ridiculous how high they are compared to everything else Pokémon um has not waned in popularity yeah like ever you know it just continues to be this behemoth um and I think that the idea of a Pokémon",
            "start": 416.6
        },
        {
            "text": "ridiculous how high they are compared to everything else Pokémon um has not waned in popularity yeah like ever you know it just continues to be this Behemoth um and I think that the idea of a Pokémon game on mobile that is fun and is kind of a unique is an idea of using the the AR and all that stuff um depending on price and all that stuff I think that it could be really big as big as Clash of Clans no no because this is so much easier just doing this on your phone is so much easier and then like doing this whole augmented reality thing is a step that's going to be a barrier for a lot of people I think Clash of Clans is one of those Perfect Storm games it's designed to be successful you know um it's not designed to be a good game it's designed to be successful to make money yeah to get going and I think that that's the it's designed to be quick addictive and to just grow that way so Pokémon Go is going to be a bit more of a game Quantum Conundrum was the game we were looking",
            "start": 459.16
        },
        {
            "text": "to get going and I think that that's the it's designed to be quick addictive and to just grow that way so Pokémon Go is going to be a bit more of a game Quantum Conundrum was the game we were looking at from Kim Swift, Kim Swift - I'd drive me crazy, I'm glad I got there in the end. Psychoo, psychoo, what's going on with The Division? I keep reading about these exploits and hacks that people have been abusing - it's not just once but multiple times. I find myself reading about a solution for the problem and a week later they find more problems. Do you think The Division is in danger of losing its community if this persists? I do, I'm still a member of the Division Reddit, proud. So every morning when I'm looking through Reddit and every night before I go to bed when I'm looking at Reddit, so many posts of people angry and that they're going to leave - and this is happening, they can't believe there was some guy just last night I was looking at who's like I reported these people with a",
            "start": 505.36
        },
        {
            "text": "so many posts of people angry and that they're going to leave and this is happening they can't believe there was some guy just last night I was looking at who's like I reported these people with a video for hacking and they're still there and do it's like it's of course as you all know there is a vocal minority of negativity on the internet and there's also a lot of hyperbole so the people who are popping up and say I'm done with the game probably not done with the game but you do start to erode from that where it's like especially you figure when the new Destiny stuff hit so many people jump back to Destiny so then you had it boiled down here and now if it is totally broken or seemingly even right optically me a Division fan who still keeps isn't hasn't been playing but it's keeping his eyes open to what's happening it seems like it's totally **** right now so when they announce the next thing the next expansion the next whatever is it going to be in my head and I'm sure it'll be",
            "start": 545.32
        },
        {
            "text": "eyes open to what's happening it seems like it's totally right now so when they announce the next thing the next expansion the next whatever is it going to be in my head and I'm sure it'll be in a lot of people's head of like well sure I could go do it but I know these people have whatever 2 million DPS because they use that glitch and this and like is it worth going in the Dark Zone anymore like I would say no probably right cuz I sh I'm probably going to get my head kicked in by somebody who's running around yeah it seems like that's where it's at and there's all these different yeah totally Reverse Flash says Hey guys with all the new modern features we have with games these days trophies and achievements online profiles High higher quality graphics and frame rates Etc do you guys ever find it difficult to go back and play older games for example I find it very difficult to motivate myself to play a game that does not have trophies I feel trophies have",
            "start": 586.36
        },
        {
            "text": "Etc, do you guys ever find it difficult to go back and play older games? For example, I find it very difficult to motivate myself to play a game that does not have trophies. I feel trophies have changed the way I play games, and for me to go back and play something like Final Fantasy X again, for example, it would need to have trophies and get an HD remake. How do you guys feel about going back? I agree 100%. I think that's a big part of it - where uh, I don't know if I'm proud of it, but like yeah, trophies... I mean, yeah, trophies have made it so that I feel I have a finite amount of time to play video games. Right? And even though trophies are stupid and don't mean anything and are just an annoyance, I like chipping away and adding to the number and seeing my percentage grow. So when it comes down to like, oh man, I haven't played this game, and it's, \"Oh, but it's a PSP classic.\" Oh, it's a PS2 classic without the real PS2 classic - now that they started doing those.",
            "start": 622.6
        },
        {
            "text": "when it does come down of like oh man i haven't played this game and it's oh but it's a PSP classic oh it's a p it's it's the PS2 classic without the real PS2 classic now that they they started doing it's a PS1 game right like if there's not that little bit of motivation and it's just a little bit there are dozens of games that I I have on my backlog that I have on the system things that sound cool these Indie experiences i haven't had a shot with and so if i've already lived this long not having played this game from the PlayStation one era do i really need to jump in and play it now yeah i i agree with you in the sense that there's a weird desire uh a weird delineation between games that count and games that don't count based on arbitrary factors like whenever i'm i'm like i got my Vita I'm on a plane I'm like what am I going to play right the decision usually boils down to is this worth talking about yeah you know like am I going to have something to talk about on Gamescast or on",
            "start": 663.6
        },
        {
            "text": "I'm on a plane. I'm like, what am I going to play? Right? The decision usually boils down to: is this worth talking about? Yeah, you know, like, am I going to have something to talk about on Gamescast or on One A Different Show, or even Talk Cuz Our Lives Are Con... so it's like, even though I want to play a lot of these games, like Final Fantasy Tactics. I still haven't played it. Um, and makes it sound like I love it. I like Final Fantasy; I love Fire Emblem. Final Fantasy Tactics sounds like a perfect version of them, so I'm like, I should. But every time I go to play it, I have a downloaded copy, and I've played maybe a couple hours of it. But every time I go back, I'm like, \"Oh, I should probably you know, do this or do that.\" There's a big thing, and this is... I don't think it's... I don't even know if it's so much unique to us because I think the viewers and listeners feel it too. Right? Is that in our hobby, this industry being a fan, there's such a currency to being current. Yep, to hey, I could play this.",
            "start": 705.44
        },
        {
            "text": "us because I think the viewers and listeners feel it too right is that in our hobby this industry being a fan there's such there's a there's a currency to being current yep to hey I could play this game that just came out on the PlayStation 4 like there's a whole bunch of new ones well have you seen heard about this one where uh uh Magic something or other but where you are the main you your character is a character in an unfinished RPG I believe what it is and you're exploring this world that isn't finished and trying to get around and like I'm like that sounds **** a awesome yeah and I can if I get a chance to play that this weekend I'll have a gamescast thing to talk about and come talk about something new or that that people don't know about whereas if I go home and I keep playing Chrono Trigger which is an amazing game fantastic game that I started over Thanksgiving when I had nothing else to play if I go and play that that's not really that's not adding to the conversation",
            "start": 746.2
        },
        {
            "text": "Chrono Trigger, which is an amazing game, fantastic game that I started over Thanksgiving when I had nothing else to play. If I go and play that, that's not really adding to the conversation because I feel like who you don't need me to tell you Chrono Trigger's awesome and nobody's sitting around right now going, \"You know man, I would love to talk about Chrono Trigger.\" Wonder what Greg Miller thinks about exactly. It's it's more of a value to me to be able to say this new game for PlayStation is awesome and I think in our audience is the same way. I feel like where they do podcast and they have friends and da da da, and it's like sure there's retro podcasting and all the different stuff but the value to it is being able to be current and even that that comes in with trophies because trophies are building on this currency of like okay well now I'm level 26 with 26% of the you know yeah. There's a game that a demo came out for it a couple days ago, I think it's called Neo, yeah yeah.",
            "start": 791.32
        },
        {
            "text": "trophies are building on this currency of like okay well now I'm level 26 with 26% of the you know yeah there's a game that a demo came out for it a couple days ago I think it's called Nioh yeah yeah and it's it's like very action Musou-esque I'm hearing it's action Musou meets Dark Souls um and I'm not really I'm not a Dark Souls guy definitely an action Musou guy so in looking I'm like **** I want I definitely want to play this I I have no time to play it I wish I did because I want to and I want to talk about it but it's like if I miss the window of the next week playing it um one I think it is off the PSN by next week but also um I'm not I'm just not going to like there's like it's not that there's no point but I feel like there's no point it's also I mean this also comes down to stuff with your taste when we talk about this all the time I feel like there's like checklist and like a rundown of like order of importance on what you're going to play so like for sure trophies are on there",
            "start": 827.16
        },
        {
            "text": "your taste when we talk about this all the time I feel like there's like a checklist and like a rundown of like order of importance on what you're going to play so like for sure trophies are on there but it's like Battleborn right like Battleborn whenever I talk about it whenever I see like you want to talk about indie developers who are like they love their product and they want you to give it a shot like Gearbox like I went and did the panel with them right and like they weren't talking to sell you on it they were just talking about like all the blood and sweat and tears that went into this and how proud of it they are and like their lore and D I'm like yeah I want to play Battleborn now cuz I I want I like where who you are and what you're talking about and you know I loved Borderlands obviously and but it's Battle I'm you know going to get and I'm going to put in and I'm going to do a couple rounds of it and if it's like oh this is very MOBA or oh this just I don't",
            "start": 866.6
        },
        {
            "text": "Borderlands obviously, but it's battle I'm going to get and I'm going to put in and I'm going to do a couple rounds of it. If it's like, \"Oh, this is very MOBA\" or \"oh, this just doesn't have a character like it's over right.\" Like, that's CU, and this you know we're always very clear that like we're lucky enough to get so many games for free, so we're in this thing. But I know talking to our viewers they're the same way in terms of stuff they've bought right where it's like, \"Cool if I don't enjoy this, it's on to the next thing cuz I have so many my backlog is huge.\" How many you know we do these Hangouts with the people from Patreon and you look at their lit and like all their games are wrapped in cellophane because they're the same crazy people we are where it's like, \"Yeah, I want that code yeah I want that game yeah I will buy this game.\" You know I went through like I the other night I'm downloading a bunch of stuff right and it's all taking way too long I was like oh right all",
            "start": 903.48
        },
        {
            "text": "\"Code yeah, I want that game, yeah, I will buy this game. You know, I went through like I, the other night, I'm downloading a bunch of stuff right and it's all taking way too long. I was like, oh right, all those uh, Pac-Man and Galaga, all that. I went and bought those because I'm like, I want to play those, and I did like what seven minutes of Galaga, and then I was like, all right, this is, I'm yeah, this is fine. Uh, to go back to the question though about the the playing older games, I think for me, I love older games, like that they're, I don't think I'm ever going to love new games as much as I love old games, just something that's who I am coming of age there's attachment to it, yeah, for sure. And uh, it is weird going back though, for a bunch of little reasons when they add up, it's it's that you know the Gestalt of them all uh, that causes the issue because I'm fine playing them but it's like oh man the loading is kind of bad and then it's like oh man unskipable cut scenes like why it's all I got to\"",
            "start": 939.12
        },
        {
            "text": "Gestalt of them all, that causes the issue because I'm fine playing them, but it's like, oh man, the loading is kind of bad, and then it's like, oh man, unskippable cutscenes. Like, why? It's all I got to go find this save point, where was the save point? Save points, right? And it's like, it's all or memory cards not working, or your save file being deleted. Like, all these problems that... well, besides that, don't happen anymore. Alienation, and it's if it was just one of those things, it wouldn't be that bad, but it is the fact that what game design used to be so it's all of them on top of each other. No buyo, um, you know what we're going to stop there. Bye. That topic brought to you by Squarespace. Whether you need a landing page, a beautiful gallery, professional blog, or an online store, it's all included with your Squarespace website. Creating your website in Squarespace is a simple, intuitive process. You can add and arrange your content and features with a click of a mouse, and Squarespace makes",
            "start": 978.52
        },
        {
            "text": "with your squarespace website creating your website in Squarespace is a simple, intuitive process. You can add and arrange your content and features with a click of a mouse. And Squarespace makes adding a domain to your site simple if you sign up for a year, you'll receive a custom domain for free for a year. Design a best-in-class online store with Squarespace's award-winning templates, customizable settings, and more - all without a single plugin. You know Greg, I don't like them plugins; I hate plugins; they complicate the stuff. The plug and the drivers, yep, all the same from nationally recognized brands to your favorite local shops to the original Kinda Funny website, Squarespace is trusted by hundreds of thousands of savvy shop owners around the world. Including all the tools you'll need to track inventory, process orders, and send custom emails in one intuitive interface. Squarespace offers 24/7 customer support, and every member of the customer care team is an experienced Squarespace worker",
            "start": 1024.56
        },
        {
            "text": "inventory process orders and send custom emails in one intuitive interface Squarespace offers 24/7 customer support and every member of the customer care team is an experienced Squarespace worker working in a Squarespace office that's service right there Greg cuz a lot of it's time it ain't that at all I hate that **** when you call somebody and they like clearly like at a call center they're talking about yeah no come on Bros no matter how technical your problem or trivial seeming your question one of our teams is always there to online is always online to assist you one of our team members is always there to help start your free trial day at squarespace.com and enter code kinda funny to get 10% off your first purchase get ready for this one Greg Squarespace set your website apart build it beautiful I love it you should you should um I'm really bad about taking notes you're doing fine look at this you got horrible penmanship but you got the numbers down that's all it really matters do the",
            "start": 1060.64
        },
        {
            "text": "I love it, you should, you should um I'm really bad about taking notes, you're doing fine, look at this, you got horrible penmanship but you got the numbers down, that's all it really matters. Do the numbers are all wrong, ladies and gentlemen, thank you for joining us for this Gamescast Extravaganza, this is fun, this was good. You want to do an exclusive episode from patreon.com, all right, you and me want to want again, you want to do the topic where we're talking about that there's too many games and is that a good or bad thing? What that means for us, that we kind of got into it a lot there at the end. We'll extend this topic, we just did it, it'll be great. You guys want to hear us talk more, no, I see mine's different, it's different, you got a whole bunch of different things to say, I'm not going to talk about the old stuff, I'm not going to talk about trophies, I got different things to say about if not we do that other one, I gave you the other one that you said wasn't a full one, if we if if we start into",
            "start": 1100.56
        },
        {
            "text": "the old stuff I'm not going to talk about trophies I got different things to say about if not we do that other one I gave you the other one that you said wasn't a full one if we if if we start into that the topic for the Gamescast like oh that wasn't good and we just bounce out that other one okay see you next time love you bye I'm G to sneeze maybe yeah I was like what's happening with you I don't think I'm going to anymore okay my body shut down the sneezing with the ribs oh like yeah oh no like this and now that I'm feeling a little bit better like I've done the one right like do the one sneeze and the body's like that was a mistake no you don't have anymore don't worry about it",
            "start": 1139.08
        }
    ]
}