{
    "id": 1737,
    "video_id": "hmGUWiHa1eA",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Game of the Year So Far - Kinda Funny Gamescast Ep. 69 (Pt. 2)",
    "description": "What is our game of the year so far?\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1462881601,
    "duration": 993,
    "transcript_chunks": [
        {
            "text": "Kinda Funny Live 2 is happening May 28th and 29th, it's a 2-day event. The first day is going to be a completely ridiculous stage show but we have planned this year and it completely blows last year out of the water, and I don't even know how that's possible because we were really stupid last year and this year's somehow even stupider. Day two is going to be a full day of meet and greets; we're hanging out with all of us, a bunch of Rooster Teeth people are there, Funhaus people are there, Achievement Hunter it's going to be a grand old time. There's going to be some games to play, there's going to be signings, it's it's exciting, it's a really fun time. There's going to be exclusive merch; oh yeah, this is definitely going to be exclusive merch. Go to KindaFunny.com/tix to get your tickets today; there's a couple VIP tickets still available so make sure if you want one of those, you act fast. Topic two: we're going off the crazy theme from the day and we're going to talk about some real games.",
            "start": 0.04
        },
        {
            "text": "couple VIP tickets still available so make sure if you want one of those you act fast topic two we're going off of the crazy theme the day we're we're going to talk about some real games cast because I know people out there love it we're talking about game of the year so far oh yeah last year throughout the year we did these topics to kind of catch up on some stuff we're now in April no we're we're in May yeah damn a lot of games have come out right what jumps to your immediate attention Uncharted 4 of course me too right me too I mean like I it's I think it has to be Far and Away in the lead right now you if I mean by when we're recording this right it's the the embargo posted this morning all these five stars all these ten all these nines all these 8.8 like people love this game and it's clear why it'll always be the interesting thing of will it make it by the end of the year right because again Uncharted is was obvious it was obvious this game's going to be great it",
            "start": 33.8
        },
        {
            "text": "game and it's clear why it'll always be the interesting thing of will it make it by the end of the year right because again Uncharted is was obvious it was obvious this game's going to be great it was obvious going to be B but it all works against it by the end of the year that well sure we expected Uncharted to be great but game wide that came from this Indie Studio that we didn't know and did this that and the other and set the world on fire didn't hurt The Last of Us though in 2013 sure don't me wrong that's the thing but I mean like you know but there's always that thing with sequels where you have this game that's it's Fourth and addition I think it'll work to its benefit that it's the last Uncharted this is your last chance to give an Uncharted gaming game of the year I think this has been a good year so far um well Uncharted I think comes to mind think Uncharted obviously is the game to beat in terms of fun I think Ratchet and Clank is the game to beat um and like Ratchet & Clank",
            "start": 87.12
        },
        {
            "text": "been a good year so far, um well Uncharted I think comes to mind. Think Uncharted obviously is the game to beat in terms of fun. I think Ratchet & Clank is the game to beat, um and like Ratchet & Clank I think is a way more fun game um than Uncharted. And and plays better. I actually think that Uncharted's not gameplay is King typically, but I think Uncharted is really one of the examples where I'm like, \"Is it really King in this game?\" I don't think so. I mean they're you know the king of third person shooters, even Gears of War is way better, Vanquish is way better, there's a bunch of third person shooters that are better but that's not what we're playing Uncharted for um so I was listening to the review yesterday after we because we I had I had reviewed it with you guys you had beaten and you were very patient with me and and and uh waiting for me to beat it um and I beat it yesterday and I was I was kind of Blown Away by it, the end and um it went a different direction than",
            "start": 124.88
        },
        {
            "text": "and you were very patient with me and and and uh waiting for me to beat it um and I beat it yesterday and I was I was um kind of Blown Away by it the end and um it went a different direction than I thought I was going to go I didn't expect it and I don't think anyone is expecting the end of the the game which I think is going to be fun for a lot of people and I was thinking about it I'm like well this is just one of those examples where like gameplay just isn't as important as it typically is it's totally competent I think above average in its gameplay but it's just everything else in the game is so fantastic that um it's very similar to The Last of Us in that respect like The Last of Us wasn't like an amazing game to play it was an amazing game to experience and and I think that so I think Uncharted is definitely the game to beat um and I will be shocked if anything does beat it to be on really yeah yeah I mean I'm right there with you obviously it's my number one I I even Ratchet",
            "start": 164.48
        },
        {
            "text": "Uncharted is definitely the game to beat, and I will be shocked if anything does beat it to be the one. Yeah, yeah, I mean, I'm right there with you. Obviously, it's my number one. I even Ratchet, I absolutely adore Ratchet and love Ratchet. I had way more fun playing Uncharted, and I think that it's not necessarily talking about the gameplay but as an experience all of that does go out the window because it was so much fun, and I couldn't stop thinking about it. Ratchet when I was playing it, I could step away from it for a bit; Uncharted just had me totally, and even now that it's done, even though I'm not playing it anymore, it's like all I can think about—it's all I want to talk to everybody about—and I wonder how long that'll last. And the good news is I think it will last through the rest of the year; I think that this is going to be a game that we keep talking about going back to forever in the same way we do about the other Uncharted, Ratchet and Clank. I don't think we're done with it yet.",
            "start": 203.2
        },
        {
            "text": "of the year I think that this is going to be a game that we keep talking about going back to, Forever, in the same way we do about The Uncharted series. Um, Ratchet & Clank - I don't think we're going to be talking about much of it, no. I don't think so either. But it's funny; in a weird way, Ratchet had me hooked more because it was not expected that it was going to be as good as it was, and I was just like kept remarking to myself, \"Wow, this is fun! Like, I'm having fun - look how much fun I'm having.\" And Uncharted is a fun experience, but it was an experience; it was like watching a movie. It's like I almost didn't want to play it sometimes; I'm like, \"I just wish that I could...\" Erin remarked to me, saying these things - meaning the cut scenes were like my favorite part. I'm like, \"Mine too, you know?\" Like so, like I wish that...like you know, it's fun walking around looking for treasure and fighting in these gun battles and platforming and all that kind of stuff.",
            "start": 241.12
        },
        {
            "text": "part I'm like mine too you know like so like I wish that like you know it's fun walking around looking for treasure and fighting in these gun battles and platforming and all that kind of stuff and grappling and whatever but I really enjoyed just the story and then that story is fantastic so I I would say Uncharted is the game to be for sure um and then I would say Ratchet & Clank and I would give a shout out to The Division um The Division's interesting I would uh and they're small I give a shout out to Layers of Fear I my my second in my list of Game of the Year right now would be Uncharted and then it be Severed like I love was such a great pack so much fun Severed was the same way I feel like on paper I shouldn't like this game holy crap I'm having such a great time and I'd put it down like I really want to keep playing I wish this plane ride wasn't ending I wish this wasn't happening I wish I could keep playing yeah that for me that experience was Fire Emblem Fates",
            "start": 277.92
        },
        {
            "text": "down like I really want to keep playing, I wish this plane ride wasn't ending, I wish this wasn't happening, I wish I could keep playing. Yeah, that for me, that experience was Fire Emblem Fates and I... I was not too excited for it just because I didn't really like the art style of the characters going into it. I was in love with Awakening so much, so when it came out, I kind of wasn't anticipating it. So when it got there, I was kind of like, \"I'll get it when I get it.\" Started playing it and I'm like, \"Man, damn, they got me,\" I'm hooked. And the fact that that game kept giving me more because there's three games to play... um, it did not for me on planes where it's just like it never ends, there's just more and more and more. Now there's DLC coming out. I just think Five Houses has this very special uh gameplay where it's just... and especially portable, it's great. Where it's pick up and play, you can do one mission and you're done and you can do another one and it's like you don't get lost in",
            "start": 316.76
        },
        {
            "text": "gameplay where it's just and especially portable it's great where it's pick up and play you can do one mission and you're done and you can do another one and it's like you don't you don't get lost in the same way you do with a bunch of RPGs you know like because it's more of a just a tactical game like I I just think that they do a really good job of condensing it down into bite-sized pieces that are still very substantial and they you always you feel like you accomplish something and it keeps me thinking about the next time I'm coming back to play now you were more up on it than us is Firewatch on your list anymore yeah I think Firewatch is definitely on the list um for right now like in terms of ballot last year when we ended the year we did our game of the year discussion we had 10 games each Firewatch would definitely be on that I don't think it's going to leave interesting um and yeah CU 10 10's a lot yeah you totally um I think Firewatch it's it was a great experience and again",
            "start": 355.84
        },
        {
            "text": "each Firewatch would definitely be on that, I don't think it's going to leave an interesting um and yeah CU 10 10's a lot, yeah you totally um I think Firewatch, it's it was a great experience and again I said this even during the review I didn't necessarily have fun playing it, I think it's kind of like what you're saying about Uncharted to a much lesser extent cuz you still have fun playing, I didn't really have fun playing the game but I was so interested by it that I was compelled to keep going and I looking back at it I love the story um and that's subjective but it is definitely like I I enjoyed it, I thought it was great and I thought that as a story based game it did exactly what I needed it to and it didn't overstay its welcome which it very well could have sure um just see what else we got going I want I mean another I probably I don't know if it's number three because this is kind of just like a list or whatever but I mean Quantum Break was on there for me, I loved Quantum Break",
            "start": 399.6
        },
        {
            "text": "we got going I want I mean another I probably I don't know if it's number three because this is kind of just like a list or whatever but I mean Quantum Break was on there for me I loved Quantum Break, not \"great\" - it's a game title. Fusion like I've said a million times in this show and talked at length about of playing a game but watching a movie or television series or whatever you want to do but a great narrative that I really really had a fun time with yeah I want to give a shout out to a couple games just because I'm sure we're going to get a million comments on them these aren't our Cups of Tea but like this year has been a great year for gaming so far for so many people with the Witness, XCOM 2, Stardew Valley, Hyper Light Drifter, and Dark Souls 3 - those are all games that we're aren't necessarily things we're going to play but like it seems like people absolutely love that Stardew apparently coming to console now we'll believe it when we **** play it we get some trophies you know what I'm saying over here",
            "start": 439.52
        },
        {
            "text": "play but like it seems like people absolutely love that Stardew apparently coming to console now we'll believe it when we **** play it we get some trophies you know what I'm saying over here but yeah The Witness is a great one to put on there too yeah cuz you're exactly right popped it in played it for like whatever a couple hours and I was like not for me but I see why people love it and it's beautiful I totally understand why people would want to be part of this why they' get into this and starty Valley yeah that that's definitely one that has my interest but not enough for me to sit down and play it on a PC or whatever just so many other games to play and screen but that's type of game that once it gets on V I want to see how interested you I bet it only be on p ps made to that seems like a ride up your alley sure no I agree with you 100% yeah it's just not there so there there are more yes to to discuss I think so um some of these games didn't come out well some some of some",
            "start": 476.52
        },
        {
            "text": "like a ride up your alley sure no I agree with you 100% yeah it's just not there so there there are more yes to to discuss I think so um some of these games didn't come out well some some of some of them didn't yeah that's where it gets tricky right Alienation clearly going to be on that list I haven't spent enough time with it but I I mean for what I I mean the game is going to be awesome I mean that's definitely going to be on my list and The Gunhouse was really cool on PS4 but I I don't know why I put on my list Hitman Go definitely would be on my list on Vita F1 Play would definitely be on my list interesting um and you really like f play yeah I think Far Cry Primal was really cool played I dumped a bunch of time into it um Saturday Morning RPG which came out on Vita and PS4 this year but is actually an older PC game um I think would definitely be on the list and uh I'm assuming you'd want to give even though you haven't touched it yet Shadow Complex Remastered yeah sh mean obviously yeah",
            "start": 518.12
        },
        {
            "text": "is actually an older PC game, um, I think would definitely be on the list and uh I'm assuming you'd want to give even though you haven't touched it yet Shadow Complex yeah, sh mean obviously yeah that's probably going to be I I don't know that I can resist Shadow Complex so um so there are a lot of it's a very I feel like there's been a lot of good games even great games but amazing Game of the Year games it's like what would I give nods to ex I mean for me Amplitude I would totally give it that was on my list last year cuz technically for um not Patreon backers back Kickstarter backers they got it the week before um the year ending 2015 but it was the first week of 2016 so I'm going to count it and it's definitely going to be on the list I spent so much time in that game and it is is just perfection I'll allow it um yeah Firewatch Digimon Story Cyber Sleuth not going to be on my list uh it's cool people really like it it was a little too grindy for me and it was just way",
            "start": 560.68
        },
        {
            "text": "it is is just perfection I'll allow it um yeah Firewatch, Digimon Story Cyber Sleuth not going to be on my list uh it's cool people really like it it was a little too grindy for me and it was just way too long um it's fun it's cool I just it's not what I'm looking for uh in a game Unravel no way you didn't like Unravel no totally I was like what is going on why is this that super hot I played through it on PC it's now on Xbox One, Xbox One I loved it I love it because it's short we did that let's play I loved it too but I yeah I need to sit down I got Xbox One version I haven't sat down to play it because it's short isn't it it's very short and it's one of those games I would definitely put on my list I think it's it's a lot of fun and it again it's reason to replay it or anything like that I mean and I'm not like saying justifies purchases I replaying isn't so much my my thing so like I would I would never replay it um but it's great but I also would never replay Portal and I absolutely",
            "start": 598.28
        },
        {
            "text": "mean and I'm not like saying justifies purchases I replaying isn't so much my my thing so like I would I would never replay it um but it's great but I also would never replay Portal and I absolutely love Portal sure you know I think that they're similar in the sense that like it's a great experience through and then you think about it a lot afterwards gotcha uh Bravely Second again I haven't played it have you given the Bravely: The Dark Rising people people that said I'd love it because it's job it's class based job based but no that would require me to play 3DS and I I don't even know where my 3DS is at this point Twilight Princess HD came out cool uh Pokken Tournament loved it like me and Kevin did the let's play that was fun I play with uh my room every once in a while and when we're bored to smash and it's cool it's a fun diversion people seem to really like it and it's getting a lot of pickup in the tournament scene so that's good uh Fox Zero no no no no uh The Walking Dead: Michonne no way yeah",
            "start": 638.0
        },
        {
            "text": "and it's cool, it's a fun diversion, people seem to really like it, and it's getting a lot of pickup in the tournament scene, so that's good. Uh, Fox Zero, no, no, no, uh, The Walking Dead: Michonne, no way, yeah, cool. Did episode three come out? Yep, and you beat it? Yep, man. No, it's it was the inverse where it was like um episode one was fine, oh episode two was oh episode 3 is fine, you know what I mean. Party Hard, yeah, came out on PC last year, it's now on PS4, that game is awesome, yeah, that game, that game is really cool, game, yeah. Um, that's it, pretty, that's my list, I'm sure we're going to miss something, but I I feel like there's definitely a consensus Uncharted three or four is miles away and that'll be that's what's going to be fascinating to see what happens in the fall and what actually makes it out this year and where all that goes and if what if Persona 5 gets out this year, what does Final Fantasy end up doing, is Horizon going to hit this year? Persona, yeah, Persona, I do it's coming out in the",
            "start": 679.72
        },
        {
            "text": "this year and where all that goes and if what if Persona 5 gets out this year what does Final Fantasy end up doing is Horizon going to hit this year Persona yeah Persona I do it's coming out in the fall in Japan right I assume that they're September 15th in Japan love it I love it that's so awesome sh get shot so bold I really still think that Persona in way is going to eat final fantasy's lunch I don't think that I don't think that it's going to be eat it lunch in terms of sales it's going to very well I I I I'll I'll bet that it's going to score way higher on Metacritic them um so I think it'll be a bigger critical hit the game looks **** awesome I was you watch like it's so stylish um so I'm really really stoked about that and I'm not a Persona fan I just think that it's so refreshing to see something that's different you know that's not a boy band running around in a car and that's not the Tales that's that's that's not Taal's either like I'm a huge Tales of fan but it's kind",
            "start": 727.76
        },
        {
            "text": "to see something that's different, you know, that's not a boy band running around in a car, and that's not The Last (that's) that's not Tales either; like I'm a huge Tales fan, but it's getting very samey now. They wish they'd kind of go away for a little while now; it's like 15 of them, it's like okay, they're great games, I love them, but that last one was left much to be desired. Um, so that was really cool news to see, or whatever, but what I was going to say is my takeaway right now is that we were talking on PS4 about kind of the dir (of) PS4 exclusives like triple exclusives that are really worthwhile and in terms of like AAA exclusive; so I love Ratchet & Clank and all the Horizon Zero Dawn stuff, but I mean in terms of like you go into a store and you spend $60 or $40 because Ratchet's a AAA game; um, Bloodborne was really the only one that was like really, really amazing to a lot of people, and I think Infamous: Second Son and Killzone were kind",
            "start": 764.6
        },
        {
            "text": "and you spend $60 or $40 because Ratchet's a AAA game, um Bloodborne was really the only one that was like really, really amazing. I think to a lot of people and I think Infamous and Killzone were kind of on a below that level, and then everything else like Knack and The Order – everyone can kind of take her leave. And it's so funny that within a 3-week period or so, or less than a month, Ratchet and Uncharted are coming out, which are basically the first and second best exclusives on the console. And so my takeaway is that PS4 is finally getting its games. I mean those two games alone justified my PS4 entirely – not that I didn't have great experiences before – but in terms of like exclusive stuff, it's done it's like that is totally worth the investment because they are amazing. Yeah, it's really cool. I, it's cool to see uh I didn't really expect it. I knew that Uncharted was going to be awesome um I didn't know Ratchet was going to be as awesome as it was but both kind of",
            "start": 798.28
        },
        {
            "text": "yeah it's really cool I it's cool to see uh I didn't really expect it I knew that Uncharted was going to be awesome um I didn't know Ratchet was going to be as awesome as it was but both kind of exceeded my expectations in their own way Uncharted definitely exceeded my expectations because I was kind of tempered down a little bit on it but it you know by the time I beat it I was like really quite quite high on it I wish I could almost do our review again because I think I would be a little less critical of it um but good news you can there's a spoiler cast that we're recording right after this so live on Monday so I mean Uncharted it's a must play game and and I I like thinking about the games that are coming out for the rest of year I really do think it's going to be very hard to beat it um I mean you figure in terms of big budget stuff what would you be looking at you'd be looking at Doom you'd be looking at Gears you looking going to do it I know I'm not say I don't don't get me",
            "start": 835.04
        },
        {
            "text": "it um I mean you figure in terms of big budget stuff what would you be looking at you'd be looking at Doom, you'd be looking at Gears, you're going to do it, I know I'm not saying I don't get me wrong this isn't saying I wish I hope it does that' be awesome, Doom would be charted but I just can't imagine that's going to happen, Doom, Gears, Horizon if it doesn't get pushed yeah, Horizon I don't think is going to make it the yeah you yeah, Gears I think is going to be a competitor um you know you have your big your big guns like Call of Duty, I mean you might get a new Battlefield, Titanfall might come out um um so I there are some games that are coming out Final Fantasy might be great, Persona might be great um I think they're both probably going to be great what are the chances of theyy Henning Star Wars game coming out this year no oh no no way you think so that's a next year game do you think we'll hear about it E3 at all I would say it's even announced next year maybe not even really next year",
            "start": 869.64
        },
        {
            "text": "game coming out this year no oh no no way you think so that's a next year game do you think we'll hear about it E3 at all I would say it's even announced next year maybe not even really next year figure next year's going to be Mass Effect another EA space game like and I granted different things Star Wars is Star Wars but yeah I don't know that that game's even close to being ready so not that I know much about it but uh that sucks I want it yeah so I I mean I think what we see is what we get this year except for maybe I think Death Stranding might be a game that we that might come out this year and I think that um that's not announced yet maybe he'll get something from Bethesda something I well Dishonored it's coming out um no Zelda so yeah yeah so I mean I just I think there's going to be a great game Mirror's Edge people are going like DSX is coming out people I mean these are their game Homefront I think is going to be really good there are games that are people are going to enjoy",
            "start": 907.52
        },
        {
            "text": "a great game Mirror's Edge people are going like DSX is coming out people I mean these are their Homefront I think is going to be really good there are games that are people are going to enjoy but I don't know that Uncharted 4 is a once twice maybe three in a generation kind of game I think it's very similar to The Last of Us, Uncharted 3 and Uncharted 2 um so I just what does a game have to do to beat it yeah I mean it would have to be something that comes out of I I think independent it would have to be like your Gone Home or whatever your Journey is like I think that it is going to require some small developer you don't know what you're getting and then all of a sudden you're like holy **** this just rocked me and then everyone's talking about that yep yep yep yep Cool too big to fail they call it too big like Enron to fail like Enron yes Enron was too big to fail that's true f",
            "start": 945.44
        }
    ]
}