{
    "id": 1769,
    "video_id": "jlTxSWUSO_0",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What Is Rocksteady Working On? - Kinda Funny Gamescast Ep. 71 (Pt. 4)",
    "description": "We theorize about what Rocksteady is up to.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1464267601,
    "duration": 1119,
    "transcript_chunks": [
        {
            "text": "We know a Tony or huge Overwatch fans, and we are grateful for their support of Kinda Funny Live. Thanks again to the Overwatch teams at Blizzard and Activision. Are you excited for Overwatch? If you haven't bought it yet, check out Amazon.com/Overwatch to learn more about the game. Kinda Funny Live is this Saturday and Sunday. If you haven't got your tickets already, go get them at KindaFunny.com/tickets. All right, as always, \"File Top of the Day\" brought to you over other Kinda Funny forms. Go to CalifornyCalm/GamesCast topics. Hold on again, make a note to Kevin again. Yeah, you're Kevin. It's been 18 minutes since I last talked to you. Ryan Moroski says, \"What do you think Rocksteady is up to now? Did they go make a new IP?\" Good question. Oh, that's a great question. Yeah, I bet they're still... I bet they're doing... They'll do another licensed game. I think that they saw what worked with Batman; they saw the critical acclaim; they saw the millions of fans, and I think",
            "start": 0.0
        },
        {
            "text": "We theorize about what Rocksteady is up to. I bet they're still working on another licensed game, I think that they saw what worked with Batman: Arkham - they saw the critical acclaim and millions of fans, and I think they want to keep going with that. I'm sure WB is still trying to get them to pick up something, and I'm sure because when you let a developer finish their trilogy, ignoring the origins that weren't theirs, let them finish that. I'm sure WB's like, \"What's next? What do you want to do? Do you want to take on this character? Do you undo this? Do you want to do Justice League? Do you want to do a Batman Beyond game, which is my dream come true?\" But there are so many different things. I would still say they're gonna be doing a comic book game, a licensed game. Yeah, I would agree. The thing though is that they have a lot of license to do whatever they want now. So um, there are people.",
            "start": 55.08
        },
        {
            "text": "be doing a comic book game, a licensed game yeah I would agree, I mean the thing though is that they have a lot of license to do whatever they want now so um there I'm sure that there are people there that are creative who want to do their own game but I just don't know that that's the smart move for them, they can build a war chest and like a lot of games as long as they keep doing well they can build up a lot of clout which I think that I think they frankly they lost a little bit of clout with the last Batman game so I really yeah document yeah I think that a lot of people weren't crazy about that game and I think that I think they have obviously I think that they probably I think that's why I think they do stay in with comic books, excuse me, I think they feel like they have something to prove and something they're not good at, I mean they began with a bad game it was good it was it was just not nearly as good as Arkham Asylum, see that's what I was saying I think that they had a bit of an issue",
            "start": 91.44
        },
        {
            "text": "We theorize about what Rocksteady is up to. They began with a bad game, I mean it was good, it was just not nearly as good as Arkham Asylum. That's what I was insane about, I think that they had an Uncharted syndrome of just like, \"All right, cool, Arkham City was awesome, Arkham Knight is kind of the same.\" There's this tank, should I hate you know? I mean it would still be a great game, yeah. It just wasn't as good as Asylum and especially City. I think like that game, no one even talked about that game after like two months, like it wasn't in the Game of the Year discussion at all. I think they have something to prove. I think they overthought that game. I think that it's clear that they felt like they had to change too much and they didn't have to change much at all to make it good because their production value is so high, the writing is so on point, it's just like they need to go back to the basics.",
            "start": 125.04
        },
        {
            "text": "they had to change too much and they didn't have to change much at all to make you know because their production value is so high the writing is so on point it's just like they need to go back to the drawing board and I think tweak some things remove some things tweak that gameplay which i think is getting a little tired and a little stale but i think my guess is that it would be like Justice League related yeah i think i think that they obviously stay with one or others they stay with DC but they could do whatever they want i could see them do another Batman game just a different Batman you don't mean there's so many different versions of Batman and alternate universes I could I wouldn't want that I would much rather see them make a Superman game see them make a Daredevil game see them make a Ninja Turtles game like there's a million other grounded heroes that fight in an open world that I'd like to see but I got also seem to be like well Batman's still the biggest thing going",
            "start": 158.7
        },
        {
            "text": "a Ninja Turtles game, like there's a million other grounded heroes that fight in an open world, that I'd like to see, but I also seem to be like well Batman's still the biggest thing going, how do we somehow capitalize on that, maybe it is just we what if we make a one in the DC Cinematic Universe, what if we do a bat flick game, it would be cool to see Batman again, I just I think that's selfish me to want that cause I think yeah don't get me wrong I'm right there with you because he them do Superman too I think no I agree on person John Horgan wants to know what video game characters would you like to see in a crossover game not smash bros tight butts story mode centric couple years ago there was a big rumor going into III as there ought to be where a game called Nintendo Fusion was being talked about and it was going to be Metroid and Star Fox story based stuff and I was like that is awesome at this point I do not want that at all but a couple years ago yeah I wanted that",
            "start": 193.44
        },
        {
            "text": "being talked about and it was going to be Metroid and Star Fox story based stuff and I was like that is **** awesome at this point i do not want that at all but a couple years ago yeah I wanted that real problem is I feel like it's hard to do that and not have it be super cheesy or not work we're **** Samus is talking to us Fox man know what the hell am I doing wrong another crazy ass aliens and **** Ryu but still like it was cartoon Fox and I'm this badass bounty hunter what are we making this work yeah I don't I want that stuff I don't really like that I like things to kind of exist on their own that's why so I don't wanna spoil anything I love crossovers I love them all I feel like there's a very special place for a minute you said not smash type but like Marvel vs Capcom to me is always such a special game just because you get all the characters together and it's like I liked the even taking out the gameplay of that and it because it is just people together the stupid",
            "start": 237.03
        },
        {
            "text": "me is always such a special game just because you get all the characters together and it's like I liked the even taking out the gameplay of that and it because it is just people together the stupid story elements they had not canon doesn't matter but just the interactions between all these different characters I always loved that **** and i think i think that uh it's it is hard to not be cheesy but it's like if they just kind of own the cheese but that's the thing is yeah I embracing that kind of **** makes sense but I'm sorry for like yeah for a fighting game for sure that's why persona is able to get away with it that's why I but you know captain Lee the game you're talking about but it is outside of that when it is like oh you laura croft mush mashed up with uncharted it's like when I kind of takes away from both of them and how they gonna do this and the what's how's that work I see I'm into that I love it but the thing is I love it at a point like I would love that now",
            "start": 276.22
        },
        {
            "text": "when I kinda takes away from both of them and how they're gonna do this and the what's how's that work I see I'm into that I love it but the thing is I love it at a point like I would love that now because I've gotten used to Uncharted, The Tumblers - I know what those are. I have enough experience alone where it's like oh cool this is something that could be different it is how do they match those things and I always think that it's interesting when there are two lines of canon and you have to kind of cross them over and try to make it make sense together I don't like it when it's **** and they're just like they come up well it's an alternate universe or whatever I like when there is a grounded reason or grounded within the Canon of why it all works that's why The Comics right now, Batman: Internet - you can bring it up it's good it's it's a perfect way to do that type of stuff where it doesn't feel too out of line to be a Ninja Turtle story or to be a Batman",
            "start": 315.43
        },
        {
            "text": "Internet, you can bring it up; it's good. It's a perfect way to do that type of stuff where it's like you read it and it doesn't feel too out of line to be a Ninja Turtle story or to be a Batman story. Sure, it does simultaneously feel like both. And I think that the games—it's a little harder with because the gameplay needs to also do that as well as a story. But I think that if you take two franchises, like I think I'm charted in Tomb Raider actually; it's like the perfect example of that totally just works. But I think that you can take two franchises' stories and give it a totally new type of gameplay so that people aren't like, \"You know, comparing it to one side or the other.\" But it's a new type of game with the story elements of the other two. I think that could really work. And I there's a whole bunch of stuff that I'd like to see. Max Cortez never heard of Andy from Rooster Teeth; he says what games resulted in the most broken controllers, Crash Team Racing back in the PlayStation days.",
            "start": 353.35
        },
        {
            "text": "\"Bunch of **** that I'd like to see maximum Cortez never heard of Andy from Rooster Teeth, he says what games resulted in the most broken controllers. Crash Team Racing back in the PlayStation days when there was a game that I got a multi-tap for - nice. So we're talking about broken controllers and it was an accident. Well, yeah, I know you're asking about rage, but I have never broken a controller out of rage. Oh really? Yeah, Emily doesn't know, I have once... probably broke one or two in Tai Chi, and I guess. But like the one that always stands out to me is from freshman year of college - I'm across the hall in my friend John's room playing WWE SmackDown Too on PlayStation 1, which was right after Smackdown! Here Comes the Pain on PS2, I believe. But SmackDown Too... he's like, the story with that is like, I you know, I moved to Mizzou, I didn't know anybody, and one day I shut my door to go to class and I turned the corner and I heard the Smackdown music - like the menu.\"",
            "start": 396.28
        },
        {
            "text": "like the story with that is like I you know I moved to Mizzou I didn't know anybody and one day I shut my door to go to class and I turned the corner and I heard the SmackDown music like the menu music not like went down the hall looking in every room till I found John weren't we friends and I we go over there and playing he always played at his created character Johnny Chaos who's his high-flying little **** but **** we get up every time that he would blame these moves in like his you know momentum Peter would spike but I was good enough usually to beat it but there's this one time we're sitting on the floor playing with my PlayStation 1 controller and he just keeps doing this flip off there and getting up fast enough he's like he's storing finishers and stuff and like I couldn't do anything and I remember just gonna **** slamming it down on the floor but it was a concrete floor side a shattered the base of the controller but then I wanted to beat him cuz I scared him so bad",
            "start": 444.36
        },
        {
            "text": "anything and I remember just gonna slam it down on the floor but it was a concrete floor, side a shattered the base of the controller but then I wanted to beat him cuz I scared him so bad for him raging is totally worth it yeah that's funny for me so I say I never broke it out in a rage but my friend put the multi-tap on a window and the windows open didn't know we like I forgot exactly how it happened but we just finished a race we put the controllers down, the multi-tap falls out the window pulls all the controllers with it and all four controllers fall like five stories oh wow yeah I mean it was bad i forgot yeah you're on up in San Francisco thing like a second story how ya know enough and then four controllers got it broke that's all in one that seems like one of the that would have been the perfect time for one of them to act like a grappling hook in like I know ask the windowsill so it was one of those situations where there's so many ways that that could have not",
            "start": 479.25
        },
        {
            "text": "We theorize about what Rocksteady is up to. would have been the perfect time for one of them to act like a grappling hook in like I know ask the windowsill so it was one of those situations where there's so many ways that that could have not happened yeah I was I say I'm kind of impressed that it did because like you would think that the motive wasn't have enough like wait wait for four **** controllers but I guess did they were there in uh just original place assuring no no no don't have the dual state the dual sex cell module shtick yeah but uh you know do you ever break controller colon yeah definitely i'm organically would break them playing games like a Dreamcast controller is really flimsy so I just talked about how crazy taxi we brought controllers but the last game I broke a control at a rage for was I think Heavenly Sword and that was one of the sixaxis controllers had no girth and they do just smash it on my desk and I just broke it but I'd always remembered throwing controllers and I was a kid which was like",
            "start": 519.27
        },
        {
            "text": "Sword and that was one of the Sixaxis controllers had no girth and they do just smash it on my desk and I just broke it but I'd always remembered throwing controllers and I was a kid which was like a funny thing and it was funny on the NES and SNES because they read their attach the system so like he would just throw your controller in the game would like reset I remember just like walking away from games that were just like blinking like gray just like **** this game yes to keep it at that for hours or ever yeah are there such a punishment game yeah exactly as you get for me to dick uh Michael Barrera says what are some of your favorite old games that you'd want to play in a let's play my god that list for me is so long I really I have documents of like games that I hope to one day let's buy it just lets plays are just so not a focus for us and it gets hard to kind of prioritize that stuff let alone to bring in something old and try to figure out how to make it work and get all",
            "start": 560.31
        },
        {
            "text": "Let's buy it just Let's Plays are just so not a focus for us and it gets hard to kind of prioritize that stuff let alone to bring in something old and try to figure out how to make it work and get all this stuff working yeah and that's the other problems like early on we did a bunch of old ones and then our little converter thing stopped working it was like **** but I definitely like the old first Internals on NES it was a game that broke the camel's back when it came to us doing the things because we couldn't get **** work yeah Balaji wants to do that there's so many PlayStation games and I want to do I need Crash too I need to be Crash Two and Three I want to do full plays of those and then there's a it's just hard to figure out a good way to to cover old games like what is the best Let's Play of an old game because most people want the whole game but that's hard to to make the content worth doing for the amount of views that that gets so it's kind of like figuring out the right",
            "start": 602.46
        },
        {
            "text": "Let's play of an old game because most people want the whole game, but that's hard to make the content worth doing for the amount of views that that gets. So it's kind of like figuring out the right equation to making it fun, making it entertaining, but also making it worth doing. Because yeah, if it was obviously worth doing, that's all I would do. Play old games. Yeah, oh yeah. Ah, Greg talking to you. Let's see how long we've been going. We'll do a couple more questions. Ryan Ver El says, \"Why can't a company like Disney succeed in the video game industry? Move there's none specialized and if I don't think... I think you have to be all in.\" I mean what do you think about the company is the publishers at do succeed their publishers the video games they don't do other things like Activision does anything else. ETA doesn't do anything else, obviously. These companies diversify in some ways but doing a ministry is a unique beast. You have to have you know specialty in doing that.",
            "start": 641.64
        },
        {
            "text": "anything else ETA doesn't do anything else obviously these companies diversify in some ways but but doing a ministry is a unique beast you have to have you know specialty in doing that doesn't have merged a lot of money so it's just not for everyone and I don't think that you know I think that you know there are some midsize publishers that are still probably not long for this world so I don't think it's a safe space for a lot of companies to be in that's my opinion mm-hmm no I mean we did all the topic about it right I think it's also just Disney being smart and come to that realization that we could be doing other things and we are really good at other things and we should do those things in partnering with people who do these video games really well yeah very smart Zachary Hood says how can I find friends through gaming I'm going to think the easiest answer and I think that a very very very effective answer is form like a guild or something for us there you go but it's like that",
            "start": 691.88
        },
        {
            "text": "how can I find friends through gaming I'm going to think the easiest answer and I think that a very very very effective answer is form a guild kind of like a community for us there you go but it's like that there is such a community those people are there to be friends to have conversations about games I think it's easier to find friends through gaming when it's not actually through the gaming having said that Greg is very very obviously into multiplayer games and the amount of real life friendships that he's formed over the last 15 years that I've known him you know through playing games with people it's crazy like the the crew that he runs with and teams that he runs with like those are his people you know and I think it's really cool and awesome that like I'll be down in Austin for SXSW last year when we were at a ventra doing like we're in Texas for SGC last year when we read 3 or whatever people come up to me like Tim hey like I'm afraid he's my friend I'm on his team whatever and it's like",
            "start": 726.13
        },
        {
            "text": "We theorize about what Rocksteady is up to. \n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\n\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\n**** country for a Ventra card like we're in Texas for SGC last year when we were ready 3 or whatever people come up to me like \"Hey, I'm afraid he's my friend, I'm on his team, whatever,\" and it's like, \"That's just your line, get away from them.\" To that place you know. And I think it's cool that because of the internet you can kind of have friends anywhere you want. Hmm, let's see. George Barrett says, \"How many generations of consoles do you see HD remasters continue?\" That's a great question. Forever, yeah, forever in perpetuity will be called HD remasters; that'll be called collections because these games are already in HD. Do you think about being like, I guess it'll be that on the PlayStation 5 right? We'll get all of the Batman's, that's how they'll go around to doing it – we'll get Arkham City, Arkham Knight, Arkham Asylum. Maybe I think that we might advance so far in the next five to ten years that some of these games just might not be long for this console, you know? That might not belong on these consoles.",
            "start": 768.11
        },
        {
            "text": "Arkham Knight Arkham Asylum maybe I think that we might advance so far in the next five to ten years that some of these games just might not be long you know that might not belong on these consoles because they might just not look good anymore it's the way we almost feel about like why isn't there a Crash Bandicoot collection it's like was like those games look like garbage you know and they didn't play like garbage to the IQ and sauna it's an NC store ps1 era polygonal games just don't look right anymore so those games aren't good to re-release him we saw I mean with rare exception we saw Final Fantasy VII for instance come to PS4 and it looks like **** but like it is what it is so I wonder if we'll have the similar land look look at the old games in a similar lens but I don't think so exotic aims have a lot of artistic direction style yeah I supposed to just putting like you know polygons together I hope which is if it's gonna keep going it's just one generation back",
            "start": 809.67
        },
        {
            "text": "so exotic aims have a lot of artistic direction style yeah I supposed to just putting like you know polygons together I hope which is if it's gonna keep going it's just one generation back of hey there's this new console and you're buying it did you know you miss these games on playstation 4 xbox one so on the next one you get those that seems like what the majority of them are nowadays right with the exception of a piece to class yeah there's things every every now and then but I think that it's it's less about that they won't be HD remasters obviously because of what Colin said but I think that there it's less going to be about the graphics or whatever but it's going to be more about what do the new consoles offer that these don't and like that's when you look back that's all that re it rains are when you look at now the it's not even HD remasters when we're talking about the ps3 to ps4 job it's jeff yeah you're the collection ative edition collection last of us you know right",
            "start": 845.46
        },
        {
            "text": "\"Right, rain's are when you look at now, the it's not even HD remasters when we're talking about the PS3 to PS4 job, it's Jeff, yeah, you're the collection ative edition, collection, Last of Us, you know right, things like that. I think it's just that's just gonna be the norm and like I, it's I think it's a good thing overall. It sucks that you know like if you have twice but you don't have to buy. I feel like they've taken their foot off the gas a bit for a while there, it was like what the **** are you doing and now it is like okay, I guess that makes sense, sure why not, like it as development cycles get longer and longer, companies in publishers need to worry about making money and keeping everybody and going in business so it makes sense for WB who doesn't have an Arkham Knight this year to say all right cool let's put out the other two Arkham games since people like those one of those want to play them again here you go. Yeah, I think it's like a easy way to kind of fill the void that like things\"",
            "start": 879.42
        },
        {
            "text": "Cool, let's put out the other two Arkham games since people like those - one of those want to play them again here you go. Yeah, I think it's like an easy way to kind of fill the void that like things like Fallout: New Vegas and stuff like that did before, where it's just like... Let's keep the brand in people's conversations and all that stuff. Final question of the day comes from Teyla now - and back at IGN when you get early review copies, are they retail? Do they have their own special box or they come in a bland secret box? Mm-hmm. Depends nowadays it's codes; the industry's changed mostly to where you just get codes for games and that's on retail is running on retail part of it - I don't know if it was this shift of this generation as much as it was our shift as well, but it seems like it's always retail. It's rare nowadays correct me if I'm wrong. For us to really feel it get be getting debug PS4 builds if you're getting that it's like this debug version again the entire time we've been doing.",
            "start": 923.67
        },
        {
            "text": "retail it's rare nowadays correct me if I'm wrong for us to really feel it get be getting debug PS4 builds if you're getting that it's like this debug version again the entire time we've been doing this game six months out so here's a build to go play like three levels of or whatever I think that with no that wasn't even when we did the Ratchet and Clank let's play before it came out three months ago that was a code on retail that they've uploaded they upload that stuff to retail so it would work cuz at IGN back in the day when we when I started it was working PlayStation 2 stuff and the police station reviews you got burned CDs and DVDs all the time or DBs all the time and then PlayStation 3 was the same thing and those just arrived yet a plain old gem case and a burned disk in there with something written Sharpie on what it was and then now it just feels like discs are pressed so early this are our games are if you want it to get reviewed are uploaded so early that you're just",
            "start": 965.3
        },
        {
            "text": "with something written on what it was, and then now it just feels like discs are pressed so early, this is for our games if you want them to get reviewed, they're uploaded so early that you're just getting the retail experience. Yeah, I think that for the retail games that we do get, usually it's been indie games - it's hit or miss where it does sometimes just come in a black box like it's the retail disc but it's not actually in the retail box, it'll be more like some weird white box that's really nondescript. Sure, or whatever. But yeah, they're usually indie games completely. This topic brought to you by Total War: Warhammer. What is Total War: Warhammer? It's a fantasy strategy game of legendary proportions. It combines an addictive turn-based campaign of conquest and empire building with explosive, colossal real-time battles all set in the vivid and incredible world of Warhammer Fantasy Battles. It's the perfect match - it's a marriage made in gaming heaven. We're",
            "start": 1000.82
        },
        {
            "text": "and empire building with explosive colossal real-time battles all set in the vivid and incredible world of Warhammer Fantasy Battles. It's the perfect match, it's a marriage made in gaming heaven. We're talking of a fantasy world of perpetual war in massive battles that you'd find in Warhammer mixed with the critically acclaimed epic scale and conquest-based strategy games Total War. Total War plus Warhammer equals a gorgeous high fantasy world for petal war and conquest on a colossal scale brought to life in hours and hours of gripping strategy gameplay, epic fantasy Total War style. No one's done Warhammer or indeed fantasy like this before, from the personal skills of your characters to 20,000 roaring orcs. No fantasy strategy game is this big and detailed as fancy spectacle it is unmatched. If you're a PC gamer not involved, you're missing out. Factions that I'll feel and play very differently each race is wholly different with their own unique characters campaign mechanics battle for the units",
            "start": 1043.06
        },
        {
            "text": "your PC gamer not involved youre missing out factions that ill feel and play very differently each race is wholly different with their own unique characters campaign mechanics battle for the units and play style so if youre interested in this go over to pc steam all that stuff 2016 thats the time you listen to this probably gonna be that so its out yeah unless youre ever unpatriotic office",
            "start": 1081.69
        }
    ]
}