{
    "id": 1271,
    "video_id": "JIHagv3JfJQ",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What Are The Most Cinematic Moments in Video Games? - Kinda Funny Gamescast Ep. 40 (Pt. 4)",
    "description": "From Metal Gear to Uncharted, we discuss video game's most Hollywood-esque moments.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1444914001,
    "duration": 878,
    "transcript_chunks": [
        {
            "text": "today's sponsor is Loot Crate for less than $20 a month Loot Crate gives the geek and you a special treat every month Loot Crate a subscription box service with $40 worth of geek gamer and pop culture gear Collectibles apparel Comics and More delivered to your mailbox every month this month's theme is time and quite appropriately we're celebrating the 30th anniversary of Back to the Future in the year Marty McFly travels to and Back to the Future Part Two the Timeless appeal of Bill and Ted's Excellent Adventure and the timey wimey charm of Doctor Who you have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate and when that cut off happens that's it it's over so go to lootcrate.com/kfam and use code kfam to save $3 on your new subscription today now guys the final topic of the day as always It's the final topic brought to you by kindafunny.com forums if you have a question for us go there go to kindafunny.com/gamescast topic submit a topic and it'll",
            "start": 0.2
        },
        {
            "text": "the final topic of the day as always It's the final topic brought to you by KindaFunny.com forums if you have a question for us go there go to KindaFunny.com Gamescast Topic submit a topic and it'll get read just like we're about to do for my boy Title Town wants to know what are some of our favorite large Hollywood-esque cinematic moments from gaming I this is a really nice seg the airplane sequence in Uncharted cruise ship and Uncharted in general I mean I feel like the game's full full full of them whether it's the the building falling the train sequence in Two Sure the um the things you just said there there's other things too like even like the the drug sequence in Three I thought was very or even just the desert sequence at Three when you're just walking through it you know um Metal Gear Solid 4 comes to mind oh wow I was going to say Metal Gear One just Metal Gear Solid yeah there's a lot of Metal Gear Solid for me Metal Gear I mean I don't mean",
            "start": 44.76
        },
        {
            "text": "Through it, you know, um Metal Gear Solid 4 comes to mind. Oh wow, I was going to say Metal Gear one, just Metal Gear Solid, yeah, there's a lot of Metal Gear Solid for me. Metal Gear, I mean, I don't mean to cut you off; you want to tell your 401 real quick? No go for Metal Gear Solid right, like the opening, right, like so it's so funny now to think of a game opening with a cinematic and credits and music and stuff, but that did not happen when I was I was just starting when I got that PS1 and pop that in; Sniper Wolf, like there's so many amazing monologues and moments, holy ****. Um, the in Metal Gear Solid 4, two things come to mind: the well, three things, the microwave sequence, obviously, totally, um, the motorcycle chase scene where you're with Eva in chapter 3, I think that thing is the end of chapter 3; you're going through that was my first moment that I was like **** this is what NextGen means back then, like I was like holy **** I can't believe I'm playing this and",
            "start": 91.68
        },
        {
            "text": "the end of chapter 3 you're going through that was my the first moment that I was like this is what NextGen means back then like I was like holy this can't believe I'm playing this and then I don't think anyone would ever say this but the uh the The Raven boss fight in FEAR where you're in that building and the things are flying around the boss fight itself sucked like it was it was way too hard to aim in  but the way that like they were shooting the missiles and was blowing up the building that I was in I was like holy this is and it's not a cinematic yeah yeah um what else is there other games I was thinking of Spec Ops: The Line intro with the on the helicopter I really love that intro a lot um and then just kind of infiltrating Dubai I think is just a really really cool that game's  awesome I love that game so much um yeah I mean Uncharted obviously instantly comes to mind I mean there's a lot of stuff in that game",
            "start": 135.68
        },
        {
            "text": "Dubai I think is just a really really cool game, that's awesome. I love that game so much. Um yeah, I mean Uncharted obviously instantly comes to mind. I mean there's a lot of stuff in that game. I think there are moments there are like just little sporadic moments even in like Far Cry or like like stuff like that where you know you get a little taste of the cinematography for instance we were talking about in Drake's Deception, or you know interesting camera angles or interesting action scenes. But I actually those are not the moments that are most memorable to me in games. In fact, I think the the memorable moments to me typically are the the more thoughtful and poignant moments. Um I the ending of Fallout 3 for instance, I think that ending is cool as hell until you know when you have to kill yourself basically. Um but yeah, I mean I like I I think about the Journey or The Unfinished Swan or something like those are more memorable moments than like the things that explode.",
            "start": 178.28
        },
        {
            "text": "To kill yourself basically um but uh yeah I mean I like I I think about The Journey or The Unfinished Swan or something like are more memorable moments than like the things that explode because everything explodes and there's big set pieces in every game and stuff like that it's actually the exception of the rule to find something that's not like that that's memorable. I think another one comes to mind for me is in Call of Duty 4: Modern Warfare when it's one of the first missions and like a helicopter crashes and then the the blades are like spinning at you and it like it stops right before it hits you and I remember being blown away just being like whoa like this is ****. That's Call of Duty 4: Modern Warfare, right? Yes, yeah that one was totally even when you're flying away in the helicopter and the nuke goes off and you come down I remember being like what the ****. Yeah, and uh then a more throwback would be obviously The Legend of Zelda: Ocarina of Time just like coming out and seeing the the field yeah",
            "start": 213.68
        },
        {
            "text": "and the nuke goes off and you come down I remember being like what the **** yeah and uh then a more throwback would be obviously Ocarina of Time just like coming out and seeing the the field yeah yeah go YouTube that now um question two comes from Elaine McAdams a bit of a setup here with the release of the Mega Man collection I've been I've began creating a wish list of other NES and maybe SNES collections I'd like to see come to Modern consoles I'd love to see Square release a Final Fantasy Collection of 1 to six and Konami deliver a Castlevania one now the question are these possible and what other collections would you like to see feel like we've talked about the what other collections we'd like to see I'm a little bit interested calling on the are these possible side of this yeah they're possible people have to understand though that the reason the Mega Man Legacy Collection collection was important was because the studio that ported the games made uh a they basically extracted",
            "start": 253.24
        },
        {
            "text": "possible people have to understand though that the reason the Mega Man Legacy Collection collection was important was because the studio that ported the games made uh a they basically extracted NES source code and made it run natively so it's not so it's not necessarily emulating it um so they run as if an NES is playing and what they basically did was make a way to feed and recalibrate NES data into modern systems so that you never need an emulator play them they'll just they'll they'll exist forever in data form or whatever and that's kind of an oversimplification but that was the reason why 9 and 10 weren't in it CU 9 and 10 are not native n games or why seven and eight weren't in the collection is because they they they made something that works for NES and can work conceivably for any NES game um so is it possible sure I mean um I'm I've said before I'm I'm shocked that Square Enix doesn't release the Final Fantasy games individually for $20 and just put trophies on them um because",
            "start": 293.08
        },
        {
            "text": "any NES game um so is it possible sure I mean um I'm I've said before I'm I'm shocked that Square Enix doesn't release the Final Fantasy games individually for $20 and just put trophies on them um because people will buy them I'd buy them uh but yeah it's possible I just think that studios are looking you have it's a cost benefit analysis of like if Konami went and did a Castlevania collection like this person recommends or wants like is that going to make the money is that worth it that these games have to go through certain and QA again people you have to pay a port Studio to to get them over because you're not going to use your own internal sources to do that so you have to get a studio like Bluepoint um to do that and uh it costs money so um you have to kind of figure out what's worth it and what's not with things like virtual console and stuff like that you can release these games individually and emulate them and it's just cheaper and easier and all you have to basically pay for is your",
            "start": 335.52
        },
        {
            "text": "not with things like virtual console and stuff like that you can release these games individually and emulate them and it's just cheaper and easier and all you have to basically pay for is your ESRB rating so um I don't know it's possible sure it's possible and I don't think we've seen the last of them yeah definitely not um with the Mega Man Legacy Collection that's exciting is what will Capcom do with their relationship with Digital Extremes which I think is the studio I could be wrong um to get those other Capcom games on onto PS4 and Xbox One especially the Disney ones um which are you know people love Code Name: Viper I'd like to see Over as well Blue Flash XL asks what was the last game released to feel like an event what game felt like the biggest event and do game releases still feel like events I don't think they feel like them anymore because too many games come out nowadays crazy there aren't as many events I don't think but I mean GTA 5 was an event you know what I",
            "start": 375.12
        },
        {
            "text": "still feel like events I don't think they feel like them anymore because too many games come out nowadays crazy there not as many events I don't think but I mean GTA V was an event you know what I mean like that was an event that was a thing that happened and I think it's it really depending on like how dialed into something you are you know what I mean like there were more events maybe thinking back on it that I was into but were they into it forever like midnight re-releases seem more common than ever that's like the start of an event Halo is an event well Halo 5 being an event that's an interesting question I mean I think I think it is and I think that what an event means just kind of it's met in the middle a little bit where there are many more they're just not as huge of a deal but even then that's a lie because they're bigger than I think they've ever been it's just huge of a deal in the gaming space you know GTA is something that kind of like took over everything whether",
            "start": 413.72
        },
        {
            "text": "but even then that's a lie because they're bigger than I think they've ever been it's just huge of a deal in the gaming space you know GTA is something that kind of like took over everything whether mainstream or hardcore uh Gamers but you see things I feel like like even destiny that was an event that launch was an event you know you couldn't go outside without seeing a bus with Destiny **** all over it like that to me is what the definition of event is thinking back a long time ago like event what event games were there I feel like GTA always was one of them um but even then it had a different definition like Final Fantasy X to me was an event um but then there was other things like Need for Speed I think was an event game and that's an annual thing but annually it was an event you know see that's how I feel about the wrestling games back in the day you know your your THQ Aki ones on N64 like you know WCW NWO Revenge right was the one that made it really popular and then it was",
            "start": 453.16
        },
        {
            "text": "What Are The Most Cinematic Moments in Video Games? - Kinda Funny Gamescast Ep. 40 (Pt. 4)\n\nknow see that's how I feel about the wrestling games back in the day you know your your THQ Aki ones on N64 like you know WCW NWO Revenge right was the one that made it really popular and then it was WrestleMania 2000 and then it was No Mercy and both of those were huge deals mhm same thing with like SmackDown just bring it the first wrestling game on PS2 look how real The Rock looks yeah like that was **** that like stopped the world for me and my friends right yeah I mean well Gran Turismo was always I think an event game where even if you don't care about those games which you know a lot of us don't you were still interested in looking at it seeing how pretty it is and all that stuff especially back in the PS two days was it was Gears 2 right that had the Mad World ad wasn't it it was Gears one was it Gears one yeah I remember then Gears 2 was the one like that was the one that got I mean I remember watching that trailer or that video in a theater which was crazy for the time oh",
            "start": 496.88
        },
        {
            "text": "gears one was it gears one yeah I remember then Gears One was the one, like that was the one that got I mean I remember watching that trailer or that video in a theater which was crazy for the time oh yeah was everybody yeah believed I think you're thinking Gears One but was it an event on its own I remember I'm I'm saying the I'm sorry so what I'm saying is I remember seeing the trailer in the theaters which was like this game looks cool and then by the time Gears 2 came out everyone was like I've played Gears One, Gears 2 is amazing I think even nowadays Call of Duty is still an event yeah but that that one's waned and like that's the thing cuz that used to be the event you know what I mean that was like the giant it's interesting though cuz like I guess we just need to Define what event means because like if I'm talking about any of my friends that aren't Gamers like they are stoked they know the date that Call of Duty is coming out and they're ready for it you know and they're",
            "start": 536.0
        },
        {
            "text": "means because like if I'm talking about any of my friends that aren't Gamers like they are stoked they know the date that Call of Duty is coming out and they're ready for it you know and they're going to go buy it and stuff and these are people that don't play games that often so I don't know yeah what is the definition of event I think you guys are playing a little fast and loose with it to be honest with you I don't think there's ever been a wrestling game or a Need for Speed game that's been an event in terms of like when I think of that I think of it is like midnight launch line around the block people are really **** stoked they're queuing up their their digital downloads and all those kinds of things I think there's only been two games this year that have been like that which is The Witcher 3 and Metal Gear Solid I think are the ones that could be closest to what I would consider to be an event release you know like like uh you're calling your store to see if you can get there early",
            "start": 572.16
        },
        {
            "text": "Witcher 3 and Metal Gear I think are the ones that could be closest to what I would consider to be an event release, you know, like, uh, you're calling your store to see if you can get there early, you're worrying if you can get your game on PSN, you know. If you live in the Pacific Time Zone and you have to wait three more hours or whatever. Console launchers are always events. I don't think we have events like that anymore because I actually think that the volume of midnight releases and making something out of nothing is kind of happening too often. So um, Halo 5 and the new Call of Duty are going to be big, big, big releases but they would have been more special, I think, years ago when it was more rare to go into a store at midnight or to have your digital download ready to go and it's already pre-loaded and all that kind of stuff. I think it's removed the luster about having a game like Moment One, um, I think you've seen that go down with Madden as well, I think.",
            "start": 604.76
        },
        {
            "text": "already pre-loaded and all that kind of stuff I think it's removed the the like the Grand Theft Auto V about sure having a game like Moment One um I think you've seen that go down with Madden as well I think Madden back in the day there was they made Madden Day was something the fans made right and then ma EA got on board with it but then yeah when it was you can preload everything and you don't have to leave the house it wasn't as big a deal anymore yeah like this year's Madden came and went I was like oh it's that I would say that Vice City I don't think GTA 3 was an event I think Vice City was definitely an event I think that because no one knew GTA III was going to be good yeah uh Vice City uh was an event San Andreas were events I do remember those yeah for sure very well four and five yeah I think as far as like this Monumental release five you know is probably the last one that was two years ago almost to the uh to the day I mean it was just a couple weeks ago Greg Miller says hi friends",
            "start": 638.28
        },
        {
            "text": "as far as like this monumental release five you know is probably the last one that was two years ago almost to the uh to the day i mean it was just a couple weeks ago Grail Arbor says hi friends long time first time i've been having a discussion with some friends about my thoughts of Metal Gear Solid in this topic was brought up I'm curious what you guys think how long does it take to really determine when you enjoy a game or not does it depend on the total length of the game the genre etc for me it takes three to seven hours depending on the genre thanks interesting question i feel like i don't even need to play it like i feel like honestly it's like i know what i like and i know what i don't like and i can kind of just you know watch some gameplay of it see someone else play and i i know if i'm going to enjoy it or not in terms of stuff of i know i'm going to like it playing it am i going to love it or or not i don't think it takes that long i think it takes maybe an hour not even",
            "start": 672.6
        },
        {
            "text": "if I'm going to enjoy it or not in terms of stuff I know I'm going to like it playing it am I going to love it or not I don't think it takes that long I think it takes maybe an hour not even yeah I think when you're playing it you know pretty quick if I'm enjoying it if I'm having fun with it yeah like I thought the question I thought it was going to be to know where it ranks in your enjoyment like you know what I mean like I'm always like Metal Gear Solid 3: Snake Eater is my favorite game of all time it took me a long time to say that I I used to say Metal Gear Solid is my favorite game but I really enjoy Metal Gear Solid 3: Snake Eater I'm waiting to see how I feel on that in a while same thing with like I now people ask me all the time what's your favorite Metal Gear now that V's out I'm like that's a question for quite some time from now mhm you know what I mean I'm not ready to commit it does smell weird it does smell weird Christine you light a candle did you light a candle all right just make sure",
            "start": 713.48
        },
        {
            "text": "That's a question for quite some time from now, mhm. You know what I mean? I'm not ready. It smells weird; it does smell weird. Christine, you light a candle? Did you light a candle? All right, just make sure the house isn't on fire. There are fire extinguishers – remember, I bought those? I told you that yet, Christine? There's one under the sink and there's one up there in the closet. It's a poop candle; yeah, I know. We're still rolling. Kevin, uh, fire safety waits for no cut. Yeah, I think that when a game is going to be good, I mean, I don't have time to deal with it. I think that sometimes games are just like...like Final Fantasy Versus XIII – again, the most embarrassing defense of Final Fantasy Versus XIII is like, \"It gets good after 30 hours.\" Oh, come on; are you kidding me? Like what do you have anything else to do that you want to wait that long to play and waste that much of your time? But it goes in the other direction too – like there are games that I",
            "start": 746.64
        },
        {
            "text": "kidding me, like what do you have anything else to do that you want to wait that long to like and waste that much of your time um but it goes in the other direction too, like there are games that I love at the beginning and end up being like all right, enough. And the game that comes to mind is a great example - Thousand Arms, not 10,1 spikes (correcting the name), where I'm like I love this game and I played it and I played it, I'm like this is great and this is great, oh it killed me, it got me, I'm not careful enough. And then like a few hours later I'm like **** this, like you have to be you know like give me a **** break, you know like I understand that's the whole point for people that don't know Thousand Arms, it's a game where it's like it's over the top hard, over the top hard um and uh it's like you move like you get Midway through the game and like you move anywhere and you're dead unless like you're paying attention and I'm like all right, enough, it was fun in the beginning, it is not fun anymore.",
            "start": 792.24
        },
        {
            "text": "you move like you get Midway through the game and like you move anywhere and you're dead unless like you're paying attention and I'm like all right, enough. It was fun in the beginning; it is not fun anymore. So sometimes games go in the other direction too, yeah, where you think something's more fun than it actually is, yeah, MH, yeah, for sure. Ladies and gentlemen, this has been the first ever episode 40 of the Kinda Funny Gamescast. These are the coolest moments in video games - that's Yoshi, that's Portal, I'm Tim Gettys, and uh, I'll see you next week; it'll be a good time. But until then, please go to iTunes, subscribe to this beautiful show, rate it whatever you think it's worth, and uh, you know, tweet at me, tweet at these guys, let us know some thoughts about Kevin. I appreciate that, talk about Kevin. Bye bye, thanks, **** you, Kevin.",
            "start": 829.24
        }
    ]
}