{
    "id": 256,
    "video_id": "JALqExifhwM",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Scariest Movie Moment - The GameOverGreggy Show Ep. 17 (Pt. 3)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1396422001,
    "duration": 1390,
    "transcript_chunks": [
        {
            "text": "I'll go next. My topic is what's the most horrific thing you've seen in a movie that's stuck with you, a living nightmare, a living hell? I instantly know that and that is Pee-wee's Big Adventure. Large Marge. Yeah. Oh, wow, that's so funny cuz that's what I was thinking of too, man. That scared the **** out of me. Scared the to me that was just like the scariest thing in the world. It's that and Lady in the **** what the cats, the Siamese twin cats. Is that the we no that's though we are Siamese. That's Lady in the Tramp. I thought that was 101 Dalmatians. I don't know these dumb movies. Oh my God, that traumatized me. I don't know why. 101 Dalmatians, there has to be a foil for all the dogs, isn't that Cruella Deville? Yeah, that's right. She probably the cat somewhere. See the one I was you're I like how we're jumping to different conclusions. What I was coming at right is I'm talking about the most horrific thing I've seen in the movie that like I think about sometimes it would be like a living nightmare and",
            "start": 1.1
        },
        {
            "text": "to different conclusions. What I was coming at right is I'm talking about the most horrific thing I've seen in the movie that like I think about sometimes it would be like a living nightmare and what going with is in Being John Malkovich, when at the end John Cusack, spoiler alert, gets caught in his kid's whatever like brain, right? Like he went through the door into his I don't remember anymore. I can't remember either. But at the end of it, he's stuck in somebody else's head watching their like he can't do anything. He's just watching their life through their eyes. Like he's just in their head for the rest of their life. What a **** nightmare that would be to be conscious for like I mean Colin's head the rest of his life. Jesus can't do anything. I just got to watch whatever the **** this kid kid is doing terrible ****. I do I sleep? Do I just sit there for 8 hours in the dark? Yeah, can I ever communicate any what I it's like a Dante's Inferno situation being stuck in Colin's",
            "start": 52.52
        },
        {
            "text": "this kid kid is doing terrible ****. I do I sleep? Do I just sit there for 8 hours in the dark? Yeah, can I ever communicate any what I it's like a Dante's Inferno situation being stuck in Colin's head. I oh my God, I don't know if I could like that actually no, I could not handle that. No, you couldn't. I'd like to be stuck in your head for like no, you wouldn't. See the thing was you didn't even know what he you didn't know he couldn't hear her thoughts or anything. So it's literally just like you're just looking through someone's eyes. You remember this movie, right? The well that's that's makes it even worse to me. If I could hear his then I at least kind of understand what was going but like I imagine he reads a lot about things that would I wouldn't understand. He also probably reads like way faster than YouTu so you you'd miss every other page. It would be really annoying. This sounds bad. Yeah, it's real bad. That's that's not what I that's not well first of all two things two observations one",
            "start": 89.08
        },
        {
            "text": "than YouTu so you you'd miss every other page. It would be really annoying. This sounds bad. Yeah, it's real bad. That's that's not what I that's not well first of all two things two observations one it's funny Tim and I came to the same conclusion because that is exactly what I thought I was **** horrified. She does the weird face and today to this day it is like I had to look away when I on the second and third fourth time I saw that movie cuz I was so terrified it came out of nowhere and that's what you got to love about that movie . Yeah, it was that was like I I used to rent that movie when I was a kid from the library and like my sister used to be like all right, don't look now it's like this is what's coming up now it freaked me out too. Um but the second observation is just that I wasn't going there with this because there's just when you say something like this like what parts of movies stick with you and like you don't forget and I think about scary things what I think about is Fire",
            "start": 127.4
        },
        {
            "text": "there with this because there's just when you say something like this like what parts of movies stick with you and like you don't forget and I think about scary things what I think about is Fire in the Sky. Do you guys you guys you guys remember movie? Oh, don't even talk about it. Don't even that movie for I watch that movie so I love my parents they're good people they really do mean well but they had zero concept of like what a child should watch and shouldn't watch like you know I saw movies like Predator and Alien and like and RoboCop in the movie theater like when I was like four or five I don't even know how the hell I got in there I just remember seeing on the screen and Fire in the Sky was one of those things where I rented and I used to have a great relationship like when I say great I mean I used to terrorize my local video store cuz remember back in the day you used to have to reserve they'd only get like three copies or something in so like you need to reserve so they they would",
            "start": 167.68
        },
        {
            "text": "mean I used to terrorize my local video store cuz remember back in the day you used to have to reserve they'd only get like three copies or something in so like you need to reserve so they they would see me coming and you know I'd call up and be like hey I need you to get me this copy of this thing I know it's coming out I check all you know the paper and I used have a little pamphlet when things come out and so Fire in the Sky I was looking for I I can't remember how I used to know oh no that you'd go and they would have the they would have listings damn that and so like cuz I I had nothing else to do like I just loved movies that was all I wanted to do that and like Reese's Peanut Butter Cups were Jam so I got Fire in the Sky no idea what it was I knew it was like kind of scary parents had no idea I was renting it I go up and they used to have a VCR in their in their in their bedroom and I watch it and I get to like the horrifying part where he wakes up in the weird like latex",
            "start": 208.04
        },
        {
            "text": "had no idea I was renting it I go up and they used to have a VCR in their in their in their bedroom and I watch it and I get to like the horrifying part where he wakes up in the weird like latex bubble cocoon and he like cuts himself out floating Tim doesn't know what to say by let's so let's explain what this movie is first and by the way I saw this in the theater with my brother and it was horrifying so so and I was like six or seven years old when I came out uh Fire in the Sky is a movie about these dudes it's based on a true story apparently about guys that think an Upstate New York that are abducted by aliens like they like they're driving on like a country road and they're abducted by aliens and it's about what the aliens do to them like so like it's an Alien Abduction movie but it's like not a joke like it's **** up it's not you know like it's totally **** up it's a **** up movie like they they have this scene so he wakes up in this cocoon right where like and the alien",
            "start": 244.72
        },
        {
            "text": "like not a joke like it's **** up it's not you know like it's totally **** up it's a **** up movie like they they have this scene so he wakes up in this cocoon right where like and the alien walks in he's like either we we can tell everyone on Earth you had sex with a goat you have sex with this they bring in a goat in a camcorder and they're just like what's it going to be um they take he he he's able to free himself right and then he looks around and you realize that there that they have multiple little Bays little pods that keep people in there's like thousands of them right so they've done this before clearly and he doesn't know what else this isn't their first rodeo and so he's kind of floating in space floating in space and he gets in like one of the hallways and then one of the aliens finds him one of those like insectoid not not not insectoid but like you know the big head like big eyes Martians but they're like really tall really freaking terrifying right and it grabs him",
            "start": 289.04
        },
        {
            "text": "aliens finds him one of those like insectoid not not not insectoid but like you know the big head like big eyes Martians but they're like really tall really freaking terrifying right and it grabs him with like this insane brute strength and just hauls his ass down this long tunnel and he's seeing like kids shoes and like toys and like people's like garments all along this hallway right then they just random they throw them on this table and they take this like sheet like this little tiny like really thin sheet cheat and put it over him and they hit a button and vacuum seals him to the table you remember that part and he's I'll never forget a second of this it's over his face and so he's screaming and then when it vacuum seals to him all you can kind of hear is the muffled scream as his mouth's like going in and out gasping for air and they take a scalpel and they cut it open and then they cut his eye open so that only his eye and his mouth are are there oh wait they cut the hole they cut",
            "start": 328.64
        },
        {
            "text": "like going in and out gasping for air and they take a scalpel and they cut it open and then they cut his eye open so that only his eye and his mouth are are there oh wait they cut the hole they cut the hole around it so all he can see is what he can see but he's not it's not for sight so he can see and his mouth's open and they jam something down his mouth so we can breathe and like they do all this stuff to him and then you just see a needle start coming down oh no and it just starts coming down and it gets an inch and then they they cut back to him like in the normal time like I mean he's just totally screwed up for the rest of his life because of this and it's actually semi- based on a true story right yeah I mean they those guys claim that that's what happened to them like I've only seen this film once and now I remember those that's how Vivid it was yeah I went back and watched it in college CU I was like this movie was scarred me cuz I used to go to the movies with my brother",
            "start": 373.12
        },
        {
            "text": "seen this film once and now I remember those that's how Vivid it was yeah I went back and watched it in college CU I was like this movie was scarred me cuz I used to go to the movies with my brother all the time when my brother's 11 years older than me we used to go see fun movies like TMNT or you know like you know Batman and stuff like that but this is one of the movies where I was like I Want to See Fire in the Sky he's like all right DB Sweeney right wasn't it him no yeah who was the main character I don't I don't remember that but that movie really was like that when I think about a movie that really **** me up like that was one that movie like really haunted me it was very similar to like reading for me read I used to read Ray Bradberry a lot I don't know if you read him like old sci-fi writer from like the 40s and 50s he used to write Twilight Zone episodes and stuff but he's like a prolific sci-fi writer and he wrote this one story about um aliens that only children can see",
            "start": 406.44
        },
        {
            "text": "sci-fi writer from like the 40s and 50s he used to write Twilight Zone episodes and stuff but he's like a prolific sci-fi writer and he wrote this one story about um aliens that only children can see have youever did you ever read this story whatever like it's all about like if I remember correctly like kids would go into their parents like kitchens and steal like all this **** and like the the parents weren't sure why they thought they were playing like they'd steal a bowl and like put it over their heads and all this stuff ended up being that they were like giving the aliens like all this **** like just like supplies and all this kind of stuff and like only the kids can see them any like that was the kind of **** that used to scare me for some reason I was always scared even though fascinated by aliens like well like but by the way when we grew up it was like No Holds Barred we had these weird movies remember the movies about like trolls and dwarfs and stuff that would crawl",
            "start": 441.0
        },
        {
            "text": "fascinated by aliens like well like but by the way when we grew up it was like No Holds Barred we had these weird movies remember the movies about like trolls and dwarfs and stuff that would crawl out of holes and like mess with kids I don't know there was a movie called I think it was called was it Troll 2 no it's Troll that's a scary movie maybe Leprechaun. Leprechaun was terrified. Leprechaun. Leprechaun in the Hood. So by the way it was D it was DB Sweeney as the main character let me see the poster they have the yeah the one where they getting like shot by the the the thing and I and I love by the way I just love the name of that movie in the sky is like an awesome name yeah I mean look at this poster it's even terrifying the guy that directed this apparently by the way went on to direct um D3 the Mighty Ducks oh that's a great connection I want to see the poster real quick another one that got me was uh Amityville Horror. I never saw that oh funny really I was always in the same",
            "start": 475.88
        },
        {
            "text": "to direct um D3 the Mighty Ducks oh that's a great connection I want to see the poster real quick another one that got me was uh Amityville Horror. I never saw that oh funny really I was always in the same way like people get into aliens I was really into ghosts and like they scared the hell on me but I would still want to know more about him and Amityville Horror is one where I remember watching at a friend's house and just being so **** scared like I was going going to **** my pants you know where Amityville is uh the island yeah uh but there's a point in that thing where she's the girl has like an imaginary friend and like you don't me wrong like now it's all dumb and like you know movies it's so hard to make a good Ghost movie now but like the kids talking and talking to this imaginary friend and the mom comes he's like who are you talking to and she's like Jody oh where's Jody now and she's and she's like she's out the window and you look out the window there's like two glowing eyes there",
            "start": 515.2
        },
        {
            "text": "and the mom comes he's like who are you talking to and she's like Jody oh where's Jody now and she's and she's like she's out the window and you look out the window there's like two glowing eyes there I remember that being the **** freakiest thing the Amityville Horror really happened at least you know yeah but then they they went back on the store but then they went back on that story but the uh like so here's a little funny story for Amityville is like right like a few times away from where I grew up and uh I used to go there when I was in in in college when I'd go home I was in a band called Paper Champ we talked about this we used to play this place called The Village Pub which was like downtown Amityville and like a mile away was the Amityville Horror house you can go see it so like me and my friends would you know we would go like walk down there before a show or whatever and like go to the house and what's weird is like the house really is fre aky like the house doesn't face the street",
            "start": 554.52
        },
        {
            "text": "friends would you know we would go like walk down there before a show or whatever and like go to the house and what's weird is like the house really is freaky like the house doesn't face the street like every house is like faces the street except for this one like faces sideways I think it is and it's like there's just something off and weird about it and we would just stand in front of it like look at it and be like this is **** totally weird you know I just like do you have like the guitars on your back like you have the drumsticks your turn is totally weird Long Island Long Island has like a lot of weird um people yes but like a lot of like a lot of weird families yes uh uh but like like a history like a weird uh possession kind of History like Indian burial grounds like all sort cuz you know Long Island was very you know that's why all our town names are very weird is because of you know Indian tribes and stuff like that we took those names Hog Rona patro Etc and uh etc etc and",
            "start": 586.56
        },
        {
            "text": "you know Long Island was very you know that's why all our town names are very weird is because of you know Indian tribes and stuff like that we took those names Hog Rona patro Etc and uh etc etc and like so there's something creepy just about Long Island in general everything's kind of see a lot of people that from California or from even from the Midwest don't quite know what old is in American terms you know like where we have legitimately houses from the 1700s like that would be unheard of out here and like so like when you have like when you have a whole you know set of these old ass houses and they just all have this kind of haunted kind kind of aged historic feel of them it makes everything a little more scary you know I mean we also have something you know we have Brook Haven National Laboratory which is **** ridiculous I'm from Brook Haven and it's like right next to us whatever what is it it's a national lab like super secret National Lab okay like f yeah exactly it's where",
            "start": 626.84
        },
        {
            "text": "Laboratory which is **** ridiculous I'm from Brook Haven and it's like right next to us whatever what is it it's a national lab like super secret National Lab okay like f yeah exactly it's where the uh video game was invented okay and uh ironically and Higgen Botham lived in my town um but there's like all this so people would like sneak into Brook Hava national lab's land to try to like find things and like and they used to get arrested and stuff like that a thing out way out east on on the forks called uh Camp Hero where there's like a huge abandoned satellite dish and there's like all these stories about so there's like all this weird haunted history on Long Island that's a little bizarre um so I always kind that was always kind of part of my upbringing was like how freaky can you get what is going on more stuff all right so uh there's there's when I was a kid obviously I mean this is when a lot of this stuff get was get you right uh nowadays you've got movies like you know",
            "start": 666.4
        },
        {
            "text": "get what is going on more stuff all right so uh there's there's when I was a kid obviously I mean this is when a lot of this stuff get was get you right uh nowadays you've got movies like you know you got movies like The Human Centipede things like that that are supposed to well that's not supposed to be scary no it's but you know I still know what the **** that is it's a really weird movie what is it it's a movie about a a deranged doctor who decides to kidnap a group of people it's torture porn it's torture por it came out he stitch them together he stitches them together like a centipede asou so asouth as to mouth yeah and then eventually like one of them dies cuz it like there's three people if I I never saw it but I think I think there from what I read there's three people and then it's as mouth asouth and then like you know just that was it and then there was a sequel called full the full sequence or whatever and then supposedly that one he just went like balls to the wall of",
            "start": 706.36
        },
        {
            "text": "it's as mouth asouth and then like you know just that was it and then there was a sequel called full the full sequence or whatever and then supposedly that one he just went like balls to the wall of just how disgusting can I be and it was something like there was like 15 people in a thing and that third sequel coming out called the final sequence or whatever and it's 100 people as to mouth okay yeah well I got to see this um but those movies don't really you know I think back in the in the lineage of movies that sort of not terrified me but really just kind of shook me um Silence of the Lambs is one of them yeah there's the sequence where it's the guard sequence right and it's not the blood that gets me it's when you realize that Hannibal Lector has the upper hand it's the second the guard goes to close the cage and the C uffs hit his hand right and then you see Hannibal Lector who and he he beats the one guard to death and then he goes over to the guard that's like basically like dying and",
            "start": 746.76
        },
        {
            "text": "to close the cage and the Cuffs hit his hand right and then you see Hannibal Lector who and he he beats the one guard to death and then he goes over to the guard that's like basically like dying and he picks up like the razor right and he's like I forget what he says but he says this horrible thing to the guy and you know the guy's just dead and you don't see what he does to him until later when he strings the guy up like an like an angel like a tortured Angel and cut his face off so that he could put his own the guy the guard's face on his and sneak out that way things like that were like really twisted uh insanely intelligent things like something you would do like a psycho would do but he's super smart that's always youed freak me out cuz you can't you can't no matter what you do there's no defense against that right yeah there's there's something about that I mean that's a great movie right like my earliest memory that movie was um I think like it was like I was confused about the",
            "start": 797.68
        },
        {
            "text": "no defense against that right yeah there's there's something about that I mean that's a great movie right like my earliest memory that movie was um I think like it was like I was confused about the scene where uh agent darling whatever her name is right is that her name Starling Starling yeah Clarice right goes in CL yeah Clarice right goes in like to meet Hannibal For the First Time and one of the criminals like throws something at her something and I was like something something and I was like what is that you know like a kid whatever I didn't not understand what like what was going on in that scene until like I was like 20 probably yeah um but there's always this like we talked about there it's just a trifecta of of things that are SC always scary in film right it's it's religion is always creepy oh yeah right and to me history is always creepy when they use it right and kids yeah oh gosh that so that leads me to my next the thing that probably left indelible marks on me was Poltergeist M the",
            "start": 841.16
        },
        {
            "text": "oh yeah right and to me history is always creepy when they use it right and kids yeah oh gosh that so that leads me to my next the thing that probably left indelible marks on me was Poltergeist. Man, the part there's like nine Parts in that movie. Well, I'm sure we'll get to all of them. The part with the clown to this day has me still looking out of my bed like I cannot I could not deal with that scene like when the clown comes to life and drags the kid into the and and it's just like don't do that. There's also and that's this is why step Spielberg back in the day and still to this day of course is amazing but back in the day he just had those like he would really know how to set the scene and they had those they didn't want to leave the house right cuz Caroline was missing and they had those haunting moments where she was like speaking to them from the TV right and Mary J Beth's like Caroline and she's like Mom and you hear that kind of like resonating crazy like techno sound from like the",
            "start": 883.96
        },
        {
            "text": "moments where she was like speaking to them from the TV right and Mary J Beth's like Caroline and she's like Mom and you hear that kind of like resonating crazy like techno sound from like the Beyond right but then they end up staying in the house right because they call in like The Clairvoyant and she comes in she's like this house it's clear but she starts speaking really softly and really slowly and it's really freaky yeah cuz you're kind of like dollying in on her like really slowly the whole time as she sort of talking about like what's going on and simultaneously though you do feel a crazy sense of like warmth and home which is why I thought that like everything he did in that movie was phenomenal but still terrifying and at the end the damn house like engulfs itself yeah and like God was so much in that the talking to the TV like the just the scene where the kids talking to the TV and like you don't see what she sees you know it's it's my favorite part of the movie has always",
            "start": 931.04
        },
        {
            "text": "God was so much in that the talking to the TV like the just the scene where the kids talking to the TV and like you don't see what she sees you know it's it's my favorite part of the movie has always been that the parents just don't stop getting stoned ever that's like the whole thing that movie is like they're always in their bedroom just smoking weed like constantly I was like all right well that's how you're going to deal with that just kill it oh they also had another another amazing SC I think it was in Poltergeist 2 with the worm do you remember that one might have been the third one there there's a part where Craig T Nelson's drinking tequila to cope and the worm in the at the bottom of the tequila bottle kind of wakes up and looks around and then goes down his throat and like possesses him freaky it's a good I mean my my my favorite I think we've talked about this on the show before my favorite scary movie is still Mary's Baby and The Shining are like two and three those are",
            "start": 973.12
        },
        {
            "text": "him freaky it's a good I mean my my my favorite I think we've talked about this on the show before my favorite scary movie is still Mary's Baby and The Shining are like two and three those are yeah those are class but my favorite is Children of the Corn still like cuz Children of the Corn is based on a Stephen King short story but I just **** love the premise of that movie what I don't think I've ever seen Children of the Corn what's the premise of it it's about two have you seen it before it's it's ex it's an excellent movie it's a short story you should read it too but it's it's a great movie it's about a doctor like a young kid who's like 28 he just became a doctor and like his girlfriend she he just graduated there like driving home like across country and they like end up in this town in like Oklahoma or something like that or Texas and uh it's like like they're having car trouble and they like pull into it's Gatlin Gatlin is the name of the and what basically what the the",
            "start": 1010.8
        },
        {
            "text": "town in like Oklahoma or something like that or Texas and uh it's like like they're having car trouble and they like pull into it's Gatlin Gatlin is the name of the and what basically what the the movie's about is like the the kids in the town like all the young kids basically took the town over killed all the adults and like rever these two kids like older kids as their God and so like they've maintained like the facade of this town for like two years no one knows anything's wrong because they have like a few adults that they've Left Alive that like keep everyone a bay and make things seem normal but like really like they have and they meet in the cornfield or whatever like and they like commune in this cornfield where this guy Isaac who's like the kid that they all rever as like a God and they have like all this weird like religious imagery and **** like that it's like so **** up yeah I remember that movie being really just like it's awesome freaky to the point of where it's",
            "start": 1045.96
        },
        {
            "text": "and they have like all this weird like religious imagery and **** like that it's like so **** up yeah I remember that movie being really just like it's awesome freaky to the point of where it's like I don't know what's happening really like I don't know what all this **** means but that scares me even more like not understanding this is scary to me surprises me that you have never seen that no I never have I always want it's on Netflix another uh I'll maybe I'll take that tonight actually um another I mean Stephen King basically everything he did freaked me out but the thing that the thing that actually one of the ones that I do now remember that stuck with me was uh do you remember It? Yes that was the first time I legitimately remember thinking I cannot watch this I can't finish this I don't know I shouldn't be watching this and I can't remember if it was a movie or a miniseries I feel like it was like a a three-part like Min that and The Stand were both both The Stand was the",
            "start": 1087.28
        },
        {
            "text": "I don't know I shouldn't be watching this and I can't remember if it was a movie or a miniseries I feel like it was like a a three-part like Min that and The Stand were both both The Stand was the the post-apocalyptic book he wrote um about like the virus or whatever and it's about like different people that survive it or whatever it's a great book oh I should check that out that's a fantastic book it's long but it's good no it it yeah so The Stand was like a Min series on TV okay yeah they did a lot of those but it was one of those where I started watching it I was hooked and then as it kept going I was like this is really terrifying like this is like and I'm sure I'm remembering it through like child's eyes cuz I'm sure if I watch today like oh Tim Curry is the the clown that's the way I feel about some of the things I've seen I mean like yeah I used to be what was that what was that one horror series that I used to be horrified of the um uh Hellraiser oh those were kind of weird",
            "start": 1127.32
        },
        {
            "text": "I feel about some of the things I've seen I mean like yeah I used to be what was that what was that one horror series that I used to be horrified of the um uh Hellraiser oh those were kind of weird though yeah they were weird like Lawn Mower Man and all that kind of **** like I was like there were certain movies like when I go back and watch them now like ah this is Lawn Mower Man was Puppeteer scared me was it called Pupp eteer there was those little toys and stuff that scared me because of the animation like how they looked it was like kind of clamation but kind of not and like it was so jerky and like it looked freaking like that's how I imagine toys would move yeah you know like they only have like three joints yeah which just really jerky and weird and it was that was scary that was the worst I'm going to give a just a special shout out real quick it's not a horror movie but I want to give a special shout out to Alive because that was another movie that used to scare me when I was being stuck",
            "start": 1167.16
        },
        {
            "text": "I'm going to give a just a special shout out real quick it's not a horror movie but I want to give a special shout out to Alive because that was another movie that used to scare me when I was being stuck in the Alps wait a minute that's crazy I was going to bring that up earlier too as one of like when they had to eat them like their each other that is something that stuck with me when Greg initially brought this up I was like that will forever stick with the first thing when I was like w that's a creepy movie well that that'd be a fun topic for the next show would you eat me if we were stuck in if we were stuck in the the Alps I don't know I don't know I I've thought about that situation before just generally like would you be account you know accountable like the the Doner party right I probably would well will you do what you have to do I guess like there's such a faux poob eating human in our society most societies which is understandable yeah there some societies that that's not what",
            "start": 1208.96
        },
        {
            "text": "would well will you do what you have to do I guess like there's such a faux poob eating human in our society most societies which is understandable yeah there some societies that that's not what look down upon I I don't I don't think it's like a societal Mo issue I just think it's it's where like the Apex like the alpha the apex predator like we don't eat our own you know yeah and we're also self-aware yeah so be a little freaky to eat Colin yeah I eat you though i'probably take a slice of you i'I'd go i'go you before I go Greg really yeah I feel like Greg's got a lot of good meat on him I want some of that Italian beef yeah I don't know if it translates so well when it gets to like the exterior Parts you know m Greg Greg tastes like a hot dog that's what I heard and beer he just tastes exactly like beer and pois yeah for for me going back to the kids it's not a a movie but the game Fatal Frame 2 did you do you play that and Butterfly Crimson butterfly yeah um looking at it now",
            "start": 1247.08
        },
        {
            "text": "exactly like beer and pois yeah for for me going back to the kids it's not a a movie but the game Fatal Frame 2 did you do you play that and Butterfly Crimson butterfly yeah um looking at it now it's like okay whatever this is stupid this is not scary at all um when I first played I think I was 11 and which was it's old for being scared by things like that but it's story these two little girls I don't even remember exactly the details but it's like two twin girls or something and they they have the camera and like you take pictures of ghosts and **** like you only see the Ghost with the camera and I remember playing it and it was more of a situational thing where in my the house that I was living in at the time um the only place I could play games was in this back room that had a lot of sun in it and so there was a lot of glare on the screen and it was really hard to see and it was me and my friend sitting there trying to like make out what the path through was supposed to be going",
            "start": 1293.88
        },
        {
            "text": "sun in it and so there was a lot of glare on the screen and it was really hard to see and it was me and my friend sitting there trying to like make out what the path through was supposed to be going on but you couldn't really see cuz like there was so much glare which just made it so much scarier and we're dead quiet playing and the controller didn't vibrate for the entire game and we walk up to this door and it just starts shaking didn't know it was going to shake I've never been more scared in my life and I had nightmares about that and that's the first thing I can think of fatal FR yeah and that was crazy are you done yeah you missed a good topic I'm sorry was it your was it Colin's it was your topic oh yeah I I enjoyed most of what I heard it was good I for the one piece [Music]",
            "start": 1338.28
        }
    ]
}