{
    "id": 442,
    "video_id": "fz4nCZWkaTI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Too Many Cooks  - The GameOverGreggy Show Ep. 50 (Pt. 2)",
    "description": "Tim Gettys shares his love for the latest viral video sensation.\n\nSee Too Many Cooks here: https://www.youtube.com/watch?v=QrGrOK8oZG8\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1416211204,
    "duration": 527,
    "transcript_chunks": [
        {
            "text": "Tim yes, what's your topic so last week the internet went damn crazy over this video called Too Many Cooks and it was the best thing in the world. Yeah, so for those that don't know we're annotating to it right down here - Adult Swim at 4:00 a.m. over the last month apparently has been running this uh 15-minute block called Infomercial. Um, that's just the best thing in the world. Yeah. Now Nick, what is it? Explain it. It's it's it's impossible to explain. It's basically just a giant troll. Like I don't know where this came from, what drug they were doing that made them do this, but I hope I never see with unlimited money so from what I hear is that's what happened. It was designed to **** with people that were high at 4:00 a.m. Yeah, and what it is cuz we haven't exactly explained yet is the old 70s and 80s like sitcom theme songs, int it has intro where it's like it'll like you'll see someone they're just like doing the thing and then look at camera smile and says their",
            "start": 1.1
        },
        {
            "text": "yet is the old 70s and 80s like sitcom theme songs isn't it has an intro where it's like you'll see someone they're just doing the thing and then look at camera smile and says their name underneath it but it just keeps going for like 12 minutes yeah yeah but it's like and that's selling is short CU it goes from in sitcom to sitcom to like crime drama to cartoon to space and the whole time there's a unifying thread that there's a murderer in the background of all these things and then at the end he starts killing everybody and they all try to stop them yeah the weird thing is it's not even the end that he starts killing him he starts killing him like maybe Midway through four five minutes into it he starts creeping out as I was watching it and me and Colin were talking a little about this earlier I people are in two camps with this either they think the end's better or the beginning is better like people think it either gets better as it goes on or that the beginning was the",
            "start": 55.36
        },
        {
            "text": "this earlier I people are in two camps with this either they think the end's better or the beginning is better like people think it either gets better as it goes on or that the beginning was the funniest I think the beginning was funniest I thought it kind of lost its track and just went crazy and there was no sense to it like unless I'm just not getting it unless this is some form of high art that I just can't wrap my head around it's it's the Adult Swim guys it's the Williams Street guys it is it is not high art it is high art there it's awesome like I'm with when I first saw it I was with you and I was like oh this is great it's going to keep doing it's going to keep expanding on into this like endless loop of 80s intros right because like it when it starts up the second one and then merges the families and everything gets crazy like oh that's really funny I wonder what but then when it gets crazy I remember in the middle of my first viewing I was like how long holy **** this",
            "start": 99.08
        },
        {
            "text": "then merges the families and everything gets crazy like oh that's really funny I wonder what but then when it gets crazy I remember in the middle of my first Final Fantasy Versus XIII I was like how long holy **** this is long and I jumped to the end to see what was happening and I was like oh okay and then I went back and like I wanted to see how it all piece together I think it's just a great riff on TV intros you know what I mean and just like GameOverGreggy they do like the Law & Order stuff and there and all these other different things that they pull it back together and make fun of and I mean it makes no sense sure but the fact like Colin kept saying when I showed it to him the first time why didn't we think of this we should have known like whoa like maybe we would have thought to do like make fun of 80s intros we would have thought to put a killer in it and hide him in the background cuz now then now it's one of those things you watch it again and you catch some different every time but it's just crazy like the",
            "start": 140.44
        },
        {
            "text": "would have thought to put a killer in it and hide him in back frame cuz now then now it's one of those things you watch it again and you catch some different every time but it's just crazy like The Killer is in every scene and that's awesome but why is it a slasher flip yeah it's weird like I'm sorry go ahead Nick no I was gonna say here's how how I think this went down and someone please if you were a part of this project correct me if I'm wrong someone was like hey it's almost the end of the year and we've got an extra $50,000 but we need to film something in a week go and that's just it and we have we have stuff like that happened to us all the time where we're like where someone's like not that kind of not that much money is like hey I have $50,000 you guys want to do a rap video no it's like someone's like hey we got to get this video out the door really quick just whatever the first thing is that comes to your brain go do it you know but so pretty much the exact same thing but",
            "start": 172.76
        },
        {
            "text": "it's like someone's like hey we got to get this video out the door really quick just whatever the first thing is that comes to your brain go do it you know but so pretty much the exact same thing but without the money without the money yeah exactly so if we had 50k and someone was like hey you got to get this done in two weeks go isn't the story that they they it took him a year to do it it was in post-processing for a year was it really yeah cuz like just to get everything done and have it all link up the way and use the graphics and the thing that was crazy to me is that there were any known names I thought that there was going to be a cameo at some point of somebody which one did you Google the girls I Googled a couple of them yeah apparently apparently they used apparently they are apparently they used a bunch of like extras and stuff like that and we're basically like we're not going to be able to really pay you that much but your name will be your real name will be in",
            "start": 216.04
        },
        {
            "text": "are apparently they used a bunch of like extras and stuff like that and we're basically like we're not going to be able to really pay you that much but your name will be your real name will be in the video and and uh yeah I think it's brilliant I was talking to Tim Gettys before that I would have I would have kept it going as it was in the first three or four minutes for as long as possible I think that that was really funny like when it went from to like the Roseanne Barr style and yeah like if they I just thought it would been been funny if they just kept putting more and more and more characters into it until there was like literally 200 characters in the in the show like that to me would have been funny enough like the whole slasher thing like I would not have come up with it's funny and it's silly we watched it like four times when we were in Kentucky bluegrass um to let you know how Kentucky went but uh it was it was it's very funny and very clever and it is one of those things where I think I'm",
            "start": 249.08
        },
        {
            "text": "we watched it like four times when we were in Kentucky to let you know how Kentucky went but uh it was it was it's very funny and very clever and it is one of those things where I think I'm like man I wish I thought of that cuz it's like it's such a it's an idea I actually really respect you know like it's a it's a funny idea what's your guys favorite parts from it a couple come to mind for me for me one is the weird cat puppet thing Cartman it's not it's not that's what his name is I don't know but yeah when for sure it has to crawl and hit the thing well it does nothing everyone of no it does it does it ends reality or whatever and then it does the like the multi-tile thing I thought that's what I thought oh yeah the crazy Ready Bunch yeah I thought it was like ending but my favorite part of the entire thing is the like bird I lose it at that every time I watch it yeah they do it like five times in a row and I thought that was the most BR",
            "start": 281.0
        },
        {
            "text": "it was like ending but my favorite part of the entire thing is the like bird I lose it at that every time I watch it yeah they do it like five times in a row and I thought that was the most BR but no and I can't what is it it's not Snarf that's who they're making fun of but Snarfle or whatever the hell the cat's name is from ThunderCats exact yes that's the original Snarf and they name this character a riff on Snarf I can't remember what it is but when yeah when he the first time when he does the rainbows and they shoot out of his hands but then yeah when he's mutilated and walks like have that that awesome scene from his perspective of him pulling himself towards the button like an aorta squirt there's like one shot of him with like a buddy neck squirting out I almost gave up watching it um the part where the serial killer like wins I guess and he's sitting there at the table like I was like okay you guys lost me here I don't I don't know if I'm into this but then it was like right after",
            "start": 324.8
        },
        {
            "text": "part where the serial killer, like, wins I guess and he's sitting there at the table like I was like okay you guys lost me here I don't I don't know if I'm into this but then it was like right after that where it really lost what's funny is I wonder if anyone that's watching this episode of The GameOverGreggy Show right now has is going to watch this first and if that spoils it for them cuz I don't think it would I still I don't there's no way you can piece together everything we just said into nothing makes any sense anyway for the video anyway we should Kevin we we should put uh in I don't know if there's a way to put text on the video in the very beginning like go watch the video first or something so people are aware of it yeah like and way you another thing I like and not for the reasons you think I really enjoy when it's still in the 80s, 80s part and there's the girl who's topless and there's that dumb nerd who's like looking like they both they both react but then what I like about this is first off",
            "start": 367.76
        },
        {
            "text": "Enjoy when it's still in the 80s, 80s part, and there's the girl who's topless and there's that dumb nerd who's like looking like they both react but then what I like about this is first off how stupid that is and how totally 80s that is and now we'd be like that's **** assault what are you doing but then the fact that later on she's playing Picary still holding her breast, I thought that was such a brilliant move. That so also at the end when they kind of go back and redo a lot of the scenes they did before but with different characters like when the girl plays the cop and stuff like that yeah it's weird I like I actually really like just because of how stupid it is in terms of that mid to late '80s Miller boy aesthetic or whatever, just the stuff when it was still innocent and fine and we didn't really know what it was going on with like when the girl when they're moving the couch and then the girl like gives up and just jumps on the couch the dad like",
            "start": 403.24
        },
        {
            "text": "innocent and fine and we didn't really know what it was going on with the girl when they're moving the couch and then the girl gives up and just jumps on the couch, the dad grabs his back and spins around - it's like there's just a lot of F. And also the guy in the office where they're giving him all these papers off, and then he looks at the camera like yeah, it's so... and I like when that guy comes home to the other dad and they're holding their respective wives, and then they all make out with each other - that was before we knew what we were getting into. You're like, oh, that's funny. Yeah, that topless girl - I'm going to say it for the reason you weren't thinking. I Googled her; it was a good Google. I liked her; she was not bad looking. M I love it; I think it's a great video; I'm glad it's blown up; it's brilliant. Yeah, it's really infectious song too - oh yeah, like that's hard to forget. Yeah we",
            "start": 441.04
        },
        {
            "text": "it up it was good she was not bad looking M I love it I think it's a great video I'm glad it's blown up it's brilliant yeah it's really infectious song too oh yeah like that's hard to forget yeah we Apple Spice and all that like whatever it takes a lot to make us do what my favorite thing was how they kept changing up the song like the third repetition of it I was like okay God damn it but then once it went to like the G.I. Joe thing I was like I love you guys and the space thing yeah whatever I almost **** that up I almost added a z in there an extra C to on a live stream said what kind of animals Chester Cheetah so don't worry you're okay the stupider things have been said in the last 24 hours yeah all right that's good I like that everybody should go watch that video absolutely",
            "start": 472.68
        }
    ]
}