{
    "id": 432,
    "video_id": "j_NgW8ycacA",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "The Best '90s Bands - The GameOverGreggy Show Ep. 48 (Pt. 3)",
    "description": "Colin Moriarty discusses the greatest bands of the '90s.\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1415174403,
    "duration": 1468,
    "transcript_chunks": [
        {
            "text": "so my topic is '90s music now we were talking a little bit about this um earlier Damon and I now Damon and I are both musicians and we're really into the music and we both have a soft spot for the 80s but we also have a very soft spot for the 90s and I was remarking that with '90s music the fact that that's in Vogue now people are oh I love the '90s I'm like wasn't the '90s like two days ago and then I start to be like I'm old I'm really old now it's 2014 it's almost 2015 the 90s were 15 years ago end of the 90s so it's like the '90s are 20 years ago really the yeah the president of the United States and all that was years stuff happened at the end of the 90s man I mean you're talking like Clueless was late 90s no way no Clueless was 95 it's like yeah straight up mid-90s okay well Can't Hardly Wait it was like that Wayne's World Pokemon was the 90s Pokémon, '98 yeah it came out '98 oh really I",
            "start": 1.1
        },
        {
            "text": "can't hardly wait it was like that Weezer Pokémon was the 90's Pokémon; 1995-1996 talking about the movie Pokémon, which one are you talking about the game didn't come out '98 yeah it came out in '98 oh really I thought I just thought it was earlier than that November '98 so like what are your like I I guess I just want to talk about cuz I really love '90s alt Rock and like you know obvious rap rock and all that kind of stuff but I just feel like with a lot of different genres there was good stuff having hip-hop like a lot of really a lot of really excellent stuff so like what are your remembrances of '90s music and what are some of your favorite bands and songs maybe some of your least favorite band songs I also think some of the worst music comes from the 90's I.E. the Macarena or something like that Linkin Park I I'm pretty sure there were 2,000 hybrid albums there was 2000 oh man Limp Bizkit was coming up in 311 yeah that was all '90s yeah like like significant other when Oasis for sure I'm a fan of",
            "start": 47.16
        },
        {
            "text": "Lincoln Park I'm pretty sure there were 2,000 hybrids there was 2000 oh man Lenny Kravitz was coming up in '91 yeah that was all '90s yeah like like Significant Other when Oasis for sure I'm a fan of the '90s oh man '90s had like \"Wonderwall\" that was that was such a song people don't remember the 90s as fun like people in our generation Tim because you were like 40 years behind us uh I don't think we when you start thinking back on it like on a first glance I'm like the 90s was not the best decade I've lived through the 80s was awesome so much cool stuff happening in the 80s like you know TV started reigning supreme all this stuff happened big blockbuster movies they all that stuff you think the 90s is like a dry spell kind of and then you start really digging into it and there was like a lot of great stuff that happened in the 90s for sure a lot of great stuff for sure let's dig into that let's let's 9s is amazing unack unpack yeah we can absolutely first of all Colin like",
            "start": 80.64
        },
        {
            "text": "Was like a lot of great stuff that happened in the '90s for sure, a lot of great stuff for sure. Let's dig into that. Let's let's. The '90s are amazing; unpack yeah, we can absolutely first of all Colin, like it's no secret who your favorite band is. Yeah, 311 is my favorite, and they come I mean so they I mean they were. We have to sing a 311 song every time Colin says it. They were they, and I don't know any so I just say \"This Beautiful Disaster\" beautiful; I don't even know that one, Transistor track four. Uh, so they were technically formed in 1988 but like they are they are a '90s band for sure; they're a career band like they're still going today like they've made like this is their niche, niche; they have their things they do like they tour twice a year like every year like they sell out those tours. Yeah, I remember seeing them; they came to Irvine in like 2002 and I was like damn, damn; they are still going 'cause at that point I thought they were kind of long in the tooth but I",
            "start": 128.6
        },
        {
            "text": "sell out those tours yeah I remember seeing them they came to Irvine in like 2002 and I was like damn damn they are still going cuz at that point I thought they were kind of long in the tooth but I guess they're still what are they like 70 now not many bands 25 years yeah they're like in their mid 40 I mean they they their guitarist joined like replaced their other guitarist in like 1989 and they've been the same I thought you're going to say their guitarist replac I I just love that they're the same lineup it's not the same it's like Alice In Chains' like toured for a while let talk about 90s Alice In Chains is awesome but like Layne Staley died and then they just replaced this singer Now Jerry Cantrell can sing and actually like a lot of people don't realize that in a lot of their famous songs he is singing like harmonies yeah well like uh I'll be broken by my master that's him like that's him singing that's like one of the most iconic parts of anyone is that wrong isn't that off The",
            "start": 173.72
        },
        {
            "text": "songs he is singing like harmonies yeah well like uh I'll be broken by my master that's him like that's him singing that's like one of the most iconic parts of anyone is that wood isn't that off The Singles soundtrack oh you have a '90s movie see damn yeah singles another great film like so I always like so they kind of got away like that's always weird but I like a band that tours or it's like I saw Journey a few years ago and and they're awesome but and the singer sounds just like like uh the new singer yeah like like uh Perry Como but it's not the same you know so I like a band that travels around does that kind of so yeah three but like when I think about I don't even think about them as 90s man because they kind of transcend for me I think about Green Day I think about No Doubt I think about Spin Doctors I think about Manowar I think about Scott Stapp Scott yeah Scott was cuz Scream was a great band I'm just",
            "start": 208.24
        },
        {
            "text": "I think about Spin Doctors, I think about man wow rage, I think about you think you think Scott Stapp, Creed, yeah Scott was 'cause Creed kind of Boston urge like there was like great Creed band I'm just going to throw words squirrel nut zipper yeah squir that one record with hell on it that was one of the last tapes I ever bought before I started buying CDs oh you know who just put out a new record Rancid, yeah Rancid, oh ran is awesome dude uh and Offspring, the Offspring is like such an awesome that album is awesome yeah that's with like Time Bomb, Ruby Soho, Roots radical really really good songs so there's like a lot of great that it's just so dense with awesome music well let's yeah let's let's not skip over Faith No More oh Faith No More Of course again a band I started in the '80s but really didn't come to prominence until 1991 the real thing was like '89, yeah but then uh Angel Dust was 91, yeah um one of my favorite it's crazy you're naming a lot of groups and a lot of types of music that I",
            "start": 254.24
        },
        {
            "text": "come to prominence until 1991 the real thing was like '89, yeah but then uh American Music Club's Mercury Position was 91, yeah um one of my favorite it's crazy you're naming a lot of groups and a lot of types of music that I just skipped over completely like it just I think I was young that yeah but at that point I didn't like raping hip-hop so to me 90s music is two very different things boy bands and then hip-hop but the hip hop is mainly me going back in the 2000s going back to the 90s cuz yeah what's the greatest boy band to come out of the '90s in Sync that's there's no question that's the one that gave us Justin Timberlake right yeah JT yeah he has staying power yeah but yeah '90s was the years of the boy band yeah and I mean they're still but they're like now they just wear a lot of scarves there's always like every time I see a picture of a boy brand if it's more than four people three of them have scarves and they like flow they're not do but they're in LA like you don't need scarf in LA back of your",
            "start": 303.2
        },
        {
            "text": "every time I see a picture of a boy band if it's more than four people three of them have scarves and they like flow they're not do but they're in LA like you don't need a scarf in LA back of your neck's going to sweat the entire time only you can ever look at a boy band and they don't need anything ever like you like the guy from 'N Sync didn't need the laces in his hair yeah what was his name Justin Chris Katich yeah he was a bad one what about Spice Girls were they yeah so Spice Girls 'N Sync Backstreet Boys 98 Degrees yeah Nick um yeah 98 degrees is like the forgotten well not even CU there were really obscure boy bands that had like one hit yeah 98 degrees I'd say the tier I'd say not that low well what about New Kids on the Block is that more 80s they exist crossover to the early 90s but I would consider them more like 88 '89 when they cruised now they're doing the cruises New Kids on the Backstreet Boys where it's them and B boys doing a joint like on like a cruise ship yeah",
            "start": 353.32
        },
        {
            "text": "but I would consider them more like '88 or '89, when they're doing the cruises. New Kids on the Block and the Backstreet Boys are doing joint tours on cruise ships, yeah, that's the new thing. All these bands are doing cruises like that, and it must make a ton of money for them. There's a Kid Rock Cruise every year, is there? Yeah, I believe so - thousands of rednecks on this cruise ship for a long weekend. My old hockey coach used to love Kid Rock; my old hockey coach in high school was like an awesome guy and he just loved Kid Rock. Like, that's still one of the things I remember most. Okay, let's stop for a second - we all loved Kid Rock when he came out, but that first record was never really my thing. I knew some people who had that.",
            "start": 398.76
        },
        {
            "text": "let's stop let's stop for a second we all loved Kid Rock when he came out that first was never a fan I never bought that stuff but that first record was pretty good I knew some people that had that record uh what was he know was he in another band first or like how did he became how did he become famous was he just always just kid the only the only thing I remember from about him was that he had the little guy in his band that died and also Uncle Cracker was his DJ who then spun off and did his own thing that's the only thing I remember about Kid Rock and like a few of his songs I wasn't really into it which was weird because he was kind of like rap rock and I just wasn't really you're a big rap rock and I wasn't I just wasn't into it I wasn't into it the 90s was rage raging Rage Against the Machine was so good dude I didn't even know it's so hard for people to believe like I was so in Rage which is like hyper liberal like socialist like messages and I love it and I still listen to it today and I'm like",
            "start": 439.76
        },
        {
            "text": "dude I didn't even know it's so hard for people to believe like I was so in Rage which is like hyper liberal like socialist like messages and I love it and I still listen to it today and I'm like man they're so smart you know Tom Morello went to Harvard and stuff so it's like they're they're smart guys but I used to wear like Rage Against the Machine shirts with like really provocative messages on them I remember there was one shirt with like a nun holding machine guns that I had or whatever my mom was like what are you wearing there's nothing there's no equivalent today there's no like hyper political band like like Raging against the Machine that sells it you know like being played on top 40s radio stations and he was just like screaming stuff and you were like I believe that this guy believes what he's talking about I feel like Lupe Fiasco is like the closest thing to that now like he's insane I'm no he like I I can't believe he got away with some of the **** he says on the radio and stuff and like it's popular music and",
            "start": 474.0
        },
        {
            "text": "Fiasco is like the closest thing to that now, like he's super insensitive. I'm no fan of his; he likes to say stuff on the radio and it's popular music, and he just kind of says things just to start controversy, so it's like that but I mean it is super ridiculously political in a way that reminds me Rage Against the Machine – it just doesn't know what it sounds like. So yeah, me and my friend Ramon, uh, my best friend from college, and I used to joke around that the FBI would always be in the crowd at Rage Against the Machine shows with like a folder just writing things down probably because these guys are pretty militant, um, but they're awesome. Yeah, I think... you got to go a little earlier too; you guys are forgetting like a huge portion of so you're talking about like grunge, yeah, I mean you think '90s, you got to think grunge, you got to think Pearl Jam, you got to think Nirvana, you've",
            "start": 513.2
        },
        {
            "text": "are you guys are forgetting like a huge portion of so you're talking about like grunge yeah I mean you think ' 90s you got to think grunge you got to think Pearl Jam you got to think Nirvana you've got to think Soundgarden I guess so who are just putting out a new album soon I think and then uh Stone Temple Pilots oh STP is awesome really good the Purple and Core are really good records I like I like Purple more a lot of people like Core more but do you like the Hidden Track on Purple it's so good they're there's a special band I was so happy I got to see them that was like one of the Bands where I didn't think it was like similar with Faith No More when I got to see them like I it was a band where I was like I thought I might have missed my chance and then was Faith No More what is this what is it what is it yeah yeah they're San Francisco band too and I saw them um at the Warfield a couple years ago Cheryl's not even into them and I",
            "start": 553.64
        },
        {
            "text": "and then was Faith No More the what is this what is it what is it yeah yeah they're San Francisco band too and I saw them um at The Warfield a couple years ago Cheryl's not even into them and I brought her with me and she was like that was amazing because they they it was just they open with From Out of Nowhere and just like **** punched you in the face and I was like oh this is awesome they're they're all old they're like in their late 40s and they're still like the bassist who like you know plays all slap and like crazy he's all bald now he's just like headbanging and like going nuts oh God yeah and then there was uh you got the Red Hot Chili Peppers too EXC they started technically in the 80s though right yeah mother one of those 80s bands that kind of it was Suicidal Tendencies that was like Under the Bridge God that was so good man that was just like that just makes me think of Point Break which makes you think of **** pey oh 90s were good time it makes you think of Point Break cuz they have",
            "start": 587.48
        },
        {
            "text": "The Best '90s Bands - The GameOverGreggy Show Ep. 48 (Pt. 3)\nColin Moriarty discusses the greatest bands of the '90s.\nGet everything early here: http://www.patreon.com/kindafunny\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\nBuy our shirts! http://www.districtlines.com/gameovergreggy\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys\n\nbridge God that was so good man that was just like that just makes me think of Point Break which makes you think of **** pey oh 90s were good time it makes you think of Point Break cuz they have bit Parts in it yeah in it he blows his foot off they're awesome yeah they do have weird I mean and fleas in which is so weird there's all these like weird there's all how does that happen they just have good agents that are like you're chil Peppers you want to go in I me yeah I guess you're chil pepp you want it's just like who I mean if you're doing a movie in the 90s and like they're like do you want Anthony Kus to be in your movie for like bit part sure why not it's like there are all these random movies where Henry Rollins has but it's random it's like he yeah he was in a lot he was in like John monic you're like what are you doing Henry Wallin he's like you know because he's super political yeah he would just be like have one part where he talk about how the machines are taking over",
            "start": 628.68
        },
        {
            "text": "John Monae you're like what are you doing Henry Winkler he's like you know because he's super political yeah he would just be like have one part where he talks about how the machines are taking over it's Cor in America and then he'd like kill someone like that's cool thanks Henry Winkler he's also a a terrible uh Neo-Nazi and Sons of Anarchy oh is he I haven't gotten through I haven't seen that show yet I Haven't watched I watch Greg loves that show um so I'm thinking about now I'm thinking about the mid 90s and what I'm thinking about with the mid 90s is there's some great bands like President of the United States and whatever that came and kind of went I think the mid 90s is is also emblematic of the rise of the band fronted by women so Luscious Jackson Garbage uh no doubt um hle hle uh there's like a ton of bands and also the singer songwriters so like Natalie Cole Lana Del Rey Julie London like so there's like there's like a lot of good stuff in the mid 90s coming from women um Tori Amos oh Corey Crow",
            "start": 666.36
        },
        {
            "text": "of bands and also the singer-songwriters, so like Natalie Cole, Lauryn Hill, Janet Jackson, like so there's like a lot of good stuff in the mid-90s coming from women. Um, Tori Amos, Alanis Morissette, Jewel, like so there's a lot of that. Destiny's Child, oh come on, little later right? I mean they rose in '96 or so, but they what was like, like 98 or 99 was when anyone really gave a ****. Was like \"Bootylicious\", was that was TLC, TLC was a little earlier, so that was like in their early mid-90s. Oh God man, um, so good Salt-N-Pepa, oh Sal, salt and pepper, yeah, \"Push It\" was in that's the like mid 80s song but one a man I think was like maybe early '90s, yeah, I mean they I feel like they came back. Let's talk about um just Progressive and then I agree with like the late 90s, that's when we got into so there was like a weird thing in the late 90s you had like really weird **** like Orgy and Marilyn Manson and all that kind of stuff, then you had well there's a big like Electronica right explosion in the late in",
            "start": 707.68
        },
        {
            "text": "a weird thing in the late 90s you had like really weird **** like Orgy and Marilyn Manson and all that kind of stuff then you had well there's a big like Electronica right explosion in the late in the late '90s with like you know you mentioned org but there's also like um uh Fatboy Slim oh yeah and Chemical Brothers and uh Prodigy yeah all those guys oh Prodigy was awesome fat of the land now that was a great record that was one of the first CDs I ever bought and that that was an awesome Fire Starter Twisted how big that M album was oh M was yeah m m still does stuff right yeah he mov does a lot of like movie soundtracks and stuff now like spin that **** that's good **** dope Job movie yeah rapat man I think rap is what it all comes back to because take it one step back for a second we're gonna talk rap in a second I know you've been itching to talk about this did want to give a shout outs no doubt Gwen Stefani thean back in the day still hot unbelievably good-looking back in the day",
            "start": 753.6
        },
        {
            "text": "we're gonna talk rap in a second I know you've been itching to talk about this did want to give a shout out no doubt Gwen Stefani back in the day still hot unbelievably good-looking back in the day she looks the same today she looks like exactly she is in her she's the female Keanu Reeves 4 she looks amazing she's did you guys see her on the um the Jimmy Fallon lip sync battle thing no did she do one of those yeah it was the worst was it the worst see I don't know that she like has like a sense of humor or much of a personality no she does she does she's she's great but it's just like I think that she just didn't she wasn't able to do someone else's thing that well it was weird it was really weird I expected to be she's not like an actress like the people that do well on those are actors is the best by far and and before we talk about hip hop because I think we should close on hip hop because it is essential it really is integral uh just want to give two shout outs real quick the bands that",
            "start": 798.28
        },
        {
            "text": "by far and before we talk about hip hop because I think we should close on hip hop because it is essential, it really is integral. Uh, just want to give two shout outs real quick. The bands that a lot of people don't really think about that I really loved in the 90s uh one is Bar None Ladies, before Stunt came out, before One Week they were really really really awesome, they were a great band I saw them a bunch of times live with my sister, they were one of the first bands I ever saw live. Albums like Gordon and Born on a Pirate Ship are excellent albums still to this day and people should go check those out. The other band is Ben Folds Five uh oh yeah which is essential they were awesome piano R I think that's for you um if you're not going to eat this apple pie soon please offer it to your friends tonight uh Cheryl made homemade an apple pie Cher we'll have a slice thanks um so uh that might have sounded a little weird uh so no not for this show okay no that's true uh so uh Ben FS 5 awesome too",
            "start": 839.96
        },
        {
            "text": "Uh, Cheryl made homemade an apple pie Cher. We'll have a slice thanks um so uh that might have sounded a little weird uh so no not for this show okay no that's true uh so uh Ben Folds 5 awesome too self-titled album uh Whatever and Ever Amen and Ryan Adams - awesome awesome **** album I always got them confused with Three Doors Down which was like Three Doors Down is fine too but different bit very similar sound yeah very I was like who's what Ben Folds what what is he doing five of them um so that's it let's talk about R so baby I will argue till the day I die that rap is better now than it ever was if you're looking in the right places that's the thing you got to be listening to the right people yeah this this sounds like a very inflammatory statement are right now my friend but I will argue that but if I'm arguing it I'd be arguing it against people that are saying the early 90s rap is the best yeah I mean that's what you're arguing no people would be arguing me saying that okay that's",
            "start": 874.28
        },
        {
            "text": "that but if I'm arguing it I'd be arguing it against people that are saying the early 90s rap is the best yeah I mean that's what you're arguing no people would be arguing me saying that okay that's second to what's going on now but what was going on then we got The Tribe Called Quest yeah we got Tupac we got Biggie we got Jay-Z we got N.S. we got Eminem what that's yeah you got the whole Death Row like yeah we got all that stuff too you're forgetting a lot too uh Public Enemy and Beastie Boys MH but it's like if you ask anyone who likes top five they're going to name at least three of those probably in their top five everyone's going to say Tupac that's insane I think Tupac was the most influential artist to come out of that period cuz he died my problem with Tupac AR the problem with Tupac is I feel like a lot of people are fake fans of Tupac they say they like him but they was I wasn't a fan at all it's one of those things it's like oh what your like name three songs and they're just like uh",
            "start": 918.76
        },
        {
            "text": "like a lot of people are fake fans of Tupac they say they like him but they was I wasn't a fan at all it's one of those things it's like oh what your like name three songs and they're just like uh changes uh Dear Mama um and they just can't that's have you noticed that I I couldn't name three Tupac songs I could if I heard Tupac songs I be like oh yeah I remember I was not a very recognizable but I mean again I've I've gone back and said that hip-hop was not my thing until later and there's only select things that I like about hip-hop that I'm now getting exposure to 90s hip hop going oh God man I wasted my life back then when was Eazy-E was he like 80s N.W.A. was was that '80s i 0 was it I count them as 90s though like like they really did **** in the early '90s I don't know I don't know about that I mean I guess here's like even like to me 88 on counts as 90s it's like 88 to 98 no that's that's 80s I always got N.W.A. and 2Pac mixed up for some reason no the reason the reason",
            "start": 974.76
        },
        {
            "text": "about that, I mean, I guess here's like even like to me '88 counts as 90s, it's like '88 to '98, no, that's that's 80s. I always got N.W.A and 2 Live Crew mixed up for some reason. No, the reason the reason that I don't I don't count the 90s starting like '88, yeah, I know those were awesome 80s years. For other reasons we can do another top about Heral one day cuz I I can talk about Heral all **** day because it's **** awesome, it is awesome. You want to talk about Poison, don't even M.C. or is that or is that too mainstream? No, no, that's awesome. I I I love even like like I always say and I always joke around enough's enough is still like one of my favorite hair metal bands cuz like no one even knows who the **** they are what song do they do a new thing you can look that up, Enough, enough? Sure recognize oh you would it's awesome. I told you I went on a date one time with a girl she took me to this concert down on Irvine theater no no it was a Poison show yeah my brother went on that tour like Ratt",
            "start": 1024.04
        },
        {
            "text": "oh you would it's awesome I told you I went on a date one time with a girl she took me to this concert down on Irene Theater no no it was a Poison show yeah my brother went on that tour like I did he saw like Hartford or something I was like that's awesome he's like I'm seeing Ratt and Poison yeah you **** kidding me yeah oh my God I lose my mind if I saw Ratt live I love those guys pretty amazing they're so awesome they're old um sadly now yeah 90s Hip Hop's awesome I think that I I I just haven't heard the argument for why it's better now well I'm saying if you're if you go to the right places I'm not saying that mainstream rap actually that's the other thing though is I feel like there are a lot of good mainstream artists on the radio now even compared to back then CU back then it's not like we were getting a lot of these people on the radio you know like that you still had to like that was all word of mouth **** and like like Day LA wasn't playing on the radio no they were but I",
            "start": 1064.68
        },
        {
            "text": "like we were getting a lot of these people on the radio you know like that you still had to like that was all word of mouth and like like LA's Day wasn't playing on the radio no they were but I don't think I don't think any yeah I agree with you like they had a few tracks on the radio that were pretty big but but no they they maintained through word of mouth and also geographic loyalty I think because I think that's the same way I liked Biggie when I was a kid over Tupac I like well he's he's East Coast he's from the East Coast I'm from the East Coast I mean I even identified with that I was like 10 years old you know I was like playing with like you know GI Joe been like yeah I'm a Biggie guy but my my thing is that feels like that because of the internet and because of just the fact that tools have gotten easier to use for everybody the people that grew up on the '90s stuff which was the good stuff because before that it wasn't that good it was just like a bunch of nursery rhymes",
            "start": 1102.68
        },
        {
            "text": "have gotten easier to use for everybody the people that grew up on the '90s stuff which was the good stuff because before that it wasn't that good it was just like a bunch of like nursery rhymes  majority no I agree with that I think I think 80s rap is really important for the genome of rap but I agree with you like I can't go back and listen to a lot of that crap except for the Beastie Boys like and some select other things but most of it's most of it is like very yeah so I feel like the '90s kind of made it a real thing and got like really good and in certain places there was also a lot of really bad '90s rap too and then the 2000s was just like it sucked hell it was so bad but then now I feel like it's the people that learned from The '90s wanted to correct the 2000s and it's they're they're allowed to just keep doing their own thing and they don't need it to perform in the radio stuff because who gives a **** about the radio when they have the internet so sure there's",
            "start": 1140.36
        },
        {
            "text": "they're they're allowed to just keep doing their own thing and they don't need it to perform in the radio stuff because who gives a **** about the radio when they have the internet so sure there's some great I mean there is some great hip-hop today like I love Kendrick I love Wiz Khalifa I love like there's a lot of guys like I love like that are awesome but if I had to choose we had to go on a desert island or whatever scenario and I was like I I can bring 10 albums with me 10 rap albums I might bring like one or two from today like I'd probably bring Bun B's Trill OG, I' probably bring I'd probably bring I'd probably bring Kendrick's good kid m.A.A.d city but everything else would probably go bring me back to the 90s you got to bring De La Soul's Buhloone Mindstate you gotta bring De La Soul's Stakes is High you got to bring Wu-Tang Clan's 36 Chambers you got to bring I mean there's like you know there's it's overwhelming I would even but I love Eminem like I'd probably even bring Eminem's",
            "start": 1183.88
        },
        {
            "text": "uh Stakes is high you got to bring Wu-Tang's 36 Chambers you got to bring I mean there's like you know there's it's overwhelming I would even but I love Eminem like I'd probably even bring Eminem's first two records I'd bring you know so it's like the good news is that it's all good like there's everywhere you are there's good stuff I think Rock has fallen significantly much further than I think rap is W um I'll give you that yeah see my thing with the rap is anybody that's arguing with that **** I'd say listen to any album by The Cunnin' Linguists and tell me that that isn't Leaps and Bounds better than that **** yeah I think the only problem I have is like there's I don't know everything just maybe because it is so easy I just it's hard to separate the good from the bad because there's so much more of it now that we're getting inundated by so I don't disagree that there's probably a lot of good sound out there but it's hard to get to because that's all I'm saying so much of",
            "start": 1221.96
        },
        {
            "text": "there's so much more of it now that we're getting inundated by so I don't disagree that there's probably a lot of good sound out there but it's hard to get to because that's all I'm saying so much of it yeah there is you need to know where back in the day in the mid 90s if you were popular it's because you had hit such a level that no one could touch you and as long as you kept putting out something good you were going to stay on top for a while but even then it's it back then you had to have the single like Eminem on MTV yeah yeah I guess that's true so the the one thing I'll say and I I won't play it for for too long I'll play it for only few seconds is that the one thing I always tell Cheryl this like the one thing that early and mid90s Hip-Hop does to me is it makes me very nostalgic I feel like it sounds a lot of it very nostalgic I'm not even talking about like the gangster rap I'm talking more about the laid-back like De La Soul kind of rap like the more",
            "start": 1266.0
        },
        {
            "text": "Feel like it sounds a lot of it very nostalgic, I'm not even talking about like the gangster rap. I'm talking more about the laid-back, like De La Soul-ish kind of rap. Like the more I think that's because of the samples. Like the early 90s were so sample-heavy and a lot of it was just records. So you hear the like funk and soul stuff from the '70s. But this song specifically does it for me, and I want people to listen to the whole thing, just the beginning of it. You're going to get a copyright flag. Yeah, we'll do it real quick. We'll do it real quick because it's only a few seconds. Oh wait, I got to... I got a hold on a sec. Wrong volume, wrong volume, wrong volume, ringer volume good. Okay, just that laid-back yeah. It was like you're talking about like to me that they totally do make them like this. No, do you like do you know Run the Jewels? Who's Run the Jewels? No, check out... okay, oh that was a good topic I enjoyed that topic very much. I love music very much for the",
            "start": 1303.16
        },
        {
            "text": "totally do make them like this no do you like do you know Run the Jewels who Run the Jewels no check out okay oh that was a good topic I enjoyed that topic very much I love music very much for the long time for the longest time I thought the 90s had sucked but now that now that I the 90s were awesome Total Recall came out in the '90s it did yeah 91 so did uh T2 yeah t it's a very eclectic it's a very eclectic decade it's it's a decade that we hold close to our hearts because we all up in that decade but it's also a very formidable decade in terms of everything movies music books video games everything it's a really special decade it's not as special as the 80s but it's it's but it's special it's very yeah for me like you know coming from Cinema like you're talking about movies I think one could argue that get better as you go backward in time because now we're sort of like we've got amazing films now but I I'm not as excited about some of the stuff that's happening as I was two years",
            "start": 1346.64
        },
        {
            "text": "Could argue that you get better as you go backward in time because now we're sort of like we've got amazing films now, but I'm not as excited about some of the stuff that's happening as I was two years ago. And then I'll never be as excited about a movie as I was when I was like nine - maybe that's just because I was nine. But in the 80s, also you were seeing new stuff all the time, like Jurassic Park blew my mind: \"That is a dinosaur! They got a dinosaur; they grew it up; they fed it humans and then they trained it.\" Steven Spielberg trained a dinosaur to be on camera - the beauty of Jurassic Park, by the way. This is a tangent, but it's just like that movie still looks awesome; it looks good, and it's because they didn't overthink it. It's like all real; you know what I mean? It's not like it's not like it's obviously not real dinos, but it's just like Spielberg and those guys - like understood posterity, that like the movie would look better if they didn't mess around too much.",
            "start": 1397.12
        },
        {
            "text": "not like it's not like it's obviously not real dinosaurs but it's just like Spielberg and those guys like understood posterity that like the movie would look better if they didn't **** around too much yeah when Laura D'Arcy is leaning up on the triceratops right like it's not like it's not CGI no it's a real thing it's very cool very like really wonderful looking movie um so that was a good topic good topic thank you Colin thank you thanks col good topic",
            "start": 1436.4
        }
    ]
}