{
    "id": 101,
    "video_id": "nPCnMLgN9tY",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Captain America Sucked at Everything Else: Geek Week",
    "description": "Captain America tried to be a lawyer and a politician, but when that failed, he started throwing trash lids. See, Colin doesn't like comics, but he loves driving Greg crazy. For YouTube Geek Week, Colin's butchering one classic comic book origin in each video and watching Greg cringe.\n\nSUBSCRIBE/LIKE/SHARE\n\nWatch the other Horribly Wrong Comic Book Origins: http://www.youtube.com/playlist?list=PLOlEpGVXWUVtoTPsBvu65SG52bZzPVn41\n\nWatch more YouTube Geek Week videos at http://youtube.com/geekweek\n\nAnimations by the AMAZING PandaMusk -- follow his antics at http://www.youtube.com/pandamusk and http://www.twitter.com/pandamusk.\n\nShot on location at Isotope Comics in San Francisco. Go there, and tell James \"Horribly Wrong Comic Book Origins sent me!\" - http://www.isotopecomics.com/ \n\nFollow us on Twitter:\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\nNick - http://www.twitter.com/nickscarpino",
    "published_at": 1375852004,
    "duration": 364,
    "transcript_chunks": [
        {
            "text": "Welcome to Horribly Wrong Comic Book Origins, where a non-comic fan takes a crack at a classic comic tale. Today's origin is Captain America. Alright, so Greg, the story of Captain America actually begins several hundred years ago. Several hundred years ago? Yeah. Was America around yet? We can go from present day to the time of the American Revolution in the 18th century, because they're interconnected in the sense that Captain America's story transcends both. So Captain America's name is Adam Adams. It's one of those names that you make fun of. It's like Fredrickson or something like that and you kind of make fun of it. But Adam Adams' last name, of course, is the same as John Adams, the second president of the United States, and John Quincy Adams, the sixth president of the United States. And it's the same lineage. They've lived in Massachusetts this whole time, and Adam Adams grows up as a sort of privileged man, right? Coming from really one of the most famous families in American",
            "start": 0.0
        },
        {
            "text": "And it's the same lineage. They've lived in Massachusetts this whole time, and Adam Adams grows up as a sort of privileged man, right? Coming from really one of the most famous families in American history. And he ends up going to Harvard Law School. Now everything has been handed to Adam Adams. Everything's been handed to him on a silver platter. And he's never really been very good at everything. He's always kind of taken a lot of pride into his family. Never been very good at everything. Yeah, everything. Everything was like, he didn't excel at anything. At school, at sports, he didn't excel with women, he didn't have great friends. He was Adam Adams, and so he just had privilege. So he gets into Harvard Law School, he certainly doesn't belong there, and he ends up kind of graduating towards the bottom of this class with a law degree. And he doesn't know what to do next. People in Massachusetts kind of know that he's not really up to snuff, that he's not really carrying the Adams",
            "start": 46.24
        },
        {
            "text": "towards the bottom of this class with a law degree. And he doesn't know what to do next. People in Massachusetts kind of know that he's not really up to snuff, that he's not really carrying the Adams banner proudly. And so he moves to Texas. And this is where the story of Captain America really starts to begin. People in Texas are really impressed with Adam Adams' last name specifically in his history. Now you have to understand there's a lot of historical strife between the North and the South, but at this point in the 1970s, Adam Adams is able to kind of find a niche in Texas because the memories of the Civil War and Reconstruction are kind of fading in the minds of everyone. And there's a lot of snowbirds down there and stuff like that, so a lot of people kind of support him. Adam Adams ends up running for Congress in the 7th District of Texas. Oh wow. 7th District, that's a hard one to win. Yes, it's a really tough district, it's a purple district. Oh wow. And so Adam Adams runs",
            "start": 87.38
        },
        {
            "text": "ends up running for Congress in the 7th District of Texas. Oh wow. 7th District, that's a hard one to win. Yes, it's a really tough district, it's a purple district. Oh wow. And so Adam Adams runs for the House and he actually ends up winning based on the strength of his name. His name alone! Yeah, yeah, everyone's like really impressed that he's an Adams, you know, and he's like, I am an Adams. So he doesn't excel at everything, but he's going to Harvard, he's a lawyer, his name gets, okay. Yeah, you gotta use what you got, you know what I mean, Greg? Totally. So he wins, but when he goes to Washington to represent the 7th District of Texas, he ends up kind of showing his true colors again. He's not very good, he doesn't know how to caucus, he doesn't really have many friends there and he doesn't bring home the bacon, as it were, you know? Sure. You know, you gotta kind of pork barrel, spend and do all these things, and he's not really up to snuff. So he runs in a reelection, he runs",
            "start": 132.08
        },
        {
            "text": "doesn't bring home the bacon, as it were, you know? Sure. You know, you gotta kind of pork barrel, spend and do all these things, and he's not really up to snuff. So he runs in a reelection, he runs for reelection and the guy that he ran against beats him and he's removed, he's a one-time Congressman. He comes back to Texas and people are calling him a carpetbagger and he's really upset and he didn't really do it. In the 70s? Like the 1970s? The 1970s. Okay. Yeah. Carpetbagging is not a term thrown around as much anymore. No, I mean carpetbagging still happens. Hillary Clinton was a carpetbagger. He goes out back into his office and he's smoking a cigarette. Sure. Okay. He sees one of those silver garbage pails, you don't see those much anymore, you know what I'm talking about? Like the silver garbage pail? Got the silver top? Yeah, the silver top. Yeah, you love those. He picks it up, the silver top, and he kind of just looks at it. I see what's happening. And he's like, you know, no",
            "start": 171.6
        },
        {
            "text": "garbage pail? Got the silver top? Yeah, the silver top. Yeah, you love those. He picks it up, the silver top, and he kind of just looks at it. I see what's happening. And he's like, you know, no one believes in me, no one trusts me, and he just hurls it like this, right? He just throws it. And it ends up, just kind of, it bounces against the brick of the alley and kind of chips away it and he realizes, I have enormous strength and also great accuracy at throwing this. Oh my god, he missed his calling. And he's like, this is strange. So there's another garbage pail next to me, he does it again, and he throws it and it does great damage to the building next to him. Right. And so he wonders, he's like, what can I, you know, and I don't want to kind of spoil all of this story because I want people to go out and read the comics. Sure. But he basically is like, how can I advocate and be a patriot? Because I'm a great patriot. I'm not exceptionally talented as a lawyer, kind of washed out of",
            "start": 211.24
        },
        {
            "text": "to go out and read the comics. Sure. But he basically is like, how can I advocate and be a patriot? Because I'm a great patriot. I'm not exceptionally talented as a lawyer, kind of washed out of Congress, but I can carry around this, maybe, you know, this garbage pail top. And maybe advocate for the American people. In the Olympics, throwing the discus. He thinks about that, but then he, no, but then it's a watch out too. He can't fail at a lot of things. No, no, no, no. Gotcha. And he's like, I'm going to have to go back to some of his buddies and they're like, that's a great idea, but you look like a homeless person carrying around this thing, so why don't you paint, you should kind of paint it, put a star and things of this nature on it. Sure. And so I don't want to get too deep into it because Captain America's lore is really deep, but this is basically the origin, the specific origin of where Adam Adams is becoming Captain America. That's a detailed story. It's good, it's not",
            "start": 249.92
        },
        {
            "text": "it because Captain America's lore is really deep, but this is basically the origin, the specific origin of where Adam Adams is becoming Captain America. That's a detailed story. It's good, it's not correct of course. Captain America's Steve Rogers, he's the product of the super soldier program, a little runt kid who wanted to go fight in the war. They put him in it, they gave him the super soldier serum, he becomes Captain America, super fast, you know, run, do all this agile stuff, throw shields, do whatever he needs to do, goes out and fights for our country against Red Skull and the Nazis. Eventually Red Skull kicks him into the ocean, he freezes in a block of ice in one of the dumbest comic book origin stories that's ever happened but still continues to go. Gets thought out in present day, continues to be the super patriot you all need. I don't think so. Thanks for watching. Click here to watch Wonder Woman's Origin. Click here to watch Colin and Greg discuss Boy Meets World.",
            "start": 291.16
        },
        {
            "text": "day, continues to be the super patriot you all need. I don't think so. Thanks for watching. Click here to watch Wonder Woman's Origin. Click here to watch Colin and Greg discuss Boy Meets World. Click here to see the boys burn through $30 on the PlayStation Network.",
            "start": 328.24
        }
    ]
}