{
    "id": 1739,
    "video_id": "6aLAbzhTN3U",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Our Video Game Shame Lists - Kinda Funny Gamescast Ep. 69 (Pt. 3)",
    "description": "What games haven't we played that we should.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1462968000,
    "duration": 1233,
    "transcript_chunks": [
        {
            "text": "Kinda Funny Live 2 is happening May 28th and 29th it's a 2-day event the first day is going to be a completely ridiculous stage show what we have planned this year completely blows last year out of the water and I don't even know how that's possible cuz we were really stupid last year and this year's somehow even stupider day two it's going to be full day of meet and greets we're hanging out with all of us a bunch of Rooster Teeth people are there Funhaus people are there Achievement Hunter it's going to be a grand old time there's going to be some games to play there's going to be signings it's it's exciting it's a really fun time there's going to be exclusive merch oh yeah there's definitely going to be exclusive merch go to kinda.com/tix to get your tickets today there's a couple VIP tickets still available so make sure if you want one of those you act fast topic three comes from Yasir Madhour from Patreon he says Your Video Game Shame List all console generations great",
            "start": 0.04
        },
        {
            "text": "VIP tickets still available, so make sure if you want one of those, you act fast. Topic three comes from Yasir Madhour from Patreon: \"Your video game shameless all console generations great slous games you've never played but you know you should have...and now given your involvement in the industry, oh what and the opposite games you wish you had never played - those are two very different things. So I think he stick with the sham list yeah yeah yeah stick with the sham list so what is there? What games haven't you played? I like the console generation thing okay where do you want to start? I don't want to start on NES because we don't need the stuff before that unless you think we do Colin. I mean, I think there must play games in that period but I think that there well no there are...you know Miss Pac-Man. I think you played Miss Pac-Man, you're a fool um you know Galaga Space Invaders um but I but they're so old now that I don't know that you know you necessarily you know digdug and",
            "start": 33.84
        },
        {
            "text": "know Miss Pac-Man I think you played Miss Pac-Man you're a fool um you know Galaga, Space Invaders um but I but they're so old now that I don't know that you know you necessarily you know Dig Dug and Q*bert and stuff I mean these are foundational games right very important games um that you should absolutely play I mean you have you really have some homework to do if you've not played those class of games but I do agree with you that I think things start on the NES what are we counting by played beat tried dip your toe in the water where we at I mean I think that he's talking about he's talking about beat but I think that if we tried to play it I think that if we gave it the shot it counts okay okay okay because we we tried never like you know if we're starting with NES that era of course then I think the original Legend of Zelda but I've played it I've never beaten it I've never gone all the way through it but I've played it I've run around the overworld map and done stuff and yeah I don't",
            "start": 84.72
        },
        {
            "text": "I think the original Legend of Zelda, but I've played it. I've never beaten it; I've never gone through it, but I've played it. I've run around the overworld map and done stuff, and yeah, I don't think you need to beat that game if you give it at least a shot to understand sure exactly how it plays and stuff. The funny thing is, I don't know that there's anything in that era that I didn't play on the NES, that matters. The Master System is a different story; anything well, there's some games like Alex Kid, like I and again, I've played these games, but I just remember them as the Alex Kid and what Miracle Warrior is. What Wonder Boy is, that's the same Wonder... um, they were kind of like Sega Master System games and Genesis games because another one just came out recently, Wonder Boy or you're right; there's a whole bunch of Genesis games I didn't play, but that's yeah, Genesis is other stuff, right? Me, again, I said this a long time ago, I didn't even know what MM was.",
            "start": 122.88
        },
        {
            "text": "Wonder Boy or you're right there's a whole bunch of Genesis games I didn't play but that's yeah Genesis is other **** right me yeah Master System again I said this a long time ago I didn't even know it was a thing until later so it's like I missed out on all of those don't worry unless there was ports and stuff on other systems that I might have just played um but in terms of being a Sega kid there's tons I I mean I'm so much NES stuff and SNES stuff like I those are huge holes in my in my you know repertoire MH so I mean that's the thing is like I you know I've played Super Mario obviously but have I beaten Super Mario Brothers I don't know probably not I can't I don't know where I would have done that oh man sat down and then the original Super Mario Brothers got yeah I mean beating a game is a different story if the story is beating a game then I never play and then I never beat even a lot of Nintendo kind of stuff like like uh the Star Fox games none of them like the yeah like no like",
            "start": 165.52
        },
        {
            "text": "a different story if the story is beating a game then I never play and then I never beat even a lot of Nintendo kind of stuff like like uh the Star Fox games none of them like the yeah like no like not even 64 I think Adventure is the only one I beat you you beat Adventure yeah um like uh like a lot of Donkey Kong games like Donkey Kong Country one I think I beat and I don't think I beat no I don't think I beat my God these were like rentals you know like I I wasn't really in the platforms at that point so it was like really like SNS to me was talking about this on our AMA recently like if you're talking about beating games and I guess that's what he's talking about then like there's a lot of games that I didn't beat there are a lot of games I did there are **** **** ton of games I beat I never beat Metroid but I played it enough the original Metroid it's a fantastic game **** hard as hell that game is really hard yeah I just I couldn't and Mega Man none of them yeah I mean",
            "start": 204.92
        },
        {
            "text": "I beat I never beat Metroid, but I played it enough. The original Metroid is a fantastic game - hard as hell, that game is really hard. Yeah, I just... I couldn't and Mega Man none of them. Yeah, I mean those are... I mean to me on NES for instance the must-play games are like the three Mario games, uh six Mega Man games, three Castlevania games, three ninja gaiden games - the Dragon Warrior games all four of those I never beat any. I never beat Dragon Warrior, never beat uh Ninja Gaiden... see I'll go far. I don't think I've ever played a ninja gaiden game. Oh my God, those games are **** awesome. Saw it obviously, but like that was always something you saw to before you put in Mario - they're impossibly hard, but but I mean they're not impossibly... they're ridiculous. Um and then you have DuckTales, like a lot of the Capcom game CH andil all the first party stuff going all the way to like StarTropics and stuff like that. Yeah um but there even like later games like Yoshi's Island - I don't even",
            "start": 246.96
        },
        {
            "text": "a lot of the Capcom game CH and I'd play all the first-party stuff going all the way to like Star Fox and stuff like that, yeah. Um, but there were even later games like Yoshi's Cookie - I don't even know what the **** that game was, though. But, but **** it, that was like so late. I mean, I had an SNES for like three years when it came out; I don't even know what that was dumb. This game, but yeah, I mean, like if we're talking about beating games, there's a **** ton of games I didn't beat because, like, you're a kid, yeah, and like you just want to move on. And I, to me, it was like, so for every Ocarina of Time or Majora's Mask that I obviously beat the **** out of, I mean there were games on N64 I'd just **** around with and never beat. I wasn't really even into the N64 that much, so it was um I was so into role-playing games in the 90s that that I beat a lot of those kinds of games, even the really obscure like Quintet stuff and that on SNES or U and then",
            "start": 282.84
        },
        {
            "text": "Our Video Game Shame Lists - Kinda Funny Gamescast Ep. 69 (Pt. 3) \nso it was it was um I was so into role playing games in the 90s that that I beat a lot of those kinds of games even the really obscure like Quintet's ActRaiser and stuff like that on SNES or U, and then on PS1 I mean there's I had so many games on the PS1 that were and I think if you looked at my catalog games and they're somewhere in my mom's house I think you'd see like 90 I probably have like 50 plus PS1 games and you would see 40 of them are RPGs probably and then I have like the occasional like Metal Gear Solid or um Tenchu or something like that or Bidoof Blade but yeah I wish I that's I wish I connected with RPGs earlier I especially JRPGs or whatever just in the fact of like Final Fantasy, I have no lineage with right just because it never looked interesting when I try seven even people tell me how great it was just never worked for me never clicked for me and I wish I cared more about I cared period about that it was a value proposition I I understood again I don't agree with that value",
            "start": 316.12
        },
        {
            "text": "me how great it was just never worked for me never clicked for me and I wish I cared more about I cared period about that it was a value proposition I I understood again I don't agree with that value proposition anymore now that I have money but when you're a kid and you are scrapping together by games and stuff like that it's like well I gravitated towards that like this game takes forever to beat awesome and it is it's as long as you like it like now there are too many jrpgs I mean I remember SaGa Frontier being like one of the worst games I'd ever played beyond the Beyond which was a we had a copy of that from the podcast on PS1 is a terrible game you know like terrible I remember buying I was I bought that in 1997 I was in seventh or eighth grade and it was like the third or fourth PS1 game I'd ever bought I had Final Fantasy VII Castlevania and I think um I guess I had a few more of that point like proof of the RPG I had like Tomb Raider or something",
            "start": 356.72
        },
        {
            "text": "was like the third or fourth PS1 game I'd ever bought I had Final Fantasy VII, Castlevania, and I think um I guess I had a few more of that point like proof of the fact I had like Tom or something like that but um I remember buying that game this game sucks and that was like one of my one of my first like kind of letdowns where I'm like I bought this game used too so I couldn't return it I still have it yeah um so it doesn't always work out that way you don't always want to spend time but when you have time as a kid you I didn't have a job yet I was in seventh or eighth grade all I did was play hockey and go to school and and you had a lot of time so I think I connected with JRPGs because they're great but I also think I connected with them because you know you can beat um these Platformers in five six seven hours some of these Platformers especially the S64 PS1 era were really short yeah um and those were rentals you know to me yeah the Final Fantasy thing is funny to me because",
            "start": 396.64
        },
        {
            "text": "in five six seven hours some of these platformers especially the PS1 era were really short yeah um and those were rentals you know to me yeah the Final Fantasy thing is funny to me because there's so i've played i think all of them um at least a couple hours but i never beat any of the ones before six i got really far in four but i never finished it i just got lost i stopped playing and then i got was really good too never really played too much of five um and then one and two were so early that like they're different the port on PS1 was a little weird but not as bad as Chrono Trigger's port which was awful um oh no but Final Fantasy Origins it was one and two anthology i think was Chrono Trigger in four and then five and six was anthology what you say the other one was origins anthology and chronicles i think was the other one chronicles",
            "start": 429.48
        },
        {
            "text": "Chrono Trigger no Chrono Trigger in four and then five and six was Anthology what what you say the other one was Origins Anthology and and Chronicles I think was the other one Chronicles that's right yeah I think Chronicles was four and Chrono Trigger I think Anthology was five and six and then Origins was one and two and Origins came out late Origins was like out 2003 that was the last PS1 game I bought um so yeah to me it was like uh those games were really special but when I think about actually like where my huge blind spot is it's not even really so much in console gaming I mean I have massive blind spots in Genesis um I have massive blind spots in Xbox and Xbox 360 and Xbox One do you play the Fantasy Star Games Yes um but not all the way through I never so the original Fantasy Star is a Master System game and I think I played a ROM of that like a long time ago and I think they ported it to PS3 maybe on the Sega Genesis Classics collection but I don't know about that for sure two I played",
            "start": 474.36
        },
        {
            "text": "Is a Master System game and I think I played a ROM of that like a long time ago and I think they ported it to PS3 maybe on the Genesis collection but I don't know about that for sure two I played um when I was a kid and then I played it on Wii um and then three and four Four is really considered like the epitome of those games and and they all they all kind of blur together than me they're not they're not as memorable as um as the Final Fantasy games but I did play those games cuz I knew knew a kid when I was young who had a Genesis his family had a Genesis an NES and an NES and a Master System and uh and um so my exposure to a lot of early Genesis stuff I remember being like what is Fantasy Star because we we I didn't have any exposure to even the marketing or the the previewing cycle of I was so up in Nintendo's ass when I was a kid that like I didn't really know what the hell that even was and so I remember playing that and like you know Streets of Rage and Golden Axe and all these",
            "start": 515.12
        },
        {
            "text": "I was so up in Nintendo's ass when I was a kid that like I didn't really know what the hell that even was and so I remember playing that and like you know Streets of Rage and Golden Axe and all these games and I'm like wow, Genesis is pretty cool. And I remember I think I told the story about how when I was in sixth grade I had my friend Jason who was several years older than me, he was in my neighborhood, we played hockey together so he was like a buddy of mine, he was in ninth grade I think at the time, he and we I traded my SNES to him for his Genesis, then my mom got really mad and made me trade it back. And it was a great move because I wanted to play Shinobi or something like that, oh God. And um, it was like so I was like I'm so tired of this **** machine like I just want like it was my mom, my mom would save me. But I think with PC is where like there are if you name almost any PC game I never played it like with the exception like I have some I have a soft spot for some random PC",
            "start": 554.28
        },
        {
            "text": "my momally save me um but I think with PC is where like there are if you name almost any PC game I never played it like with the exception like I have some I have a soft spot for some random PC games like we've talked about Chip's Challenge and we've talked about um you know some of the Star Wars games like TIE Fighter and X-Wing like I like those games Dark Forces story or whatever **it was Yoda's story** and and like a lot of Star Wars related stuff I played um like Doom and stuff like that I played but there were there are so many like I have no lineage with Half-Life I have no lineage with like with Starcraft or yeah like Monkey Island any of the adventure games I don't play like I you know brought games to PO all the time and he brought me Full Throttle once on PC and we played through that and that was awesome but at the time I had no idea that like this was a huge genre Tim Schafer all this other stuff like no idea Day of the Tentacle no **idea any of that stuff**",
            "start": 591.2
        },
        {
            "text": "that and that was awesome but at the time I had no idea that like this was a huge genre Tim Schafer all this other stuff like no idea Day of the Tentacle no **** idea any of that stuff's happening but the problem is the trouble with this kind of question is is like yeah like I had I had watched and or played most of these games on Console at some point like just dabbled with them and messed with them I don't think you have to have beaten a game to have experienced it necessarily um but when it comes to like with like you know Genesis stuff like that's a blind spot per se but it really wasn't I had a Genesis later on and I went back I mean I told you guys how I even found like a new copy of Castlevania Bloodlines when I was in high school MH and like which is 10 years after the game came out almost in to Toys R Us I was like what the **** like this is I remember being awesome I remember there was like 10 of them I want to buy them all um but with PC like I just don't even",
            "start": 634.68
        },
        {
            "text": "Our video game shame lists - Kinda Funny Gamescast Ep. 69 (Pt. 3). I remember being awesome, I remember there was like 10 of them, I want to buy them all um but with PC like I just don't even know sure like that's the thing where it's like I don't even care that's that's the other thing it's like I don't like I just don't there's like I want to go back and play there's some games that like I have never experienced, we were talking about the DNA of games and how I think Miss Pac-Man is so fundamental to play Pong is a fundamental game you should play um just to understand like really the embryonic state of games understand video ball better and and you know obviously like Galaga and and Dig Dug and all those kinds of games but um Zork is actually one of those games that like I actually really want to go play because that is a seminal text Adventure that is kind of the foundation for adventure games today and maybe even in a sense role playing games it's very similar to how like",
            "start": 670.16
        },
        {
            "text": "really want to go play because that is a seminal text Adventure game that is kind of the foundation for adventure games today and maybe even in a sense role playing games it's very similar to how like these Mainframe space war games in the 70s are actually like kind of the prototypes for a lot of the games we play to get in some way it's like Dungeons & Dragons there would be no role playing games on Console without D&D it's a similar kind of thing and that that's like a huge blind spot where that game's actually supposed to be really good um but even when I was in high school and I was taking computer programming and I would do nothing but play games on my computer because I and then I would just copy someone else's work um like one kid did all the work for everyone in that class it was the funniest thing I'd ever seen in my life and people were just on the Internet or like **** around on their computers and I remember this kid brought in like um Police Quest and King's Quest and like some other",
            "start": 708.36
        },
        {
            "text": "I'd ever seen in my life and people were just on the Internet or like messing around on their computers. I remember this kid bought in like Police Quest and King's Quest, and some other adventure games where you had to very specifically type in commands like \"Go Walk Right\" and open a locker, and all that. And I remember we used to play game facts, and that was like my first exposure to even those kinds of games at all. But man, there are a lot of PC games that I just don't even know about nonetheless. Like, um, like I know you know even Kid Chameleon on Genesis - I remember that game. I don't know if I've ever played it, but I think I might have. That was like a seminal, burned-in-memory experience. I got that for my birthday on the Genesis from my folks the day before I went to school, came back from school with a bunch of kids and we all played it there, then we went to Leaps and Bounds for the birthday party or whatever.",
            "start": 740.84
        },
        {
            "text": "the day like the morning before i went to school came back from school with a bunch of kids we all played it there and then we went to Leaps and Bounds for the birthday party or whatever like **** that's a day right there that was just an example to me of a game like where like I I know it I think I played it but at least I'm aware of it like someone could walk up to me and be like there's a 100 here's 100 PC games out of the best PC games I'm like I probably never even heard of half of these games and then I probably didn't play 40 of the other 50 on that list Razer is one I want to there Mitch always talks about like this game game sounds awesome and I've never even touched it never Mitch was Mitch was the first person I'd ever met that had the love equivalent to M.A.A.R.S. cuz that's not a game that's a quintessential Tech game it's a weird **** game too I I don't get it and I don't like that game is so so that Razer is like one of the most unique games ever made to S to fuse God",
            "start": 779.72
        },
        {
            "text": "not a game that's a quint Tech game it's a weird **** game too I I don't get it and I don't like that game is so so that ActRaiser is like one of the most unique games ever made to S to fuse God like God simulator with side scroller is like really brilliant um and it's fun and there's a way to perfect like get a perfect game in it too if you're like really patient um that's a must I think that's a must ActRaiser is awesome awesome awesome awesome game I'm still just shocked that you you haven't beat a Star Fox or Donkey Kong Country too I would love to do something where sitting with you specifically with Donkey Kong Country 2 because that game the it the design is just so next level it's so good for for a platformer and it's not in the The Challenge way of Mega Man it's just more in the sense of it really to me defined the idea of exploration and the the way that they use the the bananas and stuff to lead you to Secret or to make you think and learn how the game's design Works to tell",
            "start": 816.2
        },
        {
            "text": "of it really to me defined the idea of exploration and the way that they use the bananas and stuff to lead you to secret or to make you think and learn how the game's design works to tell you where to find secrets, it's awesome, it reminds me a Super Metroid or Super Mario Bros in the way like I learned something from playing that game um and also Yoshi's Island I would love to actually see I would love Super World 2 oh that game sucks I hate I I hate that Game & Wario game I remember I remember a lot of people do love that game like I remember Greg had a real affinity for that game too one of my favorite games of all time and I was like I remember renting it I think I rented it I don't think I ever owned it and I was like what like I I I was so excited like why is this so different and weird I don't want this this isn't what I want Mario World again yeah I was like I just want Mario World with eight new worlds that's all I wanted wait so long for that Game & Wario um yeah so I I",
            "start": 858.36
        },
        {
            "text": "and weird I don't want this this isn't what I want Super Mario World again yeah I was like I just want Super Mario World with eight new worlds that's all I wanted wait so long for that **** um yeah so I I don't know yeah so yeah Star Fox like I played them um I don't remember ever beating them though and I I think there's probably when I really when I really sit down and think about it there's probably a lot of games like that for everybody there's there's only but I don't know like I don't like consequential games I just don't know I was I was playing a lot of random **** on the N64 though 6 Star Fox 64 is the only Star Fox you have to beat like the rest of them like the Super Nintendo one it's fine if you play it you get what it is and all the rest of them are definitely like only if you like 64 you'll find things you kind of like about I don't think I ever played a Star Fox game after Adventure which Dinosaur Planet became Adventure right so yeah that was Star Wars",
            "start": 905.96
        },
        {
            "text": "64 You'll find things you kind of like about. I don't think I ever played a Star Fox game after Adventure, which became Dinosaur Planet, right? So, yeah, that was Star Fox Assault, which was the GameCube one, which was 20% awesome and 80% garbage. I didn't play that one; I didn't play any of the DS or GBA ones or any of that kind of stuff. Once I just remember buying that just because I used a jar of coins I had saved and went to Coin Star dump them all in, and then I bought Star Fox Adventures. What's up, Greg? Um, yeah, my biggest blind spot is definitely I've said this before, but last generation, like the PS3 Xbox 360 generation, I just didn't play too much. I beat a bunch of the games, but yeah, like the Arkham games never were my thing. I tried playing Arkham Asylum, and it just didn't grab me. Um, you getting your second chance soon with that HD Collection? Yeah, we'll see. Bioshock, yeah, Bioshock one; um, again though, never.",
            "start": 944.56
        },
        {
            "text": "playing Arkham Asylum and it just didn't grab me um you getting your second chance soon with that HD Collection yeah we'll see Bioshock yeah Bioshock I love Bioshock one um again though never beat it like I got really far kind of **** up probably 80% through and then I just stopped walked away and did other things not that it's not amazing cuz that game I would put up there as like a holy **** this game's incredible that's that's on the level that game's on the level for sure yeah um and then yeah the Mass Effect series I never got into yeah it's fascinating cuz like you know last generation would be my most comprehensive knowledge based probably but I think it's because of where you guys were professionally and I think it's because of where I was professionally at that time like that was when I was in college that's when I was like working **** my ass off for you know and I it really was I don't have time to do this because it's either play games or you know make videos and I had",
            "start": 985.6
        },
        {
            "text": "when I was in college, that's when I was like working my ass off for you know, and I, it really was, I don't have time to do this because it's either play games or you know make videos, and I had to make the videos, yeah, I mean I feel the same way about, I've thought about in the past, like GameCube PS2 uh Xbox error was probably my least comprehensive except for GameCube for some reason, I just went out of my way to like just play GameCube all the time except for that one year why I wasn't really playing games you loved it cuz it had a handle but PS2 I was like I was PS2 I kind of got over pretty quickly, like I I I had got it when it launched in October 2000 and by 2003 or so I wasn't really even playing it anymore dude that was a lifeblood but so like that was probably my gen and I had an Xbox but I just played like five games on it over and over again, the so did everybody uh so it was it was yeah Conker's Bad Fur Day and Halo and Rainbow Six and all that kind of stuff, so um yeah so I feel",
            "start": 1026.56
        },
        {
            "text": "an Xbox but I just played like five games on it over and over again, the so did everybody uh so it was it was yeah Conker's Bad Fur Day and Halo and Tom Clancy's Rainbow Six and all that kind of stuff so um yeah so I feel that way about I can sympathize with you because that's when I was in college and it was just I just had other priorities but the GameCube I made time for, good um as you should have and again I don't know we got to talk about the GameCube sometime CU I I just I just call it I'd love to you twisted his arm I don't really know what like what I was thinking that that like I probably should have came around a little bit earlier GameCube had great games, it was a great library of games but I was like my Stockholm syndrome was at an all-time high during the GameCube era like you wouldn't even known me then you know I knew you during the Wii era so I feel like I kind of knew you during the GameCube era oh my God you want to play this PS3 game tonight no man I'm waiting for a Wii Port wait",
            "start": 1062.0
        },
        {
            "text": "me then you know I knew you during the Wii era so I feel like I kind of knew you during the GameCube era oh my God you want to play this PS3 game tonight no man I'm playing waiting for a Wii Port wait for the Wii Port I'm going to go play Call of Duty on Wii tonight the **** wrong with you Colin I wanted to believe so speaking of blind spots in video games and stuff we're talking about PC games we don't play many PC games at all lot of people out there do play PC games today we're sponsored by Total War: Warhammer totally outside our wheelhouse but did some research seems like it's getting good reviews people like it so if it's your thing hey this topic's for you sponsored by Total War: Warhammer what is Total War: Warhammer it's a fantasy strategy game of legendary proportions Total War: Warhammer combines an addictive turn-based campaign of conquest and empire building with explosive colossal real-time battles all set in the vivid and incredible world of Warhammer",
            "start": 1099.08
        },
        {
            "text": "Total War: Warhammer combines an addictive turn-based campaign of conquest and Empire building with explosive, real-time battles all set in the vivid and incredible world of Warhammer fantasy. Battles you guys ever do Warhammer at all? I saw them; Anthony G used to do Warhammer. He used to tell me funny stories about Warhammer, like he would be in the garage painting his figures or whatever, and then like someone would open the garage door and he'd like scramble and hide all this stuff because he didn't know who was coming in. So it's the perfect match for Warhammer; it's a marriage made in gaming heaven. Warhammer is a rich high-fantasy world with perpetual war and massive battles, and Total War is a critically acclaimed epic-scale conquest-based strategy game. So when you put them together, that equals a gorgeous high-fantasy world with perpetual war and conquest on a colossal scale brought to life in hours and hours of gripping strategy gameplay; it's Epic Fantasy Total War style. No one's done this before.",
            "start": 1141.0
        },
        {
            "text": "equals a gorgeous High Fantasy world Perpetual war and Conquest on a colossal scale brought to life in hours and hours of gripping strategy gameplay it's Epic Fantasy Total War Style no one's done Warhammer or indeed fantasy like this before from the personal skills of your characters to 20,000 roaring Orcs no how how does that make you feel Kevin you like them 20,000 roaring Orcs yeah oh yeah yeah why do you think he likes Orcs I don't know just you know the look as a f Mexico it is unmatched if you're a PC Gamer and not involved you're missing out factions that are all feel and play very differently each race is wholly different from their own unique characters campaign mechanics battlef units and play style so if you want more release date May 24th 2016 platform pc/ steam there you go",
            "start": 1182.08
        }
    ]
}