{
    "id": 1745,
    "video_id": "6fJDfM9r9v8",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Casting The Uncharted Movie - The GameOverGreggy Show Ep. 128 (Pt. 1)",
    "description": "Nick Scarpino wants to know who we would cast in the Uncharted movie franchise.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1463382001,
    "duration": 2583,
    "transcript_chunks": [
        {
            "text": "Kinda Funny Live 2 is happening May 28th and 29th, it's a 2-day event. The first day is going to be a completely ridiculous stage show but we have planned this year completely blows last year out of the water and I don't even know how that's possible cuz we were really stupid last year and this year's somehow even stupider. Day two it's going to be full day of meet and greets, we're hanging out with all of us, a bunch of Rooster Teeth people are there, Funhaus people are there, Achievement Hunter, it's going to be a grand old time, there's going to be some games to play, there's going to be signings, it's it's exciting, it's a really fun time, there's going to be exclusive merch. Oh yeah, this is definitely going to be exclusive merch. Go to KindaFunny.com/tix to get your tickets today, there's a couple VIP tickets still available so make sure if you want one of those you act fast. What's up everybody? Welcome to the GameOverGreggy Show I'm one of your hosts Greg Miller alongside the",
            "start": 0.04
        },
        {
            "text": "\"Couple VIP tickets still available so make sure if you want one of those, you act fast. What's up everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside producer Nick Scarpino. Hi, ballpark - how many Heather Gray shirts are in your closet? Five, really? At least, yeah, I agree at least it depends. I have some charcoal gray shirts that count as heather, you know they're not traditional heathering, yeah. My wife, it's kind of an inside joke to my wife cuz she likes it as well so half of our closet is Heather Gray but we have to separate them otherwise I might mix one up and wear her shirts and she's significantly smaller than me it would be but it would look good cuz you have the ice cream Scoops I'm always talking about there they are oh look at them go there over there, The Pure One Tim Gettys some Rocky Road I like Rocky Road oh wow okay okay I'll take that I was thinking Pringles and cream rounding out the group of course the pride of Long Island Colore\"",
            "start": 33.8
        },
        {
            "text": "Over there, the Pure One Tim Gettys, some Rocky Road. I like Rocky Road. Oh wow, okay, okay, I'll take that. I was thinking Pringles and cream. Rounding out the group, of course, the Pride of Long Island, Corey. It's good to be here today. Uh, before we go, I'm going to make someone's day as I often do. Uh, oh, uh, someone reached out to our Facebook group and I go through those messages and I usually just read them and then don't respond but what I did this time was uh no, I respond a lot of people say \"compliment\" you know, complimentary things, I always respond to those, but some people are just like asking, you know, I got time for everything. No, but one young woman, named Sarah Carpenter wrote us a message and she said she had a boyfriend who's turning 21 years old, his name is Prince Barutzki. Now, you realize, a real Prince. Now this was the thing I was like there's some joke here because this man certainly doesn't have that name, so I went to her Facebook page and then I went to pictures of her, she had",
            "start": 88.28
        },
        {
            "text": "Prince now, this was the thing I was like there's some joke here because this man, certainly not Prince Brutskiy so I went to her Facebook page and then I went to pictures of her; she had a picture of her with a man, I clicked on it tagged Prince Brutskiy. That was good enough for me. So happy 21st birthday, Prince Brutskiy from your girlfriend Sarah Carpenter. Do you think she's related to John Carpenter? No, probably not the band The Carpenters; no, definitely not my boss, the Jewish Carpenter. Uh, everyone's related to him somewhere. Do you think that he's related to Prince at all, the musician? That was really the time; that was really a timely name, but this of course is not the surname so uh nonetheless I don't always do this, a lot of people making a lot of requests, a lot of outlandish requests never do this, a lot of outlandish requests. This is the first time I ever remember you actually doing this, but for Prince Brutskiy it's a historic day from Sarah Carpenter Colin descending from 2",
            "start": 131.4
        },
        {
            "text": "never do this a lot of outlandish requests this is the first time i ever remember you actually doing this but for prince brutus it's a historic day from sarah carpenter colin descending from 2 ivory towers to grace the people with his presence and wish them a happy like your shirt by the way colin thanks i don't know what the hell is it what is this oh is it get your **** together you got for a reason i do play it play it son i visited the uh axe and verge booth it was who was what were the two games there or three games there kasm was there and ax and we said we said what's up to tom and uh i noticed they had some other cool shirts and i don't i mean i've been i'm kind of the og supporter but these two guys there was three shirts i already owned one of them and these guys bought the other two are you being serious as you know we have yeah i'm not being serious but as you know we have a we have a problem here with a shirt redundancy issue is that tim kevin and i all own the exact",
            "start": 171.24
        },
        {
            "text": "other two are you being serious as you know we have yeah I'm not being serious but as you know we have a we have a problem here with a shirt redundancy issue is that Tim Gettys and I all own the exact like five shirts so not true well Kevin has a producer shirt don't you so do I you two have the Aerobics shirt I have three other shirts that you have so we all have to just kind of time it it's a filthy casual when we get to events where we have to text each other and ask what's everybody wearing right so I just I wanted to then it's a 50/50 if Kevin going to wear that shirt to annoy you right well it's he doesn't see text his phone doesn't work the way Android phone does not work the way it's supposed to true if you didn't know ladies and gentlemen this is The GameOverGreggy Show each and every week four sometimes five best friends gather on this table he bring a random topic of discussion for your I want to slap it a little slower today oh you're slow slap slow slap sometimes you got",
            "start": 211.2
        },
        {
            "text": "every week four sometimes five best friends gather on this table he brings a random topic of discussion for your i want to slap it a little slower today oh youre slow slap slow slap sometimes you got to slow slap it so you can slow slide it in watch what the **** Nick oh that was thats if you like that head over to Patreon where you get each and every show early by tossing us a couple bucks along with exclusive perks and goodies oh yeah the goodies if you dont want to toss this any bus you can head to youtube.com/ kindafunny we post the entire show topic by topic day by day until its one big video on MP3 released the following Friday for your amusement you used to say that then you stopped saying it we dont care if people are amused anymore col took im not sure i ever cared here but heres the thing about it they nonetheless are its true you know its true we all have our role to play in this stage play of life you know what i mean yeah yeah Kevin do me a",
            "start": 249.68
        },
        {
            "text": "\"I cared here, but here's the thing about it. They nonetheless are it's true, you know it's true. We all have our role to play in this stage play of life, you know what I mean? Yeah, yeah. Kevin, do me a huge favor - can you get me a piece of paper and a pen? Or you can rip one out of your book and use that. You're just going to mail it to him, aren't you? Just give him mail. I'm doing something a little different moving forward. Uh-oh, Greg, cut the premiere for me today, would you? I did it. You guys are treating this like it's rocket science - really? We've never done that before. We always told you it's very easy; we always begged you for help. I'm already doing left, right, up, and down kind of things on there. I'm...I'm cutting...videos that you wouldn't believe. And by that, I mean I'm literally just using the razor blade tool and cutting things. I'm cutting videos you wouldn't believe. Can you hand me a pen, Kevin? I need it back. He still has it. Can I can I just get a marker or something - just anything?\"",
            "start": 297.84
        },
        {
            "text": "using the razor blade tool and cutting things i'm cutting videos you wouldn't believe can you hand me a pen Kevin I need it back he still can i can i just get a marker or something just anything any writing implement will do you saw that back you like that it's a circus today the you like those gold tending reflexes that was amazing now what I want to do moving forward cuz I went on Colin and Greg live today that Nick hosted with me yeah just give him back his toy this is gonna go all show that's fine it's right there go get it uh is i cut out two funny clips from the show today one show one clip about the whole Pokémon thing with the owl which is pretty funny that's awesome and then the second clip was telling Kevin you can't smoke cigarettes yeah because which you shouldn't Kevin now that would have been way easier for me I had to go into my mind's eye my mind's eyes is memory so my mind's ey memory and figure out where those were and now i'm just going to write down time stamps",
            "start": 341.64
        },
        {
            "text": "that would have been way easier for me I had to go into my mind's eye, my mind's eye is memory so my mind's eye memory and figure out where those were and now I'm just going to write down time stamps when something that humors me happens okay I like that and then I can just go into the raw clip and use the razor blade tool and the plus and minus buttons and some other things that I do and then I hit the export button and bl vaa I just have a video there's no bumpers on it there's no name things on it no lower thirds no chirons maybe ever but I'm telling you right now you're taking kind another future I love this idea I love I would just ask that we put some notification to the audience of what the show is and when they might be able to see the full version of it no no context that those are my rules he's going to post this on a Facebook he's making up he already made up the name it's Prince Bohot he's making Sarah Carpenter okay you want to use this one no we already have the Paper",
            "start": 390.0
        },
        {
            "text": "my rules he's going to post this on Facebook he's making up he already made up the name it's Prince Bohemian Sarah Carpenter okay you want to use this one no we already have the paper we're already set to go thank you Kevin I love that your everything you do is now from now on with his editing is going to be like like when Radiohead drops an album you don't know when it's going to come you don't know what it is you don't know how much it is you pay for it doesn't matter it's just there one day the dog literally thinks his toy is in the painting can you turn around to him and give it to him it's it's the gingerbread man stupid little the painting is going to fall on his head and kill him he's like \"give it to who\" dad Nick yes what's your topic so we did this uh for Metal Gear if you'll recall and there already is of course a movie in the works from most likely a reputable Studio probably Sony if I had to guess not really sure I didn't really bother to look",
            "start": 442.72
        },
        {
            "text": "for Metal Gear, if you'll recall and there already is, of course, a movie in the works from most likely a reputable studio, probably Sony, if I had to guess, not really sure, I didn't really bother to look it up. But because I have you gentlemen here today and because I'm such a huge fan as you know of the Uncharted series, I thought we would go through and cast the Uncharted movie for them so they don't have to worry about this anymore. Damn, this is going to be magical, ladies and gentlemen. I'm EXCited about this. I'm going to get out the old... my immediate thought: what are we making the Uncharted one, two, or three, four movie? Criteria we're making a fresh movie, and what we're going to need here. These are your notes for clipping things out; well, there's four sides of this piece of paper because I folded it in, in there's so many notes you're going to take, so many time codes, no two or three a show at the most. All right, let's... we're not that funny all right okay we're Kinda Funny uh so",
            "start": 484.4
        },
        {
            "text": "I folded it in there's so many notes you're going to take so many time codes no two or three a show at the most all right let's get we're not that funny all right okay we're Kinda Funny uh so we're going to need Drake well hold we have to I think we have to decide again where we're starting or what we're doing what is the scope of the movie I mean it's obviously making we're making the entire we're making a movie trilogy that doesn't necessarily mean it's based on Uncharted 1, 2, and three it's just a Trilogy of Uncharted movies all I'm saying is that there's there's a few characters you have very basic you're going to need them right so you need Drake you need Elena you need Sully I would say you also probably need Chloe yeah I say I would say you're even need Nathan Drake's friend Victor Sullivan, but more commonly referred to as Sully, and then what we have to so that's really the core cast now you might want to I don't",
            "start": 524.72
        },
        {
            "text": "Say you're even need Cutter if you need Cutter, I want Cutler for sure. I don't know if you need him so, and then what we have to do is so that's really the core cast now you might want to I don't want Sam in there hold on it's just awesome to see El no no hold on he couldn't spell Elena and then he just stopped at L e is it Elena? Elena, you nailed it. You nailed it. I thought it was Elaine how do you spell Elaine? E l a i n e almost had that okay Drake Elena Sully Chloe and Cutler that's good enough why you're not nobody's live streaming this Chloe how do you spell Chloe Nick c h o l e circus today and Cutler, okay uh and then we need to we need to identify the villain and that's the big problem Zarovich are but we're doing a whole trilogy we're doing the trilogy trilogy cuz if we're doing the trilogy then it's simple then yeah we're I say we we fold a lot of the elements of one into the story and it's Lavar Lazarovich Marlo and now the new guy N and thank you, I can't remember.",
            "start": 563.36
        },
        {
            "text": "doing the trilogy then it's simple then yeah we're I say we we fold a lot of the elements of one into the story and it's Lavar Lazarovich Marlo and now the new guy n and thank you I can't remember his name for a secondar Marlo what about uh what's Marlo's boy name oh Talbot Talbot oh Lord do we need him I say we replace him with Rafe all right so yeah oh okay and Rafe and I would I'm gonna say I'm gonna say get rid of uh what's her nut like doesn't serve a purpose in I think she does that's covered in our spoilercast and review but I'll allow it I will allow you to rid the world of Naen I I want Sam though Sam doesn't need to be there for the first movie but I do Cameo I I know I think Sam should be a character from two on I think that we should get more Sam which then makes him that makes sense more of a character okay okay I feel like he deserves it Sam now as usual I'm I'm just going to point out with what we're doing so far not a lot of diversity in the cast how do we get Steve",
            "start": 617.88
        },
        {
            "text": "Sense more of a character, okay, okay. I feel like he deserves it, Sam. Now, as usual, I'm just going to point out what we're doing so far - not a lot of diversity in the cast. How do we get Steve Harvey in this picture? I'll play the part; I'll play the part of the studio exec, okay? Thank you, as always. We need we need diversity, and the diversity cannot be just one guy, okay, okay. All right, wait - so these are all the names you need, okay? I have them, okay. I have all of these people: Sam Raimi, doesn't matter; horrible; don't matter; not even Sam and Nathan Drake, okay. Sam and Nathan Drake, okay. Nathan Drake, why do I have \"ra\" or \"rafy\"? I have that, okay. Rafi? Sam, who are these Marlon Lazrovich and guys, okay? Sam and Nathan Drake - yeah, cool, okay. Cool, those are the good guys, right? Sutter, Sam, Nathan Drake - these are quasi-good guys; might be bad, we don't know yet. So I like the idea of in the first movie, the majority of these characters are at least",
            "start": 668.52
        },
        {
            "text": "cool those are the good guys right Sutter Sam Young Drake these are quasi-good might be bad we don't know yet so I like the idea of in the first movie The majority of these characters are at least introduced at least as an idea that they're there I don't want none of this **** Spider-Man 3 Batman v Superman garbage where there's too much **** going on at once but I want well I think you need to start I think by the middle of the second movie everybody has to be introduced yeah but yeah but I think that there should at least be cameos and hints there should be like references to what's your what's your hint for Chloe a photo in his wallet huh no no no I don't know I don't know maybe like a phone call maybe some nice sexy voicemail or something Jesus maybe a little text message okay maybe a picture message now can I ask this question swim what ethnicity is Chloe can she be any ethnicity does any of these people can be any ethnicity yes I mean well I mean I'm just saying this",
            "start": 717.0
        },
        {
            "text": "Maybe a picture message now. Can I ask this question? What ethnicity is Chloe? Can she be any ethnicity? Does any of these people can be any ethnicity? Yes, I mean well, I mean I'm just saying this goes back to the well this goes back to the thing we were talking about with um what kind of agency we have over the characters. I mean I don't think it's a bad thing to say like these characters all exist sure so like I'm not so sure that you could mess around with that too much unless you're rebooting Uncharted super made Jimmy Olsson black nobody cared well, all I'm saying is that like it's you know hasn't been black we have a vision of who these characters are and I was going to say Chloe to me I'm not sure what Chloe is she's either like Australian I think Khloe's like Filipino or something or okay we could do that she that accent yeah, I mean she might be from the South but I mean I think she's like or like Latin in some sort of way I think it's Middle Eastern.",
            "start": 753.88
        },
        {
            "text": "or something or okay we could do that she that accent yeah I mean she might be from the South but I mean I think she's like or like Latin in some sort some way I think it's the Middle Eastern no just let him go type something going on I'm sure there's an answer she's PS3 graphics level ambiguous because I mean out of all of them Jesus Christ so okay it depends are we talking about cut scene or we talking about ingame or Jesus Christ I don't know Nick's searching no no no no no no Nick's like I need to find an image of Chloe from Uncharted he puts into Google Chloe Filipino cuz you guys were saying she might be Filipino put chlo F and then I realized I can't listen to you guys and type at the same time open up her Wikipedia here tell me a little bit about I mean there she's she's she let's see this B character is a fictional character in The Uncharted series introduced in 2009 Uncharted 2: Among Thieves Fraser were designed to provoke let's look at the character design no appearances",
            "start": 793.92
        },
        {
            "text": "see this character is a fictional character in The Uncharted series introduced in 2009, Uncharted 2: Among Thieves. Fraser were designed to provoke let's look at the character design no appearances maybe Noto, that's not true; the Persian I think it's like she looks to me like she could be Persian to some degree, she's definitely let's call it ethnic - is that safe to assume? Kevin now but everyone so I'm reaching out to an Uncharted expert; everyone else is actually white except Lazarevic is white too, he's just Russian or Eastern European in some way but everyone else is Western do we want to play around with the racist and even the genders? I'm fine with that well you gave Nen the boot so that's true because she has literally no purpose in the story; she's really good in the story I like her, lot uh Sul could easily be Steve Harvey and I it doesn't have to just be Steve Harvey I'm just a big Steve Harvey fan I was going to go if you I like the continuity that Steve Harvey is",
            "start": 840.32
        },
        {
            "text": "I like her lot uh Sol could easily be Steve Harvey and I it doesn't have to just be Steve Harvey I'm just a big Steve Harvey fan I was going to go if you I like the continuity that Steve Harvey is in everything we do Steve Harvey Cinematic Universe we're going put Steve Harvey down for this for as **** he can't be the bad guy I feel like he'd be a Dolph Lundgren but I mean he no he's too nice he's too nice but imagine with the cigar cuz he always smokes cigars and he's just like oh godamn Dorado he doesn't have we could have more fun with Sully though I feel like Sully deserves Sol is one of those like he deserves greatness not to say that Steve Harvey ain't greatness Steve Harvey could be a bad guy but we have to have another ethnic person on the other side to counterbalance him so if you wanted two people in there that were ethnic I would say are we allowed to say ethnic like this I'm think you're Peruvian is that okay saying we want to make we need we need a minority to weigh in",
            "start": 887.56
        },
        {
            "text": "you wanted two people in there that were ethnic I would say are we allowed to say ethnic like this I'm think you're Peruvian is that okay saying we want to make we need we need a minority to weigh in from my golden Tower we need a Minority Report yeah yeah it's fine it's fine I think it's okay right I don't implications I'm just making sure it's okay I think we can change Cutter's character I think he could be any race okay that's bad black Jimmy Olon from I mean C looks exactly like Jason Statham though look now look at Lazarevic oh man how the hell you just put Uncharted and then start trying to spell it and it'll come up who what like literally right the first there what's the other dude look the images didn't even change that's amazing straight Chloe and yeah I think he's key too he's a side nobody he's a side character that he's like a little flip-floppy going on it's pretty quick that he flops but he does yeah so he what does that count by that",
            "start": 926.56
        },
        {
            "text": "I think he's key too, he's a side nobody, he's a side character that he's like a little flip-floppy going on, it's pretty quick that he flops but he does yeah so he what does that count by that by that then we need Eddie Raja on here no Eddie Eddie Raj and we need Naro I don't know this give me that and I want and I also want that old man from Uncharted one we never remember the name of who serves some purpose but we don't remember he shot Sully this casting session is getting out of control I'm going to rain it back in go back to the leads okay so our leads are Sully Elena and Drake right for Sully could be white I see him as black for some reason Steve Harvey I want Steve Harvey's done it could be Steve Harvey but I see him more as Samuel L. Jackson That's God awful, naturally Samuel L. Jackson's amazing and he can totally do that he is amazing I love Samuels you know my friend from Comic Con talked to him twice my problem with it is just that he's",
            "start": 980.32
        },
        {
            "text": "God awful naturally Samuel L. Jackson's amazing and he can totally totally do that he is amazing I love Samuels you know my friend from Comic Con talked to him twice my problem with it is just that he's too intimidating Sully is like I mean think about Uncharted 4 right like Sully isn't intimidating like the glass gets slapped imagine SLJ saying a goddamn thing God I'm into that yeah I'm sold what about no Burt Reynolds that's good too you said happy go lucky there's nothing better than smoking the blunt that's true he was in The Cannonball Run for Christ sake what a bold 35 years ago he was in The Cannonball Run he can still move I feel like Sully would be a dope ass old Robert Downey Jr like we got to give it a lot of time but Robert Downey Jr has that kind of like he's the cool old guy we got to get this guys I think I think I think Steve Harvey I'm not even being funny should we want a black man to play I feel like Steve Harvey makes more sense than whatever we cast him in in Metal Gear Solid",
            "start": 1025.24
        },
        {
            "text": "this guys, i think steve harvey, i'm not even being funny, should we want a black man to play?  i feel like steve harvey makes more sense than whatever we cast him in in Metal Gear Solid, i don't even remember, i was thinking we cast him as like cyborg ninja or something like that, so cuz we're a bunch of idiots, all right let's move on to elena now, again here's emily rose can play elena, right, emily rose could play elena, we'll put her down, is this theop out?  oh exactly she's a real actress though like she is a real actress great and haven you know i love her and jericho as well but the problem is what are we trying, i think a lot of it comes down to drake too, are we trying to future proof for 10 years and and if so are we saying **** everybody we're making our move because then are we putting nolan on no see here's my thing i say we put a hard role that the voice actors can't be it or else that's the obvious answer i think that that's not that hollywood ain't doing that",
            "start": 1071.72
        },
        {
            "text": "Are we putting Nolan on? No, see here's my thing. I say we put an actor with a hard role that the voice actors can't be it or else that's the obvious answer. I think that that's not what Hollywood is doing; they just aren't doing it. But what about Emily Rose's name? It's no disrespect to no other guys. Emily Rose is a real actress who does real shows and movies, whereas North is a voice actor in Moab. Yeah, remember she came out of acting school; this was like her first gig, and then she got her TV show and everything else. I'm with you; my main thing is like, and I love Emily – this isn't a knock against Emily. What are we worried about the Hollywood ageism stuff? Are we worried at all about that in 10 years, is she going to be like... what are we casting El? I'm not even going to let you answer that question; we need to worry about putting a huge lead in this.",
            "start": 1114.56
        },
        {
            "text": "at all about that in 10 years is she going to like how what are we casting El I'm not even I'm not even going to let you answer that question we need to worry about putting a huge lead in this that can sell the movie Like Scarlett Johansson always ScarJo it's always then Emily Rose should be on the table Yeah in terms of aging I'm just saying this is a huge movie we're going to we're producing this kind of funny co-production with whoever the **** else owns the rights which I assume at this point PlayStation is it PlayStation so I assume Sony's gonna produce it the movie theater or the Sony doesn't matter Studios um they're going to want a big name for Drake they're going to want a big name for Elena because they're going to want a trilogy they're going to sign these people like five-year deals or five-movie deals we got to have a big name Scarlett Johansson first person that comes to mind why because I watched Lucy last night was it a good movie it was interesting stuff happened",
            "start": 1149.04
        },
        {
            "text": "deals or five movie deals we got to have a big name Scarlet Johansson first person that comes to mind why because I watched Lucy last night was it a good movie it was interesting stuff happened during it it was a movie that happened she's great in it yeah I'm gonna put ScarJo here I'm gonna say and this is just based off of previous success stories that I've seen for Chloe and Elena I want Munn and Kristen Bell because I feel like they they have that nice dynamic together and they both kind of Munis was on my list here too that **** you want Kristen Bell's Elena yeah I think Munas could pull off a good Elena just putting that out there as well I don't think these girls are getting the movies made though guys I'm thinking more along the lines of like Mars 2 made single-handedly how about this how about this how about this how about this how about this how about this how about this how about this Elena Olivia Wilde okay okay get her on the list just get her on the list now you're with",
            "start": 1188.32
        },
        {
            "text": "this how about this how about this how about this how about this how about this how about this how about this Elena Olivia wild okay okay get her on the list just get her on the list now you're with now here's the thing the blonde factor is an important factor with Elena but yeah but like you can lighten anybody's hair these days I get that but I mean I'm going to say no I don't like it watch I love Ali I used have such a crush she could be a great um Chloe I know I'm messing with the hair colors I'm so sorry sorry that's the most important thing you don't need to worry about that you don't need to worry cuz I watched the the the Fantastic Four movie and the one thing that bothered me of that movie otherwise it was phenomenal um no uh no not Jessica uh Jessica Alba I was making a call back to the really bad or the other bad fantastic four K Mara's hair gets progressively more blonde as the movie goes it's part of it's going invisible distracting after a while oh that's a perfect example",
            "start": 1236.36
        },
        {
            "text": "the really bad or the other bad Fantastic Four movie's hair gets progressively more blonde as the movie goes it's part of its going invisible distracting after a while oh that's a perfect example yeah Jessica Alba in the Fantastic Four movies no but I'm saying don't bleach it just we lighten it up and again it doesn't need to be like we don't need him to look exactly the same I know but we're making Sullivan into a black man I think we can mess around with the hair color a little bit black man sign I'm gonna throw this on the table not for any particular role but she's hot right now Elizabeth Olsen could she Elena yeah she's overused and I don't I don't think there's any good I know any of these people are watch dare you how dare you pay enough attention maybe that's what it is all right so so far then for my for that role I would say scarjo is my front runner no way Olivia Wilde I love Olivia Wilde doesn't have the star power of ScarJo right now remember ScarJo is going to be in really",
            "start": 1278.8
        },
        {
            "text": "so far then for my for that role I would say scarjo is my front runner no way Olivia Wilde I love Olivia Wilde doesn't have the star power of ScarJo right now remember ScarJo is going to be in really big movies for The Last Jedi it turns out she's Katherine Marlowe she's found the blue sap she's Immortal that's what Lazarovich is after Merl Streep is Marlowe yeah I was going to say we can we can nail that character yeah I know we do yeah Mar Streep would be lots of old women lot of old people lot of old people true in this world that just won't die I'm sicking with Kristen Bell I like it Christ I think she fits the role she's that like that nice kind of just cool you know what I mean do you know what I mean Colin yeah I know you know I know you mean I'm just thinking of random names that have no place in this movie all right I'm gonna say from Marlowe just judging solely based on the picture there's two actresses that come to mind Holly Hunter or Helen Mirren yeah Helen is what I thought but",
            "start": 1316.8
        },
        {
            "text": "\"Place in this movie, all right. I'm gonna say from Marvel, just judging solely based on the picture, there are two actresses that come to mind: Holly Hunter or Helen Mirren. Yeah, Helen is what I thought, but that's kind of a cop-out. Here's one for Florida's never a cop-out. Oh, here's one on a float out - it's a different direction for the character. Selma Hayek; she's older. I don't think it needs to be that you are an old lady. I think you know what I mean, like we're really playing with this now, like taking a lot of creative license. Did you see how well playing with Power Rangers is going over? How well playing with Ghostbusters is going over... people love it when you take something they know and love and you just tweak it a little bit. Yeah, just a little - just take it and give up like take it and take their expectation and give them the exact opposite of what they expect; they love it. They love it. That's Hollywood right there. Why did I... I spell 's hack' as 'shack' just why.\"",
            "start": 1362.24
        },
        {
            "text": "and give up like take a take and take their expectation and give them the exact opposite of what they expect they love it they love it that's Hollywood right there why did I I spell s hack just why do you care if you can read it because you're making fun of me I know how I spell Filipino every single time oh with the PH every single time that makes sense I mean Philippines is spelled with ph it's annoying it's annoying um no what he was uh who are you trying to put in for Alena you're trying to put in a Strowski and you just put Evan Strowhki like I'm not spelling her last name correctly the Filipino thing to be fair Nick the Phil the Filipino thing gets really deeply confusing because it's the Philippines with a P Filipino with an F is the person and then the language is is what Tagalog yeah so it's like all right there's got to be some sort of rule here where you're Filipino with a P from the Philippines and you speak Filipino right they they spell it with an F",
            "start": 1404.36
        },
        {
            "text": "Is it what Tagalog? Yeah, so it's like all right there's got to be some sort of rule here where you're Filipino with a P from the Philippines and you speak Filipino right they they spell it with an F I believe no they they what do you mean they spell the Philippines with an F? They you're saying they spell the Philippines with an F, yeah we put the \"o\" in there, we had to be fancy. Well it's probably named after... how do you feel about this? Oh Mary Elizabeth Winstead, I love her, get her in this! This is too confusing, Mary Elizabeth she strikes me again as more of an Elena, I want her and everything, she would be a Elena okay there we all agree that she's a thing don't **** bring up the hair just who you talking about? Mary Elizabeth Winstead from Scott Pilgrim, she was great. Okay yeah fine that's fine we're getting too hung up on this this topic is going to take eight years, she'd be good. Did you expect it not to? It doesn't matter how you spell it I like what about Drake? We we really should be talking...",
            "start": 1450.04
        },
        {
            "text": "getting too hung up on this topic is going to take eight years she'd be good did you expect it not to it doesn't matter how you spell it I like what about Drake we we really should be talking about Drake we usually double back to like who's going to who's going to cement this picture all right so wait who do we have who do we have firm right now do we have Steve Harvey a Sully firm all right that I like I think that nails it if he for some whatever reason says no we're gonna approach Samuel L. Jackson or Burt Reynolds okay I also had Bruce Willis on this list just cuz just he could be Lazarovich if you wanted but he's hard to work with to with I like that Bruce Willis's Lazarovich is a must okay okay uh also Jason Statham would be good because he looks all like all these bad guys bald white dudes STM could be Cutter though too it's a very it's a very insightful commentary on our current culture from n but can Bruce Willis do the the",
            "start": 1492.56
        },
        {
            "text": "he looks like all these bad guys, bald white dudes. STM could be a good choice though, it's a very insightful commentary on our current culture from N but can Bruce Willis do the accent? Does he need it though necessarily? His name is Lazarovich, Tony Lazarovich - coach's last name was Kach and he spoke fluent English perfectly, you had no idea this guy wasn't from Chicago that's true. I just want to reiterate his name is Lazarovich and he's Russian. Well, I'm always fine casting someone who actually is of that uh background so what about the D the only Russian guy I know is the Crazy Russian dude from Armageddon, he's not bald but he could do it - the guy was like American part-Russian parts all made in China. He's also the bad Russian guy from Bad Boys and the bad Russian guy from any other movie that needs a bad Russian guy. Is he in? He's in The Big Lebowski too yes and isn't he also the guy we **** you, he's in Until Dawn right, am I thinking about the same guy",
            "start": 1535.0
        },
        {
            "text": "guy from any other movie that needs a bad Russian guy is he in he's in the Big Lebowski too yes and isn't he also the guy we **** you he he's in he's in Until Dawn right am think about the same guy right yes therapist therapist and Until Dawn great great actor none of us know his name oh he's a character actor yeah he one to one guy I'm gonna I'll I'll I'll search this arm joke for you no we don't I mean what you're getting him to be Lazarevich no I'm just saying he's out there if we need him okay sure all right so hold on so we've got you're oh I see what you're doing okay I'm just putting down you know the people okay okay was Bruce Willis are we locked on Bruce Willis for Lazarov no no no he he's not gonna be able to do the accent and he's hard to work with we're gonna put him as two okay who are you putting as number one then Telly Savalas who another guy again they don't need you saw again with Liev Schreiber and it goes when you just take somebody and shave their head",
            "start": 1583.16
        },
        {
            "text": "as two okay who are you putting as number one then Tom Hardy who another guy again they don't need you saw again with Liam Neeson and how well it goes when you just take somebody and shave their head and say they're character I don't know anything about the character though is he the main bad guy guess what he's the main bad guy he really wants some blue sap and he shoots people there you go he wears a shotgun and body armor big bulky dude John Cena no I was thinking The Rock Diesel Diesel obvious Dwayne \"The Rock\" Johnson is more obvious than The Rock who's in every goddamn movie ever now he you know what everybody likes I'm not complaining leading up the jungle I like I like Vin too I think Vin Diesel's good for Lazarovich and he could definitely do the accent all right so well he can do something not the best at accents been diesel unless you talk about that shark commercial that he did L'Oral Sharkbarbe remember that one I do I do yes we all remember okay so now what are you doing well now I'm looking up Wrath",
            "start": 1631.24
        },
        {
            "text": "at accents been diesel unless you talk about that shark commercial that he did L Sharkya remember that one I do I do yes we all remember okay so now what are you doing well now I'm looking up Wrath of Ra imagine Darren Brawley there you go okay oh this is Tom Hiddleston or whatever his name is oh Loki yeah Loki cool that or Jake Gyllenhaal I'm putting that out there oh Jake Gyllenhaal I like Nightcrawler so much I mean honestly you don't want to give away ah that role actually could be a big role Jake Gyllenhaal is a really good pick you give it to uh um who's the Pretty Boy wow Gosling Gosling could do that here we go see but now it's going to be Justin Timberlake he'll do the theme song I want him to do the theme song it'll be a top 40 hit we're not going to bring it until the second movie though yeah bad guy yeah he's not going to be a bad guy off no Justin would do JT would do it yeah but he's not like that bad of a guy I mean it's kind of like he's he's fine okay okay so J JT is our",
            "start": 1679.96
        },
        {
            "text": "though yeah bad guy yeah he's not going to be a bad guy off no Justin Timberlake would do JT would do it yeah but he's not like that bad of a guy I mean it's kind of like he's he's fine okay okay so J.T. is our first for Rafe Jake Gyllenhaal for second okay Tom Hiddleston I don't even know how to spell Tom you don't even need him because trust me when Justin Timberlake turns this down Jake Gyllenhaal will deliver you got to have your list because later when the like our notes get released people think it's cool be like oh they were going to approach Bruce Willis for the Russian guy what a disaster that would have been all right so now going back we still need a good one for Chloe I thought we' like Maisie Williams all right I'm just put find an unknown like the like my my she looks exactly like the actress who was uh Elektra from Daredevil season 2 never got there didn't like her okay no I never got to it I watched one episode I was like oh it's more Daredevil and walked away it's just I've been busy I",
            "start": 1727.96
        },
        {
            "text": "who was uh Elektra from Daredevil season 2 never got there didn't like her okay no I never got to it I watched one episode I was like oh it's more Daredevil and walked away it's just I've been busy I mean ma um uh Charlize is very is a very sex appeal driven character I want to shout out to Emily Ratajkowski oh that does I can get into that yeah okay but she's like you know she's in that weird spot right now we that sounded wrong that's not what I meant you want Emily Ratajkowski I can be into that yes I can I'm into that yeah I don't know man she might I like that choice you think so I don't think so Emily Ratajkowski yeah again we can do hey I'm into it okay all right I'll put her down on the list Nick's still trying to figure out this Daredevil actually I don't know what her name is uh what the **** no it's also just fun to watch Nick try to use a computer it's like watching Kevin try to do anything it's the same way we all are I feel like whenever somebody's watching over your shoulder and you have",
            "start": 1775.16
        },
        {
            "text": "also just fun to watch Nick try to use a computer it's like watching Kevin try to do anything it's the same way we all are I feel like whenever somebody's watching over your shoulder and you have to do something I'm quite efficient on Google quite efficient quite efficient I don't like it there she is right there ah ELO young Eliot young man and Emily Rossi all fighting for this one role she looks a lot like Chloe I'm kind of on the nose all right fine do it sorry Emily back in the line maybe you can get Ben be cutter I just putting her out oh that's really big all right all right now we got Sam yeah we got young Drake I feel like now maybe uh you said young Drake we need young Drake would it be two on those if we actually cast Drake as Drake I mean I'm into it Young yeah we need yeah okay we need one more backup well I guess that works uh who's Sam it's Drake's brother oh so we're bringing him in yeah yeah he's a big part of the Char like we got to figure out who Drake",
            "start": 1827.44
        },
        {
            "text": "\"Need yeah okay we need one more backup well I guess that works uh who's Sam it's Drake's brother oh so we're bringing him in yeah yeah he's a big part of the Charl like we got to figure out who Drake is before we figure out the chemistry between his I agree with that I agree with that I agree with that agree so I'm going to throw out my main the person I always throw on this God Ryan Gosling he's the star of our Metal Gear movie people are going to think he's just coming off hot off the success that was Blade Runner come on bro let's get him in another one he could be the guy that brings back all like that revitalizes the video game movie industry he could be that guy and by revitalizes I mean actually creates that industry because we haven't had that yet okay and you're saying this has to be a huge movie star you're saying this has to be the biggest star of the thing I mean this needs to be a a Chris Pratt a Ryan Gosling Pratt man I think he has the action element too much he is\"",
            "start": 1890.24
        },
        {
            "text": "to be a huge movie star you're saying this has to be the biggest star of the thing I mean this needs to be a A Chris Pratt a Ryan Gosling Pratt man I think he has the action element too much he is he isn't I I love Chris Pratt I'm sorry if you're watching Chris I think he'd be good he has the the he has shops he has the action and the comedy combined but is he rugged enough I think he can be you know this guy he could be the man that we deserve he could be the Drake that we need you know just imagine him with a scarf on oh I am and it's good he could do it oh here's what I'll float just floating it Oscar Isaac yeah Po Damron X-Men he's got the humor down I feel like we could get him on one of them Marvel diets not to get B you know buffed he get jacked I guess he's already he already it's Po Dam he's pretty good I mean he's guys got to be every man apocalypse yeah no I like this but he's he is in a lot of stuff yeah but he's good though that's a solid call thank you I'm I'm I'm glad I'm",
            "start": 1929.68
        },
        {
            "text": "\"Dam, he's pretty good. I mean, he's guys gotta be everyman apocalypse, yeah no, I like this but he's he is in a lot of stuff, yeah but he's good though that's a solid call. Thank you, I'm I'm I'm glad I'm here for you so you guys are vetoing Ryan Gosling, go is what I yeah no, Ryan Gosling, we've had enough of the Gosling, Gosling is in our other major motion picture, all right all right fine. I mean, I have a good personal I have an actual special relationship with Ryan Gosling, I'll explain to him that you guys don't want do we want to consider Bradley Cooper too? Old, I think he's a bit too old, too old okay but we need a Sam oh and I think Bradley Cooper is the good guy for say that got good yeah yeah okay I like that I like that sorry I like that Bradley Cooper is Chris Pratt's older brother why are you trying to get the Pratt in this so much that's awesome oh that is a good one that was a good play that was a really good play yeah yeah I like that a lot we got a hit movie on our hands we do we got to\"",
            "start": 1979.48
        },
        {
            "text": "In this so much that's awesome, oh that is a good one, that was a good play, that was a really good play, yeah, yeah, I like that a lot. We got a hit movie on our hands, we do, we got to get in the hot seat to make this thing happen, oh man, unlike anything this all right, go back to the cast, all right, so the cast, we still need, we need our definitive Drake, I like Chris Pratt but the problem with CHR he's gonna say no, he's not gonna want to do it because he's he already has Guardians and he's already got Jurassic World which I'm sure he'll do another one of those does Jurassic Universe, Jurassic Galaxy, dinosaurs on Mars that's crazy you can't do that yes we can we Jean spliced them now they eat rocks for air but no one can visit them um all right give me one more we need one more person for Drake oh Jesus top 100 male actors in no particular order thanks IMDb that'll help me see what we got here hold on it's loading we're not putting Leo in it don't think about it I know you're thinking",
            "start": 2028.6
        },
        {
            "text": "Drake oh Jesus top 100 male actors in no particular order thanks IMDb that'll help me see what we got here hold on it's loading we're not putting Leo in it don't think about it I know you're thinking about it I want to put the dad from Modern Family which one he's cool he's too old but uh he would also work could also be another Steve - I'm looking at the random ass people oh you know who I just saw that I love he's in uh Frankie and Grace and he could make a really good Sully too Frankie Muniz no no Frankie excuse me yeah the Netflix show not Ethan Embry no um will I'm sorry I'm going back to Sully right now is uh the fourth Ghostbuster Bill Murray no oh Ernie Hudson Ernie Hudson I love Ernie Hudson Ernie Hudson's great yeah Steve Harvey is a way better comedically timed Sully he'll say something funny he'll have a cool plane again Ernie is getting too intimidating Ernie is getting too intimidating Sully's a man young hold on young actors what second",
            "start": 2075.84
        },
        {
            "text": "Timed Sully, he'll say something funny; he'll have a cool plane again. Ernie is getting too intimidating. Ernie is getting too intimidating. Sully's a man, young. Hold on, young actors! What second season? Still here we go. Do you like the second season or Gran Turismo for young Drake? How do we feel about the kid that played Spider-Man, Tom Holland no... um, the new Spider-Man kid; he's being cast as Young I mean it's young Drake is Young I mean I guess mul... no, he's like probably 14 or something. So we cast an 18-year-old or 19-year-old as a 14-year-old? We cast a 34-year-old as a 12-year-old. Hollywood, yeah! Hold on, I got it; I have the perfect one. Let me get a name for you though. All right, Jesus Greg yell at me; I'm so mad. It's it might skew a bit too young but keep in mind move time has passed since then. Jacob Tremblay from Room? Okay, yeah! That that kid, cuz if we just play it a little bit, he is... you know we're I mean it's all up to us; we're using the Uncharted 2 young Drake or Uncharted three young Drake.",
            "start": 2125.72
        },
        {
            "text": "Tremble from room okay yeah that that kid cuz if we just play it a little bit that he is you know we're I mean it's all up to us we're using the Uncharted 2 young Drake or Uncharted three young Drake moment so we have it out there he's just a little bit younger he also showed some acrobatics in room so we know he's got it in it get the kid from The Sixth Sense not a kid he's a 34-year-old man I I want him I feel like it'd be great he's he's too busy staring at everything Kevin Smith look him up now I've seen him he's in Jay and Silent Bob Strike Back, nope he could not happen that way what else do we have? He has stubble uh Jacob CH I think is fantastic I think we're good I would like to see one more person on our list to go through for Drake and then one more person for Chloe but everyone else I think we've got pretty much knocked in we we just have to figure out is this an origin story how does this work are we doing the trilogy of the games well like we said we're doing I don't think",
            "start": 2184.36
        },
        {
            "text": "I think we've got pretty much knocked it in, we just have to figure out is this an origin story how does this work are we doing the trilogy of the games well like we said we're doing I don't think we want to be presumptuous oh we I mean that's H.W. we're greenlighting until we have to cancel it we're committing this all the way until we have to completely back out and cancel it it's Hollywood we're going to commit $900 million or we'll give you $100 million if it tanks and then we won't do the second and third one Hollywood okay we'll film them all at the same time but you you're set on this that that Drake has to be a movie star correct he can't be an unknown for that role he could be an unknown because we always talk about it the guy from Until Dawn who played the boyfriend who you know his whole thing where he was running he was doing a Uncharted uh uh audition we always joked around about right anybody remember his name no you can find him, I think he's in Dawn I y I know who you're talking about he looks",
            "start": 2231.96
        },
        {
            "text": "thing where he was running he was doing a Uncharted uh uh audition we always joked around about right anybody remember his name no you can find him Nathan i y I know who you're talking about he looks exactly like the character but I don't think he's got the star power to do it that's what I just that's literally how I walked into this he might be too young too just don't think he has a star power sorry Greg Brett Dalton Brett Dalton never heard of him yeah and then Peter Serafinowicz was the Russian guy we all we all know oh that guy's perfect look his head he's in for what lazarich see where he's are for we got to bulk him up then that's all I'm saying about him lazarich is jacked man he's like 66 at least that's what he looks like body armor shotgun big arms big dick huge dick robbing **** jesus you know what me calling I know exactly why not Kevin it's a great word people all right let's let's wrap it up let's get some wrapping wrapping this up so going down the line",
            "start": 2271.08
        },
        {
            "text": "robbing **** jesus you know what me calling I know exactly why not Kevin it's a great word people all right let's let's wrap it up let's get some wrapping wrapping this up so going down the line yeah I'm going to go lowest to highest okay for Wraith yeah Justin Timberlake number one choice second choice Jake Gyllenhaal for Lazarovich The Rock number one choice second choice Vin Diesel third choice if we can get him Bruce Willis I don't he's gonna be cancer on the set he's toxic I don't want just The Rock and Vinny D it's fine now can we put Mark Wahlberg in anywhere because I just like Mark Wahlberg wasn't he attached to Dr. at one point that was when David O. Russell I think was going to direct it and I think he I don't think he's doing did the Assassin's Creed trailer drop today it it's this week oh this week okay for Marlo we have Selma Hayek Helen Mirren or Holly Hunter all very strong choices for young Drake Jacob TR young Drake is my favorite thing",
            "start": 2321.2
        },
        {
            "text": "Creed trailer drop today it's this week oh this week okay for Marlo we have Saoirse Ronan, Helen Mirren or Holly Hunter all very strong choices for young Drake Jacob TR young Drake is my favorite thing I could just all I can do is hear him saying that in the intro on the Tragically Hip album 2010 when they introduce him for the first time that's all he says on the Drake Graham man get him in for Sam we have Bradley Cooper done for Cutter we have Jason Statham yeah I like that yeah okay for Chloe we have Mila Kunis or Elle Fanning I like Mil but I'll take your word if you want to put a La in there she's got the look depending on how big the character is we'll see but I I do like Mila Okay for Sully Steve Harvey oh yeah we nailed it on that I mean knocked it out of the Park not even gonna I'm lying about that if I'm lying I'm dying that's a good one we have a long list of women to go to for Elena top of the list Scarlett Johansson that is that's top of your list top of my list",
            "start": 2367.0
        },
        {
            "text": "gonna I'm lying about that if I'm lying I'm dying that's a **** good we have a long list of women to go for Elena, top of the list is Scarjo, that is, that's top of your list, top of my list, top of Tim Gettys' list is Kristen Bell. I think we can all agree Olivia Wilde would be amazing for it. I put Elizabeth Olsen on there because she's doing great work and I put, and we both, we all put Mary Elizabeth Winstead on there because she's also doing great work; true, all of them make very strong characters for Drake. We have Chris Pratt who I feel like we just pick as the main actor for the lead for every time we do this. Oscar Isaac and I'm putting R; I'm putting Rising star Gosling back on a goddamn list, you guys can't stop me. It's my computer, oh man. This is one day when this movie gets made they're going to leak this and be like what were they thinking? No, this would be an awesome cast, this would be a great movie if any combination of these actors uh were in this film with the right director and the",
            "start": 2418.8
        },
        {
            "text": "to leak this and be like what were they thinking no this would be an awesome cast this would be a great movie if any combination of these actors uh were in this film with the right director and the right financing this would be and the right script and the right production crew and the right locations this would be just the and the right costumer and the right soundtrack be **** amazing just a few people just a key a few key roles we just need to get down you know yeah good couple good get one or two or three or four script right rewrites a couple couple more writers on it it' be great maybe bring back Amy Hennig locked in production hell forever and ever we'll bring Amy in and then we'll bring like eight other writers in sure it'll be great okay yeah um just that sounds like Hollywood's great lot of fun movies are made there we'll get Lawrence Kasdan to rewrite everything and then we'll rewrite him it'll be good that topic was brought to you by GameFly are you ready to save money",
            "start": 2458.2
        },
        {
            "text": "great lot of fun movies are made there we'll get Lawrence Fishburne to rewrite everything and then we'll rewrite him it'll be good that topic was brought to you by GameFly are you ready to save money and play more games and let me introduce you to our sponsor Gamefly Gamefly is the best way to buy and rent all your favorite games just go to gamefly.com pick your favorite games from its library of 9,000 and have them mail directly to your door try your favorite games and movies before you buy them keep the games as long as you want and cancel any time go to gamefly.com kindof funny and start your free premium 30-day trial today the premium trial allows you to check out two games and/or movies at a time you can only get this offer by visiting gamefly.com slash kind of funny my topic I'm G to throw Zoe Saldana on the list for Elena as well just in case let me know when I can trans special relationship with her which one is Zoe she's from Star Trek she plays Aurora oh she's great no she she's",
            "start": 2494.52
        },
        {
            "text": "throw Zoe Saldana on the list for Elena as well just in case let me know when I can trans special relationship with her which one is Zoe she's from Star Trek she plays Aora oh she's great no she she's great and she's gonna be an Avatar too I think maybe not she's not blond enough you **** it doesn't have to be just blond it does that's all that matters what do you get to eat just part of his shoe no his booger his eye booger I want him to eat his eye booger eat eye boogers what's the problem what do you do with your eye boogers I don't have eye boogers I'm oh bullshitters I don't I don't have Asperger's not the same not eyers ners similar as far as I understand",
            "start": 2535.24
        }
    ]
}