{
    "id": 1733,
    "video_id": "x80cTuPNgso",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Sex in Video Games - Kinda Funny Gamescast Ep. 69 (Pt. 1)",
    "description": "We discuss the history of sex in video games.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1462795203,
    "duration": 1117,
    "transcript_chunks": [
        {
            "text": "kinda funny live too is happening May 28th and 29th it's a two-day event the first day is going to be a completely ridiculous stage show we have planned this year completely blows last year on the water not even know how that's possible because we were really stupid last year and this year's somehow even stupider day two it's gonna be full day of meet and greets we're hanging out with with all of us a bunch of RoosterTeeth people are there Funhaus people in their Achievement Hunter it's gonna be a grand old time there's going to be some games to play there's going to be signings it's gonna it's exciting it's a really fun time this gonna be exclusive merch oh yeah it's definitely gonna be exclusive merch go to California comm slash tickets to get your tickets today there's a couple VIP tickets still available so make sure if you want one of those you act fast what's up guys welcome to the first ever episode 69 is a kind of funny games guests for you Tim Gettys and Greg Miller",
            "start": 0.03
        },
        {
            "text": "still available so make sure if you want one of those you act fast what's up guys welcome to the first ever episode 69 is a Kinda Funny Gamescast for you Tim it's all Moriarty and Greg Miller today is a very very very very very very special day it has all built to this many of you out there we're wondering what the **** are you gonna do Tim you're talking a big game about Kinda Funny Gamescast episode 69 you can actually do anything differently the answer is slightly there's a slight theme to this episode and that theme is good times if you don't know Kinda Funny Gamescast to show we talked about video games and other **** calling yeah sometimes it goes now you're gonna you and Greg might just get on the table in 69 darling well there was a lot of this table can not take thing on it six table a lot of requests for us to do the show naked I had to pass on that one I'll show you it will be ready for him yeah I am ready I ain't ready for that jelly um but yeah",
            "start": 35.19
        },
        {
            "text": "not take things on it six table a lot of requests for us to do the show naked I had to pass on that one I'll show you it will be ready for him yeah I am ready I ain't ready for that jelly um but yeah it's gonna be a damn good show if you got this show early because your supporter on patreon.com slash kinda funny games I appreciate you if you did in you could be one of those people I appreciate just throw some money that way you can throw $69 you can even throw 69 cents it's a sixty-nine I'm not gonna use the wrapper okay there are 16 cents we could do it satisfaction know helping people out trust me you'll get satisfaction for it so that's gonna be a good old time I'm gonna get right into it okay you know the shop number allcom such kinda funny games all that stuff shareable topic number one sex in games sure we're talking about sense here we're talking about what is your first memories of seeing sex in games you know what are some good examples of sex and games there's some",
            "start": 93.49
        },
        {
            "text": "number one sex in games sure we're talking about sensuality here we're talking about what is your first memories of seeing sex in games you know what are some good examples of sexuality and games there's some bad examples of sexy come on when I say sexing games let's start off here what do you think about I mean I'm for me like Hot Coffee is the first thing that jumps out what is Hot Coffee Greg of course in Grand Theft Auto: San Andreas there was a sex minigame they didn't make the final cut but was still hidden in the code and so on the PC version people could get to it and everybody flipped the **** out in it like for a week earned them an M rating it was taken off of shelves doggone Rockstar had to reprint the game put it back out and not have that in there was a huge brouhaha because of course the news media picked it up that Grand Theft Auto has a sex minigame in it in that and that was it everybody flipped if I love me a good controversy you know what I mean calling these people just grab",
            "start": 134.53
        },
        {
            "text": "the news media picked it up that Grand Theft Auto has a sex minigame in it, in that and that was it, everybody flipped. I love me a good \"San Andreas\" you know what I mean. Calling these people just grab headlines all day they didn't do any investigative journalism to find out what was really happening. Do you ever see it though? Yeah, huh. Cop you see yeah yeah like damn this is hit elating this is a completely letdown. Agencies like really poor animations of CJ humping some lady doggystyle and it's like huh all right mmm let's see why this is a huge deal what's weird about it is that it was such a big deal back in what 2004-ish, yes, and \"San Andreas\" you know in 2004 I don't know if it was found until oh five probably cuz it was um I don't think it came to PC right away sometime around there and it was just like that everyone was saw my dad that was like a national headline thing it wasn't even just like an IGN headline thing because it's the biggest game of going yeah it somehow had this thing hidden",
            "start": 178.42
        },
        {
            "text": "like that everyone saw my dad, that was like a national headline thing, it wasn't even just like an IGN headline thing because it's the biggest game of all time, yeah it somehow had this thing hidden behind I understand why it was such a sexy headline but it was just like so poorly reported because it made it sound like you know you do the Konami code and there you are you're banging some lady, yeah but now I was like some weird hidden **** but what's extremely interesting to me is then you look at like the later GTA's to get way more realistic looking sure next-gen **** you're talking about GTA 5 this straight up just the scenes in that are like not hit it at all part of the game, yeah like when you get the prostitutes in the car GTA 5 it's like it's pretty graphic right, sure there's no penetration you can't be that close to a penetration, Hot Coffee that, sure but there is a scene I mean it's implied in the I know I'm just I know it really interesting what 10 years does of course",
            "start": 218.42
        },
        {
            "text": "no penetration you can't be that close a penetration hot coffee that's sure but there is a slide I mean it's implied in the I know I'm just I know it really interesting what 10 years does of course yeah desensitizing people well there's that Yume Nikki need your help on this is Mr. Retro I want to say what what is it thinking of an isn't it wasn't it a Naughty Dog game Super Nintendo or Sega where you put in a code and it would change the Fox logo to a naked lady what am I thinking of maybe wasn't naughty like what didn't make us NES games but there could be a Jet Set Radio game like Rings of Power let me look that up because I remember that would be gonna be zero that there was like a secret code you could get a naked lady out I mean never stairs ancient what was it like that there are a lot of like old PC games in the 80s that were like puzzle games that would show naked ladies like and like very pixelated forms obviously I think like Leisure Suit Larry you have Super",
            "start": 256.97
        },
        {
            "text": "There are a lot of old PC games in the 80s that were like puzzle games that would show naked ladies, like very pixelated forms obviously. I think like Leisure Suit Larry, you have super racist and sexist games like Custer's Revenge, which I think is probably the first really overdose of sexuality and yeah, and a really like very offensive game for a lot of people rightfully so. I think that in terms of you know, so I kind of put these things together like implied sex, like I think there was like implied sexed into a degree and even Final Fantasy IV and V on the NES or just like love kind closeness with some characters whatever but I don't really see it you know with with sprites forever like that. And so I think that with you know, I think right the thought oh probably was the like three into a bigger device sitting than Santa Cruz or more I think. And then for even more were my first real introduction of videogame sex as a worm that it was Mass Effect and then it was",
            "start": 297.35
        },
        {
            "text": "the like three into a bigger device sitting than Santa Cruz or more I think and then for even more were my first real introduction of video games sex as a worm that it was Mass Effect and then it was with Uncharted yeah and now just a normal thing yeah what seems that that's kind of unfortunate I mean like Ryan Reynolds was correct about yeah um so like I kind of feel this way in cinema too like in movies and TV like I'm watching The Americans right now and which is fine it's a show takes place in the eighties about Soviet spies but like it's very hyper sexual and like I don't see like I've never really seen an example in fiction of where like showing graphic sex or showing like the act as opposed to implying or ever ever adds to the story ever why I can't think of a single example of like where I'm like well that was really needed you know as opposed to like to show me the sex scene in Terminator between Kyle Reese and Sarah Connor didn't bring you closer to them it's just like I just I",
            "start": 339.08
        },
        {
            "text": "I'm like, well, that was really needed, you know? As opposed to showing me the sex scene in The Terminator between Kyle Reese and Sarah Connor, didn't bring you closer to them. It's just like I just... I don't. I'm not trying to be a prude at all in that respect. It's just like in fiction, I think the implication is usually way more powerful than showing it. Like, a great example is Uncharted with Chloe and Drake - the first time they have sex, they're like, can we crawl on top of her? At our top of him, and then the camera pans away. And I'm like, that's like great, that's sure that tells me as much as I need to know. As if you were showing them rolling around for five minutes, like why... I never really in fiction get uncomfortable sometimes where do you come from? Massive sex scenes, then like they're still very cool. Like the flirtation and the figuring out who you can be with them aspect is way more fun than the awkwardness of",
            "start": 380.78
        },
        {
            "text": "you come what do you come now of massive sex scenes then like they're still very cool like the flirtation and the figuring out who you can be with them aspect is way more fun than the awkwardness of like the different characters walking a real life Colin Moriarty chase is always better than the actual act but to so to me like I I'm I don't see that it's penetrated gaming as much as as much as it has you know film and television but I'm even seeing an American so I'm like this is kind of uncomfortable why do we want you to see this **** like this doesn't it doesn't add to the story and so to me like sex is very powerful device in fiction but it doesn't need it and it's super addictive but it doesn't need to be seen it's the same thing of like why it's like is identical to watching a snuff film or something where like when someone's killed in a movie or shot or stabbed you don't really often see it right like it's often like the guy puts the gun in the head",
            "start": 421.4
        },
        {
            "text": "like a snuff film or something where like when someone's killed in a movie or shot or stabbed, you don't really often see it right, like it's often like the guy puts the gun to the head and the trigger is pulled and the guy falls to the ground, so you don't need to see the bullet careening through his head to know what happened, and to have that be a powerful sort of device. Mm-hmm. So anyway, that's a kind of a ramp, but I'm glad it hasn't been as prominent in games as it has been in movie and television. I just don't see how it adds anything. Sex is important, love is important, but seeing it is like kind of gratuitous. I do think I agree with Greg on that it's uh it's contextual and can add I think the TV show examples Game of Thrones a lot of it is unnecessary, but I do think sometimes it does add to the context of the story and stuff. I think God of War is a good example, it's very graphic and unnecessary, like that's kind of the point, like it's",
            "start": 464.72
        },
        {
            "text": "but I do think sometimes it does add to the context of the story and stuff I think God of War is a good example of it is very graphic and unnecessary, like that's kind of the point, like it's supposed to make you feel a little uncomfortable just because it's God sex, you know, I mean it is him treating sex as if it's just a way to get red orbs, yeah exactly, you know, so I think it conceptually could make sense but then there's things like BMX XXX which was one of my first memories of sex being a real big thing in videogames that was another headline thing Mortal Kombat in the early 90s was all about the violence and then BMX XXX was like sex everywhere, and it's like you couldn't read a videogame magazine without previews of it and if you look at BMX XXX now it's so bad when you look at YouTube videos now it's like how is this a thing, yeah I just think it's the sex sells but it says a lot more about our society than that about the games or the movie like I",
            "start": 502.52
        },
        {
            "text": "It's so bad when you look at YouTube videos now it's like how is this a thing, yeah I just, it's the sex sells but it says a lot more about our society than that about the games or the movie. Like I think about Game of Thrones and there are some explicit sexual components in what I've seen in the first three seasons, I'm washing since but The Tudors is a great example to show times The Tudors, which is about Henry VIII where it's like it's almost pornographic and I'm like I don't really understand, like this isn't yeah he's having sex when we know that so just allude to it. It takes oh I feel like it's like almost a fictional cop-out when you show it as opposed to like you're wasting time, you need to waste five minutes wherever so you show it, it's a graphic sex scene, you know my under sitting your kind uncomfortable in my chair in the movie they're like wanting to see some actual story and some conflict there's some dialogue or something with",
            "start": 547.34
        },
        {
            "text": "Scene, you know my under sitting in your kind uncomfortable chair in the movie they're like wanting to see some actual story and some conflict there's some dialogue or something with that. And so I got part from like Mass Effect and like The Witcher is a great more recent example, though it's way more tasteful apparently than it was done in The Witcher 3. In which... yeah, I didn't play them but I know quite a bit about that game. You know, that's kind of sexist, although I don't agree with the charges that The Witcher 3 made. Everyone's like \"The Witcher 3 is sexist\" and did you see the Chinese Room tweet? Yeah, about the Chinese Room, makers of Everybody's Gone to the Rapture and Dear Esther, they tweeted out when CD Projekt RED showed a picture of Cyberpunk 2077 of a cyborg woman in lingerie and stockings. And I like that, and they're like \"this is sexist as we'd expect\" whatever, and a lot of people are saying well this is based on the source material but...",
            "start": 585.89
        },
        {
            "text": "woman in lingerie and stockings since i like that and they're like this is sexist as we'd expect whatever and a lot of people are saying well this is based on the source material but i never found that the inclusion of sex made which were three sexist to either i don't think there's like very powerful women characters exactly that's the big thing i mean so like you want to level at it in fact you have to go and talk about you know who yennefer is who triss is and who what their characters are yes not that yeah they you have sex with them but that's also if you want to if you want to develop the relationship though so i just say that to separate that in mass effect i think on one side and then something like dragon age that thought oh maybe on the other side where there is like a more of a sexual and sexist component to it that's really needless but in all three cases i don't think showing it added anything and i'll go back to that uncharted 2 example i think is the most",
            "start": 626.69
        },
        {
            "text": "of a sexual and sexist component to it that's really needless but in all three cases I don't think showing it added anything and I'll go back to the Uncharted 2 example, I think one of the most memorable ones was there was plenty of Mass Effect ones that worked, I felt like it and I didn't make the choice personally okay so I can't remember if it was Liara or her mother, I think it was Liara though, and one where you could have sex with or whatever and it was just a way to progress through the story and the pain of pasteurization, like blue but right and this is the one that got blown out of proportion on Fox News or whatever and then they showed us the pundit who was arguing against it eventually like a day later and she's like oh that was totally fine I'm stupid or whatever that one was done well but there are the weird ones yeah we're like I just think of two or three now they run together, you could seduce that like secretary on your ship later or whatever",
            "start": 657.74
        },
        {
            "text": "one was done well but there are the weird ones yeah we're like i just think of a in two or three now they run together we're on your ship you could seduce that like secretary later or whatever and like bring her up and it was like a real relationship but she got in the shower and then I my commander Shepard got in there my fam chef got in there it's like totally awkward of like hey like you know i'm trying to bring not these bodies together to make it happen but then like i think of a it's been so long now that I don't remember well but I remember at least at the time thinking Heavy Rain did it well with Ethan and Madison because that was a full-on like Madison's naked Ethan's but it was like they're taking off their clothes or whatever to have sex it wasn't like it wasn't sex in terms of like bumping uglies but it was sex in terms of like we build up to it and what was gonna happen yeah I think that are you saying that it's a cop-out I don't necessarily agree that it's a",
            "start": 692.96
        },
        {
            "text": "in terms of like bumping uglies, but it was sex in terms of like we build up to it and what was gonna happen. Yeah, I think that are you saying that it's a cop-out? I don't necessarily agree that it's a cop-out. I do think that it's really difficult to do correctly, and I think that it wasn't... it doesn't hit that it feels like a cop-out; it is, it feels cheap, and it's cringe-worthy. There's a very fine line between it being awesome and being additive, and it being cringe-worthy, and I think that more often than not you're going to fail at that stuff. But it's the equivalent of like large-scale battles with stuff – there's a lot of times you see in shows or movies or anything they just on the budget for it so they'll kind of cop out and do like a quick version, and that's 99% the time more effective than them attempting to actually do the actual fight because they couldn't do that right. But when they do it right, it is awesome, and it's thrilling – like Lord of the Rings",
            "start": 730.64
        },
        {
            "text": "time more effective than them attempting to actually do the actual fight because they couldn't do that right and it but when they do it right it is awesome and it's thrilling like The Lord of the Rings: The Two Towers, like yeah there's that's memorable because it's the Hobbit set because of the the battle it's really the it's an accomplishment and I think that when sex scenes do stand out and like they do add something it's really special but more often than not especially in video games it's that weird uncanny valley thing where it's that's the big thing is again when you bring together these models and something that has to be so intimate and so like you know touching someone loving someone that like when it's just like yeah awkward you know that they're like clearly their bodies are like clipping or whatever it's like why why even bother doing this why is this what it's going to be yeah another I think good example was in Far Cry 3: Blood Dragon did you guys play that no yeah I",
            "start": 767.57
        },
        {
            "text": "clipping or whatever it's like why why even bother doing this why is this what it's going to be yeah another I think good example was in a Far Cry 3: Blood Dragon did you guys play that no yeah I played I beat it ah it there's there's a **** awesome sex scene it's all like retro 80s like 8-bit stop pixel see yeah and stuff and then I wrote the line down because it's **** awesome I want to be blinded with your cyber love and it's just it's totally aware of itself and it like it it doesn't show too much but it shows more than it needed to sure but it's perfect it's like that perfect thing of like they nailed it because it is kind of a parody of it's Far Cry 3 is another interesting example to sexy games when that woman who's on top of you and from first-person perspective on thinking of the ending I believe correct remember well I don't I believe right like it was like it was awkward in quotes but it was more disturbing it was jarring you know I mean it wasn't meant to be like",
            "start": 809.03
        },
        {
            "text": "of the ending I believe correct remember well I don't I believe right like it was like it was awkward in quotes but it was more disturbing it was jarring you know I mean it wasn't meant to be like this is so good like it was like wise Avenel and then spoilers in Far Cry 3 like she kills you like her as she's having sex with you right or like they've leased the variant no part I'm thinking of and I think there might've been apart earlier in the game where she was having sex Lee but it didn't kill you but it was like it was meant to be like this is some kind of weird right oh I'm dead yeah I mean like it wasn't meant to be like yeah but we know awesome I mean I've been going way back Super Mario Bros there's no sex there's no anything that will kiss at the end though that was enough for me I can imply I can infer some you really think Mario and Princess Peach 100% no way yeah no way my girls won yeah in the rest of them probably not she was sick",
            "start": 847.01
        },
        {
            "text": "that was enough for me I can imply I can infer some **** you really think Mario and the Princess Peach 100% no way yeah no way my girls won yeah in the rest of them probably not she was sick of that **** she didn't need that plumber dick well let's do Super Mario Bros one the pipes were clogged so he's hissing holy guy oh there's nothing wrong with sex that's my problem with people that act like there's an issue nothing with sex is Jesse I thought maybe he would lay some pipe but he's caught the pipe for clogged your clogged and he took care of that good I mean I hope he didn't the pipe I didn't play that part of the game they did what Colin's talking about and they didn't show it but I see I don't run they're flying the same way Colin's talking mother but I know man did you see that did you play Super Mario All-Stars version I don't think that has an animated thing of them kissing in that kiss it made him blush yeah and if I know Nintendo you and you do you think that led to the bumping",
            "start": 886.64
        },
        {
            "text": "play Super Mario All-Stars version I don't think that has an animated thing of them kissing in that kiss it made him blush yeah and if I know Nintendo you and you do you think that led to the bumping yeah and then there was Pokémon Gold and Silver when you can make the Pokémon right may you leave them at the breeding center and then they have the kids view yeah Viva Piñata did sex really well animal husbandry right and where they went and then they like given little cute animals came in that was fun mm-hmm yeah yeah I mean you you have to if I'm lying I'm dying yeah when I leave my Pokémon at the breeding center I know what's going on I'm not stupid eight-year-old Timmy he's imagining that Pikachu bumpin nasties with Jigglypuff gettin all up in that land of eggs I have to walk thousand steps to make him hatch yeah who's laying the eggs they do which one then you have the Polka egg I don't know that whoever the female is okay don't ask stupid questions I'm sorry I just don't not",
            "start": 931.19
        },
        {
            "text": "Steps to make him hatch, yeah, who's laying the eggs? They do which one, then you have the Pokémon egg. I don't know that whoever the female is okay, don't ask stupid questions. I'm sorry, I just don't not familiar with the breedings in some other game. Let's see, I think we talked about most how do you do it is a more recent well I'm sure that we did mean is your name is game yes we do let's play of it right and Nick over at YouTube.com slash KindaFunnyGames I enjoy that a lot yes that one when you take there's two dolls and when your model yeah as you you have to like figure out how to do because you know how to do it I don't know how to do it still might not know how to do it I mean on that level Yandere Simulator is another great example of a game based on losing your virginity, whether and through you know through relationship you build a game but again it's not it's not your sex is part of the the story not so much like the end goal right or how it all plays out it's just it's used the way.",
            "start": 973.22
        },
        {
            "text": "through relationship you build a game but again it's not it's not your sex is part of the story not so much like the end goal right or how it all plays out it's just it's used the way that wouldn't make it you know I can act you know that's not exploiting it it's you know about falling in love and it's about explaining this relationship and about that thing but it comes down to losing your virginity to this guy that you've met online mmm that's interesting that's good I thought that was a good way to handle it now you try that out it definitely sounds like an interesting game right up my alley yeah no you you enjoyed it's definitely interesting mm-hm very different um so try to wrap this topic up once you guys have anything more to add going back to the Mario thing jokes aside my first real introduction to the idea and concept of sex and video games together was the \"Benefit\" rap song Warp to World 6-9 which perfectly ties into this topic yes where he made a rap song",
            "start": 1011.32
        },
        {
            "text": "my my first real introduction to the idea and concept of sex and video games together was the benefit rap song Warp Speed to World 6-9 which perfectly ties into this topic yes where he made a rap song about trying to beat Mario for the first time back when he was in elementary school and there's a line where he says that like he remembers when when the kid says that if you beat the game you see the princess naked and that drove him to want to beat the game like it's a really graphic song it's like it's a nasty rap song but I remember hearing that and it totally changed my entire view of video games well I'm like oh my god that's awesome when you're a little kid you know what boobs are so pixelated boobs sounds awesome I remember that it stuck with me and it pushed me to beat Super Mario Brothers were you disappointed when you got there and there was just a B again I saw the blushing on my ugly that's implied I know what's up princess watching the entire show get bucked up in the original",
            "start": 1049.78
        },
        {
            "text": "We were disappointed when you got there and there was just a B again. I saw the blushing on my Ugly (note: likely referring to the video game \"Ugly Americans\") that's implied, I know what's up, Princess. Watching the entire show get bucked up in the original Mario it's Laufen (note: likely referring to the video game \"Luigi's Mansion\" or possibly a character named Luigi), address this is lost where the goodies they dress it's pretty bad it is pretty bad all right",
            "start": 1096.15
        }
    ]
}