{
    "id": 836,
    "video_id": "4UkOZW78M3k",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Let's Play Mario Kart 8 200cc - Kinda Funny Plays",
    "description": "The boys all play the latest Mario Kart 8 DLC.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1431370800,
    "duration": 907,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to another let's play here on youtube.com/ kindafunnygames I'm Greg that's Tim this is Colin that's Nick we're playing Mario Kart 8 Tim why are we playing an old ass game like Mario Kart 8 DLC number two the second Pack's finally out took forever finally so what are we getting on of this one we're getting there's a 200cc mode which it's more fast more Fierce than Mario Karts ever been I see what you did there I'm pretty excited for this okay everybody chime in tell who who you are all right I'm top left see we got new characters in this pack if you guys care we got Villager yeah we got oh great this the the solution of course for playing Wii games on doesn't work out as well as always and uh we got Dry Bowser Dry Bowser dry bones but he's not good enough in my book why is he dry is he like dry bones look at him he's Skin and Bones Nick Mo I would think all right so I'm lock up in the left corner who's Toad I'm Toad all right I'm going to be",
            "start": 0.12
        },
        {
            "text": "enough in my book why is he dry is he like dry bones look at him he's Skin and Bones Nick Mo I would think all right so I'm lock up in the left corner who's Toad I'm Toad all right I'm going to be my boy Koopa Troopa you're Koopa Trooper down L and then Nick you're gonna be Luigi I'm gonna be Luigi cuz that makes sense cuz someone's got to be Luigi Toad and Luigi have to hit a this is a real B tier kind of race right here L Toad uh Koopa Troa first off La is the man going straight across yeah I know how my Wiggler carts all there it's all about that Wi you know so here we go guys we got which we doing first we got these two ones we're going to start here oh boy baby baby Park back yeah finally mhm now they get they get they get dry bones this is the perfect game I'm so excited about this I think it's Leaf cup Now remind me how to play this baby game by that way yeah gas right right trigger right drift right I just I still don't know what to do with that okay well then you're not going to",
            "start": 41.16
        },
        {
            "text": "it's Leaf Cup. Now remind me how to play this Baby Park game by that way, yeah, gas right, right trigger, right drift, right. I just... I still don't know what to do with that. Okay, well then you're not going to do too well. Baby Park is all but I I've never played Baby Park at 200cc - that's 50 more CCs. I'm using Mario Kart 8 with all the like flippity-dippi, yeah, but I doubt it's much different. What's a flippity-Dippity about? I don't know. I hope Baby Gas doesn't screw me over now. It didn't work. Oh well, I'm already jacked up. Oh Jesus, 200 CCs - you can feel it in your butt. 200 cc's of power. How do I use my item? Oh baby, this feels really fast. Well, it's not. I don't know if our best bet was starting 200cc on the smallest course. Oh my God, jeez, this is hella fast. I can feel the G forces. This is like F-Zero **** hey guys, I'm in 10th place - isn't that dope? Oh God, how do you not... did you not play a lot of Baby Park on the GameCube version there? Nick uh, I didn't play the GameCube version of this",
            "start": 83.56
        },
        {
            "text": "hey guys I'm in 10th place isn't that dope oh God how do you not do you not did you not play a lot of Baby Park on the GameCube version there Nick uh I didn't play the GameCube version of this you **** suck I remember playing are you going to tell me you fell for IGN's smear campaign of the 79 did FR give it an S that's Infamous score yeah God damn it with the blue shell **** every I don't understand I don't understand the whole drift oh my God I golden mushroom with the two great maybe it's cuz I don't drive a car yeah well you're not you should not be drifting in real life you don't drift in real life who still got it Greg does wiggle wiggle wiggle wiggle wiggle wiggle wiggle I don't know I don't really I got a card me and LCU you know why they call him L you lapped me like that much that you're done already yeah I'd be drifting I I just don't understand how to drift like you got to you're just you do it so you go around the corners tighter you rock it back and forth",
            "start": 141.0
        },
        {
            "text": "that much that you're done already yeah I'd be drifting I I just don't understand how to drift like you got to you're just you do it so you go around the corners tighter you rock it back and forth you get a little bit of boost this is a great place to learn drift that's the GameCube this is where you you you earned your teeth I came place I feel like you're the right person to ask this lay on how do I make it so that I just see my screen on this I feel like that's a possibility no it isn't that's the that's the Brilliance of the Wii U oh the Wii U is a brilliant why would you give a player a screen and let them only see their their own screen that's stupid why would you build a four player game like this split down the center and then not let other people bring their game pad controllers and sync them and then each one of them get their own feed why would you do that that doesn't make any sense don't worry about it that takes skill okay we're going to chees land chees land GB",
            "start": 193.8
        },
        {
            "text": "and sync them and then each one of them gets their own feed why would you do that that doesn't make any sense don't worry about it that takes skill okay we're going to Cheese Land, Cheese Land GB from Super Mario Kart 8 you take this land you put a little uh uh a smoked ham or like a a cracker like a like a water cracker on top of it you put it in your mouth like a p you know like a little you put a little Pure a little Cheese Land and then a little cracker Cheese Land and I'm just going to try not to get dead last that's where I'm at right now uhoh this one's going to be tougher this going to be harder to Corner oh God speed we got yeah this this 200cc is really something nasty I'll tell you tell me what I need remember that song no it was the it was the soundtrack to the Speed movie I think it's a song that you might have made up I did not make that up okay Molly I've got molly you got molly that's definitely not a song that is really not a song what where didd you get Molly from wouldn't you",
            "start": 229.6
        },
        {
            "text": "song that you might have made up I did not make that up okay Molly I've got molly you got molly that's definitely not a song that is really not a song what where did you get Molly from wouldn't you like to know oh **** all right so when when I'm how do I how do I fly this is not where you're going to learn to drift this is exactly what you learned to no this is where you learned to eat drifting well I've known how to eat **** for a long time I **** for breakfast you eat **** for like a cupcake I'm in the dry lamp here I don't care if it's **** Mother Teresa lyric I don't want to hear that eat ass like a cupcake like a cupcake oh man that really the best way to eat God damn it's too fast and did you say and did you say Mother Teresa also I'm saying I don't care if it was a Mother Teresa Mother Teresa is eating ass what are we talking about s that was than I think that was more alarming Mother Teresa was a s that that's more alarming literally I think they made her I she is",
            "start": 273.2
        },
        {
            "text": "Teresa Mother Teresa is eating ass, what are we talking about? That was then I think that was more alarming. Mother Teresa was a saint, that's more alarming. Literally, I think they made her... She is literally the same; that was the joke. Oh God, we're making such good jokes right now, guys. Yeah, we're playing like crap though. God, this is no... We're not there; there are too many corners here, and they're coming too quickly. Skewz. Oh man, the Tim screen hasn't happened for a while. I like that you just called out your own screen because you are the person in charge of that screen. No, get away from your big chain thing. You guys see how good I am at naming... stuff? Nicknaming video game stuff is one of my favorite things in the world. Oh my God, this game. Yeah, I mean, this... That's the thing about Mario Kart; it's fine; it's a fun game. It just doesn't control like it used to. What do you... You guys are the worst. It doesn't control much better than it used to. You're right; it used to be a lot worse.",
            "start": 320.04
        },
        {
            "text": "it's a fun game it just doesn't control like it used to what do you you guys are the worst it doesn't it used to be a lot it does it controls much better than it used to you're right it used to control wonderfully it's just kind of that it's just like everything else oh **** you in the world it just goes crazy everything's crazy it's just one of those games that we're all old now is the problem I'm not kidding I don't know that's not a joke no one laugh I'm telling you like I used to love Mario Kart and now I just always and it's the same thing as always it's just I'm getting beat to **** now and people are like that's what Mario Kart is and I'm like well I don't want to do that I don't I don't want to do that who's Luigi me **** you I just crushed everyone I just take everything back I just said about Mario Kart it's an awesome game I finished 11 so I'm I'm I'm one place better than I was okay we're doing okay guys no we're really not but I'm ultimately still in last place damn",
            "start": 364.4
        },
        {
            "text": "I just said about Mario Kart it's an awesome game I finished 11 so I'm I'm I'm one place better than I was okay we're doing okay guys no we're really not but I'm ultimately still in last place damn it you're beating me yeah I'm the best Mario car player in the house everybody knows that we settled that last time I'm embarrassed to see what 200cc is doing to me in this GBH it's hard man you really are good you know why I Choose lacu You know why they call him Lacu cuz he Lac takes first place victories no I don't know what you're saying nobody knows what you're saying all right guys we're heading to the Wild Woods an Animal Crossing this is not Animal Crossing yeah it is I never played Animal Crossing looks like this I never went inside anything in Animal Crossing this looks more like this looks more like I only getting things there Pikmin jokes oh going the wrong way that was reverse that I pressed my God I don't know I just typically like games that you know takes skill I guess look I I",
            "start": 399.16
        },
        {
            "text": "more like I only getting things there Pikmin jokes oh going the wrong way that was reverse that I pressed my God I don't know I just typically like games that you know take skill I guess look I I used to love Mario Kart I'm being I'm being I'm just I'm just busting balls but really this game doesn't take any skill no this game is dumb and the reason I say that is quite simple because I'm not good at it yeah and when I'm not good at a game typically it's the game fault yeah it's the game's fault if I can't be instantly good at a game that's just poor gaming that's poor game design it's just more more along the lines of you know if let's look at it this way I'm sitting here I'm dominating a game that's notoriously hard like a like a castle right you're crushing the castle you got and then I get to this you know pile of Street trash over here oh I was doing so well and it's not working out too well for me you know Colin needs to be careful there's going to be some gunfire soon oh is",
            "start": 445.12
        },
        {
            "text": "I get to this you know pile of Street trash over here oh I was doing so well and it's not working out too well for me you know call needs to be careful there's going to be some gunfire soon oh is he talking **** that's going to get shot Mario will be rolling by on his bike definitely I also think I played a Mario Kart game in before we started playing it for this this uh channel in you know 15 years so yeah I think that means I'm just not into these kinds of games I think the reaction I'm having is because I'm so terrible and I know what a Herculean effort it would take to actually get me good at this game that I instantly just don't want to play it again especially since we all know I'm actually the best Smash player in the house and that's a real game that's a gentleman's game it's a game of skill it's a game of treasure I don't know what that means I don't it is a game of treasure I'll oh God see it's funny cuz in the comparison of cart to smash Smash is always reminded",
            "start": 497.96
        },
        {
            "text": "Let's Play Mario Kart 8 200cc - Kinda Funny Plays\nThe boys all play the latest Mario Kart 8 DLC.\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames.\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nMusic by Rakohus!: http://www.youtube.com/user/rakohus\n\nskill it's a game of treasure, I don't know what that means. It is a game of treasure. I'll oh God, see it's funny cuz in the comparison of cart to smash. Smash is always reminded me of a pedophile. What the **** does that mean? So earlier today I asked Colin to tweet out about what their people's favorite kind of funny moments are and 90% of them are the ones where you just **** lose your **** Greg for no reason, and it's funny because most of the time I'll be watching the clips that I'm trying to find what was funny about it. Nothing funny ever happened; it's just you go crazy. That's usually the problem with with Greg's freakouts is that they happen at times that are not funny, and and we all want to get into it but we're really just waiting for Greg to regain himself a little bit. Explain what just happened he's kind of embarrassing himself lay out some Mario Kart facts I can't guys is 12 last it is yeah Jesus now I want to make a note here that the first race I",
            "start": 537.68
        },
        {
            "text": "a little bit explain what just happened he's kind of embarrassing himself lay out some Mario Kart facts I can't guys is 12 last it is yeah Jesus now I want to make a note here that the first race I finished 12th and then I finished 11th and now I finished 10th so slowly I'm climbing if the circuit was 12 races well who knows what might happen you get first in one of Now Greg I just wanted to point out right now that we are ti this is it this this is this is the granddaddy of them all who are you this is the Wrestlemania of Mario this the last race I'd like it to be the last it is the last race but then we get to do another one of these because we got to play the other DLC what's the other DLC sorry they can't all be grand there's another grand prix another 200cc fun pile get in your 200cc fun box last one not an Animal Crossing one I could have it was not an Animal Crossing it it looked like Pikmin there was nothing Animal Crossing about that level there was no Tom Nook out",
            "start": 584.08
        },
        {
            "text": "fun box last one not an Animal Crossing one I could have it was not an Animal Crossing it it looked like Pikmin there was nothing Animal Crossing about that level there was no Tom Nook out with his little Tanuki shaking face about Nintendo yeah app I don't know the the animal there's just so many games to play on his DS Lite right now library of games it's hard to keep up with them all Vol God dang it you ever worry about your life catching up to you yeah that's the one on the same page it's actually my biggest fear oh okay that are the hers that or the Herps oh **** why you put us watch your you shut out all right language you shut up don't do that **** **** now excuse me if I'm I'm mistaken but there was a man who seemed like a working man maybe he worked in a coal mine or something was in the middle of that course making a big stink with his little pickaxe and I was confused about why he was in the middle of the racetrack he didn't want it looks like it's in the middle",
            "start": 628.44
        },
        {
            "text": "was in the middle of that course making a big stink with his little pickaxe and I was confused about why he was in the middle of the racetrack, he didn't want it looks like it's in the middle of the day, this could be like any day in Anytown USA on a Wednesday afternoon shouldn't you be at work sir? He should; he's out of work 'cause they eminent domain came in and put this track in the middle of his lane. Oh, eminent domain - very good! Which means that I'm going to lose this race in the domain of... oh my God, 200cc might be the first time I've ever used a brake in a Mario Kart; there's a break which one's the break? Remember when you reverse by accident, that's the same. I see Luigi up here, I see a Luigi - Luigi's about to get ****. Remember the Super Mario Bros movie? I just think it's one of those things my damn boy, how does he not get old? Have you seen the chef from that movie recently? He looks really good; what are you up to, oh God? Think they call him Lego... uh, I don't think they",
            "start": 676.92
        },
        {
            "text": "things my damn boy how does he not get old have you I saw the chef the other day that movie in M he looks really good Lego what are you up to oh God think they call him Lego the uh I don't think they call him Lego why you don't know did he play legless no no cuz his name's leg was so you shorten it the Leg oh the Leg I think they call him the Leg the Leg yo the Leg cuz it's got a big D I hate you so much talk **** get shoted damn it Lacka two Lack take Victory we all know it man make me a shirt I wanted that shirt made Nick okay my only goal at this point is to beat Nick you beat me twice yeah you've got it you've already crushed it but I don't know we'll see what the final commu of score is screwed up I still have nine points see you must have finished yeah was like Mario Party they would just give me some like stars I really **** up I really **** up Mario Kart no you did fine you did good you did okay you can redeem yourself now you just keep going we'll do",
            "start": 722.44
        },
        {
            "text": "Mario Party they would just give me some like stars I really **** up I really **** up Mario Kart no you did fine you did good you did okay you can redeem yourself now you just keep going we'll do another one you'll be fine I don't really know how to play the game just gas gas and break can we just play platformer or something like that Mario do that enough please stop one day they're going to create it's both games look him go look at there he is mini games yeah with your plant why didn't they animate the plant just walking on he had what kind of perverse world is this look at this **** place this is what this but I'm just saying not just the course but this world what the **** is everyone doing look at how happy why is everyone racing carts why this young man on a **** caterpillar I'm just really stoked that I came back so hard in Baby Park and it all came right back to me and I destroyed that thing yeah you did got that's what want it for you yeah by by far yeah who got",
            "start": 766.04
        },
        {
            "text": "I'm just really stoked that I came back so hard in Baby Park and it all came right back to me and I destroyed that thing, yeah. You did got that's what I want for you, yeah. By by far, yeah. Who got 10th and Cheeseland though? That was me. Wow, and you still won, yeah. That's not that's not math good job, ladies and gentlemen. That's another let's play here on YouTube.com/KindaFunnyGames, remember we put up a new one each and every day. We just collected 2500 coins so that's sweet, so excited. We unlocked something that's exciting you can see in the next let's play when we play the other piece of the DLC. Tim, how much was this DLC? Um, I want to say it's $13 for the season pass where you get both of them and I think it's $5 for just this few more facts than I thought. You know, wait a minute there's something problematic about this scene Luigi was in the race, yeah. Luigi is also commentating the race, there seems to be a conflict of interest here, a Mario Brother's conflict of interest, and I don't",
            "start": 810.16
        },
        {
            "text": "something problematic about this scene Luigi was in the race yeah Luigi is also commentating the race there seems to be a conflict of interest here a Mario Brothers' conflict of interest and I don't think this is like appreciate it I mean I guess this just goes to show that this victory doesn't mean anything this is poop we're going to have to see the next fine I don't care the next match to see who the real Mario Kart winner will come back ladies and gentlemen tomorrow are we doing back to back what are we doing um you know what we're doing them back come back tomorrow for the second part of the DLC to see who wins it's going to be me spoilers it's gonna be it's gonna be Greg I'm doing is that different song or song that's right fight no that's wrong I know I can't be right oh my God it's a car it's on fire people inside babies eating everybody that's enough what",
            "start": 850.84
        }
    ]
}