{
    "id": 819,
    "video_id": "9kEINN7Kgfw",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Thank You, Bryan McComb!",
    "description": "Your support allows us to live our dreams!\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com.\n\nBuy our shirts! http://www.districtlines.com/kindafunny\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1430523181,
    "duration": 296,
    "transcript_chunks": [
        {
            "text": "hello Bryan McComb it's the cast of Kinda Funny coming to you to thank you for your Patreon support these past three months Bryan you're a good-looking fellow you joined Twitter in July 2011 you've never tweeted this is one of those on just says 42 following nothing else wait why does he look like Matt Damon do you get that a lot that you look like Matt Damon click on the picture click on it he's got he does have a mat literally like how do you like them apples question why is he in the middle of the woods when he's taking that picture who's taking the picture out of the woods yet there's a couple things that this picture looks a little like he looks like Matt Damon which is freaky a little bit but he also looks like he like he may have just finished killing someone in the woods is that what you were thinking I I wasn't necessarily thinking slang yeah slang slang like slanging like his dick into some nasty nasty the good type of nasty nasty though and he's all he take",
            "start": 0.12
        },
        {
            "text": "Woods, that what you were thinking? I wasn't necessarily thinking slang yeah slang, slang like slanging his dick into some nasty, nasty - the good type of nasty, nasty though. And he's all, \"Take a picture of me,\" I could take a selfie but I'd rather you do it 'cause you're naked right now. Seconds after that picture, he was like, \"Who\" and then he just walked out of the wood. He was talking about all right, we found his YouTube page - all right here we go: three subscribers, four Bud. Wait, he posted some videos not too long ago. Worldwide Education - oh so he's actually like, he's actually doing things here unlike us. Not Taylor, hold on uh-oh, Taylor Lee High School in Texas. Worldwide school age children 44 seconds I hear sad music. He must have entered this is some kind of comp basic education Coalition helps school age kids with literacy, critical thinking life skills - they give hope of escaping poverty and despair like Teachers Abroad they go organizations and public to increase support and",
            "start": 35.88
        },
        {
            "text": "helps school-age kids with literacy, critical thinking, and life skills; they give hope of escaping poverty and despair, like teachers abroad. They go to organizations and public places to increase support and funding for quality basic education worldwide. Thanks, Donnie. Did they do this music? It's very sad. Your phone now... your phone's broken. Someone from Hardin, Montana, no; should I get it? That's a call you take. Should I get it? That's Han. Green is that someone who might be potentially going to try to sell me insurance and help by showing support. Don't any Reg my car like \"Hey, you can get registered twice.\" That was an interesting what, and slate... yeah, that didn't quite fit the motif. It was really sad, and they were like, \"Hey, we're just messing with you.\" Well, now he's got one here called Monkey Buffet. Wow, these monkeys are... these fish up; are they going to get eaten by the fish? I think they're going to eat the fish aren't they? It looks like a bunch of Magikarp. Yeah, this looks crazy there's",
            "start": 86.6
        },
        {
            "text": "monkeys are freaking these fish up are they going to get eaten by the fish I think they're they're going to eat the fish aren't they it looks like a bunch of Magikarp yeah this looks crazy there's some Mannequins and Magikarp it'd be awesome if the tables turned and the fish ate the monkeys that my God just gets dragged underneath the water and he's like and the rest of his friends are like we're freaking unless we band together to figure you do me a favor Greg and in the YouTube search type in fish versus monkey sorry Brian hang out for a sec we got to we got to check this out what am I looking for anything is beta fish versus sea monkeys that's not what you're looking for monkey fishing monkey fishing monkey fish where's my doctor can you type in shark versus bear damn I don't think sharks and bears are going to fight can you type in Dirty Dancing and see what comes up shark versus bear catamaran bear I love watching animal fight videos Bear Grylls videos they're just freaking insane man all",
            "start": 139.16
        },
        {
            "text": "bears are going to fight can you type in Dirty Dancing and see what comes up shark versus bear catamaran bear I love watching animal fight videos Bear Grylls video they're just **** insane man all right Bryan thank you for your support on Kinda Funny we hope you appreciate uh what we're doing we certainly appreciate what you're doing for us you let us live this life a silly silly life so thank you for that we're clicking on docs and dog fight oh fun look at these **** fighting they're not fighting they're playing Pory what are they saying P's like that's some racist **** they're saying right now like why doesn't he care he knows they're fake knows they're fake they're not real like 40 God these dogs are so useless no wonder people were throwing rocks at them after World War II why didn't you choose a black one versus the brown one that's the next one Black's the next one even though Christine talks about a dapple every so often what's a dapple it's one where like you've seen",
            "start": 181.88
        },
        {
            "text": "Didn't you choose a black one versus the brown one, that's the next one. Black's the next one, even though Christine talks about a dapple every so often. What's a dapple? It's one where like you've seen them where they like they look like they got like bleach on them and stuff. You're giving Christin way too much power in this dog business here. I'm going to tell you right now, you had a vision, you had a vision, that's a dapple. Do well! First off, can we talk about how cute a dapple Doc is though? It is still black and tan; it's just got the white stuff. I mean, look at that dog! Look at that dog! I don't like it. You donuted it. No, it's weird. I like that a lot. I like how they have a little extra skin on there; they're like old man py in general. I like the hairy ones, I like them. You like the hairy ones, like the long hair ones? Can't do. I can't. They get all over the place much dander. Sorry, sorry, sorry! Sorry, you just get a Pomeranian. No, God no. They're the worst here's why they're bad.",
            "start": 231.52
        },
        {
            "text": "like the hairy ones, like the long hair ones can't do I can't they get all over the place much dander sorry sorry sorry sorry you just get a Pomeranian no God no they're the worst here's why they're bad their mouths are too small to like brush out so you have to have them put like to sleep in order to like get them brushed out",
            "start": 267.4
        }
    ]
}