{
    "id": 25,
    "video_id": "_S-aENPMRv8",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Cool Mint Oreo Cookie Review: Oreo Oration",
    "description": "Can the Cool Mint Oreo hold a candle to the Thin Mint? Let's find out. \n\nSUBSCRIBE / LIKE / SHARE\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review. \n\nCheck out the Oreo Oration playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&feature=plcp\n\nLeave your review of today's cookie as a video response.\n\nLet us know what Oreo we should review next in the comments.\n\nOreo Oration playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.\n\nThe \"perplexing\" image is Gary Storkamp's: http://garystorkamp.deviantart.com/art/Perplexing-Raja-PSIV-59016230",
    "published_at": 1351278010,
    "duration": 235,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to Oreo aeration I'm Greg Miller and while you were out living your life and getting a home loan or whatever the hell you do define people at Oriel we're making endless variations of milks favorite cookie so every Wednesday and Friday I tear open a new package and give you a tasty review with zero calories if you like that like the video subscribe to my channel today we're reviewing cool mint Oreos now here we go this is it ladies and gentlemen I talk to you man episode 1 we did my favorite berry burst now we're in uncharted territory I've never had a cool mint as you know of course you of course are a huge fan of Oreo raishin you know every show begins with the first look oh there it is what see now what is this what is this what the hell is going on I'm already shorted a good three cool mint Oreos not good start but I'll tell you this - now we're talking about first look last time the bouquet from here I can already smell the cool man the quotient quite",
            "start": 3.17
        },
        {
            "text": "shorted a good three cool mint Oreos not good start but I'll tell you this - now we're talking about first look last time the bouquet from here I can already smell the cool man the quotient quite powerful quite powerful of course it looks like you know maybe taking on those skinny mints you might hear or see from from other places ah so let's go taste from these weirdly packaged bet a poor first look poor first look here we go for the taste bit perplexing I'll tell you right now it's perplexing the smell is so strong you expect to be jumping into a thin mint of course I'm making reference to the thin mints but you get in here the smell is really strong you get into the actual biting of a cool mint cookie the taste isn't overpowering it's it's very not there it first doesn't taste like anything won't a clog I'm eating a cool mint Oreo but is there it's there a little bit okay taste not great either let's jump to how it goes with milk again if you're joining us for the first time every",
            "start": 44.82
        },
        {
            "text": "won't a clog I'm eating a cool mint Oreo but is there it's there a little bit okay taste not great either let's jump to how it goes with milk again if you're joining us for the first time every Oreo cookie will take it but how then did the taste how does how did the bouquet how does everything come together with milk it's not such a big part of an order you got to dunk them you're getting them nice and saturated they're big part of saturation well people don't know that no again poor not at not happy with how this is pairing with them again it's just a chocolate cookie we talked about how berry burst you could get hints of strawberry I'm giving basically no mint but then there's a mint aftertaste which is weird not even a regular Oreo also died me eat the mint what is it or you it's got to be one of the other k people not twisting this big part let's see how it whist together here twist a part I guess we say ah come on what is that no kid wants to do I am I'll give a second chance",
            "start": 97.38
        },
        {
            "text": "to be one of the other k people not twisting this big part let's see how it whist together here twist a part I guess we say ah come on what is that no kid wants to do I am I'll give a second chance here this is just this is an abomination of Oreos what is this that they're split it up oh I'll tell you what cool mean Oreos you've made not a fan on the patented Oreo oration scale we go from 0 to 10 10 being the best zero being the worst these I mean I want to say 4.5 I want to give you a 4.5 they're not bad cookies but like I've said they're not accomplishing their goal you're supposed me a cool mint cookie by this we mean minty and great they don't twist well they don't go great with milk four point five the lowest score we've ever had an Oreo ation show - that's how the cookie crumbles for Kuhlman Oreo but what do you think leave your review as a video response below then like the video subscribe to my channel are there Oreos out there that I'm missing I'm sure they are so you need to",
            "start": 145.57
        },
        {
            "text": "Kuhlman Oreo but what do you think leave your review as a video response below then like the video subscribe to my channel are there Oreos out there that I'm missing I'm sure they are so you need to name them in the comments so I know how to get them then share this video with your friends I'll be back every Wednesday and Friday until I run out of cookies to review but until then keep on dunking",
            "start": 197.65
        }
    ]
}