{
    "id": 1094,
    "video_id": "Gcz-O5fn_9Q",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello"
    ],
    "title": "Thank You, Andy Chen!",
    "description": "Andy received this video due to his support on Patreon. To support the Kinda Funny crew go to: http://www.patreon.com/kindafunny or http://www.patreon.com/kindafunnygames \n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1438809499,
    "duration": 277,
    "transcript_chunks": [
        {
            "text": "He's so loud back there, Tim. Does he sound loud? Yeah, cuz he's looking at his fingers like they're like they're fried chicken sticks. What's up Andy Chen? We're driving back from VidCon. We thought we'd give you your thank-you video that we know we're late on. Sorry about that. Kevin's eating a pizza Lunchable now. He didn't want to be mocked for it, which we're not mocking him for it. It's just the fact that he's a smell amplifier now. The entire car smells like a very cheap-ass pizza place. I'm going to tell you this right now: cheap. I was going to make fun of him in the last thank-you video, and boy was I mistaken. He fed me a pizza Lunchable, and I got more than I could have ever imagined in that thing. Yeah, it does taste like an uncooked piece of pizza or a frozen pizza that you thought out but didn't cook. That's the thing about pizza Lunchables and just pizza in general: how desperate we are as a",
            "start": 0.16
        },
        {
            "text": "taste like an uncooked piece of pizza right or a frozen pizza that you thought out but you didn't cook that's the thing about pizza Lunchables and just in Pizza in general how desperate we are as a people to eat pizza at all times they were like **** this one this one isn't even remotely cooked no this is like I went to Murphy's and ate it in the car before I even got home to the oven I don't care was Lunchables a thing for you guys Lun for me yeah Lunchables for us were I mean Nick probably I don't even know they came in a wooden crate but for me when Lunchables came around yeah you it was the ham the cracker and the little piece of that's it but I I remember them I want to say when I was like in junior high but I wasn't no one was eating Lunchables anymore I remember them getting crazy when they started getting too big for their britches I don't remember that I just my my exposure to lunch boxes is as follows there was was a thing that Kraft used to put out where it was about this long",
            "start": 44.2
        },
        {
            "text": "when they started getting too big for their britches I don't remember that I just my my exposure to lunch boxes is as follows there was was a thing that Kraft used to put out where it was about this long and it had two compartments handy stacks yes and it was it was a snack handy snacks handy snack right they eventually made sticks too sticks that was ridiculous so I was like I love this I love the idea of combining like being able to do my own cheese although I always thought that the cheese compartment should be equal to the the the size you were out of it so quick that was it was ridiculous or what I I used to do where I I take you know you take that little red piece of plastic and you put it on in the smallest the smallest thing you can so that last cracker you can just go in there and boom and slather you that's true that's true so anyway I went from to the handies to the Lunchables and then by that time I was like I can no longer uh rationalize eating Lunchables because I am a",
            "start": 83.48
        },
        {
            "text": "boom and slather you that's true that's true so anyway I went from to the Hostess to the Lunchables and then by that time I was like I can no longer uh rationalize eating Lunchables because I am a senior in college yeah I mean once you're in like once you're through High School the Lunchables aren't so much a thing I don't even think in high school you're getting Lunchables I think that's where you should stop right there I think in junior high should be the end of the Lunchable which me really because again I'm a big fan of Lunchables I feel like they're underrated I've never had one myself the food Lunchables all the time Lunchables were gross when you were a kid but it was still the excitement of building building something yeah they were you take it out in the little pieces of ham and turkey have that slime on them yeah but I was a dumb little kid I didn't realize I loved it did you ever get Jif and a Lunchable jipped yeah when you it wouldn't have a Snickers didn't no it didn't have the exact",
            "start": 120.2
        },
        {
            "text": "slime on them yeah but I was a dumb little kid I didn't realize I loved it did you ever get Jeff and a Lunchable jipped yeah when you it wouldn't have a Snickers didn't no it didn't have the exact well now again when we started there was no Snickers in there no no I'm not talking about I didn't know that they're a full meal now there a little bottle of champagne to them I I got last time I had a lunch box I'll be honest with you guys was at Eric Hart's wedding cuz there was a 7-Eleven across the way and we got a little on the Tipsy side after the wedding and then we raided the 7-Eleven and bought every single snack food out him we could and one of my buddies bought the Lunchables and got all the way to the end and only had a like a cracker and a piece of cheese but he ran out of ham so either he miscounted and in a drunken stupor or they jipped them on one piece like like that I can't believe that would happen right that he would have drunkenly eaten two pieces I mean it's possible I'm not",
            "start": 160.92
        },
        {
            "text": "he miscounted and a drunken stupor or they shorted them on One Piece, like that. I can't believe that would happen right? That he would have drunkenly eaten two pieces. I mean it's possible, I'm not saying it's not possible. But the other theory is it's a conspiracy to short everyone their protein, sure, and because they don't want us to be tall and strong anymore, they just want us to be small and weak. We're not going to be weak; we're going to Rage Against the Machine, my friend. The aliens can Kevin **** you, I won't eat what you tell me **** you see has to rage against this machine song yeah Andy thank you for supporting us on Patreon.com Kinda Funny Games getting your thank you video here sorry it's a bit late we're doing our best to catch up we're going to start doing with the car like this we're Nick will one day eventually kill us and we'll have it on camera my wife texts me okay she wants to know what I want for dinner no I'm eating Lunchables and I keep talking",
            "start": 199.96
        },
        {
            "text": "\"Car like this we're Nick will one day eventually kill us and we'll have it on camera. My wife texts me, okay, she wants to know what I want for dinner. No, I'm eating Lunchables, and I keep talking about stopping at Del Taco even though I just ate it at McDonald's. Classic us. That was like 3 hours ago. It was an hour and a half ago, and you're already eating Lunchables? Are you on? He's opening the second Lunchable right now. There's the second Lunchable. Kevin, what he's about to eat is that? You get three pizzas out of each one of these. Well, I mean, he ate one. Yeah, so you want one? No, under no circumstance do I want that. No, they are not good. Andy, don't do it. Thank you.\"",
            "start": 240.96
        }
    ]
}