{
    "id": 1160,
    "video_id": "Tx0PZcwEdGU",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How We Buy Clothes - The GameOverGreggy Show Ep. 91 (Pt. 1)",
    "description": "We discuss how we buy our stunning wardrobes.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1441004400,
    "duration": 1938,
    "transcript_chunks": [
        {
            "text": "You know what I came to realize this weekend, I've realized but I've accepted it now is with clothes, you get what you pay for. You really do. The best pair of jeans I've ever had were $200. Save this for the show, it's true. Oh, I'll do it another day, but I mean no, it's too late now we're started. What's up everybody, this is the GameOverGreggy Show. You bought how much did you spend on clothes this weekend? $500, that's awesome. Because you used to say tell me ahead of time, I think when we first moved in, you like every year and a half, like two years, you actually go out and spend a ton of money on lots of money, way more than $500. But now I'm trying to because I because I I buy your wardrobe, your ensemble, and then you just it just is there and then you eventually look at it, you're like I need new clothes, and so I'm trying to be better about like three times a",
            "start": 2.85
        },
        {
            "text": "your wardrobe your ensemble your ensemble and then you just it just is there and then you eventually look at it you're like i need new clothes and so i'm trying to be better about like three times a year or so adding to it three times a year yeah instead of instead of going instead of going and spending like literally $1,500 like over a weekend where i'm like i need just new everything right like and you just deep dig deep into the bank account because you're like i need clothes like i don't my shit's all messed up my shoes so now like i get new pairs of shoes like a couple times a year and then i'll just go to the outlets i went to the outlet and napa and bought you know my lucky jeans and my banana republic and j crew shirts whatever i'm not going to the real store i'm going to like you know laston exactly but i what i was saying was like how many plaid collar shirts we get oh my god i have so many of them now you know that's my thing i'm well aware i don't wear them so much",
            "start": 46.88
        },
        {
            "text": "like you know laston exactly but I what I was saying was like how many plaid collar shirts we get oh my God I have so many of them now you know that's my thing I'm well aware I don't wear them so much anymore cuz I don't go anywhere I don't feel like I should put up you know but you're to dress up for us cuz do you remember like it might even been before Tim worked at IGN but there was a time where I I dressed more like this every day and then there was a time where I cognizant was like I'm stepping it up good you know and I'm like it was like you said you say that yeah you were stepping up but the favorite part of the stepping it up meant that when you ate lunch you took off your shirt and you ate your undershirt like you were a 75-year-old Italian grandfather I forgot about that and then eating clean up and put it back on I stopped that I I stopped doing that I forgot that I did that so the point is is that you know because I was talking I have a pair of Joe's Jeans, Joe's jeans are",
            "start": 90.04
        },
        {
            "text": "eating clean up and put it back on I stopped that I I stopped doing that I forgot that I did that so the point is is that you know because I was talking I have a pair of Joe's Jeans, Joe's jeans are like really really expensive and I got saying Joy's or Joe's Joe's Jo and they're really expensive jeans and I got them at Nordstrom Rack like for $100 whatever they're $200 jeans sure and they're the best jeans I've ever had like by far and they're like like tight jeans and I'm I can't believe that these that these fit like cuz I I grew up like kind of not caring so much about my clothes whenever and I'd be like I'll just go to all Navy and buy like **** 17 pairs of jeans but they just don't Nothing fits right and so my girlfriend really did convince because my girlfriend likes fashion as as many as many you know women doing men and she was like you know you really do get what you pay for you do like you really do and it's and and I'm learning that as I get older with everything oh yeah",
            "start": 126.2
        },
        {
            "text": "as many of you know, women doing men and she was like, \"you know, you really do get what you pay for.\" You do like you really do, and it's... and I'm learning that as I get older. With everything, oh yeah, you get the liquor you pay for, you get the TV you pay for, you get the meat, like Andronico's, you get it. It's true. I mean, I'm not saying it's always true; I'm just saying generally if you're paying more for something, but there is a threshold where you're paying too much for something. Sure, like Eric always used the example of Eric Castro of uh, you know, like something like really high-end, like Blanton's or Eagle Rare, and then you buy something like Pappy. The difference between those is not as extreme as the difference between Johnnie Walker Blue Label and Bulleit. Sure, sure, sure, sure. So there are differences on the low end too. So it costs a lot of money I spend, you know. I don't... I'm not much of a spender because a lot of people like how do you... you know, people on Twitter like you're buying $200 pairs of jeans and",
            "start": 165.08
        },
        {
            "text": "low end too so it it cost a lot of money I spend you know I don't I'm not much of a spender cuz a lot of people like how do you you know people on Twitter like you're buying $200 pairs of jeans and I'm like you know that's not daily currency it's not even a yearly occurrence really it's just I try to I'm just starting to realize more that you have to kind of step your game up totally oh yeah Nick took me out and bought me jeans and bought me straight up real Levis and I was like **** I look good in these they feel better in these you wear them up by your waist I do but I start there cuz I know they're going to go down below the gut that's a thing weren't you the one who used to make fun of the way the way Greg I don't know what she's talking about P I got to move P cuz it's like first off I'm a fat guy so they're already falling down you know what I mean just cuz that's how they go below the gut but it's just I don't nobody wants the plumber's crack and so the answer",
            "start": 206.88
        },
        {
            "text": "like first off I'm a fat guy so they're already falling down you know what I mean just cuz that's how they go below the gut but it's just I don't nobody wants the plumber's crack and so the answer to the plumber's crack is to go up to where your hip your hip really I mean you're wearing them where you're supposed to wear them well yeah but I mean but no one wears them but look at look yeah see like right there like the fat's already pushing it down like that's not good so you got you got to you got to do the old Chris Farley yeah you get them up there you do that a little bit of a camel toe sure but it's just the B uncomforable though over the it's a lot feels tight I'm packed in and I can get low I can do squats there's no plumber's crack you guys don't understand because you've never been fat you guys are you are you are members of Team Fat that is not in debate like Greg's membership is in debate you're such a dick but what you guys understand is that you've never been without a",
            "start": 248.6
        },
        {
            "text": "been fat you guys are you are you are members of Team Fat that is not in debate like Greg's membership is in debate you're such a dick but what you guys understand is that you've never been without a waistline Now Greg and I and Greg I apologize for this I don't mean this as an insult no now you're going to call me I'm tell me I'm in Team Fat again I like he's he is in that club with me like when I was super overweight you just don't like putting on a pair of jeans especially a pair of jeans that are quote unquote nice and potentially are a little bit more tight than they ought to be or supposed to hug you it's always a nerve-wracking experience cuz you're not quite sure where they're supposed to sit cuz unlike normal people like Tim has a waist right where like the jeans just naturally sits there because it's sandwiched in between his two amazing muscles right like the ab muscles and the ob muscle or whatever it is I don't know the Kinda Funny crew not a scientist but",
            "start": 281.84
        },
        {
            "text": "We discuss how we buy our stunning wardrobes. It sits there because it's sandwiched in between his two amazing muscles, right - like the ab muscle and the oblique muscle or whatever it is, I don't know. The Kinda Funny crew isn't a scientist, but there's an AB muscle and an oblique muscle um, but when yeah, when you're when you've got the muffin top, like I've got, like you just kind of put them wherever they want to go that day and they're never really that comfortable. It's one they're eventually going to get find their way back down there, yeah, they're going to be down there no matter what, and then eventually you get to a place where two or three days later you put the jeans on and you're like oh man, yeah I must have lost a little bit of weight cuz these jeans are fitting a little bit better now. You've stretched them out over the last three days but you don't think about that no, you lost lost a little bit of weight cuz you're working on that protein diet son, protein diet my God, yeah um I will tell you this though I went back a couple weeks",
            "start": 319.72
        },
        {
            "text": "but you don't think about that no you lost, lost a little bit of weight cuz you're working on that protein diet son, protein diet my God yeah um I will tell you this though I went back a couple weeks I don't know I don't know why we're all we're all of the same mind lately cuz I went shopping last couple weekends as well and bought I haven't bought anything lately um and I went into Levi's to buy another pair of jeans cuz I'm like I need another kind of blue pair of jeans the ones I have right now are just getting a little too light and a little too worn cuz you know where all the time and since we go to these like conventions every once in a while we'll do a nice meet and greet or we'll go to a party or something and I kind of want to look a little better so I'm like I'm going to go buy a new pair of jeans and I go in there and a couple things happened one was the Levi's store in San Francisco was a mess, oh the one on Market Street always is that whole area is always crowded it didn't",
            "start": 355.92
        },
        {
            "text": "pair of jeans and I go in there and a couple things happened one was the Levi's store in San Francisco was a madhouse, oh the one on Market Street always is that whole area is always crowded it didn't used to be when we bought we remember we bought the jeans there yeah cuz we went Wednesday afternoon we could if we just knock out over here and go buy jeans right now it won't be that bad so I went in and they had like maybe one new type of Jean and I'm like this is surprising that they don't they don't have different like normally a lot of retailers will every season there's just totally completely different new Jeans but like I went back I'm like I Levis they just five and put a number after it it's like dude not the new 542 I got to know what that is but they're all the same so I was shocked that they hadn't really changed the lineup of the Jean that I that I love which I think believe was a 511 you like the 511 Comm I like the 511 and I'm like oh there might be this might be new but I think I have",
            "start": 389.92
        },
        {
            "text": "really changed the lineup of the Jean that I that I love which I think believe was a 511 you like the 511 Comm I like the 511 and I'm like oh there might be this might be new but I think I have it but it doesn't matter I'll buy it anyway cuz but my jeans right now are so faded it doesn't matter I pick five pairs and I go and I wait in line now there's like 10 people in line and there's only four dressing rooms and I don't know if you guys have ever tried on clothes but Kevin you get that Kevin's on it everybody got he's already moving you see him um this Line's not moving and I'm getting more and more Furious because I look over and there's a little roped off area with 10 more dressing rooms and people are asking like hey can we just go in those dressing rooms real quick and like the like no I'm sorry we don't have the staff like we have to have so many amount of people here to watch because people will steal stuff and things like that finally my and my wife's watching this and she's",
            "start": 430.84
        },
        {
            "text": "no I'm sorry we don't have the staff like we have to have so many amount of people here to watch because people will steal stuff and things like that finally my and my wife's watching this and she's just like looking at her watch she times loses his **** she's like I'm like this is ridiculous she goes oh here we go and in about 5 minutes I was like nope and just drop the jeans on the ground and walked out and I W I just found the first person I was like go get your **** manager which is my new favorite thing to say I'm like go get your manager and the people recently when I say this to someone go get your **** manager the last thing I want to hear after that is is there a problem sir no I'm I'm using the **** FW to you because I'm so Overjoyed with the service and I can't **** contain myself go get your **** manager um so yeah the manager comes over I was like dude it's unacceptable that I wait any longer than like **** five minutes to put a pair of jeans on like I'm",
            "start": 469.12
        },
        {
            "text": "contain myself go get your manager um so yeah the manager comes over I was like dude it's unacceptable that I wait any longer than like five minutes to put a pair of jeans on like I'm like I want to buy five pairs of jeans right now for all you know I only want to buy one um and I can't even try them on and he goes oh I'm sorry sir we'll get a dress for you right now I was like no I'm going to go some place where they actually treat people like they're not cows that are about to be slaughtered and so I went to a designer jean store how they treat cows that are about to be slaughtered well no you get these places you're cattle right like everywhere and this is the big problem I have with San Francisco right now is there's just too many people here too many tourists and too many bums and to be honest I like the bums better because at least they know where they're going like the tourists no idea what's going on they're just here to buy our stuff and take",
            "start": 510.36
        },
        {
            "text": "and too many tourists, and to be honest, I like the locals better because at least they know where they're going. Like the tourists, no idea what's going on; they're just here to buy our stuff and take it back to Market Street. I mean, Market Street's a nightmare - I should know better down there, cuz I have zero patience for people that... and Fisherman's Wharf, just stay away. I had a friend, I had a friend of mine who came up; was a nice couple of friends of mine that just had a kid, and they're like, \"Let's go to Fisherman's Wharf.\" I was like, \"You've got a kid with you and a dog, and you want to go try to navigate that?\" Go ahead, I'll wait for you guys in one and a half hours when you decide you give up on that and come back to my neighborhood. And sure enough, that's what they did. Um, but yeah, any long story short is like, I ended up going to an actually slightly higher-end store, and walked in - not only no, it was not Walmart or Target; the store's called AG, it's not... it's a actually moderately decently priced store, but I walked in and they",
            "start": 545.24
        },
        {
            "text": "an a slightly higher end store and walked in and not only no it was not Walmart Target the store's called AG it's not it's it's a actually a moderately decently priced store but I walked in and they literally remembered me from the last time I was in there like oh hey good to see you again how that had that shirt worked out and I was like it worked out well that's why I'm back at that's that's the thing about getting what you pay for sometimes too is when I went into Levi's which is a good jeans place not like the best but they're good jeans um they the like I I had a woman help me from the moment I walked in there and she like stayed by the dressing room and like was giving me some advice and then rang me up and and stuff like that and then it's like again you get what you pay for it was totally like a flawless seamless kind of thing she was very friendly it was a very good experience I had the totally opposite experience of you at AG but so which one did you go to the one with the",
            "start": 576.72
        },
        {
            "text": "like a flawless seamless kind of thing she was very friendly it was a very good experience I had the totally opposite experience of you at Levi's but so which one did you go to the one with the multiple floors or the one that's just next to Old Navy well there are the one with multiple floors is gone oh is it that's yeah they got torn down like I think they they tore it down yeah well yeah so I guess we went to the same one and I had the same experience with someone who helped me out from beginning to end and I usually get treated like that I'm usually like leave me alone I know what I just I must have just gone during the wrong time but every time I go it must be like peak season for people who want Levi's jeans but I guess that's my thing is it's like I always know exactly what I want going in just like I just buy the same jeans over and over and over is that you look good so it's easier for you when I walk into any place whether it's that or uh Zara",
            "start": 616.68
        },
        {
            "text": "what I want going in just like I just buy the same jeans over and over and over is that you look good so it's easier for you when I walk into any place whether it's that or uh Zara's company why can't think of this Men's Wearhouse uh when I walk in there I know I know but it was just the easiest way to get to where I needed to be point A to point B on that one I walk in there and I'll get salesperson come on and they always do can I help you and I'll go yeah dress me and they always go what and I'm like I don't know put me in things that look good I need to do this I'm doing that you know what I mean like really and I'm like yeah I do that at Nordstrom I do take you shopping that's the thing is you you wore that at that Levi store my wife and I are just going to come with you and we're going to dress you your wife scares me I'd prefer if she didn't come with us she doesn't scare you you met her one in the N years that I I've met her three times in the nine years we've known each",
            "start": 648.84
        },
        {
            "text": "going to dress you your wife scares me I'd prefer if she didn't come with us she doesn't scare you you met her one in the N years that I I've met her three times in the nine years we've known each other and she looks different every single I'm pretty sure Nick Scarpino a random last week last week me and Kevin decided to go to to the district that uh Nick lives in to get some food because there's this place called Barney Burgers it's it's the best thing in the world so we get some burgers hit up Nick Nick doesn't respond to us he's just like I'll get back to you later you no I was on my way to was on my way walking back one in three chance of getting response from Nick when you text I've texted so not true I I immediately respond to you guys you are the worst offender I asked you eight I was like Greg what's going on with how much these tickets cost people can be where you nothing you even were like this dot dot dot and then nothing I didn't know um so we're walking we're like right on",
            "start": 684.16
        },
        {
            "text": "like Greg what's going on with how much these tickets cost people can be where you nothing you even were like this dot dot dot and then nothing I didn't know um so we're walking we're like right on the block of Nick's house and we've done this walk a million times and me and Kevin just talking he's just like hey like what are the chances we run into Nick's wife and like she's around here she's out here somewhere like to be honest with you if I saw her I'm not sure who if if I'd recognize her I'm like yeah she does she like changes her hair all the time and she's always just kind of like doing different **** and he's just like it's kind of like an action figure where there's the different like you know there's detective Donatello and then there's like you know football player Donatello and all that stuff and he was just like all right so we have the you know blonde Nick's wife we have the brunette Nick's wife we have the I'm doing yoga work out Nick's wife and then sure as ****",
            "start": 725.96
        },
        {
            "text": "all that stuff and he was just like all right so we have the you know blonde Nick's wife we have the brunette Nick's wife we have the I'm doing yoga work out Nick's wife and then sure as **** like 30 seconds later we see someone across the street kind looking at us and I'm like hey what's up and then Nick or Kevin's like what and then so like we all talk for a second she leaves she's like oh yeah Nick's at yoga doing stuff I'm like of course Nick's at **** yoga right now and then we go a separate ways and then Kevin's like there's there's a new outfit it's the um I'm it's yoga but I'm doing work like I'm working right now oh she has a Blazer on yeah she was just like she looked legit yoga pants in a Blazer and it was just it was so funny like did you did she talk to you about that yeah yeah yeah she told me she was like oh I saw Tim and and Kevin and I was like she said something about how Kevin's girlfriend dresses him really well she was like I Can Tell She's like I can tell",
            "start": 765.52
        },
        {
            "text": "yeah yeah yeah she told me she was like oh I saw Tim and and Kevin and I was like she said something about how Kevin's girlfriend dresses him really well she was like I Can Tell She's like I can tell that Kevin's girlfriend dresses him and I'm like why is that she's like wait he's she definitely doesn't he looks so cute he looks like he dresses her he literally what when you dress her in Kevin like what do you mean like dresses dresses Kevin's got shouting matches with her she like puts on a hat she's like I look so cute and Kevin's like take the hat off right now like just I'm not going outside with you with that hat on and I'm like I'll be sitting in the room I'm like good Lord Kevin oh my God can we these hats though I mean they're they're insane to be fair they're insane hats but it's like let her wear **** hat Paula's got like she's like an artist man she's got the style like an art style true style you're saying is it I don't know because my my wife's convinced that your",
            "start": 806.8
        },
        {
            "text": "It's like, let her wear whatever hat Paula's got. Like she's like an artist man, she's got the style, like an art style true style. You're saying it's not? I don't know because my wife's convinced that your girlfriend dresses you like uh kind of backwards really. It's interesting. You've been you've been stepping it up lately though, I really appreciate it. I haven't this is literally the same stuff that I've been wearing. He came in today and he sat down in that shirt and he goes yeah this is one of the mild shirts. That's a real story, that's that's a polar problem we have so many free t-shirts you could easily switch in. You got you that's such a blunder if you leave I know you didn't do it but she has to understand it as a rule explain explain what happened Colin all right well so just a back story for everybody watching Kev was assuming this is a topic yeah this will be my topic it's fine Kevin no no it's not like that I don't care I mean okay Kevin came in today said made an off-handed comment",
            "start": 845.36
        },
        {
            "text": "everybody watching Kevin was assuming this is a topic, yeah, this will be my topic, it's fine, Kevin no, no, it's not like that, I don't care, I mean okay, Greg said made an off-handed comment to me about how he his shirt was mildewy and we've all been there before, we put something in the laundry, you forget about it but you were saying that she left it there for like 2 days, that's four times longer than I would say You're supposed like if you're if you for instance if you like before you go to work you put something in the laundry then you put it in the dryer when you get home from work at night, I think that's probably about as long as you should leave that stuff in there because even if it doesn't smell yet it's going to smell when you dry it so two days worth and you're still wearing it which is extraordinary you got to throw that back, Greg said shirts you got to throw that back in okay it's bad you got to it's it's bad this how you're going to get the black lung yeah you're",
            "start": 882.88
        },
        {
            "text": "wearing it which is extraordinary you got to throw that back free shirts you got to throw that back in okay it's bad you got to it's it's bad this how you're going to get the Black Lung yeah you're going to get exactly this is exactly right Got The Black Lung Pop um so that I mean I've I've been there I've done that and I've tried and I've tried to get away with it in the past you know oh yeah you you try to power through yeah it's just like but you you know you smell you can smell yourself people can other people can smell you you guys smell at all no no no I don't think it smells as bad as you think it's it's probably just your skin it's not as bad as it was last week one last week that I was like I can't look at you you got you got you got nice skinny jeans on you got a henley you look like Nathan Drake for Christ sake it's great what' you drop what did you drop some yogurt there on there cuz I I I recognize my Sunset Overdrive shirt I was wearing like yesterday I was just eating",
            "start": 918.0
        },
        {
            "text": "like Nathan Drake for Christ's sake it's great what' you drop what did you drop some yogurt there on there cuz I I I recognize on my Sunset Overdrive shirt I was wearing like yesterday I was just eating yeah I was eating yogurt on the couch playing Mega Man and I was just like laying down it just like I dropped like a huge portion of it on like and I just took my spoon and carbed it all my chest and ate it and then just kept and then just kept playing the game I went out to I went out with my friend last night and uh he was we were at some bar and then this dude was so drunk he was just singing along in the song he was alone and like he just knocked his uh bottle onto him and it was just like pouring down like just pouring on him and he just looked over at me horrified pull pulled the bottle up and just sat there just kept singing pretending like no one saw it and I'm like first off I very clearly saw it second off there is liquid just pouring on you and you'd rather try to pretend to",
            "start": 955.92
        },
        {
            "text": "up and just sat there just kept singing pretending like no one saw it and I'm like first off I very clearly saw it second off there is liquid just pouring on you and you'd rather try to pretend to look cool for a second than just clean it and he didn't he just left it there but hey his b he powered through at least at least is stayed in frankly looked like someone came on my chest I mean you got a money shot on your chest that's what I thought when he came in I was a little drunk Metal Gear Solid he walked in I was like like how long you been in the PJs shot shot so far right up my own chest I was all contorted yeah it was just it was just yogurt but I was going to say I recognize I mean that's either a comot or that's yogurt or salsa Sal green salsa Sal from last night no from today oh okay sorry you got really excited for a minute for re we went out last night and we were in green salsa that he made happen in in true Kevin fashion I was like this salsa is not good the salsa that came with",
            "start": 997.04
        },
        {
            "text": "you got really excited for a minute for re we went out last night and we were in green salsa that he made happen in in true Kevin fashion I was like this salsa is not good the salsa that came with the chips and he pulled out his own salsa out of he jumped up ran over there found the Matador was like hey bro where'd you go Taco Wishes the thing is that it's a taco wh it's a taco train yeah no it's not great it's fine though you know it used to be really good when there was just one in the city yeah now there's like eight and every time I get those tacos I'm just like why is this the driest thing on this planet it's like eating a saltlick you know what I mean we you know I gotta be honest the food might be good I can't judge it awful name just throwing Tacos El Gordo the name why is it awful the only thing I think is awful is that I feel like people might not be able to spell it when they're putting it into Google Maps the Holy Licious thing I don't like it",
            "start": 1039.56
        },
        {
            "text": "Tous aici, the name why is it awful? The only thing I think is awful is that I feel like people might not be able to spell it when they're putting it into Google Maps. The Hol·li·cious thing - I don't like it. It was ruined by a show called Jerseylicious, which was about hairdressers in New Jersey. It was a reality show. I remember this show. So now that's ruined for me forever. You see, even though the girls were kind of hot and in their own kind of way - and their own very tan, delicious way, yeah... Jersey delicious way, mhm. They're tannned, yeah. Oh, yeah. Very tan. They certainly are. There's something... there's just something about Italian women. Oh, yeah. And I think that that something is: you know it's no matter what - don't shake your head at me. Remember, he's Italian. Wherever this is going, he's Italian. You know? No matter what you're in for it. You know what I mean? Like, you're in for it. It might not be tomorrow, might not be for a week... but at some point that's going to explode on you. I know. Just like my...",
            "start": 1083.48
        },
        {
            "text": "know no matter what you're in for it you know what I mean like you're in for it it might not be tomorrow might not be for a week but at some point that's going to explode on you I know just like my yogurt on my chest yeah it's going to it's going to just explode all over your chest you're going to have to you're going to have to deal with it you're going to have to go buy new shirts I know exactly see the problem with the yogurt though specifically was I had I I shove as many like mixed nuts into the yogurt as possible as you know and I had a bunch of I just have whole walnuts that are just way too big like I can't fit any of them in there so like they're like so they're like they're like dripping over the side and the walnut was at the center of oh my God omega in those walnuts I'm trying to yeah I'm just trying to I'm trying to to to eat more walnuts I think that I just really enjoy them they're just really expensive I just bought a bag of walnuts for like 10 bucks today you know crack",
            "start": 1123.96
        },
        {
            "text": "to yeah I'm just trying to eat more walnuts I think that I just really enjoy them they're just really expensive I just bought a bag of Walnuts for like 10 bucks today you know crack they're good for you just you know moderation you have to be careful they're caloric I like calories but they got the good fats yeah good fats well I'm eating a lot of good fats right now with my I put a whole avocado on my salad and a bunch of walnuts and just lettuce and just eat it cleaning out those arteries I need to I can't imagine what my arteries look like especially when there's cheese going on in there especially to take Kevin's pants and roll them into a tube and then look at them that's probably what your arteries look like right now tonight which one I'm going to make for dinner tonight tell me what you think of this okay I'm going to take two tortillas I'm going to put a bunch of cheese on them yeah right yeah sounds good and then I'm going to take six eggs mhm tell me it like a waiter",
            "start": 1161.48
        },
        {
            "text": "you think of this okay I'm going to take two tortillas I'm going to put a bunch of cheese on them yeah right yeah sounds good and then I'm going to take six eggs mhm tell me it like a like a waiter wood oh uh the eggs are uh Farm Fresh from uh a chicken in Napa uh the chicken's name is Fred uh the papers are right here for Fred uh the tortillas are made at a local tortilla shop uh the cheese comes from a dairy over in Sonoma Valley um so I'm going to take six eggs right all over easy three on each tortilla and then wrap like crush the yolk and wrap them really quickly so that it's all and then oh by the way on the tortilla is mayonnaise or mayonnaise and ketchup as well yeah naturally naturally I assume you can just assume you can leave that off because my assumption is there's always mayonnaise and ketchup on anything you do oh my God unless it's unless it's pasta which Cas just great I'm very pure with my pasta very pure with my pasta um yeah I respect that but you know I mean",
            "start": 1197.56
        },
        {
            "text": "mayonnaise and ketchup on anything you do oh my God unless it's unless it's pasta which I'm very pure with my pasta very pure with my pasta um yeah I respect that but you know I mean you're doing good though cuz like the every time I see you eat dinner's fine that's your thing that's cool like my thing I was I like to do like kind of a carb breakfast but good for you man do you feel better I do feel better yeah yeah Clarity of thought you your brain working better yeah how's your ball how are your balls working they working better balls are going look at my shirt you got B Ham um but uh eight times the pressure in those things now by eat some it's a shotgun blast uh no it's good it's good I'm I'm just trying to just trying I'm not even really doing it to lose weight cuz I think I found a pretty good medium for my weight I'm I'm I'm 175 now which is way below what I was I was like 200 my heav so um I'm just trying to eat vegetables like I just like not because I'm trying",
            "start": 1249.2
        },
        {
            "text": "I found a pretty good medium for my weight, I'm 175 now, which is way below what I was - I was like 200 pounds. My height so um, I'm just trying to eat vegetables like I just like not because I'm trying to lose weight but I'm just like I feel like the natural condition of the human is to eat vegetarian green things it is and I feel like my body's just like you gotta do something. But the salad's not I just got a bunch of leafy greens and then I just put like some onion in it cuz I love onions and then just a whole avocado and a bunch of walnuts and just Italian dressing, I just mix it up and eat it - it's fine, it's good for you. I decided to lose 25 pounds; why I decided to do that, I mean like I literally just decided to like in this conversation. Oh wow, I don't think you figured not doing it yet but I told you this before, you know this because you've done it all - you need to stop drinking soda, I will change that's all you got to do; I will do that, you're not going to change, I'm going to do.",
            "start": 1290.44
        },
        {
            "text": "I told you this before, you know this because you've done it all. You need to stop drinking soda; I will change that's all you got to do. I will do that; you're not going to change. I'm going to do it. I will L; that's the only bad thing. This is a limited time offer, that is the only bad thing. You consume everything; it's not true, but this is the worst thing. But of the okay so, but what I've noticed about you is that you eat poorly because you eat food that is not necessary, high in calories and low in nutrients. But you don't eat a lot of it, so like when I see you eat big burritos or Panera Express, you don't eat the whole thing; you'll pick at it, you'll eat some of it, and then you don't have that completion thing that I have in my brain where I'm like, \"This there's still food there, so I'm clearly not done.\" Yeah, like I'm super... no, I mean I'll eat it. I eat a lot; I just don't eat that much that often right? So it's like I only have two meals a day. If you ate four meals a day, really.",
            "start": 1329.84
        },
        {
            "text": "clearly not done yeah like I'm super **** no I mean I'll eat it I I eat a lot I just don't eat that much that often right so it's like I only have two meals a day if you ate four meals a day really small meals and you ditch the coke you you would shed weight so I think I might do that you would shed it it's to be great you got to eat breakfast though I know you hate eating breakfast I hate eating breakfast too but you should get up and have a little something something protein just a pure protein like a couple eggs or something like that just to get your just to get your body started it's important or some yogurt like Greg eats the yogurt every day it's good in protein it's good fats love yogurt um permeates the house it's great uh well I like when he does this the noise like that mixing up yogur noises um I I was eating fruit for a few a couple weeks rather uh it uh no not a couple days but a couple weeks but what I realized was I'm just not I'm just not that into",
            "start": 1371.52
        },
        {
            "text": "up yogurt noises um I I was eating fruit for a few a couple weeks rather uh it uh no not a couple days but a couple weeks but what I realized was I'm just not I'm just not that into it you know like I'm eating I'm not even hungry and I'm eating this **** and so that's why I was like I'm like I'm just I just I'm I'm like maybe I'll buy some bananas and eat but I'm not you know yeah I love bananas well the berries for you though are good though cuz they got those really good antioxidants and they're good for weight loss they're great for weight loss and you can eat them in the beginning of the day or you can if you want a snack at the end of the day is like if you want if you crave something sugary you just do a little bowl of berries and you're good to go it gets worse for me as the day goes on though like I'm not hungry during the day really I'm not hungry in the morning I eat the salad I'm like hungry right now but we've been kind of going for a while but like",
            "start": 1408.8
        },
        {
            "text": "me as the day goes on though like I'm not hungry during the day really I'm not hungry in the morning I eat the salad I'm like hungry right now but we've been kind of going for a while but like the the further in the day I get the worse it gets where I'm like all right where's the mayonnaise where's the beef where's the bacon you got and then and then it's like 10 o'clock at night I'm just shoving **** down my throat you know my personal trainer Courtney lives over in New Zealand you guys have met him a couple times you haven't but you know he remotely trains me and by that I mean he checks me he goes have you hurt yourself yet and I go yes and he goes okay well don't do that again but he recommends eating a lot of protein throughout the day small amounts of protein because that'll regulate your appetite today you had that sad ass meal of turkey lunch meat turkey with a little bit of mayonnaise on it and then two hard boiled eggs bad that was not a great meal and that's not good",
            "start": 1443.56
        },
        {
            "text": "your appetite today you had that sad ass meal of turkey lunch meat, turkey with a little bit of mayonnaise on it, and then two hard-boiled eggs. That was not a great meal, and that's not a good example of what you're supposed to be doing here's why: cuz if you eat too much protein it messes with your stomach, that's why I was immediately in the bathroom after for like an hour and a half, and you guys were like \"are you okay in there?\" I'm like no, I'm not. That's kind of how that conversation went; I think it went a little bit more like: hey Nick, what's your topic for the show? And you're going, \"who's getting Subway? I want Subway.\" Just be like, what the **** are you talking about? Call me. Like, everyone stopped screaming and it was just like good Lord. Because here's what I heard - HCK, Subway. I was like, \"I want you guys to get Subway; I want Subway.\" Subway is so bad, man. I used to really love it when I was... when we were really poor, when we first started working at IGN, we were in Brisbane and there was",
            "start": 1474.96
        },
        {
            "text": "like I want you guys are getting Subway, I want Subway. Subway is so bad, man. I used to really go to it when I was in Brisbane and we first started working at IGN, there was that Subway over there. You could eat lunch there every day for a week and just spend $25. I don't like that Subway, Subway sucks. It really does at the end of the day it's really bad, especially because there are great chains like Quiznos and stuff like that that do it way better. I tell you though, and again you get what you pay for, but Circle K is true. But sometimes I crave like an Italian BMT sandwich from Subway. I don't know why, I just do. I know the bread's not that great, the meat's not that great. It's just a combination of like all those kind of faux meats and cheeses, you know how they put them on there, and everything's like the exact same size and perfect imprint. You're like, \"That can't be\"",
            "start": 1514.96
        },
        {
            "text": "It's just a combination of like all those kind of faux meat cheeses you know how they put them on there and everything's like the exact same size and perfect imprint you're like that can't be **** real that's not a real food well that was the thing right lately they put out something that's all turkey or something like that is it it's I don't I don't know that's something I it's all turkey no that thing I'm like their Italian their Italian sandwich was supposed to be all these different meats but it was just one meat really I don't I mean like that's like totally something I read in passing I I don't believe that that don't know I don't believe that it's all turkey I would be mystified if they chose turkey one of the most expensive meats to put as their product I would think probably be chicken like really crappy chicken but I don't know I feel I I feel like Subway, the one my one problem with Subway as a fan of mayonnaise is I always felt they were judging me",
            "start": 1556.12
        },
        {
            "text": "We discuss how we buy our stunning wardrobes. I would think probably be chicken, like really crappy chicken, but I don't know. I feel, I feel like Subway - the one, my one problem with Subway as a fan of mayonnaise is I always felt they were judging me because I'd be like, uh, you know, I want this, this, this uh can you put a lot of mayonnaise on and they do and they think that's a lot of mayonnaise and I'm like, that's not a lot of mayonnaise and then they put like more on it and they're like, and they look at me and I'm like, that's still not an adequate amount of mayo. Yeah, but I mean I feel like they're going to judge if you have to ask to do more of anything, you're going to get the look of, like, oh no. I feel like it's not a look of judgment, I feel like it's a look of liability, they're like, \"I don't know if we're allowed to give you this much.\" They give me a waiver uh sir can you sign this piece of paper and you're like yes I will get artery uh my arteries clogged Subway yeah sway had all that stuff come out.",
            "start": 1596.28
        },
        {
            "text": "Much they give me a waiver uh sir can you sign this piece of paper and you're like yes I will get an artery uh my arteries clogged Subway yeah saw had all that **** come out to about their bread how they were putting like some sort of polymer in their bread to make it shiny did you guys hear about that was like they fixed that I don't know if it was plastic or something but it was a total ingredient that didn't supposedly hurt you but made it shiny stuff like that so they fixed that um I don't know I'm not a nutritionist so take everything I say with a grain of salt but I see you eating salads and berries and all that stuff and it looks really really good I mean I can tell the difference thanks I'm just trying to moderate you know moderate my body and just take a little bit better care of myself cuz it's this all comes full circle back to the clothing thing you you you blow up like a balloon I don't fit in any of these.",
            "start": 1630.6
        },
        {
            "text": "\"Moderate my body and just take a little bit better care of myself cuz it's all comes full circle back to the clothing thing you you you I blow up like a balloon I don't fit in any of these clothes anymore that's the problem and I went to uh I went to have uh to try on jeans and I was like this is not I've been trying lately to go to the gym a lot more but I keep having these like amazing stints of two weeks where I'm like I'll work out I'll go to yoga I'll feel good and then I'll just be at home with my wife and she'll she'll look at me and I'm like yes I do want goldfish and then I'll just go get one of those giant bags of goldfish and eat the **** out of them like I did Saturday night and then lately for some reason I've been on to the uh seaweed chips you had these things **** that sounds awful are they good or are they bad really good I don't believe it I need a whole package of them every single time I'm a little seaweed I love that **** I'm a night\"",
            "start": 1661.6
        },
        {
            "text": "these things **** that sounds awful are they good or are they bad really good I don't believe it I need a whole package of them every single time I'm a little seaweed I love that **** I'm a night snacker man that's just what I like if I'm sitting down watching a movie or documentary or any show and it's past 8:00 I want there to be a snack in my hand yeah I'm not a b snack guy just don't do it I'm a fan of warm drinks warm Dr Pepper you like like you like those sugary lattes I like lattes you can't drink those things anymore I know yeah that's my thing I just need to stop soda and stop Starbucks that isn't just coffee if you just went to Starbucks and all you drank was Black Coffee my thing be you be super dehydrated but water water and coffee that's it that's all I do yeah yeah I had as a treat I'll give myself and Diet Coke every once in a while just because I'm trying to uh rid my body of aspirin like last night I had like three Diet Cokes cuz we had went to that place that had a",
            "start": 1695.84
        },
        {
            "text": "a treat I'll give myself and Diet Coke every once in a while just because I'm trying to uh rid my body of aspirin like last night I had like three Diet Cokes cuz we had went to that place that had a minimum and I was like well I guess I have to have a couple Diet Cokes $6 those Diet Cokes at the comedy clubs $6 no each yeah the cokes because they had a drink minimum they had a minimum in the club we went and saw Kevin Smith last night at the Comedy Club nice Vue don't get me wrong but they were like we have two drink minimum I was like can I get Diet Cokes and they're like sure but they're $6 a piece and I'm like **** a cold cut combo can't decide which meat you want get them all the cold cut combo is stacked with turkey based Meats ham salami and baloney it's topped with crisp vegetables and sir I think they're saying the other they're all turami and baloney there was a they're all turkey based but none of those that's how do they get away with that it's on it's p it's on their stuff",
            "start": 1735.16
        },
        {
            "text": "and sure I think they're saying the other they're all Turkey and baloney there was a they're all turkey based but none of those that's how do they get away with that it's on its p it's on their stuff like that's where the pig at it's probably better for you I don't know how they care I used to they're sending me a false bill of goods here used to get like a Turkey pepperoni or something like that it was like faux pepperoni that was made of Turkey that makes sense now cuz it's like it's just really dry but it was good Turkey is so dry it's absurd that's why I'm not a huge I like Thanksgiving but it's everything but the Turkey that I like give me everything dry Turkey it's all over oh my all that's where the ketchup comes into play the problem is Turkey Turkey no no not green ketchup interesting yeah ketchup oh yeah did we just have this discussion did I just miss Greg say that exact same thing that's wild to me man that's a good idea mayonnaise Turkey uh sandwiches",
            "start": 1776.68
        },
        {
            "text": "ketchup interesting yeah ketchup oh yeah did we just have this discussion did I just miss Greg say that exact same thing that's wild to me man that's a good idea mayonnaise turkey uh sandwiches yeah I think I'd get punched in the face I brought mayonnaise to the table for like I know was like I was just dolloping in front of my family be like what are you doing my Mna I've always loved Mna a but my like my overboard mayonnaise Obsession only began when I was in college and could buy my own May wanted to do you're like and I was like you just take that jar home with you and you're like you're mine us like a serial killer and that thing's never seen the light of day ever again I used to go to Shaw's and buy like which is a supermarket in New England and buy uh just a big thing of mayonnaise it's like every week like a thing of mayonnaise a pound of pepper turkey a pound of roast beef a pound of American cheese and like two loaves of Wonder Bread and that's like all I'd eat that",
            "start": 1818.96
        },
        {
            "text": "It's like every week, like a thing of mayonnaise, a pound of pepper turkey, a pound of roast beef, a pound of American cheese, and like two loaves of Wonder Bread. And that's like all I'd eat. That sounds great; it was awesome; it was cheap. And that's you know, I'd rather spend my money on you know beer or something like that than food. So I was just that would just feed me, like you know. I'll be honest, there was a while where I stopped eating mayonnaise because it's it's pretty bad for you; it's pretty awful for you. Yeah, there's not really any nutritional value to it, really. But lately, I've just been like, I just want to put a little mayonnaise on something. Yeah, man, mayonnaise is off the chain. You are actually crazy because I'm like, I have this, like, I'll buy this low-sodium no-nitrate turkey from Trader Joe's; it's good, but it's just not very salty. And I'm like, some taste to this. Lately, my wife caught me the other day, and I was eating it, and I was like, \"I do have a jar of mayonnaise.\"",
            "start": 1860.16
        },
        {
            "text": "Turkey from Trader Joe's, it's good but it's just not very salty and I'm like some taste to this. And lately my wife caught me the other day, I was eating it and I was like, \"I do have a jar of mayonnaise.\" And instead of taking the mayonnaise out and putting it on the thing, I just started rolling up the turkey and just dipping it into the the jar. I mean we've spoken many times about how much I like to dip things into other things, and mayonnaise, I think is like one of the the best - french fries, I love it when they give you that little thing of mayonnaise. I wish it was bigger. Oh yeah, but you don't talk the little white thing, yeah yeah. Oh my God, just amazing. You start dipping them in there, you run out and you're like, \"Can I get some more?\" And they're like, \"All right, for money.\"",
            "start": 1895.2
        }
    ]
}