{
    "id": 1082,
    "video_id": "WBHKZCCDG40",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello"
    ],
    "title": "Thank You, Carlo Prospero!",
    "description": "Carlo received this video due to his support on Patreon. Sorry for screwing up your last name. To support the Kinda Funny crew go to: http://www.patreon.com/kindafunny or http://www.patreon.com/kindafunnygames \n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1438810216,
    "duration": 408,
    "transcript_chunks": [
        {
            "text": "thank you Carlo Prospero now here's the thing with Carlo yeah I he was honestly our number two one to do today but when I got to his name I was like Carlo looks like I made a typo maybe he's Carlos yeah and I tried to get the signal here on the road we're driving back from Vicarious Visions which thank you videos uh and I couldn't get the signal so I was like we'll hold them I had a signal there I checked it Carlo was correct but I misfield his name his last name I was so confident and I said there you go it's good checked now it of course makes you wonder did I **** up every other name somewhere I'm sure there's a mess up somewhere in there but let's be perfectly honest anyone who's watched our content for longer than 1 second is not expecting Perfection yeah well Carlo thank you so much for your support 3 months on Patreon of Kinda Funny Games thank you for all your support you let this happen you let us drive the to Nick is intent on killing us he's like oh let me hold on he's driving with his knees",
            "start": 0.08
        },
        {
            "text": "3 months on Patreon.com of Uncharted games thank you for all your support you let this happen you let us drive to Nick is intent on killing us he's like oh let me hold on he's driving with his knees digging through for **** cables that I can easily do texting his wife I think I shot he's booking Fandango movie tickets every you want to text my wife is that what you're trying to say I will do I when I'm in I feel like I have to be the assistant of the driver so anything you want you just tell me and I do it I didn't know that I respect that that's why I keep offering asking you can I help you can I do things can I do you're like no got I got it huh so many windmills well that's how we get our power now didn't you know we're out of water so we went to wind as a power source look at that broke ass one that isn't moving that one's stupid you guys think the wind drop's going to start right now did you see the Kickstarter for the the it's for one of those things but it doesn't have any turbines",
            "start": 39.96
        },
        {
            "text": "ass one that isn't moving, that one's stupid. You guys think the wind drop is going to start right now? Did you see the Kickstarter for the thing, it's for one of those things but it doesn't have any turbines on it because they're apparently worried that it's killing birds so all it does is oscillate and create energy. I could still kill a bird if the bird flies into it, look, if the bird Dum bir, yeah, look at these spitting things, I'm going to fly right at them. Birds fly into windows all the time, I never understand how birds like they're so good at dodging cars, yeah, yeah, isn't it weird? You think you actually run them over and then you see them fly away, get out. How did you see there was this thing on Reddit the other day of this uh uh mama duck with all its baby ducks trying to pass the freeway and like it almost caused like all these accidents but it got all the babies across alive, like damn right, so if I had seen that part of my brain would have been like I",
            "start": 76.64
        },
        {
            "text": "trying to pass the freeway and like it almost caused like all these accidents but it got all the babies across alive like damn right so if I had seen that part of my brain would have been like I gotta kill these things accelerate through them this is stupid this is a survival of the fittest if I've ever seen it before in my life I would not recommend doing that but that was my thing my initial reaction was oh my God don't hit the birds and then I saw all the near misses crashes were I was like damn that's a hard decision I guess you got to make at some point I had a friend once when we were driving ride in high school driving and a raccoon came out and he hit the raccoon and I remember he was like he freaked out of course he oh my God and my my the only yeah what no the guy the guy who hit the raccoon the raccoon didn't say anything raccoon was like I really want to get home and wash these grapes and then it was hit uh he hits raccoon cuz raccoons love grapes what I didn't know",
            "start": 120.12
        },
        {
            "text": "who hit the raccoon the raccoon didn't say anything raccoon was like I really want to get home and wash these grapes and then it was hit uh he hits raccoon cuz raccoons love grapes what I didn't know that I I guess that's just something I'm hung up on from when I worked at The Wildlife Reserve yeah yeah the raccoons there we give them grapes and they walk cuz they have the little hands when did you work at a wildlife preserve I was a volunteer I was a volunteer in high school times I guess that's really cool I didn't know that but they wash the grapes a little but it's so cute cuz it looks like to them they're washing like a watermelon you know what I mean oh like scale wise spinning them around so every time I see a raccoon I imagine them think got grapes that's like their thing to eat at there was there was one time when me and Kevin were driving we went to this uh like weird Mountain thing that I found and like went there just to look at the view yeah there was a really cool",
            "start": 160.04
        },
        {
            "text": "eat at there was there was one time when me and Kevin were driving we went to this uh like weird mountain thing that I found and like went there just to look at the view yeah there was a really cool view and I was like we got to go look at it it was like 1:00 a.m. you found a mountain yeah and then uh we we found it then we were driving back one the first ones and as we were driving back we're on this little oneway Street like you know not even one way it was a it was it was a two-way street but there was only one lane so you have to do that whole thing where you like pull over to let the other guy go by do you guys know what I'm talking about big yes yeah so if he's coming this way you're going that way you got to pull over and yeah like the hill there was no one on the road except for this one car blocking around way and we're like why the **** is this car blocking our way and we go we look there's this pome that was just playing chicken with the car and he was not letting us pass",
            "start": 199.04
        },
        {
            "text": "one car blocking around way and we're like why the **** is this car blocking our way and we go we look there's this opossum that was just playing chicken with the car and he was not letting us pass he just had he was planted down looking at the car and he was just like arms out yeah he had his little arms out looking like he was about to **** beat the **** out of this car so did you get out of your car to look you drive we like we had to just pull it around and like went some other ass way but it was like a very it was scary man opossums are really intense no you just turn off your lights and the possum will just go back and run away I don't know about that not this dude no it was definitely night it was 1: in the morning why are you guys going to make out point at 1 in the morning what were you guys really doing there it's okay it's a safe place when I when I grew up I had dogs in my and with this big backyard my dogs there would always be a possum that was",
            "start": 237.76
        },
        {
            "text": "at 1 in the morning what were you guys really doing there it's okay it's a safe place when I when I grew up I had dogs in my and with this big backyard my dogs there would always be a POS that was sitting on top of uh the fence and so the dog couldn't get to it and so dog would wake us up because the dog would start barking and like furiously like trying to rage at this thing and it would just be sitting there looking at it so my mom inevitably in a pissed off state that is very indicative of my mom would come out with a broom and just push the possum off the fence it's like a 12ft fence she just like hit the thing and it would pop off and I'm like M I think you just kill that opossum she's like well that opossum is totally fine that opossum would have been fine I'd be more afraid of that opossum grabbing the **** brim and come right at you I mean they're not are mean little bastards you guys ever see the Goofy Movie no no really no yes I've never seen it it's upsetting scary ass possums",
            "start": 284.2
        },
        {
            "text": "grabbing the brim and come right at you, I mean they're not are mean little bastards. You guys ever see The Goofy Movie? No, no, really, no. Yes, I've never seen it. It's upsetting, scary ass opossums in that thing. Pumas are scary; they use their tails. They're scary, man. I don't understand what they use their tail for. Baby possums use their tails to grab things. You can't kill the baby opossum on that's terrifying. I know it, like, mostly killed it. I had to finish the job. Thank you, Carlo, for all your support on Patreon.com ofun games. You guys all this stupid stuff to happen and hear weird stories from the wildlife life preserve and the broom possum fight Mrs Scarpino versus the opossum. How do they... they have a little fountain; they wash him in like stream reans wash their food. They're cleanly animals. I didn't know that, yeah. Except when they eat trash, that's yeah, you know. I was thinking about that, but yeah, no. They wash the food in the wild. That's crazy. Really cute. I'll find you a video when we get back to cell.",
            "start": 322.84
        },
        {
            "text": "yeah except when they eat trash that's yeah you know I was thinking about that but yeah but no they wash the food in the wild that's crazy really cute I'll find you video when we get back to cell service all right I always thought of them as vicious animals but no they you don't **** with raccoon for sure yeah I don't get near them yeah you shouldn't you guys should definitely YouTube raccoons they're funny as **** we spent 2 hours we spent like 2 hours one time watching raccoon videos they're so cool did you get did you get any of them washing things I mean I can I know what you're talking about though okay good I've never seen that but like I can imagine them with their stupid hands stupid hands they're very cute hands thank you Carlo",
            "start": 370.08
        }
    ]
}