{
    "id": 796,
    "video_id": "gVF7BY4K4LQ",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Will There Be A New Vita? - Kinda Funny Gamescast Ep. 17 (Pt. 2)",
    "description": "We discuss what we want from a potential new PlayStation Vita.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1430226005,
    "duration": 1000,
    "transcript_chunks": [
        {
            "text": "all right moving on topic two but before we get into that let's do another one of these uh what's sponsorship number two Greg you want another ad yeah this is me changing the game uhhuh ensuring our future here is AD number two okay this looks like ad number one Greg it may it may look like that is it not again yeah just read read read it again okay ladies and gentlemen again we are sponsored by ProFlowers.com it's a website where you can go and uh get flowers for your mom or your girlfriend it's Mother's Day coming up so you should do yeah you could really do it for anybody don't forget the part from the first ad where yeah send Kevin flowers get it for Kevin get it to get it he got he got Kevin just used this ad he when we were doing the show Kevin Went to Pro Flowers he clicked on the blue microphone he put in Patron to get the hundred blooms for $20 and the glass vase no no no no no you do that but you do go to visit you visit ProFlowers.com",
            "start": 0.31
        },
        {
            "text": "on the blue microphone he put in Patron to get the hundred blooms for $20 and the glass face send him to his favorite corpse no no no no no you do that but you do go to visit you visit proflowers.com you click on the little blue microphone in the top right corner type in Patron and then if you do that before Friday at midnight you get 100 blooms with a free glass vase send it to whoever you want and that'll be really fancy now I I got a lot of proflowers.com stories do you I honestly do I honestly do I had a long-distance girlfriend for like a million years this all that's all in my life so you are a pro of pro flowers I am a pro of Pro Flowers a patron if you will um but yeah I would it's a really easy to use website and you can set it wherever you want which is awesome and it's like you can choose the delivery date and all that stuff and it's like you can really set it up down like a specific time my time the question about this for this and this is this is nitty-gritty on this",
            "start": 50.0
        },
        {
            "text": "can choose the delivery date and all that stuff and it's like you can really set it up down like a specific time my time the question about this for this and this is this is nitty-gritty on this you have the details in front of you so you have to order this you have to redeem this by Friday yes of next week or Friday when this breakout goes up but this whole show goes up not the Patreon ear the episode can I can you set this for like three months from now can I oh yeah no **** really really yeah all right I'm pretty sure I'm gonna redeem this like five times to just plan on every birthday for everybody I yeah know I mean it's it's it's really smart you can do that stuff and the the flowers are guaranteed to be fresh and beautiful for at least seven days yeah so that's good and I can vouch for these flowers too because like they they were great every time I set them I got nothing but compliments and it worked out for me and I'm glad that they stay fresh uh for seven days which even",
            "start": 93.16
        },
        {
            "text": "for these flowers too because like they they were great every time I set them I got nothing but compliments and it worked out for me and I'm glad that they stay fresh uh for seven days which even though the the the corpses that Kevin will be sending the flowers to have all the time in the world at least the flowers will be would be beautiful nice but yeah and uh you get to choose the Del date you want and it's guaranteed so that's awesome all right again ladies and gentlemen proflowers.com little blue microphone up in the top right you go there and then bam type in Patron you get your 100 blooms one more one more when you're ready today oh man I'm ready I wonder what it is I wonder we'll see but all right so topic number two today now this one this one's very important to me it worries me I want to I want to know you guys' opinions and I want to know yours also very specifically Alfred thank God you invited him to the show I know right new Vita design trademarked in Japan it's happening",
            "start": 133.64
        },
        {
            "text": "I want to know you guys' opinions and I want to know yours also very specifically Alfred, thank God you invited him to the show. I know right, new Vita design trademarked in Japan, it's happening everybody! Happening, va-va-va-va-va! Oh **** **** am I excited for this? You kidding me? The you've seen the designs, though. So what happens here? There's this little design... Have you seen the specs on this? Not Tex spec, but get ready to **** throw your second PC out the **** window; you won't need it. Yeah, listen to this: all right, there's blueprints. It looks like there's an HDMI port on it, that's intriguing - HDMI out. Okay, okay, lay the big one on it. It's described as a portable LCD screen game machine controller. That's not the big thing; that's how the big people talk. And it's very similar to the 2000 model. Are you talking about the shoulder button? Yeah, L2 R2, there's a shoulder button. Yeah, it's happening, buddy! The new Vita has additional two of them, not like this - they're more like... are they behind?",
            "start": 176.84
        },
        {
            "text": "to the DualShock 2000 model, are you talking about the shoulder buttons, yeah L2 R2 there, shoulder button, yeah, it's happening, buddy. The new additional two of them, not like this, they're more like, are they behind each other, yeah, it looks like it. So okay, I was looking at the picture and I'm like, I heard you guys talking about this, I didn't see that there's a button that there's buttons, the L1 and R1 buttons look like triangles, and then behind it are the normal triggers, it looks like from what I was pulling, I'm pulling up a schematic. Interesting but I mean we don't know, I mean they're not nothing's trademarked, it's like the DualShock that broke into two things to be a move, like I don't think it's permanent, it's not necessary, no, I I think this is, I mean I think this is going to happen but the um and we've been talking about this for a while, like V is still viable for Sony and I think that they're making money on it, I think they have to continue to reduce the cost of what it costs to manufacture V is",
            "start": 226.6
        },
        {
            "text": "been talking about this for a while like PS Vita is still viable for Sony and I think that they're making money on it I think they have to continue to reduce the cost of what it costs to manufacture um PS Vita is doing exceptionally well in Japan um so even if they were just going to release 3,000 in Japan they would sell a few million of them probably so I think it's probably worth it uh for them to continue to make vita and it's it's good that you know they're doing the unintuitive thing again which is like people think they should abandon this system and they're not going to um and they're they really are putting their money where their mouth is this is real Sony did put this through the patent office in Japan so it's not like a a hoax but Greg's Greg's point is is well taken which is that they do this with a lot of **** um but uh I wouldn't be surprised I've been saying for a long time that I don't think we've seen the last of PS Vita that like there'll be another redesign um and we'll see what",
            "start": 269.84
        },
        {
            "text": "this with a lot of **** um but uh I wouldn't be surprised I've been saying for a long time that I don't think we've seen the last of V, that like there'll be another redesign, um and we'll see what happens. Alfredo, you do not own a Vita, correct? I did at one point in time really yeah I don't even know about that when it first came out all right yeah well what would make you want to get it again games that me yeah and just right now there's none there's there's just not a I mean charted Golden Abyss but that's like a super AAA title for R, I don't really know if that's something that they're still going to continue to do which yeah exactly looking at Colin no so I mean like yeah games that entice me you know if you if you have them I don't know if you have a library of games I'm just like H what that is I don't know yet I mean have you have you played any of the first person shooters on Vita yeah back when it was like the first Vita it was like it was uh Call of Duty, Call of Duty",
            "start": 307.52
        },
        {
            "text": "H, what that is I don't know yet. I mean, have you played any of the first-person shooters on Vita? Yeah, back when it was like the first Vita, it was like Call of Duty and Resistance: Killzone was really good. Killzone was good; some weird like robot game too or something. I don't know; I forgot, but it was just... it didn't control well. It doesn't have to be a shooting game. Like I play a lot of just different games in general now, but they have to have a library of games that I care about. Yeah, you have that. I will; I will play. Not that it doesn't have a great library right now; it does. They're just not games I feel like I want to play. That's understandable. You're allowed to say that. Yeah, you're not just allowed to say that. There's a different library. Bitter huh? Nothing... uh, we have breaking news today. This is 21 minutes old from IGN.com: New PlayStation Vita not coming after all. Just yesterday, a trademark surfaced for what appeared to be a newly redesigned model of the",
            "start": 350.16
        },
        {
            "text": "We have breaking news today, this is 21 minutes old from IGN.com: New PlayStation Vita not coming after all. Just yesterday a trademark surfaced WR appeared to be a newly redesigned model of the PlayStation Vita; however, that doesn't appear to be the case after all. According to DualShockers, the then Japanese text in the trademark actually refers to a positional change of an element within the product rather than a modification of its design. As such, Sony's field filed request isn't in reference to what many assumed to be the hypothetical Super Slim Vita 3000. According to Sony's full trademark listing, the registration is actually in reference to the three-dimensional position of the face buttons, not the shape or general form factor of the console itself. So now I have to zip this back up; I don't know because I don't necessarily know if that's true. I mean, I'm sure that this part is true with the Japanese characters; um, we'll see what happens. The big well",
            "start": 389.72
        },
        {
            "text": "I don't know because I I don't know necessarily know if that's true I mean I I I I'm sure that this part is true with the Japanese characters um we'll see what happens the the the big the big well because the big thing is that the schematic shows an HDMI port clearly at the bottom of the of the unit that that could be mistaken for the power port on PSVita 1000 but that is a picture of the 2000 because that has a circular start and select buttons um and that Port doesn't appear anywhere on the V just the dev kit right yeah that's the thing a lot of people don't know is and that's why Sony I think is shy about showing Vita Dev kits is the Vita dev kit has always had an HDMI out always like you can just plug your Vita into a TV and it's done and for some reason Sony doesn't want that to be shown or put into a normal Vita um but this is the thing I was talking about was um the shoulder buttons this is the bottom of the unit so there's there seems to be like an new divots here you",
            "start": 434.84
        },
        {
            "text": "or put into a normal normal vas um but this is the thing I was talking about was um the shoulder buttons this is the bottom of the unit so there's there seems to be like an new divots here you know what I mean so these were the things we were talking about maybe it's not going to come out or whatever the bigger question though is is is Vita still viable um to have to have 3,000 and I think that it absolutely is it's just it's just you have to control your expectations you know Vita is never going to just Sony's crazy enough to do this I've said that many times they kept pouring money into new PSPs when nobody cared about PSPs and they finally started caring about PSP they're a very unpredictable company dude like they they do the unintuitive sometimes it works and sometimes it doesn't and I've said that for years since we were doing podcasts beyond I said that like Sony's everyone's like well there be another Vita and I'm like I like a Vita 2 and I'm like I'm like Sony is crazy enough to do it",
            "start": 479.88
        },
        {
            "text": "that for years since we were doing podcasts beyond I said that like Sony's everyone's like well there be another V and I'm like I like a Vita 2 and I'm like I'm like Sony is crazy enough to do it I'm telling you they're **crazy** enough to do it you know like whether or not they will or not they're the company most likely to do it um so this this made sense to me I still think that they will re-manufacture new Vitas and make them cheaper get rid of the back touch pad and all that kind of stuff that'd be awesome um it would it would it would render a lot of games inert nobody cares um but it doesn't matter little and large can go suck a dick nobody cares let's get this thing get two shoulder buttons on each side let's get rid of the back touch let's tell everybody to stop making front touch games let's make the interface more like the PS let's just get let's just make it let's just make it a mini PS4 per se I want I mean I want a new Vita I've been wanting one I've been wanting a",
            "start": 520.8
        },
        {
            "text": "let's make the interface more like the PS let's just get let's just make it let's just make it a mini PS4 perer I want I mean I want a new Vita I've been wanting one I've been wanting a redesigned one I'm one of those guys that's just going to keep **** waiting they're never going to make the buttons big I know they're never going to make the goddamn buttons bigger and that's so upsetting they can't really be bigger I mean the circumference of the buttons I mean wait how how would they become bigger I wanted to just be as big as it was in PSP that's it I don't feel like they're that far off they are extremely far off I don't think so they they are these are like the size of the 3DS the were the PSP Go buttons the same size as the VA buttons like are they I'm sorry PSP 3000 PSP Go I don't know about PSP Go those were like super tiny and like I have a p go over there where I could right now settle this compare it to a Vita I don't know if it's not worth it I think it is",
            "start": 554.96
        },
        {
            "text": "PSP Go I don't know about PSP Go those were like super tiny and like I have a PGO over there where I could right now settle this compare it to a Vita I don't know if it's not worth it I think it is when somebody starts installing in Vitas around here saying the buttons are different than the buttons well they're they're definitely not like the PSP buttons the OG PSP PSP-1000 yeah I know you're talking about yeah I remember the OG PSP it's awesome those buttons are magical that is a great unit they're good damn good I want that all I wanted was a PSP with the OLED screen and what did they do they took that from me Greg they gave little tiny little little girly buttons on the the the Vita there's some everyday sexism hashtag they have tiny hats that's how you hashtag right you put at the end of the hashtag everyday sexism hashtag so then then then they make the 2000 they're like all right Tim we're going to make it Slimmer which is cool we're not going to fix your button issue",
            "start": 591.68
        },
        {
            "text": "the end of the #EverydaySexism hashtag, so then they make the 2,000, they're like \"all right Tim, we're going to make it slimmer\", which is cool, we're not going to fix your button issue when we're taking away your screen, oh yeah, we're not going to sell the original one anymore. I hate you all, you're all here's the problem with the OLED screen, everybody just drank the Kool-Aid on it, so like in IGN's article they call it \"not no mention of\" They're bringing back the gorgeous there is mention, no that's what I'm saying, oh no, I'm well what I'm saying is there is mention cuz they say it's a portable LCD screen game machine controller, yeah no no no no no you're getting caught up in the facts here, I'm saying that everyone in the gaming press in the echo chamber is hung up on this OLED screen being gorgeous and all this amazing things, you didn't play any of the games, you don't even know so you can shut up right now",
            "start": 635.2
        },
        {
            "text": "press in the echo chamber is hung up on this oled screen being gorgeous and all these amazing things you didn't play any of the games you don't even **** know so you can shut up right now and so then like just come it's not like you're **** going from a wide screen 50 in in your hand to an original Game Boy screen like everybody flips out about the new Vita screen you don't even know missing it's great just buy it just get on board Tim, I'm importing it. I'm in it for like the the that's what I like about it is I like it you like about it so much you waited four years not to buy it yeah no exactly and I mean we already know I have my other issues with it where's Crash Bandicoot well that's not on them you can't you can't hold that against a big I do and these are licensing issues which goes back to our digital thing I have problems with that but still I could look past it there is other games that I do want to play most of them PS1 Classics but still I don't want to play them on the oled screen with a big",
            "start": 671.16
        },
        {
            "text": "digital thing I have problems with that but still I could look past it there is other games that I do want to play most of them PS1 Classics but still I don't want to play them OLED screen with big buttons and people are going to be like you know what well you don't get what you want Tim Gettys I guess you're right I get an HDMI port which is awesome I'll give them that if those are buttons are shoulder buttons all right that's getting me closer I would buy that yeah 100% if they made this I'll buy it yeah what you H up what youing I'm I'm reading so the DualShock story is actually pretty interesting these are the guys the guys over at DualShockers actually broke the story about why this is not real um and it's saying basically that yeah the positional kind of nature of like the dashes mean that those are all the unchanged elements of the original VA that the triggers are not actually there this is basically a reproduction of the 13g port or model um I don't know it was exciting even when",
            "start": 709.84
        },
        {
            "text": "those are all the unchanged elements of the original VA that the triggers are not actually there this is basically a reproduction of the 13g port or model um I don't know it was exciting even when it lasted the whole story yeah uh but nonetheless I was thinking about with Alfredo specifically with Vita I don't think Vita will appeal to you because Vita is a PC uh in a lot of ways it's put it's it's a lot of PC first indie games so if you're already playing on Steam there's really no reason for you to go be on Vita Vita is awesome because like I what people hate about Vita some people hate about Vita is that it has no AAA games what I love about it is it has no **** tria games it's a it's a great place to play smaller downloadable games I love it I **** love it if you and and that's and that's what it's you know we'll get Freedom Wars 2 and some other stuff probably but the AAA stuff is is dead U but Vita lives um and I'm all about that I want to play those games and that's what",
            "start": 749.84
        },
        {
            "text": "that's what it's you know we'll get Freedom Wars 2 and some other stuff probably but the AAA stuff is is dead U but Vita lives um and I'm all about that I want to play those games and that's what I'm saying like I If there is a third version I will just buy it cuz I give up at that point there's not going to be a fourth that I want what if they come M at 3 and they're just like we here's the new Vita and it's got huge **** buttons if they come out they're like Tim here's the Tim Edition boom oh I'd P I would pay a lot of money for it man yeah I honestly would if they were to just give me the exactly what I want I would pay like $400 for it damn it's how much I want it do you want the shoulder buttons do you want R2s yes definitely yeah that would be so great for um remote play that would be like the thing selling Remote Play Everybody that' be awesome I just don't think they can really practically do it no probably not but I don't know we'll see Vita trucks along they're still",
            "start": 793.92
        },
        {
            "text": "would be like the thing selling Remote Play Everybody that' be awesome I just don't think they can really practically do it no probably not but I don't know we'll see PS Vita trucks along they're still making them games are still coming out I've said it before and I'll say it again there are more announced Vita games than there are for any other platform so um whether or not half them will make it to Market remains to be seen but sure um yeah Vita is I I like that the 3000 announcement even if it wasn't real in the end sparked the new conversation about Vita yeah with a lot of people and a lot of Shu saw it he hears you Tim good sh here all but you know the OLED screen getting rid of the OLED screen and shrinking the system was was a was a was a necessity to get the cost down and that's why I think that 3000 will if this is not it and it looks like it's not that they will make a new iteration of it that makes it even cheaper yeah that I think you'll see for sure they keep like I said they",
            "start": 831.56
        },
        {
            "text": "that 3,000 will if this is not it and it looks like it's not that they will make a new iteration of it that makes it even cheaper yeah that I think you'll see for sure they keep like I said they kept redesigning the PSP I'd imagine they redesign I mean PSP was murdering the PS Vita but sure yeah sales um it's not even close it's like probably like seven to one lifetime sales but so obviously they kept pushing the they need that destination PlayStation event like PSP head but I think they read the tea leaves a little bit wrong with psp2 we've discussed this in the past PSP was a home brew machine for a lot of people they weren't buying games so you know I would say you're right I would say half of PS the PS i I'd straight up say half the PSPs that were sold were were sold not to play PSP games um that thing was so cracked wide open that's why to this day my PSP my OG day one PSP is probably my favorite system of all time just based on what it's done for me I love that thing",
            "start": 871.08
        },
        {
            "text": "um that thing was so cracked wide the **** open that's why to this day my PSP, my OG day one PSP, is probably my favorite system of all time just based on what it's done for me I love that thing I can play any game I **** want on it I can play PS1 games I can play Super Nintendo NES Genesis all the Game Boy holy **** to their credit though Sony did shut down with firmware PP a lot of the PSP stuff you have to use old firmware which you can it's not a big deal um but no one's cracked VA and and that and that's and that's pretty remarkable big issue I have with it like people people people have gotten close to cracking it and all they like Sony really did manufacture a handheld that is like seems to be uncrackable if they if they cracked it I would have got it or just nobody cares enough to try to people people are trying they're trying hard I keep up to date on that cuz the moment they crack it that means I can buy Crash Bandicoot off the EU store and I'll be perfectly freaking happy",
            "start": 906.08
        },
        {
            "text": "to try to people, people are trying, they're trying hard. I keep up to date on that cuz the moment they crack it, that means I can buy Crash Bandicoot off the EU store and I'll be perfectly freaking happy but until it's pretty, it's you know that PSP's the crackability of PSP was interesting to a lot of people but it also held the PSP back I think from like we couldn't get trophies on PSP for instance because of it so hurt it hurt yeah it it did it did end up hurting like what PSP could have been like when they announced it there they wanted to do trophies for PSP and they're like we can't because you can just break the **** **** out of the the hand I like that sucks yeah you know so it's almost good that it's almost good that the ecosystem is is confined and contained and secure at least right now I'm sure someone maybe one day will break it when they stop updating it yeah when they no longer make it anymore they'll probably you know then it'll be the machine Tim wants M I can only hope",
            "start": 948.0
        }
    ]
}