{
    "id": 773,
    "video_id": "U_3x0dKFg5A",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Chloe Dykstra",
        "Colin Moriarty"
    ],
    "title": "Star Wars Battlefront PS4/Xbox One Impressions - Kinda Funny Reacts",
    "description": "Chloe Dyktsra's seen Star Wars Battlefront in action, so it's time for Greg and Colin to ask her all about the November 2015 title!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nFollow us on Twitter!\nChloe - http://www.twitter.com/skydart\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1429285668,
    "duration": 786,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to Kinda Funny Reacts we're talking Colin yes about this Star Wars Battlefront that's been rumored forever I heard I heard a thing or two about that game did you know here's the thing they they announced it down at Star Wars Celebration down in that Anaheim area that LA area and you and I we're not allowed down there we can only get to Anaheim once a year and we go for VidCon that's all that's the only time we'll ever go so instead everybody we sent Chloe Dykstra hello hi guys hey how are you I'm good I I just saw Battlefront tell us all about it what is it what is it it's got be a top down real-time strategy game I assume yep that's exactly what they're going for um well it was uh it was really good I was really excited I mean even the booth itself was like a Marvel um it was really fun it was sort of what I expected but a little bit better right so uh you guys remember the uh old footage from the old attempt at Battlefront 3 right yeah so",
            "start": 0.12
        },
        {
            "text": "was like a Marvel, um it was really fun, it was sort of what I expected but a little bit better right, so uh you guys remember the uh old footage from the uh old attempt at Star Wars Battlefront III right, yeah so it's kind of like a really really upgraded clean version of that, um we kind of got to see a little bit of gameplay that was um it was pre-alpha PS4/Xbox One gameplay and it looked really good, um it was a really clean HUD, uh we were running around on Endor I think there were Ewoks though I didn't see any, there was a Wilhelm scream it was hilarious, uh and then um and then Darth Vader showed up no really yeah yeah it was it was pretty damn cool, um so I had a good time I had a good time did they talk about like what's happening where it is in the universe like I mean Vader's spoilers Colin yeah Darth Vader dies in the Star Wars sequel trilogy oh I heard about that I know I don't know I just want to know I where is this all happening uh I believe it's basically everywhere so it's kind of I mean it sounds like they basically made the",
            "start": 39.04
        },
        {
            "text": "Dies in the Star Wars Battlefront on PS4/Xbox One, I heard about that. I know, I don't know, I just want to know where it's all happening. Uh, I believe it's basically everywhere. So it's kind of... I mean, it sounds like they basically made the game that everybody wanted and everyone has been asking for. Um, all sorts of different battlefields - they didn't really go into which lands we're going to be on. I mean, of course, we're going to be on Endor. Of course! I did think... oh yeah, they did mention Hoth. We're gonna be on Hoth. Um, they did say there is a new land that we were going to be on - uh, which is Jakku... uh, which is the new DLC. It's the DLC that will be coming out in December 18th, and if you pre-order it, it's December 1st. Um, thankfully, it's free. Um, I don't know if everybody was expecting that because it's from EA, but uh, they did good - they did good. Uh, but it looks really good. Uh, they still have the same hero villains mechanics from the old games, thankfully. And they basically just become bosses, player.",
            "start": 95.96
        },
        {
            "text": "EA but uh they did good they did good uh but it looks really good uh they still have the same hero villains mechanics from the old games thankfully um and they basically just become bosses player driven bosses so it looks like a good game nice how many players at once can play the game um did they go into that they didn't go into that too much but they do have different modes so there's like a four-player Walker assault mode there's you know what they do have also they they did not say anything about Space Battles like there's I didn't see any spaceship battles but they did say there will be some badass dog fights um with like X-wings and TIE fighters sort of but not in space Oh so just well so more like maybe the Battle of Hoth when the snow Speeders are are fighting um was there any and I don't know you know I don't know if you have any concerns about this but I've been thinking a lot about DICE developing this game um DICE's last online game didn't work out very well um was there uh",
            "start": 145.76
        },
        {
            "text": "don't know you know I don't know if you have any concerns about this but I've been thinking a lot about DICE developing this game um DICE's last online game didn't work out very well um was there uh any concern or is there any concern about their ability to deliver a game that's going to need to run online like this one will well uh yes but luckily they have a pretty big I feel like they've got a pretty good structure to build on I mean you know this game has been wanted for a long time they know what people are going to want um I mean it's it's cool that they're listening and you know there's even uh they were talking about having local co-op so you know it's offline local co-op so you can play with your friends you know uh it seems it it seems like they just they're playing it safe I think but that might be the right thing to do that's fair and I I wonder even though it's kind of a silly question with a game like this um because I always wanted more of a Star Wars: Shadows of the Empire",
            "start": 195.44
        },
        {
            "text": "but that might be the right thing to do, that's fair. And I wonder, even though it's kind of a silly question with a game like this, um, because I always wanted more of a Star Wars: The Empire Strikes Back kind of single-player experience again in that world. Will there be any single-player experience at all in the game, or is it basically only online or local? They said it is a multiplayer game, but they do have the missions, you know, same kind of thing that they had in older games. But basically, you can do solo or co-op with your friend, um, which is what I was talking about. You can do co-op, and basically, the missions are similar to the missions that they had in the movies. So it's basically the same game in terms of how the whole thing plays out. Uh, it still looks like something that I would want to play, even though I'm a campaign girl, I like story, but it still seems like it's",
            "start": 239.92
        },
        {
            "text": "the same game um in terms of how the whole thing plays out uh it still looks like something that I would want to play uh even and I'm like campaign girl I like story but it still seems like it's something that would be worth messing around with no I I hear you obviously Colin the same way and the last Battlefront I really got into right was the PSP one that was remember we all played that we all played cuz just the PSP was the best system we all understand it but that was the thing is that there's something about these games getting in and getting to play as these different characters right did they talk about you or hint at getting to play as iconic characters I know that before like there it was a big deal before to play as Vader like there were different missions like that are there anything like that yeah well you can play as Vader um it's the whole same Heroes villains thing um you can play as Boba Fett uh it's the same you you rack up you rack",
            "start": 279.52
        },
        {
            "text": "like that yeah well you can play as Vader um it's the whole same Heroes villains thing um you can play as Boba Fett uh it's the same you you rack up you rack up your kills you rack up your points and then eventually you might be able to spawn as one of the heroes or villains um and it it you are pretty much overpowered and so the other team has to sort of work together to take you down makes sense um now I know that they're pretty dedicated to episodes four five and six in this particular Battlefront or so it appears uh God forbid is there any any uh prequel action in this game at all or they basically going to stick to the G the movies we actually all like well I did not see any droids I didn't uh uh but you know I I have no idea I don't think they really mentioned it they just the the lands and the battles that they mentioned were all you know some of the original films um and then uh they did mention the one that takes place on Hoth",
            "start": 318.36
        },
        {
            "text": "mentioned it they just the lands and the battles that they mentioned were all you know some of the original films um and then uh they did mention the one that takes place on Hoth, which takes place right after the battle on Endor and leads up to the next film so that's really exciting yeah uh is there anything uh you mentioned Battle of Hoth obviously from Empire and then Endor from Jedi um as a Star Wars fan yourself is there any any battle or any location that you'd want to see in this game in particular because I was thinking about maybe something at Bespin or Cloud City I think would be pretty cool but I was curious if yeah if you had anything that you would want to see in there yeah I would love to see something in Cloud City um maybe the Jedi Temple I don't know there's there's a lot of different places I would really like to see um to choose from so uh I mean so you guys would want to see Cloud City which which other ones would you want to see uh I don't know",
            "start": 363.96
        },
        {
            "text": "there's a lot of different places I would really like to see um to choose from so uh I mean so you guys would want to see Cloud City, which which other ones would you want to see uh I don't know something like really old school like Hoth is like Yavin 4 or something would be pretty cool um yeah uh but uh you know I I think I it's funny because when you think about these particular games Hoth and Endor are the two places you often think about but I often wonder if they need to kind of get away from these locations and be kind of a little more expanded universe and and what they're trying to do you think so but I mean that's what everybody wants right everybody lost their at the Game Awards right when it was on Hoth and it was everything you expected you see the ad and all that kind of stuff yeah so I mean you know I I I'd be interested I'm glad that they're somehow connecting this to you know Episode 7 um in a way or whatever and since the game's coming out I think in November",
            "start": 405.32
        },
        {
            "text": "of stuff yeah so I mean you know I I I'd be interested I'm glad that they're somehow connecting this to you know episode 7 um in a way or whatever and since the game's coming out I think in November right that they're you know it'll be pretty imminent once the game comes out to see them revisit the prequels or I mean are you guys like oh no no no let's stay on Endor Hoth all of the old school uh places Greg said he'd want to see Naboo but I think he was kidding yeah I really I really like do Star Wars fans so I want a whole mission about metac clorian I want to go back I want to can we just get really into the whole trade embargo that's what I the politics I hope that they stay away from the prequels no one likes the prequels and I I well a lot of lot of people some people do like the prequels want J to be an unlockable because really just whale on his face you and a lot of people I think would enjoy that very much but uh hopefully they just do what they did with all the books and",
            "start": 444.92
        },
        {
            "text": "prequels want J to be an unlockable because really just whale on his face you and a lot of people I think would enjoy that very much but uh hopefully they just do what they did with all the books and just say the first three episodes never even happened um and just some way we can only dream yes indeed um I'm excited I I'm a little skeptical um of the Dice doesn't have a good track record right now um and this game is going to get slammed way harder than Battlefield does in terms of server load um so that's going to be an issue but uh and it seems like they have a hard and fast date this game cannot be delayed right um so we'll see what happens that's why I thought the game would not come out this year but I was wrong but yeah it is it's no did they give a full date or is it just November they did it's November 17th um it was when the game comes out and then the DLC comes out December 8th but if you pre-order the game you get it a week early gotcha gotcha gotcha and is the Star Wars Battlefront",
            "start": 486.16
        },
        {
            "text": "it they did it on November 17th, when the game comes out, and then the DLC comes out December 8th, but if you pre-order the game, you get it a week early. Gotcha! Gotcha! Gotcha! And is the game for PlayStation 4, Xbox One, and PC, or is it also last gen? They didn't mention that; they didn't go into it. I mean, we saw it on PlayStation 4, so obviously it'll be out for PlayStation 4, but they didn't really go into that. Cool! Is there anything we haven't asked you, any burning tidbits of Battlefront you need to tell us about? I don't know; let me uh see... Oh, you know what? Actually, yeah, let's talk about some of the really cool technology like the whole demo was like about authenticity - they're like, \"authenticity, authenticity,\" like, \"oh, you guys are going to get boners because we're so authentic, it's gonna be great.\" Um, so they basically showed this video of them going to... they went to Skywalker Ranch to go take the sound; they didn't really need to go to Skywalker Ranch.",
            "start": 527.68
        },
        {
            "text": "we're so authentic it's gonna be great um so they basically they they showed this video of them going to um they went to Skywalker Ranch to get the original sound effects um they got the original sound effects from the archives and did this thing called photogrammetry which is uh I think I'm pronouncing it correctly they basically just took pictures of all of the original models and turned them into 3D models and then just put them in the game so you're literally holding the same blaster and you know all the stormtroopers I mean it looks really good I mean it it looks pretty amazing because they were showing some of the models in the demo um and that was probably one of the most impressive parts of the game because I you know I expected most of the other stuff um and then they're also using PBR which isn't the beer it's the Physically Based Rendering system where everything just looks much more realistic",
            "start": 570.92
        },
        {
            "text": "I know you guys expected most of the other stuff, um, and then they're also using PBR, which isn't the beer, it's the really cool rendering system where everything just looks much more realistic. They can change the way that lighting hits the different textures and stuff, um. And they also brought up Dolby Atmos sound, which is like the 3D sound. Do you guys know Atmos? No, I don't. It basically they can make you hear anything in any area of the room so there's surround sound, which you can go it's behind you but they can make it sound closer to you or farther from you and they demonstrated that, which is really cool. So you can do that. Oh, so they mentioned PC because you can actually hear that on PC as well. So yeah, so presumably this game will be PC, Xbox One, PS4, and then hopefully that's it. Did I mean did the game was the graphical Fidelity of the game good enough that it suggested that it was developed on next gen consoles or does it look like it could run maybe on PS on PS3 or Xbox 360 I",
            "start": 615.88
        },
        {
            "text": "I mean did the game was the graphical fidelity of the game good enough that it suggested that it was developed on next gen consoles or does it look like it could run maybe on PS on PS3 or Xbox 360 I don't think it's going to run on PS3 I think it's all NextGen um it's it's really beautiful um and the environments super interactive like every time you run through a patch of plants they all move and in the right way and um it looks it looks it looks too good to end up on old old consoles perfect they're getting the hint just like what just like Rocksteady with Batman: Arkham yeah um cool that sounds good again I'm I'm a little skeptical uh but I but I am but I am excited yeah you know luckily don't have a story that they can screw up because the stories already you know and they and and uh and the graphics look good and as long as the game plays well then you know the worst thing that I think could happen is that it just is broken or um or it doesn't change much from the last games",
            "start": 663.2
        },
        {
            "text": "and the graphics look good and as long as the game plays well then you know the worst thing that I think could happen is that it just is broken or um or it doesn't change much from the last games you know they're not taking any risks that would be my only complaint so far so as long the only way it could go wrong is if it totally doesn't work or doesn't it's too standard and both of those things are possible both of those things are really legitimate threats well they certainly can't be called inauthentic that's for sure good point they reminded you that it sounded like every two minutes Chloe thank you so much for going and seeing it for us if people want to follow you more what do they do where do they go I'm on Twitter at SkyDart all my stuff's on there it's pretty easy but thank you guys for sending me out there that was awesome no it was our pleasure pleasure thank one day the legal restrictions and sanctions will be lifted and we can come back to an area what did you do now",
            "start": 705.28
        },
        {
            "text": "for sending me out there that was awesome no it was our pleasure pleasure thank one day the legal restrictions and sanctions will be lifted and we can come back to an area what did you do now you know there's a Portilla there and I tend to get crazy everybody knows that that's just how I am until next time ladies and gentlemen this has been Kinda Funny Reactions thank you for watching it's our pleasure to serve you",
            "start": 754.32
        }
    ]
}