{
    "id": 1156,
    "video_id": "5TI9C6vKp8c",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Getting Chills and Dating Shows - The GameOverGreggy Show Ep. 90",
    "description": "Nick Scarpino wants to know what gives you chills, Tim Gettys has a crazy experience with reality TV, Colin Moriarty remembers his favorite technologies of yesteryear, Nick Scarpino fights with Colin about Sports. (Released 08.21.15)\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1440745201,
    "duration": 6629,
    "transcript_chunks": [
        {
            "text": "greetings and salutations welcome to the GameOverGreggy Show my name is Colin this is Nick this is Tim we're not slamming any tables we're not spending there's no time to waste there's no oh dear who's coughing someone's did you hear that yeah I did was it Kevin Kevin are you coughing no are you able to throw your cough it sounded like it was three miles away Kevin the cough thrower Coello it did it did sound like it was really really quite distantly done uh all right so where's Greg that's the first question this is the 90th episode of the show Greg isn't here I host it when Greg's not here on occasion uh he's are we allowed to say I guess don't know if we're allowed we're not allowed to say it it won't be clear where he is not by as we're recording this we're saying it tomorrow but I wouldn't **** with it somewhere playing something and uh he'll be back next for the next episode yeah uh you you'll be excited to it's all going to be great so let me see I don't I don't when",
            "start": 2.8
        },
        {
            "text": "but I wouldn't **** with it somewhere playing something and uh he'll be back next for the next episode yeah uh you you'll be excited to it's all going to be great so let me see I don't I don't when Greg talks I usually don't listen so let me see if I can figure out exactly like what he says so uh GameOverGreggy Show is a show it's a video and a podcast this is kind of what he goes into right and what he says is that you can go on YouTube and watch the clips for free but if you want it early then you go to patreon.com/kindafunny right and give us $5 for the audio $10 a month for the video if you want early otherwise it's available for free the next week which really cool is for just $1 a month $1 you get the exclusive episode so this's an extra episode of the show most people probably don't even know exist yep that's true that's a good point is that basically everything I mean he goes into this whole thing he's quite into it he says the same thing over and over again it's kind of",
            "start": 77.64
        },
        {
            "text": "don't even know exist yep that's true that's a good point is that basically everything I mean he goes into this whole thing he's quite into it he says the same thing over and over again it's kind of how I introduce Colin Greg Miller so I'm not judging him no you have to you have to build a Cadence every once in a while and I respect that that's why GameOverGreggy is such a goddamn disaster I don't got a Cadence you do have a Cadence I have like two you have your thing you have this is the first ever 90th episode of The GameOverGreggy Show um yeah something like that GameCast whatever the hell the show's called and after that it's an utter train wreck that's our standard content right like we always said with the what was the Parliament's you used the garbage truck on fire slowly rolling down the street yeah yeah that's about right for us no I think you nailed it I think you nailed all the stuff I did the best I could I mean you know I don't uh the way I think about the garbage truck",
            "start": 119.56
        },
        {
            "text": "down the street, yeah, yeah, that's about right for us. No, I think you nailed it. I think you nailed all the stuff I did the best I could. I mean, you know, I don't... The way I think about the garbage truck specifically, which is Colin and Greg live uh, is that it? It's a garbage truck that's on fire and it's moving down the street as slowly as a truck can possibly move. So I don't want you to envision something going like 10 miles an hour or anything. It is just barely moving; it's slow enough to ghost ride right. Yeah, no, I mean, you could just go... make a sandwich and do whatever you want. Yeah, say hello to your mom, make a few phone calls, go to work, come back, and it's literally just the next house down. Why do I imagine this at your mob's House in Long Island? Just kind of just chilling; it's not even... It's a flat street too. It's amazing. It's just idling yeah, just ID yeah. It's just basically idling down the street. One driving going all right. So uh, this is a topical show uh and so we",
            "start": 153.24
        },
        {
            "text": "It's not even it's a flat street too, it's amazing. It's just idling, yeah, just ID, yeah. It's just basically idling down the street. One driving going all right. So uh, this is a topical show, uh, and so we have four topics today, even though there're only three of us. Nick will go twice, and therefore I think it's most appropriate that you go first. All right, with your first topic, I'll kick it off. First topic comes from the community. Remember if you have topics for me, we've kind of fallen off this a little bit, but I'm going to go back to it if you have topics for the show tweet Nick. That's not what we're doing; what we're not doing is that we're not doing that. We're doing something where you go to KindaFunny.com forums. Oh right, I apologize. And there should be a thread there where it's GameOverGreggy Show topic suggestions. There you go. And if there's not, Lindsay, I love you; I love you to death. Can you make that topic? Yeah, we got to start. We do have these lovely KindaFunny forums that we always forget to",
            "start": 195.24
        },
        {
            "text": "Suggestions there you go and if there's not Lindsay I love you I love you to death can you make that topic yeah we got to start we do have these lovely Kinda Funny forms that we always forget to interact with if you have comments questions anything about the show please go there if you have topics for the show go to KindaFunny.com and submit it like our good friend Sean Pittz, yes at Sean Twisters, Twisters, Twistos - that's the Spanish version. Sean Twist, Sean Twistos uh who says a simple topic what gives you goosebumps oh man I get goosebumps from so many things so many different things I think the not sexual though the best answer is sexual there but um musical cues are the things that get me the most like pretty much any 80s movie score any '90s theme song specifically like when they made the movie version so it was always like a rock version of the songs um it's not or not 90s but Transformers comes to mind, Transformers hearing the theme song.",
            "start": 232.84
        },
        {
            "text": "Song specifically like when they made the movie version, so it was always like a rock version of the songs. Um, it's not or not 90s, but Transformers comes to mind. Transformers hearing the theme song doesn't do anything for me; hearing the freaking Transformers: The Movie theme song that's **** badass and like go Spider-Man, Spider-Man, radioactive Spider-Man. But here in that type of ****, it's like oh it just it gets me brings me right back getting those goosebumps everywhere. It's true the Goosebumps theme song comes to mind. You you were really big into Goosebumps. We saw what did we see the other day? We actually went and saw a movie together for the first time, for all right, the first time like \"Ready Player One\" it was. It's been a while. Um, what was that? It was a Marvel movie. Well, not Ant-Man really no it wasn't Ant-Man. No, what did I see before Ant-Man? Yeah, what was this guy's name? Come on, damn it! Let's think back. There's been so many movies coming out. Well, either way you saw the Goosebumps movie.",
            "start": 284.12
        },
        {
            "text": "really no it wasn't Ant-Man no what did I see before Ant-Man yeah what was this guy's name come on damn it let's think back there's been so many movies coming out well either way you saw the Goosebumps trailer and you were like you were like no no and I'm like I huh I did not realize that your generation like that that specific age group caught Goosebumps and that was a big thing for you oh I mean Goosebumps and Animorphs were the jammy jams what the **** an animorph you know the it's the the book covers where it's like you see the transformation of a person into an animal oh okay okay didn't they do that in uh the popular series called Twilight yeah that is actually oh my God I **** hate you Twilight's a fan fiction of Animorphs one of the main characters in the Animorphs TV show on Nickelodeon is Jake not Iceman, Jake was my favorite character he could only turn into a wolf everyone else could turn into other animals I",
            "start": 330.32
        },
        {
            "text": "is Iceman in the X-Men movies really Shawn Ashmore, that's cool yeah I was always into it Toad was my favorite character he could only turn into a hawk everyone else could turn into other animals I don't remember the yeah but once you can turn into a hawk do you need to turn into another your name is Toad which means you're either super cool or super not cool yeah yeah there's no in between with Toad the only characters I know are that were named Toad actually there's only one it's the guy from X-Men and he was the lamest character okay there but the funniest as well he blew himself um I have a funny story about Goosebumps I'm gonna tell you I was a little too old for Goosebumps I mean like they were coming out but I was like kind of like you know 11 12 13 I mean I was reading you know real person books at that point uh but my dad had this thing that I agreed with him on one summer where if I could just read like he would pay me for every book I read and I I",
            "start": 378.12
        },
        {
            "text": "I was reading you know real person books at that point uh, but my dad had this thing that I agreed with him on one summer where if I could just read like he would pay me for every book I read, and I I was so I was reading like real you know I was reading like R.L. Stine and all this weird **** but I was like What if I just went to the library and just rented like as many Goosebumps as possible and just read all of those and I would read like a Goosebump in like a couple hours and then you'd be done with it or whatever, and I start we had a little tab you keep a Tabler on the on the on the on the fridge uh so that's my Goosebump Story the thing that me goosebumps small G Goosebumps two things came to mind for me one is a rock concert but specifically the opening of a rock concert oh yeah concerts rock concerts all sorts concerts it's there's a science to there's science to getting people hyped up and it involves lights and it involves sound obviously but it involves dropping the house",
            "start": 415.44
        },
        {
            "text": "rock concerts all sorts of concerts it's there's a science to getting people hyped up and it involves lights and sound obviously but it involves dropping the house lights it involves ambient noises a lot of bands have like intros that they come out to 311 is a great example with they do these like spaceship landing kind of sounds so it's like all these alien noises and then the base just drops for like a minute and it's just like landing and the lights are all weird and then it's all dark and then the lights come on and they're already on stage like they had already walked out there or whatever and begin playing and I like the opening of a concert gets me goosebumps anticipating the first song they're going to play what is the first song they're going to play because I'm obsessed with set lists and all that kind of stuff",
            "start": 458.2
        },
        {
            "text": "of a concert get goosebumps anticipate the first song they're going to play what is the first song they're going to play I because I I'm obsessed with set lists and kind of all that kind stuff things that you put in the Encore things you put at the end in the middle uh and I think I think an opening track is very very important to a a concert and and for 311 there's really only like 10 um that they'll play in the beginning so it's always fun to figure out which one they're going to play um the other thing that came to mind that gives me goosebumps when I go to Jets games and I've I've talked about this before I want to see if I can find it the New York Jets chant is the greatest I think really one of the great chants in in sports um and uh it sound like Jets yeah Jets Jets here I'll show you I think I yeah you missed me didn't you Kevin so I have it I have it on my phone from one of the games I went to and I I'll see if this comes through all right that always gives me chills",
            "start": 494.56
        },
        {
            "text": "I yeah you missed me didn't you Kevin so I have it I have it on my phone from one of the games I went to and I I'll see if this comes through all right that always gives me that always gives me goosebumps as well and of course the siren of the you know sounds like there's like a nuclear out yeah that amazing Sports give me yeah like live sports and the action of live sports gives me uh Goosebumps as well and I love you know a a great goal in hockey or a key catch in football whatever a first down that you really need or whatever but but that chant that jet shant because you anticipated it because there's rules of when when it's used and it's very there's you know it's organic but there's there was one person conducting it and everyone would pay attention to that one person in the St you know in in a stadium full of 80,000 people I think that that's fun and exciting stuff so I would say yeah live concerts sporting events yeah the traditions of those I think are Goosebump",
            "start": 531.52
        },
        {
            "text": "the St you know in in a stadium full of 80,000 people I think that that's fun and exciting stuff so I would say yeah live concerts sporting events yeah the traditions of those I think are Goosebump entrances like going to like wrestling and stuff those are very they're designed to give you Goosebumps and chills like whenever you hear the Stone Cold Stunner breaking or like The Rock and you just hear the if you smell what The Rock is cooking it's like oh my God that's just instant Goosebumps um but yeah that the that's the closest thing I have to that Sports thing but with the the concerts and stuff I mean with Kinda Funny Live I completely tried to design our intro around that like copying what I've seen other people do and it's like now whenever I watch it just watching that intro I get so much chills and I'm like that is so douchey of me but it's like no it's not douch but the thing is there is a science to it it is just like what would people want like how do you do that nice buildup sure",
            "start": 572.76
        },
        {
            "text": "like that is so douchy of me but it's like no it's not douche but the thing is there is a science to it it is just like what would people want like how do you do that nice buildup sure I mean but from that I would I would it's not necessarily there's a science to it it's that you're you're leading from this a place of like of passion and heart and fun and you're like I want to make this as fun and like Fan Fair as humanly possible for the people that that engage with our content right like you know that people out there who have watched us since like episode one what they're going to want and there's a certain fun aspect of like giving them that yeah and like dangling it you know and I think that's for me a lot of often times where where where I kind of gravitate to is the things that give me goosebumps either key scenes in movies or actually movie trailers um specifically I think I saw what was I watching I think I went and saw N.W.A. and I was watching it",
            "start": 616.56
        },
        {
            "text": "that gives me goosebumps more either key scenes in movies or actually movie trailers um specifically I think I saw what was I watching I think I went and saw N.W.A. and I was watching it and that doesn't sound right Straight Out of Compton no it was Ant-Man excuse me um yeah let me show you I did see Straight Out of Compton not an excuse me uh but I went and saw Ant-Man and I I saw the Star Wars: The Force Awakens trailer yeah and it was the first time I had seen the trailer and this is kind of telling too it's the first time I'd seen that trailer in the movie theater where I was like oh wait this is where they're supposed to go before other movies that you're watching and then I was like oh wait why is Star Wars playing behind a Marvel and then I was like oh wait everything Disney owns everything no including me they bought me yesterday congrats $60 pretty good pretty good deal they're making all sorts of Acquisitions but no but seeing that one moment in that trailer where it's like the",
            "start": 658.0
        },
        {
            "text": "no including me they bought me yesterday congrats $60 pretty good pretty good deal they're making all sorts of acquisitions but no but seeing that one moment in that trailer where it's like the music kind of hits and you see the X-wings kind of plow across the water and you see Obi-Wan Kenobi he's like whoa I'm like **** man it literally gave me physical goosebumps from like this I'm going to I'm going to sit in the theater in December and see this yeah you mention you mentioned episode one recently or earlier and you talking about this show but in Star Wars: Episode One - Duel of the Fates just Darth Maul coming out I don't give a **** about the quality of those movies that is **** just like oh my God no thinking about it gives me that's the saddest part about all those movies is that that scene was awesome that fight scene was dope arguably one of the best fight scenes in any of the Star Wars properties just sucks that it was bookended by the rest of by straight up flaming trash",
            "start": 696.56
        },
        {
            "text": "that scene was awesome, that fight scene was dope, arguably one of the best fight scenes in any of the Star Wars properties, just sucks that it was bookended by the rest of by straight up flaming trash heaps uh no I agree with you I I I actually think about episode one just even the way episode one began I really liked and and that I remember seeing that scroll you know the scroll and the way they began in in with you know Obi-Wan and Qui-Gon in the beginning like running around like it's for 10 minutes it was fine and and I was like I was really so excited you see the protocol Droid for the first time they go into that room I'm like oh this is that was in ninth grade then you see so horribly horribly racist Trade Federation people you're like because you know what was sad about it is they like you didn't even cast a Chinese guy to do that role you just cast a white dude who's doing his worst Chinese impression that makes it even more it really was weird wasn't it in hindsight the",
            "start": 738.52
        },
        {
            "text": "they like you didn't even cast a Chinese guy to do that role you just cast a white dude who's doing his worst Chinese impression that makes it even more it really was weird wasn't it in hindsight the whole I wonder what the direction was the direction on that just like sounded foreign and it was like whatever the guy thought sounded like what's if you're going to do that it's like I get that you have to go uh you have to sort of dive in and have your characterizations and figure out kind of who these are and how they're going to how you're going to relate an alien to you know people's modern day a of you know a certain ethnicity or whatever but at the same time I'm like why couldn't you just have hired like a Chinese maybe a Chinese guy did do it but it really didn't sound that way like if you're going to if you're going to model them after like a Japanese culture you get Ken Watanabe to do that that's cool you know it's like Ken he's clearly Japanese he has the Japanese accent",
            "start": 780.08
        },
        {
            "text": "if you're going to if if you're going to model them after like a Japanese culture you get Ken Wanabe to do that that's cool you know it's like Kenji he's clearly Japanese he has the Japanese accent all that stuff not crazy it's not overly done it's very tasteful um but that was I mean I don't even want to do it you know I I desperately want to say one of the lines right now but but so it's such a bad idea cuz if I were to even just play that right now just play it out of context what is what's what the **** was that right um so you know uh there's that but getting back to the original topic like it's true I see I still see scenes in movies or I still see like I still watch the Man of Steel trailer every once in a while and like the second you hear that Hans Zimmer score with that that voice over from Russell Crowe and I just I just get like yeah the world's just gone and I'm in that moment and it's so freaking cool and there's actually the same that's the same thing with like the 300",
            "start": 818.4
        },
        {
            "text": "Over from Russell Crowe and I just, I just get like yeah, the world's just gone and I'm in that moment and it's so freaking cool. And there's actually the same thing with like the 300 trailer - did you ever see that one? Oh my God, I mean that's a perfect trailer, that trailer with Nine Inch Nails - that badass Nine Inch Nails track behind it and you're like dude, he nailed it. Yeah, and the movie was pretty good too, yeah not the trailer good, that's got to be top five trailers made. Uh, so when I went to see Ant-Man we did see the Star Wars trailer, we also saw Batman v Superman and it's just like these trailers - trailers are another thing designed to make you feel those moments of like oh my God, a good trailer yeah, a good trailer does that. And I, I would still say like everyone always talks about how Zack Snyder only makes good trailers and I disagree, I think he makes good films too but his trailers are... I like his movies have so many cool shots in them that they are",
            "start": 863.72
        },
        {
            "text": "always talks about how Zack Snyder only makes good trailers and i disagree, i think he makes good films too, but his trailers are visually perfect for trailers and you combine that with an amazing score and great pacing and boom, you get that quick hit of emotion and then you're out, yeah, and it gets you wanting more like i want more man, i want that real good smack, i want that two hours four minutes smack, yeah, jesus, speaking of that, do that mean so moving on to video games, i feel like there's so many game audio cues and random things that get me chills but press conferences oh man, oh yeah, i get so many chills from that and again it's the trailers, it's like it's all that build up to that wow moment right like yeah, i mean, i'll tell you this, there was i since you know i'm impervious to anything gaming um it didn't affect me",
            "start": 910.36
        },
        {
            "text": "the trailers it's like it's all it's that build up to that wow moment right like yeah I mean I I will tell you this there was I since you know I'm impervious to anything gaming um it didn't affect me but when I looked over and saw Colin's face this past E3 during the uh conference was it the Sony conference something big dropped I can't or maybe it was Final Fantasy when you guys saw Final Fantasy you were just like you were just a kid in a candy store well I couldn't believe it's like Final Fantasy 7 is not like one of my most beloved games I like the game a lot but I was more excited that like wow it's really happening they're really going to do it you know it was it was it was a really big moment press conferences are a little weird to us because we don't know some of the secrets but we do know some of the things that are going to happen just through you know through you know back channel yeah like you just hear certain things that are you know going to happen but uh most things are a",
            "start": 950.52
        },
        {
            "text": "know some of the things that are going to happen just through you know through you know back Channel yeah like you just hear certain things that are you know going to happen but uh most things are a surprise and so it's it is a it is in an industry that we know very well and that we have great connections in where we're not often surprised by things or not as I don't want to say often but not surprised as much as say the general consumer it was cool to have something like that that somehow there was not even a scant rumor about like nothing until like the days leading into right exactly like this was and then it was unbelievable it was one of those things was like all right we'll see we'll see what happens it's like shut up it's one of those where you're like we I don't want to even say I don't want to be that guy it's like it's totally going to happen and then doesn't happen you got egg on your face yeah I mean the chatter began you know in the days leading up or whatever",
            "start": 987.52
        },
        {
            "text": "I don't want to be that **** it's like it's totally going to happen and then doesn't happen you got egg on your face yeah I want I mean the chatter began you know in the days leading up or whatever but usually there's indications there's a trademark filing there's someone who quit and put it on his LinkedIn you know profile or but nothing like that happened so it was cool to not have to not anticipate you know that that was necessarily going to happen because even when the rumors came I was like yeah you know who knows who knows what's going to happen so I that's that the the Great unknown with press conferences especially for us you know being able to hear some things every once in a while that might ruin surp big surprises for you know for us for other people it's cool to have that I don't want to bring it to a a negative space but I'd be Lo I'd be loed not to talk about the the bad kind of chills and the bad kind of Goosebumps sure the uh one the the one thing I remember in terms",
            "start": 1023.04
        },
        {
            "text": "want to bring it to a negative space but I'd be loathe not to talk about the bad kind of chills and the bad kind of Goosebumps sure the uh one thing I remember in terms of Goosebumps getting like chills was uh I went to my uh my father's best friend died in 9/11 and I went to his funeral um my dad was like a Paul Bear Bryant and stuff like that and then at FDNY funerals they play bagpipes and it's like really somber and and weird and and sad and I remember um I remember very clearly being in New York City for this funeral and uh the bagpipes stopping when we're all in the street like the procession whatever and it was just totally quiet and I was like it's so weird to be here in this place and there's just no sound at all there was nothing like I I never I don't know like how it was possible that no sound was happening but it was just totally dead silent and that was that was one of my uh for like 10 seconds like well nothing was happening no one was",
            "start": 1056.6
        },
        {
            "text": "I don't know, like how it was possible that no sound was happening but it was just totally dead silent and that was that was one of my uh for like 10 seconds like well nothing was happening no one was moving or anything like that I was like really really uh a somber and important moment but also it would give me chills it was like really Goosebump worthy it was a very sad day but I was like wow that's an incredible and a memorable moment yeah for me as well so that was you know that's just as worthy of a goosebump moment for me as you know the opening of a concert I mean just you're getting them for different reasons from different things yeah I don't know if I can pinpoint chills in a sad moment like I don't know if I ever get that feeling like I definitely got to like feeling in my stomach like a pit feeling but like I don't think chills or something happens to me in that sense yeah I mean it's you know it's it's it's chilling",
            "start": 1099.72
        },
        {
            "text": "like a pit feeling but like I don't think chills or something happens to me in that sense yeah I mean I remember just being like really shocked and I mean it's you know it's it's it's chilling I mean chill chills are chilling I mean chilling chills I understand what you're saying chills I think are supposed to be negative yeah maybe the Goosebumps are like the positive connotation of the same feeling I don't know but uh um but yeah I mean that was that was what sucked out to me too and when I'm kind of going through my mind thinking about some of these things one that's not media related is and this is such a Tim Gettys answer but a cold can of Coke on a hot day on a hot a hot day oh my God it's just like you just drink it there's just this moment of it doesn't happen every time it's just every once in a while and you're just like oh when it's the right can yeah at the right time the right can at the right time and Disneyland in general like Disneyland is another thing oh yeah we talked about",
            "start": 1137.52
        },
        {
            "text": "in a while and you're just like oh when it's the right can yeah at the right time the right can at the right time and Disneyland in general like Disneyland is another thing oh yeah we talked about a lot yesterday oh my God I'm call G live I can't even believe it that gave that actually gave him goosebumps reading that and like just imagining what that's going to be like like you're going to go to Disneyland and there will be just a Star Wars land is awesome that actually that was cool what actually gave me uh Goosebumps was seeing um hyperspace Mountain be announced no I didn't see that that's CU that's going to be a thing next year hilarious uh no they did a one-off poster that you can't get anywhere it's by Drew Struzan the guy that did a lot of the original artwork posters did you see that um yeah yeah see that was cool because I'm like I know they're going to get him to do something they have to like he is the he's one of the most iconic like poster artists of the 80s and 90s",
            "start": 1183.36
        },
        {
            "text": "\"um yeah yeah see that was cool because I'm like I know they're going to get him to do something they have to like he is the he's one of the most iconic like Poe like artists of the 80s and 90s and he did all the he did a lot of the um special edition covers and I can't remember if he actually did the original um Star Wars covers or not but he redrew another one and seeing John Boyega with uh his character Finn with that lightsaber you're like what is what is happening why are there so many cool things happening in this and there's like the X-wings and there's the what do they call the um the water uh thing on tattooing the vaporizers no oh moisture farms moisture farms yeah so you saw some of that stuff and then you saw the little the um the lights from Cloud City in it did you see that no yeah like it's when it's it's there's like a there's like a little track of lights that look exactly like the ones where he's fighting him in Empire Strikes Back yeah so like those\"",
            "start": 1227.04
        },
        {
            "text": "you see that no yeah like it's when it's it's there's like a there's like a little track of lights that look exactly like the ones where he's fighting him in Empire Strikes Back yeah so like those the little like oh cool yeah I didn't notice that I think it's it might be Cloud it might actually be the Emperor's chamber now that I'm thinking about it anyway it's like all those little elements I'm like and then just seeing the composition of it and seeing like yeah we were talking about threw me off a little bit especially having Han down there but he's like and most because at this point you don't know if he's Han Solo or if he's just having a senior moment and he's not quite sure where he's at you know what I mean he's like like H don't pull that trigger you're just in a Denise homie he's just trying to give me the Moon Over My hammy uh Colin's not impressed by this cover I can tell I can feel his stare he's like don't make fun of Han Solo my pres no no I I do think that that poster",
            "start": 1268.12
        },
        {
            "text": "just trying to give me the Moon Over Miami, uh Colin's not impressed by this cover I can tell I can feel his stare he's like don't make fun of Han Solo my pres no no I I do think that that poster would have been fine without Han Solo like without anything there in that space that negative space just the three of them would have been good and concentrate on the new characters I mean it's fun to have a throwback but but what I'm starting to feel with Star Wars is two things this is a tangent based on this particular topic but one that there's way too much going on now with Star Wars I'm getting scared that the more they do the more they're going to **** it up and number two uh is that you know we don't necessarily need these touchstones of these old characters per se uh they're it's exciting that they're there but I wish that they would treat him in a little bit more of a secondary fashion because it It ultimately it's not their story",
            "start": 1309.6
        },
        {
            "text": "these old characters per se uh they're it's exciting that they're there but I wish that they would treat him in a little bit more of a secondary fashion because it It ultimately it's not their story it's it's it's ultimately it's going to be the story of these new characters and how they relate to Luke and Han and Leia and all these Chewbacca and hopefully Lando and stuff like that in the future but um yeah I don't know I I'm getting a little nervous I'm starting to get nervous about what happens if Episode 7's not good too that's the other thing I'm starting to like I'm starting to think about and I I actually have complete faith in it but I also had complete faith in episode one in episode one you know there's a lot of hindsight a lot of a lot of revisionist history about that as well episode one's trailers gave very little indication that the movie was going to be really bad so there's there's a few things to keep in mind there you know moving forward that are let's call the anti-",
            "start": 1344.72
        },
        {
            "text": "one's trailers gave very little indication that the movie was going to be really bad so there's there's a few things to keep in mind there you know moving forward that are let's call the anti- Goosebumps I will I will say this I I feel what you're saying because about I can't remember maybe it was like a week ago they released the official cast photo for Rogue One did you see that and I was like this is dope like these are a bunch of people that I I mean I'm familiar with a lot of the actors but not I wouldn't be able to pinpoint some of them but like I know that guy's name like I think Mads uh Melon what's his the guy that played Theif in uh in the first Bond or Casino Royale that is I think yeah he's in it he plays Hannibal also I think he's in it and the Japanese guy from Predators is in it but I'm like that's cool like I don't really know who these people are and if they are they're not is that guy yeah they're not breakout Stars so I'm like great because guess what I don't",
            "start": 1374.6
        },
        {
            "text": "is in it but I'm like that's cool like I don't really know who these people are and if they are they're not is that guy yeah they're not breakout Stars so I'm like great because guess what I don't need like Brad Pitt to be in a Star Wars film in fact I think that's counterproductive to what they're going for like cast a bunch of people that are just really good actors I mean so far we're seeing that that in yeah I that's great but I mean that and to Colin's Point that's that's great because we don't necessarily need Harrison Ford to continue on the legacy of the series but yeah I mean I saw that photo and I was like that's cool but that was my first reaction to it I was like that's cool not oh my God that's awesome a new Star Wars movie so I think we're already starting to feel a little bit of that fatigue maybe I'm not worried you're not worried no I'm I'm not I'm not actively worried but I am morbidly curious like if if Episode Seven's okay it'll be okay that's gonna be",
            "start": 1418.56
        },
        {
            "text": "that fatigue maybe I'm not worried you're not worried no I'm I'm not I'm not actively worried but I am morbidly curious like if if Episode Seven's okay it'll be okay that's gonna be that's gonna be I mean I think it's gonna I I have faith that it's going to be great but it be good but you have to like in my opinion I love I love A New Hope but I like Empire obviously Empire is like one of my favorite movies of all time and I think Jedi is even better than than a New Hope too and I know that's a little controversial because usually people go Empire New Hope and then Jedi but what I'm saying is this is a setting up the trilogy so I don't have like expectations of it being Empire likee when I went into Attack of the Clones my expectation was that I was like all right episode one was pretty bad this is the equivalent of Empire so this has to be really good and it was **** awful so um so it was like it was just an Abomination where the queen was elected right where she",
            "start": 1454.2
        },
        {
            "text": "pretty bad this is the equivalent of Empire Strikes Back so this has to be really good and it was **** awful so um so it was like it was just an Abomination where the queen was elected right where she was like I'm queen I'm elected by a bunch of people I was like why do they call you Queen then why not president remember that she has a line when she's like I'm the queen and I'm duly elected she was a Senator she was a Senator but on Naboo she said something about being a queen and then also that she was an elected official there as well and I was like huh I could be getting that wrong I don't **** know who cares but it's one of those things where like it never even happened in my mind it never yeah it was like a fever dream the thing about that is like and here you need to manage your expectations right now it's not going to blow anyone away it'll be a good movie but I think knowing JJ Abrams like looking at his history the best he can do and the best that we can expect",
            "start": 1487.4
        },
        {
            "text": "your expectations right now it's not going to blow anyone away it'll be a good movie but i think knowing jj abrams like looking at his history the best he can do and the best that we can expect is what he did with Star Trek which he was able to reboot that series and get it going again and to me i was like that was a great reboot but it's always i mean i walked to the office and half half people were like that was awesome the other half were like that was dumb why why did he screw up star trek and it's like Star Trek is i would i would stagger to say maybe a little less popular than Star Wars depending on how you depending on who you're talking to i mean no if you talk to people who are too heavy into Star Trek give me a break though i mean Star Trek is like not even on the same level of popularity and in terms of i think quality too that was the thing i always it's hard though cuz think about this though Star Trek has been on since the late yeah but when when the hell",
            "start": 1531.52
        },
        {
            "text": "level popular popularity and in terms of I think quality too that was the thing I always it's hard though cuz think about this though Star Trek has been on since the late yeah but when when the hell does the show how much money stly 60s how much money has Star Wars made oh Star Trek made a t I think have to Star Wars money I mean that's what I'm saying like I mean Disney doesn't own it so maybe not Disney only buys baller stuff yeah so but that's what I'm saying is you look at that Series right which is another another beloved Sci-Fi series that needed a reboot and he did I think the best you can possibly uh do with that so that's kind of The Benchmark I think that is sort of like the okay that'll be the example of what you can do that's probably as good as it's going to get with Star Wars want to IM I'm setting my expectations mid- tier I think it's going to be slightly better than that because there is the fact of him doesn't have lightsabers him well wanting to fix what was wrong with the",
            "start": 1572.36
        },
        {
            "text": "Wars want to know I'm setting my expectations mid-tier, I think it's going to be slightly better than that because there is the fact of him doesn't have lightsabers; he wants to fix what the prequels **** up like those happened, you know? So he's going with Star Trek - it's like all he had to do was not all he had to do, obviously. It was a huge what he did was make people that didn't give a **** about Star Trek care about Star Trek, so he did something really important; people care about Star Wars. What he has to do with this one is even harder though - it has to get people that are upset with Star Wars to come back. That's easier though. I don't feel like... I feel like... I feel like Star Wars is like our relationship with Star Wars is like codependency, right? Where no matter how badly it treats us, we still want it to be like we want it to love us; we want to love it, but we've had this last three - we're just like it's a bad relationship right now, but we're still in it to win it.",
            "start": 1610.36
        },
        {
            "text": "matter how badly it treats us we still want it to be like want it to love us we want to love it but we this last three we're just like it's bad relationship right now but we're still in it to win it whereas like all he has to do is make a good film and everyone will be back on board well that's what I'm saying is I feel like he's going to overcompensate by giving us all the things that we actually want which is going to be good so I think that it will be slightly better than the Star Trek but I'm hoping we'll see I'm hope so too yeah I mean I I have I have every hope in the world my one disappointment obviously with this whole thing is that I wish that they just had the balls to say like the prequels didn't happen and I love I would love them to remake them yeah like do the next three do the next and then the three one-off movies or the what do they call them not they're not one-offs they're like uh side Canon movies or side universe kind of so give me the Rogue One give me",
            "start": 1651.16
        },
        {
            "text": "the next and then the three one-off movies or the what do they call them not they're not one-offs they're like uh side canon movies or side universe intertial kind of so give me the road one give me the uh the Boba Fett and Han Solo films great that takes us up to based on their pace right now that takes us up to the year 2016 um so that's 2020 and then for the love of God bring whatever the next talented young bring Square Enix and they'll have episode one two episode two two right episode three DUS episode seven will be everyone's least favorite I hate you so much episode eleven will be the one that Tim likes most no but I mean for Christ's sake bring in JJ Abrams again and let him direct episode one and let's see where that goes that was that was the only confusing move as we wrap this topic up is is they went in and they very deliberately after a lot of thought said like these things happened and these things didn't right and they they pointed to a lot of the books with a few",
            "start": 1683.24
        },
        {
            "text": "this topic up is is they went in and they very deliberately after a lot of thought said like these things happened and these things didn't right and they they pointed to a lot of the books with a few exceptions and the games were like none of this happened and the the disappointing thing about that was that the books were really good and they saw and they they talked about things that happened afterwards and it all made sense and there were characters that people loved like Mara Jade and Grand Mufasa and all these characters that people really liked and they so that was a weird decision where I would have been like you should have just gone backwards like leave everything that happened like the Death Star the second Death Star exploding might should have maybe been the end and then you go back you go back you know and you fix what's actually messed up which were the prequels and then you tell little stories like Rogue One and Han Solo story you can told those stories but maybe the",
            "start": 1729.76
        },
        {
            "text": "Go back, you go back, you know, and you fix what's actually **up** which were the prequels, and then you tell little stories like Rogue One and Han Solo story you can told those stories, but maybe the maybe it would have been smarter I mean and this just total conjecture and whatever just me you know chatting but maybe episode seven and after that never needed to happen at all you know maybe the thing is like the second like it's over the Empire is done it's over but what what was **up** about the tri about Star Wars before that well was the **up** this is so much more interesting I'm so happy that what's happening is happening I don't know I think it would have been more interesting for them to say like we're we're extinguishing the prequels I mean like one way or the other like they didn't happen but what's amazing is everyone this is this is why I get so not angry but I get I get a little **miffed** when people are like no there's no way they can do that that's Canon but they do it",
            "start": 1762.8
        },
        {
            "text": "didn't happen but what's amazing is everyone this is this is why I get so not angry but I get I get a little miffed when people are like no there's no way they can do that that's Canon but they do it all the time with Marvel they they Fox is doing it over and over again Sony's doing it over and over again you with all these Series right they're going back and they're and they're just redoing these for the sake of you know fandom and also just for the fact that some just didn't there wasn't a lot there so why can't Disney do it with Star Wars why can't they be like you know what we're going to go back and redo I don't understand we do with Batman there's a new damn Batman movie every 3 years now so that's awesome why can't you know they Fantastic Four they're just going to keep making those until one of them hits so why can't they do it with Star Wars yeah I don't know all right all right Tim let's move on to you so my topic is reality TV this is going to be an interesting topic",
            "start": 1798.68
        },
        {
            "text": "those until one of them hits so why can't they do it with Star Wars yeah I don't know all right all right Tim let's move on to you so my topic is reality TV this is going to be an interesting topic because I feel like Nick's gonna have a lot of opinions on it but the reason I bring it up is this weekend or last couple days uh I've been staying with my girlfriend and at her her parents house and her little sister is addicted and her I'm going to call her out are addicted to the freaking Bachelorette oh Jesus that show is like totally fake I mean that's the thing I'm watching it and it's like holy **** how could anyone like this this doesn't make sense it's all the super contrived romance speeches that the the entire show is two it's a two camera thing of just them going back having a **** conversation I guess I can't really hate on that too much no but there's a but but there's a difference and that and and you can look at the way they're actually marketing these as far as the",
            "start": 1836.2
        },
        {
            "text": "**** conversation I guess I can't really hate on that too much no but there's a but but there's a difference and that and and you can look at the way they're actually marketing these as far as the award ceremonies are concerned right there's reality now there's a bunch of different categories in reality I'm going to get these totally wrong but there's something where it's like documentary reality and then there's also scripted reality which is a hilarious contradictory term scripted reality and that's what you're talking about right is that The Bachelor is a show that if you look has writers and people telling them exactly what's supposed to happen and who's supposed to be bad and they're casting people specifically to like play up the dramatic aspects of these so I think they're fine I think it's fine to watch as long as you realize that it is a fake show yeah it is a pure entertainment so there's a couple things that that came from it because I I I did not watch that much of",
            "start": 1885.96
        },
        {
            "text": "I think it's fine to watch as long as you realize that it is a fake show, yeah, it is a pure entertainment. So there's a couple things that that came from it because I I I did not watch that much of it but I was in a room while it happened like four hours later he's like \"I hope this chick wins, she's so good.\" So something there did happen, so she's so good for him. The show was interesting to me one because it's Mega popular, I'd write it off as being like why are you watching this but it's like a pop culture thing that isn't our group but it's a big thing. Oh yeah, the episodes are two hours, are they really? Yes, it's a 2-hour weekly show. Are you sure it wasn't just like a special? It's not just the final thing, it's a 2-hour show. I'm like this makes no sense so what happens is there's the originally there was The Bachelor, are you familiar with The Bachelor, Colin? Yes, okay, okay. So they have... I don't know, see I don't know where your pop culture begins and ends. I think I'm going to surprise you on this.",
            "start": 1922.68
        },
        {
            "text": "was The Bachelor are you familiar with the bachelor Colin yes okay okay so they have I don't know see I don't know where your pop culture begins and ends I think I'm going to surprise you on this topic but okay all right all right then yes yes there was The Bachelorette which is just you know different sex thing going on then they started doing this stuff where they'd bring back people that like fan favorites from the prior Seasons to be the bachelor Bachelorette actually I think that's how the Bachelor started it was like a girl that didn't make it from The Bachelor that was a fan favorite she got her own thing then now to the point they're they're like 20th literally 20th season so there's this whole group of people now they made a new show called Bachelor in Paradise and this is where things get cool they just take all the people that didn't make it all the fan favorites and the ones that are hated in weird Spacey Cadet ones and put them on a goddamn Island I love",
            "start": 1967.36
        },
        {
            "text": "Get this cool they just take all the people that didn't make it, all the fan favorites and the ones that are hated in The Bachelor. I love it by the way, every reality show no matter what the hell it is eventually when they run out of ideas, they're like \"what if we just took all the rejects and put them on a Island?\" Okay so that's what happens, put them on an island but what's awesome about it is The Bachelor in Paradise. It has all these rules of like when you're supposed to go on these dates, you're supposed to do this and whatever and people get eliminated but The Bachelor in Paradise all that is is you get eliminated if you don't have a date. Like it's all based on hooking up, it's strategic hooking up with everybody so it's like it totally goes away from the premise of the other shows. It's just like hook up with everybody and where it gets really interesting is if you're not hooking up with someone, you get eliminated.",
            "start": 2008.0
        },
        {
            "text": "so it's like it totally goes away from the premise of the other **it's** just like **everybody** and where it gets really interesting is if you're not **dating** someone you get the goddamn boot you get you're done you're out so what I like it reminded me there was a moment that clicked that I'm like oh this is trash why would you want like this why would you care like this is also scripted it's not even good like writing it's not like the love **stories** I can't look at youash makes me melt yeah but then this Bachelor in Paradise thing happens and I'm sitting here like I'm actually kind of into oh wow she's she has a sister she brought her sister to the island there's two of them it's like oh one of them's a virgin but one of them's the opposite of a virgin one of them a virgin she she calls herself the opposite of a virgin what is that I don't know but it's awesome hey there will there will be no **shaming** on this podcast no no no it's **shit**",
            "start": 2048.16
        },
        {
            "text": "one of them a virgin she calls himself the opposite of a virgin what is that I don't know but it's awesome hey there will be no shaming on this podcast no no it's shaming but so it's just funny that like that's the dynamics there and I'm like wait a minute I've fallen in love with this a million times this was Real World Road Rules and then The Challenge yes yes now I love The Challenge The Challenge was the jam I'm not going to lie the thing is the thing with me is I was always a much bigger Real World fan than I was Road Rules just because Real World came first I guess I don't know I can't really remember it was weird too it was weird they had like challenges and stuff they had challenges no they weren't but then when they crossed over and so that's when my girlfriend explained to me she's like that's why we watch The Bachelor and Bachelorette at this point you just have to get familiar with the characters and get through it",
            "start": 2089.12
        },
        {
            "text": "and so that's when my my girlfriend explained to me she's like that's why we watch the Bachelor and Bachelorette at this point you just have to get familiar with the characters and get through it because it will be worth it and I'm like all right that's a lot of time investment but I get it it's true it just it's it's kind of disconcerting because and I think and I could be wrong but I I think the the reality television like genre has suffered a little bit cuz It suffers like everything else suffers where it's like someone figures it out that there's this amazing formula to shoot the show it's basically like you know you don't have to worry about a lot of lighting it's very low production value just shoot a ton of footage and bring it together in the edit and then of course there's a saturation point where everyone's like oh let's all do it so then every network has a reality show you got The Bachelor, remember Joe Millionaire I thought that the Bachelor was Joey Millionaire",
            "start": 2132.0
        },
        {
            "text": "Point where everyone's like, \"Oh, let's all do it,\" so then every network has a reality show. You got The Survivor, remember? I thought that The Bachelor was Joey Millionaire. I was like, Joe Millionaire was the bomb, dude. So for those who don't know, The Bachelor is a show where there's one guy who's single meets a bunch of girls and by the end of the show he gets married to someone. Joe Millionaire - same exact show except the entire premise is that he's a millionaire until the final episode where it's revealed that he's not a millionaire. Yeah, Joe Millionaire was the funniest thing ever. I watched that with my mom actually when I was in college. I would like go to her house on Sundays or Wednesday - I think it was on like Sundays or Wednesdays or something, and I'd be like, \"Hey, can I sleep over at your house so we could just watch Joe Millionaire together?\" All right, so here's the thing: I think Nick hit on a Salon point there. There was a time when - and it was a pretty long period of time actually - when reality television was...",
            "start": 2173.32
        },
        {
            "text": "just watch Joe Millionaire together all right so here's the thing I think Nick hit on a Salon point there was a time when and it was a pretty long period of time actually when reality television was was was was novel and so it was fun to watch and and real I I I don't know the exact genetic makeup of what we would call a a reality show but Real World is a probably a really good place to start I think that's a natural place it's it's the Wolfenstein of in terms of Shooters of of reality shows um it's a good analog thank you and what's so funny about that show not to say that other people weren't trying similar things but the reality space was so quaint at that time that Real World was uncontested for a very long time and it was really only MTV that was you know doing Road Rules which I wasn't really into uh Rock and jock **** which was like so remember Rock and Jock that the that stuff was awesome Jesus and so like do you remember that like it was a thing where like they would take",
            "start": 2208.56
        },
        {
            "text": "really into uh Rock and jock ***, which was like so remember Rock and Jocks, that the that stuff was awesome Jesus and so like do you remember that like it was a thing where like they would take like rock stars and it would be like rock and jock baseball whatever was an MTV show and it would be like it would be like rock stars and then like real baseball players like playing sports and stuff like that it was awesome and uh so like they did like Tia Carrere is up next and you're like like why is Tia oh she hit the ball good for her good for her so it's like it was so I really look at um I don't think Tia CR has ever put Rockstar in my now Rockstar there was a turning point I think it I think Survivor was clearly the turning point on CBS that where this kind of formula started to work for network television and that was when things got really ** up because there were actually still at that time novel ideas who what was I'll quiz you guys real quick CU it was it was it's still my",
            "start": 2252.0
        },
        {
            "text": "network television and that was when things got really **up** because there were actually still at that time novel ideas who what was I'll quiz you guys real quick CU it was it was it's still my favorite reality show of all time oh I know the answer to this cuz it was mine too I think is it Anderson Cooper's show The Mole yeah dude The Mole is the **man** do you remember do you remember Anderson Cooper got started on a show called The Mole no is that where he got his start that's the first time I had ever seen him in my life that's the most crazy thing is I remember him being the mole and then now I keep seeing him every he's on CNN the mole guy so The Mole is like a is like a a show where it's about uh it's like people doing team activities and like trying to like compete and all these kinds of things on for various things but one of them works for the show and is like sabotaging them and the idea is to try to figure out who the mole is and it was like a really great show I",
            "start": 2294.92
        },
        {
            "text": "these kinds of things on for various things but one of them works for the show and is like sabotaging them and the idea is to try to figure out who the mole is and it was like a really great show I loved it I was in high school when it was on so there was if I remember correctly there was three seasons I saw the first it was my favorite show I watched it every time it was on second season for whatever reason I couldn't watch but then there was the celebrity mole and it was just a bunch of celebrities and Kathy Griffin was on oh my god Kathy Griffin is the best I watched at Kevin's house I watched the entire season in one day of Celebrity Mole I want to know Kathy Griffin so badly she's amazing I want to know her I don't want to be we don't have to be friends okay I know you're way above me as far as the world is concerned I just want to know you I just want to be a part of your life just however small doesn't matter just know that if you need a foot stool",
            "start": 2332.84
        },
        {
            "text": "okay I know you're way above me as far as the world is concerned I just want to know you I just want to be a part of your life just however small doesn't matter just know that if you need a foot stool a back rub maybe some hot oil action I'm here for you oh I didn't know it was going to go in that direction oh that goes that so it was in that early that late 90s early 2000 era when things that started to really explode that's when Joe Millionaire which I think was 2003 when that came out uh the mole was like 2001 or something Survivor was around yeah Survivor was the one that really started and still going and then Big Brother came out and Amazing Race came out it's really CBS actually cuz these are almost all CBS shows that really started to figure it out and actually they probably get a lot of credit and people probably made a lot of money there the problem was when it started to proliferate around everything else and by the mid 2000s what you had were certain",
            "start": 2371.08
        },
        {
            "text": "they probably were there a lot of credit and people probably made a lot of money there, the problem was when it started to proliferate around everything else, and by the mid-2000s what you had were certain varieties of reality show - right, Bravo started doing their reality shows around then, their first one was called Blow Out, I think it was, and it was about a hairdresser, and it was, and that was a really great show, I actually really loved that show, but then there was that celebrity there was the celebrity hairdresser craze where it was like let's do a bunch of shows about just stylists, and like well God I can't I I never watched any of them but I do remember exactly what I watched I watched like that show like religiously, the the so they had like the Bravo stuff right and then they had and they and then they had that's what I'm saying I think I'm going to surprise you and then they had MTV in VH1 now in in the mid 2000s so a little known secret for people that haven't been following me for a",
            "start": 2411.12
        },
        {
            "text": "then they had that's what I'm saying I think I'm going to surprise you and then they had MTV in VH1 now in the mid 2000s so a little known secret for people that haven't been following me for a long time and you wouldn't even know who I was 10 years ago I was a freelancer for IGN TV and I reviewed a lot of these shows so So Hogan Knows Best and Flavor of Love who I went to oh my God so I went I went to I went to um school with uh someone that was on Flavor of Love we talked about school FL um uh damn the um Girls Next Door I had like it was funny because the emails are gone now that was the Playboy one right yeah yeah uh Kendra um oh my God Kendra emailed me when I was in College because I would like beat up on her and some of the reviews cuz she's just like a really vacant individual I'm sure she's very nice but I was you know we were trying to be funny and stuff like that and like she got Me like her her someone in her family emailed me being like you're absolutely right about",
            "start": 2446.24
        },
        {
            "text": "I'm sure she's very nice but I was you know we were trying to be funny and stuff like that and like she got me like her her someone in her family emailed me being like you're absolutely right about her like she like and I lost all these emails they were all in my Northeastern email and like when I graduated they just cut you off and I was like and I was I was anticipating that I would always have access to this email um so I don't remember the exact nature of like I think it was her that reached out and I think it was like one of her family members regardless like who was the other who was the other Playmate I'm blanking on it there's three of them there was KRA who and and which was like the least important one and then her the main one was not Molly what the hell is her name Molly is one of them Molly was the one Molly Holly Holmson right she was the one that was like she was the big one yeah I actually loved the one in the middle though the the one Bridget the one",
            "start": 2489.48
        },
        {
            "text": "of them Molly was the one Molly Holly Holm not right she was the one that was like she was the big one yeah I actually loved the one in the middle though the the one Bridget the one that looked like a like a pinup girl like an old like an old school pinup girl I loved her she was hot they were hot but nonetheless so I was reviewing these shows in addition of Monk and Psych and all this other stuff so I have a pretty I don't want to say deep knowledge because I stopped paying attention at some point like Love New York and all this stuff I'm like I can't do this I love New York goddamn but but to me the winners the two winners of what I feel like were actually really fun quality oriented post boom uh reality television was Bravo who was just still doing awesome work and then uh and then VH1 and VH1 doesn't really do that stuff anymore like that was all VH1 had literally 10 shows that one the guys that they would take like all the has-been celebrities put in house",
            "start": 2520.32
        },
        {
            "text": "and then VH1 and VH1 doesn't really do that **** anymore like that was all VH1 had literally 10 shows that one the guys that they would take like all the has-been celebrities put in a house, house yeah the Surreal Life that was another one like Corey Feldman you're like what what what what breaking Bonaduce you breaking I remember breaking Bonaduce so to me to me the problem with reality television was it started from a good place right it started from a documentary uh standpoint where someone's like let's just put a bunch of kids in a house like a bunch of people from ethnically diverse backgrounds put them in a house someplace and just see what happens right and I'm sure there was a fair amount of editing happening no matter what you're still telling stories you're still trying to find a narrative somewhere in there because even documentaries have narratives you're still telling a story um but I really believe that those first few seasons of the Real World",
            "start": 2560.88
        },
        {
            "text": "trying to find a narrative somewhere in there because even documentaries have narratives you're still telling a story um but I really believe that those first few seasons of The Real World and I could be remembering them a little bit more fondly than they ought to be but I think they set up from that point uh what kills me now is that there's a couple different genres of it right one is the competition um and then the other is let's not even worry about what the thing is like remember they had a thing they were like bunch of hot teens together on a bus doing cool stuff Road Rules right whatever right they're going from place to place they have to do competitions it's cool that gives me some sort of like clear structure right uh The Real World they'll have to live in a house together and then eventually on The Real World they're like let's just get really hot people that'll have sex together and then there was Vegas and then I think is the Apex of The Real World and it all went down the hill from",
            "start": 2601.52
        },
        {
            "text": "eventually on reality TV shows like \"The Real World\" they're like let's get really hot people that will have sex together and then there was Vegas and then I think the apex of \"The Real World\" is when it all went down the hill from there because those people were so good-looking and they dropped the guys who would discuss things, they'd just have them **** and then go to their job without having to do anything, remember, because they had to work right? They had to do stuff and then eventually they're like just put him in a hotel in Vegas and let him **** um but then somewhere along the lines uh reality just became about following people's lives that are better than you and that's where I feel like it kind of took a turn for the worst whereas like you bring up Bravo well uh Bravo has \"The Real Housewives\" right and they're just fascinating human beings from a standpoint from one standpoint is most of them are very smart, a lot of them are self-made um they're their",
            "start": 2638.24
        },
        {
            "text": "The Real Housewives, right? And they're just... they're fascinating human beings from a standpoint. From one standpoint, most of them are very smart; a lot of them are self-made. Um, they're their characters in their own right, but they represent just a lot of just horrible things that's wrong with society today, and they glorify that. That is the entertainment value of them, and so it's very hard for me to watch that because I'm like, \"These people are horrible human beings to each other.\" Maybe not in their own right, but to each other when put in a room, they are just terrible. And I have watched five episodes straight of this, and I don't know why I like it so much. Um, but Bravo does do a good job of that. But they've totally thrown all that out the window, and then there's E!, of course, which has the Kardashian show, and like everything's Kardashians. Yeah, all of their even their news programming is talking about the Kardashians. It's all like I watched E! News...",
            "start": 2672.84
        },
        {
            "text": "there's e of course which has the Kardashian show and like everything's Kardashians yeah all of their even their news programming is talking about the Kardashians it's all like I watched E! News the other day I was like oh my God for the first time I mean I don't know why this occurred to me now but I'm like this isn't a new show this is a show that just promotes all their other shows well isn't that what any news show is on no like a normal like CNN like we're talking about the election but E! is like hey here's what's happening in Hollywood Kim Kardashian has a new show on right after this and you're like oh man this this is this is useless I mean like that's how things are in entertainment I mean like The Daily Fix on IGN what's that that's just a thing of hey check this out on IGN this game news happened oh check this you know what I mean it's the same I'm giving him a little hard time what's funny what's funny what the the the through line Nick with a lot of",
            "start": 2716.92
        },
        {
            "text": "on IGN this game news happened oh check this you know what I mean it's the same I'm giving him a little hard time what's funny what's funny the through line Nick with a lot of this stuff is that it makes these programming now for a lot of channels makes or breaks the nature of your channel e was really quite obscure in the 90s and a lot of people don't like kind of forget about that Bravo and Bravo was too NBC owns Bravo was like it was like their FX kind of yeah uh for Fox e was like was re like they really were showing like fashion shows and it was like a really that's like what it was all about and it was really started with with Talk Soup that was like the first show that really actually got them when uh Jim uh yeah Jim Henson right no John I get him confused John Henson I was like I don't remember Jim Henson ever being on Top Gear I'd love to see that episode John Henson did it and then Aisha",
            "start": 2753.64
        },
        {
            "text": "right now John, I get him confused with John Henson is the creator John Henson, I was like I don't remember Jim Henson ever being on top, I'd love to see that episode. John Henson did it and then Aisha Tyler did it, and that's just called The Soup now, yeah, uh, and it's a fantastic, fantastic show. So the fortunes of that channel hinged on one program, and then became it's the same thing with Comedy Central like Comedy Central was really an afterthought for a lot of people until South Park and The Daily Show came around in the late 90s and really gave people a reason to watch it. I feel like South Park was the first time I watched Comedy Central, yeah, like Comedy Central was just reruns of Half Baked and SNL and all sorts of stuff so it was like you said reruns of Half Baked, yeah, I remember Comedy Central when I was a kid it was that movie was great but I remember it being like the same comedies and all that kind of stuff what came after The Chappelle Show",
            "start": 2789.76
        },
        {
            "text": "Half Baked, yeah, I remember Comedy Central when I was a kid. It was that movie was great, but I remember it being like the same comedies and all that kind of stuff. What came after South Park, right? Yeah, yeah, well after like six years. Um, so I feel like that for like the fortunes of VH1 rose and fell with their reality programming. Uh, CBS is the biggest network television in uh channel in the world by far, and they have a really they're still the only ones doing sitcoms, really; they're the only ones doing entire huge slates of reality television. So it's it's like you were saying the stuff that I think kind of just captures you, you don't really understand why. Because when I think about the shows that I wasted a ton of time watching, like I watch like Shear Genius and **** like that, which is like a show about hair cutting; like a haircut was think like I I like these shows, and I really, and I really don't mind Top Chef's awesome, I love MasterChef with Gordon Ramsay.",
            "start": 2830.36
        },
        {
            "text": "and shows like that which is like a show about hair cutting, like a haircut was think, I like these shows and I really enjoy them, and I really don't mind Top Chef's awesome, I love MasterChef with Gordon Ramsay, that's like one of my favorite reality TV shows to this day, Bar Rescue is a great reality show, like so there's still good ones happening but what I think we haven't acknowledged or examined is the fact that like reality television is just television now, just like back when we were growing up sitcoms were all the rage on TV, but no one really does them anymore, there are like a few sitcoms here and there, meanwhile like every day on all the channels there are reality shows, so it's just the new norm, the unfortunate thing I think is that you know we disparage it and we kind of make fun of it a little bit, but what we do is also very similar to what they do",
            "start": 2873.0
        },
        {
            "text": "so it's just it's just the Evan Flow, the unfortunate thing I think is that you know we disparage it and we kind of make fun of it a little bit but what we do is also very similar to what they do, that is I mean especially the social media aspects and like you think about it who are the most popular YouTubers vloggers it's people that are literally just saying this is it, is a reality show no I would say there's a huge difference between what we do in reality shows I mean we just we we do we have a long form topical show where we actually dive deep into issues and listen to each other and try to form some sort of conclusion about talk about social media stuff always go deep yeah you're right as deep as I can Kevin likes to go wide but I go deep but I think I'm talking more about our social media presence like the Twitter and Instagram and the all that other **** that just happens that is it's just reality take TV out of it because TV is going to be dead anyways yeah it's weird like",
            "start": 2910.68
        },
        {
            "text": "media presence like the Twitter and Instagram and all that other stuff, that just happens, it's just reality. Take TV out of it because TV is going to be dead anyway. Yeah, it's weird, but it's like almost 110,000 people follow me on Twitter, it's a great honor, and people are always curious about what you're doing and like so I think it's part of the human condition when if I'm just out and I'm drinking, bless you, and I'm out and I'm drinking, I just post a picture of that drink. Well, that for some people people like that because it's other people are doing normal things. I think that was the idea, I think that's why this show is successful and why the things we do are successful. I also think that's why reality TV is successful, is because it's just after a while people are like I don't know that I necessarily need fiction or I don't necessarily need fiction delivered to me as fiction so this is this I mean so the",
            "start": 2954.4
        },
        {
            "text": "successful is because it's just after a while people are like I don't know that I necessarily need fiction or I don't necessarily need fiction delivered to me as fiction so this is this I mean so the Kardashians is clearly scripted like there's there's no doubt about that but here's the thing about the Kardashians people make fun of them and talk **** about them and I've said it before on the show and I'll say it again like don't you wish you were as smart as Kim Kardashian don't you wish you like you figured it out don't you wish that like like like she she is incredibly smart and and was and laughs all the way to the bank and anyone who's like she's an idiot and she doesn't know what she's doing I'm like okay because Keeping Up with the Kardashians started when I was in college you know and that was a long time ago and that show is still relevant it has spin-offs and everyone's relevant like everyone every's she **** up the whole premise I'll give her I'll give her that",
            "start": 2988.6
        },
        {
            "text": "you know and that was a long time ago and that show is still relevant it has spin-offs and everyone's relevant like everyone every's she **** up the whole premise I'll give her I'll give her that she has smart managers I don't know how smart she is but I think her mom is incredibly smart and I think that it wasn't necessarily a matter of business smarts as it was of opportunistic like taking advantage of the opportunity that that arose from no it's true it's very true and they're very smart and they're and they're obviously they've always obviously been able to take that that one sort of uh uh strike of of you know spark and turn that into a wide forest fire because they're everywhere now um but like I just totally lost my train of thought that was it we had to had I think you're going to end Kanye West somehow yeah I know Kanye is the bomb um I I'll give you that but um I want to just give a quick shout out before I know we're going to move on to one show that we haven't talked",
            "start": 3023.64
        },
        {
            "text": "to end Kanye West somehow yeah I know Kanye is the bomb um I I'll give you that but um I want to just give a quick shout out before I know we're going to move on to one show that we haven't talked about yet and it is in the reality competition vein and I don't watch Survivor cuz I was like I don't want to watch a bunch of Survivor season 1 through three were my yeah the early survivors great I haven't watched it in a long time but we haven't mentioned one little show and it was very very important to me for at least the first two seasons until I realized that I don't care about it anymore was a show starring Kelly Clarkson and Justin Guarini oh American Idol American Idol, actually was awesome that first those first couple Seasons actually were really special but that that he's a superstar now yeah was I I'll never I I remember yeah I was in 12th grade when when American Idol came out that's another great example that was in 2002 when that came out I",
            "start": 3068.52
        },
        {
            "text": "little too far down he's a superstar now yeah was I I'll never I I remember yeah I was in 12th grade when when American Idol come out that's another GR example that was in 2002 when that came out I remember and so I was just about to graduate high school and that show just got canceled is it so it's like that show has been on for like 13 years it's it's that's the that's kind of the beauty of it we're talking about the Kardashians like the beauty of the situation whether or not you like it or you want to make fun of it is that it exists and there are people now that are and it's always been this way we used to call them socialites right M it's people that are famous for being that was my point people that are famous for being famous the Kardashians in terms of things that have happened have Fame for one reason they are tally associated with OJ Simpson's trial that is the reason that anyone knows who their that that know they know who the Kardashians is the card you know who's Mr.",
            "start": 3108.32
        },
        {
            "text": "have fame for one reason they're tally associated with OJ Simpson's trial, that's the reason that anyone knows who they are. That they know they know who the Kardashians are - the guy who's Mr. Kardashian, who's now deceased, represented OJ and was the one that gave all those speeches when he was like driving away in his Bronco rather than his Taurus, and that was that is the card if everything was even and the Kardashians ever happened, that is the footnote history. See I think you're wrong though - their association with Paris Hilton was what got her big; she was friends with Paris Hilton and Nicole Richie on \"The Simple Life\" - shout out to Simpson but that's not what I'm saying. I'm not saying they got famous because of that, and if all things were equal and this thing didn't happen, that is what the Kardashians are known for. Oh sure, sure, you know I'm not saying that that's where yeah of course \"The Simple Life\" is another great example.",
            "start": 3145.72
        },
        {
            "text": "things were equal and this thing didn't happen that is what The Kardashians are known for oh sure sure sure you know I'm not saying that that's where yeah of course simp life is another great example but sorry my earlier point before I lost my thought was that yeah I appreciate that like yeah you need that escapism and that's what it is it's ultimate that's exactly what you're talking about is that's why we like in the UK they have royalty here these people are a royalty you you like to just watch other people's lives unfold and escape from yours every once in a while because it gives you a little glimpse into sort of The Rich and Famous without having to deal with any of the actual pressures or having to actually work toward that um and I get that and more and more and this is a topic for another day that I actually probably want to go into at some point more and more as I watch Real drama it depresses me like I started watching all I watch all these amazing shows and The",
            "start": 3184.56
        },
        {
            "text": "for another day that I actually probably want to go into at some point more and more as I watch Real Housewives it depresses me like I started watching all I watch all these amazing shows and the other night my wife was like do you want to watch The Walking Dead and I'm like no she's like why not you don't like that show anymore like no it's a great show but it's depressing like every episode ends with they almost get the thing and then you don't get the thing right and that was it's the same with like Game of Thrones or any of these other shows where like oh it's going to go right for him no he's dead I'm he's dead you know and so like I want to go through this as another topic one day but I get the need for people just to sit down every once in a while and tune out because my life is so stressful as is I believe everyone's life that every once in a while I'm like I don't want to watch a TV show that makes me even more",
            "start": 3218.24
        },
        {
            "text": "sit down every once in a while and tune out because my life is so stressful as is I believe everyone's life that every once in a while I'm like I don't want to watch a TV show that makes me even more stressed yeah I just want to watch Kim Kardashian try on that bikini oh the bikini is not right for well okay here's another diamond like a $10 million diamond ring or a Rolex go for it yeah I'm just upset that Kim Kardashian's first reality show with Ryan Seacrest didn't make it past the pilot wow would have been a great show I would have watched all 13 episodes yeah it's it's probably for the best the I I'll say this I want to leave it I want to leave it here there's a lot of disparity there's there's a dichotomy and and it's really a just position of the way people talk about reality television versus the ratings of reality television the fact of the matter is reality television is huge and it's going to exist forever because people like it and they watch it and a lot of people that even",
            "start": 3258.76
        },
        {
            "text": "the ratings of reality television the fact of the matter is reality television is **huge** and it's going to exist forever because people like it and they watch it and a lot of people that even hate on it are probably watching it too they might not even realize it because reality TV is so is so vast well what's crazy about it too is like now that I'm like this bachelor thing is in my life and like now that I'm aware of it I can't get away from it if you walked in the Safeway every single magazine covers this freaking dude that uh I'm blanking us his name now but if I if you see him he looks like a really pretty version of me if I **** Ryan Gosling and somehow a beautifuler baby came out it's that guy he's the winner interesting great I was curious how you **** was going to change your looks but I understood where you're going at understand gen genetics and then uh so I just want to say like what we do I think I still think as a form of reality television our lives are are very",
            "start": 3300.64
        },
        {
            "text": "looks but I understood where you're going at understand genetics and then uh so I just want to say like what we do I think I still think as a form of reality television our lives are are very much similar in a much smaller way to what these people do and and so I I I I have a almost a morbid amount of respect for it because I'm like this is the market the market demanded this stuff and you took advantage of it and I have I have a **** ton of respect for the Kardashians as business people because they just **** carved out a brand man like they really really made something of themselves based on nothing and that is that is extraordinary they aren't just a little successful they have 100% name recognition everyone knows who Kim Kardashian is everyone knows that not even people that are running for president Bernie Sanders who is running for president he has probably a 40% name recognition Kim Kardashian has 100% name recognition you're not going to find anyone who doesn't know who the",
            "start": 3338.0
        },
        {
            "text": "for president Bernie Sanders who is running for president he has probably a 40% name recognition Kim Kardashian has 100% name recognition you're not going to find anyone who doesn't know who the Kardashians are you know that's an that's extraordinary that's crazy so like to me I'm like that yeah you know Bravo to you uh as a closing thought the reality show that everyone wants to watch right now which is one of my favorites is Little Women LA which is about little people in Los Angeles and it's fantastic it's F that's that's my jam that's my Jam right all right all right I'll give that a watch if you have to give uh Diva as a watch though I've watched a few episodes of Divas because Greg has it on DVR sometimes I love it I love it my wife watches it every once in a while but she doesn't want me to know she watches this every once in a while I I catch her like I'll come in early and she like what are you doing I'm like are you watching Divas again is that what you're",
            "start": 3379.28
        },
        {
            "text": "but she doesn't want me to know she watches this every once in a while I I catch her like I'll come in early and she like what are you doing I'm like are you watching Divas again is that what you're doing I can't the only reason she watches it the only reason she watches this she goes and and this is what kills me about my wife and she says this not in the way I want her to say it and this is my life is that I walk in I'm like why are you watching this show but it's entertaining It's relatively entertaining but it's totally fake and totally scripted and she goes I know it's fake and I know I know it's scripted but I just like watching the show because these girls bodies are so so amazing and I'm like and when she says it to me I'm like I just that should be so much better than when you just said it should make me feel so much more differently than I feel right now because she means it from like a they put a lot of work in and exercise and I want her just to be really into women yeah",
            "start": 3415.88
        },
        {
            "text": "said it should make me feel so much more differently than I feel right now because she means it from like a they put a lot of work in and exercise and I want her just to be really into women yeah no I get that but she never will be it's just funny that that show has an audience for people that do not give a **** about wrestling at all yeah it's me and it's that's so crazy man they did it they made Divas relevant which is something I never thought they could possibly do I mean from a a I mean I don't want to I don't want my prior comment to be in any way shap perform indictive that show is actually relatively very entertaining and the girls on it are they put the work in man they're fun to watch they're awesome wrestlers they're great athletes what are you going to do the the girl with the red hair A.J. Lee though that's going to like her hair's going to fall out one day though she needs to like stop doing that I'm like worried that she's just going to go bald one day have you seen",
            "start": 3452.32
        },
        {
            "text": "Eva Marie though that's going to like her hair's going to fall out one day though she needs to like stop doing that I'm like worried that she's just going to go bald one day have you seen this no I I don't you familiar with her no yeah all read everything is her thing what what does this mean Kevin explain oh she has Eva Marie I think is her name she has all just Stark red hair yeah and she Marie yeah yeah I know her she's on Divas didn't know she had red hair though oh yeah I don't think she did before oh she's very red now and I'm like I just look at it and I'm like that's gonna that's going to kill you one day or the other it's going to seep into your brain and are you looking at pictures of her really red it's very red um all right next topic topic three I'll go this time and we'll we'll end with Nick's final topic okay I want to talk to you guys about forgotten Tech now here's what I mean by this it's not things that like you know oh the uh you know used to",
            "start": 3488.76
        },
        {
            "text": "this time and we'll end with Nick's final topic okay I want to talk to you guys about forgotten Tech now here's what I mean by this it's not things that like you know oh the uh you know used to interchangeable parts and stuff like that I what I'm talking about is things that you might have grown up with or kind of were astounded by at some point in your life that are just totally irrelevant now so the VCR could be an example or something like that but my two examples are this I I I think I might have mentioned this in the past but I I always I find this hilarious I I grew up on Long Island in a pretty big house and uh it's conceivable that if you're in the kitchen and dinner's ready right right and everyone else is upstairs in their bedrooms that you're not going to hear even if you scream like you're not going to hear anything my mom would she would disagree with you yeah but that's okay this was I I grew up in a big Colonial House so it's like it was",
            "start": 3523.96
        },
        {
            "text": "hear even if you scream like you're not going to hear anything my mom would she would disagree with you yeah but that's okay this was I I grew up in a big Colonial House so it's like it's it was it was it was it was big and at some point my dad installed an intercom the intercom in the kitchen and it had like multiple panels where like I think there was an intercom like maybe one in the garage one in the kitchen and then like there was a box upstairs by the bedroom s where and and we used it for literally like a week before I was like what do we why are we even have have this and like and I but at the time when it was happening I like w up to play with it and like waited for someone to use it and stuff like that like because if you remember Tim might not remember unless you've been in some like older houses where but like you I'm sure you remember like intercoms were a thing in the 80s like people definitely did not have an intercom in my house growing up and it was",
            "start": 3564.44
        },
        {
            "text": "in some like older houses where but like you I'm sure you remember like intercoms were a thing in the 80s like people definitely did not remember I had an intercom in my house growing up and it was hilarious because the technology was so bad that someone there used to be these little boxes that you'd have in your rooms and then there was like a master control box downstairs where you could like I think we had two channels I don't remember I remember there being like three buttons I was like why do you need three buttons it's talk or don't talk um you know what I mean but like what inevitably would happen is my mom would start to use it and my mother has I love my mother she is she is a great woman I have more respect for her than any other person on this planet but patience is not one of her virtues she does not have it and so she would depress the button and all you would hear was static and I'm like what about \"The Radar\" the song with \"The Radar\" and I'm like I don't know",
            "start": 3606.28
        },
        {
            "text": "her virtues she does not have it and so she would depress the button and all you would hear was this to the radar and I'm like what what about the radar the song with the radar and I'm like I don't I don't know what the what do you what are you talking about and then she would just scream dinner's ready so that was it that's that's as far as we use it and this damn thing sat in my room for like 15 years until my dad eventually ripped it out and rid to the walls but that's all I got yeah I mean that's all I got so I remember we used it like once or twice yeah I remember it was just like this novelty at I'll never forget it like that we had but a good idea I guess like the house we didn't live in a mansion it wasn't like you could have like a blood curdling screen scream in a can see I feel like they installed this specifically for my brother and my sisters who always just like listening to loud ass music and they just didn't feel like going upstairs um so that was the one thing but",
            "start": 3645.08
        },
        {
            "text": "like they installed this specifically for my brother and my sisters who always just like listening to loud ass music and they just didn't feel like going upstairs um so that was the one thing but the second thing that I wanted to talk about that I think has been integrated in our Tech is the MP3 player and this is this is this is pre- iPod like I remember the first MP3 player I ever used was my friend Cody's and it had 128 megabytes of memory and I remember I couldn't even fit 31 tracks on it which is a record like you had to be so selective I go go to hockey and like listen to it in my like in the locker room before games you had to be so it was like eight songs like what eight songs are going to hype you up today because that's the only thing you're gonna fit on this thing you know might even been 64 megabytes or something like that and uh it's so funny how that was so like I was like and I remember with this this particular technology I'm like why like I remember in",
            "start": 3687.36
        },
        {
            "text": "you know maybe it even was 64 megabytes or something like that and uh it's so funny how that was so like I was like and I remember with this this particular technology I'm like why like I remember in like 1999 2000 being like why do you need an MP3 player MP3s are fun we're using them Napster is out by this point but I'm like we can just burn our CDs isn't that fun you make even little data CDs and you can put like 600 megabytes on so like what's the big deal and it was just so funny that at its embryonic state it didn't seem that impressive it wasn't until Apple really made it made you impressed with it but so that's the other piece of forgotten technology is the MP3 player like no one really uses a dedicated music player anymore it's on your phone the mini disc I had a MiniDisc player course you did and I mean do you remember the day like back in the late 80s early 90s where your your understanding of how tech would evolve was like no one's ever going to do that like your first reaction was",
            "start": 3723.64
        },
        {
            "text": "and I mean do you remember the day like back in the late 80s early 90s where your your understanding of how tech would evolve was like no one's ever going to do that like your first reaction was like we don't need it because tech didn't evolve as quickly as it does today so I looked at the MP3 player I was like that's completely useless I already have something that does that it's called a CD and now we've all sort of had to retrain ourselves to understand that tech is an ever-evolving, ever-changing thing and that you don't get used to this because something else is coming out in a year from now and nothing's it's all meaningless but like yeah I remember specifically the mini disc and I was like that seems really cool I think it was in Last Action Hero they always had the product placement where they'd be like let's play the thing and it was like a mini disc and you're like all right play the thing put it in it was like supposed to be",
            "start": 3758.72
        },
        {
            "text": "Last Action Hero they always had the product placement and where was like let's play the thing and it was like a mini-disc and you're like all right, play the thing, put it in, it was like supposed to be dope and that just didn't take off. Sony had a really bad period, the problem with Sony, I was like, I mean even through the early 2000s, like I mean even after the iPod, they were **** up. But they did this thing where it's all proprietary, everything had to be proprietary, and it really kind of **** him up. I remember transitioning from the CD player, which their Walkman was on point, they were lit, the clam shells, yeah, they were **** amazing. And then they eventually made this new tech, they were pushing the mini-disc hard, they had their little...I don't remember what they were called, but like the square portable players you can put the...yeah, but like Sony had a specific brand of them, Discman wasn't minidisc, their brand I",
            "start": 3794.68
        },
        {
            "text": "had their little i don't remember what they were called but like the square portable players you can put the yeah but like Sony had a specific brand of them disc man wasn't minidisk their brand i think minidisk was their brand really yeah i don't think anyone else made it a minidisk it just so they had that but then eventually they added a new technology to CD players called ATRAC or something a at R A yeah yeah i think i remember that and um that Blended the two so it was MP3s on CDs so you could do the data CDs and just put it but you couldn't put MP3s it had be this stupid ass ATRAC Sony file cuz that's the way Sony rolls but i remember that being a game changer cuz then all of a sudden i had 700 megabits of Music on one CD so i didn't have that problem anymore and you can organize it by albums so you could put couple albums like eight albums on one CD that was awesome but those like even thinking back to i the the first time i held an iPod in maybe 10 years was",
            "start": 3832.88
        },
        {
            "text": "organize it by albums so you could put couple albums like eight albums on one CD that was **awesome** but those like even thinking back to I the the first time I held an iPod in maybe 10 years was like two days ago I just saw one at my friend's house and I picked it up I'm like I can't believe this isn't part well no no not even that just this isn't part of my life anymore like it's nuts that this doesn't have apps this only plays music and when I had it like back when I had my Nano or when I had my like the the classic or whatever I was just like I'm never going to not have this on me you know like I remember thinking that like this is part of me of who I am like now I'll never leave my house without headphones in my like earphones in my pocket like will there be a day that I don't do that that I don't have those on me because now that like music is just part of my phone and like more and more it's just getting subjected to just like a smaller part of an app like there's not even",
            "start": 3876.08
        },
        {
            "text": "that that I don't have those on me because now that like music is just part of my phone and like more and more it's just getting subjected to just like a smaller part of an app like there's not even a music app on iPhones anymore now it's Apple Music oh yeah your music it's a it's a little folder in that you know that's crazy to me that that's how much it's changing that it's like you don't even own you don't even have access to your **** anymore but going back to CD players man like that I'm so nostalgic about that because I feel I I was the perfect age at the end of the the perfected CD player Walkman where going to school every day holding it it would break you got to get a **** rubber band because it wouldn't play unless you put it over it like all that **** everyone had one they had the colored ones and once they get the colored ones that's when you know that's when you know it's almost it's it's been perfected yeah it's the it's the epitome of it um the CD player in",
            "start": 3925.16
        },
        {
            "text": "they had the colored ones and once they got the colored ones that's when you know that's when you know it's almost it's it's been perfected yeah it's the it's the epitome of it um the CD player in general was groundbreaking I mean that was a game changer because up until that point you wasted and Colin contests I'm sure you don't remember these but when you were using cassettes yeah thousands of hours rewinding and then you were like I want to just go to that one part in a song and you weren't quite real like familiar with the album enough to figure out where the **** that thing was so she was like Fast Forward wait was it there **** it's on the other side and then you had to do the math in your head of like wait till I everwind or fast forward never again the analog era I'm glad it's dead because when the CD came out you were like oh wait I can just skip to the next track and fast forward and pause and do all these things my God yeah changed the game yeah I remember getting my",
            "start": 3967.88
        },
        {
            "text": "\"Dead because when the CD came out you were like, 'Oh wait, I can just skip to the next track and fast forward and pause and do all these things. My God, yeah! Changed the game!' Yeah, I remember getting my first portable CD player in like '96 or '97 - this was '96, goddamn! And uh, it was before they had like the shock protection, so I was making Greg laugh the other day because I bought my CD player and White Town's \"Women in Technology\" on the same day. Do you remember? You know White Town? No, I don't. Do you do you? I'll show you - that's an album by White Town. 'Women in Technology' was that particular song. Uh, I'm loading while looking... I'm going to give a quick shout out to the pager. That was my ped, the Pedra. The Pedra was one of those things where I'm like, 'I'll never be without this,' and then the cell phone came out like a little while later - like I got a pager and then like that was in high school, and then by freshman year in college...\"",
            "start": 4007.0
        },
        {
            "text": "where I'm like I'll never be without this and then the cell phone came out like a little while later like I got a pager and then like that was in high school and then by freshman year in college I think I had a cell phone and it just killed the pager I think I was too young for that because pager to me was always something that never made sense I like why would you use that like why I don't you understand yeah the pager I mean everyone had a pager back then I I I didn't I never I wasn't you know I was a little too young for it I remember my sisters and my brothers friends all had like pagers and like they would there was a pager there's a whole pager culture do you remember it yeah oh yeah dude absolutely like the way you type things on the pager and the messages you leave like it was really weird kind the color of the pager the build of the pager it was like it was like a mini cell phone Revolution but you had the like I had a purple pager it was dope well I mean the flip phone",
            "start": 4047.76
        },
        {
            "text": "weird kind the color of the pager the build of the pager it was like it was like a mini cell phone Revolution but you had the like I had a purple pager it was dope well I mean the flip phone like once cell phone's got to the flip aspect and you can change the actual covers of the phone like not cases but like flip out the covers and face plates and **** oh man my t720 oh I think I had a Verizon flip phone but I didn't the the the the the beautiful like the best flip phone I think was the was it the crazer or the Razer the was the one that like that once it got there that was kind of the what we were saying earlier about like nailing the Perfection of the phone yeah but up until then they were really there was options there wasn't just this or nothing God my wife had one of those up until about 5 years ago I swear to God and it was like pristine I'm like this is like you just bought it yesterday yeah give it to me give me a little bit of white White Noise White White Town this is",
            "start": 4082.92
        },
        {
            "text": "about 5 years ago I swear to God and it was like pristine I'm like this is like you just bought it yesterday yeah give it to me give me a little bit of White Noise White Town this is their single you'll definitely know this one oh my God yeah oh yeah yeah so I'm not going to play anymore cuz we're going a copyright strike uh so I so I remember I bought that record and my portable CD player and I went to a hockey tournament that day and I remember sitting I remember sitting because it didn't have the shock protection I remember sitting in the back seat like just holding it like this being like please don't move please don't like yeah like holding it as still as possible go over bump and it would be like yeah St to start all over you probably know this this is probably super obvious but I was blown away cuz it sounds familiar do you know what that song Sound samples no I don't I don't really I don't think so listen to it again real quick I don't really want I don't are we",
            "start": 4124.96
        },
        {
            "text": "but I was blown away cuz it sounds familiar do you know what that song Sound samples no I don't I don't really I don't think so listen to it again real quick I don't really want I don't are we going to get a copyright strike no do that we'll be fine is it Star Wars yeah it's Imperial March wow oh I never even didn't that yeah yes I knew something I didn't know I never even realized that that's crazy I was sorry I bought that album because it sucked um but that song's is great that's a great song yeah uh yeah so those were kind of my examples of dead Tech that I was I was astounded by cuz I remember getting my first iPod even like you were saying like I I remember getting my iPod and being like this is **** awesome I remember I got it for my birthday both my parents like combined money and and got it for me and I was like this is such a an I remember how heavy it was so heavy and I remember being like this is great this is fantastic I can't believe like you were saying I can't",
            "start": 4160.2
        },
        {
            "text": "and and got it for me and I was like this is such an I remember how heavy it was so heavy and I remember being like this is great this is fantastic I can't believe like you were saying I can't believe I just walked around listen to music all day it was so novel walking into class like a couple minutes before it started and taking out your earbuds and realizing your music's just blaring out of your **** earbuds MH and be like okay go um so yeah I mean those were kind of it's just funny how a lot of these things have fused into this I mean it's it's crazy too like we're getting into the real specific Memories We have of this stuff but like and we've talked about this before but the way you interact with music has changed so much like back having to rewind the cassettes and stuff cuz I that was at the the birth of me listening to music was the tail end of the cassettes and also I was poor so I didn't get a CD player until like the PS1 was my first CD player at all and then portable",
            "start": 4198.2
        },
        {
            "text": "that was at the birth of me listening to music was the tail end of the cassettes and also I was poor so I didn't get a CD player until like the PS1 was my first CD player at all and then portable that wasn't until like way late like probably 2001 or two right um but having to rewind and stuff you get intimately familiar with the music in a way that you don't when you're just kind of like skipping skipping skipping having said that then you get to the CDs and you only had that one CD you didn't if you were on the bus you only brought one so you were listening to that album for the next week or for whatever it was switch it out and constantly switching you didn't have that many CDs so my brother I'll never forget my brother when he uh my brother was one of those guys that was super into having a subwoofer in his car good like having a good sound system did you guys ever go through that phase oh yeah well my brother had the amp oh you're going to get the amp with the sub are you",
            "start": 4235.52
        },
        {
            "text": "having a subwoofer in his car good like having a good sound system did you guys ever go through that phase oh yeah well my brother had the amp oh you're going to get the amp with the side are you kidding me hell yeah am I freaking C oh my God it's such a waste of space don't do it um but my brother had this amazing like sub in the back of his car like two subs took off his entire trunk with like a blue amp and like had everything wired in and he used to have these he used to remember when you you drive was when you really needed a space saver for the CDs you had to figure out some sort of system that would allow you to bring your entire CD collection into your car without getting stepped on but it had to be malleable enough so that you could like fit it under so they had the CD the big CD cases you remember those my brother had like two of them they were like this big and he had every Metallica album humanly possible which was hilarious cuz I was like why are you bumping",
            "start": 4277.04
        },
        {
            "text": "CD the big CD cases you remember those my brother had like two of them they were like this big and he had every Metallica album humanly possible which was hilarious cuz I was like why are you bumping Metallica with a subwoofer you don't really need that but he also liked some rap and stuff too mostly Metallica though come to think of it it was really weird um but yeah I mean that was that was hilarious cuz I caught you know I had one of those I still have it it's in my garage like underneath my apartment complex it's just collecting dust and I think all the CDs are like stuck together cuz it was like that hard plastic also I used to masturbate all over them um just just seeing if Kevin's still paying attention he's not he was checking uh what you on Reddit again what do you what do you looking at The Chive cool um but yeah I mean that was the CDs for me were were they were just amazing I think my first I think the first CD I ever bought was Pearl Jam was uh the first Pearl Jam album Ten",
            "start": 4318.32
        },
        {
            "text": "at the Chive cool um but yeah I mean that was the CDs for me were were they were just amazing I think my first I think the first CD I ever bought was Pearl Jam, was uh the first Pearl Jam album 10 yeah yeah that's a that's a uh the ones with the hands they like touching each other like it was like a 10 way high five I was like it's so damn heavy here's the thing about the CD binders though because I I my this never happened to me thank God but I remember cuz I had a c you know a really robust CD collection at one point that was very good up to a certain point uh you always knew people that got their stolen out of their car whatever and then it was over for them it was over I mean that's like that could be potentially thousands of dollars or you on your CD to someone and like you totally forgot you where the hell is my Ten album you have no idea where it went you'll never see that again yeah it's true I mean that's that's one thing as far as a bygone technology or",
            "start": 4357.32
        },
        {
            "text": "totally forgot where the hell is my Chronic album, you have no idea where it went, you'll never see that again, yeah it's true, I mean that's one thing as far as bygone technology or forgotten tech is concerned, the concept of ownership I think is gone as well especially in regards to digital medium and digital media, that's just not true, I just don't think with the exception of games where you can download games still but I'm talking about movies specifically in music like there's I don't own anything anymore I I don't I just I don't buy Blu-rays which is funny to say CU I love I mean I like the quality of Blu-rays but I don't need a shelf full of Blu-rays I've got Netflix I've got Spotify I just I've let that part of me go that needs to own a physical piece of media and I just I'll never go back to it, never going to happen you just it's just for me it's just economics I don't need to buy a like I don't need to buy a movie I'm never going to watch again it makes sense if I want",
            "start": 4397.32
        },
        {
            "text": "Go back to it, never going to happen. You just need it for me; it's just economics. I don't need to buy a movie I'm never going to watch again. It makes sense if I want how many times do you watch a movie? Never, even if you end up renting it three times, that's still probably less than the cost of some Blu-ray. But you don't get to look at it and it's not all pretty; you don't. And that's for a lot of people, the idea of collecting. For you guys specifically, I know you guys like your games – you've got an amazing library out there, and you like to just go and be able to pick and grab. Well, I mean, I used to hate collecting games; now I'm all about digital. Same thing with music – I used to buy a lot of music, but I don't buy any music anymore. Everything I do is perfectly legal, but I use Spotify or I just use YouTube. Yeah, like Little.",
            "start": 4440.32
        },
        {
            "text": "buy any music anymore I don't buy **** any music bu everything I don't I I I I mean I'm doing what I'm doing is perfectly illegal but I use I use Spotify or I just use YouTube yeah yeah like Little Dicky album came out and I I mean I streamed and just kind of listen to song by song but I didn't like buy it or really invest the album so I got it from Amazon shipped in the CD ripped it myself dope see going back to it like what I was saying is it's like you just interacted with the music in a different way yeah once we hit this digital era it's just it's so just on to the next thing onto the next thing onto the next thing always for me this at least this slows me down and I have to riping to I need to kind of like rename each file so explain what you do because I I I want I I don't want people to get a a misconception you buy the CD yes you rip the actual highquality audio tracks from the what are they wave files or a a files whatever well I mean it starts as just a lossless CD file",
            "start": 4479.36
        },
        {
            "text": "people to get a misconception you buy the CD yes you rip the actual high-quality audio tracks from the what are they wave files or aiff files whatever well i mean it starts as just a lossless CD file right well even that's level of compression on it but well i don't use itunes or any of that crap i use eac audio converter its best so you take that and then you convert that to mp3s that or to wave files that you then load on your phone so not wave its you can what i do is i like to make three versions cuz im a crazy person but there's the flac file which is essentially lossless sure um and then but that doesn't really play on devices why not um just because it's too big and and well at least apple devices aren't made for it there's apps for it but that's the whole other thing then i make an mp3 very high quality you can change the the quality there um and then i make a apple lossless file which is flac but apple's version and it's like slightly compressed but it's",
            "start": 4517.0
        },
        {
            "text": "thing then I make an MP3 very high quality you can change the the quality there um and then I make a Apple lossless file which is FLAC but Apple's version and it's like slightly compressed but it's still way higher quality than any MP3 will be and that's what all my **** is yeah I mean that's the thing that confuses me just in the sense that I have a I have a great ear for music and I enjoy high quality music I en I always tell people like you know wear good headphones get a good speaker like I have a Bose speaker and it it matters but the compression only goes so far even when you're streaming music like The the difference between like a lossless file that you're you're you're ripping and the high quality if you set your Spotify to high quality is not not super different you can set youri to high quality I didn't know that I'm the type of **** that like right now just knowing it is enough for me that I just I can't get out of my head and it's like the FedEx arrow and I'm just",
            "start": 4561.0
        },
        {
            "text": "youri to high-quality I didn't know that I'm the type of person that likes right now just knowing it is enough for me that I just I can't get out of my head and it's like the FedEx arrow and I'm just like you know you have that moment where you're like well **** like like this sounds worse I just know it does but having said that I'm like you know what I need to grow the **** up and get over that and now that Apple Music is something that I use to like stream and stuff because it's free right now no **** I'm on the automatic can I put it on Extreme you could it's just going to use a lot of your data first of all it's going to make the songs buffer before you play them and it's going to use more of your data oh **** I'm going high that's crazy but recently I've been in my car doing this like for the first time actually streaming music so like I was saying a little Dickie I was streaming **** and the difference between streaming it in high quality and then when I bought the",
            "start": 4601.16
        },
        {
            "text": "this like for the first time actually streaming music so like i was saying a little dickie i was streaming **** and the difference between streaming it in high quality and then when i bought the album and did it and like i did a test and i'm like its its a big difference like especially in my car where im like the base is just richer think think about this though i mean you can just put it in terms of mathematics when you ripped a cd wasn't it like 128 but you could set it to anything it could be lower than that no but what how big were how much can cds hold 700 mb 700 megabytes right data of data as audio it can only hold like 70 minutes yeah yeah but that but that converts to roughly 700 depending on the how many tracks and you you'd have to compress it a little bit more but like say an average album has what like 12 to 13 tracks on it roughly so each song is see 700 i'm just trying to figure out how much each song was it was in the it was in the tens of 20s",
            "start": 4635.4
        },
        {
            "text": "bit more but like say an average album has what like 12 to 13 tracks on it roughly so each song is see 700 I'm just trying to figure out how much each song was it was in the it was in the tens of 20s of megabytes per song right if you rip it off like when you rip a track how big is that track well I mean it gets complicated because you you can't just rip the CD whatever the CD's files are those don't exist in digital yeah they're making I mean that's why you can set it to like 256 I thought was considered at time back in the day 320 is the best you're going to get for in terms of like what they actually do if if you have a wave file right I'm just I'll put in terms of pure recording of audio right you have a wave file those tend to be 10 to 20 times bigger than an MP3 file so when you look at the difference between those you're you got same with video right where if you start with like we you know when we do recordings of stuff that we want to be really really nice even if we record a",
            "start": 4673.8
        },
        {
            "text": "at the difference between those you're you got same with video right where if you start with like we you know when we do recordings of stuff that we want to be really really nice even if we record a prores you're talking like you know a gig every 10 minutes or whatnot and then you upload you compress that to three gigs total for like an hour piece of content that's a **** ton of information you got to throw out you're things where it's a law of diminishing returns where you're doing that to the parts that don't necessarily need it cuz like you know you don't really pick up on all those things or whatever right but listening to it it's like there's a difference you know and like knowing that not only is there a difference in numbers but I can hear it that's where I'm like got keep this it's it's all dynamic range right it's the same with video or like they're it's your codec someone dying someone's getting killed outside Kevin just keep checking Reddit it's fine you're okay",
            "start": 4717.92
        },
        {
            "text": "It's all dynamic range, right? It's the same with video or like they're it's your codec. Someone dying, someone's getting killed outside. Kevin just keep checking Reddit, it's fine you're okay, it's fine. He's playing like uh what are you playing uh Fantasy Star online J J Fantasy Star um no it's got to come from somewhere right? So I mean that and that's the thing that's they talk about a lot with films is dynamic range is like the bigger the camera the more information it records the bigger the dynamic range of like light to dark and it's the same with audio, right? Those those bass drops have a dynamic range of here and then when you compress them you're taking them and just basically taking the middle and you're taking the highs and lows out because the middle is really what people hear the rest of it is just giving the depth to the song and people don't really really need that. Yeah now I don't really notice it because I listen to all my music on a pair of $10 Sony headphones that",
            "start": 4756.68
        },
        {
            "text": "the rest of it is just giving the depth to the song and people don't really really need that yeah now I don't really notice it because I listen to all my music on a pair of $10 Sony headphones that look like they're from 1987 and in that case none of it matters it doesn't matter it was I was saying to Tim when we were in your car I'm like I need to mess with with Nick's like your treble and your base are all mixed up in your car and it's one of it's one of those things where you you totally should uh it's one of those things where it depends on the kind of music you like when we were listening to hip-hop on the way back from nap whatever I'm like this is this is getting this is bleeding out in the treble territory really badly but again it sounds probably fine if you're listening to talk radio or like smoother music right so I get the point I'm trying to make is is that you have to to compensate for some of these things you can also **** a lot with with like the equal yeah",
            "start": 4799.0
        },
        {
            "text": "to talk radio or like smoother music right so I get the point I'm trying to make is is that you have to to compensate for some of these things you can also **** a lot with with like the equalizing like all of all of like what you're listening to it's a pain in the ass what I'm saying though is that the high quality Little Dicky that the highest quality you have and the highest quality streaming there's there's a a difference and we could all probably hear it but is the it's like 10% I'm saying it's a there's a there's a convergent point that we're reaching I think where soon you won't have to worry you soon you won't have an excuse whether or not you want whether or not you want to to do it that's what I'm surprised about with Amazon specifically I'm not surprised Apple doesn't do it but I'm surprised no one has the option to be like buy the FLAC file or like the file that is exactly the highest quality possible from the CD like that's so weird to me you know",
            "start": 4834.28
        },
        {
            "text": "Apple doesn't do it, but I'm surprised no one has the option to buy the FLAC file or like the file that is exactly the highest quality possible from the CD, like that's so weird to me. You know, that they don't do that. It seems like they have multiple options with things you should pay for. It well, Bandcamp does that, you know? Right? But they're not really a store, like as I mean in terms of music, that is why Bandcamp does that. Is that what differentiates them from everybody else? And the thing there is, like it's really a bandwidth thing where the size difference is ridiculous. If people were to do that, it would be just simply not worth it for them talking like yeah me, the average song is what 2-3 megabytes versus 50 or 20 megabytes per song depending on what you want. It's a pretty big deal considering it's not like movies where you're like I'm just going to download a couple of movies for a plane ride. I mean if you're going to download two songs, that's a huge difference.",
            "start": 4875.8
        },
        {
            "text": "depending on what you want it's a pretty big deal considering it's not like movies where you're like i'm just going to download a couple movies for a plane ride i mean if you're going to download two or three hundred songs and have them at your disposal you're talking a huge huge difference in uh in bandwidth and/or storage yeah so it's true i mean for me i've never been a huge i've never been into audio quality i just never have you know coming from marching band you know i like my music live and in brass you know what i mean it's like recorded you guys with your recorded er now u no but for films i can understand it's fascinating to me that i never got into blu-rays i just i think it for me it was economics i was like i can't afford a blu-ray player and then i never had a ps3 yeah i is what we're talking about where you know back in the early 90s you guys were like oh i don't trust technology and you know i don't believe this is going to catch on now it's different where it's like",
            "start": 4916.44
        },
        {
            "text": "what we're talking about where you know back in the early 90s you guys were like oh i don't trust technology and you know i don't believe this is going to catch on now it's different where it's like we know things are going to change every five **** seconds so it's like why invest in a blu-ray collection unless you're **** crazy and stupid you know part of you maybe wants to hold on to the the the easier days you know maybe there's a party that's just like this is all too fast i need to have something i mean i think that's why collectors collect is that you know they want to hold on to that little bit of history that slows the world down a little bit and especially in this day and age i think it's incredibly important to have that part of you um but you'll one day get married and that that all that stuff will start to go away cuz you're cuz your wife will just go like this do do we need all those Harry Potter books I'm like well you know I waited in line till you know midnight to",
            "start": 4955.8
        },
        {
            "text": "that all that stuff will start to go away cuz your wife will just go like this, \"do we need all those Harry Potter books?\" I'm like, well, you know, I waited in line till midnight to get that seventh book and ran back so no one would spoil the ending for me. She's like, \"do we need them?\" I like how you say that as if you had to run away from the bookstore cuz someone was going to spoil the book for me. Son, this has been 10 years in the making. Before we move on from this topic, the last thing I want to say is cuz you brought up the whole walking into class and you're blasting \"Hell Loud.\" I'll never forget like doing the Star Tests and all that. Did you guys do Star Tests? Is that a thing? Like, the multiple choice? Yeah, sure. So we would do that, and then you could... it was one of those things where it's like if you finish early",
            "start": 4991.12
        },
        {
            "text": "that did you guys do star tests is that a thing like the you know there multiple choice yeah sure so we would do that and then you could it was one of those things where it's like if you finish early you can sit there quietly you can't leave the room you can't do anything so you're there for like **** 5 hours just not doing **** so I'm like listening to music but you the progression of devices totally changed how you listen to music because you can't be sitting there on your CD player clicking the next track next track next track volume volume volume volume volume you know what I mean if it had the volume slider you're **** golden but if you had to click clack to **** make that **** go up and down you just got to kind of write it out at whatever volume cuz people start doing the look back at you then the teacher starts giving you the finger and **** but then the iPod happened and it was the same thing where the squirrel the squirrel why can't I say scroll scroll wheel uh",
            "start": 5033.6
        },
        {
            "text": "look back at you then the teacher starts giving you the finger and **** but then the iPod happened and it was the same thing where the squirrel the squirrel why can't I say scroll scroll wheel uh you just kind of go through all the stuff if you turn off that **** clicking noise and you'd be fine but then it'd be the next track that that deep heavy depression man that thing was Heavy dude my wife used a hat she had an original iPad she called it ber the or the iPod ber the iPod I don't know what it's called that some one of her ex dip ship boyfriends bought it for her I was like what's called it Bert and I was like **** strangle you um it just reminds me of my wife having sex with other guys and you know sometimes it's hot sometimes it's not anyway she there was that deep like it was a thick device man it had some girth to it it had some feeling the tactility of it you would push it in and your finger wouldn't come back for like a two or three milliseconds it was intense man yeah",
            "start": 5069.92
        },
        {
            "text": "a thick device man it had some girth to it it had some feeling the tactility of it you would push it in and your finger wouldn't come back for like a two or three milliseconds it was intense man yeah but so then I I remember when I odou happened cuz I didn't have an iPhone like the first gen but the iPod Touch solved everything you a here I mean there's the one click of the home screen besides that you could just do whatever you wanted and oh God bless senior year of high school that was a good time senior year of high school I had a pager in senior year at high school pager good topic all right good topic Colin topic number four we go back to Nick for the final topic Colin this isn't this is a a topic that's right up your alley to use a sports metaphor or maybe it's not a sports metaphor depending on this topic what makes a sport a sport is bowling a sport that might be my favorite topic intro of all time that was the F I'm so upset that Greg wasn't here to see the first time ever",
            "start": 5108.52
        },
        {
            "text": "depending on this topic what makes a sport a sport is bowling a sport that might be my favorite topic intro of all time that was the F I'm so upset that Greg wasn't here to see the first time ever that one of Nick's **** you know falling forwards things worked it went down real fast you got and then got it right back up that was so so good this is a this is something that we've talked about pretty pretty game on GamesCast and on and GameLive about specifically in relation to esports and how I just hate that term I hate it um it's not to disparage again the people that play those things or do that I just hate that it's esports I just don't like that it's it's Competitive Gaming that's great it's hard it takes skill congratulations if you do it I'm I'm I'm happy for you have no problem with that um a lot of people look at the definition of sports and I don't even want to look at it because that's not really what we're talking about like what the definition of sports of course chess is",
            "start": 5154.68
        },
        {
            "text": "that um a lot of people look at the definition of sports and I don't even want to look at it because that's not really what we're talking about like what the definition of sports of course chess is considered a sport by the Olympic Committee for instance by the way at the end of this I just want to Rattle off as many sports as I can think of it'll probably only be three and I want you to tell me whether or not they're Sports okay the end that's fine that's fine so to me the and I don't know if you guys agree like I don't I just think that the term sport is used loosely I think that there are certain prerequisites for sports and if something's not considered a sport it's not necessarily it's not at all an insult to that activity it just means that it's not a sport you know and and I just think sometimes I think in this day and age it's like well I'm sorry I knocked your knee there I I think sometimes like the word literally is a good example right literally means something",
            "start": 5196.32
        },
        {
            "text": "and I just think sometimes I think in this day and age it's like well I'm sorry I knocked your knee there I I think sometimes like the word literally is a good example right literally means something and and it was used wrong for so long now that the dictionary reflects the the totally wrong usage of the word now literally doesn't mean literal anymore it doesn't you know like they they they had changed that and that really bothers me so I want to get back to a point where words mean something and to me sport needs to be recalibrated in order to reflect the realities of what I think a sport is which is a it's a competition there's a winner and a loser so that's obviously something that's not exist in ors that's something that exists in anything bowling you were talking about before but then it's I think has to be athletic and this is where things this is where get gets this is where things get murky because this is the example I'll use do I think bowling is a sport no I don't",
            "start": 5231.76
        },
        {
            "text": "then it's I think has to be athletic and this is where things this is where get get this is where things get murky because this is the example I'll use do I think bowling is a sport no I don't but there's a there's an amount of athleticism and coordination required to be a top bowler AB ABS there's no doubt about that bowling is tough people that are good at bowling first of all I love the bowl it's a it's a great thing I I consider I consider should go bowling one of these we absolutely should I love to bowl I love fun bowling day the last time bowling was with Greg Barasch it was like a long time ago was it was it was a lot of fun um this is the thing I'll say about that right because everyone's like well it takes you know it certainly takes coordination the the way your wrist moves your approach the the ball you're using the way the ball the way the lanes waxed there's a lot of different kinds of things that permutations I'll say that to that though uh a chef that could can cut an",
            "start": 5271.64
        },
        {
            "text": "approach the ball you're using the way the ball the way the lanes waxed there's a lot of different kinds of things that permutations I'll say that to that though uh a chef that could can cut an onion really quickly is is using dexterity and skill and hand motions and all sorts of things too is cooking a sort it can be if you make it competitive like Top Chef sure Iron Chef sure but that's where it's a competition you know you understand what I'm saying like it can't be based just on a dextrous movement or just on a physical skill you know because a chef isn't an athlete and neither is a bowler you know that's not to that's not to say like bowling is not worth doing it's not to say that if you're a bowl you know if you bowl and you're good at it more more power to you you know that's great it's in other words again it's to say like what does the word mean so competitive dancer dancing yeah I would have to say that D I mean dancing probably is a sport but see that's the one I think",
            "start": 5311.68
        },
        {
            "text": "It's in other words, again, it's to say, like what does the word mean? So competitive dancer dancing, yeah. I would have to say that \"dancing\" probably is a sport, but see, that's the one I think people don't ever call a sport, like when you think of \"So You Think You Can Dance\" or \"Celebrity Dance-Off\" or any other what, what's the other one? You're just saying things now. I'm just talking about America's Next Best Dance Crew, yeah. Well, you talk about that; you're talking about like dance competitions. They just consider themselves dancers; I think they don't consider themselves athletes, and then there's maybe they would say well, I'm an athlete but not to that degree because I think dancing is considered in its own category right? I-I-I it's it's murky; I don't necessarily have all the answers right. Sure what I'm saying is that we have to I would love to come at some point societally just come to a definition of like well, I always use the example like the Olympic Committee considers chess a sport right and I'm like",
            "start": 5352.92
        },
        {
            "text": "we have to i would love to come at some point societally just come to a definition of like well i i always use the example like the Olympic Committee considers chess a sport right and i'm like as someone who grew up playing chess and played chess competitively for a while in his younger years and really enjoys the game chess isn't a **** sport are you kidding me you know what i mean like there's nothing athletic about Chess at all unless you're playing like bullet or Blitz and you're hitting the clock a lot i mean that's basically it yeah but you get a little sweat you build up a little sweat doing that little underarm sweat i i used to go when when i was in high school i used to go to Washington Square Park in New York City to play i play Blitz you did yeah i you went to New York City Park to play chess you did that like did you play against Lawrence Fishburn no oh you thought **** awesome movie great movie Hey Arnold's Grandpa uh so i used to go to Washington Square Park and",
            "start": 5392.48
        },
        {
            "text": "Park to play chess you did that like did you play against Laurence Fishburne no oh you thought \"awesome movie great movie\" Hey Arnold's Grandpa uh so I used to go to Washington Square Park and play Blitz there was a specific variety of Chess we play called Blitz Blitz is five minute size typically in a standard game you might have 90 minutes so this was a way like you're it's memorization and I I always remember I'll never forget it as long as I live my friend was playing this guy and and he was the guy was winning but his clock was out but my friend had not realizing and as long as you don't realize it like the game doesn't end until you call the person out and be like you're out like tip your king over is over and I remember calling him out on it and the guy the guy was probably like 35 or 40 years old like Dead series is's like you don't you don't **** do that you know like you don't like that's not your job to tell him that the clock's out or whatever I'll never forget that",
            "start": 5429.6
        },
        {
            "text": "35 or 40 years old, like Dead series is. It's like you don't... you don't **** do that. You know? Like you don't like that's not your job to tell him the clock's out or whatever. I'll never forget that as one totally anel. I still remember that like clearly horrified. You don't live in the real world **** um so yeah, I used to go but we weren't... we weren't athletes. I used to play against these like crazy dudes that like were really good at chess but they weren't athletic you know? So it's the same thing I was saying about like well if if dexterity or hand skills with your hands or whatever then then cooking is a **** score you know and that's where that's where I think like it's it's it's just not we... we it takes more than common sense it takes parameters you know and I don't know but you're bringing the athlete thing into it sure like does does it need to be though? I think well that's my personal definition of sport is something that is athletic and maybe we need it maybe we need a",
            "start": 5467.0
        },
        {
            "text": "bringing the athlete thing into it sure like does does it need to be though I think well that's my personal definition of sport is something that is athletic and maybe we need it maybe we need a definition for athletic because again yeah I was going to say is there a threshold of athleticism that we would say like for instance U I'm going to name a few things for you okay lacrosse yeah absolutely lacrosse is a sport hockey yeah absolutely shuffle board no curling no like curling takes a physical amount of agility to do you got to skate sideways you got to use those heavy stones on ice yeah so and again it's not that I love curling, it's an awesome game, it's a great game so excited for the Winter Olympics when they I wonder I'm not going to watch them oh I love watching the Winter Olympics 2018 I I think that right I don't know didn't Olympic hockey just happen they changed so that they weren't on the same year cuz maybe that time they were like we got to do something about the",
            "start": 5504.52
        },
        {
            "text": "2018 I think that right, I don't know, didn't Olympic hockey just happen? They changed so that they weren't on the same year, cuz maybe that time they were like \"we gotta do something about the Olympics.\" They've been every four years; it's just people forget about them, so they change it to every other two years. I don't know. To me, I think Summer and Winter Olympics are definitely not happening right now. I know from the Mario and Sonic games that the definition to me, in my personal opinion, is that it's something where you're breaking a sweat or working really hard like so maybe curling is one of those things that are up in the air. But to me, something like darts is a good example; darts are considered uh, B or Billiards are considered sports but I mean like they're really not, they're games and it doesn't diminish what they are, they're",
            "start": 5554.16
        },
        {
            "text": "you know darts is a good example, darts are considered uh you know B or Billiards are considered sports but I mean like they're really not, they're games and it doesn't diminish what they are, they're fantastic games that take an incredible amount of skill but we've we've athleticism and skill are not the same thing because you know what else takes skill, like winning a spelling bee or you know like something, you know what I mean, it's like what are other words then that these things fall into competition, competition game games yeah like darts and billiards and stuff great game fantastic classic classic games just like poker, a game that's that's a perfect example because they call poker a sport and it is not, I would say it's not done, it's it's a card game, like what what I think becomes is the murky territory is you start using the word sport to Encompass any sort of competition period right and that's it's it's hard to to Fathom that it's hard to understand that because to me a",
            "start": 5593.04
        },
        {
            "text": "The murky territory is you start using the word \"sport\" to encompass any sort of competition, period. Right and that's it's hard to fathom that it's hard to understand that because to me a card game is a game; it's a competitive game. It is a competitive activity to me. I don't think of it as a sport but I'm sure people who win millions of dollars at the World Poker Championships every year would probably be like, \"You know what? It's a sport.\" Because there's an intense amount of mental aspect to the game and a physicality to it of having to basically play for that long. Depending on I don't know; I imagine some of these games go on for hours. Um, well with TV and all that stuff you're doing over there, you're just like, \"You have no idea.\" I assume they're playing poker for maybe three months. I think to me the compe... the World Championship Poker never stops. It is like Cricket; it's just a four- or five-day sport. Is it a sport? Yeah, they have tea in the middle of it though. Cricket, they do it; they do.",
            "start": 5637.08
        },
        {
            "text": "to me the comp in the world championship poker never stops it is like Cricket it's just a four to five day sport is it sport yeah they have tea in the middle of it though Cricket they do it they do stop hold on let's let's rewind on this a bit based on Colin's definition sport means you're athletic right there's no mention of hating on TCK I'm not hating on te I love my wife will make me an amazing English breakfast and or Earl Grey at the end of the night with a little touch of Stevie and some half and half I'm you feeling like an ath put me to bed I just I just ran a marathon all right so let's take is Marathon running a sport League of Legends right okay so League of Legends you're a competitive player they're practicing for eight hours a day and they're doing all this their dexterity there's **** keyboard stuff and there's all that **** right all the arguments that have ever been made ABS you'd argue they're not Sports because there's not lism no it's not it's not being we had",
            "start": 5682.24
        },
        {
            "text": "keyboard stuff and there's all that **** right all the arguments that have ever been made ABS you'd argue they're not Sports because there's not lism no it's not it's not being we had a treadmill then yeah yes then it's then it's probably a sport okay no I I think and again as long as you have to develop your quads I think it's a sport that's my definition of sport if you need overdeveloped quads to do this activity it's a sport it's just the thing I'm saying is that that and we've talked about this you know depending on the shows you've listened to so I'm sorry if this is a retread for you you know I do apologize please forgive me for that but if you're good at DOTA you get at League of Legends or whatever or Call of Duty like that's fantastic that's a skill and you should you these guys make a lot of money and they more power to them it's great I have no problem with it in fact I was one of the great staunch defenders in games media of being like when Colin Coward and all",
            "start": 5727.32
        },
        {
            "text": "these guys make a lot of money and they more power to them it's great I have no problem with it in fact I was one of the great staunch defenders in games media of being like when Colin Moriarty and all those guys at ESPN were really giving some people **** for say like for broadcasting the stuff and you know the the League of Legends tournaments or the DOTA tournaments or whatever and they were really being disparaging about those people I'm like it's not that's **** wrong and that's that's inappropriate these people are are competing just like anyone else like and it's great and and it takes a lot of skill and a lot of talent a lot of hard work but a lot of things take a lot of hard work you can't you know judge something just based on like look how quickly their fingers move or look how like look at like I'm like that's not really the dexterity we're talking about when it comes to sports you know yeah a sport is putting on a pair of skates and grabbing a stick and a rub a rubber",
            "start": 5763.44
        },
        {
            "text": "how like look at like I'm like that's not really the dexterity we're talking about when it comes to sports you know yeah a sport is putting on a pair of skates and grabbing a stick and a rubber puck and putting it in a net you know and having a bunch of other people try to kill you while you do it that's a sport and an example of what I think is a sport as opposed to something like golf which is a great game I'm **** awful at golf golf's a great game but you're like you're not doing anything for the most like for the most of the time and then you sit and you use great amount of skill to hit get the ball into the cup right and get the ball into the hole and that's a great skill and and it's awesome and I I watch golf I enjoy it so I'm just saying there needs to be a difference between just because you're outside or you're like doing something with a with a a stick doesn't necessarily mean so like you're you're out there playing uh cornhole is that the",
            "start": 5794.24
        },
        {
            "text": "a difference between just because you're outside or you're like doing something with a with a a sticker like doesn't necessarily mean so like you're you're out there playing uh Cornhole is not a sport well here's the question is there a one person sport because it sounds like so you're saying Golf and bowling and all that stuff tennis tennis I think would probably be a sport but again gotcha like tennis but I mean but is there a one person sport Oh you mean like golf like golf that you just play you're still playing against other people I guess you are playing as other people no but I mean like a more like um Asymmetrical gymnast gymnastics you know like when you're at the Olympics ever I think that's absolutely no but here's the thing are they is that a sport or are they just athletes are they just athletes playing a game well like the like is that the horse whatever is probably a type of Sport the the the Rings and all I mean I consider I",
            "start": 5836.2
        },
        {
            "text": "is that a sport or are they just athletes, are they just athletes playing a game well, like the like, is that the horse, whatever, is probably a type of Sport, the the the Rings and all I mean I consider I mean those guys are crazy athletic, that see that's the next level between what I'm differentiating between I still think cooking such a great example and like just being really proficient in the kitchen that's a great skill being able to chop and dice and cut and and figure all those things out it takes a lot of dexterity a lot of memory a lot of you know, lot of computations having you with yeah exactly but I'm like that's not a sport and so like what is, is how is it any different than some of these other things we're talking about again it's just about having definitions it's not about saying that this thing's better than this and therefore this thing's a sport and this isn't because again I chess is a great example I **** love chess more than anything like in terms of games right like",
            "start": 5871.88
        },
        {
            "text": "that this thing's better than this and therefore this thing's a sport and this isn't because again I chess is a great example I **** love chess more than anything like in terms of games right like in terms of video games or anything like I love chess but the Olympic Committee calling it a sport is **** insane you know it is not it takes not one ounce of athleticism you know to play and not even dexterity if even if you move really slowly as long as you're playing the game adequately and and with standard timing it's not going to really matter I love the fact that you're moving at at the pace and speed of a glacier all right you know so so I I you know what what is Sport I think this this answer is this this is a question that's different for everybody and I don't think there's a right or wrong answer it really just comes back to me what we're talking about exclusivity and all these kinds of things these words must mean something and they just don't see I feel like that's the",
            "start": 5907.4
        },
        {
            "text": "right or wrong answer, it really just comes back to me what we're talking about exclusivity and all these kinds of things, these words must mean something and they just don't see I feel like that's the problem is when you know in order to sort of be open-minded, I feel like that kind of goes uh uh kind of hand in hand with being a little bit on the PC side, being like Oh I'm open to the idea of esports being sports, let's call everything a sport because we can't if we define one as a sport not the other then we're being discriminatory right um and so with esports I would actually argue that maybe it is more of a sport than something like chess because it does take a certain amount of dexterity and there's a lot of computations happening in your brain at the same time you're managing a lot more aspects of it and some of them are team sports as well um so there's that level of of coordination that comes into it like when you have a team and they're they're working together towards",
            "start": 5950.24
        },
        {
            "text": "aspects of it and some of them are team sports as well um so there's there's that level of of uh coordination that comes into it like when you have a team and they're they're working together toward a competitive goal sure it's a game but you know if the only thing missing from that is the physicality of it then it's hard not to argue that it's a sport whereas chess you know I don't even know how chess works truth be told I didn't think it was a real game oh that's interesting chess is you don't know how to play no I know how to play chess I'm terrible at it though I'm terrible at anything that that has has to do with strategy that's why I can never beat XCOM love that game but I got to a certain point I was like I can't I can't do it you know it's I couldn't that's that's why it's hilarious that like you track back through the through the ages of me being alive and I do mean ages um and I'm like I never played World of Warcraft and everyone's",
            "start": 5987.2
        },
        {
            "text": "you know it's I couldn't that's that's why it's hilarious that like you track back through the through the ages of me being alive and I do mean ages um and I'm like I never played WoW and everyone's like why didn't you ever play WoW WoW's awesome I'm like because I could never succeed at World of Warcraft like the OG like wow or World of Warcraft 2 was it Warcraft 2 Warcraft not not at all like no I know that but because I got my ass kicked every time I played Warcraft 2 against Ryan Czy online he be like oh dude I beat you again I'm like it's been 5 Seconds like how'd you beat me never I was like **** Warcraft never do I'm not I'm not even going to see the movie when it comes out good for you Nick movie comes out I'm not seeing it where do you stand on all this is what I'm saying making any sense at all what you're saying makes sense I mean what you're saying makes sense I think that you adding the athleticism thing is you just kind of defining that with that and if if that's the",
            "start": 6024.68
        },
        {
            "text": "any sense at all what you're saying makes sense I mean what you're saying makes sense I think that you adding the athleticism thing is you just kind of defining that with that and if if that's the case then you're right but I don't know like I don't know it it comes down to a definition thing I mean that's my thing is I think that's a game why do I like not a sport it's a game but it's like once it's competitive is League of Legends a sport the I mean it's an e-sport is an esport a sport I I I'm not I am not an athlete I am not a scientist that is you're C I think you're cop-out I think you're cop-out because you don't want the Twitter hate oh are you kidding me no I my thing is it's like my gut tells me Esports are sports yeah just purely based on what I know goes into them and comparing between athletes like or like uh like basketball players and that it's like all right same idea M of work goes into it right it's different things and one's definitely less like athletic but I",
            "start": 6065.76
        },
        {
            "text": "between athletes like or like uh like basketball players and that it's like all right same idea M of work goes into it right it's different things and one's definitely less like athletic but I don't I don't think athletic and sports necessarily need to cuz to me if you would ask me what sports I would be like it's a competitive game so that's my definition I look at gymnastics and I've never actually thought of GYMNASTICS as a sport I thought of them as GYMNASTICS some reason I don't know why I just think you're not really competing against each other in the same way that you would be in like a game where there's multiple people going at the same time and one person dies then it's gone so my definition of sports those wouldn't be Sports because gymnastics isn't a game you get what I'm saying it's just a competition I don't know I don't know what",
            "start": 6109.84
        },
        {
            "text": "you say the game aspect isn't there so my definition of sports those wouldn't be Sports because gymnastics isn't a game you get what I'm saying it's just a competition I don't know I don't know what the **** it is but I think you're right in that these are just words but it's the same like with gymnastics right if you look at that versus boxing you I would say boxing is a sport I would think right they're both judged by three people and they're both at the end of the day you get a score unless you knock the other person out and with gymnastics you can get knocked out basically the same thing you know I mean but it's about it's about the physical nature of the game this undefined thing of the physical nature of what what's demanded of you because if it's just dexterity and computation and all those things that really matter and that's why for instance League of Legends would be a sport then craft cocktail bartending is a sport you know what I mean like and",
            "start": 6153.72
        },
        {
            "text": "and computation and all those things that really matter and that's why for instance League of Legends would be a sport then craft cocktail bartending is a sport you know what I mean like and this and that's what I'm saying it's like that's why we can't I'd rather have a narrow view of what it is than a really wide view and then figure out a way to respectfully categorize everything else as being equal and interesting because I think all this stuff is very interesting but finding a name or a way to categorize it that treats you with respect in other words I'm sorry in other words I think the word sport is put up on a pedestal and if it's not then it's like oh darts aren't a sport **** you like right you know I'm really good at sports is the pinnacle of what any activity it's an inferior activity unless you call it a sport and then it warrants me putting copious amounts of time into it exactly and it's just exactly and to me it's like no no no like sport isn't up here Sport's",
            "start": 6192.48
        },
        {
            "text": "an inferior activity unless you call it a sport and then it warrants me putting cop amounts of time into it exactly and it's just exactly and to me it's like no no no like Sport isn't up here Sports is down here next to right next to in parallel to Pro gaming and parallel to these these these skill games like like Billiards and all these kinds of things just that this particular vertical is where like you put your body on the line in some way and I guess that's kind of like where I st I stand on that like it's not to say you're going to get hurt or you're like punching or getting checked or or getting hit in football I'm saying you're putting your body on the line running the bases in Baseball is way more athletic than cutting an onion it requires less dexterity you know what I mean that's kind of yeah I guess for my thing is I go in the complete opposite direction of you where you're like I think Sports should just be this narrow thing whereas I'm like I don't give it to everything from",
            "start": 6231.52
        },
        {
            "text": "of yeah I guess for my thing is I go in the complete opposite direction of you where you're like I think Sports should just be this narrow thing whereas I'm like I don't give it to everything from now on sports are the the whatever's competitive like that's what makes it a sport so it's like yeah Dart is so is games so is this so is **** dancing so is **** uh cooking or whatever it's like who cares like why is sports a special word like well it's because the reason and this is my argument because this is the things people being like why do you care I'm like I really don't it's just that like I'm not like **** flipping over my bed being like why is a why why League of Legends a **** sport **** bad Mitten what what what it brings back to me is and that's why I used the example of literally and how like you people bastardize and misuse that word so much that doesn't mean what it means anymore we don't even have we have a word for that anymore you know it's like and so if anything",
            "start": 6275.84
        },
        {
            "text": "and how like you people bastardize and misuse that word so much that doesn't mean what it means anymore we don't even have a word for that anymore you know it's like and so if if anything can be a sport and it doesn't matter then why have a category for it at all and why even have the word sport you know like that's kind of where I'm coming from it's the same thing with exclusives where it's like this is an exclusive on this console except for it's also on PC except for you also play on your i exclusive then is it the question is why does it matter when does that word actually mean anything and mean the difference between anything like when it comes down to it like the only thing I can think of is does it belong on ESPN cuz that's the only time the word Sports means anything and all these things are on ESPN well that's the but but remember es is entertainment and sports so it's it's not that channel is not just made for for sports that's why they've had the the spelling be",
            "start": 6313.04
        },
        {
            "text": "all these things are on ESPN well that's the but but remember es is entertainment and sports so it's it's not that channel is not just made for for sports that's why they've had the the Scripps National Spelling Bee forever that's why they show poker you know and all these kinds of things so you have to understand that it's not ESPN is not just a sports program it's supposed to be something that's entertaining that's why they show Esports too because they're smart enough to know that this is going to make them a lot of money in the future and I think that that's a very intelligent thing just like the Scripps National Spelling Bee for some reason makes them a lot of money and they just keep doing it so it's cuz people can't every year people can't believe there is actually a real national spelling bee that happens it's true it's that's there's definitely something about it it's one of those things where I think the last year was the first time it really dawned on me that a there is a national spelling bee it's not just something that",
            "start": 6352.24
        },
        {
            "text": "there's definitely something about it it's one of those things where I think the last year was the first time it really dawned on me that a there is a National Spelling Bee it's not just something that people use as a Trope in movies to make you laugh and to make fun of nerds B you can't spell Dawn I I can't spell anything you've seen my emotion graphic stuff and B Colin watches the spelling bee every year and knows the people that are in it knows that like profiles them like you got stat sheets on these people and you know who's going to do what some of the kids are the same every year kid bad with you but but it's it's also the judges are always don't the guy that reads the words on the script spelling bee is the same guy every year I know that **** what the **** else is he going to do I don't know he's I don't what do you do for a living uh well I'm a school teacher but my claim to fame is that I read the words on the National Spelling Bee on ESPN like awesome spelling bee's",
            "start": 6384.56
        },
        {
            "text": "to do I don't know he's I don't what do you do for a living uh well I'm a school teacher but my claim to fame is that I read the words on the national spelling bee on ESPN like awesome spelling be's F spelling bee is good drama and that's the other thing that people have kind of I think mixed up Sports and drama terms of like well the the the line on the graph is is sports and drama go up this is why the NFL is so successful because the NFL there's few games there's only 16 games a year plus playoffs and every game matters and there's a week's worth of Drama in between every games this guy's hurt this guy said this NFL has dog fight the yeah Michael Vick made dogs fight and the the well he did it yeah anyway yeah I don't want to like throw accusations out there although he he totally messed up and was complicit in that whole thing uh the point is is that the NFL has mastered the fusion of entertainment and sports and drama and Sports in such a way that when someone sees",
            "start": 6426.08
        },
        {
            "text": "NFL has mastered the fusion of entertainment and sports, and drama in such a way that when someone sees like well I was reading about DOTA, like there's some shakeups post the $6 million winning where these DOTA teams are getting broken up, and this is the first time they've really dealt with this kind of thing, where it's like people are getting dropped and released into the wild basically, like happens in football every day. I'm like yeah but let's not conflate also drama and entertainment with sport either - all these things mean different things, and you can fuse these words together into getting specific permutations that give you something like the NFL which is so unique compared to all the other sports leagues, and it's so powerful and and awesome, I mean an anthem is just awesome but it doesn't necessarily mean that just because you have drama with an activity means that",
            "start": 6464.96
        },
        {
            "text": "to all the other sports leagues and it's so powerful and and and awesome I mean an anthem is just awesome but it doesn't necessarily mean that just because you have drama with an activity means that it's a sport either so I guess that's what I'm saying it's like these words you just need to mean something that's all that's all I want is just words that otherwise why the **** do we talk that's true isn't it as a kind of nonary well kinda isn't it weird that we have something like the national spelling bee like we don't choose that as an American Pastime like we have the national spelling bee but for every one National Spelling Bee we have like 500 other sports that don't glorify intellect necessarily not necessarily like I still think that it takes a fair amount of mental dexterity to play any sport at that level you have to be pretty if not book smart smart enough to understand the physics and and and incorporate those into your mechanics right um but it's got It's a little weird",
            "start": 6504.32
        },
        {
            "text": "play any sport at that level you have to be pretty if not book smart smart enough to understand the physics and and incorporate those into your mechanics right um but it's got It's a little weird and a little telling that we we don't glorify more activities like the spelling bee is kind of sucks I wish there were more spelling bees I wish there was stuff like I think there are but nobody watches them nobody watches them they just don't they don't get the ratings they're on ESPN 5 there's an ESPNU I would not be surprised I don't know I watch ESPN there's a lot I mean there's a lot of ESPN ESPN classic ESPN news ESPN one and two Classic's my favorite it's where they all wear the Blazers and it's like that 70s tinge to it you know it's like the '80s like welcome to the 1982 open they're like what the **** what all everyone has beautiful hair horrible teeth they all look like pedophiles and on that note we'll end this episode of The GameOverGreggy Show thank you for uh joining us today",
            "start": 6544.0
        },
        {
            "text": "what the **** what all everyone has beautiful hair horrible teeth they all look like pedophiles and on that note we'll end this episode of The GameOverGreggy Show thank you for uh joining us today episode 90 is episode 90 of The Game Over Greggy Show this table of which I'm not gonna talk too much about remember uh remember that you can uh find us on YouTube for free if you have patience otherwise you can support us at patreon.com kindof funny uh in order to get uh things early uh whether it's the video or the audio or both we appreciate you very much Greg will be back to do a more orderly Game Over Greggy Show I assume next week uh but we appreciate you and thank you for your time we'll see you next week goodbye",
            "start": 6586.0
        }
    ]
}