{
    "id": 1124,
    "video_id": "AGHFaEZYsTk",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "Let's Play Goat Simulator - Kinda Funny Plays",
    "description": "Nick and Tim get nasty in Goat Simulator on PS4.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1439838000,
    "duration": 1000,
    "transcript_chunks": [
        {
            "text": "what's up everybody I'm Nick Scarpino this is Tim Gettys welcome back to another Kinda Funny Games let's play Tim so excited about this one me too this is Game of the Year I'm calling it right Game of the Year goat Game of the Year Game of the Year this year it's going be forever Goat Simulator it's now on PS4 so that's the difference it was P have you ever played Goat Simulator no but I'm excited about the running up a wall why is there a skull thing on it I don't know it's awesome he can run he can jump oh you can manual he can manual that's a that's a skateboarding man this is I'm excited about this all right so we're going to press X start here and just jump in it's a physics playground and you're goat okay should we go to goatville or Goat City Bay goat City Bay let's go to Goat City Bay oh there's two players how do we not know that oh I don't know Kevin I need a controller PS4 controller is at this nasty Beach Kevin was literally in the bathroom ran out of the bathroom pull",
            "start": 0.04
        },
        {
            "text": "\"Bay, oh there's two players. How do we not know that? Oh, I don't know. Kevin, I need a controller. PS4 controller is at this nasty beach. Kevin was literally in the bathroom, ran out of the bathroom, pulled his pants up to run out and get a controller. I love it; he's great; he's just our doer; he is a useful and fun human being. And then Kev, I also need you to do this. Hey, thank you for this. Um, can you also just decrease the volume on the headphones by 50% here? I can do it for you. What happened? Oh, there we go. Here, thank you; that's better. That's you, Budd. Okay, so how do we... okay, let's go back up to here. Can you connect in and sign in as a guest? Hey, hey, I'm now calling Mor already. I've been waiting my whole life. We're going to get you those nasty Goat uh-uh, Goat Simulator trophies. So cool! All right, so I'm going to pick that. I think you need to come back. Can you... oh no, you're good to go. Okay, so let's just go. Am I... yeah, I'm... I just got a jetpack. You got a jetpack; you got all types; you're going to be the what\"",
            "start": 38.88
        },
        {
            "text": "to pick that I think you need to come back can you oh no you're good to go okay so let's just go am I yeah I'm I just got a jetpack you got a jetpack you got all types you're going to be the what are you the Italian dinosaur yeah do you want the Italian dinosaur yeah you should be the Italian dinosaur girl for sure all right so accept there you go no I'm accepting oh how what the **** is happening let's go back to it you accept there you go there it is now we're both accepted okay so play Square all right screw let's just play so I don't know what that just was jump headbutt rotate in air I L1's to BU oh I'm going to do the **** out of that surprisingly and I've heard about this game a million times oh God I like that you have a jetpack oh there a dude I'm scream at him we need to C I need to find you immediately and we need to just wreck havoc oh man I just tumbled my jetpack that's an amazing jetpack though it really is all right just crumbled all right oh God how",
            "start": 113.32
        },
        {
            "text": "I need to find you immediately and we need to just wreck havoc oh man I just tumbled my jetpack that's an amazing jetpack though it really is all right just crumbled all right oh God how do I ignite my jetpack oh no no Tim go go oh well apparently they can jump oh he jumps like crazy height oh my God wait how do I run running oh I just flipped get up goat stupid go get up all right all right get up get up goat hit L too and then wiggle it oh I see hold on I got to change something real quick well crap in can you not invert they started inverted what about options I should be oh there you go God it's going to do it for both of us yep you son of a **** well no now it just didn't do it again that's so weird do you feel that it's inverted mine's not yeah it is okay there's a bounce house oh I want the bounce house come here son you and your bad jeans you getting knocked over what is the whole point of this I don't know look at me I'm actually in the Bounce House wait I want",
            "start": 175.64
        },
        {
            "text": "house oh I want to bounce house come here son you and your bad jeans you're getting knocked over what is the whole point of this I don't know look at me I'm actually in the Bounce House wait I want to go to the bounce house there's a bunch of Look At Me prices Oh I'm I'm I'm prancing this I'm prancing Tim oh you missed it get off my humps how do I ignite the jetpack oh look I figured it out oh God all right it's cool what is happening here this might be the most physically accurate Goat Simulator I've ever played in my entire life yeah got to be honest with you I can ride the check this out to oh my God how come you get the jetpack I don't know but you're so sad you don't have the jetpack all right oh my God look at me I'm upset can I head up this car you going head anything oh my God it just like exploded me into the water the car headbutted you yeah look at me P look at how beautiful I am I got a cute my goat's not having a good time right now where I'm going here no I'm way out there",
            "start": 261.8
        },
        {
            "text": "like exploded me into the water the car head buted you yeah look at me P look at how beautiful I am I got a cute my goat's not having a good time right now where I'm going here no I'm way out there I'm too far I've gone too far Tim call the police oh **** I thought that was a staircase all right go I just did a wall jump this is like Tony Hawk's Pro Skater but better cuz there's a goat it's it might be the best really I can blow up a car but I can't run through some glass oh I can manual though how did you manual it's like Tony Hawk you do it up down do that again all right hold on let me I'm way out look how far out here I got to just get I keep doing a nose mag get my **** together here cuz look I'm like oh I'm not too bad just kind of moving backward toward oh where's that guy grabbing me I just for everyone out there the jetpack is not a Precision Tool which is why I'm swimming backward toward the ferris wheel now once I get to the ferris wheel I will in fact attempt to get on",
            "start": 315.8
        },
        {
            "text": "me I just for everyone out there the jetpack is not a Precision Tool which is why I'm swimming backward toward the Ferris wheel now once I get to the Ferris wheel I will in fact attempt to get on the Ferris wheel or this speedboat now if the goat how'd you get on the car man that goes crazy where's this I want to perform the front flip I'm trying to get the I'm trying to use the jet engine to power the that was the coolest thing I've ever seen no it's not working it's not working and it just all right hold on I like that we can both play why don't you to find me I just want to do a flip oh it's water Tim look at me can you see look up in the air oh God find me I'm just this is to me and I'll be honest with I'm me get this guy let me get this guy get going on here why don't you have a jetpack I don't know why are you a jet you captured the flag we're playing Capture the Flag we're now we're playing Capture the Flag oh man I was just having fun screwing around to me this is the best",
            "start": 380.12
        },
        {
            "text": "Pack, I don't know why are you a jet? You captured the flag. We're playing Capture the Flag. We're now playing Capture the Flag. Oh man, I was just having fun screwing around. To me, this is the best part of Goat Simulator. Yeah, exactly right. Just the open world, scoring around, being a goat, watching my goat ass run – it can't be beat. All right, well you have the flag. Um, oh God. All right. Um, you know what? You go ahead and get the flag. I'm going to just be why am I a red goat because... Flag, I like being not on your team. I don't like you having a jetpack and me not. There's a trampoline. I just found a um a halfpipe. So I'm going be getting on the skateboard real quick. What what are you going to do? What are you going to do? Look at this guy, hey hey bro. He looks kind of like Tim. I'm on a trampoline. I'm going to get... Oh Tim, you're not on a skateboard though. Oh my God, Thep. I really like that it just gives me points for no reason. I want to get on the skateboard. I got your flag bro. I don't care. Oh Tim Tim.",
            "start": 434.88
        },
        {
            "text": "to get oh Tim you're not on a skateboard though oh my God the goat I really like that it just gives me points for no reason I want to get on the skateboard I got your flag bro I don't care oh Tim Tim yeah do you see what's happening right now **** how no God damn it the Goat needs to be able to grab the skateboard a little bit better I'm not going to lie okay no goat no goat stupid goat this isn't good these goats are so dumb get back over yeah oh **** it just shot out into the world now as far as physics are concerned mhm perfect I mean spot on right like I'm not seeing any difference between this and my real life yeah if you put a l bar in this Goat's hand right now it could be me there you go I come get on the thing all right well I'm over this all right what where are you with my flag man I just captured it how do I end the capture the flag I don't want to do it anymore I don't know why you did it I really wish you had a jetpack though I know what hell look at this look at how",
            "start": 488.08
        },
        {
            "text": "man I just captured it how do I end the capture the flag I don't want to do it anymore I don't know why you did it I really wish you had a jetpack though I know what hell look at this look at how fun this is I just want to do a flip oh look at me how do I land stupid looking I did a backflip no good job do you see it no let me do it again all right hold on watch me okay what oh God why is he rubbing his that's not a backflip that's what Portillo does when his anal glands need to be here we go squeeze you see that what how' you do that you jump and then hold L2 and down okay what I just got clipped by a car son of a b**** I want to do a front flip that goat's kind of flying oh my God this might be the best game ever my best I mean what the hell all right guy you gotta line the shot up front for **** this guy knows nothing didn't face him at all that a goat with two rocket propeller grenades on its back flying around ahead of him",
            "start": 557.84
        },
        {
            "text": "I want to get on the roller coaster line, shoot up front for this guy, knows nothing, didn't face him at all. That's a goat with two rocket propeller grenades on its back flying around ahead of him. The goddamn water will be the death of us all. Luckily, look at my goat's eyes. Yeah, I know, demonic goat; they all are. How do you run? Oh, what I just tumbled into. What's this thing do? N, I don't want to get it already in Stupid Capture the Flag mode. I feel like so much of being a goat is just kind of experiencing the world for the first time. Do you know what I mean? Mhm, like this guy. Oh, go! I just got squished. Yeah, I just killed that guy's legs from behind him. Hey kid, hey kid, hey kid. I'm in the ride. How'd you get on the ride, dude? Oh look, this is crazy. Look there's another goat. Hey goat, oh what the hell. Hey goat, thir goat. You think it's Greg; that's definitely Greg. Look he's got that same vapid look on his face. Look at where I'm at right now. Where are you? I'm at the top of the",
            "start": 615.24
        },
        {
            "text": "oh what the hell hey Goat Simulator, you think it's Greg that's definitely GameOverGreggy, look he's got that same vapid look on his face, look at where I'm at right now, where are you, I'm at the top of the roller coaster **** I want up there, I'm about to get down how'd you get on the roller coaster bro oh wait for me, where is it all right I am in the roller coaster all right how do you get over there, I walked over there and there was an elevator that came eventually oh God where oh **** do it Goat, oh I can see your path of Destruction here, oh it blew me out what the **** flip kick, I just saw you land, where you at, I'm right by you, hold on have these stupid arrows in front of me cuz we can't get out of dumb Capture the Flag mode, I'm just kidding it's not dumb competition's awesome it breeds Excellence, what why can't I walk, where are you, I'm near the Goat, I'm near the other Goat, oh there you are, this sweatshirt was a bad idea, do you want my Rockets, yeah can I give them to you, I don't know",
            "start": 676.04
        },
        {
            "text": "what why can't I walk where are you I'm near the goat I'm near the other goat oh there you are this sweatshirt was a bad idea do you want my Rockets yeah can I give them to you I don't know let me drop them nope that button just does something hope that button just lays down why is circle just give up mode it's rag doll mode your guys just screams we should do this with four players next time why are you eating me bro look at my head my head oh no well what did you just do how did you you R2 oh dude look at this I just took that dude down is this a fun slide oh that's how you do it you go to the top and you hold down down yeah oh I see what you're doing you go forward oh maybe not I just I watch me there you go you crushed it you did a good job well oh I want to back kick you come back over come back and kick me how did you kick me before look at me no get off me kick me how did what I headbutt you no **** you look so stupid how did you do that it's R2 I was hitting R2 I'm going to",
            "start": 730.96
        },
        {
            "text": "come back and kick me how did you kick me before look at me no get off me kick me how did what I headbutt you no **** you look so stupid how did you do that it's R2 I was hitting R2 I'm going to headbut this dude can I headb this dude yeah you can headbut anything you're a goat oh God there's a speed boat can I drive the speed boat I tried I don't know if it's possible it'd be cool if you could just act like a normal human B oh there's the elevator it'd be cool if you weren't a go you know well you know what I mean if you could like pilot stuff cuz I feel like goats could really do that no samam get in there this dumbass elevator to come it's not coming back come back elevator **** I got a rocket pack I'll get up there myself I know why the hell do you have a jet pack and I don't I don't know about the power is overwhelming oh look at this oh you can run up the side of things I forgot how do you do that oh I don't even know we should really check the control God damn",
            "start": 831.52
        },
        {
            "text": "I don't know about the power is overwhelming, oh look at this. Oh, you can run up the side of things. I forgot how do you do that? Oh, I don't even know. We should really check the controls. God damn, the elevator's gone again. Get back here, elevator! I'm going to try to run up the side of this thing. Nope, didn't work. Ready and ignite rocket. Oh my God, you went pretty damn far. You can go through the glass. Well, Tim, yeah, this might be a great place to end it all right. Thanks so much for watching everyone. Remember we post Let's Plays almost every day if not twice a day. I just ragdied in the bounce house and it's working out well. If for any ungodly reason you found this entertaining, get out of here, homes! Please feel free to subscribe to Kinda Funny Games where we post Let's Plays every day if not eight times a day. Is that accurate to say? No, no, we don't do a once-a-day Monday through Friday noon uh specific time. This has been the Goat Simulator. You can now play it I guess on PS4. I think it's also",
            "start": 892.76
        },
        {
            "text": "times a day is that accurate to say no no we don't do a once a day Monday through Friday noon uh specific time this has been the Goat Simulator you can now play it I guess on PS4 I think it's also available on PC uh I give it game of the year I'm just calling it right now uh but let me know what you think of it in the comments below and thanks so much for tuning in again I'm Nick Scarpino on Twitter he's Tim Gettys because he was smarter uh and we'll see you on the other side of this rocket oh my God look at me I do spins all right thanks for joining us everyone",
            "start": 963.0
        }
    ]
}