{
    "id": 1110,
    "video_id": "B7ZRU8X4l24",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Why Are DC Animated Movies So Good? - The GameOverGreggy Show Ep. 88 (Pt. 2)",
    "description": "Nick Scarpino talks about his favorite DC Animated movies.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1439276400,
    "duration": 1929,
    "transcript_chunks": [
        {
            "text": "Nick, yes, what's your topic? Uh, I've been watching a lot of, well, reading a lot of DC Comics lately. Yeah, you have man. Uh, largely because I think you guys are rubbing off on me playing a lot of PS4, reading a lot of DC Comics that's the kind of funny way um thinking about getting a Vita. It's the Kinda Funny way um thinking about getting a Vita. Someone actually offered if I got a Vita they said they'd buy me Persona dancing all night is that that I get that correct uh which sounds like something that I thoroughly would not enjoy but I'll give it a shot cuz I'm open to everything thank you uh including taking Kevin to Disneyland with me which I I'm sure would be again 50/50 pro and con uh you literally have different numbers 10 seconds ago all right 70, 70:30 um but one of the things I've noticed is that DC is a you know like Marvel they're great storytellers right and I think they they tend to be a little bit better in the storytelling uh on the comic side than they are on the motion picture side",
            "start": 2.85
        },
        {
            "text": "DC is a you know, like Marvel, they're great storytellers right, and I think they they tend to be a little bit better in the storytelling uh on the comic side than they are on the motion picture side uh for now and that should change we'll see we're seeing them ramp up their their Universe their Cinematic Universe um one of the things I thought they've always excelled at is their Animated Universe oh yeah, and they have they put out maybe I want to say mainstream movies because they do all like the Lego Batman movies and things like that but I want to say that they put out maybe one two really quality animated films from different Studios every year yeah uh most notably the one I just watched was Justice League: Gods and Monsters and it's good, I haven't watched it yet, I liked it a lot um what is it it's uh it's a different take on Justice League where done by Bruce Timm though done by Bruce Timm where uh instead of um Jor-El being the father Zod is the father of Superman so like",
            "start": 54.04
        },
        {
            "text": "what is it it's uh it's a different take on Justice League where done by Bruce Tim though done by Bruce Tim where uh instead of um Jor-El having being the father Zod is the father of Superman so like there's a little Switcheroo last minute and so Superman is as before you swio I mean that's literally what it is you haven't seen it yet no I oh I've read the prequel so I can tell you all about it I can tell you about what's happening um so the idea is on the planet the Justice League is not the Justice League that we know it's not Bruce Wayne it's not Diana Prince is that her last name prince prince um who's Diana Troy you're thinking of Donna Troy Wonder Girl the original Wonder Girl not of course the new Wonder Girl that **** Super Boy before they blinked out continui um instead it's a whole different a whole different uh host of people now they are still crime Fighters but they're like brutal but they all have different like their whole thing yeah exactly that's the whole thing like",
            "start": 93.96
        },
        {
            "text": "different a whole different uh host of people now they are still Crime Fighters but they're like brutal but they all have different like their whole thing yeah exactly that's the whole thing like Batman is actually he it's Man-Bat but even in a different way where he's got to suck blood he's a vampire he doing all this stuff Superman when he comes and he lands he lands in like Mexico his parents bring him across the border to be a migrant worker so he's got this huge chip on his shoulder and like he's he feels like even more of an outcast and Outsider right uh he also says the word Dios Mio a couple times because again now he's been raised in Mexico raised in Mexico which I originally didn't remember cuz it's they gloss over it at the beginning of the film he just that's why he had to read these prequel comments interesting turn of phrase for Superman to say he just he literally sees someone he sees like a dead body he's like the Man and you're like T-Baby T and I'm like whoa what",
            "start": 141.72
        },
        {
            "text": "read these prequel comments interesting turn of phrase for Superman to say he just he literally sees someone he sees like a dead body hes like the M and youre like T baby T and Im like whoa what Supermans trying to seduce me with his mouth words um but its its cool because its an interesting take and its super violent I mean its really violent people die you see a lot of blood theyve been able to go a little more rated R with this I it may still have a PG-13 rating I dont know I dont really understand ratings anymore L but my question is what where do where do you guys land on this and what are you know are you into the animated realm when it comes to DC and why is it that they can make great animated films and tell great stories of the comics but theyve had such a hard time transitioning that over to film well animation is so much more close to comics than live action so I feel like thats the easy answer is its just its hard to make that stuff in real life but",
            "start": 177.2
        },
        {
            "text": "Time transitioning that over to film, well animation is so much more close to comics than live action, so I feel like that's the easy answer: it's just hard to make that stuff in real life, but a cartoon - you know cartoons and comics are essentially the same thing, but one's in motion. You know? So it's like... but okay, so backing up to that, why is it okay for them to make an animated movie where Superman is the son of Zod, but they can't do that, they can't take that risk or that liability with a live-action film because it's the audience it's aimed at. It's like you said he's in \"Man of Steel\" - we get that, we understand that at a base level, whereas a mainstream audience doesn't and that's why they burn so much time with these movies where they have to come out and set up who they are and tell the origin and do this to overexplain who this character is because a gazillion people who have never even heard of him are going to go see that film and get introduced to that character.",
            "start": 221.48
        },
        {
            "text": "origin and do this to overexplain who this character is cuz a gazillion people who have never even heard of are going to go see that film and get introduced to that character in Man of Steel and understand what that is to an extent the Animated Series they're able to go out and take these shots cuz they're building them for an audience that is either still reading comics or was into comics and understands that I don't think and I  I mean i' have to I don't have the financials but the mainstream audience I don't think are downloading these movies and checking them out or buying them off the shelves and coming back like what is going on I mean they're not you can if you go to a Best Buy these movies maybe a month after they come out are like essentially being given away like they're The Bargain Bin stuff for sure but at the same token if we're constantly being told if we're constantly being forced to retell origin stories every five years every time we put something out then",
            "start": 264.16
        },
        {
            "text": "Bargain Bin stuff for sure, but at the same token if we're constantly being told that we're constantly being forced to retell origin stories every five years, every time we put something out, then doesn't that rationale by that same rationale can't we just tell any story at that point? Yeah, it's a no. I'm with you that it's a huge problem that they don't have a way around yet. If people don't know the origins of Spider-Man at this point, they're never going to get it. I mean, Spider-Man's the one real example of that happening now, that's just ridiculous. We're going for a third retelling of Batman where they're going to show... yeah, I mean we already saw in the trailer the slow motion gun, but I feel like Flash is a flashback, exactly like making a nod to what happened in this feels like the first time where they're really doing something in the movie. The you know in Batman v Superman where it's like time's passed, he's an old Batman, we're giving you",
            "start": 298.4
        },
        {
            "text": "what happened in this feels like the first time where they're really doing something in the movie The You Know In Batman v Superman Where It's Like Time's Passed He's An Old Batman We're Giving You Something Different You Know What I Mean And The Same Thing With That The The Jason Todd Joker Theory We Kicked The Show Last Week Two Weeks Ago Like There's That Thing To It Of Like Maybe They're Actually Going To Treat Us With That Modum Of Respect That You Can Get Around And Do Something But Was Always Fascinating About This When We Talk About This In These Animated Universes And I We're Talking About Bruce Tim Right Here In Particular Right Is Like What We Love Avengers And Marvel's Cinematic Universe For And What We're Hoping Doesn't Go Wrong With DC's In This Is What DC's Been Doing When They Were On TV Right It Was Batman The Animated Series And It Was Superman The Animated Series And They Were In The Same Universe And Then It Was Justice League And Then It Was Justice League",
            "start": 340.6
        },
        {
            "text": "when they were on TV right it was Batman: The Animated Series and it was Superman: The Animated Series and they were in the same universe and then it was Justice League and then it was Justice League Unlimited and they kept building up on these things to where it was you suddenly a universe you had Hawk and Dove getting their own episodes of their own you're like what the heck who cares about this I care about Hawk and Dove stupid I care about they got their own episodes and they had their own things and we were in JLU though wasn't it yeah yeah yeah but I'm saying that's that's how it got to at the point where they were like well hell put everybody in there and let's actually tell these things and we're preaching to the choir here again like I don't think Justice Unlimited is hitting on people who I've never cared about a comic before but this Hawk and Dove yes let me watch what you know what I mean like then you get to the point where you've told all that",
            "start": 374.6
        },
        {
            "text": "Unlimited is hitting on people who I've never cared about a comic before but this Hawk and Dove, yes let me watch what you know what I mean like then you get to the point where you've told all that stuff and you have an audience that understands it so yeah now let's go out there and make Gods and Monsters, let's go out there and give adult takes and quotes on you know what these people are and tell stories that are in an animated form that under The Red Hood's a great story but does anyone who want to see a Batman movie that references relies so hard on this Jason Todd storyline you know what I mean that do they understand what that is and yeah but I would right I mean is and that's the thing I think so so is your feeling now that there's there's a little bit of a shift happening where they are trusting that audiences can kind of either figure it out or the relevance of those origin stories doesn't quite matter as much as you hope I mean that's what you hope with these universes",
            "start": 407.04
        },
        {
            "text": "Why are trusting that audiences can kind of either figure it out and or the relevance of those origin stories doesn't quite matter as much as you hope I mean that's what you hope with these universes right and the big test is going to be when you know Robert Jr. doesn't want to be Iron Man anymore and when Hugh Jackman doesn't want to be Wolverine, what do you do when you put a new character in there and how are you explaining that or what are they going to do and how they're going to work with that or do they eventually just blink out the universe you know I mean I feel like X-Men's still tumbling towards that it's all going to be rebooted at some point I feel Marvel's going to get the licensing rights back and they're going to bring them into the universe they're not just like Spider-Man and like that's the issue with Spider-Man is it it didn't need to be rebooted the last time it was yeah like that they messed up real bad had giving him another origin story and all that **** they should",
            "start": 444.84
        },
        {
            "text": "the issue with Spider-Man is it it didn't need to be rebooted the last time it was yeah like that they messed up real bad had giving him another origin story and all that **** they should have just kept giving Spider-Man cuz now him being rebooted now feels super weird and wrong but it's not that they need to reboot Spider-Man now it's that because of the universe it's in they need to retrofit him in somehow which means he has to have an origin story Spider-Man can't couldn't have just been doing **** while the Avengers and all the **** was happening so it's like we're forced into a reboot for Spider-Man because because of the MCU whereas last time we weren't with Spider-Man I think Marvel is where this all kind of gets really interesting because how come they haven't had good animated movies you know I feel like it's because they didn't have the the nuts the basics that DC did where it was here's this awesome Batman series here's this awesome Superman series here's this",
            "start": 477.56
        },
        {
            "text": "good animated movies you know I feel like it's because they didn't have the same nut as dc did where it was here's this awesome Batman series here's this awesome Superman series here's this awesome Justice League and now but I mean it's like in the 90s they they weren't all the same I mean I guess they were the same universe like X-Men and Spider-Man was Spider-Man that was in the X-Men Universe yeah there was like a whole big crossover series and Fantastic Four at least it was in the Animated Series that's we're talking about yeah yeah oh yeah all the 90s animated shows were thought you guys talking about Comics obviously com the comics worlds were same yeah in in the original X-Men yeah Spider-Man gets caught in the mansion and all that stuff and fantastic four as well so it's like but then they've never had success and those shows were successful and so that and now this is going to sound like a normal dc swipe at marvel and I don't mean it to be but it could",
            "start": 516.92
        },
        {
            "text": "like but then they've never had Superman and those shows were successful and so that and now this is going to sound like a normal DC swipe at Marvel and I don't mean it to be but it could it be said that that's the reason that doesn't have the relevancy and that keep going is the fact that I always felt like Marvel cartoons are cartoons for kids and DC cartoons could be for kids but they could be for adults like The Animated Series Batman was wrestling with and doing things like when there's the Batman Cyborg who's wrestling with his he's really Batman like the Dreamscape episode and all these different things like there's themes in there that I would I still want them to put that on Netflix cuz I'd love to watch that start to finish Ian I feel like X-Men had stuff like that too and Spider-Man fantastic for movie Spider-Man did yeah like I watched Spider-Man and I loved Spider-Man I had all the action figures I don't feel like Spider-Man was on that level",
            "start": 550.88
        },
        {
            "text": "Why Are DC Animated Movies So Good? - The GameOverGreggy Show Ep. 88 (Pt. 2)\nstuff like that too and Spider-Man fantastic for movie spider- did yeah like I watched Spider-Man and I loved Spider-Man I had all the action figures I don't feel like Spider-Man was on that level story wasn't on that level I mean you were right the DC 9s cartoons overall get the edge over the Marvel for sure but you know it's not like the Marvel are that much lower it's not like it's modern stuff where a lot of the stuff is kids **** like the '90s stuff and I feel like that that's where they've separated here especially right is the fact that Marvel is still making kids **** where DC is like here's this oh we love God monster is not a kids we love that awesome Jeff Johns Brainiac run let's put it out as the Superman movie Dark KN return Dark Knight Returns let's put that out as a it's definitely not a kids movie I think you guys are overlooking you know some you talked about but you're not you know you're not you're implying it maybe you're not explicitly saying it which is you",
            "start": 590.64
        },
        {
            "text": "definitely not a kids movie I think you guys are overlooking you know some you talked about but you're not you know you're not you're implying it maybe you're not explicitly saying it which is you know when I flirted with comics in 1994 1996 1997 when I was like really getting into that stuff it was the Batman: The Animated Series that really was pretty seminal for me to get into Batman I really appreciate and what we're not really saying which I think is somewhat obvious is that the Marvel cartoons like I never watched Fantastic Four before but I watched a lot of Spider-Man I watched a lot of X-Men they're very crude compared to compared to the way DC's cartoons were done Batman and Superman the ones I watched in terms of Animation in terms of the way they look and the way they hold up the writing like all that kind of stuff like even at the time I was like these are very second-rate compared to what DC is doing you know and I don't know if that's a commonly held you know commonly held",
            "start": 630.2
        },
        {
            "text": "writing like all that kind of stuff like even at the time I was like these are very second-rate compared to what DC is doing you know and I don't know if that's a commonly held you know commonly held notion or something that I'm just I just saw it a different way than other people saw but I remember even back then I I watched Spider-Man and X-Men every day after school and Batman was like a treat man when the Superman came out I even watched a little bit of that too because it was the same style looked the same I mean this is this this is the Superman from there was a vision with the DC cartoon exactly like I just felt like they weren't the X-Men it reminds me a lot of Transformers and GI Joe and stuff where like you can tell that they like in in hindsight they were just shipped out overseas they were done really crudely they do not look good uh when I look at and they're not that the X-Men don't get me wrong X-Men aren't that bad but they're they're I feel",
            "start": 665.28
        },
        {
            "text": "out overseas they were done really crudely they do not look good uh where when I look at and they're not that the X-Men don't get me wrong X-Men probably aren't that bad but they're they're I feel like kind of similar to that whereas opposed to whereas opposed to the DC ones especially Batman I feel like those are really good and that's the the one thing that's the way I feel about some of these movies today it's almost like a common theme where I feel like I'm maybe more DC aligned just in that sense but it was it was another thing too which was that I feel like Batman and Batman Superman were able to focus on one person and the character the cast of characters like the villains the the the Rogues around them whereas opposed to X-Men and Spider-Man to a much lesser extent Spider-Man there was a lot of sinister six in all those cartoons and weird stuff like that but there's a lot of experience in other words they weren't there was not a lot of exposition it seemed like",
            "start": 698.6
        },
        {
            "text": "was there was a lot of sinister six in all those cartoons and weird stuff like that but there's a lot of exp in other words they weren't there was not a lot of exposition it seemed like there wasn't a lot of reason for them to focus on one character at a time they had to focus on a bigger group or a bigger you know to me when I watched Spider-Man I felt like the draw was the enemy in my in my opinion um that's how I fell in love with Shocker that was where that joke came from um so I mean that's just as someone who's quite ignorant on comic books that was always my takeaway from that era because that was when I was actually engaged in comics yeah well I that's what I said about the issue the X-Men and Spider-Man series OB you know I think what you're saying the actual style of Animation was more complex the visual Styles they were going for was a lot more was kind of hearkening back to the 80s where they would actually try to draw characters a little more true to form with with",
            "start": 734.36
        },
        {
            "text": "was more complex than the visual styles they were going for was a lot more was kind of hearkening back to the 80s where they would actually try to draw characters a little more true to form with realistic features um but what that unfortunately did was it made the film, specifically X-Men I think Spider-Man as well um X-Men I think ended prematurely if I remember correctly because it was just so damn expensive to create and make and so I think where they relied heavily on the visuals I think that was where you saw DC stepping in and go let's not make that mistake let's develop a visual style that is elegant and simple and that will just allow us to tell really cool stories very very quickly um and experiment because as the cheaper the series is to create and I'm I'm not basing this on any facts I don't know for sure but the cheaper the styles are to create the easier you can bang them out and take more risks with them and I think and worry more about the things that matter",
            "start": 769.6
        },
        {
            "text": "this on any facts I don't know for sure but the cheaper the styles to create the easier you can bang them out and take more risks with them and I think and worry more about the things that matter that matter which is the storytelling character development and you know the actual you know paying attention to the acting um and and making sure that and I don't know if this is a conscious decision or if this is just the the environment of the time and and how everything evolved and progressed but Kevin Conroy as uh as Batman you know to me the second he started doing that voice I didn't even question it it just he was Batman and somehow some way has still is still Batman I mean his voice is still synonymous with Batman seeing it all the way through most some of the Animated Series um I think they've branched out now and they're starting to find other talent for Batman specifically in Gotham they shake it up and do stuff where they'll bring in Troy Baker they'll bring Roger Craig Smith",
            "start": 807.68
        },
        {
            "text": "they've branched out now and they're starting to find other talent for Batman specifically in Gotham they shake it up and do stuff where they'll bring in Troy they'll bring Roger Craig Smith they want this Batman to sound differently but still like when it's a Batman thing they bring in Conroy even now there's like they make movies that do take place in that Universe in the DC Animated Universe whatever I think is specifically I think it's supposed to be in that universe but it's an alternate universe but it is it is does that make sense it's a weird concept of terms it is in that universe but it's just an alternate telling of that story with very same style same same character design same characters but it's just the BR you'll go right into that and yeah you you'll be like this is familiar territory yeah yeah sorry I don't I don't mean to be rude by the way I'm just I'm watching the X-Men intro because I haven't seen in so long it's basically the way I remember it",
            "start": 846.6
        },
        {
            "text": "like this is familiar territory yeah yeah sorry I don't I don't mean to be rude by the way I'm just I'm watching the X-Men intro because I haven't seen in so long it's basically the way I remember it it's not like I said it's that same it's the same Spirit as the 80s stuff it's just it's a little bit better done but doesn't have that Soul Man Batman had **** soul it did I really really really think those Batman cartoons being quite ignorant about Batman um still even though I love him I mean that was when I really fell in love with that character man they're **** a those cartoons are **** rad this whole look which is you know Superman was inspired obviously by that look of Batman um it's so **** it's so it's perfect are you kidding me it's **** perfect like I like I I I I don't know I love it I think it looks great I I always have very fun memories of it do you remember the Superman Batman crossover yeah Joker the giant Jade statue that was scripted tonight yeah that blew my",
            "start": 886.56
        },
        {
            "text": "I know I love it, I think it looks great. I always have very fun memories of it. Do you remember the Superman Batman crossover? Yeah, Joker and the giant Jade statue that was in \"The Dark Knight\" tonight. Yeah, that blew my mind. That was awesome. That was what we had been waiting for forever, right? Yeah, that was so good. I used to rent all the VHS's of all the Batman and Superman movies when I was a kid. Yeah. I have a quick question because you guys were talking about uh as I know and I'm sure you know people who watch our show know a lot more about stuff than I do but uh X-Men and Spider-Man being kind of cast out during Marvel's problems in other words Sony acquired I guess Spider-Man, I don't know who owns X-Men. What is the deal with Fox? Is it public what the deal is in other words is the deal in perpetuity like do they forever control because because or Tim was saying like maybe they get them back but like why would that ever happen they won't get them back until they sell them.",
            "start": 924.56
        },
        {
            "text": "is the deal in perpetuity like do they forever control because because or Tim Gettys was saying like maybe they get them back but like why would that ever happen they won't get them back until they sell them back the thing is like we never thought that Spider-Man would go to Marvel either that's because Sony Studios is hurting right now yeah and that's how it's all going to happen is that everybody's going to get weak and they're going to continue to see knock on wood depending on who you are this Juggernaut of the Marvel Cinematic Universe continue to snowball and grow and that's when eventually Fox has to do the same thing I'm just like **** if we could cross over it would be let's let's do Avengers verse X-Men you know what I mean our X-Men versus their Avengers and yeah I mean you hopefully you will see that Sony Sony is you will money makes it all go around and that's that's what people see that's the dollar signs I think they're but what I'm hoping for and what I",
            "start": 962.2
        },
        {
            "text": "I mean you hopefully you will see that Sony is the money maker and that's what people see, that's the dollar signs. I think they're but what I'm hoping for and what I would hope is that there, I mean obviously there's a lot of competition between these studios but there's so much money to be shared in revenue yeah that it would be I'm sure they're talking in fact you know they're talking right they're obviously talking they're talking about bringing Spider-Man back into the fold um eventually what you're going to see is Fox is just going to turn around and relicense those characters out to Marvel out to Disney because it's not uncommon by the way this happens all the time in TV where um in Fox Television Studios they'll produce something that then goes on NBC just because maybe they don't want to actually distribute it or NBC wants to go sell or vice versa right um I think there was just a law passed there was",
            "start": 995.08
        },
        {
            "text": "produce something that then goes on NBC just because maybe they don't want to actually distribute it or NBC wants to go sell or vice versa right um I think there was just a law passed there was a law and I don't know if it's it's still in place where you had to have a certain percentage of your programming if you own a television network come from outside sources and that may have just changed I'm not quite sure uh um but so so it's not uncommon for Fox to have to work with someone else and it behooves them to because if they're making a lot of money with their X-Men cinematic you know the X-Men movies that they're making why not just then turn around and license those characters that you've built because I mean like it or not those are very popular franchises Days of Future Past prove that it was popular it did well they're making Apocalypse it looks cool I'm going to go see they're making more than Apocalypse Apocalypse and Gambit and Deadpool I just mean like the actual X-Men",
            "start": 1027.76
        },
        {
            "text": "it was popular it did well they're making apocalypse it looks cool I'm going to go see they're making more than apocalypse apocalypse and Gambit and Deadpool I just mean like the actual X-Men like just the X-Men movies which feel like The Avengers movies right that's what they're trying to go for where they're trying to build up their own Deadpool is own is a part of the X-Men Universe he's owned by Fox I believe yeah that's why he was in X-Men: Fantastic Four they had Daredevil but they lost Daredevil back to Marvel they have Fantastic Four that's useful um I'm I'm super interested I'm I'm I'm really interested to see how that one does that movie looks like **** see I'm most interested about that movie I have not seen a single trailer for it I've stayed away from it completely cuz I just want to see what happens but I'm interested to see how they get it involved with the the X-Men and like how they make that part of the they said they're going to do it yeah well no but I mean so they're",
            "start": 1067.28
        },
        {
            "text": "to see what happens but I'm interested to see how they get it involved with the X-Men and like how they make that part of the DC Universe, they said they're going to do it, yeah well no but I mean so they're going to have a Fox Universe, they have to right, well they already sort of have a Fox Universe, no one thinks of it in terms like that but I mean they've made a bunch of Fantastic Four movies already, well those don't exist anywhere though, no but that's what I'm saying is though they have they have those two big franchises that they could use, those are two big teams now they're not the Avengers but I would have argued back in the 90s that obviously to me X-Men was way cooler and way more important and impactful uh to mainstream than the Avengers but and that's your point is kind of being proven to a sense where it's like Yeah The Avengers and stuff is the marquee thing because that is where it that is Marvel, and it is the proper canon or whatever but it's like",
            "start": 1109.2
        },
        {
            "text": "is kind of being proven to a sense where it's like Yeah The Avengers and stuff is the marquee thing because that is where it, that is Marvel and it is the proper cannon or whatever but it's like X-Men obviously very successful yeah so and cooler let's be honest it's like right they're they're right there you know it it I've never thought about it but it is somewhat impressive that I think to the mainstream audience in with Marvel typically X-Men would probably be the most visible for them and it's amazing that Marvel as with their Cinematic Universe has done what they've done with really I don't want to say B tier that's not true but like characters that maybe it is in a way like characters that are just not as well known it's actually somewhat impressive that they did it without Spider-Man and without X-Men it's amazing the most well-known Marvel character is Spider-Man Wolverine and they didn't have either of them and they still and they still made it work it's it's it's it's",
            "start": 1146.12
        },
        {
            "text": "and without X-Men, it's amazing the most well-known Marvel character is Spider-Man and Wolverine, and they didn't have either of them, and they still made it work; it's pretty impressive. But I think I see that not knowing very little about The Fantastic Four, I have two questions about that: we can't really answer is that like does anyone, I don't mean this to be disparaging, but like does anyone really care about The Fantastic Four? Is this like a comic book that thrives and does well; are there people who are ride or die for it? This gets into a whole other crazy can of worms because all these film rights have been like you know they don't do The Fantastic Four; Marvel's been slow in its role with The Fantastic Four Comics, so it's like there's a lot of political games going on in every sense. That's why eventually they'll find a way to bridge that gap; they will; there's money to be made; it's silly that there are those two sides of the camps; it'd be silly for",
            "start": 1182.32
        },
        {
            "text": "games going on in every sense that's why eventually they'll find a way to bridge that gap they will there's money to be made there it's silly that there are those two sides of the camps it'd be silly for those two sides of the camps not to be talking about a revenue share somehow right it's as simple as me saying I own the rights to Fantastic 4 Tim wants to make a Fantastic 4 movie in his in his universe I will license those rights out and we will talk to each other so that we are not stepping on each other's toes when we develop these two series yeah makes sense it's happening with Spider-Man it's happening with Spider-Man it's going to happen with Wolverine like Marvel doesn't own the X-Men it's it's going to film rights my second question is so so we've established that because that's really interesting to me I never really thought about that the business game of just **** your competitor until that until they just can't until it's just unsalvageable which is really quite",
            "start": 1222.16
        },
        {
            "text": "That's really interesting to me, I never really thought about that the business game of just beating your competitor until they can't compete anymore, which is really quite clever. The second thing because I'm always curious like on that level, who's really behind it? Like, I'm all about Mr. Fantastic, that's my guy now. I look at the Fantastic Four and I'm like, the name itself is very reminiscent of a different time. But the characters are cool, I guess. I just don't understand why they keep going back to this well. But my second question is, am I the only one who thinks that this Fantastic Four movie isn't going to do well? Because I'm just not sure if it's going to be good or if people expect it to fail. This is a big question, yeah. If anything, I think people expect this one not to do well.",
            "start": 1257.24
        },
        {
            "text": "Four movies is just not going to do well because I'm just I'm just or is it just going to it's a big question this is a big question yeah I mean if anything I think people expect this one not to do well because it's it is Fox which right now is seen as the I mean there's really only two no three universes I guess with DC but Fox is kind of the last place one overall I would say but they have X-Men which is huge and people right now like X-Men more than they ever have they are in a good place with all that stuff they are not they were able to bring it back with Days of Future Past they brought even were in a bad place with First Class I'm sorry you're right I keep forgetting brought back First Class they brought it back with Days of Future Past they they look like they're in a good place Deadpool looks awesome all this stuff looks great but so far they haven't been able to have any other series that is an X-Men work so and Fantastic Four this I it's worth it's also everything you're saying is right",
            "start": 1295.88
        },
        {
            "text": "awesome all this stuff looks great but so far they haven't been able to have any other series that is an X-Men work so and Fantastic Four this I it's worth it's also everything you're saying is right it's like Fantastic Four is not that Marvel thing that everybody's like waiting for and wanting but neither was Iron Man or Thor sure and that's that's what I'm trying to say that's why everything it's it seems like it's very unpredictable because I think with Fantastic Four is because I think Nick brought it up when we were talking about the movies we had our argument on the show about the movies and all these kinds of things is I I'm most curious about how Fantastic Four does to see if they just can that second Fantastic Four completely exactly um or if they they might maybe they filmed it all at the same time you know no no that would have been new is there even a second one announced yes it's on it was on that docket went through and that was my question too of like yeah if this one",
            "start": 1335.12
        },
        {
            "text": "all at the same time you know no no that would have been new is there even a second one announced yes it's on it was on that docket went through and that was my question too of like yeah if this one underperforms do you really do that but that's Fox having to either bite down and we're going to get through this or Fox let's talk to Marvel what do these guys I hope it performs and I hope it performs because when movies when movie studios like Fox look at their lineup for the next few years they they need to be able to account for the fact that this movie is going to make its money back so they can take risks with things like a \"Raiders\" R-rated Deadpool movie oh we saw that with the Superman documentary what's that we saw that with the Superman documentary they talked about how movies and that's why Superman ultimately yeah that's and that's unfortunate and right and right now like I I'm really proud of Fox and I'm really looking forward to the fact that they're actually trying to",
            "start": 1372.56
        },
        {
            "text": "and that's why Superman ultimately yeah that's and that's unfortunate and right and right now like I I'm really proud of Fox and I'm really looking forward to the fact that they're actually trying to pioneer the R-rated superhero film which is um really cool like when you get when you get that sort of experience I can't remember 300, pretty sure 300 was yeah 300 had to be rated R because there was a need for and a ton of violence in it but like that movie specifically well I was I was like the violence right there and blood well the violence they can get around by like like uh uh shading the blood a different color but I forgot that Lena Headey got uh incredibly nude in that film incredibly nude yeah it was a fantastic scene my favorite type of nude but movies like that experiences like that right with Sin City things like that where you're like I'm getting a comic book a graphic novel experience let's not let's stop calling it a comic book movie this is more of a graphic novel experience",
            "start": 1407.44
        },
        {
            "text": "Sin City things like that where you're like I'm getting a comic book, a graphic novel experience. Let's not let's stop calling it a comic book movie; this is more of a graphic novel experience, that is where I think the future of that that genre can go well. Bringing it back to your topic of why DC animated so done so well, why why DC animated does so well, why they've struggled in the movies and why Marvel's able to succeed, I think is the fact that I think DC animated is the most DC stuff they do in terms of something outside of comics. You just con are those are the creators who get to step over and let's let's take our let's take one of our best series ever and make it into a thing. Whereas with a movie, it's like all right Zack Snyder make and sit down and it's three revisions and this producer owns this so all these different people get in there and toy with it and muck around with it when it should just be all right Jeff Johns what do you want to make? I say that he had a hand in green.",
            "start": 1445.36
        },
        {
            "text": "owns this so all these different people get in there and toy with it and muck around with it when it should just be all right Geoff Johns what do you want to make I say that he had a hand in Green Lantern of course so well yeah but Green Lantern, a lot of hand that is the problem is when you you know the animated movies I don't know how much they cost to make but they probably have to in the tens of millions um low tens of millions I don't think they cost that much um but then you're talking about L Green Lantern or a movie like Batman Superman where you're talking upwards of $150 to $200 million yeah there's a lot of people that start to get a little anxious when you start spending that much money and of course then they want to dip their hands and then muddle the pond up a little bit um but then why not just take a risk and bring in a story consultant like uh any of the any of these guys that are writing you know better than I but I would and I first off I think they're doing that now",
            "start": 1484.0
        },
        {
            "text": "then why not just take a risk and bring in a story consultant like uh any of the any of these guys that are writing you know better than I but I would and I first off I think they're doing that now but reason things have been messed up for a long time and again you know better it's just Hollywood stuff no I think Marvel is the Marvel seems to be the thing that says all right come in and tell us how do we make these heroes into these movies great awesome and and then X-Men X3  **** you McG's got a great idea he's going to go out and do it you know what I mean like that poor McG had a that wasn't McG it was Brett Ratner I think oh sorry my bad I hate McG because he was supposed to be he was attached to a Superman movie that never happened so I have a different reason to hate a lot of people have been attached to that super I know uh no but I mean that's the thing I I think hopefully they're learning from that again my my knowledge base for this is a little bit off because I don't",
            "start": 1515.8
        },
        {
            "text": "People have been attached to that Superman, I know uh no but I mean that's the thing I I think hopefully they're learning from that again. My my knowledge base for this is a little bit off because I don't really follow who's who's writing the actual comic books and the and the movies um so maybe they they are very well starting to bring in story consultants, but that was the power of the Avengers right as they brought in Joss Whedon who had written comics, who had who had come from that world and developed specifically some of those characters. I think you see DC doing that now in terms of who who they're bringing in consulting and how they're making those happen. Who should be the guy who's the who's the best writer of Batman? Jeff Johns yeah well no it's Scott Snyder for Batman, Jeff Johns overall but yeah I don't know I don't think Scott Snyder's being consulted for the movie right now or anything but like that I mean if you wanted a Batman tale would have got you think Zach Snyder",
            "start": 1551.64
        },
        {
            "text": "Overall, but yeah, I don't know. I don't think Scott Snyder's being consulted for the movie right now or anything. But like, if you wanted a Batman tale, would have gotten you thinking Zach would just talk to his brother there's another director that they could have used Chris Nolan. Oh, you mean the Godfather of the picture? Well, that's what I'm saying is like we're talking, we're not going back down this hole. I, I don't want to go back on this whole thing but I will say because like the the overwhelming success of Marvel has eclipsed in terms of volume has eclipsed the fact that I still think that those movies are way better. So it's it's and I I think that from the movies I've seen I enjoyed them, but you know they're different. So I just think that I I do I want to say that I think DC has found their success. My my thing is that I think they found their success very early and it can be very perilous to their future. You know, that's the one thing I'm I'm most excited.\n\nCorrected errors:\n\n* \"Scott Snider\" → \"Scott Snyder\"\n* \"Batman tail\" → \"Batman tale\"\n* \"Zach would just talk to his brother there's another director that they could have used Chris Nolan Oh you mean the Godfather of the picture\" is a corrected fragment, but I kept it as is since it was already in a coherent sentence.\n* \"I've SE\" → \"I've seen\"\n* No other changes were made.",
            "start": 1583.64
        },
        {
            "text": "that I think DC has found their success my my thing is that I think they found their success very early and it can be very perilous to their future you know that's the one thing I'm I'm most excited about um because there's such a set definition now of success for them yeah I think it's going be that's what I'm gonna I'm going into Batman v Superman when it comes out with that exactly in my mind so it's and I'm not and I'm not going to be the only one you're going to see B make no mistake there's no way Batman beats Superman tanks no way that movie makes I'm not saying that at Allon I'm not saying at all I'm saying of course it's going to do that's not at all saying what I'm saying is in terms of quality and the Cadence of that movie and everything about it that's it's going to be in everyone's mind and that's and to your point we're all going to see it it's going to do incredibly well the question is what happens after that what happens when everyone walks out of that",
            "start": 1618.32
        },
        {
            "text": "to be on everyone's mind and that's and to your point we're all going to see it it's going to do incredibly well, the question is what happens after that, what happens when everyone walks out of that theater with a general not disdain, I guess what's the word I'm uh Malia right? They walk out and they're just like me, you know, Batman Begins, and you were like all right I need to see another one of those. That was actually pretty unique. Um, so I mean that that will be the that will be question because they're you know are they are they focusing on the story and I guess that's that's the nature of my point is what can DC do to focus more on the story less on the visual more on that story craft whereas I think Zack Snyder is doing that but somewhere along the lines they just haven't hit it yet like Man of Steel just didn't quite hit it, it had a lot of great elements in it. Yeah, you if you think about the story of that film it was I thought it was really cool, it's a cool sci-fi take, I mean it's a",
            "start": 1651.44
        },
        {
            "text": "Man of Steel just didn't quite hit it; it had a lot of great elements in it, yeah. You if you think about the story of that film, it was really cool - it's a cool sci-fi take, I mean it's a cool sci-fi film, it's great, yeah. I liked it. I love the beginning, I love the setup; they went wrong somewhere in the middle, but can they get that back? I don't think it was that far, you know. I don't think they went they diverged that far from where they needed to be with it, and see here's the problem - here's the problem with what that is to wrap all this up is the problem of what you're saying is how would you have felt about Man of Steel if it was an animated film? You just watched The Tale last night where Superman was a migrant farm worker who said \"OS mios\" or whatever, and like it's like I'm saying - like you expect the comics to do whatever the **** they want, but when we come to a motion picture, we expect something, and we didn't get it with Man of Steel. This is my argument; this movie.",
            "start": 1694.32
        },
        {
            "text": "saying like you expect the comics to do whatever the **** they want but when we come to a motion picture we expect something and we didn't get it with Man of Steel, this is what my argument is - this movie continues to be that when my expectations were not met I took time off and I came back a year later and watched, I was like you know what, this was good, it's setting up a universe in a different way, so like the Malus and stuff again, I think if everything goes right for them Suicide Squad will be the one where it's like oh this is the universe, this isn't just X, you know what I mean, you know what I'm saying, and like I feel like that takes so much time to build, what's been against DC so far is the fact they have one movie out there where everyone turned and went well Zack Snyder can't make a **** Superman film clearly maybe he's making his Superman film just like these animated series films are, this I mean like Superman Doomsday, I remember watching and I'm like okay oh cool",
            "start": 1730.52
        },
        {
            "text": "make a **** Superman film clearly maybe he's making his Superman film just like these animated series films are this I mean like \"Superman: Doomsday\" I remember watching and I'm like okay oh cool Superman and Lois are **** that's a great I'm glad they're doing that I'm glad they're not **** me too wait whoa whoa whoa whoa whoa Superman's **** Lois and Lois doesn't know he's Clark what the f like you know what I mean and then but it was like all right whatever this is your story go ahead and do it and meanwhile \"Superman Returns\" he has an illegitimate child with with Lois and I was like what the **** resolve this resolve it now yeah that was we should we can dive into that that \"Man of Steel\" again on the plane where come back from uh where were we coming back we've had this conversation a million times I'm just saying that's animated versus motion picture is a different thing it is well I guess we'll have to",
            "start": 1769.16
        },
        {
            "text": "come back from uh where were we coming back we've had this conversation a million times I'm just saying that's animated versus motion picture is a different thing it is well I guess we'll have to just we'll have to wait and see see I think DC succeeds because they let creators who go out do these animated films and tell whatever tale they want like I always talking about Batman: Assault on Arkham right where they just blow a dude's head off in the very beginning you're like all right awesome you know what I mean and now they're they've announced Killing Joke and it's like my one knock with DC animated films is it's hard for me usually to get excited for them like you already read the story I already know everything's going to happen usually no not with Gods and Monsters and Assault on Arkham those were bad examples but like the other ones right where they're telling Superman: Brainiac or Doomsday even but it's that's a cool example right cuz you said you've read the prequel yeah so",
            "start": 1809.84
        },
        {
            "text": "those were bad examples but like the other ones right where they're relling Superman Brainiac or Doomsday even but it's that's a cool example right cuz you said you've read the prequel yeah so that was a fun experience I didn't know there was a prequel I assumed there was actually I I saw I think I saw it on the DC Comics the digital firsts I highly recommend it it was fun right on the plane right on Nick yes you had a good topic and I liked it of course cuz it was comic books do you know who sponsored it I do not Loot Crate nice noise would you classify yourself as a geek game or pop culture nerd I would then Loot Crate is the subscription box for you for less than $20 a month you get six to eight items of gamer and pop culture license gear apparel Collectibles unique one-of a kind items and more make sure you head to loot crate.com kind of funny and enter the code kind of funny to save $3 on any new subscription here's where it comes full circle on your topic this month Loot Crate",
            "start": 1839.56
        },
        {
            "text": "and more make sure you head to LootCrate.com, Kinda Funny, and enter the code KindaFunny to save $3 on any new subscription here's where it comes full circle on your topic this month Loot Crate is cowering in fear for the return of villains, villains whether that was good like we practice this whether you're whether they're terrifying or tragic something about bad guys and gals is just plain fun probably the snazzy outfits Army of henchmen and totally relatable treat yourself to some sweet loot attitude nice good read good read thank you thank you thanks for joining us as we celebrate our darker side with the Epic items from Marvel an exclusive DC figure that I will take out of the box a unique wearable that we've never put in a crate before and more uh so you have until 19th, 9 p.m. Pacific time to subscribe and receive this month's Loot Crate when you the cut off happens it's over and you can't get it again so go to loot.c kindof funny enter the code kind of funny to save $3 on",
            "start": 1872.32
        },
        {
            "text": "time to subscribe and receive this month's Loot Crate when you hit the cut off happens it's over and you can't get it again so go to lootcrate.com/kindafunny enter the code kindofunny to save $3 on your new subscription today thank you Loot Crate as always thanks Loot Crate",
            "start": 1912.72
        }
    ]
}