{
    "id": 1509,
    "video_id": "qP8lO_0ldkA",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "James Schuler"
    ],
    "title": "Kinda Funny Does The Whisper Challenge",
    "description": "Support Kinda Funny: The Animated Series!: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1453924802,
    "duration": 926,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome to Kinda Funny. I'm Tim Gettys. This is Nick Scarpino. That is Greg Miller. And over there, we got your boy Colin Moriarty. Today, we're going to do the Whisper Challenge. It's been a thing all the internet kids have been doing for a really long time. So, we decided we're going to do it on January 5th, 2016, the day of our second anniversary. First anniversary. It's our first anniversary. First annary each other. We're doing we're doing a live stream to support Kinda Funny: The Animated Series which the first episode just went live. It's a great thing. Go over to patreon.com/kindafunny to show your support there because this stream is going so well. We have so many goals. This is one of the goals. We hit it. We're doing this video for the stream. And for all you kid beautiful kids out there watching beautifully on in on the YouTubes calling I'm like that cyborg from uh from Star Wars. From Star Wars. Lobot. No. Remember the other guy I'm talking about and best.",
            "start": 0.08
        },
        {
            "text": "kids out there watching beautiful this on in on the YouTubes calling I'm like that cyborg from uh from Star Wars. From Star Wars. C-3PO. No. Remember the other guy I'm talking about and best. Yeah. R2-D2. Hey, who wants to go on the Reading Rainbow? You look like LeVar Burton. I know that was a joke. That was very good. He hosted Reading Rainbow. You crushed it. Thanks. So, this is how this works, guys. As always, I'm not that informed, so I'm not sure about the rules of this, but I watched I watched a video and I'm like, I think I get the gist of this. So, it's essentially the game of telephone that you would play when you were a young, but instead of of, you know, the whispering to people and everyone messing it up cuz they're **** right? Instead, y'all three are going to listen to some loud music. Gotcha. The the music of choice here is \"Blunt Blowin'\" by Lil Wayne. Mhm. From Tha Carter. Sure. And um you're going to play it loud. So, you can't hear anything except this music",
            "start": 41.36
        },
        {
            "text": "loud music. Gotcha. The music of choice here is \"Blowin' in the Wind\" by Lil Wayne. Mhm. From the carnivore. Sure. And um you're going to play it loud. So, you can't hear anything except this music in your head. Over on patreon.com/kindafunny. Beautiful kids out there. They wrote a bunch of short sentences. I'm going to choose one of those sentences. You guys are going to be like looking away to do your own thing. I'm going to look at Nick and you're going to say and I'm going to say the sentence to him, but I'm still listening to \"Blowin' in the Wind\". Yes. And then you're going to repeat the sentence back to me. Okay. All right. And you're going to say yes or no or you No. I'm just going to count. Now, are these phrases that we might know or is it going to be like Quiquay's coffee? It's going to be English. It'll be It'll be English. What the **** is Quiquay's coffee? All right, let's go. All right. So, and then and then it's going to pass on from you. You're going to do it to Greg, and then",
            "start": 81.12
        },
        {
            "text": "English. It'll be English. What the **** is Quiquay's coffee? All right, let's go. All right. So, and then it's going to pass from you to Greg, and then Greg's going to do it to Colin, and then we'll work backwards. And then we're going to figure out what it was, and then Colin has to say it, and we'll be back. We'll work backwards. Okay. All right. Let's get it off. Wait, we're working backwards where Colin says it back to me a different word, different sentence. Do we ever get to figure out how badly we screwed up the first word? Well, then I'll tell everyone what the sentence was supposed to be after. Oh, Colin will say it and you'll be like, \"No, you're so stupid. It was free credits.\" Got it. All right. $75,000 on Patreon. All right, everybody put your headphones on. Yeah. Yeah. Hit play. I'm going to look down. Wait till I get tapped on the shoulder. Yes. Okay. Can anyone hear me now? Hold on a second. Yeah.\n\nNote: Corrected \"Quiquay's\" to an unknown coffee reference ( likely a misspelling of \"QuikTrip\"), \"patron\" to \"Patreon\", and left other minor errors as they do not affect the overall meaning or context.",
            "start": 118.56
        },
        {
            "text": "The proof is in the pudding. The secret is in the pudding. Okay. The proof is in the pudding. No. Do I say it? The Don't yell it cuz I can pudding. One more time. The proof is in the pudding. No, you can't cheat. I can't hear or see anyway. Sam, the proof is in the pudding. I think what you said, but I don't think that's what it is. Okay. Do I say it? I mean, what's your go? I think Can we take our headphones off? I think Greg said something about All right, stop the music. Put me on low. I think uh I think Greg said something about  but I think it's proof is in the pudding. The secret is in the pudding. You got to do a phrase that people know, though. Then you can dance",
            "start": 156.72
        },
        {
            "text": "on low. I think uh I think Greg said something about proof is in the pudding. The secret is in the pudding. You got to do a phrase that people know, though. Then you can dance around it. It shouldn't be a phrase. And it should be a sentence. You did say something about a right? I did. Yeah. I said the proof is in the pudding. Okay. I thought that's what he said. And then and then but then I thought too sounds like a piece. Is he saying the proof is in the pudding? But I was like, well, it's from our audience on patreon.com/kindafunny. They're a bunch of weirdos. They probably would say the secrets in the pudding apparently is a thing. All right. So now Colin Yeah. Uh we're not going to look at this. Okay. Okay. You're going to be the only one. Okay. To And you can get up if you have to worry. I can see I can see I think. Nope. That's not it. Um, you choose choose a sentence. Nick, don't look. Tell me if you want me to scroll up so you can get some different",
            "start": 224.24
        },
        {
            "text": "get up if you have to worry. I can see I can see I think. Nope. That's not it. Um, you choose a sentence. Nick, don't look. Tell me if you want me to scroll up so you can get some different ones. Okay, hold on. No, you should scroll away so it's not something Tim Gettys saw. Okay, got one. Yeah. So, I put my music on. No, you don't have music on this. Tim Gettys needs music, right? No, I need music. So, how are you going to do this? Oh, can I get your setup? You're really good headphones. That song is hard. Oh, and somebody says in the chat, remember whisper. We shouldn't be shouting. Oh, it is called The Whisper Challenge. I guess when you say it, you should take your headphones off. No, you should just whisper, shouldn't you? I guess you can take your headphones off. That's why people are screaming cuz they have the headphones on. But they have to whisper that way. With the headphones on? Yeah. That's what makes it funny. Okay. I guess that is true. That is true. All right.",
            "start": 266.68
        },
        {
            "text": "screaming cuz they have the headphones on. But they have to whisper that way. With the headphones on? Yeah. That's what makes it funny. Okay. I guess that is That is true. That is true. All right. All right. I'm putting on my music. I got you. Give it to me. Everyone good? Big black baseball bat. I got that. I think big black baseball bats. Black baseball mats. You want it again? Yeah. Beach blanket bingo. Beach blanket bingo. Okay. I think you said Beastie Boys and Big Coke. I said beach blanket bingo. I said big big black baseball bats. Yeah, that's it. Big back baseball big black baseball bat. All right. All right. All right. That was good. That was good. That was fun. So, now let's go, Greg. Yeah, I pick one right now. I should probably pause my music cuz it's so hard. You should probably pause it. Do you want mine? Yeah, I'll just take yours. Are really good. This is hard. Yeah, this song's great. Oh, I got to get Oh, I went to the wrong",
            "start": 313.6
        },
        {
            "text": "my music cuz it's so hard. You should probably pause it. Do you want mine? Yeah, I'll just take yours. Are really good. This is hard. Yeah, this song's great. Oh, I got to get Oh, I went to the wrong page, too, Tim. I can hear everything. Sorry. I've decided that this game is more fun for the people watching than it is. It's fun. That's the point of it. Yeah. But the fact that James started laughing his ass off when I first when I started talking is proved positive. Good. True. True. Nobody looks Nobody look at my page. I'm not going to go look at your stupid page. Hey. Oh, you need music, right? Yeah. Moving on to hide. Hit me with it. Can I get some honestly? Karaoke's king. What? It's king. One more time. Rock. It's definitely not right, but this is what I heard. Karate chop in the sun. Karate chop in the sun. Karate chop in the sun. Hit me. It's like just gets to the chorus. It's It's crack went into my crack. Crack went into my crack. Okay. Crack went into",
            "start": 397.44
        },
        {
            "text": "in the sun. Karate Crotch in the Sun. in the sun. Karate Crotch in the Sun. Hit me. It's like just gets to the chorus. It's It's crack went into my crack. Crack went into my crack. Okay. Crack went into the crack. That's your That's what you saying? Crack went into the crack. That's what That's what I thought he said. Yeah. It sounded like Karate Crotch in the Sun to me. So Karacos is king. Okay. Okay. That's hard. That's hard. That's hard. I enjoy it. I enjoy it. All right. These are all references to us. Is it my turn? It is your turn, Nick. So I take his No, take that one. Okay. I want to annunciate. I have to be allowed to annunciate. What? See, the whispering you got to whisper. The whispering is stupid because I mean I understand the point of it, but I can't hear like you're not going to hear me. He didn't either way. So like the whispering is just kind of like a nice I think the lip movement is when somebody screams like All right, I'm going to What's funny is the people screaming when",
            "start": 484.24
        },
        {
            "text": "me. He didn't either way. So like the whispering is just kind of like a nice I think the lip movement is when somebody screams like All right, I'm going to What's funny is the people screaming when they think they're whispering. That happen atmosphere is like when you're singing a song in a concert. Yeah. All right. I'm popping mine on and out looking at what's happening. Okay. Got it. All right. Who am I going to first? I go, Tim. Ready? Get in the van. We're going to Nazareth. Get in the van. We're going to Nazareth. Get in the van. We're going to Napa. Close enough. Okay. This is a good hip. Get in the van. We're going to Napa. Get in the van. We're going to Napa. One more time. Get in the van. We're going to Napa. Kevin the Fap is always Oh, the song stopped. Don't say it. What are you doing? The song stopped. Ah. Okay. Kevin the Fap is always blowing. Kevin the Fap is always blowing. All right. Can we all take them off? I can hear I can hear. Sorry. There you go. That's fine.",
            "start": 555.04
        },
        {
            "text": "you doing? The song stopped. Ah. Okay. Van Halen is always blowing. Van Halen is always blowing. All right. Can we all take them off? I can hear I can hear. Sorry. There you go. That's fine. Van Halen is always glowing. I said Van Halen is always blowing. I said get in the van. We're going to Nazareth. The correct was get in the van. We're going to Nazareth. Nazareth. Yeah. Yeah. That's calling Jesus. Get the van. We're going to Nazareth. Oh, that's funny. That's funny. That was good. That was funny. That was good. That was funny. Do you want to do one more round? Sure. Let's do one more. I feel I feel good about this. Can I choose a different song? I would like Jump by Van Halen. No, Jump by Van Halen. Um, sure. No, it's fine. Jump by Panama is close enough. Panama. By Van. All right, let's do it. I want to do I want to do one more and we'll go we'll go down the line. Here you go. Thank you. Oh man, I lost the good headphones. Here. Do you Oh, whatever. Doesn't matter. You",
            "start": 635.2
        },
        {
            "text": "Right, let's do it. I want to do one more and we'll go down the line. Here you go. Thank you. Oh man, I lost the good headphones. Here. Do you... Oh, whatever. Doesn't matter. You just hold them tight. You'll be fine. All right. Hit. Oh, hit me. Hit play for me. I want to find a good one. I may have a small dick, but you'll find that my ego is more than enough to make up for that. What? You can't pick something that long. The **** is that? Pick a different one. Okay, fine. Fine. 9/11 was an inside job. I was looking at your eyes. Do it again. I kept looking into his eyes, too, and I did mine. I got to look at your big, beautiful mouth. Okay. 9/11 was an inside job. One more time. 9/11 was an inside job. Okay. 99 levers gave me a **** One again. 99 levers gave me a **** 99 lovers gave me a **** Tell Alicia I want a **** Tell Alicia I want a **** I got it. Tell Alicia I want a **** Nailed it. That's what Greg said. That's what Greg said. Um,",
            "start": 696.88
        },
        {
            "text": "Kinda Funny Does The Whisper Challenge: \n**** 99 lovers gave me a **** Tell Alicia I want a **** Tell Alicia I want a **** I got it. Tell Alicia I want a **** Nailed it. That's what Greg said. That's what Greg said. Um, what did you say next? I said 99 Lovers gave me a **** It was 9/11 was an inside job. Hey Alicia, give me a **** Ladies and gentlemen, this has been the kind of funny whisper challenge. That was fun. I enjoyed that. I enjoyed that a lot. Thank you so much for supporting us over at patreon.com/kindafunny. We love all you big beautiful kids. Until next time. See you there. What's up guys? Welcome to Kinda Funny. I'm Tim Gettys. This is Nick Scarpino. That is Greg Miller. And that is Colin Moriarty. Today we're doing I'm sorry. I'm sorry. Do that again cuz you made a **** ton of noise on your mic. Yeah. Don't do that, please. What if I do it? Does it sound the song? Do I Do I do it? Does it sound okay if I do? Everyone on the stream can also hear this. I know. They're enjoying",
            "start": 777.4
        },
        {
            "text": "on your mic. Yeah. Don't do that, please. What if I do it? Does it sound the song? Do I Do I do it? Does it sound okay if I do? Everyone on the stream can also hear this. I know. They're enjoying it. Oh god, it feels good to do this. Feels like a day spa. All right, stop. All right, you ruined everything. You ready for this? I'm toast ready. What? No. I **** hate you, Nick. Does it go in this hole or this hole? It's the hole closest to you. Always. What's up, guys? Welcome to Kinda Funny. I'm Tim Gettys. This is Nick Scarpino. That is Greg Miller. And over there, we got your boy Colin. Why don't we just restart it again since Kevin's moving the camera the entire intro. That was a That was a planned camera move. It was It was not planned. That was out. It was so gentle. It would have It was not gentle. Whatever. Third time's a charm. What's up? Nope. Fourth time's a charm. Keep laughing, fuzzball. What's up, guys? Guys, I'm Tim Gettys. Welcome to Kinda Funny. I think a booger",
            "start": 845.12
        },
        {
            "text": "It was not gentle. Whatever. Third time's a charm. What's up? Nope. Fourth time's a charm. Keep laughing, fuzzball. What's up, guys? Guys, I'm Tim Gettys. Welcome to Kinda Funny. I think a booger just fell out of my nose cuz that's how things work. This cover starts with a booger. That was like little tiny flaky thing. Just shot a snot rocket out of your nose. So, please support us at patreon.com/kindafunny. All right.",
            "start": 893.6
        }
    ]
}