{
    "id": 1312,
    "video_id": "2QOGhuE7W9Y",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "How Scary Is Until Dawn? - Kinda Funny Plays",
    "description": "Kinda Funny Horror Week concludes with Tim and Nick playing the first hour and a half of Until Dawn.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1446307200,
    "duration": 5649,
    "transcript_chunks": [
        {
            "text": "what's up guys welcome back to Horror Week here at Kinda Funny Games I'm Tim Gettys this is Nick Scarpino today for the first time ever we're playing a little bit of Until Dawn Until Dawn you know Colin and Greg they've been talking all about this game Talking a lot of trash you're going to love this game it's going to be the best game we'll see yeah we we shall see The Butterfly Effect classic movie Ashton Kutcher what Kevin are you saying to me Kevin your wire was hitting the make sure this wire doesn't hit that wire okay better so that's a butterfly effect at all the smallest decision can dramatically change the future okay okay so from what we know about this game it's like a teen horror movie but it's a video game hot yeah I'm excited we'll play the whole opening bit see how far we get so we get to choose what happens and there's a whole bunch of different outcomes and some characters you can make it so all your characters die all your characters live whatever okay we'll",
            "start": 0.04
        },
        {
            "text": "Far we get so we get to choose what happens and there's a whole bunch of different outcomes and some characters you can make it so all your characters die all your characters live whatever okay we'll see we'll make decisions together Cabin in the Woods oh I've seen this movie before many a time okay uhoh uhoh old machete Steve hey guys you just call me Steve God I can't believe you actually did this don't you guys think this is a little bit come on she deserves it it's not her fault that she has a huge crush on Matt Hannah's been making the moves on him I'm just looking for my girl Matt just because his class doesn't mean he belongs to I kind of want to go to this party God damn it Nick anybody's man whatever you say I'm assuming they're college level yeah let's just for the sake of this video Let's assume they're all in everyone is at least 18 especially Hayden Panettiere I don't know how to say her last name Papania save the cheer later I'm in Hannah so we're all just",
            "start": 58.48
        },
        {
            "text": "this video Let's assume they're all in everyone 18 they're all at least 18 especially Hayden Panettiere I don't know how to say her last name Palance save the cheer later I'm in Hannah so we're all just excited because Hannah is trying to get some she's trying to get a little bit of that an nimbly bimbly wait are they all hiding oh this is messed up is that Hannah oh man everyone see here everyone's thinking Hannah's trying to get some and Hannah's just out here with a candle like goddamn idiot **** is this oh hey Hannah yes Mike get it now what they're all hiding in that room are they going to listen to Hannah and Mike getting it on yeah I think that was the goal hey did you see that us this weekend oh good fathering father of the year there let's let all okay all right we got some Ugg boots I'm already into this Uggs and yoga pants combo I gu classic all right so I'm controlling this one I assume so yeah considering she's moving around and I'm my hands aren't moving all right tutorial",
            "start": 134.72
        },
        {
            "text": "I'm already into this uglys and yoga pants combo I'm going classic alright so I'm controlling this one I assume so yeah considering she's moving around and I'm my hands aren't moving alright tutorial really you got to flip it over bro I know it's like use the right stick to look at it looks so damn hot in that shirt I bet you're even hotter out of it come to the guest room at 2 a.m. sign Mike XXX he ain't even putting the O's Nick yeah he ain't talking about he ain't talking about hugs and kisses son he's just talking about hugging get into now what did her naive like I'm loving the writing so far I think she got herself out of some articles of clothing damn potentially Mike did too Kevin this thing is too it's too heavy Kevin I don't like it see this right my balls what does this mean this means someone's making bad mistakes someone is inated and violating Nick Scarpino rule number four never get too drunk once again brother you've outdone us all knock him off his chair I",
            "start": 193.24
        },
        {
            "text": "mean this means someones making bad mistakes someones inated and violating Nick Scarpino rule number four never get too drunk once again brother you've outdone us all knock him off his chair I got your note glad you can make it maybe we should start with a little you know making out and see where it goes from there that's where I like what is this clinical oh hell yeah uh I love this game 10 out of 10 Kinda Funny she's taking her shirt is so messed up oh my God you got a selfie stick I already like this guy what are you doing here Hannah I'm sorry Hannah all just a stupid prank uh you guys are jerks you know that and the tiar laying down the wall yeah **** those guys excuse me bless you what are we choosing oh H what should we do Nick uh let's find the others find others yeah no lets wake Josh wake Josh is dumb ass okay Josh useless he's passed out **** guys there's someone outside what the hell they're right there you're good don't be tripping Hannah whats going on where's",
            "start": 273.04
        },
        {
            "text": "wake Josh wake Josh is dumb ass okay Josh useless he's passed out **** guys there's someone outside what the hell they're right there you're good don't be tripping Hannah what's going on where's my sister going it's fine she just can't take a joke it was just a prank Han what did you do we just messing around Beth it wasn't serious you jerks **** Mike man I thought he was a good guy know Mike I gave you my flower you know I kind of think you're the and you stepped on it Mike you **** on my flower Mike okay oh **** he **** on my flower Kevin run Hanah run see fast bro I don't play anything safe why is she's so worried about Hannah follow Footprints or follow the noise follow the footprints bro okay we're doing it this game's already more enjoyable to me this is fun this is actually really fun I like how it jumps you right into it gives you a little scare uh moose Footprints man I thought Mike was horny that was a good one thank you **** **** that was a really good one damn\n\nCorrected the following:\n- \"wake Josh\" (no change, as it's likely an error in transcription)\n- \"dumb ass\" → \"dumbass\" (common slang phrase)\n- \"Hannah what's going on where's my sister going\" → corrected to maintain original meaning and grammar\n- \"Han what did you do we just messing around Beth it wasn't serious you jerks\" → no changes, as the text is a conversation fragment\n- \"Mike man I thought he was a good guy know Mike I gave you my flower you know I kind of think you're the and you stepped on it Mike you **** on my flower\" → corrected to maintain original meaning and grammar; assumed \"the\" refers to a person, possibly Hannah or Beth\n- \"Kevin run Hanah run see fast bro\" → no changes, as the text is a conversation fragment\n- \"follow Footprints or follow the noise follow the footprints\" → corrected to maintain original meaning and grammar\n- \"gives you a little sex uh moose\" → corrected to \"scare\", assuming it's a typo in transcription\n- \"Mike was horny that was a good one thank you **** **** that was a really good one damn\" → no changes, as the text is a conversation fragment",
            "start": 351.68
        },
        {
            "text": "really fun I like how it jumps you right into it gives you a little sex uh moose Footprints man I thought Mike was horny that was a good one thank you **** **** that was a really good one damn it Hannah where are you what do you think happened Hannah you think she's dead um you think she's the killer do I think Hannah's the killer no I think the dude with the machete outside is probably the killer the touchpad slide to unlock she obviously doesn't have an iPhone 6 oh cool Hannah that this update okaying try to find my sister Hannah up there's a stick man if there was those freaking doohickeys running around Fierce man Tim this reminds me of your Sunday morning yoga classes I can't hear what you're saying right now cuz the wind is really loud but I assume you're talking about oh pick that thing up what is it what the **** is that it looks it's a death a death totem I'm going to put that back where I found it did Hannah die actually pick it up yeah go ahead and pick that up again",
            "start": 436.08
        },
        {
            "text": "Thing up, what is it? What the heck is that? It looks like a death totem. I'm going to put that back where I found it. Did Hannah die? Actually, pick it up, yeah. Go ahead and pick that up again, see what cuz why would let me interact with it again. Hey, death totems. Okay, going to keep on walking. I'm going to find that rock I saw in the death totem. You at Hannah, what the heck is that? What the hell was that? Is there an option to go back in the house and eat some Cheetos because that's what I... what is that? Oh Tana, hello Hannah. Oh my God, you must be freezing here. Take my coat. I'm such an idiot, so dumb. Mike's messed up, man. Yeah, we're going to try to get Mike killed. Yeah, that is kind of messed up. Just running away. Oh yeah, oh God. We saw how this ended. Oh no, well... how's she going to Snapchat this? Nope. Ooh, oh no. Just jump the rocks down there. Nick, get out of here! Get out of here! Oh man, I've always thought if I was in the situation, I'd be really scared. You'd be useless, I'm sorry.",
            "start": 513.44
        },
        {
            "text": "Snapchat, nope. Oh no, just jump down there, Nick. Get... get... oh... I've always thought if I was in the situation, I'd be really scared you'd be useless. I'm sorry. Oh my God, you'd be completely useless. Hold on. Oh, dude, we got Pyro McFlamers drop Hannah or let go. What do I do? Let go. Letting it go. I ain't trying to go up on that... oh, ooh God. Oh, that was... oh... excuse me. Oh, all right. Well, okay. Letting Go, Hannah died, and I think both of us died. Clarice was that her name? I don't know if she's dead now; it doesn't matter anymore. Well, that sucks. Wow, I enjoyed this game. All right. Before we begin... oh, love this guy, the crazy guy from Armageddon. Need to make sure you understand: no one can change Russian-American all parts made in China beyond our control. That's awesome. You have to accept this in order to move forward, but there's freedom. See his facial capture looks great; some of the other characters not so much... like I don't understand too.",
            "start": 619.6
        },
        {
            "text": "our control that's awesome you have to accept this in order to move forward but there's freedom see his facial capture looks great some of the other characters not so much like i don't understand to the future i want you to remember this i want you to remember this as you play your game every single choice will affect your fate and the fate of those around you **** so you have committed to commence with this game this is significant and i want to help you see it through thanks analyst thanks Russian guy from Amagen sometimes and also a crazy bad guy from Bad Boys too even terrifying but i'm here to make sure that no matter how upsetting things may get you will always find a way to work through it all right we will start with a simple exercise could you please pick up a card and i want you to look at the picture on the other side and tell me what you feel about it i can do that entral i think this is a pretty simple exercise most out of this experience okay Tim",
            "start": 708.28
        },
        {
            "text": "I want you to look at the picture on the other side and tell me what you feel about it. I can do that, entral. I think this is a pretty simple exercise. Most out of this experience, okay? Tim, you want to pick the card up. Uh-oh, I got a glove on. I'm going to kill someone. Wizard of O is a scarecrow, bro. So how did that picture make you feel, be honest? Little sexy little hat going on. Happy or uneasy? Uneasy, okay. Hest is good, thanks, Doc. Did I pass? Makes you feel uneasy? Well, it's a scary ass uh scarecrow probably so yeah, scarecrow. You know, see... I see... Let's see the Scarecrow. We're not there. Would you feel comfortable staying there on your own for a period of time, a week for example, at this no, no, no, sorry, bro. No cable, no Wi-Fi. Why not? I'd be lonely, scared. Shucks that no cable or Wi-Fi an option. Option three... uh... no Direct TV. I mean, I think I'd be more scared than I'm cool by myself. There's something else in that picture that scares you, the giant ominous Barn.",
            "start": 772.72
        },
        {
            "text": "an option three uh no Direct TV I mean I think I'd be more scared than I'd be more scared than I'm cool by myself there's something else in that picture that scares you the giant ominous Barn in the background or maybe the cornfield with Children of the Corn yes 100% that really that's intriguing oh but perhaps we that's intriguing the depths of your fears the next time we meet I'm afraid we're out of time for that that sounds good let's get back to the let's get back to the yoga pants falling off The Rock to unfortunate young ladies we left brainless yeah they were like brain-dead this analyst like he's creepy hey bro maybe back it off a little bit something Computer Entertainment presents it's like this is so horror movie yeah like if Will Smith was in it he'd start rapping soon yo it's about death Until Dawn **** no he doesn't swear we're going until dawn maybe a little afterward going to get some Denny's and some stuff but first we got to go to Dawn we gotta",
            "start": 853.36
        },
        {
            "text": "rapping soon yo it's about death until dawn **** no he doesn't swear we're going to Until Dawn maybe a little afterward, going to get some Denny's and some stuff but first we've got to go to Until Dawn. We get a wow wow Until Dawn to the wow wow Until Dawn. Jim Until Dawn Desperado all right cool so now it's feeling like a CW thing all right I'm going see if I can skip this what you skipped it yeah no yeah wait is there an option to yeah no just resume bro what are you doing I'm into this got to set the mood you know eyess dolls not cool spooky thing is that a butterfly or a moth it's a butterfly moth MO like the mother watching some movies death okay West Desperado is the one anniversary of the Dreadful tragedy that took place on Mount Washington any c was in charge of Investigation thanks for having me Marty listen an update on Hannah and Beth Washington the twins who are still missing one year ago girls left the safety of their parents Lodge and headed out into a snowstorm foul play not",
            "start": 932.6
        },
        {
            "text": "having me Marty listen an update on Hannah and Beth Washington the twins who are still missing one year ago girls left the safety of their parents lodge and headed out into a snowstorm foul play not officially no there is one individual we're considering as a person of interest but his whereabouts are currently unknown he has an interesting history he had warned them against pursuing their construction project and claimed the land was sacred to his forefathers you know there is still the old sanatorium on the mountain could he be hiding there my officers did search the grounds but the girls themselves couldn't have made it that far something about that mountain seems to breed tragic events more than you know Marty thank you for joining us all the Washington tonight on this like even as a uh computer character Hayden Pener great looking all right let's do that again this Mike making some YouTube vids that's not Mike right well hello friends and fans it's beyond awesome to have you guys",
            "start": 1007.36
        },
        {
            "text": "Uh, computer character Haden Penner great looking. All right, let's do that again. This Mike making some YouTube vids that's not Mike, right? Well, hello friends and fans, it's beyond awesome to have you guys all back this year. Um, first off I got to say I'm super excited to welcome all my pals back to the annual Blackwood Winter Games. I want to maybe start off with... first off, sorry about the two deaths last year. Like, comment, subscribe part of the normal video series for a second. I know you're all probably worried about me, and I know it's going to be tough on all of us going back after what happened last year. I think it is... oh, he no, he was the guy that was passed out. I just... the brother to know that's that's the twins' brother. It means it means so much to me that we're doing this and uh, I know it would mean so much to Hannah and Beth that she yeah they would probably not want to spend some quality time with... want to go back up there each and every one of you and um just share some moments that never for.\n\nI corrected the following errors:\n\n* \"hden\" → \"Haden\"\n* \"pener\" → \"Penner\"\n* \"Blackwood winter G\" → \"Blackwood Winter Games\"\n* Added capitalization to proper nouns like \"YouTube\", \"Mike\", and \"Blackwood Winter Games\".",
            "start": 1050.24
        },
        {
            "text": "so much to Hannah and Beth that she yeah they would probably not want to spend some quality time with want to go back up there each and every one of you and um just share some moments that never for for the sake of my sisters and you know okay so let's party like we're porn stars okay make this one trip will never forget you know what you didn't have me until then yeah I you know the dead sisters and all that but party like your porn stars party like porn stars let's forget that there's a maniac out there trying to kill us let's do this thing yeah okay we got L McGee I like this a screenplay I like that it's they're going through with it hey I'm into it so far yeah I'm really into it that's say man don't vacation anywhere called Blackwood Pines you know where I North Star in Lake Tahoe doesn't that sound cheerful you know what I mean yeah yeah Squaw Valley hey that sounds fun Valley Blackwood Pines no that sounds like insane Island 10 hours until dawn can we just",
            "start": 1112.04
        },
        {
            "text": "in Lake Tahoe doesn't that sound cheerful you know what I mean yeah yeah Squaw Valley hey that sounds fun Valley Blackwood Pines no that sounds like insane Island 10 hours until Dawn can we just stand here for 10 hours mean she's like a bus up here uh-oh man this guy's already after himself Sam that's his best friend she's considerate an adventurous diligent beautiful hazel eyes hello someone there already like I think it's a port I mean I think it's one of the friends like Matt messing with them Sam path to cable car station 2102 these girls really don't know how to dress in the snow not for nothing the leggings cannot provide that much warmth yeah although my wife swears they do they get wet even for a bad time yeah yeah okay trying to not say the \"a\" this looks horrifying hey guys welcome to this dilapidated cabin Gates are busted climb over Chris you know what Chris don't you open the **** gate Chris damn it I would not like I CHR sorry Chris I'm not I'm sorry bro it's spiky there's a lot of",
            "start": 1200.08
        },
        {
            "text": "dilapidated cabin Gates busted climb over Chris, you know what Chris, don't you open the **** gate, Chris, damn it. I would not like I CHR sorry, Chris, I'm not I'm sorry, bro, it's spiky there's a lot of cold stuff you got to go to the right there you go climb over there. I mean as a member of the climbing Community I go safe I mean you are a climbing Community M I always go safe as a member of the climbing Community it's best to go safe all right, right Kev all right next time we're going quick climb or jump jump bro you crushed it yeah I always knew I had it in me look at your little hat this cute this C's got a little fuzz on it I like a little fuzz on it little fuzz just a little fuzz keeps it warm your ears Kevin don't what are you talking about, Kevin where does your brain go when we say things like that right down to the gutter right to your dick right to your penis okay well you know keep it clean buddy okay this is a horror game you think she hooks up with Mike I don't know squirrel",
            "start": 1275.52
        },
        {
            "text": "like that right down to the gutter right to your dick right to your penis okay well you know keep it clean buddy okay this is a horror game you think she hooks up with Mike I don't know squirrel hey little fella you hungry huh I'm hungry it's not move this is cool not wise no they uh squirrels carry rabies and uh and herpes oh I like this relationship status stuff this is fun oh I'm not that funny though damn it well you you know you don't really have to be funny when you're cute take it from me booya so which side are you on which side am I on yeah I'm on the funny side unfortunately not as cute as my mom would have hoped so is the control just sort of like back and forth cool a lot of butterfly stuff danger butterflies the guidance butterflies all right cool color codes that I'm not going to remember unless the game keeps telling me it'll keep telling you death to oh ammunition of a possible future that's not good all right cool got it bro picking up the death totem spinning it",
            "start": 1337.96
        },
        {
            "text": "going to remember unless the game keeps telling me it'll keep telling you death to oh ammunition of a possible future that's not good all right cool got it bro picking up the death totem spinning it around looking in oh that was useless all right someone's climbing some stuff future is uncertain telling me that all right cool now I got a totem collection that's fun oops didn't mean to hit that Chris you here Ma's here where are you you're not in the bag are you might be in the bag what do we have here it's a cell phone girl come on Snoop or close snoop snoop aoop we got a bunch of White butterfly look who it is he knows Chris I love that oh CHR and and as she was calling him good for you Chris things are going to end well for Chris up Chris I'm sorry are you my secretary I was buzzing cool well thanks for letting me know I I can take it from here Dicky it was Ashley should text her some pictures of your body yeah text her a butt shot I found something kind of amazing what I'm not going",
            "start": 1413.6
        },
        {
            "text": "well thanks for letting me know i can take it from here dickie it was ashley should text her some pictures of your body yeah text her a butt shot i found something kind of amazing what i'm not going to tell you you got to see for yourself come on come on it's this way all right christy i've used that line before yeah you walk around the corner and it's your penis always the penis you know oh man i've seen your penis before chris i don't need to see it again penis hold on what's that thing victor mgrm man look at this ni think we'll get a visit from i se 98 guarantee you will oh come on place most the comes up here except for psycho killers oh pretty red right wait i guess come on look at these beauties uh beauties is not the word that comes to mind why is this even here what do you mean what the hell is a shooting range doing at the base of a ski lodge uh dude have you ever met josh's dad yeah he thinks he's like grizzly adams or something i want to try yeah i want to try go ahead gz",
            "start": 1508.12
        },
        {
            "text": "the hell is a shooting range doing at the base of a ski lodge uh dude have you ever met Josh's Dad yeah he thinks he's like Grizzly Adams or something I want to try yeah I want to try go ahead gz all right here goes is there a a bullet in that thing okay I think I'm controlling Chris now what should I shoot Nick shoot that big ass Target right there yeah shoot that one that was for you thanks now shoot that other Target it just clearly wants you to go look at you dude you're a sharpshooter down left down to left down left try to hit a squirrel's face see he's trying to impress Ashley but he has little Utah or whatever her name is what's her name Sam Sam Utah yeah Chris stop doing that guess it was a wild case of beginner luck Chris stop doing that I think so girl girl yeah bottle well anybody in their brother could shoot a bottle that big that close shoot this **** squirrel's face off I squir blow his ass away bro I don't want to shoot the squirrel I'm away I tell you I command it",
            "start": 1571.68
        },
        {
            "text": "in their brother could shoot a bottle that big that close shoot this **** squirrel's face off I squir blow his ass away bro I don't want to shoot the squirrel I'm away I tell you I command it kill the squirr I don't want to kill the squirrel you think the squirrel is going to save your life one day it's a squirrel butterfly effect Nick your ass just got sacked told you wait I'm just getting the hang of this come on Chris the cable car let me just go ahead and leave this loaded gun right here bring the gun with you okay now I'm Chris I'm just going to follow Sam be super cool about it got to find my way to Ashley know I mean it is it's definitely weird coming back up here after a whole year yeah I swear the moment I got here alling back here goes fast well I guess the thing is that's weird they don't necessarily think that they were murdered oh they me missing F oh that's right that so what people you know I I don't know you said they found people sleeping in the station one time it's",
            "start": 1635.16
        },
        {
            "text": "they don't necessarily think that they were murdered oh they me missing F oh that's right that so what people you know I I don't know you said they found people sleeping in the station one time it's creepy yeah what about this isn't creepy I like the music the score is pretty awesome you real gentlemen you can go first into the scary ass car station I'll take the rifle with me and I thought the car was closer guess we got to wait I'm starting to get the appeal of killing time at the shooting range sanatorium what's a sanatorium Sanitorium Sanatorium and S like a s like a crazy house for your butt sanitary oh it's to keep your butt clean what I said but not to keep your butt clean do they keep their butt crazy an a hotel clean who cleans whose butt Kevin I was just being silly I know you're being silly I'm being silly too we're all silly here we go it's Cable Car time I'm going to go first finally you coming well I was going to stay here and catch some disease but okay kind of weird",
            "start": 1701.92
        },
        {
            "text": "being silly I'm being silly too we're all silly here we go it's Cable Car time I'm going to go first finally you coming well I was going to stay here and catch some disease but okay kind of weird that cable car just comes you know just like going to the prom maybe someone sent it it's like going to the prom you think they were old thing you think there's history here what what prom did you go to bro I hope this was the right thing to yeah that's a weird ass PR you know getting everyone together on the anniversary I mean Greg seemed really pumped about us all doing something didn't he yeah no he definitely did I I haven't seen him so excited about something in forever good good it's hard to tell with him and I know kind of been worried no no it was it was a good idea I hope everyone else feels the same way we're all here aren't we just want everyone to bang everyone you know no good talk that's all I wanted in life yeah you know what let's just let's just stop talking about this and",
            "start": 1778.32
        },
        {
            "text": "the same way we're all here aren't we just want everyone to bang everyone you know no good talk that's all I wanted in life yeah you know what let's just let's just stop talking about happened and enjoy the trip yeah yeah up spooky Mountain you know how Josh and I met no third grade Josh sat in the back of the room I sat in the front we didn't even know each other existed but the kids sitting next to Josh started strap snapping the training bra on the girl in front of him so the teacher made him move to the front classic move I was sitting okay so so I got moved to the back and and next to Josh that's how we met I mean and became friends Chris great story bro stop talking if it weren for the fact  Gene Simmons had puberty like years early I was about to say why is the third grader having a bra show train bra I mean who knows you could be riding in this Cable Car alone right now or or talking to some other person entirely boom I mean I don't think that that would be bad thing necessarily",
            "start": 1847.24
        },
        {
            "text": "show train bra I mean who knows you could be riding in this Cable Car alone right now or or talking to some other person entirely boom I mean I don't think that that would be a bad thing necessarily based on how you sound right now Tim you sound like a doofus so stop talking yeah Tim I was rooting for you and Ashley but now I'm not so much now I'm rooting for the first person to get a ice pick for your skull I don't know Mike was kind of a dick oh Mike's gonna get it Kevin I got it Mike's girlfriend Jess' new girlfriend she's trying I got this right here Kev every time you do that it hits the mic like this Kev that's a good noise is that what it's on here love that time to meet and greet time to meet and greet I'm Jess I like my Ugg boots too mhm mhm oh what the hell Jess hey Jessica over here uh are you guys having a really weird experience we're stuck in this stupid thing can you please let us out pretty please yeah maybe the green button come come on Jess oh my God I thought we",
            "start": 1898.48
        },
        {
            "text": "Over here, are you guys having a really weird stroke? We're stuck in this stupid thing. Can you please let us out, pretty please? Yeah, maybe the green button. Come on, Jess. Oh my God, I thought we were goners. Another 10 minutes and there, and I would have chewed off my own leg. Oh sick! Chris, about you chewing off your own head, Chris. On my bones, stop talking all muscle down here. Yeah, right. Uh-huh. Hey, Chris, I'm just doing like Sam taught me: other people's private thoughts are my own personal playground. Do not be a jerk. My goodness, seems that someone has a little crush on our good friend and dear class president Michael Monroe. And what kind of's going to get might our Jessica be capable of imagining? I wonder. Insist to give it back or explain that she's with my insist. Huh, yeah. We don't know, Chris. Nothing. Give that back, you tool! Tool and die, that's my motto. Oh, you're such an idiot. Maybe nosy Nancy shouldn't go nosing around in other people's nostrils. Uh, yeah. I try not to do that as a rule. Come on.",
            "start": 1957.24
        },
        {
            "text": "give that back you tool and die that's my motto oh you're such an idiot maybe nosy Nancy shouldn't go nosing around in other people's business uh yeah I I try not to do that as a rule come on Jess you can tell us can totally keep secrets whatever you'll figure it out eventually I'm **** Mike yeah I'm putting it to Mik because you guys go ahead I'm just going to wait here for a bit see who else is coming you mean Mike what he'll be coming I mean you know whoever uh Sam did you see this view I mean holy cow sometimes I forget to just stop take it all in hey why you're going to get a meat cleaver your head right where the car ends oh Emily oh really Mike's X oh **** there some drama Rama coming our way hey team did you hear that it's the drama train and it's coming right for us auu auu Emily's new boyfriend new boyfriend who's Emily Mike's exgirlfriend we know Emily wait Emily is the girl that we just saw Mike's ex-girlfriend look just literally right now got it they're",
            "start": 2018.52
        },
        {
            "text": "\"Emily's new boyfriend, who's Emily Mike's ex-girlfriend. We know Emily. Wait, Emily is the girl that we just saw. Mike's ex-girlfriend looks just literally right now got it. They're together, that's Emily. Got it, got it, got it. I was confused; I thought Emily isn't so far a nice person. Yeah, look if I remember correctly she's the one that everyone wants to die of creep out. She means well, but she's a mean girl, not like a Lindsay Lohan mean girl. Kevin, I can't help it; you're going to have to re-watch this thing because it's not working okay. Jesus, is that Mike? It's my boy Mike... **** you, Mike. Thing heading right here, there go Emily's ex, Hannah's brother, ex-brother, I guess Michael. You really should've seen the other dude right; no, the other dude's the brother. I'm really confused; he's the mean guy that tried to hit up Hannah. Yeah, just a little harmless fun up in the woods. Chris are all dicks, no Chris, not Chris... Uh, CH is the Josh. Josh, Josh is the\"",
            "start": 2087.88
        },
        {
            "text": "tried Chris is the brother Mike is the guy that tried to hit up Hannah yeah just a little harmless fun up in the woods Chris are all dicks no Chris not not Chris uh CH is the Josh Josh Jos is the brother just trying to lighten the mood em don't be like that like what the way you're being you always get like this oh threaten it would just be cool I mean be cool miche's going to kick your ass Michael I'm just going to lay it out otherwise this whole weekend is going to suck ass for everyone um this is super awkward and we all know it let's just acknowledge it now and move on okay mat I hear you man I get it I don't want to make this weird cool but I bang your chick you guys going to make out now oh my God totally we're so going to make out uh no seriously I'm going to go check on the cable car back on the trip see you man see you all right see you yeah he's totally cool with this I think we're okay yeah I think we're all good things are good I think Mike's going to be fine not really",
            "start": 2146.32
        },
        {
            "text": "\"Car back on the trip, see you man. See you all right, see you yeah. He's totally cool with this, I think we're okay, yeah. I think we're all good. Things are good. I think Mike's going to be fine. Not really work that out for us, no drama. Did you take these the rest of the way? The bags, yeah. All the bags. Uh, why I need to go find Sam okay. Sorry, I just I really need to go find her. I totally forgot I needed to talk to her before we get all the way up there. Just really can't wait. We're almost there. It's important. Matt, please you think she's going to go? I think she's going to go find Sam be cool or persist. I mean let her go if she wants to go. I ain't trying to let someone be with me that doesn't want want to be with me all right. Plus you got to trust okay. You don't have trust, you don't have a relationship. I guess I can pack horse it the rest of the way but you all right well first of all it's two bags bro. Well then we're even at least I'll think about it just be careful see you up there sweetie even\"",
            "start": 2205.16
        },
        {
            "text": "I guess I can pack it in for the rest of the way, but you're all right? Well, first of all, it's two bags, bro. Well, then we're even at least. I'll think about it. Just be careful. See you up there, sweetie. Even for what, thank you. What does she do on the right up? I don't know. Maybe they all got a little handsy together. Yeah, I want to find out. Yeah, if someone doesn't at least get a hand job before the end of this, I'm going to be really pissed. There needs to be at least one hand job, and I'll be honest, one dick slip – a dick slip. Yeah, all classic '80s horror movies have a dick slip. I'm not sure that's true. Ashley, like they just bend over in the shower and the dick slips. Oh, actually, has a crush on Crush CR; she's one calling Chris but he likes her; he has a crush on her too. Yeah, they're going to hook it up – yeah, we're going to hook this up, bro. Butterfly Effect – yeah, that's exactly what happens. Hey guys, I think I see – I saw an Axe Murderer find the axe murderer, bro. That's a cool effect. Whoa, hello.",
            "start": 2253.04
        },
        {
            "text": "yeah we're going to hook this up bro Butterfly Effect yeah that's exactly what happens hey guys I think I see I saw an Axe Murderer find the axe murderer bro that's a cool effect whoa hello are you kidding me getting a little friendly we're not in the friend zone kind of way they might need to check the expiration date on their big breakup maybe she's uh don't do it don't do it do it bro don't do it bro it's another man's woman do it bro don't do it do it bro she better not that guy seems so cool I think you're done I don't think I know oops okay what you want me to do that get out of there damn it I keep hitting it stop hitting R1 can you exit out they're not going to make out I'm trying to exit now oh Jesus Christ you shithead oh no don't look I did mean to scare you sort of scare you but not like for real scare you my gosh oh my gosh hey well man I'm I'm really sorry Ash D it's okay it's fine it's fine what are you looking at shoulder uh let me check it out go for it",
            "start": 2301.32
        },
        {
            "text": "of scare you but not like for real scare you my gosh oh my gosh hey well man I'm I'm really sorry Ash D it's okay it's fine it's fine what are you looking at shoulder uh let me check it out go for it tell him to look yeah of course I don't want to break his heart man sure uh go go ahead knock yourself out I guess all right son of a **** seriously Emily what the hell man Hey listen it's probably nothing nothing you think well is it ever just nothing with him you're the one dating her bro don't you did Ashley she seems like like a nice girl kind of a **** man she just like allowed that to happen I mean I guess it was us that allowed it to happen yeah it Ain her bro you know what he needs to know he does need to know not going to stop him well I was like don't look now I have back to my girl Jess what's up J and Jess has a crush on mic the new girlfriend check phone she ain't reading a book bro she is definitely not reading a book she's like did he text me I hope he texed me oh you",
            "start": 2382.64
        },
        {
            "text": "girl Jess what's up J and Jess has a crush on Mike, the new girlfriend check phone she ain't reading a book bro she is definitely not reading a book she's like did he text me I hope he texted me oh you did not just do that put your hands where I can see we've got you surrounded but who am I to retaliate what choice do I as a Supple young Rebel girl have but to surrender to the strapping military guard come to take me into custody grab snowball or run to the bench grab snowball bro well I don't know when you put it like that hey oh **** get him boom in the face Mike **** eat it eat it I like this with the music oh something's getting a little nasty nasty nookie nookie gonna get up on you suck up on you move Dodge hope this guy wasn't the high school quarterback cuz he's terrible and he's also in college remember that's a good point everyone's in College come on I assume they're all in college because who the hell let their high school kids go up to a retreat together you got me all right",
            "start": 2441.56
        },
        {
            "text": "in college remember that's a good point everyone's in College come on I assume they're all in college because who the hell let their high school kids go up to a retreat together you got me all right someone's either about to die or get naked sometimes doing nothing going take a I know all your tricks should I should I do it said do nothing no don't do I'm just going to do it oh no D damn chess look what you did I know you just killed the bird you know what that got in your way man C I didn't do it on purpose yeah you did I feel bad I really do I didn't mean to it told me not to do anything yeah why did you do it bro I don't know my God Michael what was that got you done well that's not going to stop Mido so did I go down oh well I'm about to go down on you so if I did Jesus all right all right my my so are we calling it my favor then you're worthy opponent Miss Jessica the snowball Queen okay that sounds vaguely dirty my lady e that's a little disgusting kiss or grab snowball",
            "start": 2513.84
        },
        {
            "text": "All right, my my. So are we calling it my favorite then? You're worthy opponent Miss Jessica, the Snow Queen. Okay, that sounds vaguely dirty. My lady, e, that's a little disgusting. Kiss or grab snowball kiss him make out of them. Oh yeah, B. I'm here to fix your pool some for later, buddy. Endless Reserve. You want your pool fixed about this pole with me? Uh-oh, uh. Yes, sounds like who oh my God. That was really close. That thing was going to kill us. Yeah, I mean wow, wow. Toast my M. Let's get out of here. Yeah, this is a tension field, my friend. Mike's not getting any. He's not dying. Who's that? Who's that girl? Oh, back to Mr. Anal. Hola again. And how are you feel okay? Show me some more scary pictures of a scarecrow. SC Children of the Corn session. So let's go a little bit deeper this time. You know, always go deeper. Bo we got to we got to we got to do the 21 Jump Street. We're going to try to understand the root of your anxiety now. Pick up that book turn the pages you will see a set of pictures and",
            "start": 2585.8
        },
        {
            "text": "go deeper Bo we got to we got to we got to do the 21 Jump Street straight we're going to try to understand the root of your anxiety now pick up that book turn the pages you will see a set of pictures and symbols I want you to identify by which image in each set okay Doctor the most anxious I can do that want everyone to know that Kevin look at his own bicep men worry me or women worry I mean women worry me man I'm not worried about men crowds or people crowds Heights or drowning drowning also that picture is just terrifying yeah rats snakes over really I don't care about snakes snakes and me were like this dog I speak **** Slytherin bro snake T Guns or knives gun uh knives Rats of the cockroaches probably cockroaches so cockroaches just to be clear scare you more than rats yeah and rats scare you more than snakes snakes so cockroach is more than snakes yeah all right okay **** clowns or scarecrows clowns Gore or crows neither I don't know I guess crows oh this guy's a dick did I startle",
            "start": 2678.64
        },
        {
            "text": "you more than snakes, snakes so cockroach is more than snakes yeah all right okay **clowns or scarecrows**, clowns Gore or crows neither I don't know I guess crows oh this guy's a dick did I startle you sorry you're doing very well thanks bro don't be nervous no why would I be nervous don't be nervous what makes you anxious **you try to speed up a bit** the more you rely on your instincts the more honest your answers will be and the more enlightening you will find this experience I'm not going fast enough for you bro but what he wants us to go faster Ranchers fighers yeah un **undeniably** needles needles yeah **crows**, who's scared of crows clowns needles I that qualifies as a dog that's a **wolf** bro needles this is very interesting thank you for answering so diligent you're welcome doctor spiders clowns and needles M the sun combination sounds like a good Friday night you're a twisted **guy** this what you are sir well I'm afraid once again we're out of time but I",
            "start": 2764.0
        },
        {
            "text": "you're welcome Doctor Spider, clowns, and needles. That sounds like a good Friday night. You're a twisted ****. This is what you are, sir. Well, I'm afraid once again we're out of time, but I promise we'll talk again very soon. Previously on Until Dawn, don't you guys think this is a little bit... Oh come on, she deserves it. Hannah, I don't think she deserves it. I really don't think she deserves it at all. It was just a prank. Han, okay, we know. We just did this. First off, I got to say I'm super excited to welcome you all back to the Blackwood Winter Getaway. I really want to spend some quality time with little bit that and just share some moments that we'll never forget. There's a little QT for my sister's sake. I need to go find Sam. I know it's been a long day, but I make a dumb joke, and I look at Kev; he just doesn't respond. He's just like a blob. That's every day. Can we skip this? It won't let me skip. What the **** man? I feel like this mountain gets bigger every time I climb it.",
            "start": 2857.24
        },
        {
            "text": "and I look at Kevin he just doesn't respond he's just like a blob, that's every day can we skip this? It won't let me skip. What the **** man, I feel like this mountain gets bigger every time I climb it. Yeah, that's how I feel. Penumbra St. Josh Hannah and Beth Broshi high as ****. That's the show with Christian Slater. Come on, you grew up here probably feels like it's shrinking. I guess that's true. When are you gonna install some cell towers up here? I'm getting withdrawals already. I relate to Chris. I'll fix you right up. You are the Chris of the story. I think I left my other jacket. Oops. Hey guys, get up here okay. Yeah, well more or less but it's so good to see you. What's up with him Ryan? Malik he's in Mr. Robot. That's what it is. Yo yo yo, you got things moving up here or what? Yeah man gossip or worry gossip dog. I know right. I didn't even have to ask Emily are a thing now right? Yeah so it seems. I mean what's Mike think of that. I have a feeling Mike's already got his hands full. You know what I mean so I",
            "start": 2951.28
        },
        {
            "text": "gossip dog I know right I didn't even have to ask Emily are they a thing now right yeah so it seems I mean what's Mike think of that I have a feeling Mike's already got his hands full you know what I mean so I know exactly what you mean Bob is hands full of uh you know body maybe there's another way in there a million ways in you order pizza a little bit of your B let me see your B button open yes break I don't think it's technically breaking in if you own the place right hey not not if I don't report you um um lead the way coaches **** what so we need to break into our own place cuz all the doors are locked hey unsettle or be confident I mean I go confident always so how are you doing good but a little cold think I could use some time curled up by the fire yeah that does sound pretty nice she it let's go Josh boy as was looking pretty hot today right she's like a sleeper hit kind of gal you know now I just want to rip that Parker right off of her and make hey **** that's mine protest",
            "start": 3022.52
        },
        {
            "text": "it let's go Josh boy as was looking pretty hot today right she's like a sleeper hit kind of gal you know now I just want to rip that Ashley right off of her and make hey **** that's mine protest dude hey cut it out man yeah I mean if you're not going to bang her maybe Michael will take up the case will you back off whoa bro I'm going to bang I'm going to **** Bang all right just seen it there was blood flowing yeah there is bro about 8 inches of blood sack beautiful mountains do you see any parents I mean can you imagine a more perfect ripe scenario just dripping with erotic possibilties laughing at and Ashley alone at last yeah what are you laughing at you've been a perfect now you come in for the kill agree or disagree agree bro maybe you're right yeah you're right going for the kill Chris Ashley's all up on it she wants it maybe you're right you're a hunter bro no fear I'm a warrior I mean she won't even know what they call me the Spartan of sex all right all right I got it",
            "start": 3093.6
        },
        {
            "text": "Chris Hardwick's all up on it she wants it maybe you're right you're a hunter bro no fear I'm a warrior I mean she won't even know what they call me the Spartan of sex all right all right I got it the Jesus of loving let's go let's go so how are we planning on breaking into my parents Lodge bud didn't say I had a plan you sounded like you had a plan you better deliver Koshi or else you got four lovely ladies who are going to be freezing their buns off and last time I checked that's not a good way to get laid is right I tried that strategy wants just freezing to death mhm yeah buns freezing I mean this looks like I can you can crawl in there little fire axe action is that a clue can we climb up that window what's in that little thing what's in there damn I'm getting pretty low on juice here I just got to turn off my GPS well well well we got ourselves a thinker nice one classic video games that kind of looks like Brian Aldis a little bit strong Brian yeah Chris AKA Strong Bad breaking",
            "start": 3154.56
        },
        {
            "text": "just got to turn off my GPS well well well we got ourselves a thinker nice one classic video games that kind of looks like Brian Albert a little bit strong Brian yeah Chris AKA Strong Bad breaking into our so I'm guessing dad doesn't know we're here yeah probably not it probably wouldn't want us going back to Killian Platteau yeah what an amateur I'm okay just have a m climbing class you mean Jim yeah you know with the climbing up the Rope who did I do that I I don't think so here use this we're going to old school here zip a lighter old school whoa Chris I just got an awesome idea yeah totally what is it okay so I'm pretty sure that I've got some deodorant in one of the bathrooms you could use that with the lighter I I don't follow how's how's a stick of deodorant going to help spray on it's a can oh yeah now I got you this is classic horror movie setting up a suspect he knows how to do flame throwing earlier we saw a killer do some flamewing I see what's up I'm on to",
            "start": 3224.24
        },
        {
            "text": "It's a classic horror movie setting up a suspect. He knows how to do flame throwing. Earlier, we saw a killer do some flamethrowing. I see what's up. I'm onto you, Josh. Killing your sisters? I'm gonna go sort something out. You're up for hunting around in the dark for a little bit. What are you going to sort out? I'll do it. God speak if he goes after Ashley. I swear to damn God, he's gonna go after Ashley. Chris isn't a hunter; man, he's a nice guy. A nice guy finishes last in love but first during sex. They go quick, you know what I mean. Hey, Death Totem! Oh, that was Ashley, wasn't it? I think that was Ashley. Sorry, Ash... You got the die. No, no, no. But I want to welcome to the Death Mode. We need to love going to the picture. Huh, that's cool. Hey, two people are dead in this picture. Cool, cool. That's cool. Yeah, you know what's cool about this picture? Not all of these people are alive still. Cool. Oh yeah, see this... What the... When this hell no moment jerking on the",
            "start": 3301.04
        },
        {
            "text": "this picture cool cool that's cool yeah you know what's cool about this picture not all of these people are alive still cool oh yeah see this what the **** when this hell no moment jerking on the door classic ass classic ass it's a dope ass cabin though I'm not going to lie it is oh no okay we got Ashley and Sam Sam hi Chris very funny oh how'd you know it was me shouldn't you be like getting the lock open or something on it you got to go upstairs bro you got to get that can of deodorant and burn the thing down you got to defrost the lock bro I mean the lighter you have in your hand probably would do the same thing but no let's go get the portable flamethrower make sure that happens I'm hearing some **** crashing I'd be Audi 900 by now I would be 100% Audi 900 those windows they be clickity clacking I were deodorant where would I be in the bathroom probably yeah it's a good call Nick maybe in a bedroom master bathroom looking for the deodorant there it is Inferno Inferno",
            "start": 3384.36
        },
        {
            "text": "clacking I were deodorant where would I be in the bathroom probably yeah it's a good call Nick maybe in a bedroom master bathroom looking for the deodorant there it is Inferno Inferno oh what the hell the **** hell get the **** what was that a dog raccoon maybe it was a raccoon you're going to let's burn this **** burn this down this is like freeing our buns off out here they're freezing their buns off that was a throwback to 10 minutes ago so unnecessary thank you thank you thank you I I'll be here all week oh it's a freaking Wolverine or a badger you see that was it are you okay it look like a wolverine bear or tiger or something a it was just a cute little baby wolverine boom knowledge dropped I was always impressed by your Wolverine knowledge they call me the Wolverine that sucks home sweet home shney shney okay oh my gosh it's so good to be inside you spilling yourself kind of looks like pee place looks like you peed on yourself nobody's been up here even with all",
            "start": 3472.44
        },
        {
            "text": "that sucks Home Sweet Home okay oh my gosh it's so good to be inside you spilling yourself kind of looks like pee place looks like you peed on yourself nobody's been up here even with all the police coming in and out not a lot of action up here lately let's change that let's get some people action oh God make yourself at home bro we'll do yeah come on in take a load off have whatever you want you just take whatever you want anyway right whoa easy there Cowboy challenge or warn hold on I'm just going to do this real quick I'm gonna put this over here so it doesn't stop bugging there you go how's that look should I challenge or should I warn warn his ass Mike stay away from our girlfriend dude what are you talking about stay away from Emily why would I want anything to do with Emily attack his ass quit being such a dick man nobody wants you here seriously what's your problem son of a bitch hey hey get off me hey what the hell is wrong with you",
            "start": 3560.84
        },
        {
            "text": "do with Emily attack his ass quit being such a dick man nobody wants you here seriously what's your problem son of a bitch hey hey get off me hey what the hell is wrong with you two thanks Josh you didn't come back here just to tear each other's heads off I mean we came back kill each other time right hey Mike why don't you and Jess go check out the guest cabin I told you about yeah yeah cool let's give a little look Jess want to head up there sure yeah I do so Josh uh should we get this fire going where's my bag huh my bag the the little bag with the pink pattern the one I got on Rodeo are you listening oh my God don't you remember next to the Italian shoe place where I got the stilettos and knocked over the rack while you were drooling all over that girl at the counter well I mean she was asking about my letter jacket right because she gave a damn about your designer letter jacket why do you hate my jacket Matt I need my bag oh my God Emily maybe you just forgot",
            "start": 3625.4
        },
        {
            "text": "well I mean she was asking about my letter jacket right because she gave a **** about your designer letter jacket why do you hate my jacket Matt I need my bag oh my God em maybe you just forgot it do you seriously think I'd forget my bag well do you guess not em I don't know where your bag is either that that's option a option b I took it and I shoved it right up my ass so feel free to go in there and get it okay it's plenty of room it's warm in there okay wait what she wants me to go back and get the bag I'm telling where you can find it I'm going to go take a bath yes things are going to get interesting I can tell I hope someone dies soon that's what I'm waiting for we're not stopping until somebody dies or someone bang someone how far is this cabin anyway this cabin is the coziest most romantic love Den you will ever Lay Your Eyes Upon we ever make I who that girl is that's the guy from Agents of S.H.I.E.L.D. will get lucky hey porn stars you're going to need these",
            "start": 3692.92
        },
        {
            "text": "most romantic love scene you'll ever lay your eyes upon we ever make I who that girl is that's the guy from The Shawshank Redemption or from Agents of S.H.I.E.L.D. will get lucky hey porn stars you're going to need these porn stars I pity to see you uh gross I'm sorry to kick you out like wow also we clearly did pay find a way to entertain yourselves you have fun with the peanut gallery all right for got to fire up the generator so you can see where you're going classic video games again we thought that just slandered Outlast we're in the same universe turns out Until Dawn as well those generators stupid generators wait really what no yeah that don't be stupid I'm not sharing you with anyone ever you're going to have to be mine forever all right hey Hot Lips photo booth all right my mind oh it's selfie time all right someone's going to have to get killed soon I'm getting bored kill herang her I get to take the selfie what the hell Tim is inappropriate good effort next time I get the camera okay well",
            "start": 3756.4
        },
        {
            "text": "Time alright someone's going to have to get killed soon I'm getting bored kill herang her I get to take the selfie what the hell Tim inappropriate good effort next time I get the camera okay well okay but it's not easy holding the thing all like backwards and forwards at the same time okay let's go I've got cabins here by that she means she wants some of that Mike Dick Jesus it is freezing out here must be the temps in the atmosphere and how are you going to do that I got a few things got a warm glow stick in my pocket yeah it's 6 inches long but it's gay what Kevin yeah I realized it was 8 inches earlier okay if I'm being honest myself it's not even six five and a half on a good day on like a warm day aggressive or evasive evasive CU we're trying to get some now ah you know just little peacock action from a lady oh really that was all just to impress me well you got to show off the goods when you got them I just realized Mike's my friend James Burke there I think Mike's you Mike's not me I'm",
            "start": 3836.04
        },
        {
            "text": "from a lady oh really that was all just to impress me well you got to show off the goods when you got them I just realized Mike's my friend James Burke there I think Mike's you Mike's not me I'm Chris truthful truthful woman like it when you tell the truth around am I not allowed to talk to her now that he's screwing her free country you right Jess you right cool let's keep going into the creepy Woods let me open the little gate door huh guess this thing needs juice or something didn't there was a generator did good call Jess death totem God damn it oh yeah here we go our all right got it Jesus danger to him it's like a lot of PE things are happening none of them being people dying and none of them being anyone getting Little P and the V generate me boom nice one Mikey like how he talks to himself he acts like he just fixed the 70 Chevy good job Mike you click the button okay I no I don't need that going back to the game going open the gate going to have some fun going to have",
            "start": 3910.04
        },
        {
            "text": "himself he acts like he just fixed the '70 Chevy good job Mike you click the button okay I no I don't need that going back to the game going open the gate going to have some fun going to have some fun going to go back to the gate can I just open the gate I have fun Zam Zam okay that seems like a really complex system for the gate yeah totally especially since you can just climb over like right there oh yeah I bring all right she trying to set the mood turn on that Spotify she getting ready for that Netflix and chill anyone like some Netflix and some chill I'll take some I mean I'm at least down for Hulu and a handrop I'm playing with Spotify and just some heavy petting uhoh police tap Hannah and Beth you think they'd clean it up well they never closed the investigation there ain't nothing clean about what's about to go down here girl now respectful right yeah ask no ask I want to know all right sure it's all such a BL barely even remember what happened happened well what I",
            "start": 3998.08
        },
        {
            "text": "Nothing clean about what's about to go down here, girl. Now, respectful, right? Yeah, ask no ask. I want to know all right. Sure it's all such a barely even remember what happened. Happened well, what I remember is that we played a stupid half-baked prank that probably got Hannah and Beth killed. Yeah, Mike, I mean it's not our fault they ran into the woods. I remember what happened. How could anyone have expected them to do a dumb thing like that? And she's getting scared. Tell you what, Nick. Cold and scared is never good. No, really isn't. Means I'm going to get frozen yogurt scared. Yeah, it's calming. I mean, it is a little bit scary because you never know if you're going to overfill the thing last time I went to get frozen yogurt ended up spending $15 on that. That's so good though. It came out so fast. Yeah, damn. I don't think we can get up to the cabin with a path block like this. Oh no way am I going back to the lodge AKA wax museum to drink hot chocolate with Emily. Oh **** Jess **** talk sh**, get shot.",
            "start": 4089.8
        },
        {
            "text": "I don't think we can get up to the cabin with a path block like this. Oh no way, am I going back to the lodge, aka wax museum, to drink hot chocolate with Emily? Oh **** Jess **** talk sh, get shot! Hey Jessica, yep, hey I'm okay. Holy crap, you scared the heck out of me. How do you think I felt? Uh, you didn't hit your head or anything as far as I can tell. I still have all seven of my limbs. Uh, yeah, can you get out? Boobs, I can hardly see anything. Yeah, I guess you're right. Got little pigtails going on. Cautious or heroic, heroic, heroic bro, doing it all right. Coming after just stay. Oh **** hey handsome want to help me move this cart thing? Yeah, I do. All right, hel my moving helmet moving! Yeah, I was trying to be cool, but why are they pushing it that way? I imagined us grunting together. This is not what I pictured. Fair enough, Mike. Well played, good line, Mike. Mike, you're starting to grow on me. And now we're in the Mine Fields like goddamn Donkey Kong Country level. What the **** are we doing in here? Push.",
            "start": 4161.8
        },
        {
            "text": "Fair enough, Mike. Well played, good line, Mike. You're starting to grow on me, and now we're in the Mine Fields like Goddamn Donkey Kong Country level. What the **** are we doing in here? Push the cart the other way. Let's climb up on it, bro. It's all good. Oh my gosh, are you okay? I think I threw out my wiener area. My penis should probably hold my ball muscle. I'm going to need a sports massage ASAP. What threw the Minecraft at us? Nelly, ASAP! This place is giving me the willies. I'll give you a Willie. I have a good Willie for you - a little comfort and reassurance. Jesus, this guy's being really clingy, bro. Death Totem, Mr. Al. The death totem in... my girl Sam. Jesus, okay. No, damn it. No, I'm good. I'm good, Mr. Al. To guess we're going back better on back. Putting the flashlight all around. I don't know why it does that. Just going to leave her back there. I guess I do something with the cart. No, I can't. What's up, girl? What you doing? Well, you saying Kevin? You're pointing at...",
            "start": 4240.76
        },
        {
            "text": "around I don't know why it does that, just going to leave her back there, I guess. I do something with the cart, no, I can't. What's up, girl? What are you doing? You saying Kevin, you're pointing at something. Is there another way to go to the left? We're here. Oh, there you go. You're so smart, Kevin. Good job, Kevin. There are steps leading up. She wasn't following me. You all right? Yeah, close one. I don't think this place is up to code. They've had a lot of close ones today. It's time to go. Yeah, we should go back to the house where there's a bed. We're trying to have... shit's not going to fall on us. Is love L okay? Got to go to the light and hit the X button. So much danger. This place is a real fixer-upper. All right, let's just get the **** out of here. Finally, a little way out. Hope look at that. That walk physics are very accurate. It is very realistic. I've seen many buts move in my day; they move just like that. No, I was distracted. You going to the cabin? Yeah, we're going to the little cabin.",
            "start": 4335.68
        },
        {
            "text": "that that walk physics very accurate it is very realistic I've seen many buts move in my day they move just like that no I was distracted you going to the cabin yeah we're going to the Cabin in the Woods about to make a little Whoopi we're going to make some of that sweet love sound what's love sound like Nick sounds like two beautiful things making into each other Kevin goes on it's nasty Take a Ride On Air Force One all right all right damn is that what you call your penis that's awesome you want to take a ride I call I'm going to start calling mine the Commander-in-Chief trees look at CLS look at the whoa you all right I just saw someone at the cabin look Bro think you're wrong girl you would see **** what's that I don't know I'm just going to pretend it didn't happen how many of your friends would you let die to have sex with this girl none I'd at least let him have Kevin wait **** for her it's cute you'll grow back okay go faster Mike God thought you were the",
            "start": 4469.44
        },
        {
            "text": "your friends would you let die to have sex with this girl none I'd at least let him have Kevin wait **** for her it's cute you'll grow back okay go faster Mike God thought you were the quarterback Mike why you why you got to be a such a wuss something's happening oh there's another **** Revenge J friend bro they got some friends Wy just just answering his wow you're easy yeah got a lot of love to give yeah he's got a lot of love to give all 30 seconds of it they call me the commander and chief you're at board Air Force One have a ride around the world the stratosphere all right what's happening are we going to get late where the **** is this cabin why is it so far from the other thing I'm calling it now this let's play ends as soon as someone dies someone gets laid or we see that goddamn like analyst again all right I'm really liking this though oh I like it a lot God damn it Josh you have at least cleared out the path before sending us up here really what I didn't",
            "start": 4553.92
        },
        {
            "text": "see that goddamn like analyst again all right I'm really liking this though oh I like it a lot God damn it Josh you have at least cleared out the path before sending us up here really what I didn't figure you for the glass half empty type you got a better idea Debbie go Jess show off your leading skills hey Mike you got something on your face my balls my balls are on your face Mike damn you just got snowed that's how it's going to be oh God yes yes Sammy what you want to help me get this fire going uh well I was just getting into the bath I love this game oh do you need any help with that Hardy okay come on all right Josh let's see if you know how to hook up the hot water in your big fancy Lodge we couldn't even get into it so what was that gotta be honest part of the reason that this game is so good is cuz the acting is actually really really good yeah like she's awesome actually all of them are awesome we go back to the death totem you missed it you missed the death totem",
            "start": 4646.28
        },
        {
            "text": "so good is cute the act the voice acting is actually really really good yeah like she's awesome actually all of them are awesome we go back to the death totem you missed it you missed the death totem it was a lot of **** it was Hannah's nope done happy Christmas get the **** out of here yeah it's freaky who the hell says happy Christmas British people party invite delighted if you came to party at the C Day Mike Hannah Crush much uhoh oh we already knew that when Greg played her a dick up **** what a waste where's the death totem right there I don't know what that is all was tattoo that's where she got her little butterfly tattoo Johan it's always a Johan Johansson maybe you've met me I'm a tattoo artist out of Tampa Bay Florida hi I specialize in butterfly tattoos I only really do one but I can do different colors Kevin saying what cut it cut it out Kevin what do you have on your on your stomach is there a bug other side the other side what is it stretch your shirt out",
            "start": 4768.32
        },
        {
            "text": "do one but I can do different colors Kevin saying what cut it cut it out Kevin what do you have on your on your stomach is there a bug other side the other side what is it stretch your shirt out on that side it's a bug just was a bug was lint it was lint okay you're looking as the day goes on you look more and more disheveled your hair starts to get all crazy why don't they just have masks everywhere it's freaky they had that's weird **** like that all the time in uh cabins you can do it man we believe in you yeah totally woohoo let's go Josh let's go okay well I'm pretty sure that somewhere in this crazy place we us have a spirit Kevin just got scared as **** by someone walking by those things are a joke man they don't do **** no way bro I mean we used to do it all the time me and well Josh no hot water's kind of major oversight don't you think yeah yeah you just got to fire up the boiler it's in the basement all right you guys see if you can find the spirit board Chris let's go",
            "start": 4834.4
        },
        {
            "text": "Josh, no hot water's kind of a major oversight don't you think? Yeah, yeah, you just got to fire up the boiler, it's in the basement. All right, you guys see if you can find the Ouija board. Chris, let's go find it; it'll be like a scavenger hunt. Yeah, Chris, why don't you go find it with her? Um, okay, Soad... oh, okay. I mean, I have to go there, I guess I'll go. I'm not trying to get late or anything, but if that happens, it'd be cool. I'm not saying it should happen at all; I definitely ship Chris and Ashley. Chris, no hope, zero hope. What are we up to? What's our mission? We're going to the boiler, are we, or is someone else? I think we're following him to go to the boiler. I just want a goddamn bath, you know. I don't want a bath; I'd like one of these people to take a bath in front of me. Leave it up to you as to who. Yeah, well, Josh looks like he works out. Was thinking they could use some alone time? Was very clever, very clever. Chris needs to go for it, and I just wish Chris would go for it; he's so",
            "start": 4894.6
        },
        {
            "text": "to who I'm pretty yeah well Josh looks like he works out was thinking they could use some alone time was very clever very clever Chris needs to go for it and I just wish Chris would go for it he's so paralyzed thinking she's going to shoot him down it's not going to happen which thing well neither if he doesn't go for it which knowing Chris he won't unless someone's holding a gun to his head you think they're going to I me I'd be okay with it i' be okay with anyone having sex in front of me right now I'll be honest this game is really fun but I also want dinner yes Josh I just wanted to say what oh she's into it it really means a lot to me that everyone came back this year and you know that you came Sam reassuring yeah I want this happen Josh we're here for you really whatever you need whenever since you brought that up I would like to make out like a hot make out sash right now be make sash yeah let's get that hot water on maybe you join me be hot I want your step don't worry I think",
            "start": 4945.44
        },
        {
            "text": "since you brought that up I would like to make out like a hot makeout session right now, be my sash yeah let's get that hot water on maybe you join me, be hot I want your step don't worry I think I can handle a little old set of stairs mhm what the **** is this place a compound what's down here is this the is this the sick this looks like that **** room in like The Girl with the Dragon Tattoo the guy like torture kills all the uh no Kevin saying don't don't bring that it was a movie good film excellent film the part where he's got a C cage I like if you would come here a week ago you would have seen a Hitcher that I **** decapitated with a sponge and I'll be super fine I mean I wouldn't want you coming down here on your own you know well it's definitely creepy down here yep not a place to be on your own oh Josh stop being creepy I got this bro get the **** out of my way all the way around here oh there's a b you see the baseball bat yeah here can you can you hold this I could",
            "start": 5009.96
        },
        {
            "text": "to be on your own oh Greg stop being creepy I got this bro get the **** out of my way all the way around here oh there's a b you see the baseball bat yeah here can you can you hold this I could be useful don't **** worry what was that what was what just shine in here so I can see what I'm doing they probably keep that Boiler on year round otherwise the pipes would freeze over **** don't move hey can you just you moved me that's smart look at the **** brain on you nice one thanks Greg I'll work out first things first we got to increase the water pressure before we get the boiler fired out okay sounds kind of complicated no it's actually pretty simple baseball bat where the **** are you you're not instilling confidence in me right now Greg rotate it bro what are you doing rotate it bro up and up and over there you go damn it's okay I'm just try again you got to hit it bro I'm trying I think it's supposed to mess up not that hard just press the button when the light comes on",
            "start": 5069.36
        },
        {
            "text": "it bro up and up and over there you go damn it's okay I'm just try again you got to hit it bro I'm trying I think it's supposed to mess up not that hard just press the button when the light comes on when the light on press the button Tim yeah okay look stop **** around R2 oh so I have to hit it to let go and then hit it hit it all right girl let's make out now I can't you got to hook up something better than this this is stupid here how about if I do this God damn it is that better Kevin you need to hear it Nick I know of nice I'm just just joshing you really freaked out prank him don't move what something behind you you're right Josh seriously there's something back there got you all right all right your point 30 love what no where'd you get the first point doesn't start at 30 no 15 T ass I gota be honest I've always had a special place in my heart for Sam yeah me too she's kind of good girl she's my girl smart what the rhythm is like weirdly regular not not nothing regular",
            "start": 5152.56
        },
        {
            "text": "15 Tim, I gotta be honest, I've always had a special place in my heart for Sam. Yeah, me too. She's kind of a good girl; she's my girl, smart. What's the rhythm like? Weirdly regular, not nothing regular about it. We should check it out together. Maybe we should check it out. Why? I want to see what if it's like...like a pipe that's about to burst or some problem with the furnace. Unlikely, if it were me, I wouldn't want this place to burn down in my watch. Yeah, right. Hold on, hold on. Don't go anywhere, Mike. You should get that baseball bat. Yeah, where was it? You ain't down there, bro. On the other side of this pillar. But he did it using some sort of weird Kevin quote sign language...like this. I don't see it. He keeps going this way; keep coming this way; keep coming toward me. Come toward Daddy. Come toward Daddy. Come come into the light. Come toward Daddy. Come toward daddy. Keep coming, harder. I don't know. Kevin thought it was there in the locker. Was in the locker. It's gone now. Can't beat that.",
            "start": 5269.28
        },
        {
            "text": "Daddy, come into the light. Come toward Daddy. Keep coming, harder. I don't know; Kevin thought it was there in the locker. Was in the locker; it's gone now. Can't beat that with a baseball bat. Okay, okay. Do you think this is actually something that's going to get us, or is this more of a... oh, oh, a lie? It's clearly Chris. No, come on. Why are these doors locked to keep out strangers? Hey, what the hell? Bo, you just got mugged! What nice one was that? That was good. Wa, why would you do that? There's all this cool old stuff down here. What was I not supposed to take advantage of the opportunity? Are you serious? Were you in on this? No, but I wish I was; that was too good. P, I'm ready to not with Chris prank. I guess you're right; it's a human joke. Master, well, I said nothing about jokes; I said your prank, which was D. Holy crap, you were scared! ADM, I was not come on. You totally... yeah. I wonder if Kevin brings up a good point: if I had the bat would",
            "start": 5338.4
        },
        {
            "text": "Master, I said nothing about jokes, I said your prank which was D holy crap you were scared ADM I was not come on you totally yeah I wonder if Kevin brings up a good point if I had the bat would I sprain that dude what God's name are you wearing I found my true calling please tell me you're going to take a vow of silence okay okay okay did you at least find the thingy I'm Chris here's our one-way ticket to the spirit all right you know what you know no this is enough go take a bath I see a hot bath in my crystal ball oh I want you to have a yeah see what you got to do but watch out for that Josh he's okay I scheme like I said right we're calling it at the analyst want to do you think this is the start of the new chapter or the end of this chapter I think it's the start of a new well I think it's the end of this chapter is it up let's get through this all right just just the analyst section and then we'll we're going to call it a day like to I do want to beat this",
            "start": 5427.96
        },
        {
            "text": "of a new well I think it's the end of this chapter is it up let's get through this all right just just the analyst section and then we'll we're going to call it a day like to I do want to beat this game with you though yeah we should play again we stream or something yeah we can stream this this is a lot of fun do you share this fear that's some BS yes I do and there's needles BS you yes yeah I Share this fear why would you do this to us you think a clown's going to come because that's not reflected in the way you are playing your game now is it I listen doc this is weird you're a weird dude and you got a dope cardigan on so I'm not going to like sweat you on that dog yeah but and now now let us investigate your feelings toward other people in Greater depth okay we could do that what you value what you respect in yourself and others deal which would you say was most important in a person loyalty or honesty loyalty so you would tell a lie in order to Be loyal to a friend okay",
            "start": 5488.08
        },
        {
            "text": "you value what you respect in yourself and others deal which would you say was most important in a person loyalty or honesty loyalty so you would tell a lie in order to be loyal to a friend okay and what about loyalty versus charity loyalty so you would sooner look after your friends before caring for those in greater need 100% bro well you don't know Nick Scarpino don't you back off sweater vest go get me go get me a hot chocolate all right yeah cool bro ladies and gentlemen this was the first hour and a half of Until Dawn it was indeed quite possibly the longest let's play we've ever done it was good though it was fun will we break this into two probably not this is going to be one one one for everyone's everyone's fun we should keep this going though I want to play this again I need to make sure that we save and everything's all great cuz I want to finish this game with you I want to find out what happens and I definitely want to save everyone Will Hayden pener get bath I hope",
            "start": 5551.28
        },
        {
            "text": "make sure that we save and everything's all great cuz I want to finish this game with you I want to find out what happens and I definitely want to make sure everyone survives Will Hayden gets a bath I hope so we'll find out more next time on Kinda Funny Games' YouTube channel we're going to keep playing horror games Nick might be done we might play a little Five Nights at Freddy's maybe not we're going to figure that out one day hey Until Dawn hey I love you what the hell is wrong with you",
            "start": 5620.0
        }
    ]
}