{
    "id": 1293,
    "video_id": "EXe2NepHz_I",
    "show_name": "Gameplay",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "Let's Play Dragon Quest Heroes - Kinda Funny Plays",
    "description": "Colin plays a bit of Dragon Quest Heroes.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1445630404,
    "duration": 2185,
    "transcript_chunks": [
        {
            "text": "greetings and salutations welcome to Kinda Funny Games My name is Colin Moriarty today as promised I'm going to play Dragon Quest Heroes the world tree's wo in the blight below this of course is published by Square Enix but created by Omega Force and it's a musou um much like uh Dynasty Warriors or Samurai Warriors or whatever else um so I'm going to venture forth here and I'm going to select my I'm a level 12 Lucius I played as you can play as a male character or a female character she will still be in your party or vice versa if you choose the other uh only about 3 hours in so I have you know um something to say about the game I'm not an expert at these games by any stretch of the imagination so do forgive me if I'm not playing them as fluidly as you might um but I did want to give you a look at this because I'm actually a huge Dragon Quest fan rather and one of um the things that I really want to do with this particular game is not write off these Omega Force type Tecmo KOEI games seemingly very",
            "start": 0.0
        },
        {
            "text": "I'm actually a huge Dragon Quest fan rather, and one of the things that I really want to do with this particular game is not write off these Omega Force/Techno Games type games, which seem very repetitive - they are very repetitive kinds of games. And I feel like if this particular game can't get its hooks into me with all its bells and whistles and fan service to Dragon Quest fans like me, then I'm probably never going to be into these types of games at all. Um, so as you can see, first of all, I think the game's pretty - and you're going to see, I mean it's not like you know out of this world pretty by any stretch of the imagination, but um, I think it is a pretty game. Um, and I just thought I would show you uh well, you know let's go out to the world map and uh we'll just go do some battles and I'll show you what the game looks like. So here you can see some of the things like uh you know these exclamation points indicate things that are left to be done um so we can have skirmishes",
            "start": 38.12
        },
        {
            "text": "I'll show you what the game looks like, so here you can see some of the things like uh, you know these exclamation points indicate things that are left to be done. Um, so we can have skirmishes and all these kinds of things even though we've already been to these places. So let's go back to Arba, which is a really early part of the game, and this will probably be really easy, but we can at least have a skirmish here. We're going to find Hammer Hoods, Slimes, Magus's skeletons, and Draigs - so very familiar Dragon Quest enemies. My phone is ringing, so I'm just going to throw that on the ground. Okay, understood? Take on this challenge, yes. Let's go. We'll show you exactly what the game's like, so we'll do a couple of these and then maybe we'll continue the story and do like a story mission. And you can see they're pretty much all the same - lots of enemies, hundreds and hundreds of enemies, just maybe thousands of enemies depending on the map you're on, just hacking and",
            "start": 77.28
        },
        {
            "text": "like a story mission and you can see they're pretty much all the same lots of enemies hundreds and hundreds of enemies just maybe thousands of enemies depending on the map you're on just hacking and slashing away at them so I have my party with me here and uh I can look at the map if I want you can see the red dots here are represent enemies and you can see it kind of in the upper corner so let's let's just you know beat the living **** out of these guys so you can see I think the enemies look really really cool um these are obviously all very familiar classic sorts of enemies um in Dragon Quest slimes especially but obviously the skeletons and drakes these are all very familiar enemies too so the the one thing I'll say about this game having not played nearly enough of it to have any sort of comprehensive critical opinion on it is that I can't imagine that this game is going to appeal much to you if you are not a Dragon Quest fan none of this means anything to you these",
            "start": 128.44
        },
        {
            "text": "It to have any sort of comprehensive critical opinion on it is that I can't imagine that this game is going to appeal much to you if you are not a Dragon Quest fan. None of this means anything to you, these Slimes don't mean anything to you, these enemies don't mean anything to you. Um, maybe even some of these locations or characters uh, you know obviously the art style might not uh resonate with you if you're not a Dragon Quest fan. But me being a very much a Dragon Quest fan, super annoying um in terms of the aesthetic. Um so these party members I have with me um can be switched in and out and also these tokens mean something I'll show you what those mean in a minute um but if I press L2 I can switch around to characters and use them in their skills so she uses like a boomerang for instance um if I switch to her she kind of uses a sword and shield attack and the King here, this King character uses like a staff has all sorts of special attacks as well but I actually prefer just to use the main",
            "start": 171.16
        },
        {
            "text": "I switch to her; she kind of uses a sword and shield attack, and the King here - this King character uses like a staff with all sorts of special attacks as well. But I actually prefer just using the main character mostly because I don't know - I'm just mashing buttons away. You can make it more complicated for yourself by using some tactics and some more complicated button combinations, but I just don't really feel like that adds to my enjoyment of the game personally. I might add to yours; that doesn't really do anything to me. It's not the complication or lack thereof in the game that's really the problem - it's more the repetitiveness. So you can see here, a new horde of enemies has appeared, and I have to deal with them, and they're kind of congregating here in the center. So we can head back, and I'll show you one of these tokens; so the tokens on the bottom - you can see the slimes and the skeletons there. I use the d-pad to kind of go between them left or right, and then to um summon them",
            "start": 212.12
        },
        {
            "text": "and I'll show you one of these tokens, so the tokens on the bottom - you can see the slimes and the skeletons there. I use the d-pad to kind of go between them left or right, and then to summon them, I press up, and to dismiss them, I press down, so they'll attack for me. So I can just put a slime right here; I'll just put a slime right here that will fight on my behalf, and he'll just kind of hold his ground and stay there. And you can only carry at least, right now, six tokens. Some of the characters are so strong our monsters that they take two or three slots up, so that doesn't necessarily mean you can carry six enemies at once, although you probably can. You can carry up to six slots at once if that makes any sense. So let's grab a skeleton here; we can throw him down and he can fight on your behalf. So here's our friend the Skeleton, Vagabond - which is quite cool. Here we have a Dry Token; we can grab actually I'm out of room, so we'll drop another.",
            "start": 248.84
        },
        {
            "text": "Here's our friend the skeleton, and he'll kind of just introduce himself - his name is Vagabond. Here we have a Dryad token; we can grab it actually, I can't grab it because I'm out of room, so we'll drop another skeleton - actually, a Slime. Oh, I see okay there we go. Serve me well, because one of them needs to be dismissed, so we get rid of him. Pick up this Greenie here and we can actually... I'll need to dismiss one more, get rid of him there. So the Draal you see here takes up two slots; it seems like the enemies are congregating more in the center here, so we probably should get back to the center. You can jump using a dash, of course - get a little crazy with it if you want. So here, let's use the uh summon the Dryad on our behalf one cool thing you can do and I'll show you... the purple meter here next to my guy, to the left of his icon on the bottom left corner of the screen... um I want a Magus actually so let's get rid of some of these guys, get... that will fill up and allow me to do some special attacks.",
            "start": 284.36
        },
        {
            "text": "guy to the left of his icon on the bottom left corner of the screen, I want a Magus actually, so let's get rid of some of these guys; get um that will fill up and allow me to do some special attacks, which we can show in a minute as well once it fills up. So let's get rid of these spell casters. As you can hear, I hope if you're a Dragon Quest fan, lots of familiar noises and sounds. I really like that; I mean this in terms of the way it treats Dragon Quest fans. I think this game is really really neat. Can I... there's any it says there's enemies over here; I guess they're up there though. Oh, the stairs. Okay, so here we're getting pretty close to being able to fill up this purple metering searing and everyone's kind of just dropping stuff for me to use if I want. I; the things in the little pouches unless there's like a herb coming out of it, um, which would indicate it's like a healing herb. These pouches are items that you can use to synthesize new items, um, which is not something I've gotten too",
            "start": 355.44
        },
        {
            "text": "unless there's like an herb coming out of it um which would indicate it's like a healing herb these pouches are items that you can use to synthesize new items um which is not something we've gotten too deep into yet so let's go up the stairs here and see if we can get rid of uh these guys since they're just lingering yeah these Moogles are just waiting to cast some spells and you can interrupt their spell casting although not all enemies can be interrupted a new horde has appeared as you can see here as I just flash on the screen there's one more enemy up here I think there he is that jar uh would be MP I can use Magic by holding down the R1 button and then using um an attack in that fashion so I only have one spell right now because I'm not really been investing in that it's called Infernal Flash uh Slash rather pretty powerful you can see here INF get rid of a bunch of enemies at once so new hordes are appearing and I have to deal with them quickly I'm pretty thorough",
            "start": 410.16
        },
        {
            "text": "infernal flash, uh, slash rather pretty powerful you can see here. Get rid of a bunch of enemies at once so new hordes are appearing and I have to deal with them quickly. I'm pretty thorough; you can actually let some of these enemies linger if there's like one or two enemies left. I just hate looking at my HUD, I think you guys can your OCD Gamers out there you can kind of relate. Um, don't want to leave anyone just kind of hanging around. So lots of hordes are appearing; I got to kind of deal with these guys. These guys are being aggressive here; they're coming at me quick. All right, so let's use. I'm going to use my circle attack. This will bring me to a special mode where I don't take any um death damage and I don't think I use any MP and stuff like that. And then I can execute at the end of it um like a super special attack if I want um, that will kind of engulf everyone on the screen. This attack here which I'm like not in any range of any enemies unfortunately",
            "start": 463.0
        },
        {
            "text": "at the end of it um like a super special attack if I want um that will kind of engulf everyone on the screen this attack here which I'm like not in any range of any enemies unfortunately to use and then I basically just refill um the gauge and go again now the interesting thing about that of course is um that you can execute that once you hit the circle button by hitting Circle again um otherwise it'll be used automatically which is what happened to me there and you better be careful that you know you're in a good spot otherwise it's kind of going to be uselessly used which is unfortunate so let's kill some of these slimes look like we're thinning the herd a little bit but I don't know how long it'll last let's kill the dragon there we head out this way my friend Oald is still hanging tough I appreciate it kill those guys there seems like the biggest amount of enemies is probably over here so a new horde has appeared so we'll keep advancing and kind of just take care of these guys best",
            "start": 512.12
        },
        {
            "text": "I appreciate killing those guys, there seems like the biggest amount of enemies is probably over here, so a new horde has appeared, so we'll keep advancing and kind of just take care of these guys best we can, and then looks like the new horde's over here, so let's swing this way and we can just launch a spell at them. Take care of most of them pretty quick, and then we can do the same over here if we'd like. Inferno slash. You can also see in the corner I'm building up you know hit combo and all those kinds of things that will help you build meter quicker. You got this item because these enemies, because this is such an early part of a level, um, the enemies are not giving me much experience, and I'm not um quickly vanquishing them either. I frankly probably should have used that meter a little more wisely maybe what I really should be doing is using some of my friends here a little more wisely as well again I'm kind of a novice at these games so do forgive",
            "start": 575.16
        },
        {
            "text": "used that meter a little more wisely maybe what I really should be doing is using some of my friends here a little more wisely as well again I'm kind of a novice at these games so do forgive me so lots of new enemies appearing although fighting these enemies doesn't really hurt because it's you know it's helping me build meter and doing all these things so and my experience although not you know very slowly the yellow bar underneath my MP meter is um Inferno my experience meter oh my God there's like so many enemies Inferno slash so we're starting to call him a little bit my friend Magi Magi Yosho I guess his name is or something of this is doing his damnest it's unclear to me whether like you have to be quick and I'm sure you know people watching this probably like shaking their heads maybe knowing the answer to this but I just don't um if it's like about speed the hordes come if there's a finite amount",
            "start": 659.12
        },
        {
            "text": "probably like shaking their heads maybe knowing the answer to this but I just don't um if it's like about speed the hordes come if you can like if there's you know if there's a finite amount of them that will come or you know if they'll just come regardless how quick you are or what I don't really know the answer should be told all right so my meter's all filled up where I can use my special attack again but I'm not going to do that quite yet cuz I want to make sure I'm in a good spot this time to do that Inferno slash, Sering Slash so let's use a spell here to kind get rid of some of these guys and then I'm going to go down here and challenge these dudes got more wh so many of them little ridiculous Steiner Slash so let's go back and see what we can do hit Circle maybe a little too early and see if we can just use our special attack here to get rid of some of these guys on mass a little bit of clipping there considering where I'm using",
            "start": 766.92
        },
        {
            "text": "we can do hit Circle maybe H little too early and see if we can just use our special attack here to get rid of some of these guys on mass a little bit of clipping there considering where I'm using it I guess it's not necessarily made to be used there that took care of some of them not bad and we start again so we spent quite a bit of time here I don't know if this is going to end any anytime soon I'll give it another minute or two if not I'll exit out is the game told me I can leave at any time and keep my experience and my gold and stuff like that which is nice so you don't feel like you're wasting your time even if you die I think you um I haven't died yet but I think if you die you keep everything you've earned as well which is you know nice all doing his damnest hold his ground Inferno slash searing slash so you can see the enemy AI is like not that intelligent there are big boss enemies that I fought I fought like a cyclops enemy and a few others theres",
            "start": 862.76
        },
        {
            "text": "Inferno slash searing slash so you can see the enemy AI is like not that intelligent there are big boss enemies that I fought I fought like a Cyclops enemy and a few others there's also like sub-boss type enemies that you can fight um uh what's an example I fought like you know uh gold men like golems and stuff like that um better there it looks like the C the hard might be being called finally let's see as long as no one else gets summoned here I'm going to lose my mind oh my God I said it oh my God I spoke too soon oh my God another horde all right this is enough so I'm going to bail out of here I think I can hit X and just evacuate and I can escape from battle but I leave with everything that I came with and then some obviously so we're going to head back to my my flying Airship base it'll tell me what I won so let's go to one more map and then I'll come back and uh show you some of the cool systems in the game and then um and then we'll Advance the story",
            "start": 924.68
        },
        {
            "text": "my flying Airship base, it'll tell me what I won, so let's go to one more map and then I'll come back and uh show you some of the cool systems in the game, and then um, and then we'll advance the story maybe do a story mission, so let's go to like one more random place that I wasn't at before, so ARB is there, let's go to Kisia, it's where I have to go to continue the story, so let's go to Calabock um so let's go to the meadow and take on a massive actually before I even do it let's see so Hero fight fight Hammerhead Skeleton Slime Slimes Knights she slimes Draugr bubble slimes Magus's and Teeny Sanguis um so CL Slaugh of classic Dragon Quest enemies who's who's texting me a lot, who is it, oh okay all right, so here we are on the field this map is a little more contained as you can see here this is the entirety of the map so it's a little easier to get around also want to show you this cuz it's like kind of more outdoorsy even the other one was outdoor but it was in a town so I thought",
            "start": 988.8
        },
        {
            "text": "this is the entirety of the map so it's a little easier to get around also want to show you this cuz it's like kind of more outdoorsy even the other one was outdoor but it was in a town so I thought maybe you'd want to see a little something different also more enemy divers here so fight the skeletons in the grasses etc etc etc spell Skeleton thing just going to run away just got away from me I don't think so buddy Flash Inferno slash searing slash Inferno slash we're fighting we're fending them off we're doing the best we can many more hordes of enemies are appearing I'm building up my meter leveled up nice onward some stragglers over here probably be taken care of pick up that dry uh token that I can use in battle if I want skeleton's got his back turnning me a huge mistake we get back into the field here the interesting thing about the tall grasses here is that it obscures a lot of the small enemies like the slimes you can see the color of",
            "start": 1060.36
        },
        {
            "text": "turning me a huge mistake we get back into the field here the interesting thing about the tall grasses here is that it obscures a lot of the small enemies like the Slimes you can see the color of them but sometimes the volume of them is not that represented based on what you're seeing see so a new horde has appeared we're going and we moving all right so let's fight here for a couple more minutes the hord's probably going to keep coming it's at a massive horde uh in the menu I'll take their W for it so we're fighting and we're killing and we're singing I just find this incredibly repetitive I don't know I mean it's it's fun it's just like I don't really it's one of those games where people are no doubt going to be like well you're not playing it right or there's more to it than that but I always make the suggestion to people that it's still like if within the parameters of the design of the game if you can play it in such a way then the game should make you play it the way",
            "start": 1217.36
        },
        {
            "text": "but I always make the suggestion to people that it's still like if the within the parameters of the design of the game if you can play it in such a way then the game should make you play it the way it's meant to be played, \"meant to be played\" um otherwise it's the failure of the game not the gamer um so let's uh get in here and I'll press Circle one more time we'll see if we can kill off some of these dudes and lickety split kind of matter I'm just going to press Circle again to dominate the field all right so another horde appeared we'll be here forever so I'm going to evacuate again and now that we go back to the Airship oh evacuate will come when you can't use spells again all right so now I can probably use it yes okay I was in the middle of an action that's why it would not let me leave all right so we're back on the Airship it's going to tell me what I earned from the previous battle will not be as heavy as it was last time cuz I was on a different place",
            "start": 1279.72
        },
        {
            "text": "leave all right so we're back on the Airship it's going to tell me what I earned in the previous battle will not be the load will not be as heavy as it was last time cuz I was on a different place for way longer um um but couple of my guys leveled up very nice all right so let's show you some of the cool things about this Airship um some of the merchants and whatnot so yeah these people are not open yet um this woman will sell you orbs orbs uh help you with your defense all my guys are equipped with leather armor but um you can see that there's different kinds of orbs that you can equip and I'll be more into the game again I'm only about three three and half hours in this guy sells weapons and shields um which I can actually afford to buy for some of my characters now so maybe I'll buy her a new one the Gustang uh 2650 which is quite handy and I'll equip it on her and there she is she's got a nice little Boomerang for her still have $4,000 so let's see if um I",
            "start": 1337.48
        },
        {
            "text": "so maybe I'll buy her a new one, the Mustang uh 2650 which is quite a hall and I'll equip it on her and there she is, she's got a nice little Boomerang for her. still have $4,000 so let's see if um I have other characters as well that are not with me right now. If I press square you can see that I have these other characters. So he can use a Holy Lance for 2100. So let's equip that. He's not in my party right now but I'm going to equip it on him so we can use it later and then let's see, she can equip Talisman, so gloves. She uses her fists, so we'll equip her with that as well. All right um so everyone's got the best weapons they can have right now. And then over here this is like the the um post office and you get like see you later parcels and maps and what not delivered to you but I've read them all already so there's nothing new really there. This guy kind of tells you what you need to know um in terms of like you know just some random game information. This guy can is",
            "start": 1378.48
        },
        {
            "text": "but I've read them all already so there's nothing new really there this guy kind of tells you what you need to know um in terms of like you know just some random Game information this guy can is an Alchemist so you can create accessories with him um I don't have the necessary things to create anything uh with him yet do come again um this guy takes many Medals from you I don't I think yeah I only have one Medal in my possession I already bought something off of my Think um so I'm going to hold off on that for now um but uh Mini Medals of course famous collectible in Dragon Quest games so those are some of the shops that you can use um you can talk to some characters on the periphery here as well um I have a little um friend over here this Man of War I can talk to he's a little Annoying actually not really a huge fan of his you can talk to other people around here as well this Priestess is where you save your game we'll get back to that in a minute make sure we've seen",
            "start": 1430.32
        },
        {
            "text": "Annoying, actually not really a huge fan of his. You can talk to other people around here as well. This Priestess is where you save your game. We'll get back to that in a minute. Make sure we've seen everything. I think we have, so we'll save our game real quick. Welcome child, let us pray. So at three and a half hours on the dot, not bad. Do I wish it would end my adventure? I don't thank you; I appreciate it. The goddess will watch over me. Um, so we will go back to the map. There's one other thing I want to show you. Um, if you go to Miscellaneous and you go to Allocate Skill Points, this is a pretty interesting thing as well. So there's a whole skill menu in addition to leveling up your character. You can allocate skills to them that will teach them new new new skills or you know new attributes etc. I've been focusing all my points and attributes right now. Um, but you don't have to do that. You can do other things. So like Lucien has his exclusive kind of things... like I can buy this for",
            "start": 1484.6
        },
        {
            "text": "Etc, I've been focusing all my points and attributes right now. Um, but you don't have to do that; you can do other things. So, like Lucien has his exclusive kind of things, like I can buy this for five points, which will extend um, my slash attack. I can also buy these attacks, so maybe I'll buy one of these - forces gouts of flame from the ground to blast enemies way. So, this will be used with R1 plus triangle. So, I'll buy this um, and then let's see; I have five skill points left. So, let's see what I can buy for it. I'll buy the Infernal Flash Extender or Inferno SL extender, so buy that as well. And I'll go through all my characters and see what they have here, what I can do with them. So, I'll do pretty similar things for all of them probably. He only has six points or seven points, so let's see if I can is there anything that costs exactly seven that I can use? No, I'll buy this skill, and she has nine skill points, so I can do something like Smooth Operator, Uplifting Downpour, and",
            "start": 1543.64
        },
        {
            "text": "see if I can is there anything that costs exactly seven that I can use no I'll buy this skill and she has nine skill points so I can do something like Smooth Operator, Uplifting Downpour, and Firebird the row for Elena. I will do let's see she has oh she has 31 skill points Jesus Christ all right so actually I'll dump these into these so she can be a little more powerful give her HP MP strength C this seems like an obvious place to dump points for every character I don't know that you might necessarily agree or disagree depending on your point of view you a lot of you out there probably know more about this game than I do excuse me and then I have seven left so let's see what I can do with seven points Artful Dodger slightly increases the period of invincibility after each successful Invasion let's get that and then one more character and Koll who has 29 Points so a similar amount so will do the same thing with him raises uh strength as well",
            "start": 1604.52
        },
        {
            "text": "after each successful Invasion, let's get that and then one more character, Colin has 29 points, so a similar amount, so will do the same thing with him raises uh strength as well, so HP, MP, and strength, and then we'll also go ahead and raise his resilience to attacks, and then Elly with Five Points, let's see what we can do here is there anything that's worth five, well this one's worth four, this is the Whack Attack, a Cursed Incantation that sends an enemy to the Hereafter, whack, all right, so I've spent my skill points and now I will go back to the map and we'll continue with the story and see what happens, so I show you a little bit of the cut scenes and the way the characters interact and talk, I find the male protagonists uh voice acting a little Annoying, meeting the mayor upon arriving at the gates of Colosa, the party are perturbed to find monsters already attacking, fire your way inside before the fiends can get their talons on the town's people, so let's go",
            "start": 1685.96
        },
        {
            "text": "at the gates of the Colosseum, the party are perturbed to find monsters already attacking; fire your way inside before the fiends can get their talons on the town's people. So let's go - the town is divided into three districts. We're not getting a proper cut scene here, so you're not going to be able to see the voice acting, but maybe after the battle's over. Be careful; here's one of the more mini-boss type characters I was talking about. Overstretch yourself, do not threaten your head - so such minimal numbers will not cause me even to stress. So you can see the makeup; oh, the mayor's taking some damage. Oh, he's over here. I see. All right, so I've got to actually protect him. So a lot of these things are very Tower Defense-like as well. Um, he's fighting some goblins and whatnot. Um, there is a tower defense element to this game that I don't really remember in the older Dynasty Warriors and Samurai Warriors games that I played; I don't know if that's something that's appeared since then I",
            "start": 1748.0
        },
        {
            "text": "a tower defense element to this game that I don't really remember in the older Dynasty Warriors and Samurai Warriors games that I played I don't know if that's something that's appeared since then I couldn't really tell you um these Mo'Keters are actually an interesting thing though so these portals that these Mo'Keters create will allow monsters to continually come out so you have to destroy them as quickly as you can although I assume if you want to gain as much experience as possible and you have the patience for it you can just leave them and they'll just spawn enemies all day so he's dead and then the enemies will stop coming out of there now kind of burst through these zombies real quick and go help the mayor cuz he's under siege I think again from some enemies Inferno slash so I saved him just in the nick of time look like Inferno I forgot I have another spell to use now I can use the Flame Slash we'll see what that's all about Flame Slash cool Inferno",
            "start": 1825.92
        },
        {
            "text": "\"Slash, so I saved him just in time. Look like Inferno - I forgot I have another spell to use. Now I can use Flame Slash and see what that's all about. Flame slash, cool. Inferno, flame Inferno. Check out this mage as quickly as possible; he's done, and we should probably get back here to deal with more of these enemies back here. I'm at MP 2, trying to compete in the Celebration of Violence. We must enter together, your majesty. There's taking some damage - I got to get him. I want to beat this first wave here. Backtrack him all right; so no more enemies spawning from here. There are some stragglers which we can try to take care of as we go back. Generally, the mar is taking damage; we've got to be quick. The last wave of enemies is coming now - he's taking some damage and don't want to die. Oh, he's dealing with a Golem; he's done. Let's see... deal with this guy. Spawn my friend here all right? Will he... these guys are coming from the other end now, so let's see if we can get rid of them. This guy's got a\"",
            "start": 1873.32
        },
        {
            "text": "he's dealing with a Golem he's done let's see deal with this guy spawn my friend here all right will he these guys are coming from the other end now so see if we can get rid of them this guy's got a shield they got to get around them should be him all right so we got to get to this last uh portal if we can Inferno slash okay so he's he's being attacked you picked up a Golem medal okay so when you pick up a metal you've never picked up before um it'll let you know so we picked it up he takes three slots which I haven't seen yet very early so I'm going to spawn him see what happens and I forget that I have my special attacks here that I can use so I should probably break those out at some point deal with this last wave so let's advance now searing slash want to go see if we can take care of these guys did nice damage here flash monst being please so once you like thin them out they'll actually start to run away and then disappear and you can kind of try to clean",
            "start": 1956.12
        },
        {
            "text": "care of these guys did nice damage here, Flash Monster being please so once you like thin them out they'll actually start to run away and then disappear and you can kind of try to clean them up if you want but that basically indicates the end of the mission and then you can see Mankey Mud Royal Soil Iron Nails in the corner those are the items that that enemies dropped that I did not get to pick up yet as far as I can understand just realized my microphone was in my shirt so hopefully that wasn't happening for very long I think I'm okay think I'm all right so I mean that's a little taste for you I hope uh that you enjoyed of Dragon Quest Heroes available on PlayStation 4 I think I think it's also on PS3 I think it was in Japan I'm not sure if it is here or in the west it might be I mean that's up for you to look for but I'm playing here on PlayStation 4 um I hope you enjoyed uh the let's play thank you for tuning in remember we do uh more let's plays uh most",
            "start": 2078.64
        },
        {
            "text": "west it might be I mean that's up to you to look for but I'm playing here on PlayStation 4 um I hope you enjoyed uh the Let's Play thank you for tuning in remember we do uh more Let's Plays uh most weekdays here on Kinda Funny Games youtube.com/ kindafunnygames where you are likely right now thank you for your support we appreciate it we'll see you next time for more of this goodbye",
            "start": 2160.08
        }
    ]
}