{
    "id": 1291,
    "video_id": "faY4e9bwTiI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Challenging Conventional Wisdom - The GameOverGreggy Show Ep. 98 (Pt. 4)",
    "description": "Colin Moriarty challenges conventional wisdom.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1445497201,
    "duration": 872,
    "transcript_chunks": [
        {
            "text": "Colin, yes, take me home. Uh, so let me tell you a story, and where we're gonna get to is a nice, nice light way to end the podcast okay. Mike Pope, I brought him up before, I went to his wedding; I was in his wedding party. We had a great time; we were up in Connecticut in the middle of nowhere. I already told you guys I was on a Bender for like 3 days now. On the night of the wedding, I told you that he lit up a bonfire by shooting a flaming arrow into it, which is a true story. Now, everyone was drunk and having a great time by this point so we all gather around the fire right, and we're just sitting around. I'm smoking a cigar drinking a beer in my suit, just laying around or whatever. I sit next to this girl; I never met her before; she's like friends with his um his wife. So we struck up a conversation, and we were going back and forth. She's like, \"Oh, what are you doing my blah,\" like what you do blah blah blah. And she was saying she was uh, you know, we were talking back and forth, and she",
            "start": 14.72
        },
        {
            "text": "up a conversation and we were going back and forth she's like oh what are you doing my blah like what you do blah blah blah and she was saying she was um you know we were talking back and forth and she said something where I was like I said you know I just said I was like how old are you MH and because she had said something that made it seem like she was younger like younger than us and we're all like in our old you know late 20s early 30s and she's like oh you know I'm 27 or whatever I'm like oh okay cool and then I I we we that's basically the end of the story to get me to the point I'm trying to make which was conventional wisdom no no no sorry uh conventional wisdom states that there's certain things you like there's just conventional wisdom and one of the things that conventional wisd says is you never ask a woman her age sure and um I don't ascribe to that I think that's a stupid rule so what I want to talk about today is what conventional wisdom do you find to be stupid",
            "start": 55.96
        },
        {
            "text": "Colin Moriarty says, \"Is you never ask a woman her age? Sure. And um, I don't ascribe to that. I think that's a stupid rule.\" So, the thing I want to talk about today is what conventional wisdom do you find to be stupid? I'll give you a couple of examples of conventional wisdom right uh. Practice makes perfect not true, right? Practice doesn't make perfect; nothing's perfect. Practice makes better was the way they got around it some way back in time in the late 80s early 90s and that's just sounds stupid. So, that's another example. Or money is the root of all evil - another thing that's not true. And the words of uh uh who was it? It was uh Ben Affleck in Boiler Room. What what did what did he say? No, it's an awesome quote though and it is a quote that people know if they've seen the movie. It's like uh people who say money is the root of all evil never had any yeah I think is is the is the is the quote which I think is like an amazing quote not that I agree with what he's saying, I just love that that's like the way.",
            "start": 90.72
        },
        {
            "text": "is the root of all evil never had any yeah I think is is the is the is the quote which I think is like an amazing quote not that I agree with what he's saying I just love that that's like the way he nails it in the butt that's a great movie by the way you should watch it takes place a long um so that's how I imagine most of your childhood was truth to be told you just selling junk bonds out of out of office parks and malls um so what do you guys can you guys think of any conventional wisdom that you don't agree with just like I don't agree with never asking a woman her age because I think that's a stupid question like that doesn't make any sense though yeah there there's one that's driven me crazy all my life and it's there's no such thing as a stupid question only stupid answers no there are some dumb questions I've heard in my life question I'm on Twitter I have seen some questions where I'm like what is that I've seen them some sir yeah I I mean there's still dumb answers I'm not excusing the",
            "start": 131.24
        },
        {
            "text": "questions I've heard in my life, question I'm on Twitter, I have seen some questions where I'm like \"what is that?\" I've seen them, sir. Yeah, I mean, there's still dumb answers, I'm not excusing the dumb answer people, but like the dumb answers can go with the dumb questions and they can just all just go marry themselves off down the road right? Just that one, I just don't like it 'cause like that it's given people license to ask dumb questions just by the mere fact that it is a question in inarticulate questions, questions that are postulated on falsehoods. Just Google sometimes too, yeah, sometimes Google. Anyway, that's it. You know? Yeah, obviously the top dumb question is when is Kingdom Hearts 3 coming out? Goofy already told you this year, so don't worry, I've told you, mother told you, motherf**kers. I've never been a fan of there's no eye in team. I understand that there has to be a team mentality but we're a team, we do all this stuff and there has to be an eye in it. You guys know what you",
            "start": 170.4
        },
        {
            "text": "never been a fan of there's no \"I\" in team, I understand that there has to be a team mentality but we're a team, we do all this stuff and there has to be an eye in it. You got you guys know what you need to go do, you know, and you need to step up, you know. We all know what our roles are and how we have to go do it. Yeah, I always hated that too, especially in football because everyone's always like the QB is the most important position in any professional sport and I'm like yeah it is so there is an \"I\" in team isn't there? Because without a QB you can't win, so yeah, I agree with the idea of a team mentality or what my eye actions are doing are benefiting. You need a lot of eyes to make a team. Yeah that's cool, can it just be deep? Can you guys just accept that I said something cool? Pretend it was cool, it was really cool. Thank God there is... let's just think, do you think certain unpleasant world leaders like say Pol Pot would turn to someone and",
            "start": 218.8
        },
        {
            "text": "accept that I said something cool, pretend it was cool, it was really cool. Thank you there is let's just think, do you think certain unpleasant world leaders like say Pol Pot, like turned to someone and said to other members of the Khmer Rouge, \"Hey, there's no 'I' in team, get in line.\" Alright, come on, we're an agrarian Marxist existence right now. There is no \"I\" in team. You're good. You get deep cuts here about economic theory. Now I like that. Yeah, I, I, I always just... I don't know. I love these like pieces of conventional wisdom like that just don't make any sense. Like why... I was thinking immediately after I said like I shouldn't ask that. I don't even know this woman, but then I was like she didn't she didn't give a **** like it was clear like she didn't care. I'm 27 to be fair when you're in your 20s you don't care. Yeah, but why would... when they hit 30 I think that's when the the stigma quote unquote starts effect. I'm going to make a point to ask every woman I ever meet how old they are",
            "start": 256.44
        },
        {
            "text": "in your 20s you don't care yeah but why would when they hit 30 I think that's when the the stigma quote unquote starts to effect me I'm going to make a point to ask every woman I ever meet how old they are immediately when I when I think then I think you can then avoid it if you don't then immediately turn around and walk away I I'm assuming that piece of wisdom was when people really picked up other people at bars is like that that was the most reliable place to meet somebody else and that is kind of like I'm doing my evaluation so I'm going to ask your age you know there are times yeah I would like to know someone's age a if I'm about to tell a story that's going to make me look really old or yeah that's pretty much it I always I always guess a good way to do it is if you want to know a person's age or you you want to you just need that for context I shoot the age that I think they are and then I decrease it by about seven years and I'm like well I remember and I'll use the following",
            "start": 296.32
        },
        {
            "text": "age or you want to you just need that for context I shoot the age that I think they are and then I decrease it by about seven years and I'm like well I remember and I'll use the following phrase well I remember when I was 21 so you probably don't understand what I'm talking about they like I'm 27 you're like oh yeah see the age thing the reason people get upset about it is like you're making assumptions anyway you make out of them yeah yeah yeah I mean people used to forget about that question yeah I guess mainly women I guess that's interesting and I I think nine times out of ten nobody had a problem with it at the paper when I because that's you know key information for your article or whatever it's always in there which is kind of weird but whatever but just dress the picture for the reader I guess but yeah like they occasionally be why do you need to know my age I'm like that's how newspapers work that's how you're going to be quoted and so the the",
            "start": 340.04
        },
        {
            "text": "the reader I guess but yeah like they occasionally be why do you need to know my age I'm like that's how newspapers work that's how you're going to be quoted and so the the I always had there would be ones where I'd write like uh you know Jane Doe and then parentheses did not give age but back out the story I I think the part in I like this topic is I think that it's not that people live by these a you know axioms and stuff like that but they're used to kind of stop a conversation especially like I and team you know I've seen that where it's like the one guy thinks that everyone else is doing something wrong it's like well hold on what's with the individualism here you know get in line and I and I do find it very frustrating because it's kind of like we've already made a social contract that we've agreed that these silly phrases actually carry the weight of truth yeah I don't I could even really think of too many other ones that I would disagree with like the only ones that come to mind",
            "start": 377.16
        },
        {
            "text": "that we've agreed that these silly phrases actually carry the weight of Truth yeah I don't I could even really think of too many other ones that I would disagree with like the only ones that come to my head are like You Don't Know What You Got Till It's Gone and which is which is a good one yeah um I know build it and they will come, The Field of Dreams one, that's just the D no build it well and maybe it'll get instagrammed build it and they will okay sure go right ahead Builder what about grass is greener on the other side yeah that that is a good one tooo that's a I actually think Grass Is Always Greener is a great one because it is true yeah I heard I used to I look at Kevin's life and I'm like no it's not greener well not that's like right in front of you those I know that's that's literally the other side I heard this is kind of a nonse for that but I used to shoot a lot of uh weddings back in the day when I was first getting my footing underneath me as a uh as the",
            "start": 419.04
        },
        {
            "text": "that's literally the other side I heard this is kind of a nonesense for that but I used to shoot a lot of uh weddings back in the day when I was first getting my footing underneath me as a uh as the premier video producer that I am today um and I heard it's a Cheesy as **** but I heard a priest say like he's like a lot of people say The Grass Is Always Green on the other side he's like no the grass is greener where you water it and that stuck with me I'm like that was really cheesy but really true did you just have like one of those moments and you just put down oh **** as they're about to kiss I'm like **** groovy man do you have any uh I can't think of anything that offhand that I would say don't I I disagree with um never judge a book by its cover I think is probably a pretty good one yeah there are good ones there are good ones uh I'm trying to think of any that I can't that sort of disagree with all of them that are coming to my mind are are just sort of the cliche phrase",
            "start": 458.32
        },
        {
            "text": "good one yeah there are good ones there are good ones uh I'm trying to think of any that I can't that sort of disagree with all of them that are coming to my mind are are just sort of the cliche \"bird in the hand is worth two in the bush\" that's a good one what are know the ones to disagree with potentially yeah I'm trying to think of bad ones or just bad conventional wisdom I'm going look I don't know maybe like you should if you have a really good paying job that's got security you should stay there forever might be one doesn't I've never heard that one that's a little long you might want to make that a little \"spp\" I believe that's \"bird in the hand\" I don't know that actually maybe that is that is a good one to look into like the burden in the hand is worth two in the bush right is is that that opportunity that's right in or I guess the the the one you have already you have already is wor taking a shot but I feel like that might be one that I I fundamentally now disagree with a little bit",
            "start": 505.04
        },
        {
            "text": "opportunity that's right in or I guess the the one you have already, you have already is worth taking a shot but I feel like that might be one that I fundamentally now disagree with a little bit because I think it's very risk-averse, it's very much saying like do the safe thing all the time which is what we always sort of have to promote so that words of angry unemployed people don't get in the way you know it is a risk thing yeah have you tried to get two birds in a bush no it sounds impossible to me not because like they they know the inside of the Bush they just don't know I'm doing this my this is where we draw the line what about no pain no gain that's one that's popping up that is unfortunately true **** that's true and that's I don't think it's true at all I do think it's true I got Kevin for that I do I do think no pain no gain is is probably true you know mostly true like when have you ever gained without really because it's not saying you're in",
            "start": 545.16
        },
        {
            "text": "all I do think it's true I got Kevin for that I do I do think no pain no gain is probably true you know mostly true like when have you ever gained without really because it's not saying you're in literal pain it just means that like you have to try okay for what it's saying guess but the phrase is used usually when you're complaining about pain but you have not been established that gain is going to be accomplished yeah it's more or less like hey go out I mean it's it's kind of like what Mr. Miyagi said in The Karate Kid he's playing a no pay no gain on him he's really just getting you know free work out of him yeah he then learns to get karate and gets the lady is yeah getting some of that labor though I don't know no pain no game more sounds like that's what you can get away with abusing interns hey no pain no gain I think Fox got in trouble for that pay no money yeah okay bye thanks so here's some credit here's some credit I go have fun good luck did you find anything else",
            "start": 585.72
        },
        {
            "text": "abusing interns hey no pain no gain I think Fox got in trouble for that pay no money yeah okay bye thanks so here's some credit here's some credit I go have fun good luck did you find anything else Greg no a lot of these people are just making **** up like I'm I'm like that's not no one's ever said that's conventional with I'm clicking on that too much next terrible one I find I'll let you know okay we're at Magpie girl.com right now to see what they have to say Magpie girl here we go eight eight **** conventional wisdoms I sound like my mother you should try to stay the size you were in high school this see this is now this is a horrible number five number five you need good grades that's not conventional wisdom you do sorry I got to go back to you need to stay the same besze you're in high school that is I've never heard that before so fat in high school it's not a real book unless it's printed by a real publisher what these AR be the conventional wisdom oh God is there another",
            "start": 629.56
        },
        {
            "text": "in high school that is I've never heard that before so fat in high school it's not a real book unless it's printed by a real publisher what these are be the conventional wisdom oh God is there another piece of conventional wisdom there that just says **** you that's all I'm really hearing what the **** CBS money watch has eight nine bits of conventional wisdom you should ignore this is going to be about money trying to find one don't just stand there do something all right and on that note I'm saying right now col you go get conventionalwisdom.com you put a list of conventional wisdom you'll be fine that's all you got to do you make a million dollars right there all right all right good enough ladies and gentlemen this topic was brought to you and sponsored for you by kindafunny.com store go there look at the t-shirts maybe buy a poster look at the new coffee mug Nick worked on all of them I did give Nick a round of applause at your computer right now I'll wait thank you you're",
            "start": 677.0
        },
        {
            "text": "store go there look at the t-shirts maybe buy a poster look at the new coffee mug Nick worked on all of them I did give Nick a round of applause at your computer right now I'll wait thank you you're too kind you're too kind and Nick ladies and gentlemen this has been the GameOverGreggy show each and every week four sometimes five best friends gather on this table each bring a topic discussion for your amusement you like that head over to patreon.com/kindafunny and toss us a few bucks to get every episode early if you have no bucks to toss no big deal go to youtube.com/kindafunny where we break it up topic by topic day by day until we post the entire thing for free on of course YouTube and of course iTunes and other podcast services but go to itunes.apple.com/us/podcast/gameovergreggy/id123456789 subscribe to everything rate everything it helps us out because you were saying last week it's been years since people subscribe to this show yeah with specifically GameOverGreggy show if you listen to it in any",
            "start": 731.0
        },
        {
            "text": "everything rates everything it helps us out because you were saying last week it's been years since people subscribe to this show yeah with specifically GameOverGreggy Show if you listen to it in any other way like YouTube or on Patreon or whatever just go over to iTunes and subscribe even if you don't listen to it there just just do it for me please oh just for Tim yeah thank you uh of course everyone needs to go watch Lumberjack Man yes our good friend Adam J. Miller like I said it's in a few big cities uh Chicago Boston if you go to Mesto if you go to eight films to die for you have a list of it's playing in in your hometown but more importantly it's available on VOD I know there is a home video released I think that may be a week or two off so go check it out you know you can hit the rent or you could hit the Buy on the VOD you could relive the magic think there's reason to relive it you watch if you live in or Washington you know what to do Adam it's a pleasure thank you so much for",
            "start": 769.04
        },
        {
            "text": "or you could hit the Buy on the VOD, you could relive the magic, think there's reason to relive it. You watch if you live in or Washington, you know what to do. Adam, it's a pleasure thank you so much for coming by, you're on the GameOverGreggy Show too, so go listen to that as well. Until next time, it's been our pleasure to serve you. I can bring it up here, I know I'm just bringing up my rundown too. Mhm mhm mhm mhm okay and you're happy with every do we need do we need to because this chair sagging is this chair sagging or no no I think it's good okay great just make sure I think looks good no I'm sagging chair fine don't don't put it on the furniture oh God here we go hold on real quick I'm not going to hold on real quick you son of a b**** I mean you're you're you're third you got plenty of time to all right I'm good you know freaking good right now for it. Kevin, put all that at the end so everybody knows that Nick held up the show and they wonder why this episode starts off so sour",
            "start": 806.64
        },
        {
            "text": "To all right, I'm good, you know, freaking good right now. For it, Kevin, put all that at the end, so everybody knows that Nick held up the show, and they wonder why this episode starts off on a sour note. Thank you, Kevin.",
            "start": 858.32
        }
    ]
}