{
    "id": 1299,
    "video_id": "pXk_0OlIfCE",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "The Last of Us vs. Red Dead Redemption - PS I Love You XOXO Ep. 05",
    "description": "A best friend wants to know which classic is the best, so Greg and Colin give him an answer -- along with all of this week's PlayStation news and rumors. (Released 10.27.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://www.youtube.com/watch?v=a5MzJjBjTQ8\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/kindafunnyvids\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1445961602,
    "duration": 6321,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to PS I Love You XOXO episode 5 I'm one of your hosts Greg Miller alongside Colin Moriarty it's good to be here with you today that microphone's nuts and bolts aren't to your specifications no it's not I'll tell you what I uh last night I was watching Soul Man in a 30 for 30 about uh I'm obsessed with looking at the stop looking at the monitor just shut it off I don't need to see it I do though we need to see it cuz you look back there what if it dies you know how it's distracting always moving stuff and I'm obsessed with looking at the clock no we're never switching seats uh so I uh I was watching Soul Man right um and uh it's a 30 for 30 about the rise of the basketball shoe industry it's really fascinating it's on Netflix people can watch it and I went and and and brought my leg up to to scratch it and pulled my leg last night during Soul Mate yeah when I was in bed sure and then this morning I um I dropped the soap uh and I went and crouched",
            "start": 0.5
        },
        {
            "text": "I went and brought my leg up to scratch it and pulled my muscle last night during sleep, yeah. When I was in bed, sure. And then this morning I um dropped the soap uh and I went and crouched to pick it up and I threw out something in my back that kind of hurts right now so I'm you know I'm a little whacked out usually your early 30s these are things yeah it's it's a thing and uh but otherwise I'm fine I'm in great shape and everything's good okay good yeah ready to go except for all the muscles that falling apart as you go mhm they're really hurting my leg thing really hard I thought I like tore my ACL. The worst is when you don't drink enough water and then you get that cramp in your leg, you know one of those charlie horses in your life. I don't drink very much water, I I don't know if you I don't know if I don't know where it all goes cuz I get dehydrated like nobody's business still on the airplanes I'll come off with headaches I got to",
            "start": 62.68
        },
        {
            "text": "enough water I I don't know if you I don't know if I don't know where it all goes cuz I get dehydrated like nobody's business still on the airplanes I'll come off with headaches I got to I got to make a point to drink a lot of water those times I think it might be that I just carry a lot of water around with me who knows how much I drink it's similar to you with the bottles where the bottles are all over the house half drank yeah 34s still there it's all over I feel up the water bottle like 10 times too he always say that and then I come in and clean up in here and there's two Botts in here well me I'm not saying I'm telling you have a bottle out there so I just don't do you understand that you're not refilling them I am refill I'm actually refilling them they're all well how what about when I'm throwing them away then well then they're throwing away it doesn't mean that they weren't refilled before you threw them away I mean you're I'm saying why would there be two or three open if",
            "start": 100.52
        },
        {
            "text": "when I'm throwing them away then well then they're throwing away it doesn't mean that they weren't refilled before you threw them away I mean you're I'm saying why would there be two or three open if they if they refilling them every time I don't know seems like you just you just keep this guy with you you're assuming that I don't have multiple bottles that are all being refilled I know I know that there's always multiple bottles in the house is what I'm saying so if I'm throwing some of these away for sure how many open do you buy a 20 pack and then just open them all and then just over time no I don't do that very interesting you yeah I mean it's well it's not that interesting but it's something well yeah if you know ladies and gentlemen this is PS I Love You XOXO uh Kinda Funny.com PlayStation podcast the number one PlayStation podcast on the internet according to iTunes except for that well not except for that that we'd be the number one video game podcast if it was wasn't for",
            "start": 131.52
        },
        {
            "text": "PlayStation podcast the number one PlayStation podcast on the internet according to iTunes except for that well not except for that that we'd be the number one video game podcast if it wasn't for Hunt: Showdown and then we'd be the number one games and hobby podcast if it wasn't for Car Talk reruns well car I told you guys got to go watch Car Talk everyone win and watched and listen to We we've taken the mantle as the number one PlayStation podcast very proud of it worked very hard based on iTunes um well it's more most I mean iTunes a pretty good barometer you'd imagine yeah I don't know I think a lot of people get that's how I that's how I did I said when Beyond became the new number one PlayStation podcast I based it on iTunes I mean your assumption being that there's like you know if you got it from another source whatever but you can also get PS I Love You XOXO from another source and and it's doing really well on YouTube so I'm confident in saying that PS I love you XOXO is the new number one PlayStation podcast",
            "start": 169.52
        },
        {
            "text": "you got it from another source whatever but you can also get PS I Love You from another source and and it's doing really well on YouTube so I'm confident in saying that PS I Love You XOXO is the new number one PlayStation podcast in the world yeah and I'm extremely proud of that me too and we did a really nice job it's time to wrap it up put a bow on it it's know when you know when it's time to go and it's time to go like Seinfeld you go out when you're on top on top right yeah we can't risk ever being in second place so I'm I'm happy to admit and also sad to say that this is the last episode of PS I Love You XOXO can we start to take on Car Talk runs talking cars ah nice and then I'm going to have to kill you so that one of us is dead and then we're going to have to go into reruns but first we're going to have to record like 35 years worth of content those guys you want talk about content creators that's them yeah since the 70s if you like the show PS I Love You XOXO make sure you subscribe to us on",
            "start": 208.96
        },
        {
            "text": "have to record like 35 years worth of content those guys you want talk about content creators that's them yeah since the 70s if you like the show PS I Love You XOXO make sure you subscribe to us on youtube.com kindafunnygames or go over to iTunes subscribe to us there drop us a review on either place thumbs up whatever you want to do share it with your friends of course that's a huge deal but remember that kinda funny dot com Keeps the Lights On so go to kinda funny dot com watch all the videos go to our twitch page subscribe like do that go to patreon dot com kindafunnygames do all that different stuff I put every every every time we do one of these shows which is the fifth time already I put them on here I gotta tell you of course go we got the shirts for kinda funny or we got the shirts for kinda funny we got the shirts for PS I Love You XOXO go over kinda funny dot com store uh this week if you're listening to this which you should be in the weekly fashion we're about to do our",
            "start": 249.68
        },
        {
            "text": "for Kinda Funny we got the shirts for PS I Love You XOXO go over to KindaFunny.com/store uh this week if you're listening to this which you should be in the weekly fashion we're about to do our Q&A for the folks over on Patreon.com ofun games Wednesday at 5:00 p.m. Pacific time if you go over there you support us at the $15 level or higher you get a private Q&A with us that's happening right now and don't forget that Extra Life is coming up super soon November 7th and it's creeping KindaFunny.com/ExtraLife you can go donate to the team join the team but basically all you need to know is that on November 7th we'll be playing games for 24 hours for charity it's creeping up it's creeping up just like you're creeping up in my room at night watching me sleep someone's got to make sure you don't choke on your own tongue yeah now here I'm glad you're there for me here's the thing Colin let's get through this at the top of the show you're at home right now you're maybe you're in your car",
            "start": 286.8
        },
        {
            "text": "\"Choke on your own tongue, yeah. Now here I'm glad you're there for me. Here's the thing, Colin. Let's get through this at the top of the show. You're at home right now, you're maybe in your car on your way to work, enjoying this new episode of PS I Love You XOXO. You're having a great time and you're like, 'Oh, also it's Paris Games Week day.' It's Tuesday. This show comes out at 9:00 am. We know that Paris Games Weeks are doing the press conference. I can't wait to hear what they're going to say. We don't know what we're going to say about Paris Games Weekend. We of course record this in advance, so you get it hot and fresh on Tuesdays. Now normally you'd say, 'Shucks, they're stupid.' They're not, they're not going to talk about it this week; it'll be old by the time they get to it next. We are stupid, okay? That's fine. They're stupid for that decision right. We're stupid for a million other decisions. What what we're excited to tell you is that PS\"",
            "start": 324.88
        },
        {
            "text": "be old by the time they get to it next We Are Stupid okay that's fine they're stupid for that decision right we're stupid for a million other decisions what what we're excited to tell you is that PS I Love You XOXO episode 6 will be out in mere hours three to four to five hours when you're listening if you're listening to this right when it's hot off the press I'm sure they are people probably forgot about the Paris Games Week conference and we're listening to it rather than watching now I want to say that even though you persuaded me to do it this way that my initial idea when I emailed around and was talking to Tim Gettys was that I wanted to do this show on Monday as we're doing it right now put it up on Tuesday episode 5 and then say nothing about Paris Games Week yeah and just make it seem like we're going to go a whole week without a Paris Games Week podcast and then just magically another episode appeared later that day I liked that idea a lot but you wanted to communicate more",
            "start": 363.72
        },
        {
            "text": "it seems like we're gonna go a whole week without a Paris Games Week podcast, and then just magically another episode appears later that day. I liked that idea a lot, but you wanted to communicate more directly. I kind of want to be a little bit sure, mean almost mean about it, but not mean, but like in a way where it's like \"I knew people would be complaining that I wanted to ignore everything until the new podcast went up and be like 'we had a plan all along,' you should have been more patient.\" The problem is though that people think about it like in terms of sex - your girlfriend's going out of town, what sex exactly are you talking about? You know, you don't get to but then she's gone, you're like \"well I'm just gonna knock boots with somebody else and no big deal,\" and then she comes back and it turns out that you could have just waited and knocked boots with her, but you knocked boots with",
            "start": 402.48
        },
        {
            "text": "like well I'm just going to knock boots to somebody else and no big deal and then she comes back and it turns out that you could have just waited and knocked boots with her but you knocked boots with somebody else when you didn't need to knock any boots so she's not okay with that probably not I want one of those things we've just gotten to being the number one PlayStation podcast, the number two video game podcast, and the number three Car Talk podcast. I don't feel like giving that up; I don't want anyone to get a reason to go out and explore so they get two giant episodes today - don't explore, don't explore everything's been found exactly you're just here, you're happy, just settle into monogamy with us, monogamy with Colin and Greg, that's the Car Talk show we're going to play, don't know what sex is but we're going to figure that out and I think the as I said the third option was masturbation right you get your giant episode here with all the normal stuff",
            "start": 440.0
        },
        {
            "text": "don't know what sex is but we're going to we're going to figure that out and I i' think the as I said the third option was masturbation right you get your Giant Bomb episode here with all the normal stuff I understand and then we come back later today double dip you get your Paris Games Week reactions and things like that sure we won't have time for your questions in that one so that'll be here's what the news was maybe I'll be able to open up Twitter on that time maybe if you're lucky maybe we'll see MH Colin yes let's begin the show with what is and forever will be Roper's report time for singular possessive news now there are 15 items on the list uh Baker's Dozen and I didn't even put them in any order so no particular order to go let's see how I want to do this I I want to see if I want to I want I kind of want to do it in a specific way but you know what a few weeks ago we did it in whatever order we wanted to do it we'll do it again that way this is the order in which I wrote them",
            "start": 477.64
        },
        {
            "text": "to I want to do it in a specific way, but you know what? A few weeks ago, we did it in whatever order we wanted. We'll do it again that way. This is the order in which I wrote them, yeah. Number one, German developer Jörg (corrected from \"joerger\") has broken The Silence about losing a major project when publisher Deep Silver took them off of Dead Island 2, a project that was well into development. In a conversation with GamesIndustry International, Jager's managing director Teo Olsson said, \"Having a project canceled in such a late state is a catastrophic event on so many different levels; it really is the worst possible outcome for everybody involved.\" Gamespot points out that Jger Productions, a so-called single-purpose piece of Jager created for the development of Dead Island 2, was shut down entirely once the game was pulled. Olsson said, \"I really don't blame them, and we wish them all the best. I think he's talking about Deep Silver here; yeah, it's tough.\"",
            "start": 522.84
        },
        {
            "text": "down entirely once the game was pulled Deep Silver said \"I really don't blame them\" and we wish them all the best. I think he's talking about Deep Silver here, yeah it's tough and not being given the chance to finish Dead Island - that hurts you know. Right after the announcement a part of the team was a bit Shell Shocked, of course but you have to motivate yourself to keep going. Cancellation of projects especially if the stakes are so high is not unheard of, it hurt us yes but it happens, that's it. Nothing else to really be said about that other than I wanted to share that information. It's interesting that they talked about it. I was going to say I could go for more though - why do they think it got canceled? What were their reasons? Were there miscommunications with the company? Assuming he's talking about Deep Silver and I don't have the context to be positive, that is. He says \"I really don't blame them\" so you can only be talking",
            "start": 566.68
        },
        {
            "text": "there was miscommunication with the company assuming that he's talking about Deep Silver and I don't have the context to be positive that is he says I really don't blame them so you can only be talking about Deep Silver yeah or Jagex studio but let's assume he's talking about Deep Silver I don't know I really don't blame them and we wish them all the best so so you know that your game didn't look that good you understand the reasons you know the deadlines you miss speak to me Jagex assuming that that's he's talking about Deep Silver he's talking about IOI then he says I can't blame the greater company for laying off an entire team that has no more game to work on but you know I don't know just wanted to share that number two I'm glad you shared it oh thank you number two Ubisoft may be the target of a hostile takeover at the hands of Vivendi have you seen anything about this I have you well I've been listening to you what's Vivendi which until recently owned a piece of",
            "start": 600.28
        },
        {
            "text": "Ubisoft may be the target of a hostile takeover at the hands of Vivendi. Have you seen anything about this? I have you well, I've been listening to you what Vivendi, which until recently owned a piece of Activision Blizzard, has purchased 6.6% of Ubisoft stock worth 140 million euros and Ubisoft isn't pleased about it. And an internal email leaked to GamesIndustry International CEO Yves Guillemot stated that \"Vivendi and its chairman... had a reputation for aggressively pursuing companies within the entertainment sector.\" Our intention, this is an ellipsis after that, so I'm being clear, this is an ellipsis. Our intention is and has always been to remain independent, a value which for 30 years has allowed us to innovate, take risks, create beloved franchises for players around the world, and which has helped the company grow into the leader it is today. Ellipsis. We're going to fight to preserve our independence. We should not let them",
            "start": 641.08
        },
        {
            "text": "beloved franchise for players around the world and which has helped the company grow into the leader it is today... We're going to fight to preserve our independence. We should not let the situation or any future actions by Vendi or others distract us from our goals. Our best defense is to stay focused on what we have always done best: deliver the most original and memorable gaming experiences. End quote. Vendi, after the initial purchase of 6.6% of Ubisoft stock, gobbled up more stock and today owns 10.39% of Ubisoft in a comment relayed by Reuters, which just came out a few hours ago from the time we're recording this, Vendi noted that \"these acquisitions were not specifically designed as a preparatory step for the plan to take over Ubisoft or Game Loft.\" Because they're also buying shares of GameLoft. Nevertheless, over the six coming months, Vendi cannot rule out the possibility... we don't considering such a thing. That's why we weren't doing it, but now that we have so much maybe it's",
            "start": 679.2
        },
        {
            "text": "shares of Game of Thrones but nevertheless over the Six months Vendi cannot rule out the possibility we don't considering such a that's why we weren't doing it but now that we have so much maybe it's interesting because as far as I know well Vendi owned a piece of Activision Blizzard and Bobby Kotick I think and those guys deployed some sort of initiative to buy their stock back from them so Vendi is out of the gaming space now Vendi wants back in the gaming space and they're going after a company that I think probably even has a brighter future than Activision and that's Ubisoft yeah um and by a brighter future I mean that I think Ubisoft is in a better position to have more properties that are going to do better in the next five to 10 years than Activision which I think has a Call of Duty which is plateauing and I'm really interested to see if it's going to stall out and start going down and then they have Skylanders which has a lot of competition they have Destiny which is you know",
            "start": 715.2
        },
        {
            "text": "which is plateauing and I'm really interested to see if it's going to stall out and start going down and then they have Skylanders which has a lot of competition they have Destiny which is you know huge but they also released uh they're releasing these kind of Subar platinum games they released Tony Hawk so it's not all Rosy for them plus they're not gonna be able to make their Marvel games anymore and all that kind of stuff their Spider-Man games um hostile takeovers are a fact a fact that business and I and and they're fascinating to me EES Gilmont has every reason to be scared since if they are able to take over uh the and and have controlling stake of the board then he might be out so I I so he might be speaking from a a place of um uh personal kind of protecting himself and and sure he wants to protect compan his people and like the network or the you know leadership team they've built but that's that's an assumption they only have 10% of the stock right now which is a lot",
            "start": 751.28
        },
        {
            "text": "he wants to protect his people and the leadership team they've built but that's an assumption they only have 10% of the stock right now which is a lot of stock I mean that's that gives them power yeah um whether I'm interested in more where are they getting this stock from who are they poaching and picking off because to get you're not going to go on the market and buy 10% of a company you need to be able to identify people that own big shares of the company and start picking them off and that seems to be lost I've not read deeply about it but I'm interested in like who is collaborating with them in order to get more and more shares and if will go up and up because it seemed like they were unswayed after you Gil Mont released a statement and then went on and bought 3.8% more stock and now own a tenth of the company so um scary this is what happens when you're public",
            "start": 791.4
        },
        {
            "text": "as of the time Sony Gilchrist released a statement and then went on and bought 4% more of the stock, 3.8% more stock, and now own a tenth of the company, so um scary this is what happens when you're public if you go watch the movie Batman Begins there's a there's a subplot of this where this happens it teaches you a lot I assume that's what they watched over at Vendi before they went out and started doing this indeed you didn't get the memo I'm I'm F that's one of the most fascinating stories I've heard in a long time I'm interested to see where that goes yeah Vendi's like really trying to muscle their way in number three PlayStation 4 has already gotten a price drop in Japan and the US now it's also received a price drop in the UK and Australia sorry Canada Gamespot well Canada Oh Canada did get their price drop even though I think the price went up exactly but that's inflation inflation Gamespot reports that the PS4 will now cost Australian dollars $47.95, Australian dollars down",
            "start": 827.76
        },
        {
            "text": "did get their price shop even though I think the price went up exactly but that's inflation Gamespot reports that the PS4 will now cost Australian dollars $47.95, Australian dollars down from $549.95, a savings of $70. Eurogamer meanwhile Eurogamer has confirmed that the PS4 in the UK will now cost £299 so go get them you know make sure you're checking the prices double check this is what I've been reading I don't know if this is true at every retail or also for other territories that do not speak English uh you know Western Europe and South America I don't know what's going on with your consoles sorry number four Square Enix has every intention of going back to its 12 IP to revitalize and make new again old and forgotten franchises Square Enix's annual report as noted by Polygon outlines a so-called \"Way Forward\" to \"Revitalize existing IP\". Square Enix intends on taking \"IP developed for",
            "start": 866.96
        },
        {
            "text": "Square Enix's annual report, as noted by Polygon, outlines a so-called \"Way Forward\" to \"Revitalize existing IP.\" Square Enix intends on taking IP developed for earlier generations of games and recreating it for the latest consoles. An emphasis has been placed on Smart devices, though consoles are also mentioned. Square Enix wants to do this in order to \"relish reliving past experiences with a freshness that only the latest in technology can provide.\" This is all again comes from Polygon. Polygon does note that this has already been happening with Final Fantasy VII now being remade for PS4 and PC, and also Dragon Quest games and Final Fantasy games being put on Android and iOS to mixed reviews, some weird art, some weird translation issues. Um, not a huge surprise; I'm just kind of \"cuck back\" the well... I like the bouncers now; I'm curious what I'm curious what uh well because a lot of people **** on the Bouncer, I think the Bouncer is",
            "start": 915.84
        },
        {
            "text": "issues um not a huge surprise I'm just kind of cool back the well I like the bouncers now I'm curious what I'm curious what uh well because lot of people **** on the Bouncer I think the Bouncer is fine especially early in that PS2 era that's the thing with that those kind of lenses on it I remember playing it and being like all right this isn't for me but I understand it I would have taken anything at that point exactly we were all **** desperate as hell um also shout out today is our recording 15th anniversary of the PlayStation we're going to get there we're going to get there so why don't you just relax and I just wanted to give a shout out just relax cuz you just ruined now there's only 14 items on the most well I think it's still news you got to talk about got a quote did you get a quote from you call did you call up Jack Tretton get a quote Jackie no I didn't call him should have he loved me Jack Tretton but best interviewer he ever had he said yeah that's what he told me",
            "start": 958.44
        },
        {
            "text": "a quote from you call did you call up Jack Train? Get a quote, Jackie. No, I didn't call him. Should have he loved me, Jack Trenton, but best interviewer he ever had. He said yeah, that's what he told me. Of course, you had to steal my thunder with that just like you had to steal my thunder with the Hulk Hogan video that I did, which is awesome until you had to do a better Hulk Hogan video. I well, I mean that's just how it goes. You build a better mouse trap. What do you want me to? You want me to go out there and **** the bed with the whole Hogan thing now? What about this, it just turns out is a racist so we don't have to worry about them both those interviews can I heard IG deleted both of them did they no God no maybe Hulk a little bit of trouble. Hulk Hogan you imagine PE runs into the office one day he's like all right guys this Hulk Hogan situation delete all call content guess that's what they do with the WWE though isn't it uh number five if you're looking forward to playing Tony",
            "start": 992.6
        },
        {
            "text": "one day he's like all right guys this Hulk Hogan situation delete all call Cen content guess that's what they do with the WWE though isn't it uh number five if you're looking forward to playing Tony Hawk's Pro Skater 5 on PlayStation 3 for some reason you may be waiting a while it appears the last gen version of the game released on current gen platforms like PS4 is delayed Activision released a statement to Eurogamer that stated the following quote we are working closely with our developers to address the issues identified by our community our development resources are fully focused on fixes and content updates for PS4 and Xbox One so we've decided to delay the release of Tony Hawk's Pro Skater 5 on PS3 and Xbox 360 we will update the community when we have more specific information about a release date for PS3 and Xbox 360 end quote and then I just put here it says the game's got to be canceled at this point it's never coming it's over give it up why bother yeah yeah like uh just",
            "start": 1032.0
        },
        {
            "text": "a release date for PS3 and Xbox 360 end quote and then I just put here it says the game's got to be canceled at this point it's never coming it's over give it up why bother yeah yeah like uh just give it up game's a complete mess this is an interesting one I'm curious what you think of this one all right number six the Uncharted DLC and VR rumors simply will not end jeez though the next rumor is a little more compelling than most a report on Destructoid claims that not only is Uncharted getting DLC but it's already in market testing it's purposely it's I'm sorry it's purportedly called \"Russian\" blood and maybe a first-person on rail shooter that will work with PlayStation VR the description of the according to Destructoid source is as follows quote well you get transported around inside a minecart it's very literally an on-rail experience there are a few scattered jump scares as you'd expect but I played the same 20-minute section twice once with dual shock 4 Once with DualShock Move",
            "start": 1070.12
        },
        {
            "text": "a minecart it's very literally on-rail experience there are a few scattered jump scares as you'd expect but I played the same 20-minute section twice once with DualShock 4 Once with DualShock Move controllers okay so I'm hoping that full DLC is a lot more padded out I didn't see which character I was playing as I'm not sure if it specified but no names were mentioned at all it starts off shooting targets in the snow then moves towards a house and as you get deeper into the house enemies start appearing I believe they were wend dingos which were the enemies in Until Dawn spoilers the frequently reused jump scare is the ghost from inside the house and Until Dawn who you end up fighting for the final area I played upon killing the ghost the game would crash every time",
            "start": 1112.8
        },
        {
            "text": "piece of information is saying is because something PlayStation lifestyle pointed out from an interview they conducted with developer Supermassive Games executive producer Pete Smith he said in their interview, in part quote, \"PlayStation VR cropped up in conversations a few times during development. But no, we don't expect that there'll be an addition of Until Dawn story to be playable in VR anytime soon, not unless somebody has a sudden rush of blood.\" end quote. And I looked at that when I read that quote a few weeks ago, I was like, \"Yeah, yeah, yeah, we talked about that, yeah.\" And uh, the DLC is reportedly called Rush of Blood. Mhmh, very interesting. How's that? How's that strike you? I think it's real but do you want it to be real? No thank you. Definitely not. Let me go right to the questions, of course. If you want to be part of the show, ladies and gentlemen, KindaFunny.com/psq, of course, PS I Love You XOXO, but psq Q for questions that's where Matt Harget went and said \"Pepper\" to Cross",
            "start": 1147.84
        },
        {
            "text": "of course if you want to be part of the show ladies and gentlemen kindafunny.com psq of course PS I Love You XOXO but psq Q for questions that's where Matt Hargreaves went and said \"pepper\" to cross the interviews with Sony and Studios have been specific mentions or Illusions to move Wonderbook in plain PSN titles being used as internal demonstrations for PlayStation VR then he goes through a whole bunch of ones that he's seen Walking Dead Africa ModNation Racers J what games would you like to see brought to PlayStation VR now this goes back to what I'm always saying here none no this is terrible don't do this you already like hey what was a great what was that great game we loved Until Dawn right put everybody in a mine cart and have them shoot as a ghost as they go reminds you of like Dead Space Extraction or something like that or the Resident Evil games on Wii I like that's going to be the biggest thing they got to overcome with PlayStation VR and they need to look at",
            "start": 1192.04
        },
        {
            "text": "of like Dead Space extraction or something like that or the Resident Evil games on Wii, I like that's going to be the biggest thing they have to overcome with PlayStation VR and they need to look at PlayStation Move for you know, like PlayStation Move in BioShock - an inspiration for inspiration. Let's not do that; let's not take games people already love or know and understand how to play and put them in there now. What's interesting is of course there's been the volume stuff, the volume PlayStation VR business is that on there too? It is just in the last piece but you can talk about it more - that's G to happen now. There's going to be a volume VR deal exactly; we don't know anything really about it in terms of it, but it's like okay that's still a new enough property and different, and like you could kind of see being in first person being that guy right where you like see the guy get down, crouch around the walls or whatever. I give a pass to that; that's its own thing - okay, whatever but I",
            "start": 1236.84
        },
        {
            "text": "you could kind of see being in first person being that guy right where you like see the guy get down crouch around the walls or whatever that i give a pass to that's its own thing okay whatever but i do like you know the games that were being listed here by Matt you know like Datura Africa ModNation Racers iPad man he's a big PlayStation I mean i'm not making fun of him either he's a big PlayStation fan CU he's pulling out some obscure PS exclusives and I haven't heard what he's talking about here is like he's referencing that these random PlayStation titles have been used as uh I did play Datura in VR I haven't played I I've only been playing the new experiences they put on your face the Oculus was it I'm I'm I may misremembering this and what I might have played was a very early form of Morpheus but I don't think it was yeah they had no all right I think I remember what it was we went to an event it was in 2011 maybe 2012 at the latest you and I were playing we",
            "start": 1271.72
        },
        {
            "text": "early form of Morpheus but I don't think it was yeah they had no all right I think I remember what it was we went to an event it was in 2011 maybe 2012 at the latest you and I were playing we went we split up and I went and played Datura which was a game from Plastic, a Polish demo scene Studio, they don't really make games they make like they made um uh Linger and Shadows which was like a PS3 kind of experience and they made that Datura which was something I was really excited about the Datura should have been awesome it wasn't but it should have been awesome and um one of the producers from Sony, the Santa Monica Studio producers that were working at the Datura had this setup where it wasn't VR but it was it was it was this piece it was this module that where they taped it was I think literally duct taped two PS Move controllers to my head like on this like on this uh this almost like glasses or something like that and it would allow you to like it would like head track and stuff like that",
            "start": 1311.8
        },
        {
            "text": "literally duct taped two PS Move controllers to my head, like on this, like on this uh this almost like glasses or something, like that and it would allow you to, it would like head track and stuff like that, and so it seemed like they were working on a device, in a sense, as a very early thing to work with InFamous: Darksider. The Infamous: Darksiders DLC is probably what he's talking about, and it already addresses one of the major problems that I talked about last week, which was the perspective - Until Dawn is in third person, so you always know you're playing as that character. Yeah, he says he played twice, 20-minute segments, twice, the same one, and he's in first person, so they already have to shove the camera in because uh you can't like I don't understand how V is going to work in third person which takes away from the immersion.",
            "start": 1354.64
        },
        {
            "text": "and he's in first person so they already have to shove the camera in because uh you can't like I don't understand how V is going to work in third person which takes away volume must be for instance volume is a third person top down kind of game yeah they must have swung the camera down and out to put you into perspective of him which might be possible in that engine yeah um this seems like yeah a weird kind of thing if I was an Until Dawn fan that was not up on my Until Dawn and I saw this DLC pop in the store and I bought this and I needed to shoot things in it I'd be really pissed off yeah I don't know if it's gonna be good or bad I don't know I just I think that to his point to this point to the point I was making last week there's a lot of technical ramifications for taking a third person game and shoving it in the first person to to work in VR well VR cannot work in third person like I don't understand what the point of being in VR is if you're if you're playing as in third",
            "start": 1389.44
        },
        {
            "text": "person game and shoving it in the first person to work in VR well VR cannot work in third person like I don't understand what the point of being in VR is if you're if you're playing as in third person yeah so to their point InTIL Dawn was made on the Killzone Shadowfall engine, Gorilla's proprietary engine that was what I was told Dawn was built on and that game was that's that the interesting thing about that engine was that engine was built for first-person shooting so they might have just reverted back to the core of what that engine can do which would be promising but if we're going to play an InTIL Dawn shooter in VR I'd rather just play it I don't the the on-rails thing is actually the thing that makes me the most most yeah apprehensive about yeah I don't want I don't want all these carnival games you know what I mean I don't want just shooting galleries right you mean Carnival Games a PS3 game or you mean Carnival Games I mean real literal carnie cuz there was a you know we're",
            "start": 1434.16
        },
        {
            "text": "carnival games, you know what I mean, I don't want just shooting galleries right? You mean carnival games a PS3 game or you mean Carnival Games? I mean real literal Carneval cuz there was a you know we're the only ones that know that game exists. We tried for the trophies, mhm, we sure did. Number seven Sony has released an at least partial list of developers and games that will appear at PlayStation Experience in December. Gotcha! A list of confirmed developers and publishers include Square Enix, EA, Devolver Digital, CCP, Idea Factory, Maximum Games, Double Fine, 2K, Ubisoft, Capcom, Activision, Armature, 505 Games, Tri-Arch, WB Games, Bandai Namco, War Gaming, and Disney. First-party studios confirmed for some sort of appearance include Sony San Diego, Naughty Dog, Media Molecule, Sony Santa Monica Studio Japan, and XDEV which is part of Santa Monica. Uh I won't go into",
            "start": 1471.12
        },
        {
            "text": "Studios confirmed for some sort of appearance include Sony San Diego, Naughty Dog, Media Molecule, Sony Santa Monica Studio Japan, and XDEV which is part of Santa Monica. Uh, I won't go into the games because a lot of them are indie games you've never heard of, but a full list can be found at PlayStation blog if you want to go over there. Where you at Bend? Um, saying Bend is going to be there is too obvious they'll be there, although I'm still holding on hope that they're going to be at Paris Games Week, but I don't think so. I thought it would be most interesting for us to go through the first parties to see what they will have there because I don't think it's actually going to be above and beyond what you think it would be. Sony San Diego is gonna have Kill Strain and Drawn, Naughty Dog will have Uncharted, Media Molecule will have Dreams. Sony Santa Monica... now what they they XDEV and Sony Santa Monica are put up separately this was the major what I looked at as a canary in the",
            "start": 1513.76
        },
        {
            "text": "na dog will have Uncharted media Molecule will have Dreams Sony Santa Monica now what they they EX and Sony Santa Monica are put up separately this was the major what I looked at as a canary in the coal mine yeah because XDEV and Santa Monica are usually talked about as one even though there's XDEV presence in Japan and XDEV presence in UK the XDEV output at Santa Monica has been the most prolific by far um that indicates to me that we might see Santa Monica's game that'd be awesome um although although I don't know I don't know it might not be time considering the cancellation they they had to start again so who knows and Studio Japan uh you have to assume will be there with something like Gravity Rush mhm um or Knack 2 which I know you've been dying for I'm telling you right now Knack 2 is a **** thing and it's coming out I'm telling you it is and you know it and I know it and everyone knows it all right it's not time for Knack 2 yet it's never time for Knack 2 but it's going to be",
            "start": 1549.56
        },
        {
            "text": "a **** thing and it's coming out I'm telling you it is and you know it and I know it and everyone knows it all right it's not time for Knack 2 yet it's never time for Knack 2 but it's going to be time for Knack 2 when it is not in fact time for Knack 2 you understand what I'm saying yeah I do I don't think PSX this year Knack 2 they have that Knack engine man and got to get it going I play Knack I play I played Knack for a few hours and it froze literally 10 times I think I was like **** this game but I was playing it for trophies like a **** yeah ah I also realized that I never got my Killzone Shadow Fall trophies and I might want to go back and play it again oh were you playing ID@book yeah it's a good game very good game yeah number eight you didn't Platinum it though right you want to just play through one more time yeah just the campaign I like the campaign it was fun Shadow Falls a fun game number eight this is an interesting one too okay good I'm glad there's two",
            "start": 1598.68
        },
        {
            "text": "want to just play through one more time, yeah, just the campaign. I like the campaign; it was fun. Shadow of the Colossus is a fun game, number eight. This is an interesting one too. Okay, good. I'm glad there's two I don't know about this one yet. Okay, good. Sony has been distributing a survey around to some of its players as reported by NeoGAF user saint of killers. This invite-only survey shared by the user asks players and features uh ask players what features are most important to them should they be added? Players can choose as many as they want or no choices, and there are 13 choices in total. The choices are notifications when friends come online, PS1 Classics, PS2 Classics, folders appear offline mode, hide or remove items from library like demos, yeah delete items from your library which is dangerous, yeah, why would you want to do that? That's silly filtering options in games Library which is really needs to happen especially on Vita it's like a **** mess download avatars on excuse me download.",
            "start": 1641.4
        },
        {
            "text": "yeah why would you want to do that that's silly filtering options in the Games Library which really needs to happen especially on Vita, it's like a mess download avatars on excuse me download avatars on PS4 custom backgrounds store wish list increase maximum number of people in a party and of course no changing PSN IDs it's worth noting as I wrote here to myself it's worth noting that the store wish list has already been implemented so I wonder I wonder when this even happened I I believe that Killzone Shadow Fall on Neo got this today but I don't or recently in the last few days but I don't you don't know when marketing kicked it out yeah because that happened already yeah and again Tiex our friend Tiex who may or may not have inside information I don't know claims that the PSN ID change is happening at PSX so um there's more to this though there's another window it says it also asks Gamers and this is interesting to identify a window of time when NA thinks system software 4.0",
            "start": 1686.32
        },
        {
            "text": "change is happening at PSX, so um there's more to this though there's another window it says it also asks Gamers and this is interesting to identify a window of time when na think system software 4.0 which will be the next update big update will be available and the windows are from the end of this year all the way to 2017 that's just I think like hey user where do you what you think when do you think the next big update would come I think that's just they're they're interested in they're not looking for like advice they're just like oh no I don't think they're looking for advice either but it's just a bad question to ask because it doesn't really matter what we think you know it'll happen when it happens yeah um and as we've seen with the PSN IDs it really doesn't matter how much we **** about something they're not going to do it they better **** I'm telling you I'm going to have a **** meltdown at at at PSX will you stand up and yell Che if they announce it I'll Stand Up and",
            "start": 1731.8
        },
        {
            "text": "about something they're not going to do it they better **** I'm telling you I'm going to have a **** meltdown at at at PSX will you stand up and yell Che if they announce it I'll Stand Up and yell you know you'll cheer yeah it's about it's about time yeah yeah I hear you you think they'll reference you I feel bad for the bad PSN name people that send us their **** man you want this one right now no I save it I don't want to get into it right now I like it when the show's you know variety all right well let's do it let's do it right now ladies and gentlemen there's a segment here on PS I love you XOXO called psn's worst name of the week this is where you go to uh kind of funny.com forums you go into the PS I Love You forums and you leave a bad name you've seen just like bald wombat did my dude my my dude bald wombat he says so I'm playing Destiny I pop into the tower to decode some engrams and standing in front of me at the cryptar is Vag Violator 69 please shui let us change our",
            "start": 1770.0
        },
        {
            "text": "my dude my my dude bald wombat he says so I'm playing Destiny I pop into the tower to decode some engrams and standing in front of me at the cryptar is Vag Violator 69 please shui let us change our names Vag Viol 69 I'd be interested to see you know what you know look up his trophies yeah because I just want to see how long you can possibly get away with that name like I away forever no one's checking that Vag Violator none of those things are bad on their own it's just when they're put together like the Joker it's just Vag Violator 69 yeah badge violator 69 has been updated and is in the queue here we go all right so I have a lifetime PSN profiles the thing here there we go Vag Violator yes Vag Violator 69 has had this since at least it seems like he has has had this since PS4 launched okay because his first game was DCU which he has no trophies in oh you son of a **** Vag Violator I thought we pinball 2 has no trophies but they're both on PS4 and Battlefield 4 is the first one he",
            "start": 1813.32
        },
        {
            "text": "because his first game was DC Universe which he has no trophies in oh you son of a b****, I thought we were talking about Pinball 2, but they're both on PS4 and Battlefield 4 is the first one he pinged a trophy on and that's from January 30th, 2014 what level is he in? He's level five, he has 139 bronze, 24 silver, no gold, no Platinum so he doesn't care about trophies you're gross and it doesn't seem like he really plays anything very deeply what's his Destiny how are his Destiny trophies like? He has 50% of the Destiny trophies okay so it seems like a game that's that's his game he's also played Persona 4 Golden, he has a Vita, he played Metal Gear Solid 3 on Vita, Tales of Hearts R is on Vita, Kindom Hearts: Unchained X is not mentioned in this chunk but I assume you meant Kingdom Hearts: Unchained X was not mentioned so I left it as \"Kind of V Violet\" he seems like he likes Rogue Legacy it doesn't seem like he gets into games too deeply though because he he seems like he tries jumps out maybe he's an Xbox player maybe he's coming over here to play some of those games for some time",
            "start": 1877.56
        },
        {
            "text": "he gets into games too deeply though because he he seems like he tries jumps out maybe he's an Xbot maybe he's coming over here for you know toying it out you know some of those games for some Vad violating 69 yeah he's got he's getting the PS+ games you know and he's doing that stuff because he's playing the Destiny teaches them so he's uh had that name for almost two years well there's no way to track it ad boys can't be out there looking for combinations of vag for V violators number nine EA has released a metric **** ton of data derived from its Star Wars Battlefront beta more than 9 and a half million players tried the beta across all available consoles making it EAs biggest beta ever which we already knew what we didn't know is that 1.6 billion minutes were played enough time to watch the original trilogy 4.2 million times Vader and Luke were both spawned nearly 6 million times each the E-11 Blaster killed 293 million characters and the AT-ATs were destroyed 783 thousand times on Hoth",
            "start": 1914.64
        },
        {
            "text": "The original trilogy was played 4.2 million times, Vader and Luke were spawned nearly 6 million times each, the E-11 Blaster killed 293 million characters, and the AT-ATs were destroyed 783 thousand times on Hoth. Six million players reached rank five and unlocked the jump pack. There's some stats there. People are into it, Greg. People are into it. I'm looking forward to kicking the tires when it comes out for the PS4. I'll kick something. Oh, number ten. Good news: Fallout 4 has gone gold, and Bethesda has confirmed on Twitter that you will be able to preload the game on your PS4, giving you just a few days before the game comes out to get it all locked and loaded. And then parenthetically, I want you to know – in case you're curious – Just Cause 3 has also gone gold well ahead of its December 1 launch. Didn't feel like it was worth its own item. I'm glad. Unlike the pile together Roger Pernie went over to Kinda Funny.com/PSQ and left this one: \"Hey guys, this week a few games went gold – Fallout 4, Just Cause three.\"",
            "start": 1956.48
        },
        {
            "text": "like it was worth its own item I'm glad unlike the pile together Greg Miller went over to kindofunny.com psq left this one hey guys this week a few games went gold Fallout 4 Just Cause three Need for Speed this is great and all but my question is does this mean anything anymore games nowadays even games nowadays even those that went gold months before release and are technically finished are rarely really done day one patches still come out some games continue to come out in broken forms and servers blow up I'm not saying that these games in particular are going to suffer for the same fate but I just was wondering if going gold is an important milestone if a game still uses day one patches and are broken without them I mean going gold used to mean games were done and ready to be played but now that's not really the case love you all Greg Miller yeah",
            "start": 1996.24
        },
        {
            "text": "but now that's not really the case love you all Greg yeah Greg's right on Greg's smart and he knows going gold doesn't mean anything anymore it really did mean something in the sense that when the game was gold in the PS2 era when the game was gold in the NES era that was it man you like the game had a game-breaking bug or a flaw on it it was too bad yeah you know um it used to be in the old days when something went gold we were like oh we're going to get it on a burn disc for the PS2 in the next week at IGN you know what I mean next week and a half we'll have burned copies of this game because they just take the file put it onto a CD burner give it to us and now yeah it's it's you get games right before they come out usually because there is a day one patch there is this thing we're trying to fix and and and and and you'll find in review guides because when you got big games to review you often get what it's called a review guide which is like here's everything you need to know about",
            "start": 2043.84
        },
        {
            "text": "to Greg and Colin, you'll find in review guides, because when you get big games to review, you often get what it's called a review guide, which is like here's everything you need to know about the game, here's how to play it, uh, here's some information about the story and the characters in the plot or whatever, and here are some things you need to know. Don't we prefer you don't talk about this until you're done with the game? And there's usually a sheet that has like don't even read this until you're done with the game, and then it's like when you review the game or talk about it, don't talk about this, this, and this, talk about this, this, and this. And a lot of times in you know more recently in the last few years, it's like there will be a day one patch available for this game. Um, I think people interestingly with Halo 5 have learned their lesson with what happened with Master Chief Collection, a lot of people are not putting scores on Halo, um, because they are not confident that the multiplayer environment that they",
            "start": 2081.2
        },
        {
            "text": "5 have learned their lesson with what happened with Master Chief Collection. A lot of people are not putting scores on Halo, um, because they're not confident that the multiplayer environment that they experience in the game will be the real multiplayer environment, which is exactly what happened with the Master Chief Collection. Um, call a doctor and uh yeah so it's interesting he's right, the day one patch thing is unfortunate. I've talked to developer friends about this and they have interesting things to say about it though and I'm trying to get one of them on the show at some point to give context of why this is yeah um because there's interesting answers. It's similar to we think we have it all figured out right even though we don't make games or whatever, at least I mean I've been in this industry a long time you've been in this industry a long time I have a pretty good idea of how things go and how things work I've never worked on a game I've\n\nI corrected the following errors:\n\n* \"Meo\" to \"the\"\n* \"Master Chief colle Meo\" to \"Master Chief Collection\"\n* Added capitalization for proper nouns like \"Halo\", \"Master Chief Collection\"\n* Corrected spelling of \"whatever\" (no change needed, but added a space after it)\n* Left the rest of the text intact, as per the instructions.",
            "start": 2113.32
        },
        {
            "text": "at least I mean I've been in this industry a long time, you've been in this industry a long time. I have a pretty good idea of how things go and how things work. I've never worked on a game; I've never made a game, but I understand what goes into making games very hard, yeah. But at the end of the day, you still kind of take a step back, and you're like, \"No excuses, finish the game,\" yeah. And it's not that easy. And it reminds me of what Aaron Greenberg when he was on the GamesCast last week, who's uh Xbox's marketing manager; it was a great, great podcast gave us a lot of insight; it was a very Xbox-centric uh podcast. And I know this is a PlayStation show, but I bring it up to uh say that he had an argument about Fallout 4 and Tomb Raider coming out on the same day, which I had never thought about. Sometimes you you have to and CU I had I was confident I was like this is all **** up; you could have done something about this. And his argument was no we couldn't have because the week",
            "start": 2153.8
        },
        {
            "text": "about and sometimes you have to and CU I had I was confident I was like this is all **** up you could have done something about this and his argument was no we couldn't have because the week before is Call of Duty the week after is Battlefront choose your poison yeah you know what I mean they weren't going to get the game done before you know a week or two before we could have launched and by the time you go into December in January and February it's just the game's done so he's like we chose you know he not an exact quote but basically we are poison and that was great context about something I didn't understand sure and so I think that there's a lot we don't understand about patching and I'd like to get some developers on here to talk about the mentality behind going Gold version 1.0 of the game and how there is no such thing as a version 1.0 of any game anymore what who is the guy we were just talking about in Colin live today that uh Mojang Mojang they just delayed their game",
            "start": 2187.36
        },
        {
            "text": "of the game and how there is no such thing as a version 1.0 of any game anymore what who is the guy we were just talking about in Colin live today that uh Mojang they just delayed their game right and that one of the things four days before it's supposed to come out and one of the things they site though is is patches and how complicated that all is right cuz there is approvals you have to get it through on console somebody has to you know do it approve it you have to charge money for that so you figure yeah and printing the discs getting it out doing all that stuff if you did you know wait put the disc out you know whatever you start printing the disc weeks later or whatever maybe that does screw up the timeline of oh well now we found this we're not going to be able to get a patch ready for day one to hit a day one patch but there's a whole different lead up to it's I'll be the first two minutes it's more complicated than we often boil it down to and I often boil it down that",
            "start": 2230.36
        },
        {
            "text": "Ready for day one to hit a day one patch, but there's a whole different lead up to it. It's more complicated than we often boil it down to, and I often boil it down that way. So, I'd like to get that context from both sides. Number 11, the development of Uncharted 4 - may have been as rocky as we sometimes think it has been. In a conversation with IGN actor Alan Tudyk (I'm going to say tutk), who is in a series called Con Man with Nolan North, who was of course Nathan Drake, talked about his own experience working on Uncharted 4. He says this quote: \"I worked on Uncharted - the one that has not come out yet. I was doing a role on that. Really, I hadn't seen Nolan since he and I had recorded years before. I liked it. They um they\"",
            "start": 2264.56
        },
        {
            "text": "4 He says, \"I worked on Uncharted, the one that hasn't come out yet. I was doing a role on that, really. I hadn't seen Nolan since he and I had recorded years before. I liked it; they um, they fired um, and then he lets out a sigh. I left; I quit, and then he laughs. So I didn't like it. I mean, I left because they decided to go a different way with it, and so when they did that, when they changed leadership and made my contract null and void, and I was able to take that opportunity to walk away, which was great because I got the experience of doing it; I made some friends – not with Naughty Dog, but I made some friends with the people that left. Todd Stashwick was in it, was in that as well, who is in Con Man, and he did the same thing I did, which was yeah, we're going to leave now, y'all are making some weird changes; we're going to leave. Sorry, Nolan; we left you; we just walked away; we abandoned him.\" End quote. And he's of course being facetious at the end. Yeah, what do you make of this? There's so much I can't",
            "start": 2304.68
        },
        {
            "text": "changes we're going to leave sorry Nolan we left you we just walked away we abandoned him end quote and he's of course being furious at the end yeah what do you make of this there's so much I can't wait to hear the drama surrounding Uncharted 4 and I don't know Greg if it's because it is just so good to be so awesome no doubt yeah that and it's such a big game from a big Studio One of the great studios in in the history of gaming that we just pay a lot of attention to or if there's really like there was the big thing with Amy Houser that was the one I think you dial it back to and then from there that has the ripples of it right but it seems like it even affected like the actors well sure but I mean that that isn't surprising at all cuz like you know how close Neil Druckmann and Amy Houser were like they tweet about they tweet to each other time they're at brunch they're taking photos like that one was obvious and I think he's helping out with Star Wars don't quote me",
            "start": 2341.4
        },
        {
            "text": "Todd and Amy were like they'd tweet about each other time they're at brunch, they're taking photos. Like that one was obvious, and I think he's helping out with Star Wars - don't quote me on that, but I think there's some Star Wars connection between him and Amy too. And so like that goes, and then yeah, somebody like Alan who comes on, who you know is friends with these different people, he's in that same boat. I'd love to know, I'm more interested than ever in what the changes are - you know what I mean? What was Amy's story, and what is Neil Druckmann's story because I've been saying from the get-go... but yeah, like we're ready for Sam, you know Troy's character, the brother to be bad right when is he going to double-cross Nathan Drake? When is he going to get mad at him because that was the whole Todd's whole thing when he - he was the voice in that trailer, he was playing the brother of Nathan Drake and he does that \"you left me in a hole to die\" and it's like... is that not at all what Sam's",
            "start": 2383.64
        },
        {
            "text": "whole thing when he he was the voice in that trailer he was playing the brother of Nathan Drake and he does that you left me in a hole to die and da d d it's like is that that not at all what Sam's going to be anymore in Uncharted 4 is it going to be that he is just riding along with Nate and they are brothers and they are happy go-lucky I'm I can't wait to see that if we get to the end of that game and Sam doesn't double cross Drake at some point I'm going to be blown away it's I don't know what else to say nothing I mean like we it's we need to and we need to know I like how I say like that nothing they there's a story there so deep and it probably takes many many beers and Cocktails to get to to figure out what exactly happened how many people you know is Justin leaving connected to that how about all the other people who left was it just their time or did they feel that this is no longer the project they had their hop set on so they're leaving and you know what I mean then there's",
            "start": 2418.72
        },
        {
            "text": "how about all the other people who left was it just their time or did they feel that this is no longer the project they had their hop set on so they're leaving and you know what I mean then there's the delays and this and like how much of it was you know what I mean like all you hear is chatter and shaft right now I want to get to the wheat what is happening yeah sure enough I wonder if we ever will because there's much to be said yeah when NDAs are up and everyone can speak freely might be a long time from now Number 12 Harmonix employees have been leaving positive reviews for Rock Band 4 on Amazon word comes by way of Reddit which found at least seven Harmonix employees leaving fake reviews for the game without noting that they actually worked on the game. MH Destructo later got a statement from our har from Harmonix admitting that this happened \"Harmonix has clarified its internal policy about posting reviews of our own products on retail sites and we've asked that\"",
            "start": 2457.96
        },
        {
            "text": "a statement from our HARMONICS admitting that this happened quote Harmonic has clarified its internal policy about posting reviews of our own products on retail sites and we've asked that existing reviews be edited to identify Harmonics employees or be removed entirely while we believe the review POSTED by a few employees were sincere and without ill intentions as a studio we don't believe these are appropriate actions we appreciate the feedback from the community and take our relationship with our fan seriously end quote at least one employee has since gone back and updated his review to note his position with Harmonics I that's the only one I saw from this I'm not going to **** dig in and look yeah yeah um but that's the one I saw on Destructoid what a shady **** move I'm sorry like I understand what Harmonic is saying they do have to protect their people in their brand but that's shady and I don't know that you can't I don't know how you can look at",
            "start": 2494.2
        },
        {
            "text": "**** move I'm sorry, like I understand what Harmonix is saying they do have to protect their people in their brand but that's shady and I don't know that you can't I don't know how you can look at that without ill intention I don't I'm not saying that there's ill intention is maybe not maybe a misnomer but nefarious is maybe the word I would use. You worked on the game, I would say tonee ton, you know, I mean that you feel like we're playing PTI now. My my thing about it right is like it's the Amazon reviews and I'm not here saying there's no sanctity to them that they're all **** da I use them all the time I use the aggregate yeah me too and I'll go and I'll read like what is it you read the four stars and the three stars those are the people who are like the most honest right, not just it was great or it's **** garbage but like it's like is that. I'm not I obviously in their shoes if I was running a company I would be very much like yes don't go in the game you worked on and review.",
            "start": 2527.0
        },
        {
            "text": "it was great or it's **** garbage but like it's like is that i'm not i obviously in their shoes if i was running a company i would be very much like yes don't go in the game you worked and review it that you know what i mean that's for the consumer to do you've left that behind when you move over here to go be part of the team to go make the game but then in the same breath like if they would have from the get-go been like i worked on the game you know what i mean it's just it's a weird it's like it's just a weird thing to add it's like when Clem used to do reviews at IGN and then like he we we we never had at the beginning like a real policy on how long do you say in the review how long you played where do you put all this information out and Ryan would write like these comprehensive blog posts and he would link them at the end of the reviews right and i was always like it seems like is that is that like too much is that an overblown reaction to it you know what i mean props to you",
            "start": 2565.92
        },
        {
            "text": "posts and he would link them at the end of the reviews right and I was always like it seems like is that is that like too much is that an overblown reaction to it you know what I mean props to you for doing it you know you're awesome but I was always like I'm really busy I don't I'll say it in the review and I'll answer in the comments if I need to you know I mean like this is the same thing of like a sliding scale of like where is the responsibility here and like do we know the roles they were I mean were they just like people who work at Harmonix or were they like developers of the game and I don't know I don't know it's a weird thing and I mean that's the whole yeah it's it's weird all over should they have disclosed who they were of course they should am I looking for ethics in my Amazon reviews not really I should be looking for ethics in Amazon journalism it's about ethics in Amazon journalism #AmazonJournalism",
            "start": 2603.68
        },
        {
            "text": "reviews not really I should be talking about ethics in Amazon journalism it's about ethics and Amazon journalism hashtag but I mean not really but it's because I already don't believe that exists there are no gatekeepers it's like when I oh it's like Yelp when I go on yeah when I go on Yelp and there's like five reviews I'm like well sure three of you work there you know what I mean like can I trust you I go for the one with a giant number that has like something to say it also seems like everyone has three and a half and four stars on there it doesn't matter like Hard Rock Cafe I think has like three and a half stars or four stars I'm like are you kidding yeah the service does suck if you're not sitting at the bar but the food the drinks wow that pappy flight I had was on point don't do it I love how some people don't know first of all it's so it's funny how people a lot of people it's it's cute because you know let people know that they know they don't know what they know a lot of people don't know liquor",
            "start": 2639.88
        },
        {
            "text": "don't know first of all it's so it's funny how people a lot of people it's it's cute because you know let people know that they know they don't know what they know a lot of people don't know liquor and they watch this and they watch this and they say wow look at Greg drinking out of the Black Label bottle a clear liquid I'm like guys that's a Scotch bottle it wouldn't be VOD vodka or Jin it's clearly water everyone can relax also Greg's an alcoholic so call it took me a while get to Betty for it took me 40 40 minutes I'll say maybe even less than that uh of drinking out of the cup to be like what does this cup smell like and I was like this cup smells like dog food I noticed this morning that the dry dog food cup had been put was no longer there cuz I had got it had gotten buried so it's been in there for like a month and then I saw it on I saw a cup on the rack and I took that and put water I was like this still smells like dog food that's disgusting keep your dog's food out",
            "start": 2684.88
        },
        {
            "text": "been in there for like a month and then I saw it on I saw a cup on the rack and I took that and put water I was like this still smells like dog food that's disgusting keep your dog's food out of the sink I didn't do it keep your food out of the sink and your food keep your food out of the sink okay don't do it Greg you're gonna die you're dead number is it possible that a new more powerful place you like that that was a great pregnant pause a lot of people looked at their MP3 on that if your if your mp3 dies all the time sorry about that we don't know what that's about yet is it possible that a new more powerful PlayStation 4 will eventually come out yes it's inevitable yes it is a more powerful PlayStation 4 you think is inevitable yeah why would you think that because why wouldn't it be when has that ever happened every time never it's never happened okay give me the story DualShockers translated an interview on Japanese site 4chan with PlayStation senior vice president",
            "start": 2728.24
        },
        {
            "text": "It be when has that ever happened every time never it's never happened okay give me the story DualShockers translated an interview on Japanese site 4Gamer with PlayStation senior vice president Masayoshi \"Sony\" Ido on if it's possible that a PS4, quote, with improved performance unquote may ever launch. Dual Soccer says quote Osan immediately clarified that he has nothing specific to announce but that the adoption of the x86 architecture made performance improvements in due time possible yet Osan concluded or continued, I'm sorry. The real question is whether those improvements should be made or not. With the PS3 architecture around and the Cell it was impossible to expand the machine beyond the capacity of the hard disk on the other hand with the PS4 adopting a conventional x86 architecture it's easy to achieve flexible performance enhancements while using the same game assets that's why I provided a standard performance version of the PS4 and a high-performance version of the console side by",
            "start": 2771.68
        },
        {
            "text": "to achieve flexible performance enhancements while using the same game assets that's why I provided a standard performance version of the PS4 and a high-performance version of the console side by side is according to Sony an idea that might be considered it's worth stressing on the fact that Sony was talking hypothetically prompted by a specific question so don't go taking this as confirmation of a PS4. One is actually in the works Every PlayStation firmware in the history of forever has system stability updates all right you're getting real that's all this is That's only happened to three of the you know PS3 Vita and PS4 but every firmware, PSP, a lot of firmware You just this is really interesting because I've talked about this with you in the past that I was surprised Nintendo 64 was on to something I think with the expansion pack I think they were I don't think it's an ideal situation because you needed the expansion pack to play Majora's Mask sure this isn't talking about",
            "start": 2811.56
        },
        {
            "text": "was on to something I think with the expansion pack I think they were I don't think it's an ideal situation because you needed the expansion pack to play Majora's Mask sure this isn't talking about that at least from what I can tell this is saying that you will be able to play any PS4 game on either of the consoles but that using the same assets but that it will look better or run better or run quicker or smoother on an enhanced PS4, also known as a ps4. one as they call it and that's never happened and I think that that's a really interesting idea and when we when PS4 came when PS4 was announced and stuff I did not being a very technical person still was a little bit confused that there's no expansion possibilities on the console itself that there's no way to put in more like something very consumer friendly that you're not opening this machine but something you shove into the PS4 that gives it more RAM or whatever and I was shocked by that because I was like that's an a a good way to make money",
            "start": 2850.08
        },
        {
            "text": "that you're not opening this machine but something you shove into the PS4 that gives it more RAM or whatever and I was shocked by that because I was like that's an a good way to make money and it also future proofs your console but what they're saying is that hypothetically according to Sony this might be a thing that they can do now the sell is with this locked closed thing and and the x86 architecture can be scaled and so like much like a PC will be able to play Fallout 4 at the minimum levels and the Fallout 4 at the maximum levels but it's the same game yeah with the same assets running the same disc all that kind of stuff running the same data I think it's a fascinating I don't thinka happen I think it would be an interesting thing to pull out of your hat in like 2018 maybe sure but I mean by then we were already starting to look to PS5 we're already starting to think about the next thing it's like it at the end of the life cycle if they would have put out a PS3.1 that was",
            "start": 2890.28
        },
        {
            "text": "but I mean by then we were already starting to look to PS5, we're already starting to think about the next thing. It's like it at the end of the life cycle if they would have put out a PS3.1 that was like it runs your PS3 games better and da d d da I'd be like cool but I know you're about to put out a new console that I won't be able to play those games on this thing and I don't care what you know, this looks like. I think the argument might be that the scaling will allow this to happen easier and that there might not be... I mean, there's I don't want to say there's nowhere to go from here, there's definitely I mean look at a PC game, they're way prettier than PS4 games but there might not be any realistic way for them to go oh uh to the new console in other words there might not be the development imperative that we've heard a lot about about how developers really needed these new consoles they needed them more than we needed them in a way because they their vision for their games these",
            "start": 2932.44
        },
        {
            "text": "imperative that we've heard a lot about how developers really needed these new consoles they needed them more than we needed them in a way because they their vision for their games these huge open-world Games just weren't working for instance on PS3 as we saw with Skyrim and it's so it's interesting to think about a future in which Sony is not interested in actually putting any more money back into a PS5 yet and in 2018 2019 they're like the ps4. one or whatever they would call it would be you can don't have to buy it all the games coming out will work on your PS4 they're just going to look way better and that is the incremental jump and then so you have this ability to scale it's almost like a half step yeah I actually think it's quite clever it's interesting but you know what it also gets Colin is it gets complicated right now consoles are you know our choice because they're easy you know what I mean when you start complicating the message you get to the Steam box",
            "start": 2970.56
        },
        {
            "text": "what it also gets colon is it gets complicated right now consoles are you know our choice because they're easy you know what I mean when you start complicating the message you get to the steam box territory right where what which one am I buying why isn't there just one wait it's the Wii U so it's just the Wii so is it different you know what I mean like yeah that's fair enough I still think that if you could just put the disc in both systems and not have to do anything there's no sliders nothing like that it's just this one runs your loading times are 15% better your game is sharper looking the internet works a little bit better like all that kind of stuff and you just don't do anything yeah might be easy enough but I agree it could be complicated number 14 was what you already ruined happy 15th Birthday in America PlayStation 2 on October 26 2000 15 years ago to the day this podcast is being recorded PS2 launched in the United States and what a glorious day it was and we",
            "start": 3008.72
        },
        {
            "text": "Ruined happy 15th birthday in America, PlayStation 2 on October 26, 2000. Fifteen years ago to the day this podcast is being recorded. The PS2 launched in the United States and what a glorious day it was. And we talked about it on Colin and Greg's live show today. I remember very well; you remember very well. We both got it the day it came out, and uh... I can't... I like it makes me a little sad almost. Like that was 15 years ago. I was thinking about it today when we were done with Col GG Live, and I was tweeting about uh doing I'm gonna stream WWE tonight, right or whatever. And it's like 15 years ago I was in high school, and I just brought this thing home. Now like our jobs are all this all wrapped up in that you know what I mean. Even when I wanted to write about games, I didn't expect it to be like this. It's weird; it's what's weird too is what has happened in PlayStation since then. We've had PSP and PS3 and PS Vita and PS4 all in that 15-year cycle since the PS2 came out, not to mention the PS Vita.",
            "start": 3043.72
        },
        {
            "text": "Be like this, it's weird. It's what's weird too is what has happened in PlayStation since then. We've had PSP and PS3 and PS Vita and PS4 all in that 15-year cycle since the PS2 came out, not to mention the PS2 dominated most of the half of that time between then and now. Uh, I've said in the past, and we can talk more about it later in another podcast or whatever. Um, PS2 is my least favorite piece of PlayStation hardware. Um, is that because you like the other ones so much? Or I loved GameCube. Xbox was fun. Um, I thought you were talking about in oh, in terms of PlayStation hierarchy, you're saying it's your least favorite. Does that mean you dislike the PS2? No, no, they're all great. I think the PS2, in my opinion, and I know a lot of people really love the PS2, and I think a lot of people really love the PS2 frankly because we have an A big group of people aged to have played that console like we played the NES or the SNES, which is you know the NES is always going to be my favorite.",
            "start": 3082.24
        },
        {
            "text": "the PS2 frankly because we have an A we have a a big group of people aged to have played that console like we played the NES or the SNES which is you know the NES is always going to be my favorite console so it's and I know a lot of that is Nostalgia there's no doubt but it is and I think people feel that way about PS2 I think PS2 has the weakest library of all the PlayStation consoles PS4 has not been written yet that's why I I don't write it off I think even for me V's lineup having PS1 Classics and then the PSP catalog and then and then VA games is an awesome thing so I I I think that that you think that's a better Library yeah in my opinion you know sure uh PS2 I suffered during the PS2 era a lot because the jrpgs that I really like playing on the PS1 era then PS1 had the best role playing games library pound-for-pound of anyone I know a lot of people think SNES is better I don't agree um PS2 started to really **** with a lot of things Final Fantasy X is a good example",
            "start": 3125.24
        },
        {
            "text": "playing games library pound-for-pound of anyone I know a lot of people think SNES is better I don't agree um PS2 started to really **** with a lot of things Final Fantasy X is a good example that really turned me off from Final Fantasy things started kind of getting more action RPG it's not to say I don't like action RPGs but they weren't what you were looking for it yeah exactly like I love Brave Fencer Musashi on PS1 and stuff like that so it's it's you know aundra and you know these action RPGs so it's not to say I don't like those kinds of games but it wasn't exactly what I was looking for what I started getting in the PS2 era that I really liked was games like Okami these pre-rendered backgrounds and these these these beautiful kind of creepy games but to the point I was trying to make before with Gamecube and Xbox because I thought that's what you're talking about in terms of its contemporaries I was quite sucked into the GameCube library at that time and um you know I got",
            "start": 3171.36
        },
        {
            "text": "to make before with GameCube and Xbox because I thought that's what you're talking about in terms of its contemporaries I was quite sucked into the GameCube library at that time and um you know I got GameCube a year later when it came out 2001 and then I got my Xbox in 2003 when Halo came out and Xbox by the time I got the college was the console I was playing the most which I know would surprise a lot of people I played Rainbow Six 3 until my eyes bled so that might be my most played game of that generation by mile interesting um I actually just adored that game um so PS2 to me I just think a lot of it comes down to the fact that I wasn't focused on PS2 um things came and went that I didn't play I played as much as I could um and of course great games came out on the console like the Grand Theft Auto games Manhunt um you know Etc and so on um like these great you know Rockstar Games especially but I just uh I don't know I just don't like the PS2 that much compared to PS1",
            "start": 3206.96
        },
        {
            "text": "the Grand Theft Auto games Manhunt, um, you know, etc., and so on, um, like these great, you know, Rockstar Games, especially, but I just uh, I don't know, I just don't like the PS2 that much compared to PS1. I wonder if it is yeah, that you just didn't get dropped into it as much, you know what I mean? Because like for me, like it's got to be up there for me but it was a coming of age thing, you know what I mean, like I was talking about today, you know. You know 15 years ago today was the first big purchase I ever made on my own, you know what I mean? I worked, I had a summer job for it, I saved up, I bought DVDs ahead of time and **** like that but like you know PS1 I bought way super super late, like I was just an N64 person and then at the very end when the N64 was like dead, I traded it in, bought a PS1, bought some games with it, played it had a great time but that was like I would say maybe a year and a half maybe a year before the PS2 is coming out and",
            "start": 3244.32
        },
        {
            "text": "N64 was like dead, I traded it in and bought a PS1. I bought some games with it and played it; had a great time. But that was like maybe a year and a half before the PS2 is coming out, and that really lit the fire - oh, I'm this PlayStation people know what they got going; they've got some good stuff. And so PS2 is the one where I bought it, and that was my system when I went to college, you know, in 2000. Graduated, no one went to Missoula, and then you came there, and that still was rare to find people with PS2's. So like I had people over all the time we were playing Grand Theft Auto and tossing the controller around Metal Gear, all these different things. And I think for me it's that library speaks to me because it had so many games that I loved - right, with Metal Gear, with all the Rockstar stuff, wrestling; I mean when SmackDown! Just Bring It came out, like our college dorm on floor was all",
            "start": 3283.92
        },
        {
            "text": "games that I loved right with Metal Gear, like you're saying with all the Rockstar stuff. Wrestling, I mean when WWE SmackDown just brought it came out like our college dorm on floor - that's all we played, like that was such a huge deal and it goes on. I mean, got a war all these other you know Twisted Metal, so many things. I hear you, I understand but it's probably the same reason that I don't have much love for PS1 just in the fact of like I had it and I played Metal Gear on it and I played other stuff - you know what I mean? Like, the PS1 to me is a very very very special console. You know, up there with the SNES, PS1, PS3 are probably like the pantheon of of of... I think the PS3 is like extraordinarily good too, criminally underrated console that people finally came around to when it was a little late. We don't really need you anymore - where were you? Were you Johnny come lately? Where were you when Haze came out? Where were you when Super Rub-a-Dub was the thing to play when you're trying",
            "start": 3320.0
        },
        {
            "text": "Little late, we don't really need you anymore. Where were you? Were you Johnny Come Lately? Where were you when Haze came out? Where were you when Super Rub-a-Dub was the thing to play? When you're trying to convince yourself you didn't need Rumble, you loved Sixaxis. I'll never forget those early controllers how bad they were and how I just destroyed a controller. What is this? Is this just a shell? Is there anything inside it? I when I was playing Heavenly Sword on IGN, I destroyed a PS1 Sixaxis Controller, but like I died or something, and I just slammed my controller, and it was done. It was done. Good times! 15, and finally some new game announcements, release dates, and more as we always end The Ropers Report with multiplayer physics-based tower building game Tricky Towers will be coming to PlayStation 4. Our friend Mike Bithell's game Volume is coming to PlayStation VR in the form of an expansion called Koda. We don't know what the",
            "start": 3358.84
        },
        {
            "text": "building game tricky Tower will be coming to PlayStation 4 our friend Mike Bithell's game as we mentioned, Volume is coming to PlayStation VR in the form of an expansion called Kojima. We don't know what the nature of that is; still waiting for the VA version I wrote in all capital letters still waiting still waiting for the we've been letting off the hook I was thinking about today in the shower Super Giant Games, where's Bastion on Vita? Getting tired of these clowns Sid, those clowns Greg Cavin and Mike Bithell. Sidescroller Super Rude Bear is coming to PlayStation 4 music game Superbeat: Xonic is coming to Vita on November 10th; Hell Divers' new expansion Democracy Strikes Back is now live. Game of Thrones episode 6, \"The Iron Throne\" (not \"the ice dragon\") is launching on November 17th on PS3 and PS4. God of War still has an end date and publisher Idea Factory revealed that Mega Dimension Neptunia VII on PS4 and Megadimension Neptunia VII: HD Remaster, God of Destruction on Vita along with an unannounced game will be at PSX; um so that's basically all the news.",
            "start": 3402.52
        },
        {
            "text": "ended and publisher Idea Factory revealed that Mega Dimension Neptunia VII on PS4 and Hyperdimension Teirakta God of Destruction on Vita, along with an unannounced game, will be at PSX. Um, so that's basically all the news for this episode. Nice now Colin we've been doing this episode it's the pre-Paris Games Week episode we're trying to catch you up on everything that's happening before Games Week very excited I'm excited me too I'm very excited about now you think it's going to pay off or you think we're going to be let down. I think it's going to pay off okay Shu told us on episode two of PS I Love You XOXO that treat it like it's a games press conference the gamescon press conferences are good a lot of games are announced to those okay okay good point I think quick you know we'll know people are not going to be able to listen to this until after it already happened but Quantic Dream's game's got to be there right you have to assume it's got to be it's got to be there yeah and the what a lost opportunity",
            "start": 3444.8
        },
        {
            "text": "be able to listen to this until after it already happened but Quantic Dream's game's got to be there, right? You have to assume it's got to be there. Yeah, and what a lost opportunity. Yeah, you know they've been quiet for a long time. Yeah, uh, but before we look to the future in Paris Games Week, let's look to the present. If I wanted to know what came out this week to the mom and pop shops, where do I go? The upcoming list of PlayStation 3, PlayStation 4, PlayStation Vita, and PSP you're software. Wow, at first I thought you were just messing up the title, but you're telling me that's the kind of games we got this week coming to PlayStation consoles by whoever the hell Kinda Funny co-founders? The following games will be available on well, you'll find out on digital services at least. Number one, Alien: Isolation The Collection comes to PS4 digitally; says contains the full game and seven packs of additional content. Discover the true meaning of fear in Alien: Isolation, a survival",
            "start": 3482.52
        },
        {
            "text": "number one Alien: Isolation - The Collection comes to PS4 digitally, says it contains the full game and seven packs of additional content. Discover the true meaning of fear in Alien: Isolation, a survival horror set in an atmosphere of constant dread and mortal danger. You want to play it? Uh, I'd like to, I'd like to - that's one of the games that I'd like to play, but I don't think you'll actually have time. I hear you on that one. Arcade Archives Ninja Kid 2 - ninja kid has a hyphen in between it by the way. PS4 digital Ninjakid Kid 2 is an action game that was released by UPL in 1987. Ninjan has new actions and weapons, and plans to overthrow Ashura; expect lots of excitement and the thrill of even harder challenges. Good, all right - good. I like harder challenges. Darksiders 2: Definitive Edition this comes out retail and digitally on the 30th so this is a Friday release. Become the terrifying force which everything fears but nothing can escape awakened by the end of days death.",
            "start": 3525.8
        },
        {
            "text": "digitally on the 30th so this is a Friday release another one of these Friday releases becomes The Last of Us, which everything fears but nothing can escape, awakened by the end of days, Death, the most feared of the Four Horsemen embarks on a quest to redeem his brother's name I always thought the most fearsome Four Horsemen member was War that's enough Divinity: Original Sin Enhanced Edition comes to PS4 digitally and a retail release to overwhelming critical acclaim Larian Studios RPG Divinity: Original Sin returns with a host of new and enhanced content The Cooperative Adventure receives a console makeover with a new intuitive UI and dynamic split screen for Co-op as well as plethora of new content quests combat styles locations and more Mega Man Battle Network comes to PS4 digitally brought to you by Big Pixel Studios and Adult Swim games Mega Man Battle Network features fast-paced and explosive on the couch combat take on your friends in one to four player matches",
            "start": 3567.44
        },
        {
            "text": "To PS4 digitally brought to you by Big Pixel Studios and Adult Swim Games. Mega Coin Squad features fast-paced and explosive on-the-couch combat. Take on your friends in one-to-four player matches spanning multiple worlds and game modes. I'm interested in this one because it says take on your friends in one-to-four player matches. Well, I'm not going to be taking on my friends if I'm playing one-to-four well no you might be two-to-four because you got no friends that's true I don't have any friends and women hate me Minecraft Story Mode Season Pass disc PS4 and PS3 retail only as Jessie you'll embark on a perilous adventure across the Overworld through the Nether to the End and Beyond. You and your friends will revere the legendary Order of the Stone, Warrior, Redstone engineer, Griefer, Architect, Slayers of the Ender Dragon that's just a series of nouns and I don't sense to me don't think that means anything I know Minecraft MX Versus ATV Supercross Encore comes to PS4 digital and retail this **** still",
            "start": 3610.44
        },
        {
            "text": "The Ender Dragon, that's just a series of nouns and I don't sense to me don't think that means anything. I know Minecraft MX vs ATV Supercross Encore comes to PS4 digital and retail this **** still happen huh, I guess so. Rip jump and scrub your way to victory across more than 35 tracks in this vastly extended version. Only The Encore Edition features the brand new Rhythm racing mode, extra outdoor nationals tracks, and exclusive waypoint races in open world maps. I have a good feeling about this one okay. River City Super Sports Challenge All-Star Special comes to PS3 digitally on the 28th okay so that's a Wednesday release. Rio: High School of the Dead - I'm assuming \"rho\" is a typo for \"Rio\" - high school student council president Toto arranges an athletic meetup to make up for the trouble caused by the ex-student council president Yamada, but in reality it is intended to show off the power of Río High School. What the **** does that mean? Rio: High School of the Dead's high school student council president Toto arranges an athletic meetup to",
            "start": 3652.2
        },
        {
            "text": "president Yamada, but in reality, it is intended to show off the power of Rho High School. What the **** does that mean? Rho's high school student council president Toto arranges an athletic meetup to make up for the trouble caused by the ex-student council president Yamada. But in reality, it is intended to show off the power of Rayo High School. He's got to just show the dominance of Ray High School. Man, I understand Techmo Deception: Invitation to Darkness, a PS1 classic available digitally. Okay, making a deal with Satan at the moment of your death, you'll be given command; you're given command of the castle of the Damned and must steal the souls of Invaders to resurrect him. Trails in the Sky Second Chapter comes to PSP digitally on the 29th. So this is a Thursday release, and it'll be playable on Vita okay but no trophies there's no write-up for it all I know is that this was this was a there's a story behind this port Jason Tri was saying that there was like a lot of drama to get",
            "start": 3699.88
        },
        {
            "text": "playable on Vita okay but no trophies there's no write up for it all I know is that this was this was a there's a story behind this port Jason Trifas was saying that there was like a lot of drama to get this port out okay and he's writing about and we'll look for it soon from finally WWE 2K16 comes to PS4 and PS3 digitally and at retail get in the ring and raise some hell with WWE 2K16 The Undisputed Champion of Wrestling Games returns with the biggest roster in WWE games history you got a let's play up on youtube.com/ kindafunnygames go watch it there or go watch my twitch archive unless I died during the second half of the show and didn't stream it at night because I'm dead then you can just watch the let's play that's it okay Colin are you ready for Tots topic of the show tots tottss we we we we've been bringing some heady issues to the table recently over at kindafunny.com psq where you can leave your questions The Informationist left a question for us that I think we could",
            "start": 3748.36
        },
        {
            "text": "we've been bringing some heavy issues to the table recently over at KindaFunny.com/PSQ where you can leave your questions The Informationist left a question for us that I think we could expand on and then we'll get to the rest of the reader mail and everything else but I thought this was a good one and I like, I like the idea of talking this out okay because I don't want you just you you can give me your knee-jerk but I think a case can be made which is the better game The Last of Us or Red Dead Redemption I think that's it yeah I'm sorry that's it I'm on microphone that's it which is the better game yeah the last of us or Red Dead Redemption and the answer is obviously The Last of Us yeah I agree hands down red Dead's a great game though right see and that's the thing is why I did I did the same thing you did I read this question I like last of us and then I thought about it more in terms of games and what's happening and how and I thought there's a case to be",
            "start": 3801.0
        },
        {
            "text": "Is why I did, I did the same thing you did. I read this question. I like The Last of Us and then I thought about it more in terms of games and what's happening and how, and I thought there's a case to be made for Red Dead even though I won't vote for it, and I wanted your opinion on it. We'll make the case - the case is that Red Dead's awesome as we just said right. The mechanics are great; they're you have so much to do in it. The open world wandering around, you know what I mean? It's not it's interesting comparing it to The Last of Us right and the fact that The Last of Us is linear narrative - this is where we're going, this is what we're doing right. Whereas Red Dead is there's a narrative there, and whereas in GTA right I always feel like The Narrative of GTA and the openness of GTA sometimes you know they're a conflict right of like they they no I punched a table over the weekend in Nashville so I can't I didn't want to grind - they're like this, they're they're conflicting, they're rubbing up.",
            "start": 3849.72
        },
        {
            "text": "know they're a conflict right of like they they no I punched a table over the weekend in Nashville so I can't I didn't want to grind they're like this they're they're conflicting they're rubbing up against each other okay I thought they were going like this no they're not jerking each other off okay GTA and that there's so much going on there's something every few feet so like sure I want to go off and save Michael's daughter or whatever but man I just ran this guy over and now there's something you know what I mean like there's so much in such a tight space that I feel like the story and the open is get in the way whereas with red dead the story is you know this is this old west thing you've got to go across the map to go do this and as you go across this desert and there's all this open space and you get lost in what you're doing and so then if you do see a random thing off to the side it's more realistic I feel like at least and okay that might actually distract me to go do it",
            "start": 3890.04
        },
        {
            "text": "The Last of Us vs Red Dead Redemption - PS I Love You XOXO Ep. 05, Greg and Colin are discussing their experiences with both games, specifically how they feel about the game worlds and storylines. Greg mentions that in The Last of Us, he likes how the game's world is more realistic and immersive, whereas in GTA 5, he felt overwhelmed by the sensory overload. He also compares the storytelling in Red Dead Redemption to being John Marston, where he enjoyed exploring the open world and completing tasks at his own pace.\n\nCorrected Chunk:\n\"The Last of Us vs Red Dead Redemption - PS I Love You XOXO Ep. 05, Greg and Colin are discussing their experiences with both games, specifically how they feel about the game worlds and storylines. Greg mentions that in The Last of Us, he likes how the game's world is more realistic and immersive, whereas in GTA V, he felt overwhelmed by the sensory overload. He also compares the storytelling in Red Dead Redemption to being John Marston, where he enjoyed exploring the open world and completing tasks at his own pace.\"",
            "start": 3922.8
        },
        {
            "text": "done or I think I'm going to do one thing and then I have to deviate from it to go off to the other thing whereas GTA I felt like well am I making progress am I not making progress how does this work and it was breaking the experience for me a little bit in terms of that and then of course Red Dead's multiplayer is also excellent it gets talked about because neither of us are multiplayer guys but I remember a whole bunch of our friends Baron and Tyson would play it every night get together and the horses go out and do their little things and have fun so so in terms of that it's we're not comparing Apples to Apples and I granted they're both games and I think for me the problem with Red Dead is always Mexico right did you well you're racist so of course but I think Mexico is like the chapters where you're like oh like this I've been what is going on where are we going that's when you lose the narrative again in a little bit you know what I mean you never lose the narrative",
            "start": 3961.4
        },
        {
            "text": "is like the chapters where you're like oh, like this I've been wondering what's going on, where are we going? That's when you lose the narrative again in a little bit. You know what I mean? You never lose the narrative in The Last of Us because it is so simple: protect this girl, get her to the point - that's the end of the game. You know what I mean? Yeah, I think that... I haven't played Red Dead in a long time, but I think that the things that Red Dead does really well are things that The Last of Us does better. Um, so the environment: right, Red Dead is an open world, it's a Rockstar game, it's an open world game, yeah, and it looks beautiful and it's fun to explore up. But the aesthetic of the of... and kind of the allure of Red Dead 2 was just that it wasn't that it was open world; it was the nature of the open world - it was interesting and diverse and and fun to be in, um, and harrowing to be in. And I think that the harrowing nature of The Last of Us even though it is a linear game with no open world",
            "start": 3997.72
        },
        {
            "text": "It was it was interesting and diverse and and fun to be in um and harrowing to be in and I think that the harrowing nature of The Last of Us even though it is a linear game with no open world uh component to it at all um is even better at that so like when you compare environments I think The Last wins I think the characters uh Joel, not John Marston's, a great character it's a he's a great character and there's a lot of really fantastic uh surrounding cast in that game as well and I also think that it ends on a really sad note which so does Red Dead Redemption um but I think The Last of Us's characters are better so and I I think the gameplay in The Last of Us is a little underrated I understand that there's some wonkiness with cover I understand that Ellie is a little immersion break she's she breaks the immersion because she runs in front of people and stuff like that but as we talked about in the past do you want do you want to just have this 20 minute plan you've been blown up because you cannot",
            "start": 4041.08
        },
        {
            "text": "immersion because she runs in front of people and stuff like that, but as we talked about in the past, do you want to just have this 20-minute plan? You've been blown up because you cannot control this AI character. Like you have to kind of get over that - that's a design choice, and I think they made the right one on that. I think the combat in Red Dead was a huge step in the right direction from Grand Theft Auto IV, which is really rough to play when you're not in a car. Um, and then they perfected that even more with Grand Theft Auto V. But I think gameplay is better than The Last of Us. So I think just because The Last of Us is better than a game, and The Last of Us is better than almost any game, doesn't mean other great games aren't great too. I think Red Dead's a fantastic game, and I'm excited to see the sequel - really it's the third game in the series, Red Dead Revolver being the first one, but and and I'll play and I'm",
            "start": 4087.92
        },
        {
            "text": "too I think that the Red Dead's a fantastic game and I'm excited to see the sequel where really it's the third game in the series, Red Dead Revolver being the first one. But and and I'll play and I'm I'm sure it's going to be great. I'm sure they're working on it down probably in San Diego of course they better be God damn it everybody wants another one but I I I don't think it it holds a candle to The Last of Us in terms of what The Last of Us does best but they're different games and see that's the problem is because like I the environments sure I think the environments are more interesting in The Last of Us but I think that's kind of like can we can it's open world right like that's the problem exactly there's so many different things happening there. The I mean I guess the one thing Red Dead has going for it a little bit is the fact that as John Marston, I and this is one of those things I of course I I get through without spoiling the end of The Last of Us right that I found to be the craziest",
            "start": 4126.96
        },
        {
            "text": "for it a little bit is the fact that as John Marston, I and this is one of those things I of course I I get through without spoiling the end of The Last of Us right that I found to be the craziest the ending The Last of Us right I always talk about the fact that like I'm waiting for the button button prompt to pop up right of like for me to make my choice and that it turns out I can't I'm playing Joel's story this is what they're telling me something you know what I mean there's no at the end now the the path splits and you get to choose what you want to do right so like you're on this ride of what's going to happen and who Joel and Ellie are that's a story they're telling you whereas with like I always talk about it with uh Red Dead there's this one moment where you're running uh I don't know if you did this side mission where you're running the mission where you have this guy asking you for flowers for his wife or whatever you know what I mean he's he's in love",
            "start": 4165.64
        },
        {
            "text": "I don't know if you did this side mission where you're running the mission where you're you have this guy asking you for flowers for his wife or whatever, you know what I mean. He's in love with his wife. You ran into him; it's just a stupid side quest. You eventually get him to give them to him. He's like, \"Thanks,\" and you walk into his house, and he gives them to him, and he has a mummified corpse of his wife there, and he puts her down. He's just completely bonkers right? And it's like... it's not scary, and it's not funny; it's sad, you know what I mean? At least for me, this is all me reading into the situation. Right? So I go in there; he talks to her; thanks me; I get the money or the XP or whatever the hell you get for... I don't remember in Red Dead missions anymore probably both those things. Uh, and I'm like, \"All right, great.\" And I walked back out, and I'll never forget this: I walked back out, and then I spun the camera, and it was like... you know, beautiful and sunny.",
            "start": 4204.84
        },
        {
            "text": "both those things uh and I'm like all right great and I walked back out and I'll never forget this I walked back out and then I spun the camera and like it was like you know beautiful and sunny and like you can hear the birds flying and stuff and I just went and I brought up my wheel and I put on my little bandana and I walked back in the house and I blew the guy away and it wasn't it wasn't the GTA I'm going to shoot this guy and see what happens da d da this was like a mercy kill of like this guy is done you know what I mean like I have to put this guy down he's gone and that Mo that is one of those moments that's always stuck with me and it didn't it's not sticking with me because I was told it right like that was me in the open world make my own consequences I put on the the bandana if you don't remember so that I don't get notorious points or whatever I don't go in the bad section I I wanted to keep being a good guy but you have those gray areas to play in and for",
            "start": 4239.6
        },
        {
            "text": "if you don't remember so that i don't get notorious points or whatever i don't go in the bad section i i wanted to keep being a good guy but you have those gray areas to play in and for me like that's important in that kind of game i'm not saying i missed that in The Last of Us right i was talking about that i love the fact that when i got to that precipice where it's like oh and here comes my choice i didn't get it i like that but that's something special that Red Dead gets to do that you know like we're talking about what walking the difference is in what they can and can't do right that The Last of Us can't do yeah i think what i think you bring up about Red Dead just generally which i think is interesting is that it's just it's just a great game mhm you know uh that's a game i would love love for them to re-release i'm surprised they haven't yeah um but GTA it's Rockstar and they don't have the there's no financial imperative for them to do it certainly",
            "start": 4277.72
        },
        {
            "text": "I would love, love for them to re-release. I'm surprised they haven't. Yeah, um, but G it's it's GTA, it's Rockstar, yeah, and they don't have the there's no financial imperative for them to do it. Certainly the game sold really well, and and uh, the studio heads are down, and I also think if they release it now it just it it it it um eats into getting ready for the next Red Dead, yeah, and it also like tips their hand a little bit right. Um, see I'm I'm excited for a new Red Dead, the same reason I'm excited for the new Fallout, right? If was going out there making my choices, what am I going to find out in this place? You know what I mean, and not that I wasn't excited for that, but I there's a difference between I think for me at least, right, discovery versus exploring where I'm discovering all the stuff in the open world and quests and locations, and Last of Us was like I'm what what is happening with this Ishmail story? You know what I mean? I'm going to explore every corner; I'm going to get every bandage.",
            "start": 4314.6
        },
        {
            "text": "open world and quests and locations and last defic → open-world and quests and locations and Last of Us\nit was like I'm what what is happening with this ishmail story you know what I mean I'm going to explore every corner I'm going to get every bandage I'm G to get every bottle and Rag and everything else I need to make this awesome thing → it's like, I'm going to explore every corner, get every bandage, get every bottle and rag, and everything else I need to make this awesome thing\nyeah The Last of Us is great too Last of Us is amazing um just two great games recommend them both I don't know that you yeah you're right in this sense that it's hard to compare and contrast them but I think the last of us wins I agree and that's the whole thing is but it's like for me it was that thing of like and like wait well very it's a conversation worth having yeah they're very thought-provoking yeah → yeah, The Last of Us is great too; it's amazing. Just two great games, recommend them both. I don't know, you're right in this sense, it's hard to compare and contrast them, but I think the Last of Us wins. I agree, and that's the whole thing is... but it's like for me, it was that thing of like, and like wait, well, very... it's a conversation worth having; yeah, they're very thought-provoking\nall right well thank you the informationist → all right, well, thank you, The Informationist\nI always think I'm gonna screw that name up because it just it's a weird name it is a weird name it is a weird name Colin reader mail okay Mom mail pattern baldness mail order bride mail man uh I'm going to give you choices of course ladies and gentlemen → I always think I'm gonna screw that name up, because it's just... it's a weird name. It is a weird name. Colin, reader mail: okay, mom mail, pattern baldness, mail-order bride, mailman... uh, I'm going to give you choices, of course, ladies and gentlemen",
            "start": 4351.16
        },
        {
            "text": "just it's a weird name it is a weird name it is a weird name Colin reader mail okay Mom mail pattern baldness mail order bride mail man uh I'm going to give you choices of course ladies and gentlemen we need you to be part of the show go to kindafunny.com PS Q leave your questions comments and concerns so here come some of your choices all right podcast I'm gonna do that one because I know you won't pick it so I'll get to that one later we do it now okay fine do it now first question comes from Puki or Purui maybe Puki no it's Ducci right Ducci Puchi yeah Puchi Puchi says I usually try to immerse myself in the game I'm currently playing but there are some games that I found can be enjoyed while listening to your podcast recent games like Rogue Legacy, Zenith Drifter and Destiny have provided me with plenty of time to combine gaming with the podcast time are there any games that you like to play while listening to a show or podcast or give you a chance to talk on the phone chat with your",
            "start": 4387.76
        },
        {
            "text": "me with plenty of time to combine gaming with the podcast time are there any games that you like to play while listening to a show or podcast or give you a chance to talk on the phone chat with your friends or parents or so on and such this is Puchi says PS I love you even though I graduated from Kansas and Greg likely hates me I don't hate you I'm just sorry for the Life Choices make I'm disappointed in you and I hope that like the kid you and your sister had turn out okay um so now you don't listen to podcast period really no I listen a lot of music I listen to podcasts but do you so then let's start there do you ever listen do you ever put on music when you're listening oh yeah a lot okay um I think it I mean what came to mind me for me immediately and I think a lot of JRPG fans can excuse me I have a take-up I'm burping I'm just burping Pi up and a burp yeah it's awful an awful thing that burrito's coming back to get you um glad we got him though me too pound it out oh we will",
            "start": 4439.32
        },
        {
            "text": "me, I have a take-up, I'm burping, I'm just burping, Pi up, and a burp, yeah it's awful, an awful thing that Burrito's coming back to get you, um glad we got him though me too, pound it out, oh we will, we're going to pound it there and I'm going to pound you later, uh, JRPG fans can relate to the grind and and um so during story missions where I'm in a dungeon the first time or you know in a town or talking to people I obviously not I'll be listening but when I'm spending two or three hours because I need x amount of money or I need to I want to level up my characters to a certain level whatever that's like mind-numbing **** and um that's when I listen to I'll listen to politics or yeah I'll listen to music or I'll listen to a political show, yeah, yeah, um because I guess it's a little disingenuous for me to I don't listen to pod a podcast I don't MH but I do listen to PTI and around the horn on iTunes like almost every day and those are shows encapsulated in a podcast form and I do listen to",
            "start": 4482.24
        },
        {
            "text": "for me to i don't listen to pod a podcast i don't mH but i do listen to PTI and around the horn on iTunes like almost every day and those are shows encapsulated in a podcast form and i do listen to a **** ton of political stuff usually with like real real clear politics or media I or something like that where um they have you know they're like here's all the **** people said today in video format like three four five minute Clips like 10 of them i i watch those like every day so i am consuming that sort of media i just don't go and um seek out like a you know anything i'd rather read um then listen to podcast i mean for me when this question popped up and i read it i immediately jumped back to if you remember when i like first when not when i first moved in but when you're still doing Washington's beard right you guys would do Washington's beard and i would come out and be in the middle of i remember grinding out in Skyrim to do the exploit to get my stealth up and then ****",
            "start": 4521.36
        },
        {
            "text": "Washington's beard right, you guys would do Washington's beard and I would come out and be in the middle of. I remember grinding out in Skyrim to do the exploit to get my stealth up and then Kingdoms of Amalur Reckoning out there playing that non-stop and that story was just such nonsense that I had it on mute and I would listen to you guys' podcast, but then I would be listening to This American Life. Uh, now nowadays when I do like when I do DC Universe stuff for some for me it's the giant like you're talking about it's grindy stuff it's the Giant open world RPG somehow you know and that's what Fallout I'm super stoked about again where it's eventually going to get down to cross the Wasteland and kill this guy and bring me back these like okay cool and I'm going to put on Death, Sex & Money I'm going to put on American Life I'm going to put on you know I'm going to play all these shows that I love and The Moth and really haven't listened to a lot lately because I've been playing so",
            "start": 4563.88
        },
        {
            "text": "I'm going to put on American Life, I'm going to put on you know, I'm going to play all these shows that I love, and The Moth, and really haven't listened to a lot lately because I've been playing so many games that are like Metal Gear, like right, I need to hear it, or at least I want to hear where people are going to be and what's happening and be like aware of my surroundings, whereas in those games Fallout and stuff, I'm just going to be able to roam around and kill everything and do whatever the hell I want. Oh my God, I can't wait, it's going, I can't wait, yeah, I, I can't, I've been looking at PSN profiles on Exophase every day waiting for the trophies to pop, yeah, um, I can't, I can't, I can't wait, yeah, it's great, I just can't wait. I don't know what else to say about that. All right now you get your picks, you ready? Okay, rewards for earning Platinum trophies, Vita memory cards or Tail's V memory cards. Paul G writes in and says hi guys, hello, do you think they will ever make 128 GB or more Vita memory cards?",
            "start": 4599.44
        },
        {
            "text": "picks you ready okay rewards for earning Platinum trophies Vita memory cards or tails V memory cards Paul G writes in and says hi guys hello do you think they will ever make 128 GB or more Vita memory card ever bring the 64 GB officially to North America at a lower price I hope or should I just stop waiting bite the bullet and import XOXO apology I'm a little surprised that the 64 gig hasn't come out here yet you could import it I'm not sure that they have any intentions of bringing that over I don't think I don't think either of those things are going to happen yeah I definitely don't think there's going to be 128 GB Vita memory card can they probably charge $8,000 for it um so yeah no I Paul and she sends a lot of questions in though so I feel bad that the other two were cut off so let's let's talk about Tales real quick especially because you're a Tales expert as well ah yes I am thank you very much um I have good news this is the daily double is it him too no oh I",
            "start": 4631.6
        },
        {
            "text": "Cut off, so let's let's talk about Tales real quick especially because you're a Tales expert as well. Ah yes I am, thank you very much. Um, I have good news - this is the daily double, is it him too? No, oh I was gonna say no, no, no. It's Two Tales questions there's two Tales questions here. Speech says, \"Hey Colin and Greg, my question kind of goes along with Colin's future thoughts on Tales of Berseria\" (not Hysteria, which is a different game in the series). How similar do you think the stories and Tales games are at this point was brought up in the past I started thinking about it more and I kind of find it true. He so he's asking you how similar are the stories? They're pretty similar - the I mean JRPG tropes are almost unescapable in Japanese roleplay games, so you're going to have the hero and you know like a very archetypical story for instance the the young man maybe he has amnesia. Of course he has amnesia. He meets a cute girl who can actually hold her own - she's from a village maybe the village needs help then the apocalypse is coming and you have to",
            "start": 4677.08
        },
        {
            "text": "man maybe he has amnesia of course he has amnesia he meets a cute girl who can actually hold her own she's from a village maybe the village needs help then the apocalypse is coming and you have to save everyone else and all and suddenly you meet a mysterious man and like is he your friend or Foe yeah and like he joins your party eventually and like Vincent in Final Fantasy VII um so yeah I mean Tales games are all made by the same people so I think that there's just a lot of inspiration for them I'd like for some of the games to be different I think that Xillia story in particular was a little bit different um and the fact that you had like two different playable characters I thought was pretty cool with like two different arcs through the game um but that was probably hard and they didn't do that again Zestiria is a different kind of game because it's it's very open it's a very open world game compared to other Tales games have always been nonlinear but they've not often introduced like a",
            "start": 4718.36
        },
        {
            "text": "that again Zeria is a different kind of game because it's it's very open it's a very open world game compared to other Tales games have always been nonlinear but they've not often introduced like a vast world map as opposed to um dungeons that all connect to each other so like an outdoor area connects to the town the town splits into two paths and one goes to another outdoor area another one goes to a cave and stuff like that that's not the way it is anymore in Tales of Zestiria so I think that it was more the format of the game that they changed up than the story but to answer the question for people that did not play them because I get this question a lot the Tales games are not interconnected storywise you can jump in any one of them as long as you're not playing a a direct sequel like Tales of Destiny 2 or Xillia I mean you're you're going to be fine those those games are connected obviously okay and then your daily double your next piece of Tales comes from Nixon's paranoia hey guys first loving",
            "start": 4758.32
        },
        {
            "text": "2 or Xillia, I mean you're you're going to be fine those those games are connected obviously okay and then your daily double your next piece of tales comes from Nixon's paranoia hey guys first loving this podcast so far my question is more for Colin I know you're a huge fan of Tales games well not as big as Greg I know I'm the Tales expert first what is your favorite Tales game Destiny why uh well it was my first one but I also think the um it was still one that had that cute chibi style it was more focused on gameplay the Arts I think and the um that kind of you know one of the hallmarks of the series is the fighting mechanics um and I think that it was pretty pure at that point still I think it got a little complicated later on when we entered a 3D kind of field I think the character is the best I love Stan I think he's a great character um the music's fantastic I think it's a super moody game um Tales of Destiny is like by far my favorite M okay and so that's also like one of",
            "start": 4792.2
        },
        {
            "text": "best I love Stan I think he's a great character um the music's fantastic I think it's a super moody game um Tales of Destiny is like by far my favorite M okay and so that's also like one of my favorite games of all time really I know Nixon's paranoia continues and says my favorite is Aselia which unfortunately was never localized for the West for PS3 yeah that was weird that they did that do you think that there's any chance of a PS4 remaster of that game since Bandai Namco has been releasing or re-releasing previous Tales games on new systems lately Symphonia PS3 PC Abyss 3DS Etc PS I kind of heart you XOXO It's possible I was surprised if Aselia never saw the light of day out here uh it was on Xbox 360 which was weird and that was another one of Microsoft's moves to try to get people to buy an Xbox 360 in Japan it failed so badly over there presumably that they actually did port it to PS3 um but uh I would I be surprised if they did that yes and no I I'm surprised",
            "start": 4832.88
        },
        {
            "text": "to get people to buy an Xbox 360 in Japan, it failed so badly over there presumably that they actually did port it to PS3. Um, but I would be surprised if they did that, yes and no, I'm surprised that they haven't gone back even to Tales of Symphonia and Destiny and Legendia and all those and just put them on a disc and release them with trophies. But uh, it might not be worth their while to do that. Vasia is a huge gaping hole though in a lot of people's Tales of Arc because of the weirdness of the consoles. Gray Fox wrote in Kinda Funny.com PSQ, \"That's right, go to that link, go to our forums, register and leave us questions for the show.\" Gr Fox says, \"Greetings Colin Greg, hello. I like to think of Bethesda as the kind of funny of game developers. They produce amazing content and subscribe to the garbage truck on fire business model. I love their games but they are buggy as **** especially on consoles. Do you think Fallout 4 will continue this trend and do you think it's fair that\"",
            "start": 4873.96
        },
        {
            "text": "To the garbage truck on fire business model, I love their games but they are buggy as heck especially on consoles. Do you think Fallout 4 will continue this trend? And do you think it's fair that Bethesda gets so much of a free pass as it does? PS I Love You guys are all right, I guess. I don't think they get a free pass; I think that they - and I don't know if you agree - but I believe that their free pass went out the window with Skyrim on PS3, especially um, and do I think that their game so there's multiple questions here: will Fallout 4 be as buggy as old Fallout games? No, no. Um, it won't uh, will it be buggy? Yes. Will there be weird things involved in it? Yes. Do I think that they get a free pass? No. Do I think their games are way more complicated than most games? Yes. And I think that's where the free pass mentality comes in - you only have to look at the bug reports of New Vegas and Fallout 3 to see how completely mundane some of the **** things are that are broken, and like how would",
            "start": 4917.48
        },
        {
            "text": "The free pass mentality comes in. You only have to look at the bug reports of Fallout: New Vegas and The Elder Scrolls V: Skyrim to see how completely mundane some of the things are that are broken, and like, how would you ever know? Yeah, when you have all of these interconnected things happening, like literally leaving a door open somewhere can break your game. Like or for Skyrim, yeah exactly. Um, you have the QA test. What I'm really impressed with is the game as I predicted was in development for a long time and it was ready to be released this year, and we talked about that, and you know K was right, and all that, but that's not the point. The point is, what I'm impressed with is that the game was feature-complete by the time they announced it, pretty much it was done, and they've been polishing and all that kind of stuff, which was another prediction of mine. I was like, the game is probably done. Yeah, they had people in Bethesda presumably QA that game for a long time and so.",
            "start": 4958.48
        },
        {
            "text": "been polishing and all that kind of stuff which was another prediction of mine I was like the game is probably done yeah they had people in Bethesda presumably QA that game for a long time and so the first thing I'm impressed with is that people are playing this game and never said a **** peep about it probably because they would have been **** ruined yeah but beyond that they play the game in ways that are queuing a game is not easy and it's hard enough to QA game a linear game like The Last of Us walking in every corner just trying to break it imagine a situation where you have an open world nonlinear Quest structure things you don't even have to do people you don't have to meet you can kill every everyone you encounter you can drop all of your loot and run around naked you can do whatever you want yeah there is Limitless permutations between everything and the example I always use is I used in the past is with New Vegas when I had the old cowboy hat there's only two of them in",
            "start": 5000.24
        },
        {
            "text": "you want yeah there is limitless permutations between everything and the example I always use is I used in the past is with New Vegas when I had the old cowboy hat there's only two of them in the game and if you wore an old cowboy hat some it went something along the lines if you wore the old cowboy hat onto the Vegas Strip that was it yeah then you always had to wear it to the strip and you could conceivably break it or lose it and there's only two of them in the game and it permanently breaks the game but no one encountered that so they didn't fix it until there was a patch that fixed it yeah and that's the kind of problems you deal with when your game spiders out into this butterfly effect the likes of which few games maybe no game has ever really done before I do think Fallout 4 in terms of its ambition will probably be one of the most ambitious Western role playing games we've ever seen if not the most ambitious in terms of quest structure the way the characters interact with each other",
            "start": 5037.48
        },
        {
            "text": "ambition will probably be one of the most ambitious Western role-playing games we've ever seen, if not the most ambitious, in terms of quest structure, the way characters interact with each other, the way you interact with the world, your karma - there's a million things that can go wrong in those games. So the fact that they're now doing all these different things... Yeah, exactly. The fact that I've said this before, and I do give them credit - although I don't want to give them a pass; I don't like giving developers passes, and I'm not giving them a pass. Anyone who's listened to the podcast Beyond or was at E3 when Skyrim came out on PS3 knows that I gave them the antithesis of a pass on that game. I really went at them for that game because I thought it was inexcusable that they released that game in that state, but it's amazing the game runs at all - that's the point I'm trying to make, and see that's where I think the PS4 comes in right now this",
            "start": 5073.92
        },
        {
            "text": "they they released that game in that state but it's it's amazing the game runs at all like that's the point I'm trying to make and see that's where I think the P comes in right this and because this is always the thing you're talking about vote with your wallets we talked about this I think last week on this show right and and people had more questions about it but we've already addressed it unlike why you're supporting Fallout 4 but we're mad at Skyrim right or whatever and your argument last time was different franchises yeah different franchises and and I I've had good experience with like I didn't play anymore Skyrim I never went back to it that was my that was me taking a stand against Skyrim I mean that was that was I mean that was I know you think it's another another thing entirely but it was kind of that was the nail in the coffin though you had already taken a break from Skyrim yeah we're kind of over it but you might have come back and then that happened you were done",
            "start": 5104.76
        },
        {
            "text": "but it was kind of that was the nail in the coffin though you had already taken a break from Skyrim yeah we're kinda over it but you might have come back and then that happened you were done yeah and I was like I was just I mean I know that's you know seems like an unlikely story to you but that was no it's not unlikely I'm I the unlikely story is when you're like I never was going to play it again I'm never going to play this game till they fix it yeah they did fix it apparently but I never did go um the point is that they did fix the game uh there was some poor communication going on in my opinion with the the way that there was some poor communication going on maybe not shady in poor communication poor communication it's not shady it was it was just poor communication they have it's a heavy lift for marketing and PR and the developers putting you know the sheen on the game and so like that's complicated but um I'm excited about Fallout 4 because I **** love Fallout and I'll tell you what",
            "start": 5142.72
        },
        {
            "text": "for marketing and PR, and the developers putting you know the sheen on the game, and so like that's complicated, but um I'm excited about Fallout 4 because I **love** Fallout, and I'll tell you what, Fallout 3 ran fine on PS3, so um you know it's the same team, different games, different franchise, and Skyrim for the development period might have been a little too ambitious for PS3, I mean it was just based on that cell architecture that split 256 megabyte architecture for for running the game, I mean it just wasn't enough, I think the thing is again it's why and I'm quoting the free pass right because I don't think they get a free pass, I think they you can look back but the reason I think you're more not you we journalist the echo chamber of video games is more forgiving on it is the fact that yeah the games are so huge and yeah there's justifications to the problems they've run into, is it an excuse no but yeah the PS3 sucked, the PS3 sucked for what they were trying to do, and they they",
            "start": 5178.0
        },
        {
            "text": "The games are so huge, and yeah there's justifications to the problems they've run into. Is it an excuse? No, but yeah the PS3 sucked. The PS3 sucked for what they were trying to do. And they they what were they going to do? They can't have Sony going and change the inner workings. They can't you know reallocate the RAM or whatever. Maybe they may have not wanted to release the game at all on the PS3, but I don't know if that was an option for them. You know it's probably not an option would have been a really bad luck for them. So yeah um It's Complicated. I hear what you're saying. Is there a little bit of hypocrisy? Maybe you know maybe sometimes I can understand being so overwhelming excited about things that you ignore the problems of the previous thing. I get that. I mean that was what we were talking about with Mass Effect. It's for me it's like I expect to play it and have it crash. I mean I'm expecting this. I know I have to run multiple saves. I know I have to back my saves up to the cloud and keep",
            "start": 5217.72
        },
        {
            "text": "with Mass Effect, it's for me, it's like I expect to play it and have it crash. I mean, I'm expecting this. I know I have to run multiple saves. I know I have to back my saves up to the cloud and keep them on you know what I mean? Like I'm aware of all that. But I'm also aware of how much fun I have in these games. And I'm also aware, I could sit and wait for the Game of the Year Edition. This is where it comes down to the vote with your wallet business. I know what I'm getting into, just like with the Batman DLC. I knew what I was getting into, you know what I mean? Like I'm ready to give them my money for this experience, knowing full well that maybe 50 hours in something goes horribly wrong. Yeah, and I, I, I think that people just have to look at the grander picture, think about Fallout 3 or New Vegas, and think about what we know about Fallout 4 and what we assume Fallout 4 is going to be. There's a game there's no game of that breadth or that ambition being released, and so your expectations for it",
            "start": 5251.08
        },
        {
            "text": "and think about what we know about Fallout 4 and what we assume Fallout 4 is going to be there's a game, there's no game of that breadth or that ambition being released and so your expectations for it should be a little different in my opinion like there's compartmentalized vast Western role playing games like uh like Mass Effect where you have your you know the Normandy you can go through all these systems go to land on these planets and go to the go to The Citadel and and do all the missions stuff like that but everything's separate it's all compartmentalized and everything works as a component so they work together when they put them together Fallout is not built like that at all, Fallout you are you play the game and you never leave the world in a conversation when you're looting something when you're walking around and just going in and out of buildings when you're uh accepting missions when you're killing people when you're failing missions when like it all is within the same",
            "start": 5284.76
        },
        {
            "text": "when you're walking around and just going in and out of buildings when you're uh accepting missions when you're killing people when you're failing missions when like it all is within the same parameters of the same world and it's just different game a g I will say it again it is an impressive feat that that game works considering all the **** up things that can be broken and I'm sure if you sat down with Pete Hines or Todd Howard and were able to really talk to them on the record about things and had an interesting conversation with them about you know like what were some of the things that were broken like when the game was feature complete and you sent it to QA and you just started to really get down to the nitty gritty and polish it they'd probably have incredibly funny stories about the things that were broken yeah yeah you know just different combinations of stuff at 12:00 at night on a Thursday for some reason deathclaw spawned like all over the place we had no idea",
            "start": 5321.8
        },
        {
            "text": "about the things that were broken yeah yeah you know just different combinations of socks at 12:00 at night on a Thursday for some reason Deathclaw spawned like all over the place we had no idea why we had to fix it like **** like that I'm not saying that's one of things I'm sure the **** that was popping up when they were playing the game was so outrageous and and common and you slowly get rid of those things and play and play and play and then you don't run into anything anymore and then you have to kind of just put it out into the world knowing that the permutations of things that are going to have to happen to fix everything is going to have to happen later that's the unfortunate and it is an unfortunate reality of a game like that it is not a linear if The Last of Us was broken like that it would have been unacceptable right there's only so many things that could be going on in the game at one time but not in not in Fallout where you can kill everyone what weapon is your",
            "start": 5354.36
        },
        {
            "text": "like that it would have been unacceptable right there's only so many things that could be going on in the game at one time, but not in not in Fallout where you can kill everyone. What weapon is your weapon? It's your choice. What are you carrying on your body right now? It's your choice. What's your what when you get to this point in the game when you're dealing with this thing and this Crossing? What is your actual what can you what weight can you carry totally depends, you know what I mean like exactly wildly different. Oh it's a it's a Tuesday at 7 you have this Quest active and a small gun equipped the game crashes we have no idea why the game just crashes okay we have to go into the code fix that and they fix it yeah I'm telling you **** like that happens and there's no Rhyme or Reason to it, that's and that's why these games take a long time to make and that's why it's complicated to fix them and so I think I understand what they're saying but I do think that we have to judge I do",
            "start": 5389.48
        },
        {
            "text": "to it that's and that's why these games take a long time to make and that's why it's complicated to fix them and so I think I understand what they're saying but I do think that we have to judge I do think it's important to judge different games based on different things I was not mad that Skyrim didn't work on PS3 in terms of the game I was mad that the PS3 wouldn't run the game that they made based on on RAM allocation and that's everyone's fault but I wasn't the game wasn't the game on Xbox 360 PC worked yeah so it's not that it's something a little different we'll see what happens with Fallout 4 I have every confidence that they've ironed it out they have all the time in the world to work on I mean they've been working on that game for years so you know I've never been happier to been right about something like than that game sure it's ready this table cannot take this is just Nike table you cannot be Kate karate chopping it all right fair enough thank you Señor Oro says hey Colin",
            "start": 5428.2
        },
        {
            "text": "right about something like than that game sure it's ready this table cannot take this is just Nikea table you cannot be Kate karate chopping it all right fair enough thank you Señor Oro says hey Colin and Greg hello you said before that we as Gamers need to speak with our wallets and refuse to buy optional DLC does this include when the price is dropped or there is a cheaper Game of the Year Edition since I first listened to YouTube from podcast beyond I've been holding off on day one prices and wait for sales or Price drops now rip that is not the point anyone has ever driven home on these shows it's vote with the wallet meaning buy what you want to buy but then don't **** about the ramifications of it don't buy microtransactions or Day One deals and then complain about how horrible microtransactions in day one DLC is yeah I was going to say that's that's taking out of context of the things we've said if you want to buy first of all you should buy full price games if you like",
            "start": 5471.96
        },
        {
            "text": "microtransactions in day one DLC is yeah I was going to say that's taking out of context of the things we've said if you want to buy first of all you should buy full price games if you like if you're excited about the developer support the publisher I mean that's when they're making the most money and that's I think that's an important component of what he's saying I think that waiting in perpetuity for Price drops is fiscally sound and and it's your prerogative do what you want buy used games buy cheap games do what you want but you also want to make take the time when you can when you can financially do it and it's not going to be every time probably to make sure to reward Studio X and publisher y if you like what they do yeah exactly by paying $60 for the game the DLC situation is different day one DLC is not that unsavory to me depending I was talking about someone about Uncharted 4 they brought up an interesting point that could is it possible that all",
            "start": 5515.64
        },
        {
            "text": "is different day one DLC is not that unsavory to me depending I was talking about someone about Uncharted 4: A Thief's End they brought up an interesting point that could is it possible that all because I was talking about Nolan North just finishing his map and they're like is that possible that his MoC could be for DLC and I'm like that's possible but if so that's **** you know I mean like that's the the the studio can do many things at one time but finish the game and then worry about the DLC I mean that's my very simple I my ignorant take on it would be yeah that would be I would be I would agree with you that argument if the game does get delayed again and that was one of the things that if they could have had more people if I understand you understand too how long it takes for all that **** to roll out if it needs to be that like they're you know Neil Druckmann and his team are working through these scenes in the map and now he's officially done with it great because that's still a month's worth of work where they go",
            "start": 5547.6
        },
        {
            "text": "out if it needs to be that like they're you know Neil and him are working through these scenes in a map and now he's officially done with it great because that's still a month of work where they go through and animate the faces and do all the different stuff yeah I mean that's that's way I'm looking at it is admittedly very reductive in the sense that it could have just been Nolan North isn't available after November in perpetuity he just never available he's doing his new series now something like alright we we have to write this and and it's written so let's just do it um and then we can just give the map to the animators and worry about it later you know yeah so it's possible anything's possible the point was made though that the map distance between the game's release date and the last map of The Last of Us was identical which is a fair point oh interesting Colin let's do two more questions okay I'm going to talk to you or you get to pick all right I'm going to talk to you cuz I",
            "start": 5587.56
        },
        {
            "text": "Last map of The Last of Us was identical, which is a fair point. Oh interesting, Colin. Let's do two more questions. Okay, I'm going to talk to you or you get to pick all right? I'm going to talk to you cuz I cuz I I know what they are all right. Rewarding for platinum trophies, Console Wars AO-rated games - you pick one of those for the next Console Wars. This comes from, of course, Kinda Funny.com/PSQ where you can go leave your questions. This is Silent Storm: The Book. Console Wars describes how the fall of Sega was largely due to Sega of Japan's inability to innovate and capitalize on its American counterparts' success. Do you agree with this? And do you think Sony has the same problems today? I agree with that, yeah. Do I think that? I mean Blake Harris is very comprehensive; looks great, go pick up Console Wars... um but do I think that Sony has the same problem? No, definitely actually not. I it's one of those where I think Sony more than ever, especially with PlayStation 4, is listening to the American",
            "start": 5620.76
        },
        {
            "text": "War um but do I think that Sony has the same problem, no definitely actually not. I think it's one of those where I think Sony more than ever, especially with PlayStation 4, is listening to the American counterparts and doing these things right. 85% of their studios are Western. Yeah, so if you think that they - and I mean very it's it's really somewhat rare for a game to come out of Japan, you know when you really think about it. I mean let me open the let me open the the um the PlayStation blog again and uh go to the drop written by Ryan Clancy. Hey Ryan how you doing at Palm Cider everybody wish and well I could be right or I could be wrong based on I may be right all right where is it here it is no that's not it where drop there it is um so Alien: Isolation coming out, it's a western game. Arcade Archives isn't really a release but that's a game Darksiders is a western game Divinity is a western game Minecraft is a western game MX vs ATV is a western game",
            "start": 5673.2
        },
        {
            "text": "Archives isn't really a release, but that's a game. Darksiders is a western game. Divinity is a western game. Mega Coin Squad is a western game. Minecraft is a western game. MX vs ATV is a western game. River City: Tokyo Rumble is the PS3 Allstar special game, that's a Japanese game. Tecmo Deception is a PS1 classic, that's a Japanese game. Trails in the Sky is a Japanese game. WWE 2K16 is an American game. The thing, the thing you realize about all those games of all the games on current consoles are all Western games. MH so Sony makes great games out of Japan and funds great games out of Japan, Bloodborne for instance. Um, the cult classic Knack came out of Studio Japan but um, and they work with their Japanese partner Square Enix etc you know um to get you know games out but I don't think they suffer from the same problem and that they're not as an insular company they did it seems like everything does run through Sony Japan but they have people that they listen to all over the place and if they didn't.",
            "start": 5720.88
        },
        {
            "text": "same problem and that they're not as insular a company, they did it seems like everything does run through Sony Japan but they have people that they listen to all over the place and if they didn't listen to them they would have never identified Naughty Dog or Media Molecule, all these studios that are really kind of big, I mean even bigger than that, I mean what we're talking about with the PlayStation 4 right now, and and I mean this the the amount of power and goodwill they have with gamers right now you know what I mean like I don't think Sony of Japan, this comes from somebody who covered it for eight years right in PlayStation in general would have been down on the PlayStation 3 generation with Adam Boy and Shu doing a video on how to share games that's totally just a jab or let Shu be as expressive on Twitter as he is now you know what I mean like there's all these things that I feel like our Western traits that are are the Western people saying hey guys look at what's",
            "start": 5767.0
        },
        {
            "text": "shu is as expressive on Twitter as he is now, you know what I mean? Like there's all these things that I feel like our Western traits that are, are the Western people saying hey guys look at what's happening here this is how it's going we need to talk about that Geo Cory and everything those guys are doing is you know what I mean? Like yeah no I agree there's a lot of things happening and I mean outside of gamer releases where you feel I think for the first time in a long time that it is Sony Computer Entertainment America has a say and part of it and it's talking and getting listened to more than ever on big things. Yeah, I don't think that they suffer from the same problems no I think Sony's in a much better position than Sega frankly ever was yeah um even with Genesis um well I don't want to spoil the book you should read the book you've read it obviously but other people should read it read the book all right Colin your final question dual shock Force touchpad turning off",
            "start": 5800.68
        },
        {
            "text": "don't want to spoil the book you should read the book you've read it obviously but other people should read it read the book all right Colin your final question DualShock Force touchpad turning off multiplayer servers rewarding players for platinum trophies you keep saying that one but I don't want to read it that's fine I'm just I'm looking through and I'm like I don't want to end on a couple shutting down multiplayer servers sounds like an interesting one you didn't think I was going to select that one I I mean I wouldn't have I mean I thought it was possible well you didn't think it you didn't think it was even probable okay go everybody to KindaFunny.com/PSQ to ask your question just like confusing faded you there sir I request a resolution to this predicament at what point is it acceptable for developer/publisher to turn off multiplayer servers sending long forgotten games into the abyss forever sneaking it in also Telltale DC Universe why has no one thought of this make it so",
            "start": 5837.04
        },
        {
            "text": "for developer/publisher to turn off multiplayer servers sending long forgotten games into the abyss forever sneaking it in also Telltale DC Universe why has no one thought of this make it so Cheerio confusing Buffet now confusing Buffet you're clearly confused people have thought of Telltale DC Universe and that's why there's Telltale Marvel Universe Telltale has signed a deal with Marvel to make video games they will be coming I think in 2016 was Ann M but it was I'm sure they'll be extremely different from all the other series they make I think there'll be there'll be more action you'll be punching more things not like in instantaneously be like do you want to punch him or do you want to webon do you want to punch him or oh there goes your game save um so uh I'm only kidding they're not they're not that bad anymore and it's still anecdotal I've not played a Telltale Game since Walking Dead Season one I'm just busting balls um Case by case basis I mean I I think that if the game I'm",
            "start": 5879.04
        },
        {
            "text": "they're not that bad anymore and it's still anecdotal i've not played a Telltale Game since Walking Dead Season One. I'm just busting balls, um, case by case basis. I mean, I think that if the game I'm sure there's some sort of algorithm or money being made, or that's my question: do you think it the problem? I think it comes down to it's got to be money; it's all about how much you're making, and this is where microtransactions stop being a bad word, you know what I mean. Because stick with me, DC Universe - I love DC Universe right when they went free to play and then put in microtransactions and put in subscription plans. I continue to play for my subscription plan so that when I want to play it, it's there and I can play it because I understand that to keep the servers running and keep making people content even if it's just the core audience that I'm on the outskirts of right but the people who play and raid every week or whatever if they're doing it",
            "start": 5919.28
        },
        {
            "text": "running and keep making content even if it's just for the core audience, like me who's on the outskirts of it. But the people who play and raid every week or whatever, if they're doing it and supporting the ecosystem and keeping it going, that it doesn't have to be a huge player base. It's similar to Kinda Funny, right? Like, we don't have a million subs on YouTube, and we don't need it. Because if you go to Patreon and you watch what happens, and like what the 10,000 people give us, they give us enough to live and keep this going and grow this as we go, and hopefully more people come in and we keep going. But like, if it shrunk that'd be a different thing, if there wasn't money coming in. That's the problem. Yeah, it's just a financial situation. I don't think they have a duty to the gamer to go as long as possible. Ultimately, if they see you know a few hundred people on a",
            "start": 5956.08
        },
        {
            "text": "yeah it's just a financial situation I don't think that I think they they their their duty to the gamer is to go as long as possible but ultimately if they see you know a few hundred people on a server at any given time it's probably not worth keeping it open yeah exactly and unfortunately it does just kill games like you know I remember when White Knight Chronicles went down I think MAG went down other games that people still played and they couldn't play anymore remember White Knight Chronicles was an especially big deal because I think the Platinum is like unachievable now and that's a bigger that's a bigger question is to like how it affects single player experiences and trophies and all that kind of stuff I don't like that again if we had our trophy consulting bus we would build in fail saves so that okay you're going off when you go offline you have to automatically give those trophies anybody who signs in cuz that would really help me with my Ghostbusters Platinum because I'll",
            "start": 5991.24
        },
        {
            "text": "saves so that okay you're going off when you go offline you have to automatically give those trophies anybody who signs in cuz that would really help me with my Ghostbusters Platinum because I'll never be able to get it and also it was a **** Platinum so whatever but yeah go on there and get all these randomly generated go come on man just you know had to print a checklist off the internet and go no thank you nobody got no Colin yes it's time for a segment we call this week's forgotten PlayStation game it's your turn to pick is it my turn I forgot um well it's no I mean it's it's it's it's fine because I knew I knew what next game I want to talk about I want to stick with Axiom Verge, will and large will large but lot of people don't give Axiom Verge a lot of love um anymore it was It was supposed to be a launch Vita game it came out a few weeks after Vita came out I remember I stayed home and reviewed it um fantastic game I think it uses the Vita very cleverly you can play it on",
            "start": 6024.08
        },
        {
            "text": "It was supposed to be a launch Vita game, it came out a few weeks after Vita came out, I remember I stayed home and reviewed it, um fantastic game, I think it uses the Vita very cleverly, you can play it on PS4 now, different control scheme, I think the game's very cute, uh fun bits interactive has some cute ideas, I mean know that's the remnants of the Fat Princess team, yep, um the original Fat Princess team, I mean there is a Fat Princess game coming out still but but it's not Fat Princess, um so uh I want to recommend Escape Plan, I think that's a great Vita game and you can also play it on PS4 so you can get the best of both worlds, I think it's actually Cross- Buy but you should look into that before buying it to make sure, uh let me know what you think, um black and white aesthetic, it's a very self-aware game, it's very silly, it's a it's more of a puzzle Adventure type game which is not really my thing but yeah, um I was really uh quite enamored with uh the characters and the Collectibles and the world",
            "start": 6064.72
        },
        {
            "text": "game it's very silly it's a it's more of a puzzle Adventure type game which is not really my thing but yeah um I was really uh quite enamored with uh the characters and the Collectibles and the world and the villain's really funny little and large are funny the one thing I really love about them is that you die the more you die the numberers that of times you died like is is the number like like their Jersey basically it's cool it's a really a cute game all right there you go ladies skape plan it is ladies and gentlemen this has been PS I Love You XOXO episode 5 thank you so much for joining us remember this was the pre Paris games week am I saying that right mhm weak that's how you say it over there it's not how do you say week in French or French France uh Palms the tear Paris games Palms DET tear this is the pre Paris games week Palm DET tear uh we will be doing one today the Tuesday that we post this caping you up on everything that happened at Paris games week so if you finish this",
            "start": 6102.4
        },
        {
            "text": "DET tear this is the pre Paris Games Week, DET tear uh we will be doing one today, the Tuesday that we post this, capping you up on everything that happened at Paris Games Week so if you finish this episode get ready for another it should already be there just go in it's probably there on iTunes already.com AR got vert all right you're smiling too much it's green bean is it yeah oh okay got zores ah remember ladies and gentlemen PS I Love You XOXO is a product of Kinda Funny.com it's fun doing the show each and every Tuesday for you at 9:00 am, posting it on iTunes and youtube.com/KindaFunnyGames but KindaFunny.com Keeps the Lights On so go over there watch the videos subscribe to the YouTube channels back us on patreon.com/KindaFunnyGames and if you do it before Wednesday you can come be part of the Q&A that's live and a private live stream for you is if you get $15 or more remember that KindaFunny.com Extra Lifee is no November 7th we'll be playing games for 24 hours you can",
            "start": 6144.16
        },
        {
            "text": "be part of the Q&A that's live and a private live stream for you is if you get $15 or more remember that KindaFunny.com/ExtraLife is on November 7th we'll be playing games for 24 hours you can still go and donate to the team join the team or just get ready to watch it uh remember keep your questions short a lot of you people over on KindaFunny.com writing your goddamn novels if you haven't noticed they don't get read so knock it off somebody's got to put you in your place uh and buy stuff at KindaFunny.com/store we love you all thank you for your support here each in every episode of PS I Love You XOXO ends in a song in a segment we call Singing a Shoe you have a song you want to submit it has to be your song that you've written or performed or whatever go to KindaFunny.com/PSM that's the M for music also remember that I need a SoundCloud link from you something to download the thing and then a YouTube link so I can link you off to a YouTube page give you the",
            "start": 6195.2
        },
        {
            "text": "PSM, that's the M for music also remember that I need a SoundCloud link from you something to download the the thing and then a YouTube link so I can link you off to a YouTube page give you the hits on the YouTube version since I can't play it and then put the audio MP3 on the MP3 this one comes from it's Van Aken but immediately forget that and remember Alaskan Deep, that's the band name. Alaskan Deep says hey everyone I'd like to submit my song Gray, it's part of a three-song EP I released back in May with one of my best friends who plays the drums. I recorded mixed and mastered it all in my living room. The lyrics speak about a person going through horrible times in their lives weathering the storm and coming out the other side. I hope you enjoy, it's Van Akin Alaskan Deep. Ladies and gentlemen if you enjoy it head over to SoundCloud.com/Alasande or you're on the YouTube version click on the little YouTube thing that'll pop up here and you go listen to the song there a live version of",
            "start": 6238.12
        },
        {
            "text": "if you enjoy it head over to soundcloud.com/alasande or you're on the YouTube version click on the little YouTube thing that'll pop up here and you go listen to the song there a live version of it until next time it's been our pleasure to serve you here's Alaska with Grey goodbye",
            "start": 6281.88
        }
    ]
}