{
    "id": 289,
    "video_id": "bQB6OBVDgMw",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Alexis Pence",
        "Colin Moriarty"
    ],
    "title": "Alexis Cozombolidis (Special Guest) - The GameOverGreggy Show Ep. 23",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1400223601,
    "duration": 7511,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to the GameOverGreggy Show I'm one of your hosts Greg Miller alongside the pride of Long Island Colin Moriarty hello hello how are you good real quick uh since we're going to do old Fashions today yeah I just want thanks for R the whole moment sorry I just wanted to give a quick shout out to our friend Eric for spoiling that too sorry there's nothing to spoil Greg I I was at Eric Castro's bar last week so you're basically having nothing to spoil just want to tell Eric thank you for having me at Provisions in San Diego San Diego uh very nice bar Swank bar yeah he was gone he's actually in Kentucky I think attending to some bourbon most likely if you're in Kentucky that's what you're going to be doing probably the one we chose or he was at maybe he was at the uh Kentucky Derby that's also possible that just happened uh but he uh you know uh had me at his bar as people took care of me it was really really nice place nice I like him appr I like the",
            "start": 1.1
        },
        {
            "text": "at the uh Kentucky Derby that's also possible that just happened uh but he uh you know uh had me at his bar as people took care of me it was really really nice place nice I like him appr I like the uh over here the producer Seducer Nick Scarpino I'm going to seduce you with my mind wow that's awesome and then Tim you got better looking no this isn't the pure one Tim Gettys this is the impure one you got shorter and more Charming Kazalis hey Alexis how are you thanks for coming you excited for a show I am so excited you sure yeah all right great of course ladies and gentlemen The GameOverGreggy Show posts all the time every week and what it is is four best friends getting around a table and arguing about how to use the microphones no it's four best Tri things these microphones we come with a random topic of discussion for your amusement if you like that you should like the video you should subscribe to the YouTube Channel over at GameOverGreggy.com each topic gets broken out day by day",
            "start": 38.24
        },
        {
            "text": "a random topic of discussion for your amusement if you like that you should like the video you should subscribe to the YouTube Channel over at GameOverGreggy.com each topic gets broken out day by day until the final show goes up on Friday however that's old news by then because over at GameOverGreggy.bandcamp.com we post the MP3 a week earlier the entire show all of it for $1 you can get it there or you can wait till YouTube when it's all free it's a deal right yeah it's a deal then you can go buy T-shirts over at DistrictLines.com/GameOverGreggy like oh right I'm not wearing one I'm wearing a Radio PlayStation shirt because they were guilting me in the comments about never wearing the shirt they sent me so this is the Radio PlayStation shirt but you should still buy Game Over Greggy ones we continually think about it links are in the description there's something wrong with that shirt do you know what it is it's I think it's what no no it's something wrong with the logo I thought I",
            "start": 84.32
        },
        {
            "text": "we continually think about it links are in the description there's something wrong with that shirt do you know what it is it's I think it's what no no it's something wrong with the logo I thought I thought the logo was a little bit off center the loc the the the PlayStation's not interc yeah I was like oh it's ring I didn't make the shirt you're just taking out you're taking it out on radio PlayStation Now what if they are like IGN is though where they don't give in how something want to be spell infamous wants to be lowercase i lowercase n all capital # Drive Club yeah exactly that's not how people you know you're allowed to do what you want when when when people just making up words I think it's okay sure all right let's get into it right away I'll start Colin yes as you can see we have all the ingredients laid out for oldfashioned yeah sorry to ruin your topic like I didn't mean to do that it's okay I know I love you don't worry it doesn't matter much to me this isn't even your",
            "start": 121.64
        },
        {
            "text": "all the ingredients laid out for old-fashioned, yeah sorry to ruin your topic like I didn't mean to do that it's okay I know I love you don't worry it doesn't matter much to me this isn't even your topic yes it is I mean it has to do with your topic can you just let me take the walk to my topic that's all I want like you taking a really long walk so Eric Castro from Polite Provisions, he's the guy who sent us in all the whiskies we sampled, we chose, we chose, we chose a barrel that'd be a limp wouldn't it just be a limp like one of your feet like you can't feel it yeah cuz you just stood up after sitting down for a long time and you're sort of limping toward the ice box to get the Snickers Frozen ice cream bar, that's what this is like right now okay well I mean you're prolonging it I'm watching this happen now yeah cuz it's just a comedy of errors as they say it's still a spot on I think people are on the edge of their seat right now watching and or listening Eric Caster sent",
            "start": 160.76
        },
        {
            "text": "it I'm watching this happen now yeah cuz it's just a comedy of errors as they say it's still a spot on I think people are on the edge of their seat right now watching and or listening Eric Castner sent us all this stuff so we can make old fashions it took about a year and a half for me to finally make one I did it was delicious we love old fashions so last night I tweeted you know that I was like entering this new stage in my life where I'm I'm full on an adult where I'm making cocktails the way it's supposed to be done I'm I'm an adult now right but this got me thinking in terms of my drinking about the first time I I've come so far since I first started drinking you took a walk I did I took quite a walk you like what I with this one though so now I want to make you Alexis and myself some old fashions here while we do that though I want to hear everybody's story about the first time they went out and drink in this season like we did an episode or two ago we did a whole thing about",
            "start": 196.4
        },
        {
            "text": "Old Fashions here while we do that though I want to hear everybody's story about the first time they went out and drank in this season, like we did an episode or two ago, we did a whole thing about like the worst hangover, the drunkest. We're not talking about like when you raged; I'm talking about when you were a stupid kid and you drank for the first time. What's wrong? Where are all the big ice cubes? Only have three of them there's three in there. We didn't refill it last night after we had three Old Fashioneds. I'll take the little cubes, I'm giving you the good stuff. You need one big ice cube per glass right to make it well. Me and Colin are planning on drinking quite a few Old Fashioneds. See, I see, I've never had an Old Fashioned; I'm excited. I'm excited. I want to say yeah, Poitín is amazing. We're using their recipe from San Diego's Provision. Eric Castro is amazing. They had sent us these stickers. I think it's time we finally announce them as the official bar of The GameOverGreggy Show and and I'm",
            "start": 233.28
        },
        {
            "text": "San Diego we're using their recipe it's amazing Eric Castro is amazing they had sent us these stickers I think it's time we finally announce them as the official bar of the GameOverGreggy Show and and I'm going to leave it to you to adorn the front of the ice bucket sure a a a staple of my gosh I feel I'm so excited to be part of this all we had to do all we had to do is get rid of Tim Gettys and that now do you want do you want a Rye old fashioned or do you want the bourbon old fashioned what's the difference you want the bourbon the bourbon yeah you you're not going to like it Greg loves it it's it's very harsh you can smell the difference SM really harsh well the bourbon the Bulleit bourbon I think is a little bit more um it's smoother the Rye I mean it's like R it's like R bread oh it does not taste like R bread it tastes exactly like liquified Rye bread with pastrami on it bread what is this weird I know you don't need bread you could have just stopped at I don't eat cuz we know you eat I saw you",
            "start": 269.88
        },
        {
            "text": "R. bread it tastes exactly like liquified Ry bread with pastrami on it. What is this weird? I know you don't need bread. You could have just stopped at I don't eat, 'cause we know you eat. I saw you; I literally saw you in the office the other day eating just the exact oatmeal that you had. It was the same oatmeal; it wasn't like you went back and got a different one. You were just having one bite of the oatmeal because you were hosting Daily. No, I saw that too when she was... it took her like no. It's just that I graze on oatmeal isn't something you graze on; that's why you're skinny, right? That is why she's skinny. Yes, that's why. I'm not a doctor; the rest of us see I graze but I graze on everything on the table all at once. Said that like a '50s guy. I'm not a doctor. I'm not a doctor. I'm not a doctor. Over, not a doctor. You sound like a fantastic oh man no and I'm gross; like what does gross mean? Well, because I eat oatmeal throughout the day like it's cold on go out 'cause I'm too lazy to go out.",
            "start": 309.24
        },
        {
            "text": "a doctor over not a doctor you sound like fantastic oh man no and I'm gross like what does gross mean well because I eat oatmeal throughout the day like it's coldon go out cuz I'm too lazy to go out and actually buy like lunch are you one of those people that gets the lunch just randomly delivered by someone you've never met or it's only Fran from Postmates you know how we postmate Wing Wings cuz it won't deliver he'll just like he's so busy he'll postmate from his desk like a Caesar salad or whatever and not even a Caesar salad of course a kale salad with no dressing and yada yada I got myself a kale salad with some green juice what's in it I don't know what green that's what he says literally we were in a we were in a meeting the other day at 3:00 in the afternoon and I saw a guy walk up the elevator with a bag and I was jokingly I was like Fran is that your lunch and he go he looks over he's like oh it is actually and he ran out and paid the guy and came",
            "start": 349.24
        },
        {
            "text": "and I saw a guy walk up to the elevator with a bag and I was jokingly like \"Fran, is that your lunch?\" and he goes, he looks over, he's like \"oh, it actually is\" and he ran out and paid the guy and came back with this kale salad, oh God. But he's also doing something right, he's doing right, no, I mean you got to know if you want to be skinny and fit, you gotta make sacrifices. I guess it's worth bringing up before we go any deeper into my topic of drinking that Colin tweeted right before this and I'm asking all day how to lose your gut, right? And so that's where a lot of this workout stuff comes in. See, this is the problem - so I have a problem, what's the problem? The problem is you think you're fat, if you think you're fat, you're not fat. I'm fat, I am **fat**, you are crazy if you don't think I'm fat, you're not fat, represent. Look at my gut, thank you, you've got a little extra junk in the trunk, that's all you got, I got big, I got a big gut.",
            "start": 395.0
        },
        {
            "text": "I am pretty fat you are crazy if you don't think I'm fat you're not fat represent look at my gut thank you you've got a little extra junk in the trunk that's all you got I got big I got a big big you have a booty yeah I got a big I've always had a big ass it's getting bigger it's not a big ass it's a bubble they call it a bubble butt it's it's it's it's not stopped me it's not stopped me in the past from from attracting ladies which has been nice you know a lot of women do a lot of squats to get a butt like your oh I know I eat a lot of pizzas to get a butt like mine do but here's the problem from when I was like very young like 6 years old until I was 18 I played ice hockey all year right and I was a goalie I was up and down I was very fit so I have huge legs and those have never gone away but ever since College I don't do anything anymore like I just sit around and I work on the elliptical now but there's years where I just like literally don't do anything at all obviously my",
            "start": 432.48
        },
        {
            "text": "away but ever since college I don't do anything anymore like I just sit around and I work on the elliptical now but there's years where I just like literally don't do anything at all obviously my metabolism slowing down this is going to catch up to me but it's just very frustrating because I I you really have to make a sacrifice like you have to make a permanent sacrifice to be fit you do and like I just I just time I got to play Mario Golf I can't be out there working out but like here's the thing at least at least when you make the sacrifice you will get fit for me I make the sacrifice just to stay at like stasis where it's like I'm not getting worse that's what I that's just what I go for right now like I'm not that's the same for me any better oh shut I don't even want to hear you talk about it look at you what is she saying she's funny I had to actually I had legitimately had to ask her before we started to turn a little bit toward the camera so we could actually see her",
            "start": 467.52
        },
        {
            "text": "you talk about it look at you what is she saying she's funny I had to actually I had legitimately had to ask her before we started to turn a little bit toward the camera so we could actually see her that's how skinny you are today the nicest thing you me sometimes I look over and I'm like you are wasting away in a good way like in a very fashionable way but you are wasting away and I worry about you sometimes I'm also so damn proud of you not oh okay no I mean I don't know but you do I mean like you you eat you make a choice to eat healthy yeah I you don't you I never see you eat poorly like I don't see you just jamming you just saw me eat a slice of cake the cake was the size of someone's thumb though I'm pretty sure when I looked away you fed it to Portillo oh my God he's just getting over being sick you can't do that oh no oh no he does he has a weak stomach he's fine but no I do try to make a conscious effort of eating healthier you got to you got it when I",
            "start": 507.56
        },
        {
            "text": "God, he's just getting over being sick, you can't do that. Oh no, oh no. He does have a weak stomach; he's fine, but no. I do try to make a conscious effort of eating healthier. You got to, you got it. When I started IGN, oh yeah, you got the IGN like 20... yeah, no, it wasn't 20 when I moved. When I was going through that process, do you remember that week I tried to block that week out of our lives? Had pizza for like every single meal, and it was just a disaster. You also, we have no excuse though; we just love pizza. Literally every single time anyone asked you to do anything, you gave them the look which was like this: what do you want from me? I've given all I can give today. I'm like, I'm just wondering how you are. You're like, you don't deserve to know how I am. This city sucks; it's eating my soul. It is then, like the day you moved in. You were like, it was like right back, right back to you. Were just brand new again, just out of the cellophane. Yeah, um so Greg, the first time I got that's for you, that's for you.",
            "start": 545.12
        },
        {
            "text": "the day you moved in you were like it was like right back right back to you were just brand new again just out of the cellophane yeah um so Greg the first time I got that's for you that's for you that's for you I love you thank you I actually I don't think I I don't think I got drunk the first time I got drunk cuz I had an older brother uh and I always I often talk about him on this here GameOverGreggy podcast you do you can find Monday through Friday on gameovergreggy.com there you go nailed it um but my brother was was a huge influence in my life he was you have an older sister I'm sure she was very much the same but my brother was it just smells really good this whole thing smells really good yeah man so fancy like candy um good stuff and uh my old brother was always he was four years older or 5 years older than me uh sometimes it was four sometimes it was five depending on because he was born in October January not going to get the semantics cheers thanks guys I'll hold the water",
            "start": 588.04
        },
        {
            "text": "older or 5 years older than me uh sometimes it was four sometimes it was five depending on because he was born in October January not going to get the semantics cheers thanks guys I'll hold the water enjoy your water loser cheers in Greek is yamas yamas yeah Y like Lorenzo yamas ah that was a Greg Miller joke right there good that was a good one but yeah so my my brother my parents used to go out of town all the time that is a drink yeah you're supposed to sip it's a classic cocktail that's a very I took a sip okay okay can I try some of yours yeah okay by the way do you think that there was a time when the old fashion was called The Mixing this right I'm mixing them right I don't think you're col I love them why does it smell like paint thinner no they're these are these are right this is the way they make them they're so good dude they're so sweet oh holy hell that's good right see told her what can you use the coaster well there was so much other stuff here I use the radio I don't",
            "start": 629.92
        },
        {
            "text": "the way they make them they're so good dude they're so sweet oh holy hell that's good right see told her what can you use the coaster well there was so much other stuff here I use the radio I don't like it I don't like it when you don't use the coaster I know you bought the table from IKEA I got to hear about it I had to ship this thing over from Ikea I brought this thing all the way over Emeryville you did it was the first time I was like this is a real thing you literally were you're like I don't believe this until you show up with an IKEA table that cost $60 now it's real oh my God he brought it he wasn't screwing around it was like that time we randomly decided to do a fashion show for the uh Victoria's Secret thing we did the live stream remember that I remember that and all of a sudden that that what was that girl's name Alexis yeah she decided to just take an entire set and load it into your living room this one here it it was pretty amazing it was so fun it was good we all looked good",
            "start": 673.72
        },
        {
            "text": "that what was that girl's name Alexis, yeah she decided to just take an entire set and load it into your living room. This one here, it, it was pretty amazing, it was so fun, it was good, we all looked good, yeah, that night. Just look at the goat's face by the way, over there, to look at him. Oh, the camera, I don't think the camera can see the goat, goat's out of frame. Did you see the goat? Did you watch that episode? No, I didn't. Someone shipped us a sex goat. Did you guys use it? No, I mean not that I know of. There's talk we've had, we've kicked on the idea of since we're a conversational show of **** the goat no taking down Twitter suggestions for topics and stuffing them in the goat's **** and then when we want to go to the crowd we pick into the goat's butt and pull out a topic it's true wow that's very true yeah uh so my your brother yeah no I I mean I had I had a I owe a lot of of who I am to my brother mostly because he introduced me to that sort of Lifestyle at a very young age so by the time",
            "start": 706.44
        },
        {
            "text": "true yeah uh so my brother yeah no I I mean I had I had a I owe a lot of of who I am to my brother mostly because he introduced me to that sort of lifestyle at a very young age so by the time I got to my 18 19 I was just like I've done been here done that for quite a while so I was 13 years old I think when he started having people over when my parents would go out of town they'd go to Vegas for like four or five days with some of their friends and they knew we would party so they would sort of intentionally keep stuff around the house that we wouldn't have to go out so like yeah you'd open up the fridge and like why is this thing stocked with like everything you possibly imagine don't have anyone over and then she would like eventually she was like if you're going to have people over just make sure they stay make sure cuz she knew us she's like I'm like no matter what I said I'd be like yeah so and she was super cool um she knew you were not she was contributing but no but my",
            "start": 744.0
        },
        {
            "text": "just make sure they stay make sure cuz she knew us she's like I'm like no matter what I said I'd be like yeah so and she was super cool um she knew you were not she was contributing but no but my brother used to make me like my brother paid me a really good service I think the first time I got I I got a little bit drunk was that you know I couldn't really handle it when you're were that young you're like 14 15 years old and uh he was like yeah you're doing great great I was like he's being so nice to me right now cuz normally it was just a really big mess and then toward the end of the night when he decided to hook up with someone and I looked around I was like oh my God this place is trash and like Mom and Dad are coming back tomorrow and he's like yeah I guess who gets to clean that up and I'm like oh that's this is my initiation into this whole thing great so I cleaned it up then I got in trouble because my mom was like you know I can smell the garbage from here cuz it just",
            "start": 779.92
        },
        {
            "text": "up and I'm like, \"Oh, that's this is my initiation into this whole thing.\" Great, so I cleaned it up then I got in trouble because my mom was like, \"You know, I can smell the garbage from here. It just smelled like Coors Light and like the leftovers of the seven-layer bean dip that we had made the night before.\" So that's my first... at least you offered food at your party. Oh, I was at Nick Scarpino's house, man. She used to make like a giant, like St. like a lacquered just like iron thing of angel hair pasta and it would last 30 people probably be four to five days. You know what I'm saying? Like the kind where it's like her idea of meat sauce was five different types of meat including like tri-tip steak. Oh yeah, man. Oh, it was the jam. The bolognese with some pork chops and some sausage maybe if you want to throw in... oh, oh my God. It's just used to",
            "start": 813.8
        },
        {
            "text": "like what it sat on yeah oh yeah it's yeah I like that the Bolognese with the some pork chops and some sausage maybe if you want to throw if you want to get like **** oh oh my God it's the jam used to love that that's why I'm fat oh that's exactly that's why I am overweight and that's why I'll always be overweight CU like no matter how good I do for the the 12 months or the 11 and a half months that I of the year that I don't spend time at my parents house I'll go there for Christmas I will gain it all back in three days you guys like have dysmorphia or something right yeah you though like you no you guys are like not fat we've already talked about this and me Colin and I don't have to stand up every episode and take our shirts off to show that we are indeed I'm not saying my arms are fat or I'm like a fat dude I'm just saying I look like I'm pregnant that's all I'm saying like I don't know like I don't like I I don't think I just more pregnant than my we just I was in San Diego I saw",
            "start": 859.12
        },
        {
            "text": "I'm like a fat dude, I'm just saying, I look like I'm pregnant, that's all I'm saying. Like, I don't know, like I don't... I don't think I just got more pregnant than my wife, we just went to San Diego, I saw a friend, you know, we saw Cheryl and I saw a friend of ours - the girl's pregnant, um, and she's seven months pregnant. I am like definitely fatter than she is, I don't believe that. Oh yeah, oh yeah, no doubt about it. Now I'm to blame, I blame myself, I'm half to blame and this is the way I grew up and I eat a lot, so it's just an excuse. I got to do something. I mean, literally, you're at a point right now where if you feel like you need to lose a few pounds, you totally could very easily, and that's the good thing. Like, there's a lot of quick talk going on here - I say commit to it. I would say buy a bigger shirt, it's over, wait till you're 34 and like have been overweight the vast majority of your life, cuz it just doesn't come off that quickly anymore, it takes time, it takes effort, you get that, that.",
            "start": 899.88
        },
        {
            "text": "Shir, it's over. Wait till you're 34 and like have been overweight the vast majority of your life cuz it just doesn't come off that quickly anymore. It takes time, it takes effort. You get that that stubborn fat that's actually a thing where you can't... you just get stubborn fat. Yeah, they have fat. Never heard of that. Has never been overweight once in her life. Literally if she doesn't see if she doesn't wake up in the morning and see her abs from anywhere in her apartment, she's not even... I love this visualization has of me in his head like well I mean apparently you wake up and you're apart you're naked and your apartment is all mirrors and you can see your abs from every angle. How far am I away from the are we talking like 20/20, 10%? But but no seriously Alexis so so you're fit and you have this and and you eat responsibly but do you do you indulge often? Yeah so I like an 80/20 split so I try to eat healthy at least like 80% of the time and then the 20% I'll go like crazy. You know what that means.",
            "start": 935.6
        },
        {
            "text": "and you eat responsibly but do you do you indulge often yeah so I like an 80/20% so I try to eat healthy at least like 80% of the time and then the 20% I'll go like crazy you know what's that mean only human like pizza but how much pizza a lot of pizza like when you so when you when you have like a cheat feel better so I I had it like yeah I went crazy on Sunday I had what do crazy mean like a half piece of pizza so there's this new Greek place that opened up in Hay Valley called Sula and oh my gosh it's so did you go with your sister no I posted it that's how pathetic I was ate it on the couch and watch Game of Thrones and I had ido and french fries all to myself to a point like I ate so much food and then I had some cheesecake afterwards to a point where Alfredo walked by and was just like ah just like treating yourself over there huh Al day shut his mouth that guy last time I was hanging out with him I went over to your house that one time to see your guys' new apartment right yeah",
            "start": 978.64
        },
        {
            "text": "ah just like treating yourself over there huh Al day shut his mouth that guy last time I was hanging out with him I went over to your house that one time to see your guys' new apartment right yeah and drink all your booze and Greg had none what's that we must have not had any I think you had some Coors Light or something I can't remember what I drink what is your obsession with Coors Light I love light oh God no you don't it's the best sh I like to put Coors Light I like to take a big glass fill it with ice and pour Coors Light no you do not that is the most disgusting thing I've ever heard on Ice Eric's bachelor party we had spent all day at at the pool I'm not going to name what which pool or what the pool entailed but it was an adult pool okay thank you why would anyone care okay now I see and uh it was a it was a very special place on Earth um I'm pretty sure God himself himself made it because we had an excellent time but we were so hung over and so sunstroke from that",
            "start": 1029.4
        },
        {
            "text": "okay now I see and uh it was a it was a very special place on Earth um I'm pretty sure God himself made it because we had an excellent time but we were so hung over and so sunstroke from that from like being just cuz you know when you're drinking outside in Vegas and there are people around that you want to look at you just stay out as long as you possibly can so I end it's nighttime please leave someone might come back sir I see I see a bikini right there she's coming back for that uh so I ended up me and one of the one of the guys that went to bash party ended up grabbing like those giant tallboy like Coors like cans right going back to the apartment but by the time we got about a quarter of the way through cuz I drink beer so slow they were warm and so I'm like ah idea cuz I don't want to go back down there it's too far and I'm too tired we just grabbed ice from the ice bucket poured it into a glass like a little you know one of those Red Cups and it's actually it makes",
            "start": 1073.28
        },
        {
            "text": "I don't want to go back down there it's too far and I'm too tired we just grabbed ice from the ice bucket poured it into a glass like a little you know one of those Red Cups and it's actually it makes the beer taste better cuz it's ice cold and doesn't taste like anything you just get a little bit of the the the the premier smell of the Coors Light the gutter trash garbage beer oh I hate that so love you know they do they have a lot of Technology built into their cans now are you familiar with this the Rockies I was going to say is that the thing you were walking with your tallboy and you looked and the mountains were like glowing red like I can't drink it it's too warm yeah there wasn't a lot of walking happening at that point literally I was sitting in my bathing suit with the the covers like tucked up to right here and my friend Lee who was also at the bat the party was just reaching over and pouring more beer into my cup and Lee he was like do you need more ice",
            "start": 1112.2
        },
        {
            "text": "the covers like tucked up to right here and my friend Lee who was also at the bat the party was just reaching over and pouring more beer into my cup and Lee he was like do you need more ice I'm like yeah I need more ice it's really disgusting but now ever since then it's a joke every time we drink together it's a joke that we're going to we always have to drink beer on Ice cuz he had it he was like this is actually pretty good but we were already rela a six or C I want to try you want to try beer on Ice you're going to be surprised you're going to like it a lot more than you think you are you know my favorite beer don't you uh oh let me guess this no I don't Budweiser out of a can shut up King of beers straight uper king of beers but heavy the white and red Butcher classic Sandman drank it stone cold Steve Austin drank it did Greg Miller drinks it oh the image of you drinking this beer takes back oh my God that's the class that's the class I like Bud Light I do I did used to drink a",
            "start": 1152.08
        },
        {
            "text": "it sounds cool Steve Austin drank it did Greg Miller drinks it oh the image of you drinking this beer takes back oh my God that's the class that's the class I like Bud Light I do I did used to drink a lot of Bud Light it is I like Mike feel so bloated and full where you're just like oh I can't you like that or you don't like that I don't like it well see this is another step up to the whole graduating to more adult drinks and being an old person right Colin got me started and I'm just drinking Bourbon and so I've been doing that a lot so now when I try to switch back where I'm like I'm going out let's have a beer I'll have two beers I'm like oh I can't do this I can't drink many beers it's the worst yeah I had a um had a Green Flash I went out with someone yesterday and had a Green Flash which was an IPA and I I used to love IPAs um but I have you know stomach problems as Alexis discussed on AIM this week and in case you caught our AIM conversation earlier this week",
            "start": 1190.48
        },
        {
            "text": "which was an EXC IPA and I I used to love IPAs, um but I have you know stomach problems as Alexis and I discussed on AIM this week and in case you caught our AIM conversation earlier this week and uh so the beer was running through me I'm still waiting how did let's just rewind a second at what point in the AIM did how how did the AIM conversation originally germinate Alexis, I IM'd her said that she found a good gluten-free bakery called Mariposa, um and then we started talking about how we were kind of Kindred because we have stomach like life stomach issues I thought it was more like you know hey I have this question about video games I got to take sh yeah exactly I'm going to **** myself right now my stomach's upset she's like oh that happens to me all the time but anyway hoppy beer I love hoppy beer Harpoon by the way is my favorite beer of all time and that is a boss in IPA um and I stopped drinking beer a couple years ago because I thought it'd be better for my stomach and thought",
            "start": 1230.32
        },
        {
            "text": "Hoppy beer Haroon by the way is my favorite beer of all time and that is a boss in IPA. Um, and I stopped drinking beer a couple years ago because I thought it'd be better for my stomach and thought maybe I'd lose some weight too, that didn't happen. Um, but if you're going to drink beer, you got to drink beer right. This filtered beer garbage, this canned beer **** Budweiser, no, not the Budweiser. I'm making a real argument here, don't throw just cans under the bus why because you Sierra Nevada in a can or oh you get 21st Amendment comes in a can, yeah but generally all right, all right it's an improper generalization, you're absolutely right, that is beer racism. Um, but if you're going to drink if you're going to drink beer, you got to drink the **** beer, you don't drink this Coors Light, this you got to drink the hoppy ****, you got to drink. See no I can't do I can't I can't stand when someone hands me a glass of beer and like like you got to try this and it's over here and I can already smell.\n\nI corrected the following:\n\n* \"Haroon\" is likely a misspelling of \"Sierra Nevada\", which is a well-known brewery.\n* \"IPA\" is correct, but I added a period after it for clarity.\n* \"Budweiser\" was capitalized as it's a proper noun.\n* \"21st Amendment\" was corrected from \"21st comes in a can\".\n* \"Coors Light\" and \"Sierra Nevada\" were capitalized as they're proper nouns.\n* No other changes were made, as the original text is clear and coherent.",
            "start": 1275.0
        },
        {
            "text": "to drink the hoppy beer you got to try this and it's over here and I can already smell it oh I hate that I hate IPAs like they just smell like burnt clove and firewood and you know that you're just going to take one drink out of it and you're immediately going to have to unbutton that top button on your jeans and just hope that no one actually looks that closely to be like wow you are a fat ass that's how I feel sometimes burp oh you get the burps when you're talking to someone close and you burp in their face and they're like you know how they do that sorry yeah that's why bourbon's awesome because bourbon just smells good and you get the bourbon breath yeah you can talk like you feel like you're mad you're a mad man over here look at us we're making deals you also get the bourbon glaze like the hard liquor glaze over in your eyes where",
            "start": 1316.6
        },
        {
            "text": "\"Breath, yeah, you can talk like you feel like you're mad, you're a mad man over here. Look at us, we're making deals. You also get the bourbon glaze, like the hard liquor glaze in your eyes, where your forehead's a little sweaty and you just think everything is just dazzling. I'm like, I'm getting to a point where, like, I can really drink, you know? Like, I've always been able to hold my alcohol, but with beer it's different because you're a little more active, it takes you a little longer to get the alcohol intake. But man, I can drink now. After starting to drink bourbon at first, you get a little woozy and like, I was telling Greg, if I really could make old Fashioned this good, I'd be an alcoholic. And then Greg started making really good old Fashioneds.\"",
            "start": 1360.48
        },
        {
            "text": "we started making I texted him from San Diego this weekend I'm like if I can make really good Old Fashioneds I'd be an alcoholic and then Greg started making really good old fashion yeah because you know why because Greg is an enabler now well it takes a little time Greg is an enabler by the way oh yeah because it's not it's not his fault he I just want people to join me I just want to have friends he gluttony loves company when it comes to great no you don't even want people to join you you want me to go back to smoking cigarettes cuz it's cool see it's let's let's admit first off we already me on the show that smoking is cool but let's also admit that it's over for you it's you too late you smoked a long time if it's going to happen you're going to it's you got the cancer it's it's going to happen if it's not going to happen it's not going to happen she's saying should go back to it The Dice Man play the Russian Roulette you think anything North is 65 is good no it sucks no you don't",
            "start": 1395.84
        },
        {
            "text": "going to happen if it's not going to happen it's not going to happen she's saying should go back to The Dice Man play the Russian you think anything North is 65 is good no it sucks no you don't want to that but that's my problem I think I'm hitting it at like 45 cuz I used to smoke a lot yeah like I was like half pack to a pack a day yeah I'm feeling like 45 would have been that's the time when I go to the doctor and I'm like so I don't feel very well and he's like that's because you are going to be dead in two weeks but what's the urge you feel so like do you are you addicted to anything no so like you don't you don't crave I just need it have like random craving where you're like I'm going to go do that never I mean maybe yeah like when you walk by Pizza Hut yeah really good pizza and you look at it and you go and you your first instinct is to reach out and grab a piece and you have to remind yourself don't do that yeah smoking is like that times about a thousand like it's",
            "start": 1433.68
        },
        {
            "text": "and you look at it and you go and you your first instinct is to reach out and grab a piece and you have to remind yourself don't do that yeah smoking is like that times about a thousand like it's literally when you've smoked for so long and it becomes a habitual thing and then you move to the stage of addiction you will I will literally walk by someone and smell cigarette smoke and go that smells disgusting I want one really yeah oh yeah my wife is seeing it and she's like she'll like yank me around like oh look I'll just get like mesmerized by it cuz it's just it brings back all these amazing memories of you know meeting friends and and and and having coffee in Newport Beach till 2 o'clock in the morning while we're playing Trivial Pursuit at this cool place that used to be open The Beach Pit actually was called Cafe Ruba which was a really cool a really cool place they close it down um but it's also it's a chemical thing that's also just a habitual thing right it's how it's a lot of",
            "start": 1475.92
        },
        {
            "text": "Pit actually was called Cafe Ruba, which was a really cool place; they closed it down. But it's also a chemical thing that's also just a habitual thing, right? It's how it's a lot of people talk about triggers - it's how when I get stressed, that's a trigger for me. Me and I immediately want to deal with that by walking outside, taking a break, and having a cigarette. So it's it's hard and it's I've snapped out of it thankfully but every once in a while yeah it's really hard. It's A Taste of Home right? It's all that sensory stuff whenever I like walked by somebody yesterday smoking - nobody smokes really anymore. So I walked by someone on the street smoking, and I caught a whiff of it, and it was outside; it was crisp air. And it immediately took me back to tailgates, college tailgates. And I was like, \"Oh, I really like this smell.\" This smell of secondhand smoke, gasoline - I'm like yes, like gasoline exactly. Pipe smoke is the p... is the ****. I hate it; I can't stand the way people smell.",
            "start": 1514.0
        },
        {
            "text": "and I was like oh I really like this smell of secondhand smoke gasoline I'm like yes like gasoline exactly Pipe smoke is the p is the **** I hate it I can't stand the way people smell and that's one of the things that's one of the big reasons why I quit was because my wife was like she I you know I'd come home after a whole day of what I thought was a conservative amount of smoking and I'd wash my hands a bunch of times and like chew gum and I would get up to the door and she would be like I can smell you already like not even through the door I would just she be like I could smell you literally before you came like cross the threshold of our household and she's like I don't want to be I don't want to be near you I don't want to TCH like you like an ashtray so it sucks and now even yeah to this like we'll sit in meetings with people sometimes they'll just come back for a cigarette I'm like whoa is that is that what it was he grabbed their hair and then the sad the sad goodbye",
            "start": 1547.88
        },
        {
            "text": "even yeah to this like we'll sit in meetings with people sometimes they'll just come back for a cigarette I'm like whoa is that is that what it was he grabbed their hair and then the sad the sad give me more oh no there was there was a time like when when I had just quit there would be times when like Shannon would go out to smoke or up Shan stev pick up Shannon Stevens U quit smoking um but we'd be at VidCon or something like that and she'd go out she'd go like have one and she'd come back and I would just like take a moment just to take it in cuz I'm like oh I miss especially when you drink when you drink it's the worst not be able to smoke cuz they like the problem with smoking and I've said before is it it goes well with almost anything like stress fun surgery happiness what's the deal with the after sex cigarette like what does that feel like it always looks really cool it does SM looks so cool oh I could see how that would be satisfying but I don't like what is the feeling that",
            "start": 1589.8
        },
        {
            "text": "with the after sex cigarette like what does that feel like it always looks really cool it does SM look so cool oh I could see how that would be satisfying but I don't like what is the feeling that you get that you're just like oh yeah I need that right after I have because it's every everything like any sort of activity is strenuous or not is the trigger for it right so it's like it's your reward in a lot of ways your reward for sex you made it through this nightmare that's how screwed up The Habit is right is that you can rationalize wanting one or needing one needing quote unquote after everything right oh that was a fantastic thing that we just did together I need a cigarette oh my God that meeting was terrible I'm so stressed out I need a cigarette holy **** it's my first cup of coffee today I'll have a cigarette oh my God I only had one cigarette I just got to work I'll have a cigarette right the association it's the association and you really that's the hard part",
            "start": 1627.56
        },
        {
            "text": "of coffee today I'll have a cigarette, oh my God, I only one cigarette. I just got to work, I'll have a cigarette right. The association it's the association and and and you really that's the hard part about quitting it's actually not the chemical dependency you can use the patch to quickly quickly kind of take that out so you don't feel the knee cuz you get jittery if you don't have it it's it's a withdrawal just like anything else like heroin it's nicotine withdrawals but then after a while you're just like I just want to go outside and sit against the wall and not talk to anyone and wear my cool sunglasses. Oh, you used to be so cool that's how I used to bond with you when I first worked yeah used to sit outside with your cigarette with your sunglasses and go two things two things look at him look that's that's how you do it two things and I used to be like oh man what did you think what did you think about me when you first started working at IGN were you just like this guy's out of",
            "start": 1669.48
        },
        {
            "text": "him look that's that's how you do it two things and I used to be like oh man what did you think what did you think about me when you first started working at IGN were you just like this guy's out of his mind cool is that you no I don't know I think you were probably one of the first people that I really related to cuz I was like oh my gosh it's like someone that like talks to me about stuff that I don't go too deep into that cuz people I I have a really I have a masculine no you were going to talk about fashion and like and girl blogs cuz I love looking at that stuff too some girl blogs well cuz she come I'm like oh my God have you read The Superficial yet and she's like yeah why did you read it why are you reading Jezebel I to check in on The Superficial ever saw well that guy's a genius writer Jezebel is an interesting website is it it is yeah it is my wife reads it a lot so I felt like there was a lot of stuff that I could we could talk about Alexis we bonded culture stuff tell me",
            "start": 1705.52
        },
        {
            "text": "writer Jezebel is an interesting website, is it? It is. Yeah, it is my wife reads it a lot, so I felt like there was a lot of stuff that I could we could talk about. Alexis, we bonded over culture stuff. Tell me about the first time you ever drank. The first time I ever drank, oh my gosh, it was a disaster actually. Um, I went to a high school dance and uh I really liked the guy I went with, and what age were you like? Junior Senior High School? See, I was hoping it was going to go that way... yeah, I went to a high school and she's like 20; she just thought was the opposite back home chilling out at some high school. Um, no, I think it was like 15 okay um, and I drank Jack Daniel's whiskey and I was trying to be so cool, and we sat down at a table and we started playing like a drinking game, and you were playing a drinking game with... yeah, whiskey, and I never I've never drunk before; why not? Jump right in. Yeah, I never drank before; I didn't know much about alcohol, and so I sat down at the table and I",
            "start": 1747.52
        },
        {
            "text": "and you were playing a drinking game with Yeah Whiskey and I've never had Dr Pepper before, why not Jump Right In? Yeah, I never drank before, I didn't know much about alcohol, and so I sat down at the table and I didn't get up for the whole night. Like, oh my God, yeah! And so I felt like a little drunk, but not... I was like, oh yeah, this is fun, whatever. And then my dad came to pick me up. Oh, your dad, by the way, let's stop, let's pause the story here. I've met your father on three separate occasions and I remember all three of them vividly because your dad is a very nice, very compact, very intense human being who I believe could talk me into doing anything. He's a compact human being; he's not... I mean, he's like you know, he's just an average-sized guy. I like the descriptor a lot; I never met him but I like that descriptor, thank you! I saw him once when you first started working, yeah. So I mean, I didn't mean that I didn't mean that as an insult, I didn't mean that as",
            "start": 1796.28
        },
        {
            "text": "a lot I never met him but I like that descriptor thank you I saw him once when you first start working yeah so I mean I didn't mean that I didn't mean that as an insult I didn't mean that as an insult through the wall like Kool-Aid man no cuz he wouldn't burst he would walk in subtly and I'd look over and he'd be there and he'd be like Nicholas um I'd like to talk to you about the word Compact and then I would just feel like terrible i' have to make it up to him for the next like two years okay he can really he's really intimidating he has a very mafia vibe to him get in the car yeah what happens so I started walking and the guy like my dad called me on my cell phone I was like hey I'm outside you know come outside so I went grab my stuff and then uh I'm walking out and I'm like oh man it hit me so hard and I was like this is not good and the guy walked me out to the car and I was like I don't want to say his name but he was just like uh are you going to be okay like do you I mean do",
            "start": 1841.44
        },
        {
            "text": "hit me so hard and I was like this is not good and the guy walked me out to the car and I was like I don't want to say his name but he was just like uh are you going to be okay like do you I mean do what we tell your D and I was just like oh no like I don't feel good I was like all right I'm just going to like play it cool I get in the car we start to drive home oh it's the worst and I'm just like my dad was like oh you know like have you been drinking tonight and I'm like no dad no way and I'm sure he could smell the Jack Daniel's on me and like earlier that night we went out to like a seafood restaurant which Jesus why would you do any of I'm allergic to all like seafood so on the car at home I was just like Dad I'm not feeling good like I don't know what it is I think I caught something turned down the wind we were on the freeway in LA I pulled down the window to like puke outside but because we were going so fast on the freeway oh my God it was going into the car and later my dad told",
            "start": 1879.64
        },
        {
            "text": "turned down the wind we were on the freeway in LA I pulled down the window to like puke outside but because we were going so fast on the free oh my God it was going into the car and later my dad told me oh my God my poor Dad it was like hitting him in his glasses oh that's disgusting and he would just be like are you okay are you sure you didn't drink tonight and wiping it off like his face and I was just like oh my God goddess and it was like in my it was disgusting like in my hair and just all over the back seat I I had a very similar experience with a girl that I liked once that happened to me where like I was taking her home I was I was trying to be like the cool guy and like went her over and she was super drunk cuz my friend had gotten her drunk and they were like hooking up at the time I didn't know so I was like I'll take you home I'll be the cool guy oh man we got I think we got on the 57 and she just she I don't even think she was trying to make it outside it all just landed",
            "start": 1927.12
        },
        {
            "text": "I didn't know, so I was like, \"I'll take you home; I'll be the cool guy.\" Oh man, we got on the 57 and she just...she wasn't even trying to make it outside. It all just landed in my back seat. It was disgusting. Once in college, we had a giant party, and then the next day, I was taking him home – like, I was driving from Chicago so I was going through St Louis, and I was going to take one of the freshmen home with me to drop them off in St Louis on the way back. And so I woke him up on our couch and put him in the car, and he was super hungover; I could tell. We were driving and driving, and he'd been sleeping, and I look over at one point, and his cheeks are just full, and he's like pointing to the side of the road. I'm like, \"Oh jeez.\" And then he just looks down and barfs all over himself. Now, luckily, it was just beer – there were no gross chunks in it. It was just...he had been drinking so much. But like we got there; he got out of",
            "start": 1976.6
        },
        {
            "text": "he just looks down and barfs all over himself now luckily all it was there was no gross like chunks in it it was just he had been drinking so all it was was beer but like we got there he got out of the car settled down he's apologizing profusely I'm like no big deal I'm just like but next time there's a window you didn't have to like like last Stitches ever I'm going to vomit all over myself to make sure I don't vomit pulls his shirt up and he's like here we go yeah exactly exactly Truffle so were you in trouble did your parents care uh no the next day I felt like utter crap so I think my dad was just like I think you so he was cool about it yeah mine was I was a late bloomer to the drinking so between my you know junior year ended and between that and Senior year went to France on a trip and in France obviously there's no drinking age so but they're like pounding into your head the stuff around like we will send you home if you're caught drinking yada yada but everybody's like you're",
            "start": 2015.56
        },
        {
            "text": "and in France obviously there's no drinking age so but they're like pounding into your head the \"Show will send you home if you're caught drinking\" yada yada but everybody's like you're going to drink you know what I mean does it yeah exactly I don't care like they're not going to send you home you know you know how expensive that plan is they spend $3,000 to send you home not going to happen there for a while yeah yeah you're locked into Europe until but it worked like I mean like kids were terrified to drink but we all wanted to do it or whatever and I I remember telling my my friend \"po\" like before we left or whatever like I'm going to figure out this is I'm going to figure out what my drink is you know what I mean I'm going to figure out what my go-to drink is and I'm like I think it's going to be a martini like I was like it's going to be a martini for sure a junior in high school summer I know right I know heads up I I was not a James Bond fan still I'm not so I it",
            "start": 2057.48
        },
        {
            "text": "I think it's going to be a martini, like I was like it's going to be a martini for sure. A junior in high school summer, I know right, I know. Heads up, I I was not a James Bond fan still I'm not so I it wasn't like a like that illusion it was just like you saw people drinking I'm like that looks good what whatever I love martinis now by the way I us to ha I haven't had one forever I should go back I haven't had one since this experience but like we went out that night and we finally all broke away from the shuns and we went and it was like just a comedy of airs, of course. A bunch of stupid kids who barely speak French going out on their own in France, but I ordered a Martini and I got him and I walked back and took one sip of it and we were like, like we passed it around like we're like aliens who land on this planet, like why would it this is rubbing alcohol why would anyone drink this? Like and to this day I don't know why I did this but I was like I don't want this I'm going to order",
            "start": 2092.32
        },
        {
            "text": "who landed on this planet like why would it this is rubbing alcohol why would anyone drink this like and to this day I don't know why I did this but I was like I don't want this I'm going to order something else but you're figuring out your drink this is the summer so it's not too call attention to it I put it in the ball return of a pool table thinking that that way I'm sure an hour went by the balls went down there smashed and some four French guys cut his hand open sorry if you're watching like we the ball go God I don't have a thumb anymore so yeah then then I went we went to a different bar and I was like I'm going to order I'm going to order you and me a beer or whatever there and I so I went up and tried to order two beers or whatever but I said Do's so I started turning I turned around I turn the guy's pouring 12 Beers I'm like no no I'm like he already made like four or whatever I'm like I will take these I will pay for these four and then like walking home like all like is this is this",
            "start": 2132.48
        },
        {
            "text": "the guy's pouring 12 beers I'm like no no I'm like he already made like four or whatever I'm like I will take these I will pay for these four and then like walking home like all like is this is this drunk like you know you're trying to I'm like I'll walk in a straight line and see how that goes Y and meanwhile another friend had gotten like bombed so like we're carrying him home and like we're in the we're in the Metro we barely understand all this stuff down there we're carrying like he's literally like arms around people carrying them home or whatever and he is ranting to the one dude that's about how great his how how great he is and what a great dude he is and the dude's girlfriend is walking in front of us incredibly angry at this entire situation that she just had to babysit all these people and so the dude just goes hey yeah and and Ryan your girlfriend's really hot and she's like that's it and just like started speed walking away from this disaster but and then we got home",
            "start": 2171.0
        },
        {
            "text": "people and so the dude just goes hey yeah and and Ryan your girlfriend's really hot and she's like that's it and just like like started speed walking away from this disaster but and then we got home like everybody's trying to sneak back into the rooms and be stupid but was she was she hot she was hot oh okay well then he wasn't he wasn't that's a great first but that's like your thing of like you know like when you're first you're first learning you know how you're going to act etiquette yeah when you're drunk at that point did you decide at that point that you were going to be insanely loud when you get drunk or did that happen over time of course that happens because of my ear deficiency thank you again for making fun of me for that I don't believe you have deficiency I'm hard of hearing I don't think I'm what I don't think I'm I don't think you shut up I like I mean I wasn't like you we talk about this all the time like we think hearing we went to Damon's show talk about this there",
            "start": 2208.6
        },
        {
            "text": "I don't think I'm what I don't think I'm I don't think you shut up I like I mean I wasn't like you we talk about this all the time like we think hearing we went to Damon's show talk about this there we went to Damon Swayze's show right and like I love Damon and I want to support him when he does these shows right it's a living nightmare for me and that's why I leave early cuz I show up and I'm taller than everyone else so on a normal day I can't hear you that well but then when it's just like crazy music it's literally like I have to bend down and I'm like what and like am I I'm putting my fat head right in front of your face to catch whatever nonsense you're saying about some crap don't even care about that's that's almost enough to make me happy that I'm not tall almost right there almost right there I mean for me it's like the double like Stevie does it all the time I'll be doing dishes and she'll be in the like sitting at the kitchen table and try to speak to me and I'll turn off",
            "start": 2242.44
        },
        {
            "text": "right there I mean for me it's like the double like Steyr does it all the time I'll be doing dishes and she'll be in the like sitting at the kitchen table and try to speak to me and I'll turn off the water and I'm like what like you know I can't hear you like that that water is enough to drown out a that's crazy I didn't know that I'll be in the bathroom I'll miss the door the doorbell like somebody comes or whatever I'll just be brushing my teeth or something I won't hear it over anything like my phone won't hear it like when the texts go off or the rings I can't hear it so I think like it's one of those things like we'll be in meetings all the time or like not meetings but like BL we'll be trying to talk about something top secret and you'll tell me all right bring it down I don't I think I'm being quiet wow I didn't know that I how to get loud I know that I'm a loud person but like when I'm casually talking to you and I'm not whispering it's not on purpose I I all these years we've",
            "start": 2283.2
        },
        {
            "text": "I'm being quiet, wow, I didn't know that. I don't know how to get loud. I know that I'm a loud person, but like when I'm casually talking to you and I'm not whispering, it's not on purpose. I've all these years we've known each other, I did not know that it's not...and this is totally one of those like self-diagnosed things. Don't get me wrong, I've never gone to a hearing specialist and like you're saying what is that? Is the building coming down? Yeah, I have slightly worse hearing in my right ear from my crash symbols um, C.U. I play drums or whatever um, but I don't think it's that bad. I listen to music really loud too as you know, like in my headphones or on my earbuds and on speakers so I'm going to have some crazy tinnitus in like 10 years probably which is like my dad...my dad was a drummer all through high school and all through college and like even to the point where I was like I think he stopped doing it and I was like seven or eight and he has the world's worst hearing and it actually is worse.",
            "start": 2318.4
        },
        {
            "text": "high school and all through college and like even to the point where I was like I think he stopped doing it and I was like seven or eight and he has the world's worst hearing and it actually is worse in one ear and I think it actually is where it's for yeah where your symbols are probably CU you're if you're sitting you know this way your left if you're playing as a righty your left ear goes toward right that's crazy or this I don't know but yeah that my drum teachers as a kid and my parents were always like you should wear protection like you're like no way man all that's going to protect me is the beats and the Republican Party John Bonham wore protection keep your laws off my drums I was in a band in college and uh we would play shows wherever and I wouldn't wear protection either and like when you have the monitors facing you and it's like really **** loud but I felt like I couldn't hear it with like like I don't know if I'm playing loud enough I can't hear the like the low end at",
            "start": 2356.52
        },
        {
            "text": "when you have the monitors facing you and it's like really **** loud but I felt like I couldn't hear it with like like I don't know if I'm playing loud enough I can't hear the like the low end at all on the Bass like you know it's just it was you had to sacrifice for your art I respect that yeah but I'm going to pay for especially with how I because I love music I listen to music for hours every day and like I I just I have it has to be loud if it's not loud like I don't want to listen to it how many hours of that is 311 uh I don't listen to them I listen to them this morning when I was working out but I don't listen to them every day there's G be months in the time when I don't listen to okay yeah I've been listening to a lot of uh Deathcore lately it's a new metal genre what the hell is that like degenerate no it's like um no like the gentleman well I'll I'll bring up I'll bring up an example as I as I tell you about my I was thinking about this and I remember specifically the first",
            "start": 2397.4
        },
        {
            "text": "that like degenerate no it's like um no like the gentleman well I'll I'll bring up I'll bring up an example as I as I tell you about my I was thinking about this and I remember specifically the first time I ever had a drink of beer which I think is funny it's not the way you're looking for I'll give you what you're looking for but I was at my I was you want I was at my buddy uh my buddy Tim Gettys' uh brother's graduation party and got in the Cornell and I remember like they um you know Cornell's Upstate New York and and it's a big deal to get in there yeah and so they I remember they had Cornell written in like lights on like the fence I remember the whole thing I remember his his uh father's friend whatever like I was like can I try your beer they were drinking Budweiser out of cans yeah they were and I remember just drink I remember just having a sip out of it I was like what the **** you know like like the same example the same I remember my dad did that at one point too like",
            "start": 2434.76
        },
        {
            "text": "they were and I remember just drinking I remember just having a sip out of it I was like what the **** you know like like the same example the same I remember my dad did that at one point too like had a sip of beer like this is terrible I'll never drink this yeah I think I actually think that older people do it as a thing like you're not you're not ready for this yeah um but uh yeah the first time so it was the summer after 9th grade so that's like 1999 2000 something like that sure um I was always you know the same group of friends that I still have from home we were all hanging out uh you know around this pool whatever and we would drink Zima and Mike's Zima J we thought we were so cool by drinking wine coolers and all this kind of stuff but the fact that is we just didn't have the balls on oh God I always think back to that one like what so you know France starts this alcoholism spiral for all everyone who was there like this is great we need to do this more often and back home why don't",
            "start": 2471.88
        },
        {
            "text": "God, I always think back to that one time in France where it started this alcoholism spiral for everyone who was there. This is great; we need to do this more often, and back home, why don't we do this at home? You know what I mean? So, we had a condo party at one of our parents' condos that wasn't inhabited right, like it was set up but nobody was living there. Awesome, so yeah, I threw a party, and I was totally the man about it where I was like, \"I did it,\" and set it all up with my friends, and then I was like, \"Mom, I'm going to have a party.\" You know what I mean? Like, I did the whole thing; I'm telling her. She's like, \"God damn it, well don't drive.\" You know, don't let anybody drive. That's why we're doing it, you know what I mean? You feel like you're doing the right thing. Uh, I will never forget when we got there and made the list for whoever Chris Nelson's older brother was to go buy.",
            "start": 2510.88
        },
        {
            "text": "you're doing the right thing and uh I will never forget when we got there and like we like you're making like the list for like somebody like whoever Chris Hansen's older brother somebody to go buy us alcohol right so we write out this giant list or whatever and give it to them and like at I remember I'll never forget we put like 13 things on the list and then at the end one of us is like should we get some beer like we had like Pucker on there and then like you know what I mean my car's lemonade and just a bottle of vodka like you don't even know what you're doing you're like yeah give me all this **** bottle of AA and then we got like a 24 pack of MGD that like one got drank people like this is terrible you know what I mean yeah you got to ease into it but what you don't realize is that The Malt Liquors are like really really much stronger than beers and they and they sit with you a lot harder so we would drink like all the time that like summer we I don't know I don't even",
            "start": 2547.72
        },
        {
            "text": "is that The Malt Liquors are like really, really much stronger than beers, and they sit with you a lot harder, so we would drink like all the time that summer. We don't know; I don't even remember how we got any of this stuff to be honest with you. And there was a 7-Eleven actually around our house, I think. When we were getting a little bit older, like literally when we were like 15, we would just buy it; they didn't give a **** um and uh my only memory I have two memories of that summer: one is passing out in my friend's backyard um and being woken up by his mom oh my God the next day. The other is sitting on top of a refrigerator um in the guy's kitchen or whatever thinking that this was normal or just funny or whatever, and actually like falling asleep and my friend like laughing at me with my head back against the little vaulted ceilings and uh my friends thought it was funny to just sit on top of the fridge or fall asleep on me I'm a moron.",
            "start": 2585.8
        },
        {
            "text": "friend like like like with my head back like it was a little tall vaulted ceilings and uh my friends you thought it was funny to just sit on top or to fall asleep on look at me I'm my jury sign and then and then uh and then I just fell asleep up there my friend still brings like still when I go home still bring up \"Remember When\" of your stupid ass sat on top of the refrigerator I'm like yeah we were 14 years old we move on from that now um otherwise I mean I've had a lot of terrible blackout stories and stuff but a lot of that's from college and uh I didn't really get into drinking hardcore until until I was later in high school yeah this is our innocent times with it or whatever yeah like when I was like drinking to get **** up that was like a different story like these stories are not fit for this show yeah exactly the house party stories you're always just trying to figure out like what are we doing you know what I mean social drinking yeah exactly dumb kids being dumb yeah those",
            "start": 2627.92
        },
        {
            "text": "Fit for this show, yeah exactly. The House Party stories you're always just trying to figure out, like what are we doing? You know what I mean. Social drinking, yeah exactly. Dumb kids being dumb, yeah those are the days. Trying to be cool by the way. Mean, those are the days was like last Saturday. This is like four or five days a week for me. Um, this is the Gent. This will be a little hard for you guys. Jesus, you can't not listen to that loud. You got to listen to it loud. But here, here's the best part about it. Hold on, I'm just fast-forwarding a little bit. This is the V. Don't get us a copyright strike. No, you're not going to get St on this. What they all say, oh it's rock. I love you know I love rock. Rap right? Rap rock is what they call it. Is it rap rock? Yeah, it's awesome. They call them apparently because it's... Oh nice, yeah there you go. I call it yes of course. Some people hate it. Some metalheads think it's ****. I like it a lot. They don't like it because I think it's **** because that awesome riff should",
            "start": 2666.44
        },
        {
            "text": "oh nice yeah there you go I call it yes of course some people hate it some metalheads think it's crap I like it a lot they don't like it because I think it's crap because that awesome riff should have been followed up with an ear-piercing high like death metal scream instead they got Linkin Park dude the uh my favorite death metal is when they they're just like like they don't even like they just grunt or whatever like so bad I I can never get into Metallica because of that like I always I always expected like they would have these awesome things and I wanted them to just hit that like falsetto screaming like Axl Rose style like I'm a pro yeah but that's that's that's how I jam so that's the hot crap right there the hot but apparently they use like eight string guitars and stuff it's so low you don't even need a bass it's like so anyway it's music nerdy crap Nick M on what's your topic before I begin on my topic I want to give a big shout out to I am Mirly who's Mir",
            "start": 2711.92
        },
        {
            "text": "\"Stuff, it's so low you don't even need a bass, it's like so anyway, it's music nerdy stuff. Nick M, on what's your topic before I begin on my topic? I want to give a big shout out to I am Mirly who's Mir, Mirly apparently on Twitter, happy birthday, he asked for a birthday shout out about a week and a half ago. Oh, it's also Christine's birthday today, also it's also Christine's birthday, yes, happy birthday, happy birthday. Uh, mine's pretty simple. This is a topic that did not come from from Twitter but if you have Twitter topics please tweet at me Nick Scarpino and maybe they'll make it on the show um if not just follow Colin uh my Topic's weird it's one of those I think about this a lot because I go back and forth on this um is it better in today's society in today's so to be a guy or a girl, guy you think guy yeah I think it's easier to be a guy yes well that's what I'm going by far right but there are certain advantages to being a girl I think oh yeah sure Lex what what is take on this since we\"",
            "start": 2759.2
        },
        {
            "text": "think guy yeah I think it's easier to be a guy yes well that's what I'm going by far right but there are certain advantages to being a girl I think oh yeah sure Lex, what's your take on this since we have a girl here for the first time we can actually broach this topic yeah damn I meant to bring a whiteboard and so we could draw across the top shows without girls, shows without a girl, and I just have to like erase the 21 and write zero um I definitely think it's probably easier to be a guy would you want to be a guy if you could physically physically 100% come on you don't do any of that monthly stuff I mean I get oh this is how lazy I am when I have to go to the bathroom I'm like uh I have to sit down it's this whole thing, really I'm just not used to it but",
            "start": 2804.72
        },
        {
            "text": "of taking off your pants God yeah I can see that I look forward to that that's the only time in my day that I do get to sit down like if I choose to and normally we're I'm just standing but sometimes I'll treat myself you sit down all the time can you can you sit down and pee yeah what do you mean can you yeah of course I don't know I mean I have to I have I'm entirely sure how stuff works up a little bit so you know you don't have to think about it I won't you won't what **** and I will stand up and start washing my hands and be like **** I got to pee and turn it off how do you do you're kidding me I'm not I'm dead serious I can only imagine what Steve thinks half the time flushing of the toilet handwashing peeing noise flushing on a toilet and what's the guy doing in there what how do you clean yeah every see everything starts with the p to me like if I'm going both if I'm doing both yeah I go I start with p and then just naturally it's",
            "start": 2852.36
        },
        {
            "text": "the psycho doing in there what how do you clean yeah every see everything starts with the P to me like if I'm going both if I'm doing both yeah I go I start with P and then just naturally it's like an opening a window to like Mountain Air that's what it feels like that's what it feels like to you and I think most guys look forward to it am I wrong in assuming all look forward to going to the bath yeah I I love them I love a good poop I love a good poop but the problem is is that and this goes back to my stomach issues is that some of the poops are not good A lot of the poops are bad see that's what makes good poop great the good poops are better this way but then I wish the good poops took a little more time see sometimes I go in with a book or I go with my laptop sometimes and I'm like you know I'm ready to go yeah you're ready to go and then it just I'm like what the **** I like got through like one paragraph from this story on Grantland and you're like G",
            "start": 2892.2
        },
        {
            "text": "and I'm like, you know, I'm ready to go, yeah, you're ready to go, and then it just... I'm like, what the ****. I got through like one paragraph from this story on Grantland, and you're like, \"G, I've run in the laptop, I know.\" And then I just sit there with like, I got a WIP. See, this is the big thing that happens sometimes too when you have a bad stomach, and you know you got to go, but then you also have to pee. It's when you're going and when you're **** and peeing at the same time. Now, this is a... this is a complex issue though; it is efficiency. I'm technically I'm technically multitasking when I do that. Yeah, it's usually not intentional. Usually, you pee and then you poop right? I think at the same time. You sit down really. I I feel like I'll start with one, and then when that one... like it's like I send him in as like the Recon Scout, and then when he gives me the all clear, he'll stay there, and the rest of the troops will come up to meet him, you know? And then they'll take the",
            "start": 2935.96
        },
        {
            "text": "like it's like I send him in as like the Recon Scout and then when he gives me the all clear he'll stay there and the rest of the troops will come up to meet him you know and then they'll take the gate or whatever the hell going on in this military Arcane military it is Christ it's late in the day guys late in the day but uh you know 7 o'clock what are you talking about no I'm getting old whatever uh there's a there's a Keir enthusiasm about how Larry David won't pee standing up anymore like like where he he couldn't see in the middle of the night so he'd start peeing sitting down at night so he didn't have to put his glasses on but then he'd always pee sitting down and and and he thought he was like so much more comfortable and stuff like that I agree but I also think it's more efficient and easier standing up and you don't see we have the option you don't have the option I'm 50/50 but sometimes I like I said I will treat myself and I'll go you know what like at home oh I'm sitting",
            "start": 2971.76
        },
        {
            "text": "easier standing up and you don't see we have the option you don't have the option I'm 50/50 but sometimes I like I said I will treat myself and I'll go you know what like at home oh I'm sitting I'm sitting when you pee just you have to poop don't have to yeah nothing I'm sitting I'm going give my back or just a rest you know I'm looking at something on my phone I'm just chilling reading a blog or something I'm just I'm there just enjoying the quiet that's a good point I that's a bonus I've never thought about for the sit down pee cuz there's been the times when I'm peeing standing up and I have the phone and I'll fumble a bit you're like who that was a close call holy crap and all you get scared once with that you think about it the rest of your life I bring it out and I go wide now oh you go wide bring it out and then I bring it over here see I don't sometimes I do it to work like I'll be checking emails and the work would be like probably the worst urinal to drop it in",
            "start": 3018.16
        },
        {
            "text": "now oh you go wide bring it out and then I bring it over here see I don't sometimes I do it to work like I'll be checking emails and the work would be like probably the worst urinal to drop it in because they have to post by the way you don't know this because you're a female but we talk about all the time they post they constantly post these horribly printed signs I Pro I put the last ones up did you really CH today's challenge is you that's I you're kidding me oh my God people piss all over the floor G that's like it's and what happen it's not that they p on the floor it's the I'm convinced it's the over what it but the dribble the I don't you know yeah but what it is is it starts in the morning the first person will do it there'll be a little dribble on the ground so the next person stays a little bit back and the next person stays back and so then it just keeps creeping until yes there is just a puddle of piss Lo yeah just a lock Nest down there that's a creature yeah I'm going to",
            "start": 3053.68
        },
        {
            "text": "a little bit back and the next person stays back and so then it just keeps creeping until yes there is just a puddle of piss Lo yeah just a Loch Ness down there that's a creature yeah I'm going to write new signs tomorrow the the Loch Ness wasn't the Lock Ness so wait what is your challenge I just wrote thing was in cuz it's so gross it's just so gross I just said today's challenge in huge letters on cuz we usually there's usually things in there about like the Burger Time challenge whatever said today's challenge don't pee on the floor good luck and put them above it always works for a while when people are reminded of it yeah but you weren't the only person to do that like HR put some stuff in there too that was like Hey if you're having trouble peeing try harder and you're like that's not clever that's not clever try harder that makes me pissed and I'm like no actually so it has the adverse effect on me there's just something like some I feel like it's only one or two people at work",
            "start": 3093.64
        },
        {
            "text": "clever that's not clever try harder that makes me pissed and I'm like no actually so it has the adverse effect on me there's just something like some I feel like it's only one or two people at work though because you go no one's going to claim responsibility for the loose blast that's **** causing these issues you go downstairs to the bathroom where all the other little companies are and that bathroom is totally fine there's no P go down there when I I go down there to poop sometimes I think I ran into you when you were coming out oh yeah you looked unhappy that day I don't know why I remember I remember this I don't know but you looked like upset you're just like hi and like walked by like she was going through a lot in the bathroom do you like to like I could relate I don't think I can't I I don't like going I don't like pooping in a bathroom where I know people are going to be that I know does that make sense yeah like I'm in the bathroom and I know I'm going to run into someone",
            "start": 3131.68
        },
        {
            "text": "I don't like going to the bathroom where I know people are going to be, that makes sense. Yeah, like I'm in the bathroom and I know I'm going to run into someone I work with because even if I see their shoes, I'm like I don't want to share this moment with anyone, I want this moment to be mine, this is mine, this is all I have, especially when you have one of those gaseous farts, oh you know it's going to be with the poop, like where like CL yeah it's just like it is what it is. And sometimes someone sees you go into the stall and they're there and I'm like I'm doing it, I'm sorry, like this is what I got to do that's how I feel. But I think in our situation though we're just like very close, me and Naomi, I'm like Naomi, I'm ripping one, stand back you might want to stand outside for this, that does not happen, that has never happened let's",
            "start": 3168.44
        },
        {
            "text": "very you and like one of the other two girls yeah me and Alexis I'm like Alexis I'm ripping one stand back you might want to stand outside for this that does not happen that has never happened let's clarify right now neither of these women have ever gone number two ever no mostly cuz you don't eat solid foods you just drink water you don't have to poop ever they smell like Reese's and mints they really do so outside of the bathroom though just go into the bathroom all you do to go I'm convinced that when women when like good-looking girls go into the bathroom all they do is check their makeup and they come right back out that's exactly right right that's exactly it perfect well I look good I mean I always love to think about it never want to burst the bubble it's it's like it's like the 70s book everybody poops tear it apart I love it see I think it's hysterical when you get married you burst that bubble fast you'll be having full conversations while both of you are going to the bathroom and",
            "start": 3201.84
        },
        {
            "text": "everybody poop tear it apart I love it see I think it's hysterical when you get married you burst that bubble fast you'll be having full conversations while both of you are going to the bathroom and like you just trade out how are you both going to the bathroom one would be in the shower and switch out and you're just like who cares I thought you like one of those love toilets from SNL back then oh my girlfriend's very patient with me cuz I'm like CU you know my stomach ailments where like I got to I got to I'm sorry like she I'm like I'm sorry I got to go I can do about she's I've also had situations where like we're in the car like 10 minutes away I'm like I'm going to **** my pants you need to drive and and she'll and she'll and she'll do it you just have to you have to understand yeah it is because you like it's an ailment man it's a **** conundrum we had I had a friend one time actually it wasn't my friend my brother's friend it's horrifying we invited we invited this guy",
            "start": 3238.92
        },
        {
            "text": "yeah it is because you like it's an ailment man it's a conundrum we had i had a friend one time actually it wasn't my friend my brother's friend it's horrifying we invited we invited this guy over for dinner for Christmas dinner one time cuz he didn't have any place to go it was my brother's friend that he worked with and we forgot we we always tell people look if you're going to eat my mom's house like uh past yourself because she cooks with a lot of oil and a lot of different ingredients and it can be really hard on your stomach plus it's all really good so you're you're constantly like just you want to overeat so we get a text from this guy like about an hour after maybe 30 minutes after left and he's like you're not going to believe what happened to me he's like i i got about halfway down the 91 freeway and i had to pull over and i had to crap on the side of the freeway and all i like all there was to wipe my ass with was like some old newspaper that had been there for",
            "start": 3271.28
        },
        {
            "text": "halfway down the 91 Freeway and I had to pull over and I had to **** on the side of the freeway and all I like all there was to wipe my ass with was like some old newspaper that had been there for a while and he go your mom's cooking hit me so hard that I could not make it to the offramp that was like half a mile away to get to the gas station he's like I had to pull over and just go into the bushes God bless him I was like that's what I GRE I sh on the side of the road New Hampshire once did you really yeah oh yeah has that never happened to you Nick no I've never had to I never I mean I haven't you never pooped your pants I mean I've never I've pooped my pants before 100% everyone has but not in like oh my God this is horrible and like a should I check that I should check that when I get home like you got to verify you got to verify sounds wet you might feel and like anytime I've ever had that problem it's never been like a thing I'm like okay that was just it was false alarm",
            "start": 3307.24
        },
        {
            "text": "I get home, like you got to verify, you got to verify sounds wet, you might feel, and like anytime I've ever had that problem it's never been like a thing. I'm like okay, that was just it was false alarm, thank God. But I've never had to physically just stop and handle roll out of a car into a bush to expunge my bowels on the 91 freeway; it's never happened to me. Didn't get knocked up by fake wood; you just pulled over on the side of the road like depending on your perspective, you saw what was going on. And then my dad had like Starbucks napkins or something like that, and I like wiped my ass, and and then we had like, and then like the next like rest area was like we pulled over so I can like clean myself up a little bit. And then I wondered; I'm like maybe I could have just waited. Can't you roll those dice? No, you no, you can't. And of course, the classic Greg Miller colore art bonding story when we became best friends for life at Mark Ryan's house I rolled.",
            "start": 3343.04
        },
        {
            "text": "can't you can't roll those dice no you no you can't and of course the classic Greg Miller color art bonding story when we became best friends for life the UFC event at Mark Ryan's house I rolled the dice and like this is a story your pants Oh no this is You' told this story on the podcast before but I want hear story on Aisha Tyler's podcast girl and guy everybody should go listen to that say hi to Aisha for me but no they me and Colin went to uh lunch I guess with Mark Ryan his girlfriend or fiance at the time I think already maybe girlfriend all the time whatever not wife doesn't matter either way um and they live together we're going to go back and watch UFC at their house and on the we I'm driving Colin to this place and I have no idea how far I'm going it's one of those things where you're totally out you're just a baby in the woods You Know What's happen my used to live really far away by the way yeah like got the freeway a 30 minute drive so we're going and I'm like I got a",
            "start": 3386.52
        },
        {
            "text": "you're totally out, you're just a baby in the woods. You Know What's happening? My used to live really far away by the way, yeah, like got the freeway a 30 minute drive, so we're going and I'm like I've got a p***y and I'm like but I can make it, I'm I'm gonna make this, this isn't it's all because like this I I've talked about it on the show before like I had a paralyzing fear in college of having a p***y like if we went out I'd psych myself into having a p***y at a bar it was always a disaster yeah cuz I was always what from what because I always be like I I hope I don't have to p***y tonight I hope I don't have to p***y at this bar and then I think about it so much that I have to p***y at the bar and it's like a huge thing but where did that stem from not wanting to p***y at the bar not wanting to poop in a weird public bathroom you know I mean cuz also in like Missouri right like in a collegiate town right you figure you have drugs and you people want to have sex in the bars so",
            "start": 3423.08
        },
        {
            "text": "wanting to poop in a weird public bathroom you know I mean cuz also in like Missouri right like in a collegiate town right you figure you have drugs and you people want to have sex in the bars so stalls didn't have doors in any of these places it's like you have to have your friend come in and like sit there and block while you're like just destroying this to anyways driving back to Mark Ryan and I'm like I'm going to make it I'm going to make it and like I'm passing by gas stations and things like he lives on Lake Maret over there or he used to and there was like a little house thing there that I think there would have been a bathroom in probably but we get there and we park the car and we make it to his front door I'm like I'm going to do this I can't believe it and we ring the doorbell and nothing he's not home totally and I'm not telling Colin what's up at all I'm trying not to look like a psychopath and but like ring the",
            "start": 3458.2
        },
        {
            "text": "do this I can't believe it and we ring the doorbell and nothing he's exactly not totally and I'm not telling Colin what's up at all I'm trying not to look like a total psychopath and but like ring the doorbell nothing we're getting ready to call him and then he and his wife driving oh hey we'll be out in a second sorry and they were running late and they went into park and it's literally to the point now of like what are you doing there's like there's like a well there's no nothing to do there's like a 14-year-old nice Asian boy who had come and it was all so waiting to get buzzed into this house cuz at first I thought he was going to be my salvation yeah like get me inside the building to I can beg someone for a bathroom or something but he has to wait there too so it's him me and Colin and I'm I had strategically placed myself at the end of these concrete stairs cuz it's like concrete stairs up to landing up to the security door so I'm at the",
            "start": 3495.6
        },
        {
            "text": "there too so it's him me and Colin and I'm I had strategically placed myself at the of the these concrete stairs cuz it's like concrete stairs up to Landing up to the security door so I'm at the like leaning on the railing at the bottom trying to look cool trying to look casual about all this Alexis like cramping exactly and Colin is up top leaning over the railing talking to me and the Asian boy is like over here trying to mind his own business but we're just there by the way every great story of yours has an Asian boy in and I just want you to know that I'm just calling attention to that anyway you can continue and well I just cuz he was so innocent he was so innocent in this entire matter it's like it's like you wrote that if you were writing a screenplay about this you have to write the Asian boy character there cuz he's the innocent witness the whole thing like it's just I mean just imagine that we are having a normal totally normal conversation totally run-of-the-mill whatever and I'm",
            "start": 3529.8
        },
        {
            "text": "boy character there cuz he's the innocent witness the whole thing like it's just I mean just imagine that we are having a norm totally normal conversation totally run-of-the-mill whatever and I'm doing like uhhuh coolen and Colin's like blah and I just look at him go I got a **** and and literally Colin goes I've bet and I'm already taking my pants down **** in this bush and Colin without breaking stride is still leaning over and he just goes are you **** kidding me and I'm like no man I got to go and and this is when I knew col I were set for life he's just like I understand and meanwhile this kid is like who he's like turned around now and pressed up against the glass like this and so like Greg wiped his ass with the Bulls Head we went to get burgers Bulls head he WIP his ass with the Bulls head receipt yeah but I look at I look at this kid I'm like yo kid you got any toilet paper just cuz I'm like well now I'm fully committed to this story I'm going to pull him into it even",
            "start": 3564.68
        },
        {
            "text": "the Bulls head receipt yeah but I look at I look at this kid I'm like yo kid you got any toilet paper just cuz I'm like well now I'm fully committed to this story I'm going to pull him into it even more he's like no I guess that's what I would be scared about is because when I go to the bathroom I need a significant amount of toilet paper I don't know that gets the job done but see I think I feel like this is a patchwork that's maybe one of the advantages to being a girl over guys is that I just don't think the output is as much when it comes to that specific activity well it depends on how much you eat yeah that's all it comes down to right I I don't know depends on like what you eat it just seems like so much easier for women to go to the bathroom you like like you'll wipe once and then you're good to go whereas a guy that could be an all day like activity if if you had the wrong thing the night before or you didn't drink enough water that's the worst like",
            "start": 3606.68
        },
        {
            "text": "wipe like once and then you're good to go whereas a guy that could be an all day like activity if if you had the wrong thing the night before or you didn't drink enough water that's the worst like cleaning like when you don't drink enough water you're pooping like a rabbit little **** hard little pellets it's different it's different for me it's more like pooping beef jerky you're trying to get like peanut butter out of hungry shot glass you know I hear that I hear that by the way before we get off this topic I I just as a random we haven't even Scrat the surfing all we said is I think I think we adequately explored the big thing for me was like the difference and then we went off on a te I just want to tell you a story real quick just real quick not a story just about someone my conversational podcast my brother I have a brother d he's older than me just give him a real name name his name is it's a g name and uh he has a good friend named Rick and they used to my brother lived in",
            "start": 3645.44
        },
        {
            "text": "podcast my brother I have a brother who's older than me, just give him a real name - his name is Greg and uh he has a good friend named Rick and they used to live in Philadelphia for many years, still lives there, he lived there for like 20 years and uh Rick has a thing where every year he shits his pants on accident and like can never get through a year without accidentally pooping his pants and every time you see him yeah you like it's like he's like every like every year without fail like he finds himself in a situation where he poops his pants and you'll see him a few years later and ask him did you poop your pants recently he's like yeah I pooped my pants last year it's like what the heck is going on with this situation where you habitually annually yeah poop your pants I haven't pooped my pants I don't think since college I pooped my pants in college for sure yeah but uh I mean I feel like everyone's had the oh crap moments but you're like that's",
            "start": 3682.76
        },
        {
            "text": "your pants I haven't **** my pants I don't think since college I **** my pants in college for sure yeah but uh I mean I feel like everyone's had the oh **** moments but you're like that's exactly it where In Crowd or you're driving and you just you're like I got to and you kind of let a little something go and it's just a little more than you think it's more than you planned on that's exactly what it is it's not like a full-blown like I just **** everything in my gut in my pants it's more like and you you tighten up real fast it's too late the opposite the only times I've on your brakes by accident cuz you just season every muscle in your body to keep it in and you're like you have that moment where everything's tight and you're like did I did I do it that I succeed and you kind of Let It Go and you're like no I don't think I don't think I I don't think I was suful that has never been the situation for me if I've **** my pants I **** you went full board my God often",
            "start": 3725.84
        },
        {
            "text": "kind of Let It Go and you're like no I don't think I don't think I I don't think I was soiled that has never been the situation for me if I've lost control my pants I've had an accident you went full board my God often happens to me because you know when you have a bad stomach you get a lot of gas and all that kind of stuff is you like try to read your body and like it's like telemetry and like you're trying to like can I let out a little bit can I let a little bit of this pressure out yeah and then you like sometimes you can't even you're just like but but sometimes you misread the situation you're like you think you can and then I'm like well I just lost control my pants and that's how that happens sometimes you that's a shirt sometimes you misread the situation then oops I just lost control my pants that that's so true though it's it's nice to know see it's good having a female presence every once in while I know that women actually go through some of those horrible things I thought I thought guys were the only ones",
            "start": 3762.8
        },
        {
            "text": "it's nice to know see it's good having a female presence every once in a while I know that women actually go through some of those horrible things I thought I thought guys were the only ones that had this problem oh no definitely not dude I always I always love to think of like you know the Hawkeye like or whatever when you were younger like she there was a time where like she had a rash so bad you know like just like the same situation you might find yourself in I Love Thinking of people in these uncomfortable situations that they would never talk about what happens like Everybody Poops like I was saying like that book it's like it's like everyone farts every day everyone takes a **** pretty much every day you know is that true you don't have to answer yeah of course it's true but I feel like if a woman accidentally goes to the bathroom and her pants that's got to be like disastrous cuz there's not a lot of layers to catch that stuff right you just got a thin string",
            "start": 3808.88
        },
        {
            "text": "but I feel like if a woman accidentally goes to the bathroom and her pants, that's got to be like disastrous cuz there's not a lot of layers to catch that stuff right, you just got a thin string and then it just like splits the stream and like splits it out, it's like a thong sty wait so everyone's in a thong to you I mean well but but I understand what you're saying even in the sense that like you know we I wear I person wear boxers and I wear like jeans that should be baggier but I have a huge ass but they're still baggy girls typically not always but typically wear you know tighter underwear, tighter jeans there's just not as much leeway typ yeah you're not getting a lot of like Pockets to catch in there it's just it's like one to one it's out it's on it's out it's on you know what I mean now if you're wearing those JNCOs like it's 1996 you can **** your pants to no way that would come right out of your ankle yeah yeah but stand still if you just stand still no one would even know",
            "start": 3843.28
        },
        {
            "text": "now if you're wearing those Jenos like it's 1996 you can **** your pants to no way that would come right out of your ankle yeah yeah but stand still if you just stand still no one would even know what's that smell it's like you poured chocolate milk into your pocket disgusting oh man I don't know what that smell is that's crazy did someone did someone boof someone go to the bathroom remember Jenko well I got to go see what was the question I don't easier to be a girl or a guy and somehow we turned it into a 30-minute discussion about **** your face let's just keep it that one I think we just I think we just proved that it's actually better to be a woman than a guy because apparently women **** their pants less than guys do and that's good by you positive all right solved I mean I can't speak for all women but you sh your less than we have I guarantee you have collectively I don't know I mean I have Crohn's disease so it's like a yeah she's got that's a serious pretty serious",
            "start": 3881.16
        },
        {
            "text": "can't speak for all women but you show your less than we have I guarantee you have collectively I don't know I mean I have Crohn's disease so it's like a yeah she's got that's a serious pretty serious stomach problem so it's pretty bad it can get bad sometimes I mean I told you my story earlier today yes you probably should keep that story to yourself oh you can't do that that's the worst kind of setup you guys suck I've definitely had the phone calls with my like my mom like driving home like open the front door now I am down the street this is not a test this is not a drill yeah I've been there open all the doors yeah yeah yeah all right cool so Alexis yeah what's your topic ah my topic so mine comes down to casual dating okay um the dos and don'ts of it dos and don'ts of casual dating yeah I I feel like for me casual dating is like like where where does the line stop like how much is too much texting when do you call like what are the Mind Games is it too much to play hard to get",
            "start": 3922.08
        },
        {
            "text": "yeah I feel like for me casual dating is like where does the line stop how much is too much texting when do you call what are the Mind Games is it too much to play hard to get whats too hard actually youre giving anxiety right now Im single again being single is a really its really difficult any city I dont care where youre at I dont think theres any city where its easier to be single its hard to be single La its really hard to be single La here I think I feel like its just as hard here because alot of theres so many options right and all the options involved if you play your cards right you might marry a 23-year-old dude that just became a millionaire at Twitter and so theres alot writing on it is this what youre pressures are well I mean I mean its its complicated being single is complicated and as life progresses and as as the world progresses it just gets more complicated but I was always I always just",
            "start": 3969.44
        },
        {
            "text": "are well I mean it's it's complicated like being a single is complicated and as life progresses and as as the world progresses it just gets more complicated but I was always I always just try to be as honest as I possibly could with the person and tell them what I thought and if I wanted to text I text but I generally never like I trained myself to not want to text within a specific window of like meeting the person but sometimes I would send something like if I just got someone's phone number I would send them like a hey it's really nice like it was really nice to meet you something like that and then I would wait a day to send them another text like you know I was thinking about you again I can't get you out of my mind I think we should go out you know but I wouldn't do you never bombard with multiple texts like some of our friends do that we have a couple friends one in particular who just is like he he just anguishes over when to text and he always makes the wrong decision",
            "start": 4010.8
        },
        {
            "text": "bombard with multiple texts like some of our friends do, that we have a couple friends, one in particular, who just is like he he just anguishes over when to text and he always makes the wrong decision, always makes the wrong choice. Should I text her? I'm like no don't if you think you have to ask the question don't text yeah be cool man let it sit for a while. Seeing a lot of the guys though, I'm like whoa guys some some of them play a lot of Mind Games and I'm like that's not cool. Like if a guy texts me, I'll just text back like I won't think about it like yeah asked me a question you said hello like yeah but you're the worst about that cuz guys have texted you I've seen the text where they're like they're trying to flirt with you and you just shut them down. Well I'm not going to lead him on, but you do it in a brutal way that's good no be like a band can I tell can I tell the story of the coffee I won't say who it was yeah someone so she told me the story one time about a guy that texted her and",
            "start": 4046.12
        },
        {
            "text": "do it in a brutal way that's good no be like a band can I tell can I tell the story of the coffee I won't say who it was yeah someone so she told me the story one time about a guy that texted her and was like hey do you want to get a cup of coffee sometime and she didn't like the guy and this is must have been like a long time ago but she was like I didn't like the guy so I was like well how did you respond like no she goes well I had a coffee on my desk so I took a picture of it and said nope I already got one I already have a coffee smart no that's good she was like it's clever right I was like that is the most brutal thing a woman could possibly do to because you're like super excited you go out on a limb you're like I'm going to work up the confidence to text this girl and just something simple it's not going to be dinner it's not going to be like a movie just a cup of coffee so we can get to know each other in like a human setting that's it that'll work human setting not",
            "start": 4085.0
        },
        {
            "text": "something simple it's not going to be dinner it's not going to be like a movie just a cup of coffee so we can get to know each other in like a human setting that's it that'll work human setting not this bar not with the generous musician Deer the degenerate metaler no like a Starbucks like that's common ground right that's like that's like a place where like everyone knows yeah that's it coffee and just you just destroy that's what you need this is casual dating my favorite thing about casual dating is that those first few exchanges are the first few dates right when literally you're just like here is all my this is how I did it at least here's all my **** I'm going to be totally honest in text messages and tell you if I don't want to do that or any of that crap cuz if it if you can't if we're not going to be able to exist when we're totally truthful there's no way when we're **** locked in into loveless Loveless years over and over again where it's just like there's",
            "start": 4118.24
        },
        {
            "text": "you can't if we're not going to be able to exist when we're totally truthful there's no way when we're **** locked in into Loveless, Loveless years over and over again where it's just like there's too much **** for you to possibly dig your way out you know what I mean cuz once you're invested or in love with somebody then you worry about their feelings more whereas in the beginning it's like I don't want to see that movie no I don't you know what I mean whereas then it becomes what do you want to do I'll do whatever you want to do M but I sort of feel like that's if you really like the girl right you're like okay I'm just going to put it all out I want to be completely honest with her but like if you I do even the girls I would first meet yeah I mean like would you yeah I would I would because it was like my thought is this I don't want to waste my time trying to be the girl the guy that I think this girl wants I'm just going to be me and if that's not good enough for her no",
            "start": 4158.52
        },
        {
            "text": "would because it was like my thought is this I don't want to waste my time trying to be the guy the girl thinks I should be, I'm just going to be me and if that's not good enough for her no problem, no time wasted. And that's when I got to the city - that's how I approached it. I went on quite a few dates before I met the woman of my dreams, who was my wife. Then she got away; she got away for a while. We took a break for a while. Nothing's quite as romantic as it is in the movies, but yeah, I went on a few dates and I was always just me - I'm like, \"I'm just going to be me.\" And it didn't work out a lot of times. Like, there were girls that were like... I had a date one time; I met this girl at a bar, and I was like, \"I'm going to take you out.\" She said, \"Great, that sounds great.\" We went to dinner at this place, and we're sitting there. Midway through the date, she realized it wasn't working out - then I shortly thereafter realized it wasn't working either.",
            "start": 4194.56
        },
        {
            "text": "dinner at this place and we're sitting there and Midway through the date we she realized first but then I shortly thereafter realized that this was not a good date this was not working say you shat your pants no I did not didn't cat that and she realized it before you misread the situation she's like who smells like an old man's man diapers no so in the middle of the day middle of the day we realized it wasn't working and she was just like so and I'm like I was like I got to be honest with this person be like I don't think this is working and we she's like do you want to get a drink after this I'm like no no she's like I don't either and I'm like cool like we just saved each other a lot of time there's no harm no foul right and that's sort of the fun thing about dating is that you can get if you do it right it can make you stronger it can make you a better person it can make you a more honest and upfront person right but I think a lot of the times especially with guys",
            "start": 4229.32
        },
        {
            "text": "if you do it right it can make you stronger it can make you a better person it can make you a more honest and upfront person right but i think a lot of the times especially with guys and you know if guys like me that like we have hangups or something like that like every i think every guy does youre out with a pretty girl and youre like i just want to impress this person but i think the most impressive thing is being the guy that you are not the guy that you think she sort of wants you to be cuz women are smart and inherently have weird sixth sense where they can just see through **** theyre like youre not that guy you youre not him for me it was the same thing about like uh applying for jobs uh i remember when i was in college i totally lied my ass off to get this job at IGN like that was stupid um when i was in college they gave you know the class on what your resume should look like what your cover letters you work with and i hated them and i thought they were totally stupid",
            "start": 4270.32
        },
        {
            "text": "was stupid um when I was in college they gave you know the class on what your resume should look like what your cover letters you work with and I hated them and I thought they were totally stupid and I would write them and I wouldn't believe in them and all this stuff so then when I would get the job I would be like well that sucks because I wasn't even representing myself the way I wanted to and then finally I was like no **** it I'm going to make my resume cover letter look crazy like I wanted to and if I don't get the job great that wasn't the place for me clearly you know what I mean and that's what I did and that's how it worked out after like 19 times of applying right but it worked yeah and it's true because it's one of those things where if you're going to fail at least fail on your honestly yeah exactly like be the be the fail on your own two feet don't don't fail trying to do something that you're you know you're not um that was always my thought process but then it's",
            "start": 4303.0
        },
        {
            "text": "on your honestly yeah exactly like be the be the fail on your own two feet don't don't fail trying to do something that you're you know you're not um that was always my thought process but then it's also I know it was always kind of fun I I miss that is the one thing I miss about being single is the excitement of that first month or two when you're just getting to know someone you're like holy **** this is a thing this is working it's terrifying oh my God like very interesting this could be this could be it I could never oh my God I could never have sex with another person again I can't do this this is not going to be right and you know you go through all those emotions and I think those are the thought process that lead guys to horrible horrible decision-making um texting too much calling too much not calling at all when I first met my wife she challenged me she was like you're not going to call I was like oh now I have to call so I called her we had a lovely date then I went to",
            "start": 4333.84
        },
        {
            "text": "too much not calling at all when I first met my wife she challenged me she was like you're not going to call I was like oh now I have to call so I called her we had a lovely date then I went to Tokyo for TGS and I didn't call her I told her I was going to be gone for a week after a week and a half she called me and was like I know you're back you should call me again I was like oh she knows she knows everything yeah she was really challenging the thing about the thing I've realized in dating over time is the games are played on both sides and both sides are cognizant of the games and what we could all use a lot more of is just straight up honesty with each other to avoid like like the calling thing the texting thing like you were saying if someone texts you're going to text them back that makes sense if you want to talk to someone it should be okay to say I want to talk to you but like I'm not okay with initiating a text cuz I'm like oh should I should I not why not but this is",
            "start": 4370.44
        },
        {
            "text": "makes sense if you want to talk to someone it should be okay to say like I want to talk to you but like I'm not okay with initiating a text cuz I'm like oh should I should I not why not but this is part of the game right like and this is a problem because it's like you're told like you should play be like play hard to get right why like that's just like what's instilled I feel like into females like means from like don't have sex with them on the first date that's hard to get right but hard to get is not like like I think a lot of guys love assertive women to a certain degree right like where you know you got to strike a balance between being assertive and being just downright intimidating for most people but I I used to love when a girl would text me like I would I like I'd give her my phone number and she like thought just like terrifies me really yeah oh my God you know what the best the single best text is what thinking about you no that's a good one too can I can I have some",
            "start": 4406.12
        },
        {
            "text": "my phone number and she likes thought just like terrifies me really yeah oh my God you know what the best the single best text is what thinking about you no that's a good one too can I can I have some that's my favorite Greg text what is it K I do that a lot too I'll text something GRE Greg like really deep or like you will never text me something deep something like long like where it needs to answer be like okay I will read through our text exchanges and I doubt any recently have been deep I just like to text the simple word hi that's all I like and when you're just getting to know someone and it's because it's so non-committal on there they don't have to respond you're just saying hi and that's it see like three responses came in my head do I say hi back do I say well hello or hey say well hello that's cute I like that well hello well hello would probably freak me out via cono **** **** you're like wa I don't that was just a high you didn't have to you to go like empty the clip",
            "start": 4441.52
        },
        {
            "text": "hello that's cute I like that well hello well hello would probably freak me out via cono  **** **** you're like wa I don't that was just a high you didn't have to you to go like empty the clip into me break you next time you do it no I mean I love I I love texting too I love texting I love texting my wife too every once in a while I text and I feel like guys a lot these days like don't call yeah cuz calling sucks no one calls calling is the worst oh my gosh texting's easy cuz then you you can how's it going let's let's have a force conversation for also I know you're 90% of the time you're somewhere you can't talk you want to try to talk now oh no the worst is when when I mean I don't know if it's different now a lot of women wouldn't pick up the first time no simply to see what the guy would leave on the men on the outgoing message yeah and I was a master of that I would rehearse the message the first message because because they save it sometimes oh my God what would you say",
            "start": 4485.72
        },
        {
            "text": "would leave on the men on the outgoing message yeah and I was a master of that I would rehearse the message the first message because because they save it sometimes oh my God what would you say oh I would just I mean I would be it would be just a quick I'll call you no I'm joking um you got nervous for a second pick it up I don't know I mean I would it' be really short and short and tweet M like hey it's me you know we met the other night I really enjoyed getting to know you and I'd love to see you again so give me a call back if you want oh very cool very non if you want if you want I have a strict no voicemail policy I don't leave voicemails that was that would always be after like you don't you don't you don't have a calendar you don't like email you don't leave voicemails no I have no calendar to all here you're you can't say that anymore it's failed so many times in the beginning you were it was like I don't need it and it was great and then then it would just be like call we got",
            "start": 4528.12
        },
        {
            "text": "calendar to all here you're you can't say that anymore it's failed so many times in the beginning you were it was like I don't need it and it was great and then then it would just be like call we got that meeting like we do call like I don't remember that I don't that's not a thing that's that just came up yeah I don't like email I don't like talking on the phone I like leaving messages I like leaving my mom voicemails always like my mom doesn't understand cell phones at all like I don't understand how she doesn't understand them she claims that when I call her and don't leave her a voicemail she can't tell that I called I'm like Mom you have an iPhone it says that I called she's like leave me a message you know old Italian woman like leave me a you don't talk to your mother leave me a I haven't talked to you in two weeks does she text like she does not speak English yeah she texts that's my mom my mom doesn't bother editing or looking back on the auto correct for a text so everything's just wrong my mom",
            "start": 4566.68
        },
        {
            "text": "in two weeks does she text like she does not speak English yeah she texts my mom my mom doesn't bother editing or looking back on the auto correct for a text so everything's just wrong my mom will switch to Spanish in text I'm like huh you're like yeah wait before we go on you said the word Euro but you said it the way it should be said can you tell us all how to say that word now I don't know how to say it for the gyro is it gyro well no that's how you said it yeah see that's how you said it we in so the interesting thing there's an interesting thing I think Greg I told Greg this in New York uh we have Heroes which are subs right and so we call them so in New York well in New York we call them Gyros to like that and that was like how I when I was brought up on Long Island we I used to call them Gyros and was never corrected on that until I went to Boston um which has a big Greek population gyro as opposed to Hero oh you called them Gyros yeah like that was",
            "start": 4605.64
        },
        {
            "text": "Long Island, we used to call them Gyros, and was never corrected on that until I went to Boston, um, which has a big Greek population, gyro as opposed to Hero. Oh, you called them Gyros? Yeah, like that was like...like I never, they're not spelled that way are they? He's saying because they had the hero sandwich, oh different between them. Everyone I always would like, would I didn't, I didn't we didn't eat much Greek food but called them gyro and I wasn't and I wasn't uh I was never corrected by that most because I don't think people know how to say it yeah well I know but I was never corrected until you know because if I I went to a if I went to a pieza shop in New York and was like I want a hero they'll give me a meal up oh let's do that right now sound that was um yeah so I didn't know until I went to Boston a lot of the pizza shops there that I went to were owned by Greek families um and you don't you don't say did they just bounce you out like The Soup Nazi, the...they",
            "start": 4651.24
        },
        {
            "text": "until I went to Boston a lot of the pizza shops there that I went to were owned by Greek families um and you don't you don't say did they just bounce you out like The Soup Nazi the **** they they call Heroes they call Hoagies right yeah yeah yeah the hero sandwich yeah I love it not to be confused with the Grinder oh my God Grinders they're all the same wait what's a grinder all the same it's pretty much the same thingy much giant to but the Grinder was always like no to me the Grinder was always like that that bread that had the cornmeal on it a little bit you like you would pick it up and it would have the the bottom of it would have just a little of cornmeal left over when it baked you it was sour dough but it was like oh man I know what you're talking about yeah Wegmans Grinders and they put like they take the shredded lettuce no matter what you're like I don't want that lettuce on there but you kind of have to have it on therez it's so good yeah I'm reading I'm",
            "start": 4696.68
        },
        {
            "text": "WG Grinders and they put like they take the shredded lettuce no matter what you're like I don't want that lettuce on there but you kind of have to have it on therez it's so good yeah I'm reading I'm reading I just wanted to look it up to see if there's anything there and it's like why can no one in Manhattan call A A yo a yro a Gyra they always call it that it's interesting there's like three pronunciations of the word right there I don't even know what we're doing anymore it's just funny that there's like whole websites but you say it you say it with the actual like Greek accent I do yeah you do my dad would be so proud I'll let him know but tell him not to watch the one right before this I where I yeah just I'm I'm intimidated by the man I don't want him to call me I just I do I want him to call me but I want him to call me good reason he's a complicated human being your dad he's intimidating he's not so do we answer the dating stuff so wait what are your D and does what do you like",
            "start": 4740.6
        },
        {
            "text": "to call me, but I want him to call me. Good reason he's a complicated human being, your dad; he's intimidating. He's not so... do we answer the dating stuff? So wait, what are your Ds and does what do you like when a guy does what when he first meets you if you're into him? If I'm into them, what's what's I like guys to be not aggressive because I don't want people to think to be a man. Yeah, um, you want to be a man; you don't want to be like a little sensitive boy. You want to tell want the texting like hey it's nice to meet you blah blah blah. What if he comes right out right out of the gate with a dirty text just like thinking about you and then the next thing is a picture of him, like naked from the waist down? That's bad, right? That's bad. Okay, continue. Sorry, don't casual dating; don't that doesn't sound very casual to me. Got to take it off a notch. You you want to differentiate yourself from the guys; you want to be remembered. Yeah, you got to be remembered that guy. But then I think when",
            "start": 4779.24
        },
        {
            "text": "that doesn't sound very casual to me got to take it off a notch you you want to differentiate yourself from the M want to be remembered yeah you got to be remembered that guy but then I think when you're like ready to ask me on a date call me you got to call yeah I'm not going to pick up leave a message you're not going to pick up I'm not going to pick up you got to see say you got to see what the message is the first message is very important no one someone calls you and doesn't leave you a message oh that's complicated then cuz I I have like I do that too like I don't leave messages but I will leave you a text message and be like hey called you this is why that would be okay I'd be okay with that I just like straight up mysterious like I called you you have no **** clue we went to game some stupid restaurant I forget that we were like for a summer trying we're like this is going to be our Max well come here",
            "start": 4825.48
        },
        {
            "text": "why I called you in high school you have no **** clue we went to GameWorks some stupid restaurant I forget that we were like for a summer trying we're like this is going to be our Max well come here we're all hanging out here you said that your Beach Pit right or Peach's Beach Pit yeah and I remember one time I wrote a note to a girl the waitress on the check or whatever and left my phone number right that's awesome right what a move know well I look pretty cool with my friends right or whatever but then yeah like it was before caller ID right and there was one time the phone rang and rang and nobody picked it up and like I was convinced that was her you know what I mean like it was like within a few days and I was like oh that was my chance you know what I mean I'll Never See her'll never know I know never so you got to you should do some research call the like get go to the phone company records go through I don't even know what year it was we should call Linda and see if",
            "start": 4859.08
        },
        {
            "text": "never know I know never so you got to you should do some research call the like get go to the phone company records go through I don't even know what year it was we should call Linda and see if that's ever happened to her see if she ever don't call Linda never call Linda again you're going to get Linda fired well she might be soon enough now that Ptil is for oh the girl yeah the call Linda we're going to go to Linda one day should we call Tim no **** him he's too good for us we're too good for him fair enough I don't want to this is a c you know like the rules of a breakup I'm not going to go crawling back to him now all point of you guys do know you're taking him back next week right yes we didn't break up with him just literally couldn't make it break cuz he's going to Texas to go to a wedding his girlfriend his girlfriend she's not my girlfriend Mickey Mouse hands he got a nice suit he looks did you you got him a nice suit he did because no one at IGN under the age of 34 I'm",
            "start": 4896.12
        },
        {
            "text": "to a wedding his girlfriend, she's not my girlfriend. Mickey Mouse hands, he got a nice suit; he looks did you get him a nice suit? He did because no one at IGN under the age of 34 I'm convinced knows how to do anything unless you're there any of the guys... well actually, you know who's great? Well, he doesn't work there anymore. Baradon is essential in my buying clothes because first of all, so Nate and Baradon are two of like my really good friends; Nate used to work at IGN and he works at Microsoft now, Baradon works at uh Layer Media now... um, and uh, Nate and Baradon love that they give me a complex about everything, and Nate attacks how fat I am and attacks my clothes so like when they're combined together they sound like awesome friends; well, they do, they do, they sound like girlfriends no, they do, they do. It's a joke... like when I saw Nate, he'd be like you know, you know you're looking all right or whatever, and then",
            "start": 4931.52
        },
        {
            "text": "like girlfriends no they do they do is a joke like when I when I saw Nate like he like you know he always be like you know you know you're looking you're looking all right or whatever and then and then bar they know it bothers me like and like they do it on purpose but like so but Baron when I when before Nate got married we all had to go buy suits so I went and bought my suit with Nate cuz we were both in the wedding party oh yeah I've seen these pictures and I are Facebook friends o serious and helped me pick out the perfect suit was like very patient he's he was great it's like Nick when Nick dressed me for fancy conversations bought me nice jeans and stuff and he walked me around Levi's and he's bringing people around he's talking about my butt talking about all this stuff and I was like yeah great I tried to do without the other day clothes I think are really important for guys I went I went and got fitted for a tuxedo for upcoming wedding and then I was like oh yeah and you know",
            "start": 4979.56
        },
        {
            "text": "yeah great I tried to do without the other day clothes I think are really important for guys I went I went and got fitted for a tuxedo for upcoming wedding and then I was like oh yeah and you know I've been thinking about getting a custom suit you know what I mean like a Jim Ryan kind of suit cuz he's obsessed with it and I'd like a little more form fitting suit and so she started walking me through options and I became overwhelmed and bored with this situation I would have loved to let's do it this weekend I'll go suit shopping with you suit shopping suit shopping okay what did I say shoes I'll go shoe Sho you have to have shoes if you get a get suit yeah I have the nice Converse No you can't wear the converse with the suit yeah you can dope you can't do it we'll go through it here's here's actually a small thing that a lot of guys don't realize when you first buy a suit you have to have it tailored no matter what yes always have it tailored no suit fits you perfectly why no but",
            "start": 5015.96
        },
        {
            "text": "\"Here's actually a small thing that a lot of guys don't realize when you first buy a suit, you have to have it tailored no matter what. Yes, always have it tailored. No suit fits you perfectly why not? But even the one we were wearing at noon, like the suit we were there, but see, even that suit could look like it was $500 more expensive if we had actually tailored it to fit your body perfectly. True story about six months ago I blew out this cuff they made on the left pant leg. I just roll it up every time we do the show. No one's ever noticed. Oh, also, jokes on us, Nick. Also, the pocket in the left is had a hole for like a year and a half. I can't put anything in it. It explains that, explains so much. You're right though, tailoring is really important when I bought the suit with Baratunde (corrected from \"baradon\") he was like 'you got to go bring this to Taylor and you know fix X Y and Z.' So I go to the place Sundown, like down the street, they're really...\"",
            "start": 5051.44
        },
        {
            "text": "important when i so when i bought the suit with baradon he was like you got to go bring this to taylor and you know fix x y and z so i go to the place sundown like down the street they're really awesome down there it's a nice you know mom and pop cleaner and i go i go to the woman and i'm like i think i need you to add like a quarter of an inch to the waist and she looks at me and she goes half an inch and then she writes it down or whatever i'm like perfect thank you oh my god i had a very very similar experience i bought my wet my suit when i got married and of course when you get married you like you lose weight cu you're like i'm gonna work out look great didn't lose as much as i wanted to the trap they call it this you're tricking her yeah the wedding the wedding diet so i did it it didn't lose as much weight as i wanted to then about eight months later chris o is like hey you want to officiate my wedding and i was like sure but i want to wear the suit cuz its a daylight",
            "start": 5091.32
        },
        {
            "text": "it it didn't lose as much weight as I wanted to then about eight months later Chris O'Donnell is like hey you want to officiate my wedding and I was like sure but I want to wear the suit cuz it's a daylight daytime wedding it's a blue suit you know it'll look good go try a suit on doesn't quite fit anymore and I take it to my tailor that's in the neighborhood uh lovely lovely woman and she she happens to be Chinese and I'm not saying that Chinese people are more blunt but but she was specifically blunt with me cuz I was like how much should how I asked her how much should we take it out and her answer which I will never forget was all the way we should take it off and she wasn't kidding she wasn't kidding that meant it was so crushing like a parachute she just looked at me and was like take them off like we're ready to go a that is awesome that's an amazing cuz I was like I got I was like I was like I I got more I got more like uh cloth in the back because you know good",
            "start": 5126.56
        },
        {
            "text": "take off take them off like we're ready to go a that is awesome that's an amazing cuz I was like I got I was like I was like I I got more I got more like uh cloth in the back because you know good suit will have like an extra like two or three inches of give and she's just like all the way just looked at me and I was like and she was right that thing fit like a glove right afterward that was sad instead casing still fit like a glove yeah I mean you know that's the one thing about being a guy guys it's a lot easier I think to look good in than women women everything you have to wear is soul revealing right and then you got to like have to but suck all that stuff like if you're going to wear a dress out and you want it to be form fitting you got like there's like Spanx have you heard of these things yeah I know SP they have man Spinx too I know I want wearing them right now everybody thinks I'm getting skinny I'm just wearing SPS that would be hilarious calling it a one that like goes",
            "start": 5170.32
        },
        {
            "text": "things yeah I know SP they have man Spinx too I know I'm wearing them right now everybody thinks I'm getting skinny I'm just wearing SPS that would be hilarious calling it a one that like goes from like it's like a shirt it's like a v-neck shirt God it's just an entire like a onesie that you zip up but it just sucks everything in I should I need to course it that'd be amazing but like instead of I they have them to help you lose weight apparently I wish those machines remember those like machines in the early 20th century that like and you know see them like in the black and white 20 frame footage I wish those worked they I don't think they work no they obviously don't or everyone would be using them no but they they convinced everyone that c was going to solve all your problems it did and uh that those things were going to make you the cocaine diet we talked about option it's one option do it for a week we cut each other off yeah it's not how it works though sadly if I can't quit",
            "start": 5208.4
        },
        {
            "text": "and uh, those things were going to make you try the \"Cocaine Diet\" we talked about, option it's one option, do it for a week, we cut each other off, yeah, it's not how it works though sadly. If I can't quit smoking, I'm definitely not going to start doing cocaine, it's not going to work, I think that's a little harder on the grand scheme of things okay but yeah Colin uh so my topic is based on a book that I've been reading and and this is this is pertinent for our most of our audience I think uh and it's simply about Sega Genesis and Super Nintendo um and which one was better and the reason I I ask you guys about this is because and and gals is because uh I've been reading a book by Blake J. Harris that Greg provided me for uh and it's not out yet, it comes out really soon, it's called Console Wars: Sega vs. Nintendo - The Battle for the Generation Um is a good it's it's a great book, it's about 500 pages long, the text is kind of big though so you can probably fit it on 300 if they were looking at",
            "start": 5244.6
        },
        {
            "text": "Nintendo and the battle that defines a Generation Um is a good it's it's a great book it's about 500 pages long the text is kind of big though so you can probably fit it on 300 if they were looking a little tighter on that but it's a fantastic book and it tells the story of Nintendo's dominance of the industry and well, Nintendo's dominant industry and then the first fight that Sega had with Nintendo over the Genesis in Super Nintendo so I was just curious what you're what your guys and gals collective thoughts were about those consoles as a kid which side you fell on you think you ended up being on the right side his because to me I was a Nintendo kid through and through NES kid and then a Super Nintendo kid I didn't have a Genesis until later I bought a Genesis in high school um on eBay um and that's because I found a copy of Castlevania Bloodlines brand new at Toys R Us I have no idea how that was like 1999 so that was like totally awesome I should have bought",
            "start": 5288.08
        },
        {
            "text": "School on eBay, um, and that's because I found a copy of Castlevania: Bloodlines brand new at Toys R Us. I have no idea how that was like 1999, so that was like totally awesome. I should have bought them all; they had like 10 of them. I could have gotten a fortune; they were all sealed. Uh, but I was... Fortune is a... that's those if I kept those today, those would each be worth like $100, so that's pretty good, pretty good investment. They were like 10 bucks each, um, so you know. But to me, like Genesis was always like the second-rate compared to Super Nintendo, and like I felt like I felt like Super Nintendo was like such a dominant console; it's such an amazing console, and it was really close between them. Super Nintendo ended up beating Genesis ultimately, but um, Genesis outpaced Super Nintendo for a long time. I like I think Super Nintendo were talking about Super Nintendo right, not the NES obviously is better than Master System, I don't think so. I always felt like...",
            "start": 5326.8
        },
        {
            "text": "Super Nintendo for a long time I like I think Super Nintendo we're talking about Super Nintendo right not the NES obviously is better than Master System I don't think so I always felt like and this is just a weird part of my psyche that whatever anyone else has is inherently better than whatever I have and I don't know why I think that but my friends a couple my friends had had Genesis and I was I was just envious cuz it was it was the Allure of the other you know like you knew what you had the grass is greener but then you'd go over and play on their system and you like oh my God it's like Earl it's Advance he's running fast he's got to go fast some would say uh I'm well documented as a Sega kid hey Patrillo is here there he is he's been going this whole show I'm well documented as a Sega kid got the Sega Master System all because it had it was the first Ghostbusters game I saw and that was it no research done by me and my parents you just had to have it yep it was that addictive like",
            "start": 5367.52
        },
        {
            "text": "kid got the Sega Master System all because it had it was the first Ghostbusters game I saw and that was it no research done by me and my parents you just had to have it yep it was that addictive like what a blunderous you had well see now stick with here cuz I'm a Sega kid so then I obviously bought I remember I gotten the you know I got the Master System right before kindergarten somewhere like that you know what I mean and then I remember for my first good report card in first grade the Genesis was brand new and I was able to finagle my way to get that because I was a brand loyalist you know what I mean that's all you knew at the time because it was it was you it was WarGames out there you know what I mean like yeah you didn't want to take the you're not going to switch that's like switching countries you came in you said I'm a Sega Master is I'm an NES kid and I'd go watch them play Mario like this is garbage who is this kid get me Alex kid kid yeah yeah yeah but you K was",
            "start": 5411.8
        },
        {
            "text": "switching countries you came in you said I'm a Sega Master is I'm an NES kid and I'd go watch them play Mario like this is garbage who is this kid get me Alex kid kid yeah yeah yeah but you K was good yeah it was but I mean that was the problem is you got you get brainwashed you're stuck I I remember it was a big deal when I got a Game Boy because I I was like this is awesome you get a Game Gear no I did that I got that too I was a spoiled I was spoiled I was like well you were only child I was the only child and I was the last like kid of like all the all the you know other cousins I guess right so I was just spoiled by everybody and so yeah got a Game Gear had the Game Boy but it was strictly a Sega kid and Looking Back Now as a video game journalist, objective knowing the industry I had such a raw deal I bet on such the wrong horse like I miss so much good stuff on SNES and regular Nintendo part of me that's part of the reason why I have had such a tough decision on what",
            "start": 5449.08
        },
        {
            "text": "such a raw deal i bet on such the wrong horse like I miss so much good stuff on Switch and regular Nintendo games part of me thats part of the reason why I have had such a tough decision on what next gen console to get cuz I dont want to make I have this weird I just dont want to make the wrong its like its like what they call decision paralysis where youre like you dont the decisions so hard to make that you just dont make one that was kind of thats thats what I worry about why dont you just buy them both yeah youre you Havey expensive it is expensive I hate when people say that because it is expensive its but if youre just thats I mean like its different now than when we were a kid cuz when youre a kid your parents were like this is a toy you get one you know what I mean at least you know youre not going to get like that was part of the Loyalty thing you know what I mean I remember when N64 was just about to come out and I asked for that for that was",
            "start": 5488.84
        },
        {
            "text": "what I mean at least you know you're not going to get like that was part of the Loyalty thing you know what I mean I remember when N64 was just about to come out and I asked for that for that was going to be what I wanted for Christmas or whatever it might have been my birthday and my mom's like you sure you don't want the Sega Saturn like you've been a Sega kid this whole time and I was like you're right Mom I Won't Give Up on Sega and it was like what another what the **** was I thinking really you didn't even have an no no no I came around in the N64 I got an N64 that did happen PlayStation yeah okay that's all it really matters yeah no no yeah I I I got I got on track I figured it all out in the end you know what I mean but like I look back and like the amount of awesome like genre defining video games I missed you know I mean not to have an NES not to have a Super Nintendo, not to have to come to everything late for Ocarina of Time to be my first Zelda and like you know like do a similar",
            "start": 5528.2
        },
        {
            "text": "defining video games I missed you know I mean not to have an NES not to have a SNES to have to come to everything late for Ocarina of Time to be my first Zelda and like you know like do a similar thing of like my friends were playing Zelda on their 64s and I was like whatever even I played Zelda I'm going to play Panzer Dragoon Saga right yeah exactly sat yeah I'm going to keep playing Independence Day thank you very much did you get the Dreamcast Sega Saturn was it where it was finally like the wake-up call I was jarred from The Matrix I was like you don't know what the **** you're doing **** you I can't even play these games I got to get a memory card expansion RAM thing for the back to play video games get out of here Lex yeah growing up growing up I had a NES did you really yeah did the girl you had Game Boy um and then like Genesis and stuff was over at my cousin's house they had like every console like going over there was awesome did you actually play games when",
            "start": 5567.36
        },
        {
            "text": "really yeah did the girl you had G boy um and then like Genesis and stuff was over at my cousin's house they had like every console like going over there was awesome did you actually play games when you were growing up yeah well casually yeah when we my cousins were really hardcore Gamers and then in my household like they were super strict my parents so your parents are so strict yeah so like I told I think I've told you this story before um the reason I got into gaming was because my dad worked at a bank and one of his clients was Namco and they would give him video games like to take home so that's how I got a console and I was like this is awesome so you know I played like Tiny Toon Adventures what else did I play Bass Masters Classic was my first game ever a great game and I just was like this is awesome like I'm playing video games like I just thought it was the coolest thing and like just playing that game and I didn't even really understand how to play it like just get the jig",
            "start": 5605.72
        },
        {
            "text": "like this is awesome like I'm playing video games like I just thought it was the coolest thing and like just playing that game and I didn't even really understand how to play it like just getting into it's still me today and you're just like what am I doing like getting into it have you ever played this game no no oh you know Bass Masters yeah yeah I know Bass Master's and so that's like what got me into gaming and then I remember just going with my like I used to buy my games at Costco oh Costco just because like my parents didn't know like you know my sister's like well that was the thing like you didn't have like you didn't have the internet you didn't know what was good what was bad you had a chance you literally judged a book by its cover you flip it over four screenshots and you're like all that seems like looks good to me this is worth the $30 or however much it was back then I don't remember how much how much were NES games they were a lot they were 40 50 or 60 depending on",
            "start": 5649.2
        },
        {
            "text": "like all that seems like looks good to me this is worth the $30 or however much it was back then I don't remember how much how much were NES games they were a lot they were 40, 50, or 60 depending on the game I always felt guilty for asking for them my mom would constantly make me feel guilty for asking I always tell the story of like when we were at Toys R Us in uh I forget what we were buying or whatever from so I was getting some toy and my mom pulled out a credit card and I broke down in tears and I'm like are we broke like do we do we not have money I don't need this you know what I mean like you do feel at some point you're such a sensitive man well I was always afraid of us going bust you know what I mean cuz were you guys close to it growing up no not at all like that's the whole thing like but like you don't know that sensitive man here's the thing I so fear of pooping and fear of going broke but I mean here's the thing to think about as far as Colin and I have",
            "start": 5688.68
        },
        {
            "text": "the whole thing like but like you don't know that sensitive man here's the thing I so fear of pooping and fear of going bro but I mean here's the thing to think about as far as Colin and I have talked about before right is the fact that my dad was in a union and he was an operating engineer heavy crane operator you know what I mean and he he'd work for years and then be off for a few months while you know they the next job Cycles in and to a kid you think he doesn't have a job he is no job you know what I mean we're going to be living a tin cans or something eventually and so that was the concept I had trouble wrapping my head around as a kid that no no he's fine this is how it works this is how the job works you know what I mean that never factored into anything when I grow I had no idea my parents finances growing up me didn't know they were like rich or poor but I mean I I you know what I mean like when your dad's home you're like oh God there's no I only understand it",
            "start": 5725.92
        },
        {
            "text": "idea my parents' finances growing up were a mystery to me, I didn't know if they were rich or poor. But when my dad was home, I'd be like \"oh God, there's no food.\" I only understand it from my dad being one of those classic Mad Men-style dads who'd come home super late, leave early, and then work more after dinner. He worked for the County of Orange as a public administrator, but also did real estate stuff because our family owned some interests. He didn't really want to interact with my mom, so he'd just say \"hey, what's up\" and go back upstairs.",
            "start": 5763.88
        },
        {
            "text": "estate interests so yeah he would and also I think he just didn't really want to interact that well with my mom so I think he was just he would come home and he like hey like what's up Dad and so my mom would always like I remember my mom very very would always threaten us with my dad she would be like when your father comes home yeah he's going to be so mad and my mom was always the crazy one so my brother and I would be like we would just be praying for him to walk through the door and bring some semblance of like normalcy into the room lest we get another wooden spoon broken over our asses cuz my mom used to have these amazing Wooden Spoons that she would use to stir this the pasta sauce oh yeah my mom making a sauce she would literally just like it was like The Phantom Menace she would just reach out for it and it would just appear in her hand and she would crack that thing over you this is before like child abuse was really a thing I guess I don't know my mom",
            "start": 5796.44
        },
        {
            "text": "She would just reach out for it and it would just appear in her hand, and she would crack that thing over you. This is before like child abuse was really a thing, I guess. Guess I don't know. My mom used to chase us with it, my sister and I. She would never hit us but she would chase us. Oh yeah, my mom would hit me when I...I deserved it. I deserve it. It's also a very hyper-Italian thing to have like \"taking wood\" - ask 100% of the boot to Puerto Rican people, and she grew up in the projects so like New York, yeah. And like, well, she's still Jenny from the Block; she is the original Jenny from the Block. She's from the Bronx, no, no, no, upper West Side Manhattan, yeah. So, and my mom used to be like totally a gangster, so she had like long black hair, and she used to get into like street fights with people, and like with girls, and she would tie razor blades in her hair when they would go pull it; they would like cut their hand. Jesus Christ, and I was like, whoa, that's what I knew I.",
            "start": 5836.2
        },
        {
            "text": "street fights with people and like with girls and she would tie razor blades in her hair when they would pull it, they would cut their hand, Jesus Christ. And I was like, whoa, that's what I knew, I was like my mom, like I'm not going to mess with her anymore. See how terrifying her parents are; her mom does that and her dad's a banker, what the hell does that mean? No one knows that he works for a mom, he works for the Greek M, I like how you sounded much worse when you're like my dad. The family owned some real estate interests, so you're Greek and Puerto Rican, Greek and Puerto Rican, and so my mom because she grew up poor, like even to this day, like my dad makes like a really good living, you know; she's still is such a penny pincher. So when we used to go to stores, I'd be like, \"Can I get this?\" Can I get? She'd be like, \"Well do you need it?\" Do she would always say, \"You're like, 'I don't really need it,' no.\" Yeah, wearing the same pants for 15 years; I still fit. I was oblivious",
            "start": 5882.64
        },
        {
            "text": "I get this can I get she likes well do you need it like does she would always like put that you're like I don't really need it no yeah wearing the same pants for 15 years like I still fit I was oblivious outside instead of Nintendo here's this SLE nature I was oblivious to my parents' finances when I was a kid and I kind of feel bad about that in a way like we grew up well and you know we had a big house on Long Island and a ground pool and all that kind of stuff but it was normal for like my dad, my dad was a fireman in New York City so like he would do three-day tours and so he would never be home like ever like that was normal to us but that was like the sacrifice that had you had to go through to like pay for this exorbitant kind of house that we lived in we ended up selling like later when like everyone went to college and uh you know I kind of took for granted like I I'm I'm of two minds with that because my parents made me work and mow the lawn and clean the",
            "start": 5922.4
        },
        {
            "text": "like later when like everyone went to college and uh you know I kind of took for granted like I I'm I'm of two minds with that because my parents like made me work like and mow the lawn and clean the house and everything for like my room they never gave me like any money but then I think about it on the other sense like I played hockey all year I was a goalie so like my and I was growing constantly my equipment my like people were asking like how much was your goalie equipment at one time like my goalie gear was like three or $4,000 at one time so like shut up yeah like my leg pad that's way more than my band camp do Shadow Boxing like my leg pads are like $1,000 or $1,200 by themselves hand stitched like really nice I I wear Brian's pads for all the hockey fans out there they're Canadian the hand-stitched and uh you know and you grow and you have to get new stuff or whatever and I always and plus you have to pay all the dues my parents were driving me all over New England every",
            "start": 5963.64
        },
        {
            "text": "Canadian the hand Stitch and uh you know and you grow and you have to get new stuff or whatever and I always and plus you have to pay all the dues my parents were driving me all over New England even up to like in Quebec and Ontario like I took all that for granted so that wasn't like real money but that was actually like a lot of money and you know what I mean like I I actually told my parents like a couple years ago I'm like I'm sorry like I didn't really understand when I'd like go like I need a new glove I need a new catching glove you know they' be like are you sure and I'm like it kind of hurts I'm like playing you know at a higher level now they're shooting a lot harder it kind of hurts and they're like all right and then that's 500 bucks and then my hand would grow 18 months later and they'd get another one and then J and then they and then they'd be like you know can we you know they try to get rid of the old ones some but some of the stuff I'd be like I don't want to get rid",
            "start": 6000.36
        },
        {
            "text": "and they'd get another one and then J and then they and then they'd be like you know can we you know they try to get rid of the old ones some but some of the stuff I'd be like I don't want to get rid of I'm really nostalgic about that kind of stuff like I want to keep my old gear you want to take it to Pong in sports and Tra oh no no yeah like I I want the only thing I ever kept was my blocker which is your stick hand thing I kept using the same blocker for like five years because I was like really OCD about it but other than that see I feel bad about that kind of stuff now when I was in band yeah was like **** **** I started I started playing trumpet when I was F when I was in fifth grade and I and I decided that I wanted to be marching band because it just seemed a lot easier than Sports I was right um but I I chose trumpet because of the movie Mo' Better Blues uh which is a great movie starring Denzel Washington and he played trumpet and I thought it was cool and he was",
            "start": 6036.0
        },
        {
            "text": "I was right, but I chose trumpet because of the movie Mo' Better Blues, which is a **** Le movie starring Denzel Washington and he played trumpet and I thought it was cool and he was the coolest and so my mom bought me a beginner trumpet. Beginner trumpet is like it's bigger and there's a little bit less functionality and it's not it's easier to get a good sound out of it but I always wanted the silver trumpet that was like when I knew that I was like I'm going to be real when I get the silver trumpet cuz it was like so it was way more expensive but let's what all the pros use like no one used brass trumpets, always silver trumpet but they were like three grand and I would ask my mom every season I'd be like \"Mom, get it. This is my thing. I'm into it. I've been doing it for like she said do a couple more years, do a couple more years.\" Finally I was like a senior, I think I think junior or senior in high school and I was like I'm going to do this like more",
            "start": 6069.72
        },
        {
            "text": "been doing it for like she like do a couple more years do a couple more years finally I was like a senior I think I think junior or senior in high school and I was like I'm going to do this like more and Alexis Cozombolidis was just like dude get the hint it's not happening like we're not spending any more money on this you're not good enough to make it as a musician it's not going to happen like you know you're just going to get to College trumpet's an awesome that is a good instrument oh trumpet was the bomb plunger to put over the front uh I didn't have the plunger I had the Harmon mute which is what makes that sound that you're probably associating with the plunger sure um and you also have just a normal a straight mute there a straight mute Harmon mute and the Harmon mutes that can you if we had a Trumpet here could you play something 100% do you still do you have a practice or anything no I have one in San Francisco funny you bring that up no in San Francisco it's it's you're just going to",
            "start": 6107.2
        },
        {
            "text": "a Trump right here could you play something 100% do you still do you have a practice or anything no have one in San Francisco funny you bring that up no in San Francisco it's it's you're just going to piss everyone off I thought about keeping it at the office and practicing in the studio where it's a little bit more soundproof we out on the studio so it doesn't really matter go practice on the roof I'm sure everyone would love that play Taps every day for four hours that was that was the other thing was that when I when I started playing an instrument I I chose the drums when I was a kid which is also the most expensive instrument y by and I was like I played saxophone and piano a little bit too when I waser and then I just moved straight up to drums and uh it like and then again like I got my first kit and stuff like that I'm like I need a drum kit and like Trump once you buy I was like **** man like what am I like I really was like bankrupt my parents but it wasn't intentional",
            "start": 6143.28
        },
        {
            "text": "I got my first kit and stuff like that. I'm like, I need a drum kit, and like Trump once you buy... I was like, **** man, like what am I? Like, I really was like bankrupting my parents, but it wasn't intentional. Like, I wanted to play hockey, which is like a total... it's true, like, and I hate to say it, 'cause hockey is prohibitive for a lot of people; it's really expensive, it's a rich man's sport. It's like, you have to have some money to play, and that sucks. And like, you don't realize that when you're a kid - you can't just like lace up your shoes and play. You have to get ice time, which is really expensive; you have to buy skates... my skates by the time I was in high school were $700. Like, you know, I wore goalie skates, Bauer goalie skates, and uh, you know, sponsor the show, Bauer. But even if you're playing out, even if you're playing, you probably have nice skates; your sticks are nice, prob'ly have a really nice stick shaft, and you have to buy new blades.",
            "start": 6178.68
        },
        {
            "text": "but even if you're playing out even you're playing you have nice skates your sticks are nice probably you know you probably have a really nice you know stick shaft and you have to buy new blades and you go through tape like crazy and all this kind of stuff like so yeah and uh so I unintentionally picked these like expensive things and then it like so I wanted to play music and I wanted to play hockey and then I wanted to be a goalie and then I wanted to play drums you could you couldn't be the normal sorry hat you had to be the guy that needed the extra big pads yeah then I remember when I got my first goalie helmet and that's like the most expensive part of the whole thing yeah um and I used to wear like a regular players helmet with like a little thing on the bottom like Chris Osgood used to wear you guys don't know who that is uh and I finally got like a nice goalie helmet and uh some other people had like awesome paint jobs in their helmets and stuff like that and that's cool",
            "start": 6216.68
        },
        {
            "text": "o used to wear you guys don't know who that is uh and I finally got like a nice goalie helmet and uh CU other people had like awesome paint jobs in their helmets and stuff like that and that shit's like mad expensive what was your paint job was it like a skull that was on fire no I never got like a super nice one I had like paint on it but like just like a little design but I actually had like a shamrock painted on the back of mine look cool oh mine would be two face mine would be my my face and then on one half and then the other half would just be the Indiana Jones melting away just skull Greg saw a goalie helmet you like the other day we were watching the Rangers play I hate the **** Rangers but they got dope helmets they got clean shafts Ghostbusters it's all Ghostbusters too list got pulled they're starting go backup goalie who I don't even know who the hell he is when and he it's all Ghostbusters GED his hel it was cool oh that's awesome that's awesome yeah see for me",
            "start": 6252.88
        },
        {
            "text": "pulled they're starting to go back up goalie who I don't even know who the hell he is when and he it's all Ghostbusters GED his helmet it was cool oh that's awesome that's awesome yeah see for me and like milking my parents have money enough thinking about it the video games for the most part I always talk about especially when we talk about used games right like I traded everything I I tried to lessen the blow on them just so I'd get the quantity I want but I still got a lot of games from them but really it was Comics cuz and I remember Comics like the biggest money suck for a kid and that was the thing is like that was like my my dad and I's bonding time he picked me up from school on Wednesday and we would go to the comic shop and buy comics and I remember like they there was no like restriction they didn't put any restriction on it so the pull list grew and grew and grew and I remember at one point you I was getting $50 doses of comics every Wednesday you know what I mean",
            "start": 6291.4
        },
        {
            "text": "like restriction they didn't put any restriction on it so the poll list grew and grew and grew and I remember at one point you I was getting $50 doses of comics every Wednesday you know what I mean and like feeling bad about it but then it wasn't like my you know my dad like it's an investment you know what I mean like at the time think me thinking probably nice that is an investment look like now you're just like super into them and well yeah exactly like and I don't but yeah but I think to him it was an investment of like us together right cuz we've always had trouble connecting you still associate oh my God every time I come back from Comic Con or something I talk to him about it cuz it reminds me of when he would take me we' get three-day passes for Wizard World Chicago which was the Chicago Comic-Con originally right and we would go there and my dad doesn't give a flying **** about Comics does not know much about comics and I would for three days I like this is what is so crazy",
            "start": 6326.12
        },
        {
            "text": "Comic-Con originally right and we would go there and my dad doesn't give a flying **** about Comics does not know much about comics and I would for three days I like this is what is so crazy now especially with our lives going to panels and being on panels and stuff we I never went to a **** panel I would go and troll the floor for books and back issues for 3 days straight wow wow my dad just following behind chilling out talking to me about comics and crap yeah it was awesome but it was like so crazy to think about you know what I mean going through those old boxes yep long boxes looking for stuff trying to convince him to buy like the Platinum Death of Superman thing like $500 and now was worth like jack **** I just I don't know what it is about me I have this weird like if I know I can't afford to get into something I just don't take an interest in it I used to love going to the comic shop there was one in the Canoga Crest center",
            "start": 6365.08
        },
        {
            "text": "I used to love going to the comic shop there was one in the Canoga Center it's my wife don't worry about Kane, Crest Center that's her name it was kill you she'd love it but she'd kill you uh I forgot what I forgot the name of the comic shop was but I used to want all these Comics I was like dude I just like where do you start and they're like three bucks a piece yeah and I only had $20 of allowance and that $20 was generally 15 to 16 that was going toward a movie that weekend a giant tub of popcorn just for me and and a giant Coke just for me and probably a trip to the candy store that was also located there that would also cost about $2 to $3 worth of I used to get like the the king-sized Reese's Peanut Butter Cup cuz I like go salty Savory salty Savory not a big deal I can get into that yeah no I'm with you I mean I know what you're talking about that I mean cuz that's what I would think about and I had",
            "start": 6400.0
        },
        {
            "text": "Cup, cuz I like go salty. Savory salty savory not a big deal, I can get into that. Yeah, no, I'm with you. I mean, I know what you're talking about. That's what I would think about, and I had friends who'd been into comics falling out of comics because they were expensive. Yeah, their parents were like, \"You got to pay for your own habit.\" For me, so we'd go to GameStop a lot for like summers and stuff, and so I'd be like, \"I need what?\" Just like Mama Mia that movie. Yeah, just like Mama Mia. So we'd go, and my dad would take us to the bookstore in the airport, and be like, \"You know, pick out a book. You have a long flight ahead.\" This is before like any of the cool stuff was in the planes, and he'd be like, \"Don't you want a comic book?\" But my dad's from Brooklyn, like yeah, doesn't have no idea. So I'm like, \"Oh, yeah, a comic book that's really cool.\" Like I'm going to cuz I was like a real tomboy growing",
            "start": 6441.48
        },
        {
            "text": "first generation here so he didn't know he's from Brooklyn like yeah doesn't have no idea so I'm like oh yeah a comic book that's really cool like I'm going to cuz I was like a real tomboy growing up so I'd pick up like all the Archies like that's what I thought was like cool yeah that's Cutting Edge Comics so I sort of felt like you know so you had growing up by the way your options were Archie Spawn and like Spider-Man and you're like that Archie that's edgy that kid talking he was rich Veronica he was rich so it probably meant that he was into cocaine that's what it was it was Arie loves it so I felt like you know I never got good direction oh sure sure stop where you could like really invest yeah so and then going to Greek school no one knew you went to Greek School Greek you wear a uniform describe it I went to Catholic school I did you describe it oh okay so I'll describe my uniforms cuz it's not nearly as cool mine was brown corduroy pants and a brown shirt that was",
            "start": 6477.76
        },
        {
            "text": "you wear a uniform describe it I went to Catholic school I did you describe it oh okay so I'll describe my uniforms cuz it's not nearly as bad as mine was brown corduroy pants and a brown shirt that was like cardboard you had to put it on with your arms straight up you couldn't actually finagle like it had to go on just one way or it wouldn't work cuz they were made out of the world's cheapest material I know that material doesn't breathe in high school and then yeah also in when I went to grade school junior high all that stuff like it was like there was like a monopoly where it was like one store where you bought your uniforms for and they were garbage yeah Tim Gettys yeah yeah and they were the starchiest crap you ever wore sponsor this podcast Game Over Greggy we all wear them next week dentist uniforms the starchiest crap please sponsor this podcast available that would be awesome and that's why I remember",
            "start": 6521.28
        },
        {
            "text": "you ever wore sponsor this podcast Game Over Greggy we all wear them next week dentist uniforms the starchiest **** please sponsor this podcast available that would be awesome and that's why I remember when you know you got I got out and went to like college or whatever and like people like oh you went to school must have been so hot seeing girls and like skirts and stockings forever and it was like no was it I don't what and like you get removed from the situation like oh not every person dresses like that or does that you know what I mean that was the thing you took for granted you didn't realize yeah that not when I got to college though cuz I wore a uniform my whole life when I got to college and it was like free dress I was like what the hell do I wear you went you both went to a to a religious school up until College y yeah wow man I I went to Catholic school for a little while I went until fourth third grade and my parents because you had to pay to go to Catholic School yep and my",
            "start": 6563.6
        },
        {
            "text": "school up until college, yeah, wow, man. I went to Catholic school for a little while; I went until fourth grade, third grade, and my parents were like, \"Do you really like going here?\" And I was like, \"I hate it.\" They're like, \"So you can go to this new grade school opening up in our neighborhood instead?\" And my mom, God bless her, she's the kind of person that if it's on sale or if it's convenient, she'll get it in bulk. This thing opened up, and she was like, \"I'm not driving all the way down, 20-minute drive when I can drive in five minutes.\" So she's like, \"Do you want to go to this Catholic school anymore?\" And I was like, \"Yeah, I hate it there.\" Yeah, and I just had this really hard honest adult conversation with my mom when I was like, \"I don't believe in this religion. I don't get anything out of it when we go to church on Sundays; I'm not really into it.\" Honestly, all like",
            "start": 6609.64
        },
        {
            "text": "Hard honest adult conversation with my mom when I was like I don't believe in this religion, I don't get anything out of it when we go to church on Sundays, I'm not really into it and honestly all like that school is brand new and I think it would be really cool that I'd like join it with everyone else that's a kid who's joining it for the first time and make all new friends because I don't really... I'm not connecting with anyone. My mom's like, \"I can't... I can't really argue with that.\" Like, you're okay with any of these points? Yeah, you good? So so yeah, I I ditched out at third grade. How long did you go for? I went from sixth to eighth, so only middle school. Okay, I went to the public elementary just going to public high school. Yeah, well I even went to a private college. Where'd you go to college? You have to wear uniforms? No, a private college. Oh but that's not like... that was like religious. You didn't go to like... I went to a private college. I shouldn't have gone to a private college 'cause I'm paying out the ass for",
            "start": 6647.24
        },
        {
            "text": "no a private college oh but that's not like that was like religious you didn't go to like I went to a private college I shouldn't have gone to a private college cuz I'm paying out the ass for it so yeah I went to you paid that one off a while back pay for I'll be paying for that for the rest of my life though with no Dre this is the funny thing is that all I paid for was my room and board my tuition was free because my mom went there my tuition the tuition in Northeastern is $47,000 a year so like I didn't pay any of that like like I I paid only for room and board and I still owe some like to I've been paying it for seven years I still owe like $38,000 Jesus what did you stay in a mansion with a Ferrari you Magnum P.I. in Hawaii rot remote yeah like like everyone I know like is like it's just like man like it's worth it top 50 School Northeastern's a good school you should go there but but make sure it's make sure it's paid for completely because when you're when you're that's",
            "start": 6680.72
        },
        {
            "text": "like **** man like it's worth it top 50 Northeastern's a good school you should go there but but make sure it's make sure it's paid for completely because when you're when you're that's a good lesson when you're 17 18 19 and and you're signing these like things it's like and you're like whatever I don't give a **** I'm going to go get drunk with my friends now and then I remember when I got my first bill and I saw how much I paid what I owed when I was 22 when I started working I started **** crying I was like holy **** yeah you know like how did I why didn't I do this smarter I should have just my mom lived in Boston like a block away you could have just I should have I could have just sledded with her did you did you live at home when you went to college no no you had you had your own place no my dad I mean my dad was awesome he paid my whole way and oh yeah I time it wasn't happening for me I got Archie Comics but I got to get my college paid for that's pretty amazing",
            "start": 6724.8
        },
        {
            "text": "your own voice no my dad I mean my dad was awesome he paid my whole way and oh yeah I timed it wasn't happening for me I got Archie Comics but I got to get my college paid for that's pretty amazing especially SC because that's expensive too yeah did your sister go there too yeah okay wow I just don't know if it was I don't I often reflect on my experience at Northeastern and I'm like it was it was a good experience I met a lot of great people like Ramone like a lot of a lot of my good friends Ramone's my best friend like I I met a lot of great people there I got a great education and my diploma is worth a great deal because that school is really prestigious but did I really need it you know what I mean like I I often think about that like maybe I should have just stayed in New York and went to like a state school like SUNY and maybe I'd still be in the same place I'm in now I don't know I think I think I I think you I mean if you like who you are I think that's what I do like",
            "start": 6767.88
        },
        {
            "text": "to like a state school like a SUNY school and maybe I'd still be in the same place I'm in now I don't know I think I think I I think you I mean if you like who you are I think that's what I do like the way I am and I like I like saying I went to a good school but I'm like is it worth the the complete FINANCIAL knowledge was it worth it going to SUNY I mean I don't know I'm a huge advocate for education for college um I think it's super important not only for I mean going back or hitting your point like doesn't doesn't matter which school I mean there is a sense of Pride when you can say yeah it's like a huge sense of Pride um but I also think like even if you don't like it's not a huge deal like it's not you know I don't know I don't think it matters but I do think that it teaches you something more than just you know the books and the education like you learn socially so much like I feel like I can be put into any social situation and meet people find friends and kind of like be a social",
            "start": 6808.0
        },
        {
            "text": "more than just you know the books and the education like you learn socially so much like I feel like I can be put into any social situation and meet people find friends and kind of like be a social person which I think is really important that I think a lot of kids nowadays lack I agree and I think I think college moreover my mom always says my mom is a scholar she works in a college in Virginia now and she always says it's not about like what we're teaching it's about like proving that you can do it you know like that you can like just do four years of like what is told to whatever you got to do you got to do to get through she like once you get to graduate school then like you're really studying in depth what you need to know but like this is like saying like I can do it I can do all these different disciplines and navigate through it all really well cuz you're thrown all these different classes that you're like well what the heck am I supposed to take so I'll tell you this because",
            "start": 6844.52
        },
        {
            "text": "different disciplines and navigate through it all really well cuz you're thrown all these different classes that you're like well what the **** am I supposed to take so I'll tell you this because you dodged my question it's just okay what don't worry about it uh as as the only person sitting at the table that went to a school that's not particularly great to hail from I'm jealous of all three of you you went to a UC school no I went to UC Irvine, it's a great school I'm not saying it's a bad school but I know no one that went to UC Irvine like gets into arguments over whether or not their school was better than anyone else's like people from USC do or UCLA or Northwestern, I wish I was at Northwestern, I was like what Eastern um Chicago yeah that's Northwestern is like number two number three in the country nor is like number 40 something I don't know but that's what I'm saying like when you go to SC there's such a point of Pride from the alumni and the lineage of that school",
            "start": 6886.56
        },
        {
            "text": "number three in the country nor is like number 40 something I don't know but that's what I'm saying like when you go to USC there's such a point of Pride from the alumni and the lineage of that school you just don't have that at UCI and so like no matter what it's just that's one extra thing that you're like I got that I went to USC I had that cool experience like I said like that's a sense of Pride but what but what is that like what is pride I have that over you you got a sports team that's cool you can get to watch games with people and be like I went there I experienced those games Mafia heard heard of it no little journalism thing we all get each other jobs and help when we need to really how Tim Gettys got hired at IGN because I worked at IGN so then I when we needed somebody I put in that's actually how Sean Finigan got hired Sean Finigan got hired at at our school or not our school excuse me at at IGN also because I saw on his resume that he went to Irvine and I I was",
            "start": 6921.4
        },
        {
            "text": "I put it on, that's actually how Sean got hired. Sean Finigan got hired at IGN also because I saw on his resume that he went to Irvine and I was like, \"He's got really well of an experience\" and likes hiking, but whatever. Book him no, I called him; I st[...] called him the first question I was like, \"Dude, how was Irvine?\" And he's like, \"Oh, you went to Irvine too.\" And I was like, \"You're pretty much hired 'cause I needed some...I needed it to pay off once for some...I think I've ever used it like, oh you went to SC cool. Like I don't know maybe I'm just not using it right. I don't know; I don't I don't think I don't think it's ever I don't think it's really helped me. I think it's like well he he maybe he's smart or something like that but I don't think it helped me get a job or land anything to me it's like like you were saying like it is an experience like I often think about the uniqueness of going to a school like Northeastern.",
            "start": 6959.76
        },
        {
            "text": "but I don't think it helped me get a job or land anything, to me it's like you were saying, it is an experience. I often think about the uniqueness of going to a school like Northeastern, like I always say, it's a big school in Boston but we always say Greg went to a prestigious school with sports and stuff, which I kind of envy, I went to a school that really cared about hockey and that's weird and we've talked about this on the podcast before, we really love hockey and that's not to have a hockey school where everyone goes to hockey games instead of football is weird and rare and that's cool but I often wonder what it would be like to go to a school like UMass where it would have been like we had a football team and things that were outward facing or a basketball team people cared about I like",
            "start": 6996.16
        },
        {
            "text": "to go to a school like Missoula where it would have been like we had a football team and like things that were like a little more outward facing, like a basketball team that people cared about. I like those kinds of things that I think are pretty interesting that I think have been missed in college. But at the same time, like going and living in Boston for 5 years was an interesting experience - it's a complete winter hell hole. And you meet good people, like I'm not sorry for the people I met in the experiences I had, and if that's the way I had to have them then that's totally cool with me. You know, Boston's a great city for young people to live in. I can't imagine living there now, but when I was 20-22, yeah, come on, come on now - like Boston's a college town, mhm, yeah, not so much. Yeah, that's true. Irvine's a really cool town to raise your kids with a picket fence. I'm not discrediting it at all, cuz it's a great area.",
            "start": 7030.84
        },
        {
            "text": "a college town mhm yeah not so much yeah that's true Irvine's a really cool town to raise your 2.5 kids with a right pick of fence I'm not I'm not discrediting it at all cuz it's a great area it's very clean very upscale but yeah man I mean I would have I I I would have you know I don't have any regrets but I would I wish I would have gone to school in LA or you can't walk a block cuz you like are in Compton I would have been fine with that I'm tough shadow box and his way watch out for him all I do all I want to do he'll throw that sauce at you that makes you **** on the side of the road I mean is great like I had a great time in their film school which I'm assuming you would have gone to I would have liked to have yeah I think I would have squandered it kind College resources are really amazing but you know yeah I mean I don't think you would have gotten that much of a difference we've talked about this before I don't think you would have gotten that much of a difference you say",
            "start": 7067.84
        },
        {
            "text": "amazing but you know yeah I mean I don't think you would have gotten that much of a difference we've talked about this before I don't think you would have gotten that much of a difference you say like oh the alumni list if you called any of those guys up right now like who's really going to help you like the fact that you got help or that you help someone and you too like that's amazing if some senior kid helped like came to me I'd be like tough it out kid yeah like I'm sorry I had to get here like they barely let me eat oatmeal I'll do what I can do but I'm so busy I can't even eat this oatmeal that's how was 5:30 I bought it at 9:00 a.m. yeah I mean I feel bad but I didn't ask anyone for help so it's like yeah you got to work you got to get things yourself but I often say like people people tweeted me sometimes about you know college and about you know they they're like you know some some people are like I got into Northeastern I applied to",
            "start": 7114.84
        },
        {
            "text": "yourself, but I often say like people, people tweeted me sometimes about you know college and about you know they they're like you know some some people are like I got into Northeastern, I applied to Northeastern, that's great, some people are like where should I go and they'll give you like different schools and I'm always like go where you can get the best education right like but don't really honestly if you're 17, 18 thinking about this right now don't be foolish think about the money like just really think about it like don't make make the same mistake maybe I did or Greg did or well my parents paid for it but like where you think like where it's not but but where it's not but where she was even saying like the money's significant and like yeah like I remember like I just was like you know it was cool and it was worth it but it's because I knew I had the experience that I enjoyed there in hindsight right like really be mindful of that because when you get out of college and you're",
            "start": 7156.48
        },
        {
            "text": "know it was cool and it was worth it but it's because I knew I had the experience that I enjoyed there in hindsight right like really be mindful of that because when you get out of college and you're 22 or 23 and you get hit with $500, $600, $700 a month payment for so much when you're young years you know it's a lot now yeah like like just be careful with that kind of stuff like don't just think about the whole picture if you're going to go to a private school especially like just think about the whole picture you can get some really great education um at Public Schools too there are a lot of public schools that are better than private schools and you can get scholarships and all sorts of things like don't be lazy I probably could have done it better and smarter and ask yourself do you need books cuz I didn't use books my junior senior year yeah I just went to class I went to every class took really great notes and there's like two or three questions on the",
            "start": 7192.36
        },
        {
            "text": "and ask yourself do you need books cuz I didn't use books my junior senior year yeah I just went to class I went to every class took really great notes and there's like two or three questions on the test that like you need from the book and it's like all right I'll sacrifice those for $2,000 in my pocket oh my God being a history major was the worst I still go I still go to my mom's I still go to my mom's she has all she has all my books I left all my **** with her when I moved here cuz I moved here right after I graduated college um and so I like go through all my old books sometimes I have some **** I have so many books dude like and how many those books have you opened oh I I read I read parts of probably all of them but like never like but like rarely all the way through and it's like I have like a whole shelf of like Nazi Germany books a whole shelf of that's what they'll find when it all goes down the serial killer he was such a nice boy not Gary books that's the other thing",
            "start": 7227.08
        },
        {
            "text": "I have like a whole shelf of like Nazi Germany books, a whole shelf of that's what they'll find when it all goes down. The serial killer was such a nice boy, not Gary books. That's the other thing: consider man if you want to go into history, that's cool. Half of all historians never find a job in the field and you're going to be spending a ton of money on books what do historians do? They go right about video games, and speaking of I think we've come to the consensus that the SNES was better than the Genesis yeah we never talked about this well let me let me let me let me. I love how every topic like didn't actually end up being great this is what the show's about man but just to reiterate I want to just say uh the book again is called Console Wars: Sega, Nintendo and the Battle of the Worlds that defined a generation by Blake Harris comes out May it's excellent um I really really highly recommend that you buy it and a lot of people have been",
            "start": 7266.4
        },
        {
            "text": "console Wars second Nintendo and the Battle of that defined a generation by Blake J. Harris comes out May it's excellent um I really really highly recommend that you buy it and a lot of people have been asking me about you know some of the other books that they can read just go on Amazon there's some good books on there Masters of Doom and Game Over Greggy other books you should start with you should start a wish list on Amazon people can follow you that's not a bad idea game history is robust there's a lot of good stuff to read about it and uh we're getting to a place now where it's being really appreciated as scholarship and I really I really like books like this it's very well written I was going to say we'd put the link to this book Console Wars in the description of the video If you do the wish list thing we'll put that in there people can go find a whole bunch of stuff so that's your job after you sleep off all these old fashioned which were delicious thank you yeah you you nurse yours",
            "start": 7305.72
        },
        {
            "text": "list thing we'll put that in there people can go find a whole bunch of stuff so that's your job after you sleep off all these old fashioned which were delicious thank you yeah you you nurse yours you sure you liked it you don't have to lie I'm afraid I'm going to get up and then the Uber ride home can you roll on your window I must have eaten some seafood sorry I got to stop doing that wipers on your glasses know better ladies and gentlemen that's The GameOverGreggy Show each and every week four best friends gather around this table each bringing a random topic of conversation discuss for your amusement if you like that go download the MP3 the full show goes live on Friday at gameovergreggy.bandcamp.com then if you don't feel like giving us a dollar we totally are chill with that over on YouTube that's youtube.com/gameovergreggy you can get each topic broken out as a video day by day until that next Friday we post the entire video as a video for your enjoyment",
            "start": 7342.0
        },
        {
            "text": "on YouTube that's youtube.com/gameovergreggy you can get each topic broken out as a video day by day until that next Friday we post the entire video as a video for your enjoyment video video video video video video video video byy t-shirts go to DistrictLines.com GameOverGreggy we talked about Sean Finnigan again he's apparently got his job through some ISM he also likes hiking by that shirt he does you get that Scarpino Shadow Boxing shirt just like Dalton Payne awesome Name by the way oh Dalton Payne 95 bought both shirts he bought the G R shirt and the Colin for President shirt we have about seven shirts up now so you're not allowed to say he bought both shirts and act like that's all of them the two these are the two classics the classics the original run yeah this is the orignal if you watched uh two weeks ago uh when I got the oil all over the Oreo Gasms shirt that did ruin the shirt that did not wash out that is not shocking but you dried it probably so you could have yeah but",
            "start": 7379.8
        },
        {
            "text": "you watched uh two weeks ago uh when I got the oil all over the Oreo Gasms shirt that did ruin the shirt that did not wash out that is not shocking but you dried it probably so you could have yeah but I'm not don't dry the shirt until you stir the stains out of it, gentlemen Greg Miller is one of the three richest kings in San Francisco and gets his laundry sent out and he's not going to leave a note and then the lady's going to come in at 5:30 in the morning she's a nice lady Greg sends his laundry out and then the woman comes at the **** strangest times like every Friday you keep really abnormal hours for a man your age though what do you mean you wake up like 5 in the morning he's like Morty Seinfeld he's like you are man you are you're too **** dinner at 4:30 but then it is that thing at like 6:00 a.m. when he'll start asking you questions and he's like where are you responding to me and I'm like cuz none of us are awake at this ungodly hour",
            "start": 7420.4
        },
        {
            "text": "dinner at 4:30 but then it is that thing at like 6:00 a.m. when he'll start asking you questions and he's like where are you responding to me and I'm like cuz none of us are awake at this ungodly hour not happen this is not not the way it works thank you so much for watching Alexis thank you for joining us we like you more than Tim Gettys you should probably sub that's not true the pure one needs a little filth in here all right got to get a little dirty until next time we'll see you later Pella stop eating that go for it that sounds hard what oh don't you **** do this to me sorry it's fine I okay",
            "start": 7462.88
        }
    ]
}