{
    "id": 820,
    "video_id": "1iYMLCZnuY0",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Thank You, Trav!",
    "description": "Your support allows us to live our dreams!\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com.\n\nBuy our shirts! http://www.districtlines.com/kindafunny\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1430523531,
    "duration": 343,
    "transcript_chunks": [
        {
            "text": "Hey Trav, Trav, this is your video. Thank you for your support on Patreon for the past three months. It's our pleasure to serve you. Now you're one of these types on, you're Trav, you're one of these types, doesn't, doesn't put his last name in there, doesn't have a Twitter associated with it, so he already knows it's making hard for me to dig in like a tick to the internet and suck out the blood about Trav, the tick of the internet, of the internet. Greg Miller, now we have a photo of him. Okay, let's take a look at it. Dashing young man, he's in a shirt and tie here. Click the goddamn picture. I did, that's just, I'm, I'm, you're seeing me click it. I don't know why you're yelling. C all, so I'm going to, to make up a story about this young man. Well, let's go. We see what he's supporting. He's supporting a lot of things on Patreon. Okay, seven things it looks like. Yeah, that one video gamer, the D, he makes cool YouTube content. London Andrews is creating art and photography, the Comedy Button, Kinda Funny Games, and",
            "start": 0.12
        },
        {
            "text": ", Nathan Mun. I know that name. Podcast Season Two and Beyond. He's trying to rip off Beyond. I'll tell you right now, you got a problem. I know him from somewhere. He's a video game guy. I think he might have written for IGN at some point. Let's check . Well, now we're clicking on Nathan's Twitter profile. He follows me, so he's, is already pretty good. It's about books. He's writing about books. Wife out of time for the weekend. I'm hunkering down with my pet army for some serious game dev book. The pet army, that's something El. I don't know. No, he's hungry now with the pet army, his army of pets. He's probably got a couple cats, couple dogs, couple birds, couple maybe a fish, couple Chihuahua. You might have a fish, a Bow Wow, you know what I'm saying? Who let the dogs out? Hey Trav, thanks for supporting this Kinda",
            "start": 33.08
        },
        {
            "text": "Who let the dogs out? Hey Trav, thanks for supporting this Kinda ****. If you would give us more information, we could do things about you, but then we got to go talk to. So let me, let me look at his picture. Take your **** glass of water. Why you got to curse **** ? Let's see, he's, okay, he's wearing a shirt and tie and a jacket, so he's clearly professional. I'm gonna say, I'm gonna say, uh, Trav, well, that's not necessarily true that he's definitely professional. Greg wears a shirt and tie sometimes to pretend like he's not Greg, but Trav is definitely a profession to pretend that he's not Greg. Yeah, nailed that. Yeah, out of the par. He's an eighth grade, uh, science teacher. Oh, uh, Trav specific specifically teaches, uh, chemistry, um , to, uh, but it's not, it's like an honors chemistry. It's chemistry that you would take if you were in high school, gotcha, but he's teaching",
            "start": 73.08
        },
        {
            "text": "s not, it's like an honors chemistry. It's chemistry that you would take if you were in high school, gotcha, but he's teaching eighth graders in that's impressive and he's, uh, 32 years old. He went, um, to La Salle University and, um , otherwise it's pretty, it's pretty unclear. Jump in. Yeah, jump in. He a fetish for feet, Jesus, and, uh, really enjoys Van Halen, uh, Van Halen a lot. Yeah, yeah, just every, he has to play when he wakes up in the morning, Ain't Talking About Love or else he just doesn't feel right. Mhm. And now, all right, so I wanted to read, I was like, where is La Salle University? La Salle University is a private co-educational Roman Catholic University located in Philadelphia, so he's a fan of the Phillies and the 76ers, but he doesn't care much for hockey, so he's not a Flyers fan, um, and he's sick of the **** Eagles cuz they're fans, aren't we all right? They're too much. Yeah. Mhm. So that's, that's the, the fiction I've written about. I like that.",
            "start": 118.44
        },
        {
            "text": "'s, that's the, the fiction I've written about. I like that. And fiction sometimes, well, what is it? Fact Stranger Than Fiction or fiction is Stranger Than fact, truth is Stranger Than Fiction, is truth Stranger Than fact or basically the same fact truth, who is London Andrew Than Fiction in that London Andrew she art photography? Oh damn, what's up? Know me is London and is model for the last few months. I've been volunteering on projects all over the world. J R Peru on a construction team to help **** ton of money from only 991 people. Yeah, it's about $100 a person. So let's see, I'm trying to wrap my head around. So what she's making videos and art photography and she's traveling the world. Her Milestone is if she hits $99,000 a month, she'll go to Hawaii . C on ph call, that's your mil St. Yo, if I can make $9,000 a month, I'll go to",
            "start": 174.56
        },
        {
            "text": "to Hawaii. C on ph call, that's your mil St. Yo, if I can make $9,000 a month, I'll go to Hawaii. Well, I think she'll do like a meet and, um, that I thought it was good. She'll take photos in Hawai . Oh, maybe she will take photos in. She's just going. I think that's what she means, but I love that Colin initially just jumped. Wait, Google search her. She, she's a model. She's got to have more pictures than just the one. This could be a start of something. Get $10,000. Well, because there's a 10,000 one. It says Europe. Go back up. $110,000. If I hit $10,000 during any month in 2015, I will book a trip to Europe, France, Italy, Greece, Spain. What are you gonna do there? Nude model. Oh, now on her Twitter, she's a nude model. Great. Now I've got to go. There's a way to do this. Okay, you're not doing it right. You go to Google, you copy your name, you type something after it. What we see what happen starts with an N ends",
            "start": 226.52
        },
        {
            "text": "Google, you copy your name, you type something after it. What we see what happen starts with an N ends with the D, the UD. Oh dear, I don't think you need it. I, it seems like her, that's her thing. I don't even think I need to put in nude, do I? I'll put in, is you safe search on? Of course it is not. I'm Greg Miller. Oh my God. Yeah, she's got something, she got a lot, she got something special. I like her. Would you send her to Hawaii? What click on this one? Good Lord, what is that? I don't know. I got to Greg. I'm not going to lie. This, this, uh, requires more Scarpino research, way more research. Well, Trav, thanks for introducing this into our lives. Thank you for all your support on Patreon . We will talk to you soon. Thank you. Just took it up a notch. Bam or this one, six, seven notches.",
            "start": 274.36
        }
    ]
}