{
  "id": 867,
  "video_id": "6b2EnOLLr94",
  "show_name": "Gamescast",
  "hosts": ["Greg Miller", "Colin Moriarty", "Portillo"],
  "title": "Learning to Love Zelda Again, Destiny v. The Division - Kinda Funny Gamescast Ep. 20",
  "description": "What does Zelda Wii U have to do to win over Colin and Greg? A reader asks, we debate, and then, talk about if The Division is set to be the next Destiny.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1432299600,
  "duration": 4002,
  "transcript_chunks": [
    {
      "text": "what's up everybody Welcome to episode 20 of the Kinda Funny Games Cast . I'm one of your hosts, Greg Miller, alongside he only does everything Cal War already. It's good to be here for you uh or with you not for you. I'm really tired. Why you so tired? It's just been a long week. Yesterday was a day that was exhausting for me, I think. And so I sure you ran a marathon. Yeah, of course . It's Kinda Funny Live week. You might be wondering where is the pure one, Tim Gettys? Dy finally croak? No, still alive, still kicking, still with his girlfriend. Uh, he's getting ready for Kinda Funny Live. He's editing videos, doing all these different things. Of course, Kinda Funny Live, Colin here in San Francisco two days from now, Saturday. It'll be the past most likely for you. What is what is Kevin pointing at? I'm just excited. You're excited about Kinda Funny laugh good. What is Kevin pointing at? I don't know why he pointed at the god. He's like Sabu all of a sudden pointing Jes two two days till Kinda",
      "start": 0.31
    },
    {
      "text": "I'm just excited. You're excited about Kinda Funny laugh good. What is Kevin pointing at? I don't know why he pointed at the god. He's like Sabu all of a sudden pointing Jes two two days till Kinda Funny Live here in San Francisco. 400 fans from around the world coming to watch whatever the hell we're going to do. Uh, last night of course Justin came by. Justin a fan of Patreon who had bought your sauce M you you made the sauce for him. I did, yeah. It was just a crazy day yesterday and so we were just running around. We did a podcast, we did a bunch of you know other things, the live show had to set everything up, whatever. And I just woke up like 10 minutes ago. Yeah, but I'm spry. I'll tell you what, I'm I'm ready. You sound like you smoked a pack and a half on yeah. Oh, I did. I did. No, I didn't. So I don't smoke cigarettes, but here's the thing, Greg, here it is. You by the way, you can smoke cigarettes if you like to smoke cigarettes. I don't want to judge you if you smoke cigarettes. I smoke smoke cigars.",
      "start": 41.12
    },
    {
      "text": "smoke cigarettes, but here's the thing, Greg, here it is. You by the way, you can smoke cigarettes if you like to smoke cigarettes. I don't want to judge you if you smoke cigarettes. I smoke smoke cigars. Yeah, you smoke a good cigar once in a while. Uh, but I don't smoke cigarettes, but uh I'm just I'm quite tired and I don't understand why I sound like I smoked a pack and a half a cigarette. It's just a tire when you're worn out like that, you get sound like that. Uh, I feel like I got a good night's sleep. Do you have allergies? I don't. Okay, not that I know of. Yeah, those things do develop later in life sometimes. See when I moved here I I started up with allergies and it's been bad for me this year where I've been popping uh alros all left and right or maybe Claritin, whichever. You don't even know what you're taking. I just take Christine's like here here's a white pill and I wake up three days later and my pants are on done. I'm like that was weird. Wow, that's **** up. Well, I mean I imagine three days",
      "start": 75.92
    },
    {
      "text": "taking. I just take Christine's like here here's a white pill and I wake up three days later and my pants are on done. I'm like that was weird. Wow, that's **** up. Well, I mean I imagine three days I'm taking my pants off somewhere. Maybe you don't how would you how do you go to the bathroom? How do you go to the bathroom ladies and gentlemen? How does Port go to the bathroom? Take him outside poops and peas. Laundry lady came today . She beat me here before I was able to take Portello outside. So then I and she likes to she likes to pet the the Portilla. So I was like hold on we'll go outside and she pet him outside and did the baby talk. He didn't pee at all real waited. He waited till he got to a tree cuz he's a good little boy. Well, he wasn't a good little boy when Axium Verge guys were here. You know that's all over the godamn place. That's Tom and Dan's own fault. They should have known better. Portilla, don't look at me. Don't look at me. Portilla look at Portilla. I don't want to I don't want you to",
      "start": 110.4
    },
    {
      "text": "that's all over the godamn place. That's Tom and Dan's own fault. They should have known better. Portilla, don't look at me. Don't look at me. Portilla look at Portilla. I don't want to I don't want you to look at me. I don't want you to stare me. Look, he actually looked away. He just looks down at the Superman. I don't want you to throw one of your hexes and one of your jinxes at me, you weird ****. He's a dog witch. He's just putting curses and weird things on you doing dog Voodoo. He's got a little voodo doll me. We know when he goes and plays with his little to sque aking it's you. It's just me. Yeah, and then I start having stomach pain. No, your head's slobbery. It feels like it's slobbery for no reason. All right, so Tim's gone means we can do whatever we want. We went to the community for the topics so we can get some good stuff here instead of usual Tim crap of like hey what do you think of the 3DS Library? Like I don't oh it's incredible incredible arguably the greatest of all libr all the hand",
      "start": 148.4
    },
    {
      "text": "so we can get some good stuff here instead of usual Tim crap of like hey what do you think of the 3DS Library? Like I don't oh it's incredible incredible arguably the greatest of all libr all the hand libraries. I was going to say we I was going to try to get you to quietly look over Kevin cuz he was in a he was in a conundrum there. He can't be on camera. He was trying to get something out of the desk drawer but all the poster tubes are blocking the drawer. Are you going to write on notes on that's probably not a good idea. You probably should get a notebook of some sort. Yeah, go in there just push the push the things out of the way. I think I move that notebook. I feel like I have like 300 notebooks in there. Like I'm if you go to the second drawer there coling in the green thing there's plenty of notebooks. I feel like if you write on that what is that? Yeah was it it looked like a course catalog. Are you taking college classes? Are you trying to get out of here? No, I no this is not you him no",
      "start": 185.48
    },
    {
      "text": "of notebooks. I feel like if you write on that what is that? Yeah was it it looked like a course catalog . Are you taking college classes? Are you trying to get out of here? No, I no this is not you him no but I know but what he was about to write on was the instruction manual for that board. I think it's the catalog they're trying to sell us more. Okay, all right you could have written on that that would right. I feel like cuz I feel like you might have been full of regret maybe even right afterwards if you didn't noce that thing for years. Kinda Funny Games Cast fans it sounds better today. We have a much fancier board now that's canceling out table noises and all these different it's it looks like the Starship Enterprise. I'm going to **** play with that thing so much when you guys aren't here. I'm going to **** with so many buttons and touch knobs and switches. Oh my god oh knob switch our favorite game please Lord have it off cuz if you change one of the saved settings wait so if well I'm",
      "start": 223.32
    },
    {
      "text": "going to **** with so many buttons and touch knobs and switches. Oh my god oh knob switch our favorite game please Lord have it off cuz if you change one of the saved settings wait so if well I'm being serious if I shut the thing off and then I start **** with **** it won't matter if it's off and you press buttons and flip snobs it won't matter that's awesome It's All Digital. I'm going to come in here in the middle of the night but don't the knobs have to go back to where they were right no they don't what about the sliders they move on their own they move on their own no **** way I press a button and it switches I for the record this is why we can't afford healthcare for you but it's awesome just to let you know just so you're all excited about the knobs moving on their own you got to be excited about something it's **** worth it don't get sick don't get yeah keev keep saying that you keep tempting fate I think it's a very it's a very poor you've never gotten sick maybe a",
      "start": 257.76
    },
    {
      "text": "got to be excited about something it's **** worth it don't get sick don't get yeah keev keep saying that you keep tempting fate I think it's a very it's a very poor you've never gotten sick maybe a couple times but it was bad stuff tough stuff like real like real sicknesses killed the normal man wow for sure that's impressive what you have bronchitis huh I was going to say something maybe more like tuberculosis or something like that oh yeah that too typhoid tyo typhoid Kevin walking around you have dentary are you sure I'm classy I okay I have four questions here for four tops if topics go short we can pepper in other ones but the the highlighted ones are the ones we're going to do so I'm going to give you the names of the question submitter you choose the first topic we have George Cameron Kinda Funny Kevin Bacon and Scott Cameron alphabetical order Cameron says 16 minutes ago when you copied it yeah I would love for you guys to talk about The Division do you think it will be",
      "start": 294.08
    },
    {
      "text": "Cameron Kinda Funny Kevin Bacon and Scott Cameron alphabetical order Cameron says 16 minutes ago when you copied it yeah I would love for you guys to talk about The Division do you think it will be another Destiny ? Now this is an interesting topic. I I like the topic and the fact of do you think it'll be another Destiny? What is Destiny to you Cameron? Does he mean will it be a super successful game where people are hooked on it and playing it for I think that's probably what well yeah I think he probably doesn't necessarily mean that last part but more of a game of So You Think Cameron means it in the good in a very positive way yeah The Division looks like it's going to be way better than Destiny so it's it it I'm not I don't think it's going to be you know I played Destiny five six seven hours it to me it came off as a very sterile shooter sure um it's because I don't play with other people I acknowledge I'm proba not playing it quote unquote the right way MH um but there was",
      "start": 337.96
    },
    {
      "text": "seven hours it to me it came off as a very sterile shooter sure um it's because I don't play with other people I acknowledge I'm proba not playing it quote unquote the right way MH um but there was something that didn't you know I know people you should have been able to play Destiny by yourself and I I I think that there's a way for you to do that effectively but it didn't seem like it was very fun. I found myself going to the same Maps fighting the same enemies in the same places you walk away from youd walk away from the place on the map and go back and they'd still be they'd be there again they just respawn like there was a monster closet there um no I think he probably means will it be you know a game that has long-term ramifications for its publisher in terms of you know putting DLC out and all those kinds of things that's my assumption is what he means and you think it will be no okay I think The Division is very different game than Destiny I don't think you compare those two",
      "start": 381.6
    },
    {
      "text": "out and all those kinds of things that's my assumption is what he means and you think it will be no okay I think The Division is very different game than Destiny I don't think you compare those two games at all. I think Destiny is going to be a more it's squad-based so I I I I and it's not an MMO and it's not loot based I don't think random that's my whole thing like you're so quick to say that you know The Division looks way better than Destiny I don't feel like we've seen enough of The Division not that I'm willing to say you're wrong I do think personally what we've seen of The Division it looks like a better game like in terms of like just alone visual stylings uh what you're doing squ the way the squad works but I don't know if it's fair to compare the vertical slice we saw two years ago to what Destiny is right now right that's true I I just think to me it looks like a medie shooting or RPG shooter yeah and that's not what Destiny is sure Destiny has a level system that doesn't",
      "start": 419.92
    },
    {
      "text": "ago to what Destiny is right now right that's true I I just think to me it looks like a medie shooting or RPG shooter yeah and that's not what Destiny is sure Destiny has a level system that doesn't really make any sense to anyone Mo it's a light come on and and it it it seems it just seems like a more granular game it seems like frankly The Division is just a more going to be a more hardcore game than than than uh than that's interesting so what do you now what do you there so you're saying more hardcore game you mean more hardcore in in its systems okay yeah I I I'm not saying hardcore people Destiny is not played by hardcore people of course it is I mean that's why it exists yeah Alfredo's put how many Destin's put how many hundreds of hours into a FR and stuff but I think Destiny is going to be ultimately going to be an easier game to wrap your head around and an easier game to understand why there's a um a gravity toward it you know towards playing it over and over again well I",
      "start": 460.04
    },
    {
      "text": "going to be ultimately going to be an easier game to wrap your head around and an easier game to understand why there's a um a gravity toward it you know towards playing it over and over again well I think The Division is going to be a more Str Al role playing game I mean that's always the vibe I've gotten from the game that's why I'm excited about it of course the settings like really cool and the story is really cool and all that um and the Tom Clancy Vibe of course in a lot of games is cool but um even though Tom Clancy has nothing to do with this and obviously is deceased RP Tom Clancy what up um but am I pointing to Kinda Funny Live or Tom Clancy we'll never know we don't know if Tom Clan's uh up there with God okay let's not go that way why what do you mean I don't know if he's up there with God how am I how how would I know that cuz the normal people are going to think you think you're saying he might be in hell why would I I'm huge Tom Clancy fan why would I assume I don't",
      "start": 498.96
    },
    {
      "text": "there with God how am I how how would I know that cuz the normal people are going to think you think you're saying he might be in hell why would I I'm huge Tom Clancy fan why would I assume I don't know why would you throw that out there maybe Tom Clancy's Widow Andor children are watching right now they didn't need to be reminded that they liked the Sabu reference and now you're you're making one of my favorite pieces of fiction is Red Storm Rising yeah but did you ever hear the song Mojo Rising by The Doors uh I know the doors I don't know if I know that particular Mojo Rising oh yeah yeah that's a great rendition thank you Greg for that nailed it copyright strike yeah we're going to get a copyright strike for that uh no so I I think that that's just where I stand on that I think that I think people are going to play Destiny for years it would be easy to assume that if The Division really did come out Q1 2016 which is what they're aiming for now um that people will still be playing",
      "start": 532.56
    },
    {
      "text": "think people are going to play Destiny for years it would be easy to assume that if The Division really did come out Q1 2016 which is what they're aiming for now um that people will still be playing Destiny in greater numbers than they're playing The Division after a few months of The Division being out so so it's it's The Division seems like it's going to end you're going to get to the end of the game and it's over not whereas Destiny is like the constant loot treadmill right of I got to keep going to keep my level up get through these dailies so I have all this so I can buy the next piece of armor when the next DLC D sounds thrilling um MMOs yeah yeah yeah so I think Destiny's got you know obviously got legs for forever okay well not forever but for a long time yeah I think The Division will come out people will like it it'll do fine and then it'll just disappear and you probably get a sequel yeah I was going to say remember yesterday on col GRE were talking about UB was saying that",
      "start": 567.04
    },
    {
      "text": "will come out people will like it it'll do fine and then it'll just disappear and you probably get a sequel yeah I was going to say remember yesterday on col GRE were talking about UB was saying that they see it as a new franchise they're already calling it a franchise so they're they're committed to doing more but that's Ubisoft I guess in general yeah they've worked on this engine for so long and this game has been so delayed that they bet they probably look at it as it's like the it's like Watch Dogs where I'm surprised they just haven't **** and gotten off the already with The Division just been like all right we're getting it out and we'll fix it later I mean that's kind of what they did with Watch Dogs I mean Watch Dogs was I played Watch Dogs for a few hours and I'm like no no thanks I yeah I was like I see I was like I see where this is going I'm good you know what I mean yeah to me I'm way more interested in what the sequel does nice idea again Ubisoft's a good I think",
      "start": 605.8
    },
    {
      "text": "thanks I yeah I was like I see I was like I see where this is going I'm good you know what I mean yeah to me I'm way more interested in what the sequel does nice idea again Ubisoft's a good I think Ubisoft still got its groundedness unlike some other big Publishers yeah it might be losing it but it seems like you would assume that and I don't want to make I don't necessarily want to make assumptions like this but you would assume that that it takes a lot of restraint to say like The Division's coming out this year and like regardless of when it's like we need to get it out and uh they're not doing that so but they also don't have to do that you know they have Assassin's Creed this fall yeah um isn't Rainbow Six's fall too is it is there is that was wasn't it I thought it was on the uh I don't know think it my assumption was that that game was really far away but I guess it's not or they could be they could be just pouring all their resources and then getting that out thinking that",
      "start": 635.16
    },
    {
      "text": "I don't know think it my assumption was that that game was really far away but I guess it's not or they could be they could be just pouring all their resources and then getting that out thinking that that's the I mean people were really excited about that game went through way more excited than they are about The Division so maybe it just makes more sense for to put internal resources into finishing that first or getting that out or getting that polished and Q8 um so yeah still saying 2015 yeah that's great I have no interest in that game really yeah it looks great just cuz it's multiplayer yeah I just want to play that for me it looks like Left 4 Dead you know but I mean copson robers Left 4 Dead which I'm great which I'm down for it looks cool it looks great I have I have nothing against it it's just I know that game is not going to interest me so I'm just like not even put you can't play by yourself yeah I've still The Division when I heard that you can just play it by yourself if",
      "start": 675.28
    },
    {
      "text": "it it's just I know that game is not going to interest me so I'm just like not even put you can't play by yourself yeah I've still The Division when I heard that you can just play it by yourself if you want was like I was like that's fine that's great but do you think it's like a destiny play it by yourself I hope not I mean uh I like the level progression idea and stuff like that so I want to just walk around New York City by myself and just encounter what I encounter and find what I find sure I think that's way more eerie than playing with other people it almost the the setting of Rainbow Six Siege or the idea behind Rainbow Six Siege makes sense with other people to me The Division should have been designed as a single player game that would have been more eerie walking around New York City in Perpetual **** Christmas decorations with a terrible Black Friday virus going around is way scarier by yourself I have no idea why they made that let me tell you game called Prototype then",
      "start": 707.8
    },
    {
      "text": "City in Perpetual **** Christmas decorations with a terrible Black Friday virus going around is way scarier by yourself I have no idea why they made that let me tell you game called Prototype then let me tell you a little about a little game called Prototype and Prototype 2 Platinum Prototype 2 terrible yeah you did uh terrible different kind of game Prototype 2 was awful that was that game sucks was awful yeah it was awful game sucks the first prototype was bad too they were both bad prototype one was worse than Prototype 2 um yeah that's true yeah long we agree on that yeah we'll shake on it like we're businessmen that's what I like we are businessmen that's one word for it are you worried or do you I mean The Division I guess for me it's The Division's delay I thought was out of the ordinary right I feel like this is getting into Watchdog's territory where I'm kind of sick of hearing about this game without just **** having this game you know what I mean Watch Doogs was at like",
      "start": 739.56
    },
    {
      "text": "right I feel like this is getting into Watchdog's territory where I'm kind of sick of hearing about this game without just **** having this game you know what I mean Watch Doogs was at like what two two E3s was it three E3s yeah I think it was three wasn't it like the first next game it was it was the first and they wouldn't say that they were like I can't tell what platforms it's coming to and like um yeah I don't know I I actually feel like they haven't really talked about The Division that much I think that more we in the media the yeah I guess we're really not the Press anymore but just the the whatever the uh the commentators and and and of course the press the literal press have been talking about The Division way more than I think Ubisoft has been yeah um because and I think that's a good sign for them because people are excited about it because it looks **** good you know that game looks good I'm I'm skeptical as hell about Watch Drugs 2 I don't care about Assassin's Creed",
      "start": 780.04
    },
    {
      "text": "a good sign for them because people are excited about it because it looks **** good you know that game looks good I'm I'm skeptical as hell about Watch Drugs 2 I don't care about Assassin's Creed Far Cry 5 has got to be which which Far Cry is awesome that's got to be really far away so yeah of course so for for me I'm more excited like I am more excited for Watch Dogs 2 then I am The Division knowing what Watch Dogs one was for cuz totally on the Assassin's Creed trajectory right where the original Assassin's Creed came out you're like o this is Half Baked there's good stuff here but it's just not for me and then I thought Assassin's Creed 2 was awesome and so like I figure with Watch Dogs it'll be tightened up honed in you're this vigilante go have fun because the Watch Dogs on paper should have been a game I was totally into right like you're just vigilante around Chicago running around like trying to protect things but it just didn't work it got boring after a while and I wasn't",
      "start": 816.12
    },
    {
      "text": "have been a game I was totally into right like you're just vigilante around Chicago running around like trying to protect things but it just didn't work it got boring after a while and I wasn't into it you know what I mean you fix some of the mechanics you put it back out for two I'm great Division I still feel like I know I like the idea and the gameplay looks cool but I'm still in this mode like I just haven't played it I think that feels like a game I'm going to have to need to play a mission I be like all right I got it I'm on board yeah I suspect that my indifference to Grand Theft Auto 5 when it came out and then to watch dogs is just signaling a shift in my own opinions on not open World Games cuz I love open world games but these like driving around cities doing missions like or whatever like I I you know it's just like I need something more a little more revolutionary I feel like I feel like the reason that Far Cry I like like Far Cry so much is because it's just a different",
      "start": 853.4
    },
    {
      "text": "like I I you know it's just like I need something more a little more revolutionary I feel like I feel like the reason that Far Cry I like like Far Cry so much is because it's just a different kind of shooter I like Shooters generally I like playing Shooters a lot um single player ones but Far Cry is like an open world shooter I was like why is and crisis obviously was inspired by by that and stuff but it's just like why not do this more often like why are we open world Shooters should be done open lots of open world Shooters Borderlands yeah Borderland but Borderland is very structural you know what I mean like like I feel like I feel like that game is its own Beast I don't feel like that's really an open world shooter so you you when you're defining open World shooter you mean in the way of like Far Cry you can just wander not have a mission you're going to get attacked you're going to hunt wolves and **** like that and get PS border is nonlinear and it is open world but it's also",
      "start": 890.52
    },
    {
      "text": "of like Far Cry you can just wander not have a mission you're going to get attacked you're going to hunt wolves and **** like that and get PS border is nonlinear and it is open world but it's also like geographically based there are load times and places like it's not an open it's not really an open world okay um and I'm sure that they just couldn't get to run like that I'm sure they would have loved it to have been like that sure but it's not like that too many guns in there too many gun variant Borderland is good I like Borderland I like the idea of Borderlands um more than I actually like playing it but um I still want to play the Pre-Sequel so here's my oh it was good I enjoyed myself a lot with that me and Christine had a good time with that here's my question for you then piggybacking off what we're talking about here what are your thoughts leading into Metal Gear Solid 5 The Phantom Pain an open world Metal Gear what does that do for you does that excite you as a different",
      "start": 929.64
    },
    {
      "text": "off what we're talking about here what are your thoughts leading into Metal Gear Solid 5 The Phantom Pain an open world Metal Gear what does that do for you does that excite you as a different kind of third person shooter or does it put you off as just another open world game no the Mystique around Metal Gear is I think more exciting than the structure of it I'm actually a little disappointed that Metal Gear is open world so it's it's it's that's not really Metal Gear to me Metal Gear is like a little bit of backtracking and a little bit of nonlinearity but the Metal Gear games that I that resonated with me most one and two were not like that so you did thing yeah I feel like that's more of re re I believe that middle gear sou 5 will be a great game but um it seems making an open world like that makes seems like a very reactionary move like that's not really what your game is that's not really what your series was and I don't understand not everyone has to do that to make their game",
      "start": 961.16
    },
    {
      "text": "that makes seems like a very reactionary move like that's not really what your game is that's not really what your series was and I don't understand not everyone has to do that to make their game effective not everything has to be The Witcher like you don't have to have these sprawling open worlds it gives you a lot of freedom and a sense of awe which I think is cool but middle gear was more about a sense of intrigue and mystery and stuff like that it was story based right it was for a long time I that's what I loved about middle gear one was the fact or middle solid the fact that you were going through and you're trying to figure out what's happening and how do I stop this thing you know what I mean yeah I mean as far as games coming out that day in September I'm way more excited about Mad Max and I am about midle gear that's another open world one yeah I mean that but I mean like that makes sense to me yeah Avalanche open world and then Mad Max Universe makes sense yeah so um but no",
      "start": 1001.84
    },
    {
      "text": "Max and I am about midle gear that's another open world one yeah I mean that but I mean like that makes sense to me yeah Avalanche open world and then Mad Max Universe makes sense yeah so um but no I'm I'm I'm interested to see it's cool people are trying things out it just seems like that's the Ze guys right now is like open world and these decisions were made years ago so you can see that slowly trickling out and then it'll it's the same thing we were talking about some some episodes ago with player agency and stuff where everything had have choice in it and you can see the legacies of Mass Effect in Fallout 3 all over the place and now it's starting to slowly Wayan because everyone's like well we don't want to do that anymore um tell your story whatever there's nothing wrong with that but that's not what every not every game needs to have that sure it seems like arbitrary ass games had like these arbitrary choices you know it didn't even matter it has to be meaningful like and",
      "start": 1034.2
    },
    {
      "text": "but that's not what every not every game needs to have that sure it seems like arbitrary ass games had like these arbitrary choices you know it didn't even matter it has to be meaningful like and that's the same way when you have design philosophies of open world has it can't just be an open world for the sake of being an open world it must be a meaningful open world I believe Kojima made it probably a meaningful open world but I still don't feel like it feels like Metal Gear to me or sound I never played it sound like Metal Gear to me on June 9th I can tell you all about it right now I can't say a goddamn word because I played it that was a creepy that was really probably almost an unnecessary face that you made man hey Tim's not here to stop us Portilla sick him you're a real monster aren't you he he could get there he could get it he can get something he can get somebody you've had to saw a story on the news not too long ago about a wiener dog protecting its owner from a bear so",
      "start": 1067.24
    },
    {
      "text": "aren't you he he could get there he could get it he can get something he can get somebody you've had to saw a story on the news not too long ago about a wiener dog protecting its owner from a bear so there you go got the bear distracted bear **** up the wiener dog but it I have no doubt about it but he backed off we do had like a scar or whatever like you know oh yeah he survived the bear bite him in half take him down way I know it's just like when Pella comes after another dog dog's always bigger Pell comes charging like a **** insane person the Big Dog's like what is wrong backs down like holy **** dude it wasn't a thing go away that's why I won't walk BTO I know I understand cuz I told you I don't want to be responsible for this dog being inevitably killed by another dog I know how I'll do that one day and when that happens that he went out doing what he loved the only way it could be more what he loved is if he was eating poop while he did it oh he used to love eating",
      "start": 1116.48
    },
    {
      "text": "know how I'll do that one day and when that happens that he went out doing what he loved the only way it could be more what he loved is if he was eating poop while he did it oh he used to love eating Chloe's poop when she Liv there she loved it he loved a good piece of cat poop yeah that was see that was the thing is that we we you know we used to make fun of Mike for not cleaning the litter box up we should have just let Portell eat more of the **** sure natural natur selection it's very natural yeah I mean he would have done it if if he was running around with his wiener dogs in the wild they'd be eatting **** left and right it'd be probably fine I always dreamt of seeing that just a herd of wiener dogs running through the countryside not like wild I mean like had a weener dog meet up get like 30 wiener dogs together let them all Run free I mean the fact of the matter is that you got to this dog through a series of intentionally **** **** up genetic decisions made by",
      "start": 1154.12
    },
    {
      "text": "meet up get like 30 wiener dogs together let them all Run free I mean the fact of the matter is that you got to this dog through a series of intentionally **** **** up genetic decisions made by breeders over hundreds of years I mean that's just the that's just the reality of the situation I know I'm well aware and that's he hunts Badgers yeah it's just dog breeding is really interesting that's for another time though yeah that's for a different show probably yeah probably not this show all right topic two you can have George Kinda Funny Kevin Bacon or Scott George I'm putting a one here George Barrett writes in and says what does Zelda Wii U need to do to make you fall love with the franchise again are you out of love with the Zelda franchise are you not in love with the Zelda franchise I'll always be in love with Zelda there you go that's what I think too I yeah I mean like Skyward Sword didn't do anything for me but I loved uh Link to the Past or Link Between Worlds uh you",
      "start": 1189.32
    },
    {
      "text": "I'll always be in love with Zelda there you go that's what I think too I yeah I mean like Skyward Sword didn't do anything for me but I loved uh Link to the Past or Link Between Worlds uh you know what I mean like I'm I still love Zelda I still cheer for Zelda I still want Zelda to be great I'm not like being a Zelda hater no I I I want Zelda to be great too I don't think Zelda's been great in a long time with the exception of Skyward Sword which I can't talk about cuz I didn't play I just was not going to dig out my Wii from wherever I still have no idea where my WI um it's it's somewhere I heard that sky was very meaty but that but that was almost like a I don't know we're getting off track cuz yeah I put maybe five hours into it and I was just like I'm not committing another 35 to this you this is not what I want to do yeah just Zelda needs to not necessarily change but do something different the way the way like and what I mean by that is it doesn't need to be what it's not you",
      "start": 1234.04
    },
    {
      "text": "- you this is not what I want to do yeah just Zelda needs to not necessarily change but do something different the way the way like and what I mean by that is it doesn't need to be what it's not you know it doesn't need to be what it's not but it needs to do something just a little bit differently and I think that that's getting back to what it actually is and and not try to like reinvent the wheel the reason that people love like Ocarina of Time was because it was Zelda that was like what you assumed a Zelda game was it's dungeons it's a little bit of exploration finding heart pieces and doing all those kinds of things now all the other Zelda games after that have that but they try to like pigeon hole or I'm sorry not pigeon hole shoehorn new features in to these games or make them a little different to just make them different I feel like you could just make Zelda's good enough structurally where you could just make minor differences tweak the story tweak the characters tweak The",
      "start": 1272.36
    },
    {
      "text": "different to just make them different I feel like you could just make Zelda's good enough structurally where you could just make minor differences tweak the story tweak the characters tweak The Dungeons and kind of just release a prettier version of Zelda or a better version of Zelda over and over again now that's a little hypocritical of me to say because the most different Zelda of all is Major's Mask and that's my favorite but I think that that stood out because it was still Zelda it was still recognizable Zelda game Link was still recognizable as Link there was no motion controls there was no stylus controls there was no 40-hour campaign all those kinds of things and I think that when you throw those kinds of things in it's it it becomes less interesting you know I feel like it gets away from the core of what it is yeah I feel like Zelda's a super special series and there wasn't any bad Zelda games in the Core Series unless you find kind like CDI games and stuff like that until",
      "start": 1314.76
    },
    {
      "text": "away from the core of what it is yeah I feel like Zelda's a super special series and there wasn't any bad Zelda games in the Core Series unless you find kind like CDI games and stuff like that until you know until I I think Twilight Princess and I know people like that game but I was like this game kind of sucks like I I I feel like part of it is because I had to play it on the Wii as I've explained many times before and I and that motion control sucked and I just felt like the game was just I was just like this what is like a goat's running down the hill and I'm trying trying to stop it from running and I'm like what the hell is going on in this game like I just want to play like why can't I just hold a controller I don't even understand like why they made these certain decisions which turned me completely off to Skyward Sword and then uh Phantom Hourglass I think was there or was it was it Phantom Hourglass that came out first no Spirit Tracks came out first yeah and I was I was so",
      "start": 1352.44
    },
    {
      "text": "me completely off to Skyward Sword and then uh Phantom Hourglass I think was there or was it was it Phantom Hourglass that came out first no Spirit Tracks came out first yeah and I was I was so excited I didn't read anything about it I was like you know which is probably what my fault but I was like I'm so excited about I don't want to know Zelda more Zelda on handle going be great I love you know Link's Awakening uh I really love the Oracle games four Swords was awesome so it's like I picked that up and and I played it for five minutes and I'm like nope nope like I'm not controlling this game with a stylus why would you ever think that I want to do that why the **** would you ever think that I wanted to do that yeah and then they released another one same thing don't even bother with it so I feel like and Minish Cap I think was a step in the wrong direction too for different Minish Cap which is a weird kind of weird game but so for me Zelda was just on the way now I agree with you",
      "start": 1386.24
    },
    {
      "text": "so I feel like and Minish Cap I think was a step in the wrong direction too for different Min ish Cap which is a weird kind of weird game but so for me Zelda was just on the way now I agree with you that uh A Link Between Worlds was pretty cool but A Link Between Worlds is a link to the past so like it was cool in that being in that world again and playing that world again but it didn't feel fresh or new at all sure it felt like a really well done fan sequel kind of and I don't mean that as an insult saying like it's crude it's not it's just like that world is kind you felt like you had been there before yeah that world is that that version is all the sacred and I don't need to see that again there's nothing revolutionary in that game you know what I mean like sorry I I've what about the octopuses whatever oh you have to find them to what level up or something like that yeah it's like I I played that over Christmas break two years ago and I liked it a lot but I was like there this",
      "start": 1427.64
    },
    {
      "text": "octopuses whatever oh you have to find them to what level up or something like that yeah it's like I I played that over Christmas break two years ago and I liked it a lot but I was like there this everyone was like making this **** amazing I'm like it's just linked to the Past dude like it's the same world I know what's around every **** corner on this map you know what I mean like it that's not exactly what I'm looking for I appreciate it and I appreciate that you're going back to the class like one of the classic Zelda games arguably for many people the best Zelda game but um it didn't it didn't do it for me yeah yeah so then what do you want to see out of this Wii U version like you this is you know topic one was open world it looks like this is an open world Zelda right they talk about it being Skyrim e where you look over that Hill you can get there you can actually go to it I think that's what we're going to get and I think that that's great um but again it goes against like",
      "start": 1465.96
    },
    {
      "text": "it being Skyrim e where you look over that Hill you can get there you can actually go to it I think that's what we're going to get and I think that that's great um but again it goes against like kind of the grain of what I was saying was I almost would I almost wish that it was just a more structural Zelda game I think that this Zelda game is going to be great I think they're taking their time it looks awesome it does look um I have no doubt that they'll do their best to to deliver I think that they've the message has been delivered to them loud and clear from the fans at least some vocal fans that this is not you know Skyward store was not what they wanted and certainly the sales spoke to that Skyward store sales considering how many weed are out there it was bad it was sold like four million copies it's like really not very good um for a very late Wii game where there are 100 Wiis out there 4% of your audience bought that game yeah for a Zelda game that's incredible you know um",
      "start": 1509.56
    },
    {
      "text": "million copies it's like really not very good um for a very late Wii game where there are 100 Wiis out there 4 % of your audience bought that game yeah for a Zelda game that's incredible you know um considering half of the N64 owners bought Ocarina of Time literally half them you know um so it's it's I think we're going to get an open world game that's inspired by Western role playing games but I think it'll keep the Zelda sensibilities and I think that's fine I I I want them to get more back to the roots of what made these games great and like this the sense of awe which I think a game like an open world game like Zelda could could possibly do do you worry about it bogging down though that's my thing is like I there'll be this like let's say I mean we don't know much about it it's not like there's been don't right so there's your main story quests and then there's all these side quests and like you **** you go into the Gorgon cave for the first time and they're rolling around being a",
      "start": 1542.64
    },
    {
      "text": "there's been don't right so there's your main story quests and then there's all these side quests and like you **** you go into the Gorgon cave for the first time and they're rolling around being a much they're eating rocks being crazy **** like they are and like you see it's huge thing and there's lava pits and it's beautiful and it's you know stunning HD and then you you're on this quest of save Zelda and then one of them needs your help getting three pebbles for its baby you know baby Goron or whatever and you have to like you know what I mean like is that going to water it down to an extent yeah maybe I don't I hope it doesn't take such literal inspiration from Western role play games because there's a place for that kind of stuff but Zelda is not it see the problem with Zelda the problem with Nintendo games generally with the exception of maybe um Metroid is and I'm not talking about every franchise but the big franchise is that the the protagonists are just dudes they're",
      "start": 1581.92
    },
    {
      "text": "the problem with Nintendo games generally with the exception of maybe um Metroid is and I'm not talking about every franchise but the big franchise is that the the protagonists are just dudes they're just dud they're just there people like so that's like the bigger thing now that's not really a problem in a game like Fallout 3 or Skyrim because you're kind of just playing as an avatar but Link is Link so how does Link interact in a world like that where he where he's usually silent and you don't even really know him like that's the funny thing is that for all the Zelda games I've played and I played them all with the exception of the ones we've mentioned I have no idea who he is you know and he's a different character in every one of these games but you never really get to know him you're he's he's boy without a fairy man he's like your avatar kind of um but you don't even get to control what he looks like or or choices he makes so he's just going through the motions so in a game like",
      "start": 1617.28
    },
    {
      "text": "he's he's boy without a fairy man he's like your avatar kind of um but you don't even get to control what he looks like or or choices he makes so he's just going through the motions so in a game like in an open world game which we assume that the Zelda Wii U game or maybe NX game will be um there needs to be more there needs to be more substance put to him and that's actually what I'm most interested in is if they actually decide to start writing this character no way you know no way everybody would lose their **** mind comes out and talks and stuff yeah yeah I don't care but we're not the guy we're not the guy buying truckloads of amiibos and **** camping out trying to find these motherfu no we're not but I would say I'm just as passionate as a Zelda fan as anyone out there you know I wrote long ass FAQs for the first three Zelda games I have beaten all of them up to that point or whatever I I buy them when they come out when I was a kid yeah I love Zelda you know and uh my",
      "start": 1659.84
    },
    {
      "text": "know I wrote long ass FAQs for the first three Zelda games I have beaten all of them up to that point or whatever I I buy them when they come out when I was a kid yeah I love Zelda you know and uh my passion for that for that series cannot be questioned um and I wouldn't mind seeing that at all so I don't think just because you're going out and buying amiibos or you're a current day Wii U fan or whatever means that you have a a greater ownership over Zelda than someone who had been I'm not saying you have a greater ownership I'm not saying they should feel like they have a great I'm thinking what Nintendo thinks yeah Nintendo is hurting right they need a success this isn't the time to roll the dice and be like well **** we're changing everything you know about Link sure but I think that here he is and he's voiced by Scott Porter I think that I like Scott I think I don't think they have to voice him I think that would probably actually be a bad idea I I I would like the idea of not",
      "start": 1695.28
    },
    {
      "text": "here he is and he's voiced by Scott Porter I think that I like Scott I think I don't think they have to voice him I think that would probably actually be a bad idea I I I would like the idea of not using voice acting but that's probably a weird idea too I think that just if you're going to go in that direction of of inspire being inspired by Western games and making a little more open and stuff then maybe decide that you might want to write something for Link and make him a meaningful character and not just a dude with a sword and a so what does that mean to you writing for him then you're giving him dialogue choices but no VM no no choices just give him a story like give give him a like give him a meaningful you know give him dialogue give him something worth saying and and give him a reason to be doing what he's doing there's always a reason there's a draw and Link to the Past he's woken up in the middle of the night goes to the castle Zelda has been you know uh kidnapped whatever I",
      "start": 1733.36
    },
    {
      "text": "to be doing what he's doing there's always a reason there's a draw and Link to the Past he's woken up in the middle of the night goes to the castle Zelda has been you know uh kidnapped whatever I mean but like that's just that's just **** whatever like that's just the the reason to set forth the adventure it's not really a story and um he has a driving force but no real motivation yeah exactly so like make him a character of substance I mean when I think about the when I think about Wind Waker which I think is a great game um that was really an attempt to do an open world kind of Zelda game to too and in a different kind of way in a way that frustrated a lot of people actually but I love the ceiling yeah I did too but you could go in different directions to do different things and stuff like that in the game and find you know this is a story but you can go find a heart piece or sure sure sure so it you know but even in that game it's like again it's just it's just a different looking",
      "start": 1769.12
    },
    {
      "text": "that in the game and find you know this is a story but you can go find a heart piece or sure sure sure so it you know but even in that game it's like again it's just it's just a different looking Link that says nothing you know see and that for me that like I still love Zelda I always will but this is something I know you and I don't agree with cuz you were on a Zelda the podcast right talking about Major's Mask and I got to listen into a little bit of it for me was one of the things I love Ocarina of Time that's my favorite Zelda but I love Majora's Mask just a little bit you know less you know if I'm ranking them it's one and two and what I loved about Major's mask was the continuation of that character of Link I missed there being a continuity to Link I didn't wind waker I **** loved at the time even I know you you hang out with revisionists I you can talk to any of the college friends they know how much I loved it but for me it was a bummer to start that and then be like telling",
      "start": 1805.12
    },
    {
      "text": "at the time even I know you you hang out with revisionists I you can talk to any of the college friends they know how much I loved it but for me it was a bummer to start that and then be like telling this the legend of the hero of time and then you're not that one but you get his tune it's like oh and then that keeps going and every Zelda is like this hard reset hard reset hard and I'm like just okay can we just let's get a Zelda let's get a Link let's get a universe I like and let me continue to do different things in I feel like that's where they get hung up and why the story never progresses is cu every time they're like well we're doing this again so it's got to be Link saving Zelda there's got to be this Dynamic of this princess thing or whatever d d da and that's where we keep getting **** spinning our Wheels cuz it's always like the next one I feel like they're somebody's thinking we'll push it but they never do they just go a different direction yeah I mean there's a",
      "start": 1841.48
    },
    {
      "text": "getting **** spinning our Wheels cuz it's always like the next one I feel like they're somebody's thinking we'll push it but they never do they just go a different direction yeah I mean there's a cleverness to it in the sense that the their resetting doesn't tie them to anything like there's a there is a lore to Zelda and an order to the games but I think was done afterwards same thing with Castlevania like it started at a certain time and then later on you can figure out that there's actually you know Castlevania 3 takes place you know before Castlevania and all you know but that's stuff that that's like figured out later like you make your game first and then you kind of like figure out if there's going to be a war in a universe whatever and by not making a continuous real Universe with the exception of with really a couple of exceptions um they're not tied to anything which I think is clever and make and frees them up especially with Majora's Mask uh being somewhat of a continuation",
      "start": 1879.8
    },
    {
      "text": "exception of with really a couple of exceptions um they're not tied to anything which I think is clever and make and frees them up especially with Majora's Mask uh being somewhat of a continuation Link to the Past in a different world or whatever or I'm sorry time in a different world whatever well that that game was made in like a year so it's like it's like not there like wasn't really it's so funny that that game ended up being so good because it was made in no time same with Mega Man 3 it's like this game's awesome and they made it in like no time um so yeah I I I think that maybe now is the place where you start with what you're talking about make make a game that that's more meaningful Zelda unlike Metroid I think is Metroid is is largely irrelevant to a large audience we've talked about that in the past the game the games do not sell and we love them but or I do anyway but no one really cares about those games and those games are story driven and they are there is a continuity",
      "start": 1914.2
    },
    {
      "text": "about that in the past the game the games do not sell and we love them but or I do anyway but no one really cares about those games and those games are story driven and they are there is a continuity between them and a you know an order that the games take place in and Samus is the same character and all these kinds of things um and she does have feelings and emotions and you do hear from her on occasion um I saw the baby Metroid but I didn't know uh but that doesn't resonate with a big audience and Nintendo's probably looking at that being like well our our our serialized game is not that big yeah but this is damned if you do damned if you don't right cuz you're sitting here saying you don't really know Link and I think it's cuz they re **** boot Link every time you know what I mean now granted they need to hit Link out of the park maybe you know they hit him out of the park on Wii U everybody's like we love this version of Link and then they're like all right fine this is we'll",
      "start": 1955.64
    },
    {
      "text": "now granted they need to hit Link out of the park maybe you know they hit him out of the park on Wii U everybody's like we love this version of Link and then they're like all right fine this is we'll make a sequel to this that would make sense but I don't even feel like they're giving it a shot yeah but what I I I don't understand that argument in the sense that if if it was the same Link in all the Zelda games so what it's not but it's not the same Link in all the Zelda games I'm talking about just one to one to tell me something different to do something different no I I understand what you're saying but I'm saying like even if it was like even if there was just complete continuity in the Zelda games it doesn't matter because he doesn't **** say anything you know what I mean it's just the same story over and over again you know and to me like my favorite Zelda games are Zelda 2 and and Majora's Mask because they are really different games you know um but they they retain the",
      "start": 1998.2
    },
    {
      "text": "just the same story over and over again you know and to me like my favorite Zelda games are Zelda 2 and and Majora's Mask because they are really different games you know um but they they retain the spirit of Zelda I felt like even Zelda 2 and I I don't know if a lot of our younger viewers have played it Zelda 2 is a radically different game Zelda 2 is the most different Zelda game in existence you know again unless you're talking about the really obscure Zelda games that you've never played you know that you have no access to and you and people talk about on forums like they've played them they yeah um you know that game is radically different but it felt like a Zelda game it had the spirit of a Zelda game even though the original Link you know original Zelda which is an open world game miraculously enough it's like very full circle that is an open world game um and you can go in different orders and do all these kinds of things I **** love that game too that game's special um you",
      "start": 2028.24
    },
    {
      "text": "miraculously enough it's like very full circle that is an open world game um and you can go in different orders and do all these kinds of things I **** love that game too that game's special um you know the these games that tried to do different things still felt Zelda like and so by the time you got to the games that I I felt like I felt like Twilight Princess didn't feel like a Zelda game I felt like it felt like just some boring **** gray mon man it's like what is this game and then with Skyward Sword I look at it I I read about it I watch the videos and I'm like I don't I don't even know what the hell this is I appreciate that you're trying to do something different it just doesn't appeal to me and again being turned off by the DS games I think turn me off to Zelda generally but I would love Zelda to have a return in form because some of the best games of all time come from that series and you can't really question it so um take your time make the game you know make the game",
      "start": 2069.84
    },
    {
      "text": "I would love Zelda to have a return in form because some of the best games of all time come from that series and you can't really question it so um take your time make the game you know make the game that they want to make I hope I know they are I think there's a lot of conspiracy theories about why they're delaying it I'm not so sure those conspiracy theories hold water but what are theor oh for NX yeah specifically that they're holding it because they're trying to make they're trying to do what they did with Twilight Princess which was make it a dual like a probably a game left on two systems yeah um which is exactly what they did with Twilight Princess I mean that was the GameCube swans song but also the Wii like coming to life kind of you know what was already people liked it already but you understand what I'm saying I understand it was the hardcore game that was the one where you this is what you've been waiting for yeah exactly like just like we had you know when GameCube",
      "start": 2101.92
    },
    {
      "text": "but you understand what I'm saying I understand it was the hardcore game that was the one where you this is what you've been waiting for yeah exactly like just like we had you know when GameCube launched and you got you know Luigi's Mansion but then you got Smash Brothers a little bit later and that was really the killer app for that game or for that system um proba princess was a Wii launch title right um I thought I brought that home with Wii Sports was I think it was yeah yeah and a very limited run on GameCube that fall yeah yeah yeah that's what **** you over so **** pissed dude I should I don't know why I just didn't reserve it my the funny thing is that my that's like a really like a meaningful moment of change in my life where I my opinion on Zelda and that game might be totally different if I played it on GameCube but I didn't and so I played the inverted **** version of it where you have to waggle your remote and that's my impression of that game forever now you know my",
      "start": 2137.24
    },
    {
      "text": "different if I played it on GameCube but I didn't and so I played the inverted **** version of it where you have to waggle your remote and that's my impression of that game forever now you know my thing with Twilight Princess is I don't what's weird about it is I don't have a strong opinion about it I played it with the Wii I remember Fringe fingers being the boss I remember turning into wolf here and there and that's it like I beat that game and like that was so weird to go from uh you know my introduction to Zelda was N 64 Ocarina time M mask win Waker and then we get here and it's like this game that I have no like I mean I have so many clear memories of those first three games and how amazing they were and what they did differently in what I I was blown in dungeons where I was stuck or whatever right and then you get to Twilight Princess and it's just just a game that I played and was done with I think a lot of people felt that way about it yeah and that's sad I mean I remember",
      "start": 2172.04
    },
    {
      "text": "or whatever right and then you get to Twilight Princess and it's just just a game that I played and was done with I think a lot of people felt that way about it yeah and that's sad I mean I remember getting it and printing out FAQs and like getting because I wanted all the heart piece and stuff I'm like I really don't have time to dick around with this game like I just want to find everything and complete it and I was just like this is so boring and it was the first time it was the first Zelda game that I had approached at up to that point that I didn't beat or get anywhere near I'm like I can't play this game I don't want to play this game I can't I was almost I remember being almost offended by it and the only thing I remember about the literally the only thing remember about it now was that goat scene like early on in the game I'm like what the **** is this you know like I don't know like why that resonated with me in such a negative way where I'm like what is this like why am I",
      "start": 2213.6
    },
    {
      "text": "that goat scene like early on in the game I'm like what the **** is this you know like I don't know like why that resonated with me in such a negative way where I'm like what is this like why am I play what is this game who is this link what is this world who is this man and I got you know quite a ways into it and I was just like I can't play this I just had to accept them like and that was really when I started to kind of fall out of love with Nintendo a little bit where I was like I can't I don't know I just this isn't I'm I don't know what it is about this company I don't know what it is about this system I don't know what it is about this game I don't like any of it yeah you know and it was shocking to me especially being such a GameCube apologist man like oh my God I was the worst with that **** so I loved that system GameCube I loved the GameCube I loved it and it had a great Library really one of I I really think we make fun of the 3DS's vaunted library of games but um the",
      "start": 2246.68
    },
    {
      "text": "with that **** so I loved that system GameCube I loved the GameCube I loved it and it had a great Library really one of I I really think we make fun of the 3DS's vaunted library of games but um the Game Keeper really did have an awesome Library games uh exclusives and obviously third party game or games that would turn into third party games like Resident Evil for instance yeah well he would chainsaw his head off if that game around uh so it was just such a it was such a it was such a change and Zelda almost is mapped to that change to me interesting that there's like that clear delineation that's that's where things Twilight Princess was really the first game where I was like yeah this isn't this isn't for me anymore this whole this whole thing isn't anymore cuz Galaxy was the one that came out Super Mario Galaxy is just an extraordinary game um that game's a 10 if you want to put a score on I mean easily uh and that was like really the last time I played a Nintendo game where I'm",
      "start": 2282.36
    },
    {
      "text": "came out Super Mario Galaxy is just an extraordinary game um that game's a 10 if you want to put a score on I mean easily uh and that was like really the last time I played a Nintendo game where I'm like yeah you guys like still have it you still have it um ever since then whenever I've dabbled with their games they just didn't feel right or whatever I just have lost interest even 3D World you play we did some Let's Plays back in the day of that yeah I I like so I liked new Super Mario Brothers Wii U or Wii new superio brothers we the one that came in the red case yeah that was a good game um that came out later that was like 2009 or 2010 I think and then the I don't like the games that are 2.5d or even have depth of field and that's why like so I I just don't it's the same reason why I can't play Little Big Planet like I **** hate Little Big Planet yeah you know it's just like there's like but this is even worse because you really are like I just don't understand like just make",
      "start": 2321.72
    },
    {
      "text": "I can't play Little Big Planet like I **** hate Little Big Planet yeah you know it's just like there's like but this is even worse because you really are like I just don't understand like just make your game a 3D game or make your game a 2D game and just be done with it you know I don't understand this like halfstep **** at all or like this kind of weirdness to it that game put a smile those games could put a smile on my face and I enjoyed playing them but it's not what I'm looking for I remember when I got a DS and I played new Super Mario Brothers for the first time I'm like wow this is **** awesome make these all the time make this constantly yeah and play I'll eat the **** up and then they and they they did that with the Wii version and I was like yeah this is great this is awesome but I don't know I don't know just turned more into thing about Nintendo but yeah in terms of the Zelda game for Zelda Wii U yeah I want big sweeping worlds I want it to be open world I don't",
      "start": 2369.16
    },
    {
      "text": "awesome but I don't know I don't know just turned more into thing about Nintendo but yeah in terms of the Zelda game for Zelda Wii U yeah I want big sweeping worlds I want it to be open world I don't want dumb quests but I want cool quests if that makes sense I they're clever I mean they they know I think that I think they know what they're doing you know I I do believe that they know what they're doing and I don't think they've ever made a bad Zelda game I think that they just have made Zelda games that aren't for me and I don't know who they're for some of these games but um I don't think that they're literally bad so I think even if you get like an open world like uh fa simile Zelda game of something that looks like it's Skyrim or something I think you'll have it'll still hopefully have those Zelda sensibilities and if they don't they're just going to continue to see the Zelda series become more relevant you know yeah um I also want a lot of game pad **** don't make me blow on it",
      "start": 2402.88
    },
    {
      "text": "those Zelda sensibilities and if they don't they're just going to continue to see the Zelda series become more relevant you know yeah um I also want a lot of game pad **** don't make me blow on it or draw anything or **** let me play with the Pro Controller that's the real thing they're going to make you they're going to put the inventory on that screen **** and I think that that makes sense that's fine with me you know yeah whatever that controller is garbage yeah garbage controller now Colin yeah for topic three Kinda Funny Kevin Bacon or Scott Kinda Funny Kevin Kevin Bacon kind of did we authorize the use of Kinda Funny in this name who is this person this is Kevin Kinda Funny bacon I believe it's Kevin Bacon oh it's Kevin Bacon himself Kevin Bacon Kevin Kinda Funny bacon he says if VR where it ever get to a point where it literally feels like you're in that world what games would you want to play you can put on this VR headset Colin you are transported anywhere I I",
      "start": 2441.24
    },
    {
      "text": "he says if VR where it ever get to a point where it literally feels like you're in that world what games would you want to play you can put on this VR headset Colin you are transported anywhere I I can give you some if you want okay obviously I want to go to Metropolis I want to play a Superman game of some kind maybe I maybe since it's so hard to every you can't make a good Superman game let me be the super villain in first person running around let this could be even one of those dumb interactive experiences where I I could just watch Superman fight doomsday in first person and run around and go in buildings and do different stuff like that the game I wouldn't mind playing in in VR if everything works and is amazing a BioShock go back to Rapture go go underwater and be in you know BioShock have the guns have my own **** powers and **** plasmids plasmans as they're called uh yes I I think um I don't know I mean I still think that the most resonant experience of me with VR so far",
      "start": 2483.96
    },
    {
      "text": "have the guns have my own **** powers and **** plasmids plasmans as they're called uh yes I I think um I don't know I mean I still think that the most resonant experience of me with VR so far is still EVE Valkyrie so like you know playing being like a fighter pilot or um a space you know or in space like Star Wars Battlefront or whatever yeah I mean I think that that would be really cool I don't know that there's like specific worlds necessarily that I want to see in VR because I feel like some of these worlds are best seen on a TV screen or in a book or in a movie like I don't know that VR is the Cure All for immersion in every instance would it be cool to go to Rapture absolutely it would be cool to go to Rapture but um I don't know I think survival horror could benefit a great deal from this kind of VR so like a game like Dead Space being on the Ishimura would be pretty cool um because those games are frightening and and uh well at least the first one was in so I I think that um",
      "start": 2526.44
    },
    {
      "text": "this kind of VR so like a game like Dead Space being on the Ishimura would be pretty cool um because those games are frightening and and uh well at least the first one was in so I I think that um that would be pretty interesting and obviously I mean for my more Fanboy kind of sensibility just playing a Mega Man game or a Castlevania game in in that in first person yeah you got the blaster on your arm yeah so like like a Metroid Prime kind of thing yeah I wouldn't want to play like a Mega Man you know you won't be able to play a side scroller but more the Mega Man you're just like sitting there staring at Mega Man going side you like walk around he's on this like little one block thing running but we've always talked about how I've always wanted to reboot Mega Man if I was given the option to reboot it as an open world game and uh like we're in your city or megalopolis or whatever the city 20XX yeah and like be able to do that so that would be pretty cool like a more gritty Mega Man",
      "start": 2568.8
    },
    {
      "text": "- to reboot it as an open world game and uh like we're in your city or megalopolis or whatever the city 0xx yeah and like be able to do that so that would be pretty cool like a more gritty Mega Man like a realistic Mega Man um and same thing with Castlevania would be you know just the gothic kind of aesthetic to the game it's very similar to you know Bloodborne I think resonated with me on an aesthetic level so much because it looked like Castlevania um and people were saying and I think I I was saying it to on Twitter like man like From Software could really do something special with Castlevania just looking at this game like this felt like more of a Castlevania game than what **** Mercury Steam did for sure um so being in that kind of Gothic you know open world uh would be pretty cool too but I'm not sure that there's like specific things that I don't want to necessarily visit I want what I want is for people to or developers to create the the games that they want to create and",
      "start": 2603.28
    },
    {
      "text": "too but I'm not sure that there's like specific things that I don't want to necessarily visit I want what I want is for people to or developers to create the the games that they want to create and convince me that they're worth playing in VR you know as opposed to like taking experiences already exist and piging holding them into into you know now being a VR kind of experience it doesn't necessarily have to go that way right for me do you think VR is the future I think it's part of the future I don't think it's going to be the future I think people are always going to play games with a controller in their hand I've been saying that for years yeah know like I don't think that's ever going to change there's a tactile nature to playing video games you know we've been down this I don't know how many times you have to go down this **** road to see that like it's not it's it's not going to stick you know yeah and the second I like people to listen I don't want any I mean and it's not",
      "start": 2643.0
    },
    {
      "text": "how many times you have to go down this **** road to see that like it's not it's it's not going to stick you know yeah and the second I like people to listen I don't want any I mean and it's not that I don't want VR I just don't see it as a viable future in terms of it's going to be the defini thing and that's what everybody's going to do and you know what I mean like to see Sony put so much behind Morpheus is a concern for me that they didn't learn from the mistakes of Move you know what I mean like that's the thing for me Oculus is a different story Oculus you're making it for a community that is already ready I'm pointing over at the Origin uh desktop ready to invest all this money into their hobby right and be and think it's cool to keep up with graphics cards and drivers and all this different stuff they're they're down for that unique experience they do every so often whereas I think console Gamers aren't and I don't think you're going to see that kind of support and I worry",
      "start": 2679.64
    },
    {
      "text": "different stuff they're they're down for that unique experience they do every so often whereas I think console Gamers aren't and I don't think you're going to see that kind of support and I worry if that you're going to see the bottom fall out again and that if the failure of Morpheus will basically torpedo Oculus yeah maybe I I I still think they're two different things I I still think it's way more likely that Oculus is obviously successful than Morpheus but I don't I don't think it's necessarily likely that either of them are are successful commercially I think that there's going to be a space for them both the problem is making games for them and finding financial reasons to make games for them it's the same thing with Move like it's a chicken in the egg thing where it's like Move could have been successful if people made games for them that were successful but there were no successful games for it so people didn't make games for it so it's it's not that Move was necessarily a bad",
      "start": 2718.36
    },
    {
      "text": "have been successful if people made games for them that were successful but there were no successful games for it so people didn't make games for it so it's it's not that Move was necessarily a bad idea or the Wii Mote was a best bad idea it's just that or Kinect's a bad idea it's just that the Market's kind of speaking that they don't want this so it's not like you couldn't have made a proof you know a proof game that would have really convinced you I liked some games on on all of those things so yeah um you know we talk about Sports Champions a lot for instance which I think was a lot of fun it like a way better Wii Sports like a way better Wii Sports you know um and I thought that that game was that game was fun and IO um and archery was dope yeah it was there was it was something cool about like it was just the the PlayStation Move was just a way better device than the WiiMote in terms of what it could do so it was just it was a deeper experience you know but it didn't matter um so I",
      "start": 2757.24
    },
    {
      "text": "like it was just the the PlayStation Move was just a way better device than the WiiMote in terms of what it could do so it was just it was a deeper experience you know but it didn't matter um so I think that with VR you're going to have experiences that that are going to resonate like for me like E Valkyrie something or like what's the Sony London um underwater demo that they did it was when C was pretty cool but like how do you make this into a game I don't know I I don't think that it's the gamepl that matters um in terms of VR's viability what matters the most is are people going to find financial reasons to make compelling games on it and that's a big thing and um will you be able to convince people to buy high-end computers or PlayStation 4S to play them because again as I've said so many times these things do not process by themselves like they need big expensive bulky devices to play and until you don't need those anymore that's the that's the barrier for VR that's it I think",
      "start": 2791.28
    },
    {
      "text": "many times these things do not process by themselves like they need big expensive bulky devices to play and until you don't need those anymore that's the that's the barrier for VR that's it I think that that is the barrier for VR once these things become powerful enough and the tech becomes cheap enough that people can go out and buy five a $500 headset and that is all you need yeah and maybe a controller or something like that that's a different story then you are really talking about something that I think absolutely can be commercially viable like no doubt about it as long as you have to have a $3,000 computer to hook up Oculus to yeah there's no pray I mean there's no prayer that that long as you're selling PlayStation 4S without it bundled in yeah and I think they will bundle Morpheus probably but again it's that's what we thought about Vita we saw how well that went but the the pricing is probably the problem it's if you can't give value to a bundle then it's there's no reason",
      "start": 2837.36
    },
    {
      "text": "probably but again it's that's what we thought about Vita we saw how well that went but the the pricing is probably the problem it's if you can't give value to a bundle then it's there's no reason to really do it I think that was the problem with V like your bundle would had have been $600 that's what this will be too though this is the problem here would be more expensive than that yeah that's what I'm saying there's just no value yeah so not the price tag I don't know I don't know I I I'm a little more bullish about it than you are I think but I because I think that it's we've been talk VR has been in the conversation of games as a lot of people that have played games for a long time know for many years for decades so this isn't a new conversation and the and these VR devices aren't the first VR devices it should these are first that have that have taken hold and taken root and really taken root Oculus has really taken root and it's found Believers in the development Community which",
      "start": 2871.12
    },
    {
      "text": "first VR devices it should these are first that have that have taken hold and taken root and really taken root Oculus has really taken root and it's found Believers in the development Community which is very important but the developers have to eat and they have to support their families and pay their rent or their mortgage like that so if you're making a game a great game on on Oculus and it's selling five or 10,000 coffees or something like that it's not going to cut it and so Oculus must proliferate first but it's the chicken in the EG egg problem I was talking about Oculus will only proliferate when there's a reason for it to proliferate those reasons will come from software but if there's no reason to make the software because there's no money to be made then you're in big trouble that's why Facebook you know Facebook owns Oculus and they have very deep pockets and hopefully they understand that they're going to have to spend a lot of money to get these games developed and hope",
      "start": 2902.36
    },
    {
      "text": "why Facebook you know Facebook owns Oculus and they have very deep pockets and hopefully they understand that they're going to have to spend a lot of money to get these games developed and hope that it works out you know um and I'm sure they will they're gonna have to spend I really think that they're gonna have to spend a couple hundred million dollars probably to like to like get a bunch of developers on board to be like we need 5 games for this thing you know you think Facebook understands though the kind of games they need are they going to come in and make hardcore Oculus games they spent a lot of money on Oculus I I would hope that they understand what they're doing you know I think that they do and they have all the financial room to make mistakes but um yeah I think they understand that the this is going to be a huge investment in a long-term investment you must seed Oculus with good games and good experience not even games but just experiences travel experiences and science",
      "start": 2936.16
    },
    {
      "text": "that the this is going to be a huge investment in a long-term investment you must seed Oculus with good games and good experience not even games but just experiences travel experiences and science experiences and all these kinds of things you must SE it and you must give developers reasons to make you know financial reasons game game development as much as everyone not everyone but a lot of people like to argue about the expensive games and stuff and you know complain about all these things it's not an altruistic Pursuit these guys want to make money and they want to make lots of money and you need to give them reasons to make lots of money it's the fusion of Art and business yeah developers want to be artists but they want to have a business yeah they need they need to make money this is not you're not going to find a developer an India developer or a AAA developer or an A developer that is not out there to make money that's just not the way it works this is you know for all the",
      "start": 2977.68
    },
    {
      "text": "is not you're not going to find a developer an India developer or a AAA developer or an A developer that is not out there to make money that's just not the way it works this is you know for all the complaints about capitalism in uh in the games industry you would think that this wasn't a industry founded completely because of the capitalist system you think it's some sort of utopian **** communist system that there's room to play games or have a game industry or whatever like the whole thing is predicated on making money on Leisure you know so if but we're at that point you're right where like we want to be taken as an art form and that's where it gets that's where it gets dicey with and I with you don't get me wrong I understand the argument I'm just saying that that's where it gets dicey when you know that there are developers out there who are making games and trying to make art but then there are Publishers who are trying to make money and where do those two meet and how do you",
      "start": 3012.28
    },
    {
      "text": "when you know that there are developers out there who are making games and trying to make art but then there are Publishers who are trying to make money and where do those two meet and how do you get a marketing plan how much of a game do you show what do you charge d d yeah I still think that I I still think it's it's it's still reductive though because Publishers yes they want to make money they're the businesses that make money but the developers want to make money too sure the Indies want to make money they want to make lots of money um but they want to make money making the art they want to make exactly but and again it is the Unholy like marriage which has been going on for hundreds if not thousands of years of money patronage and and art um so yeah it's always going to be a conundrum that conundrum is always going to be there but it's there with any business right we love what we do but we want to make money on it we want to continue to grow expand live in our homes have enough",
      "start": 3054.2
    },
    {
      "text": "that conundrum is always going to be there but it's there with any business right we love what we do but we want to make money on it we want to continue to grow expand live in our homes have enough to go out do these different things right there's and there's nothing wrong with that so like that yeah you so you just have to marry those two ideals together and they and they must if they don't then it's going to fail but I I don't think Oculus is going to fail I think it's I think think it's just going to iterate and become um another segment of the market that you know I think will be very appealing to both casuals and hardcore people and I think that it'll the proof will be in the pudding man the problem with these devices is that you cannot show people what you're seeing until you actually put the device on it's impossible in fact if you look at like a screen of what's being rendered on Oculus or or or and people haven't seen it on Oculus or on Morpheus it's just a blurry screen like",
      "start": 3093.4
    },
    {
      "text": "put the device on it's impossible in fact if you look at like a screen of what's being rendered on Oculus or or or and people haven't seen it on Oculus or on Morpheus it's just a blurry screen like you can't you get the two you get the B binocular vision too on the side where you have the double image of the same thing going on so it's just like you have to you have to get these things in stores you have to get these things in people's hands you have to have a ground game it's going to be tough it's going be a very Grassroots kind of thing but you know once you play it as I have many times now um I'm I'm a total believer in VR like maybe not in the commercial viability of it maybe not in the practic you know the Practical nature the pragmatic nature of VR but I certainly a believer in that technology see when you sp it like that yeah I'm with you I think a technology is super cool I've had super cool experiences On It Kevin what is the game I can't remember we played here in this room",
      "start": 3131.04
    },
    {
      "text": "technology see when you sp it like that yeah I'm with you I think a technology is super cool I've had super cool experiences On It Kevin what is the game I can't remember we played here in this room that we couldn't get the capture kit to work for I don't remember I want to say like really I'll look it up before but it was yeah it was a VR game it was like to it was survival horror and we were in underwater in the suit going around I was like Yep this is awesome like this is totally cool I would play this would I invest $3,000 to play it no **** way no but the beauty is is that and that's why I'm excited about Morpheus more than Oculus in a sense in a different sense even though I think Oculus is a more exciting device and probably a better device is because we already have a PS4 so like let's see already halfway there but man the processing on PS4 is going to be really strained by this this unit like I I still think that um I still think Oculus is ceiling is is almost infinite",
      "start": 3170.64
    },
    {
      "text": "like let's see already halfway there but man the processing on PS4 is going to be really strained by this this unit like I I still think that um I still think Oculus is ceiling is is almost infinite because it's it's tied to the pass the ever evolving processing power increases of computer as opposed to a PlayStation 4 which I think is Morpheus's Achilles heel okay final topic Colin this one comes from Scott sorry Scott that Colin did not pick you it's because your name are with an S and everyone else came before you I picked everything alphabetical order you're you're a human computer yeah yeah no not really well close enough uh Scott says any games SL genres you wish you were better at what's what's a weakness in your gaming repertoire that you wish you were better at Colin fighting games yeah that's definitely a weakness for me too I don't know that it was necessarily identified for me as a weakness until I moved here I thought I was pretty good at fighting games yeah um because",
      "start": 3205.24
    },
    {
      "text": "yeah that's definitely a weakness for me too I don't know that it was necessarily identified for me as a weakness until I moved here I thought I was pretty good at fighting games yeah um because you cleaned up with your friends back in New York yeah I used to I was I still think I'm a pretty competent like Street Fighter player for instance but like I never was introduced to this next level like not casual or highend casual play until I came to California and and I remember playing Mark Ryan and and other people and being like I'm not good at this game at all the way I play doesn't make any sense I don't explore the control like I play as Ken and Street Fighter um and I use only Fierce punch and fierce kick and and I jump a lot which exposes me a lot but I like doing that because you get around the screen faster and that like I can't play like that with like real people I get **** destroyed yeah and I'm and I was so interested in you know especially way Mark Ryan and I JM played",
      "start": 3257.0
    },
    {
      "text": "around the screen faster and that like I can't play like that with like real people I get **** destroyed yeah and I'm and I was so interested in you know especially way Mark Ryan and I JM played where you know you use like the the Jabs and all these kinds of things you set up like these combos by like breaking blocks and and you know analyzing frames and exposing enemies in in different ways or whatever or your opponents in different ways and it's like man I didn't play these games like this um and I played a lot of fighting I played a lot of fighting games you know I played a lot of the SNK fighting games and obviously um you know Street Fighter and then a little bit of Mortal Kombat although I think I never really liked Mortal Kombat um but then you know Street Fighter versus X or X-Men versus Street Fighter and sure I I mean I loved all these games and I thought I was competent at them but I'm not you know Street Fighter Alpha 3 is probably like my favorite fighting game ever I",
      "start": 3297.8
    },
    {
      "text": "versus Street Fighter and sure I I mean I loved all these games and I thought I was competent at them but I'm not you know Street Fighter Alpha 3 is probably like my favorite fighting game ever I love that game yeah um on PS1 but excuse me some of these people just play these games that sure that just and not even competitively there's some people that AR any competitive scene at all that just play at a much higher level so right right for me I mean like the first thing that jumps in mind is first person shooters like I'm competent at first person shooters now like and and I'm talking about like multiplayer jumping in and playing something multiplayer right because when Titanfall was coming up Alfredo put me through a boot camp to get me decent and I was decent when Titanfall came out I hung in there in my month and a half of playing I hung in there and was like usually in the mid to upper part of the rankings right I was doing all right for somebody who hadn't really been into it",
      "start": 3332.4
    },
    {
      "text": "I hung in there in my month and a half of playing I hung in there and was like usually in the mid to upper part of the rankings right I was doing all right for somebody who hadn't really been into it but like now I'd go back for sure and get killed it just works on a different level for the kids who have grown up with that right CU for us it was like in high school playing Golden Eye right in Perfect Dark and like that was like first person shooting to me and then there were mental of Honor single player games and stuff like that but I didn't get into Halo so I was never like playing competitive shooters that way and so that's just a weakness I feel in my thing of like I can't talk to Bobby or another Call of Duty player Alfredo or even Destiny people really right when he gets down to the mechanics of shooting and like aiming on the sights and doing all these different things and knowing how to assess threats and get head shot easier and da d da I play games and I have fun with them",
      "start": 3367.16
    },
    {
      "text": "mechanics of shooting and like aiming on the sights and doing all these different things and knowing how to assess threats and get head shot easier and da d da I play games and I have fun with them right and I like for Titanfall I invest a lot of time in to it to get good at it but I'm not great at it out of the box I wish I was better just out of the box at it you know yeah multiplayer Shooters are interesting I I I actually feel like I'm a really competent shooter player but I don't play online so it's like it's all based on my experience is playing grueling difficult campaigns or whatever yeah um but even I ran you know like we talk about world of war like I cannot beat that game on veteran like I I I probably could if I really really really really sat there but I was losing my **** mind you know like I I remember like I was like I can't I'm like I'm going to actually destroy everything in room right now because this game is impossible yeah I can't believe anyone beat that game",
      "start": 3404.12
    },
    {
      "text": "mind you know like I I remember like I was like I can't I'm like I'm going to actually destroy everything in room right now because this game is impossible yeah I can't believe anyone beat that game on veteran I I like I it's one of those frustrating moments where like I I accept that I I didn't beat Battletoads No One Beat Battletoads I still don't think anyone ever beat Battletoads but like the but like when I see World at War and people have Platinum I'm like how did you do that yeah because I think I'm pretty good at Shooters and I and I've beaten the other one all the other ones are veteran and I I don't know how you did like you dealt with this game to the point where I was telling you and I've said it before like it watching videos of people playing on veteran online and like how they got through it by just **** running to like get to the next checkpoint like just running yeah because the monster CL like for some reason World at War is designed with like an infinite amount",
      "start": 3439.44
    },
    {
      "text": "they got through it by just **** running to like get to the next checkpoint like just running yeah because the monster CL like for some reason World at War is designed with like an infinite amount of enemies that's how Wars are fought like where there's just Monster closets like you have to trigger certain things so like it's like you can't just sit there and like pick them off like I play you know when I play um wolf like Wolfenstein the New Order was a really hard game on Uber um or it's even harder than that death incarnate or whatever it is and especially the last boss was like **** really hard um but I beat it but you can like be very meticulous you know like yeah like you can just chill and like there's just ways to do it um but that was I remember like what you're talking about that's World of Wars problem of monster closets was something that had been in war games forever I remember playing Medal of Honor Call of Duty whatever it was on Omaha Beach or whatever and people just",
      "start": 3472.6
    },
    {
      "text": "world of Wars problem of monster closets was something that had been in war games forever I remember playing Medal of Honor Call of Duty whatever it was on Omaha Beach or whatever and people just **** keep coming at you and you're sitting on the Gatling gun they was coming out of this black hole I like well **** fine I remember I'm going to run to the next thing to like cue whatever I need to cue and that's what it was you know what I mean yeah it was like these a different design philosophy back then to keep you moving the trigger to keep you moving was the end but it wasn't overt and and on Omaha Beach it probably makes sense but not not in typical not what I'm like you know in the the Pacific island doesn't make any **** sense at all yeah um I think I killed every **** person in that Japanese regimen you know like five times um so yeah so I think I'm like I it would be interesting because I first of all there are genres that don't take skill right so um role playing games",
      "start": 3509.16
    },
    {
      "text": "in that Japanese regimen you know like five times um so yeah so I think I'm like I it would be interesting because I first of all there are genres that don't take skill right so um role playing games don't take skill role playing games are and I love role playing games that's like one of my favorite job no so but it's like you level your characters up and you can you know and I'm talking about traditional role play games like like Japanese role play games turn Ro play exactly like those aren't skill based games so like there's people can be good or bad at those I don't think that that's really possible like if you really just find the better equipment and level your character up um Western role playing games take a little bit more skill but still aren't skill-based I don't think Fallout 3 is a game that takes really any skill again you can just if you know what you're doing and you find the right armor and the right weapons and you and using especially with Vats and stuff like that",
      "start": 3546.92
    },
    {
      "text": "3 is a game that takes really any skill again you can just if you know what you're doing and you find the right armor and the right weapons and you and using especially with Vats and stuff like that like I would think yeah for me I think well I wouldn't say I think that Fallout was requires less skill than most of the jrpgs I've played like Persona stuff you have to know how to interact right what weaknesses are hit things in the right order when to block **** like that where fall it was freeze time shoot him I'm out of Vats run and hide you know or whatever sure but I still think that the formulaic nature of like most Japanese role playing games and strategy games like tactics is just tactics takes more skill but again if you just dedicate time to you could just cheat the system which and it's not possible in a shooter you know yeah um and then I think that I I excel most at you know 2D Platformers so um and I think I'm like well above average in that genre so um that's kind of",
      "start": 3585.2
    },
    {
      "text": "and it's not possible in a shooter you know yeah um and then I think that I I excel most at you know 2D Platformers so um and I think I'm like well above average in that genre so um that's kind of like the the lay of the land for me where I think my my greatest strength is probably the old school 8bit games and games like them um because I just understand them on a different level I think than most people do but then my weakness has come to the four with like fighting games probably racing games but I don't really give a **** about racing games um I'm not I'm not great at them see and that's one of the interesting things to Scott's question any games genres you wish you were better at this is going to sound offensive but stick with me I wish I gave a **** about MOBAs you know what I mean I've tried I've had Brian Albert talk to me about them like I always bringing this up as like people are always like oh you should play this you should play that I think you'd really like it if",
      "start": 3626.04
    },
    {
      "text": "mean I've tried I've had Brian Albert talk to me about them like I always bringing this up as like people are always like oh you should play this you should play that I think you'd really like it if you gave it the 15 hours to get good at or whatever my thing is like you understand that they've already made the MOA I would have dreamt up of they're like here's a MOA that's all DC Comics characters I played that game for 5 hours and I was like **** this game and like not because it was bad because I didn't understand the mechanics or what I was doing or how to work as a team or there's just all this stuff that I didn't understand and I didn't want to understand and of course you're talking about Gotham City imposters no Gotham City's imposters of course a great first person shooter you I'm talking about Infinite Crisis yeah that I mean MOBAs and all that should I don't I that is not for me it's not and it's the same thing with MMOs like I I know what they are I don't care and and",
      "start": 3665.2
    },
    {
      "text": "I'm talking about Infinite Crisis yeah that I mean MOBAs and all that should I don't I that is not for me it's not and it's the same thing with MMOs like I I know what they are I don't care and and that's okay yeah people know like there's some people that are like why would you ever play an 8bit side scoll I'm like that doesn't mortally offend me so I don't really care if you don't like like not everything is not is for everybody so I know that those games exist I told you I watched uh League of Legends um or maybe it was DOTA I don't even know I can't even tell the difference between the two at this point uh even though they're probably radically different games it was one of the streams when I we were s IGN that like Brian Albert was doing and those guys were doing I watched it for 10 minutes I'm like what the **** is going on in this game and it's not it's not like I'm sure you can understand it but even then I'm like I you have to deal with other people and it's just everything",
      "start": 3700.28
    },
    {
      "text": "I'm like what the **** is going on in this game and it's not it's not like I'm sure you can understand it but even then I'm like I you have to deal with other people and it's just everything I hate about video games is in those games so I'm like I'm so glad that they're proliferating and they're way bigger than the games I play and I accept that League of Legends DOTA to these are huge **** games but they're not for me you know and that's okay that's so to me to you I say who cares like play what you want this just this question don't get me wrong I'm not I'm not going out of my way to learn to give a **** about these games at all it's I'm just saying like I wish that if there was a genie here and he's like you get this is the one thing you got to wish for I'm like Portillo forever he's like that's not a game thing you got to you got I'm like all right fine then make me understand and care about I play him yeah no I I mean I yeah to me I I wouldn't yeah the only thing that pops",
      "start": 3733.12
    },
    {
      "text": "he's like that's not a game thing you got to you got I'm like all right fine then make me understand and care about I play him yeah no I I mean I yeah to me I I wouldn't yeah the only thing that pops out to me the thing that I would care about that I that I would want to understand and be good at and be able to play with other people are and ironically you play them with other people is a fighting game yeah um but it's because I have so such a deep deep respect for that community and such a deep deep respect for those games and the mechanical nature of those games and how some of those games are 15 or 20 years old and they're still being played at a competitive level and are still being broken and are still being exploited explored um the fighting Community is extraordinary I watched Evo like in depth for the first time last year and I think I talked about this on on one of our shows at some point maybe on Beyond when we were still doing it was um I was like wow this is extraordinary",
      "start": 3767.76
    },
    {
      "text": "like in depth for the first time last year and I think I talked about this on on one of our shows at some point maybe on Beyond when we were still doing it was um I was like wow this is extraordinary this is like an extraordinary Community this is a uh the passion the the T the the tension of these fights and yeah picking who's like guys that are good at two or three different characters and so they have to pick the character that they think is going to be best against this other fighter sensibilities and how he plays or she plays I was like it's it's very chess-like yeah and that's why and that's I and and as people know I'm a huge chess fan so I think that fighting games are the closest thing we have to chess in interactive video games think moves ahead it's awesome you know like so that's the like I don't care about racing games I like I'm terrible at Mario Kart when we play it and like I don't even like Mario Kart I don't care you know that's not going to change but I do care",
      "start": 3807.8
    },
    {
      "text": "that's the like I don't care about racing games I like I'm terrible at Mario Kart when we play it and like I don't even like Mario Kart I don't care you know that's not going to change but I do care about Street Fighter 5 I just don't know how to play it right you know sure and I don't have the time to learn I am not you know Vince and J for instance has chops in those games he just understands those games he breaks those games down he's like Neo fighting games but here's the thing right he's me with fighting games the way I am with 2D Platformers or old school games where I can play I watch people play Shovel Knight I remember playing Shovel Knight at PSX on on PS4 for the when they had it for the first time people like wow like you're really good at this game like hey I already played this game a million times and be like you I was always playing this like this I just understand how to play these games you another person might understand how to play a shoo that way or something like",
      "start": 3848.4
    },
    {
      "text": "game a million times and be like you I was always playing this like this I just understand how to play these games you another person might understand how to play a shoo that way or something like that so I wish I had that particular Talent not only for 2D Platformers not only for those kinds of games but also for these fight these 2D fighting games because they are so systemically complicated that um you really you really can't just jump in and **** around with them and think you're going to be good at them you have to spend scores of hours understanding these characters hundreds of hours thousands of hours and I don't have that kind of time so time for that um but people make you know these evil guys make time y to understand and I'm not talking about Smash Brothers either because I that's a very divisive game with fighting game communities a lot of people like Vince don't even think that that's a fighting game yeah um and I and I think I would agree in in a traditional sense I",
      "start": 3886.28
    },
    {
      "text": "that's a very divisive game with fighting game communities a lot of people like Vince don't even think that that's a fighting game yeah um and I and I think I would agree in in a traditional sense I think it's more fun than a fighting game um but I would love to understand like **** Blaze Blue or King of Fight you know like something like so nerdy so deep one of these like um yeah one of these these these one of these Ryan Clement games yeah exactly yeah that's a good way of putting it that's what I do ladies and gentlemen that's been the Kinda Funny Gamescast episode 20 thank you so much for watching remember if you want to support us you can you go to pat reon.com ofun games support us there get each and every episode early each and every Friday if you don't want to give us any money no big deal you can go to youtube.com/ kindof funny games we put up each and every show topic by topic day by day along with a let's play for your amusement then on the Friday the whole MP3 and video",
      "start": 3926.04
    },
    {
      "text": "no big deal you can go to youtube.com/ Kinda Funny games we put up each and every show topic by topic day by day along with a let's play for your amusement then on the Friday the whole MP3 and video is posted for free for everyone on iTunes podcast services and YouTube until next time Tim Gettys will be back one day we got to get ready for Kinda Funny live we got to do Colin and Greg live over at twitch.tv/ Kinda Funny games it's been our pleasure to serve you",
      "start": 3966.32
    }
  ]
}
