{
    "id": 819,
    "video_id": "9kEINN7Kgfw",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Thank You, Bryan McComb!",
    "description": "Your support allows us to live our dreams!\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com.\n\nBuy our shirts! http://www.districtlines.com/kindafunny\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1430523181,
    "duration": 296,
    "transcript_chunks": [
        {
            "text": "Hello Bryan McComb, Bryan McComb, it's the cast of Kinda Funny coming to you to thank you for your Patreon support these past three months. Bryan, you're a good-looking fellow. You joined Twitter in July 2011. You've never tweeted. This is one of those on just says 4 following, nothing else. Wait, why does he look like **** Matt Damon? Do you get that a lot that you look like Matt Damon? Click on the picture, click on it. He's got, he does have a Matt, literally like, how do you like them apples? Question, why is he in the middle of the woods when he's taking that picture? Who's taking the picture out of the woods? Yet there's a couple things that this picture looks a little like. He looks like Matt Damon, which is freaky a little bit, but he also looks like he, like he may have just finished killing someone in the woods. Is that what you were thinking? I, I wasn't necessarily thinking slang, yeah, slang, slang, like slanging like his dick into some nasty, nasty, the good type of nasty, nasty though. And he's all he take",
            "start": 0.12
        },
        {
            "text": "woods. Is that what you were thinking? I, I wasn't necessarily thinking slang, yeah, slang, slang, like slanging like his dick into some nasty, nasty, the good type of nasty, nasty though. And he's all he take a picture of me. I could take a selfie, but I'd rather you do it 'cause you're naked right now. Seconds after, after that picture, he was like, whoa, and then he just walked out of the woods. He talking about, all right, we found his YouTube page. All right, here we go. Three subscribers, four Bud. Wait, he posted some videos not too long ago. Worldwide Education. Oh, so he's actually like, he's actually doing things here unlike us. Not Taylor, hold on. Uh oh, Taylor Lee High School, Midlothian, Texas. Worldwide school age children. 44 seconds. I hear sad music. He must have entered this is some kind of comp. Basic Education Coalition helps school age kids with literacy, critical thinking, life skills. They give hope of escaping poverty and despair. Like teachers abroad, they go organizations and public to increase support and",
            "start": 35.88
        },
        {
            "text": "helps school age kids with literacy, critical thinking, life skills. They give hope of escaping poverty and despair. Like teachers abroad, they go organizations and public to increase support and funding for Quality Basic Education. The world thanks Donnie. Did they, this music's very sad. Your phone now, your phone's broken. Someone from Hardin, Montana. No, should I get it? That's a call you take. Should I get it? That's Han green. Is that someone that's maybe potentially going to try to sell me insurance and help by showing support? Don't any Reg my car me like, hey, you can get registered twice. That was an interesting what and slate. Yeah, that was that, that didn't quite fit the motif. It was really sad and they were like, hey, we're just **** with you. Well, now he's got one here called Monkey Buffet. Wow, these monkeys are **** these fish up. Are they going to get eaten by the fish? I think they're, they're going to eat the fish, aren't they? It looks like a bunch of Magikarp. Yeah, this looks crazy. There's",
            "start": 86.6
        },
        {
            "text": "monkeys are **** these fish up. Are they going to get eaten by the fish? I think they're, they're going to eat the fish, aren't they? It looks like a bunch of Magikarp. Yeah, this looks crazy. There's some manes and Magikarp. It'd be awesome if the tables turned and the fish ate the monkeys. That my God, just gets dragged underneath the water and he's like, and the rest of his friends are like, we're **** unless we banded together to figure. You do me a favor, Greg, and in the YouTube search type in fish versus monkey. Sorry, Bryan, hang out for a sec. We got to, we got to check this out. What am I looking for? Anything is Betta fish versus Sea-Monkeys. That's not what you're looking for. Monkey fishing, monkey fishing, monkey fish. Where's my doctor? Can you type in shark versus bear? Damn, I don't think sharks and bears are going to fight. Can you type in Dirty Dancing and see what comes up? Shark versus bear, catamaran bear. I love watching animal fight videos. Bear Grylls videos, they're just **** insane, man. All",
            "start": 139.16
        },
        {
            "text": "bears are going to fight. Can you type in Dirty Dancing and see what comes up? Shark versus bear, catamaran bear. I love watching animal fight videos. Bear Grylls videos, they're just **** insane, man. All right, Bryan, thank you for your support on Kinda Funny. We hope you appreciate uh what we're doing. We certainly appreciate what you're doing for us. You let us live this life, a silly, silly life. So thank you for that. We're clicking on Dachshunds and dog fight. Oh fun. Look at these **** fighting. They're not fighting, they're playing pory. What are they saying? P's like, that's some racist **** they're saying right now. Like why doesn't he care? He knows they're fake. Knows they're fake. They're not real. Like 40. God, these dogs are so useless. No wonder people were throwing rocks at them after World War II. Why didn't you choose a black one versus the brown one? That's the next one. Black's the next one. Even though Christine talks about a dapple every so often. What's a dapple? It's one where like you've seen",
            "start": 181.88
        },
        {
            "text": "didn't you choose a black one versus the brown one? That's the next one. Black's the next one. Even though Christine talks about a dapple every so often. What's a dapple? It's one where like you've seen them where they like, they look like they got like bleach on them and stuff. You're giving Christine way too much power in this dog business here. I'm going to, I'm going to tell you right now, you had a vision, you had a vision. That's a dapple Dachshund. Well, first off, can we talk about how cute a dapple Dachshund is though? It is still black and tan. It's just got the white stuff. I mean, look at that **** dog. Look at that dog. I don't like it. You donuted it. No, it's weird. I like that a lot. I like how they have a little extra Skinner on there. They're like old man py in general. I like the hairy ones. I like them. You like the hairy ones? Like the long hair ones. Can't do. I can't. They get all over the place. Much dander. Sorry, sorry, sorry, sorry. You just get a Pomeranian. No, God no. They're the worst. Here's why they're bad.",
            "start": 231.52
        },
        {
            "text": "like the hairy ones, like the long hair ones. Can't do. I can't. They get all over the place. Much dander. Sorry, sorry, sorry, sorry. You just get a Pomeranian. No, God no. They're the worst. Here's why they're bad. Their mouths are too small to like brush out, so you have to have them put like to sleep in order to like get them brushed out.",
            "start": 267.4
        }
    ]
}