{
    "id": 817,
    "video_id": "BHKCpbMLa1M",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Thank You, ROIZENGH!",
    "description": "Your support allows us to live our dreams!\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com.\n\nBuy our shirts! http://www.districtlines.com/kindafunny\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1430517716,
    "duration": 247,
    "transcript_chunks": [
        {
            "text": "Ro osenberg, thank you so much. Did you just jack off my forearm? I bear I caressed your forearm in a jack off style manner. You need to use lotion, too. I know I'm falling apart, Greg. I'm falling apart. Christine would murder you if your my hands were that rough. Here's what I want you to do when Christine gets home. I want you to I want you to caress her arm like that and see if she yells at you because you're caressing her arm because a little honest, I'm terrified of Christine. Really? Why? Because, uh, that we had one interaction where she saw me pouring the water and she was like, you need to refill that water and she was dead on and I was like and I had I just had a scared cat moment where I was like, no, I'm just terrified from her. Good. That's what she wanted. She walked into the prison and punched the biggest guy in the face. Oh, she took me down, bro. She took me down. The rest of us haven't learned. That's why Cole gives you bad toilet paper and that's why I'm going to start hiding Carri pods, you know.",
            "start": 0.04
        },
        {
            "text": "biggest guy in the face. Oh, she took me down, bro. She took me down. The rest of us haven't learned. That's why Cole gives you bad toilet paper and that's why I'm going to start hiding Carri pods, you know. You know, I'm slowly trying to I'm slowly I have a game where I'm slowly trying to get you to stop using my bathroom, right? Mm. I'm buy it's never going to work and here's why. Starbucks is too far and Greg's bathroom sucks. Sorry. Bathroom does kind of suck. It needs to be cleaned a little bit. It's a little dirty. Also, it's not a cleanliness thing. It always is though. It always you just have less uh um suction, like you don't have as much pressure in your toilet. Sucks really, really sus. I need to make sure like my biggest my biggest uh point of anxiety on this planet actually, the thing I'm probably most scared of is clogging toilets. There's nothing more embarrassing than when you're like I have to admit to everyone outside, yeah, and ask that I was just took the a so big that it can't go down a normal",
            "start": 41.04
        },
        {
            "text": "scared of is clogging toilets. There's nothing more embarrassing than when you're like I have to admit to everyone outside, yeah, and ask that I was just took the a so big that it can't go down a normal humaniz pipe. So I need a plunger or or a coat hanger or something that I can break up whatever's in there with. That sucks. That really sucks. My life has been very rough cuz I have bad constipation problems. I know. Who's this? Ro it's Roy. I add the okay. Roy, R O I Z N G H. We did this last time. Remember you get to hear all my my life problems. But yeah, I don't poop at other people's places cuz that happens every time. Every time without fault. I need to confirm that a toilet can suck the out of some or else I in there. That's what everyone calls me crazy because I'm I always prefer to at Starbucks. But here's the difference. Starbucks by the way has they have that toilet that is like a Mega Toilet. Like you could you could flush a cat down that thing and it ain't coming back. Uh so I like that A and B",
            "start": 76.48
        },
        {
            "text": "here's the difference. Starbucks by the way has they have that toilet that is like a Mega Toilet, like you could you could flush a cat down that thing and it ain't coming back. Uh so I like that A and B. It's a standalone toilet so I don't have to deal with everyone else's like stink or smell or like sound effects that's happening. Go in there. It's like a little cube of silence and then you know no matter what you do it's going to be able to handle it and it's got that industrial like two flusher. Yeah, you're like no wonder we've got a we've got a drought right now cuz I like all right, so let me let me learn a bit about Roing here. This is we've done a video for him as well in the past if I recall. I yelled at him for not having a real photo . He said that exactly, but there's a clue here. There's an essential clue about where he's from. Okay, Fast and Fury 7 in a Polish Cinema. I just hope it's not dubbed. So he's in Poland. He's in Eastern Europe. Yeah, that that last name wasn't wasn't is that his last",
            "start": 124.56
        },
        {
            "text": "clue about where he's from. Okay, Fast and Fury 7 in a Polish Cinema. I just hope it's not dubbed. So he's in Poland. He's in Eastern Europe. Yeah, that that last name wasn't wasn't is that his last name? It might be last name. That's a dope last name. There's some creepy retweets here. Those damn Eagles. Uh Greg Miller retweet he retweeted the Freedom Wars tweet which is up to 1,000 by the way. You better get a good sequel. Just double checking the audio. Keep did he retweet oh no this is suggested by Twitter. I was going to say he retweeted eHarmony. Uh wait you're getting suggested tweets on someone else's Twitter. Yeah no and they're giving you eHarmony. Yeah they know H they watch the Christine relationship I have man. All right Greg yeah we appreciate Roing very much. We do. He's great. We hope he was or she we hope he or she was illuminated by the talk about the the by my Scott 1,000 count rolls of paper of toilet paper that I'm now in there in order to chafe Nick's so badly that he'll never in this",
            "start": 169.52
        },
        {
            "text": "she we hope he or she was illuminated by the talk about the the by my Scott 1,000 count rolls of paper of toilet paper that I'm now in there in order to chafe Nick's so badly that he'll never in this house again and I hope that you liked Freeway 7. Oh yeah.",
            "start": 217.08
        }
    ]
}