{
    "id": 845,
    "video_id": "m_5kAehNCgQ",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Where Will Gaming Be In 10-15 Years? - Kinda Funny Gamescast Ep. 19 (Pt. 3)",
    "description": "What consoles will exist in 10-15 years?\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1431522006,
    "duration": 1284,
    "transcript_chunks": [
        {
            "text": "All right guys. Topic three comes from at Project Garte. He wants to know , Project Garte is online. What are your predictions and how will the video game industry be like in 10 to 15 years? So that's 05 to 30. Yeah. That's a long ass time. It's just it's you can never I feel like it's so hard to make those. I mean everything's going to look prettier. There'll be prettier games for sure. Um I don't think VR will be a big thing. Like it's I it's for me an evolution of what we already have. And what does that mean ? You know what I mean? Are we to a unified console? Are we too, is Steam one over and it's now in TVs and you're playing your games that way? Like is it all mo tablet and mobile based ? No way. Well let's let's first ask a question of what consoles will will there be? I mean the problem is that right before this console generation we were I was saying that I didn't think it had more than this console generation in it. And now this console generation's ****",
            "start": 0.31
        },
        {
            "text": "be? I mean the problem is that right before this console generation we were I was saying that I didn't think it had more than this console generation in it. And now this console generation's **** killing it in terms of sales. And it's like well even if it turns out next time they sell none there'll still be another generation after that. Yeah. I mean you I don't know. Like we might in 10 years we might be at the tail end of the PS5 era but I don't know what that looks like, you know? All I know is this. When we started at IGN, Greg and I anyway, the whole thing was oh man, like no one's gonna be playing console games in five years. It's all gonna be tablet and phone. Well guess what? They were wrong. Like you know everyone was wrong. And I'm so glad they were wrong cuz I want to play games on a **** tablet or phone. Now um it's not to say most people are if you encount anyone who plays a game is playing on a phone or a tablet but that is not the driving force of a",
            "start": 59.04
        },
        {
            "text": "want to play games on a **** tablet or phone. Now um it's not to say most people are if you encount anyone who plays a game is playing on a phone or a tablet but that is not the driving force of a majority of the industry in the sense that uh there's a few companies that dominate that space and no one else matters you know so um for all of your Kings or whatever you have **** a thousand companies that make no money um and toil about releasing games on the **** ecosystem of complete you know just full of **** basically. Um so it's hard to project in the future even 5 years what the industry will look like because people 5 years ago were so dead **** wrong. Yep. About like where the where the industry was going. I think part of it might have been a backlash because people were sick of hearing this **** when this is not what they wanted. Not core gamers do not want this. You know they do not want to play a game on a phone. And um so I think in 10 or 10 years you might see",
            "start": 98.8
        },
        {
            "text": "of hearing this **** when this is not what they wanted. Not core gamers do not want this. You know they do not want to play a game on a phone. And um so I think in 10 or 10 years you might see an ecosystem that looks a lot like today's with with set top boxes and PCs with like Greg was saying prettier games probably saying playing many of the same genres maybe evolutions of those genres maybe we get some new kind of ideas but with how wrong the prognosticating about tablet and phone gaming was in terms of it killing what we do now and playing core games. My inkling tells me that it'll look more the same than different because that hasn't really changed since the mid 80s right? Like it's not changed at all. The systems are just more powerful. That's it. And the and the way we play games and download games now and play online that's changed. But the whole foundation of holding a controller in front of a TV I'm not sure that's ever going to change. Yeah I think the big change from",
            "start": 140.88
        },
        {
            "text": "and download games now and play online that's changed. But the whole foundation of holding a controller in front of a TV I'm not sure that's ever going to change. Yeah I think the big change from right now right will the online will work out of the box. I think this we'll figure out the social features that won't crash a game like Tetris and make it unplayable and all these different things to that that that point you know that'll be good. So do you think that there will be another PlayStation? A PlayStation 5? Yes. Yes. 10,000. Do you think that there will be another Xbox? Yes. Do you think that there will be a Nintendo console? Uh it's called the NX. We already know all about it. I don't think it's going to be a console. Well 10 to 15 years though. Well I think that Well that's a different question. Like I don't like the next there will be another PlayStation. All right. What I'm asking is will there be a PlayStation in 10 to 15 years? Maybe. I'm not totally",
            "start": 184.56
        },
        {
            "text": "Well that's a different question. Like I don't like the next there will be another PlayStation. All right. What I'm asking is will there be a PlayStation in 10 to 15 years? Maybe. I'm not totally convinced it's a Sony product. And with Xbox I'm not totally convinced it's a Microsoft product. I think I think Xbox spins off of Microsoft soon . What do you think about Sony? PlayStation's just PlayStation though. Yeah but I think that they spin out. Yeah. I mean Sony will make figure out other ways to make money. It I don't think that they've gotten the right deal yet you know like to make to get cash back for PlayStation just own a piece of it not really control it or run it anymore. I think it I I don't think Microsoft wants Xbox anymore. I think that's somewhat clear. I don't know if you guys like read a lot of this a lot of this stuff where it's like it doesn't seem like they're interested in being in console gaming. It's actually like not making them any money at all. Yeah.",
            "start": 220.44
        },
        {
            "text": "if you guys like read a lot of this a lot of this stuff where it's like it doesn't seem like they're interested in being in console gaming. It's actually like not making them any money at all. Yeah. Um so there's been talk for a long time for years about how Microsoft wants out. Um and there there were rumors that Amazon was interested in Xbox and all sorts of things like who knows like what what's true or not but I think Xbox persists and lives on and is successful. I am not convinced that Microsoft is the company that will be running in 10 years. Um and then so for PlayStation, PlayStation I think is more likely to be in the Sony fold but again it's not unusual to think that that would spin off as well because margins are low in games. It's not like running a supermarket where your margins like 4% or something like that but like you have to make money consistently to run these the R&D for new consoles and control these studios and stuff like that. And I don't know if that",
            "start": 255.12
        },
        {
            "text": "your margins like 4% or something like that but like you have to make money consistently to run these the R&D for new consoles and control these studios and stuff like that. And I don't know if that companies that are so bulbous need the **** chip damage money that they get from these consoles. You know what I mean? like is it worth it to take significant losses but only gain you know moderate gains when your console is doing well? That's kind of like that might be more suited to a mid-tier company or a smaller company which is why you know I think that maybe there's there is going to be interested parties in some of these consoles. Do I think Nintendo will have a console in 10 years? No. Um you think NX is it for them? And I'm not I think NX is the end of the road and I don't think NX is a console. I think it's unhandled. So So the you know or a hybrid as we've been talking about for I hope it's that hybrid man. Um but I think I sadly Nintendo's flushed with money. We've talked",
            "start": 292.88
        },
        {
            "text": "is a console. I think it's unhandled. So So the you know or a hybrid as we've been talking about for I hope it's that hybrid man. Um but I think I sadly Nintendo's flushed with money. We've talked about this before. They have a lot of money. They don't have like Apple money or anything like they can make mistakes but there's a lot of people talking that don't really quite understand business where they can make all sorts of mistakes. That $0 billion war chest will disappear like that in a few years if they don't if they're not careful you know and they put out another dud like the Wii U. But these amiibos, the the amiibos are huge and and but again that's not a lot of money you know like they're making a lot of money but it's not like an piece of electronics like something that is mass marketed you know and that's what they need. I think Nintendo would be smart to get into the and you know I hate I I hate I hate being that guy because people hate that guy you know that",
            "start": 325.84
        },
        {
            "text": "is mass marketed you know and that's what they need. I think Nintendo would be smart to get into the and you know I hate I I hate I hate being that guy because people hate that guy you know that says it and people have been saying it for years. It might be time for them to start making considering making games for other consoles but I think NX is their last attempt to not do that. M and obviously their their deal with DNA will will allow them to make mobile games which is a space they're going to thrive in. And let's not forget their IP is worth a **** fortune. So um and that's where the money is. The money is with Mario. The money is not with their hardware. No one no one I hate I hate to be that guy but their hardware is just no one cares. You know people care about their games and they tolerate the hardware. You know you don't hear that a lot from Xbox One and PS4 owners where they're like I'm tolerating the hardware because I want to play **** Wolfenstein. No",
            "start": 359.44
        },
        {
            "text": "games and they tolerate the hardware. You know you don't hear that a lot from Xbox One and PS4 owners where they're like I'm tolerating the hardware because I want to play **** Wolfenstein. No they're like the hardware is great. Oh and it's they have games to play. With the Wii U all you hear is like \"This thing sucks.\" You know but I But Except for the people that like it in which case they think it's awesome. There's Yeah but you all drank the Kool-Aid. That's your fault. I mean you'll wake up one day. Every time I in 10 years you'll look back and be like I can't **** believe I was saying that garbage pile that doesn't sink controllers for Let's Plays was so **** good. And all that shit's issues but in 10 years I'm still going to be looking back at the the good games and the good experience. Yeah you will. The games not the cons. But even Yeah that's that's true. But like still like I when the games are made for the console and stuff I I tie it together. I",
            "start": 393.52
        },
        {
            "text": "and the good experience. Yeah you will. The games not the cons. But even Yeah that's that's true . But like still like I when the games are made for the console and stuff I I tie it together. I don't I mean like I I think like the last Nintendo console that I loved or like I loved the DS. I thought the DS was ingenious you know like the way they integrated those two screens. The way that that that I remember getting a DS. I told you guys that my friend Louise from Harvard lent me one before I bought one and I played Mario on New Super Mario Brothers when I was at when I was at jury duty and like waiting and I'm like this is insane you know? I'm like I can't believe how **** good this is. Um and I felt that way about the GameCube too. Even though the Gamecube wasn't done I was like I **** love this thing. And I and I look back fondly at the Gamecube. I'm like I loved its little discs and its **** stupid memory and its handle and its awesome controller and all these",
            "start": 425.92
        },
        {
            "text": "like I **** love this thing. And I and I look back fondly at the Gamecube. I'm like I loved its little discs and its **** stupid memory and its handle and its awesome controller and all these things. And I look at Wii and Wii U and I'm like oh god. I remember I remember the the games being great. Mario Galaxy for instance a **** classic a classic unrivaled game in many ways but I don't care about the hardware. Wii U is even worse where I'm like I can't like we've used the Wii U and I'm like I can't believe that this thing even exists in the state like that like it's no surprise that no one want like and and I'm not trying to be a dick. It's just like it's not a surprise that a lot of people no one's taking this thing because it doesn't work you know like it's not a revolutionary anymore. Nintendo needs to stop trying to revolutionize hardware and start revolutionizing with their games and that's their strong point. when they started getting too they started drinking their",
            "start": 464.88
        },
        {
            "text": "anymore. Nintendo needs to stop trying to revolutionize hardware and start revolutionizing with their games and that's their strong point. when they started getting too they started drinking their talking about Kool-Aid. I feel like they started drinking their own Kool-Aid in a way being like \"Well you know we innovated with the Wii so the Wii U has to be another innovation.\" Yeah. Can we innovate the name? No. Just add a U. Everyone will get it. And the DS was a revolution too. And I feel like they just you know and then they added 3D to it and it's like oh like Jesus Christ. Like just you could have just called this DS and I would have been all over it you know? Just they're they they're an interesting company. They're the ones that are going to look much different in 10 years. I don't know that PlayStation and Xbox as a brand will be too unidentifiable. I think Nintendo might be unidentifiable for better or for worse. They might be even more flush with money. I can't",
            "start": 497.36
        },
        {
            "text": "I don't know that PlayStation and Xbox as a brand will be too unidentifiable. I think Nintendo might be unidentifiable for better or for worse. They might be even more flush with money. I can't wait to see how much money they make when they actually go with DNA and make these these **** mobile games. You know it's going to be insane how much money they can possibly make. So moving on from that then what about Apple? Do you think Apple will have a dedicated gaming console? No I don't. They had one. Uh but you know in the mid'90s and it didn't work out very well but that was a different that was that was a different Apple. Um yeah the Pippin. Uh and that was when they were that that was at the same time they were doing like Newton and all these like things that didn't work but they were kind of ahead of their time. Newton was quite ahead of its time actually. Um Newton was a PDA for people that don't know. I remember Newton. Um but uh I think that Apple's again this is a",
            "start": 531.36
        },
        {
            "text": "they were kind of ahead of their time. Newton was quite ahead of its time actually. Um Newton was a PDA for people that don't know. I remember Newton. Um but uh I think that Apple's again this is a a question of margins right? Apple makes tons of money with hardware. Um but they don't support it natively necessarily with their own software. In other words they have an IIO they have iOS and that works and it's awesome and I love it and they have their operating systems for their computers and their tablets but they don't manufacture the killer app. They kind of let other people do the work and they make money. It's very much like what Steam does on PC. So I think that they look at this and they're like \"No I'm sure that they were thinking about it.\" Yeah I'm sure that they might have even made one and had it running you know and working on stuff but I don't know that it sees the market. When you hear things about when you hear about the rumors the things that Apple's",
            "start": 566.0
        },
        {
            "text": "have even made one and had it running you know and working on stuff but I don't know that it sees the market. When you hear things about when you hear about the rumors the things that Apple's trying to get into especially cars which is the **** craziest thing that you might have heard about Apple with Project Titan that tells me that they want margins. They want big things that can make lots of money off of. And I don't think that consoles are the big thing that they can make lots of money off of. So I don't that that to me doesn't I don't know if Greg agrees but that doesn't resonate. No I do. I think the time is coming and gone. I think that was I remember when that seemed like a imminent thing that there was controllers. We've heard this rumor that Apple's doing this and the fact that they haven't act on it yet means they're just not going to act on it. You know what I mean? Like I still think the best case scenario for it right? Is them being like \"All right we see",
            "start": 605.28
        },
        {
            "text": "fact that they haven't act on it yet means they're just not going to act on it. You know what I mean? Like I still think the best case scenario for it right? Is them being like \"All right we see what Google Chrome's doing. So we're going to figure out with the next iPad, iPhone, whatever iOS that we have a dongle that we support that you put in your TV's HDMI and whatever you're doing on your tablet gets projected up there or phone right?\" And then it would be game makers again who are making the products like you're talking about right that are doing cool things with it and using it in that sense. And then kind of as a byproduct Apple's in the console space where they really aren't. But that what we're describing there is what I hope the NX is where I hope it's a great **** awesome controller I hold and I can take on take with me and play most of the games some of the games some part of the games on the go and come back and put on the TV and do all that other stuff. Mhm.",
            "start": 638.72
        },
        {
            "text": "controller I hold and I can take on take with me and play most of the games some of the games some part of the games on the go and come back and put on the TV and do all that other stuff. Mhm. Yeah it'll be it'll be that's the the NX is so fascinating because for the NX to work the way we want it to work they must technologically revolutionize consoles and the way we play traditional games in ways that the others have not. And you don't expect that out of their R&D today you know because they don't make powerful hardware anymore. And the NX better be **** powerful you know? Like I I'm so sick of the whole like it does the power doesn't matter. It does matter. But that's the thing right now for what they're doing. Think about it. the power doesn't matter because like you're saying they're not known for powerful hardware right? Which works out in the fact that every year or every generation we'll say PlayStation and Xbox get meteor and beefier and do more and more and they",
            "start": 675.84
        },
        {
            "text": "they're not known for powerful hardware right? Which works out in the fact that every year or every generation we'll say PlayStation and Xbox get meteor and beefier and do more and more and they need to like there's no way to put the Xbox One stuff guts into a something I can take with me right and play the game somewhere else. If Nintendo's like going to do the whole thing where Marching the Beat drummer like how the Wii didn't go to HD when the Wii came out. If they do something like that then maybe there is that chance for parody where it doesn't have to be. Okay you're playing this Zelda RPG on your screen with your NX. Now you're leaving. So Link gets into this thing and goes to a different dungeon. You can only play Dungeons on your NX handheld without being connected to the device right? If they boil it down to where it's a not a **** not blowing your socks off but it's awesome games that can be on your TV can be on the go that'd be interesting. I hope that's not the",
            "start": 712.48
        },
        {
            "text": "right? If they boil it down to where it's a not a **** not blowing your socks off but it's awesome games that can be on your TV can be on the go that'd be interesting. I hope that's not the case. You might be right but I hope I hope that's not the case. And again it's all a conjecture. No one has any idea what the **** that thing even is or means and when we're going to see. I guess we'll see it next year but now it won't be out next year. Damn. But it's it's you know I'm so Nintendo frustrates the **** out of me man. And people that watch the show listen to us know like they because they they they're always so close you know like they're like that's the thing that bothers me is that they they have some of the best developers in the world some of the greatest minds in the world a lot of business sense. Um and they just strike out with the hardware you know like they just the playing the 3DS is is tough for me because I'm just like why is this so weak? Like why",
            "start": 752.32
        },
        {
            "text": "world a lot of business sense. Um and they just strike out with the hardware you know like they just the playing the 3DS is is tough for me because I'm just like why is this so weak? Like why does it have to be like this you know? And I feel bad for their developers because it's like they certainly want to make games that look better than this and play in a more revolutionary way. And they're not given the tools to do that. And that's really frustrating for me as a as as a what I always say as a lapsed Nintendo fan where it's like it wasn't always like this. I want I want the NX to I want the NX to be so I when I see the NX when it's at E3 next year or whatever I want it to be **** awesome you know? I don't want it to be confusing. Remember the Wii roll out how nonsensical that was when everyone was like \"Is it a console? What is this game? Is it a controller? Is it an add-on to the Wii?\" They I hope they're learning. I think they're learning. Um I don't think that Zelda's",
            "start": 786.64
        },
        {
            "text": "was when everyone was like \"Is it a console? What is this game? Is it a controller? Is it an add-on to the Wii?\" They I hope they're learning. I think they're learning. Um I don't think that Zelda's delay for instance has anything to do with NX. I think that a lot of people think that like it's because it's going to be cross. I don't think that's true. Maybe I'm wrong. I think that that will be a Wii U game. It will be the Wii U's last hurrah. I want them to start fresh with a new foundation and a new and a new set of engines and give their developers something to be excited about. Give third parties something to be excited about. They must have third party support. I don't care if people think it matters or not. When they didn't have third party support their consoles started to fail. And when they had third party support their consoles didn't fail . NES, SNES, and Wii all sold through the roof. It's because they all had plenty of third party support. N64, GameCube and Wii U don't",
            "start": 831.28
        },
        {
            "text": "And when they had third party support their consoles didn't fail. NES, SNES, and Wii all sold through the roof. It's because they all had plenty of third party support. N64, GameCube and Wii U don't have third party support and do not sell you know. There's there's there's a direct relation to to those two things. It's undeniable you know. So there's all these things that matter. And if you want your games to be cross-pollinated with the consoles that exist now you must make a powerful piece of hardware. So is there anyone else that has a console? Amazon or someone like Activision or something like that? I think Amazon's imminent. I'm curious what I'm curious what they're going to do. Amazon has a game studio. No one knows what they're working on and they hired a **** **** ton of people from other other places and paid them a lot of money. And I I don't know what they're doing. I don't know if if Amazon's going to publish games. I don't know if Amazon's going to release a",
            "start": 861.84
        },
        {
            "text": "of people from other other places and paid them a lot of money. And I I don't know what they're doing. I don't know if if Amazon's going to publish games. I don't know if Amazon's going to release a console. I don't know what I don't I don't think Amazon might release a console because they did try to release their phone and stuff like that. Um they will for sure. I they they seem bullish enough on all that and they're they're still building to that point where it feels like Apple built past it. You know what I mean? Amazon I feel still still has that chip on their shoulder. They want to be in that market space. Yeah. People have been awfully quiet and rightfully so cuz they're probably under NDA about what is going on over at Amazon but but I feel like it's just going to go the way not as disastrously but more of an Ouya like it's this thing that comes out like oh interesting kind of like Amazon Fires are just like oh that's interesting but like cool what do you think for the",
            "start": 897.84
        },
        {
            "text": "not as disastrously but more of an Ouya like it's this thing that comes out like oh interesting kind of like Amazon Fires are just like oh that's interesting but like cool what do you think for the market? Yeah. Do you think any third party though like Activision or something? No there's no way that's over with. There's no way hard there's no money in hardware. Like that's that's the point I'm trying to make is that for these mega corporations that look at the bottom line making 5% of your money back is might not be good enough. I I and that's where I get kind of the the whole Xbox vibe where I'm like I think that they want to sell spin Xbox off. And those rumors again have been circulating. People can reading Google about that. Those have been circulating for a long time. Um Oh Northeastern's calling me asking me for money probably. Um and uh you know so I don't think I don't think the console space is a savory place that you want to be necessarily if you're not already there",
            "start": 931.68
        },
        {
            "text": "Eastern's calling me asking me for money probably. Um and uh you know so I don't think I don't think the console space is a savory place that you want to be necessarily if you're not already there because also carving out your niche and like carving out your name means something. Remember that when Xbox is introduced in 001 that it was nothing. No one cared you know. Um it ended up edging out GameCube but it was quite a fight. And meanwhile PlayStation just put them both away. It's because PlayStation had time to establish itself. Just like when you know PS1 came out it came out at a time where in the in between space where there wasn't any competition something Sega tried to replicate with the Dreamcast and it didn't work. Um so it's not wise to enter this space unless you have all of your ducks in a row. And that means having a dozen plus developers. That means like having your own IP. That means having exclusive deals with established third parties. And I hate to tell",
            "start": 969.32
        },
        {
            "text": "all of your ducks in a row. And that means having a dozen plus developers. That means like having your own IP. That means having exclusive deals with established third parties. And I hate to tell you it's like an old boy club man. It's it's Sega you know died and then you know or they're alive but they died as a console you know manufacturer. and it was just up to these three other guys and they have all their entrenched interest and their entrenched relationships and it's going to be hard to break into that stuff and that's those are the things that really matter unless you were going to put billions of dollars behind your marketing and all that kind of stuff and like getting your games out and giving people great deals and stuff. There's no room for anyone else and I don't think you want more people in involved in the hardware manufacturing because that's the least important thing. It's who's making the good games and when it's back to you know the ukulele topic with",
            "start": 1007.04
        },
        {
            "text": "think you want more people in involved in the hardware manufacturing because that's the least important thing. It's who's making the good games and when it's back to you know the ukulele topic with Playtonic where it's like they're making the game they're making it for everything. I mean if you talk about right I'm sure third party and the publishers you're asking if they're going to get in the console market. I bet they want it all to fall away. They want it to get to just being a PC thing or whatever. One unified platform so everyone can they can focus on one skew and not jump through all these hoops to make it work and do all these different things. Yeah. God that'd be so so so awesome. All right guys. Monopolies never end well do they? It's not going to happen anyway. I would love it. The unified console thing is tough just because it's it means that the two of the three must die. Yeah. Yeah basically like for for them to go away or just bow out gracefully and and and Sony",
            "start": 1038.4
        },
        {
            "text": "it. The unified console thing is tough just because it's it means that the two of the three must die. Yeah. Yeah basically like for for them to go away or just bow out gracefully and and and Sony and Microsoft are not going to bow out. So like I just think there's too much bravado and rightfully so. I think Nintendo is the one that's that's going to maybe and it's not going to be Nintendo Pride thing either. It's going to be Nintendo like looking at the bottom line being like man we got to we can make a lot of money just making these **** games and and partnering with again and I've said it before like I think they partner with Microsoft. I don't think they partner with Sony and saying like you know because of the bad blood going back to CS and all that kind of stuff in the early 90s like wow like we can just **** the hardware and make Mario for Xbox. Well that's the thing though. You're saying the two of them need to die in order for there to just be one. Do you think that",
            "start": 1070.56
        },
        {
            "text": "like wow like we can just **** the hardware and make Mario for Xbox. Well that's the thing though. You're saying the two of them need to die in order for there to just be one. Do you think that Nintendo exclusively making their games for Sony or for Microsoft is enough to kill the other one? I think it's a I don't I don't think it will kill them. It's that's that would be a revolutionary thing. That would be like one of the craziest things that had ever happened in games in the world. Like like if Nintendo if Nintendo went third party that would be crazy. And if they were like we're going to make PlayStation and Xbox games and they're just going to we're going to release on if they were like we've have a 10-year partnership with Xbox that would like I couldn't even think of news bigger than that. Yeah. In the gaming space like that would be insane and Sony would be in very bad shape. You know not they would sell and they'd have their hardcore fan base but you suddenly you know",
            "start": 1106.56
        },
        {
            "text": "than that. Yeah. In the gaming space like that would be insane and Sony would be in very bad shape. You know not they would sell and they'd have their hardcore fan base but you suddenly you know the numbers stop getting so big. console that people bought just to play those games suddenly all go to this other place you know? That's it's like a dream. It's a It's so funny because it used to be kind of talked about very quietly in like 008, 009, 010 like \"Oh maybe Nintendo should just stop.\" Yeah . You know and now it's being talked about louder and now people are getting more excited about it you know and now people are like saying it with gusto and you know maybe it'll happen. I don't know. Kevin just texted me and he said NX Nintendo Xbox. Oh if Kevin's right everybody remember this episode. No it's funny though like you talk about two of the three failing. I always thought it it would be the three failing. Like I thought Steam had the right idea. And if I think Steam",
            "start": 1145.44
        },
        {
            "text": "this episode. No it's funny though like you talk about two of the three failing. I always thought it it would be the three failing. Like I thought Steam had the right idea. And if I think Steam Box could have been their first step towards putting everyone out of business and it wasn't cuz they overco complicated it. Well they don't want to make hardware right? Exactly . So here's 14 versions of a Steam box. I'm like well no **** That's not what people wanted. I don't blame them though. They need an easy solution. Well I'm just saying what could have happened. They That could have been the unified platform if you would have done it this time. put it in down gotten people behind it and then slowly built on it so the third generation is accessible and easy and everyone can understand it. Yeah I wonder. Yeah Steam was the only one that could have disrupted and again I hate that Silicon Valley **** term but they they could have disrupted the entire industry with a",
            "start": 1190.64
        },
        {
            "text": "understand it. Yeah I wonder. Yeah Steam was the only one that could have disrupted and again I hate that Silicon Valley **** term but they they could have disrupted the entire industry with a unified like one platform that was made by Steam for Steam. Yeah. But they're they're they're wary even with all their money of getting into the hardware business. That tells you all you need to know about how complicated it is. Steam had the most to gain and were probably almost guaranteed success and people who are entrenched in gaming. Yeah. And they still didn't want to do it. Yeah. So I mean that and and it has people like Nvidia like jumping all over it that like will never break in. So it's it's which is like what everyone's like \"Oh the shield or anything?\" I was like \"No.\" Like don't you understand how complicated it is to get into this **** industry you know and like make a console and get people to give a **** about it and and create legacy? I was holding out for Mad",
            "start": 1223.12
        },
        {
            "text": "you understand how complicated it is to get into this **** industry you know and like make a console and get people to give a **** about it and and create legacy? I was holding out for Mad Catz man. Mad Catz they're always a step. They're publishing. I mean Mad Catz is what we will. They're they're they're evolving as a company you know. They're evolving into Mad Tigers. Damn.",
            "start": 1258.88
        }
    ]
}