{
    "id": 828,
    "video_id": "oZ8SPT5sNgk",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What Would You Ask Future You - The GameOverGreggy Show Ep. 74 (Pt. 3)",
    "description": "Tim Gettys asks what we would ask future us.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1430895600,
    "duration": 1165,
    "transcript_chunks": [
        {
            "text": "This episode is brought to you by Loot Crate, the box for geeks, gamers, and pop culture nerds. For less than $20 a month, you get six to eight items of gamer and pop culture, like vinyl figurines, comics, shirts, and more. Go to lootcrate.com/kf and enter the code KF to get 10% off any new subscription. May's theme is Unite. So sign up now and you'll get swag from super groups like the Avengers, Team Fortress, and more. Tim. Mhm. It's your topic. Yes. But just so happens that your topic sponsored. Yay. This one's sponsored by Loot Crate. Our friends over at Loot C rate helping us pay the bills for the show. Uh if you guys go to lootcrate.com/kf and enter the code KF, like Kinda Funny because that's who we are. Uh you get 10% off your new subscription. You get 10% off your new subscription. I was not talking about a compact flash. That's a card. Yeah. I know, but that's not the cards we use, and we're not doing that. So, you're saying KF isn't Kinda Funny . Kinda Funny.",
            "start": 0.08
        },
        {
            "text": "subscription. I was not talking about a compact flash. That's a card. Yeah. I know, but that's not the cards we use, and we're not doing that. So, you're saying KF isn't Kinda Funny. Kinda Funny. Loot crate .com/kf. That sounds fun. Yeah. 10. Does it Does it sound fun? 10% off. I love 10. I love I love uh promotional codes. I love that stuff. This episode is brought to you by Loot Crate box for geeks, gamers, and pop culture nerds. For less than 20 bucks a month, you get six to eight items of gamer and pop culture like vinyl figurines, comics, shirts, and more. Uh, the May theme is Unite. So, sign up now and you'll get swag from supergroups like the Avengers, Team Fortress , and more. They're so good at timing stuff. Yeah. They know what they're doing. We We We paused on our unboxings. We were doing those for a while, but then just unboxings. We I We've been giving away. We have a lot of other things to do. I've been periscoping them. That's how I've been doing the Bark Box",
            "start": 55.04
        },
        {
            "text": "We were doing those for a while, but then just unboxings. We I We've been giving away. We have a lot of other things to do. I've been perisc oping them. That's how I've been doing the Bark Box, periscoping them. But the loot crate over there that we're going to give away at Connor Live coming up is Game of Thrones themed. Lots of Game of Thrones stuff. They do. Yeah. So, every month there's different theme and stuff. So, that's all cool. And uh again, so what was it? 10% off if you go to.comkf. Awesome. You go to CF, you're going to be supporting Chris Fernandez, and we don't want that. Chris Fernandez with Kinda Funny. Him and uh who's the guy who was the guy we had last uh Anthony uh Carboni? Is it? No. No. The drawing that somebody sent in of what the one I don't even I don't remember the character or the reference. 31 Flavors. Oh, the the fictional character uh at BaskinRobbins. Uh I don't know. I retweeted it, I think. So, we'll figure that out. Him and Chris for for Fernandez. I",
            "start": 92.32
        },
        {
            "text": "the character or the reference. 31 Flavors. Oh, the the fictional character uh at BaskinRobbins. Uh I don't know. I retweeted it, I think. So, we'll figure that out. Him and Chris for for Fernandez. I got a question. Hang out together at Baskin Robbins. Is BaskinRobbins called 31 flavors in SoCal? It's BaskinRobbins 31 flavors. That's his full Yeah. I think they rebranded at some point and dropped 31. It's still in their logo. Yeah. But they don't usually It's like old people like us remember that cuz like you always call it 31 flavors. I'm like that's so weird. I know a couple other people that like that used to be I Yeah, I think Greg's correct. I think it used to be their full name. when my ask. Well, I knew it was their stick, but like that's like to me whenever someone says that I'm like, \"Do you call Subway eat fresh?\" But it wasn't like that. It wasn't like it was it was for real in their It was I remember I remember there was a 31 flavor. Even now, their logo, if I remember",
            "start": 131.44
        },
        {
            "text": "like, \"Do you call Subway eat fresh?\" But it wasn't like that. It wasn't like it was it was for real in their It was I remember I remember there was a 31 flavor. Even now, their logo, if I remember correctly, the BR has 31 in it. It's like the FedEx era. Once you see it, you can't see it. Mhm. But it's like I I would have never I would never say Robbins 31 flavors. It's It's similar to um how Domino's Pizza is now just Domino's and you're like, \"We're more than pizza.\" They're They're just cramming that down our throats. Yeah. Like Pizza Hut clearly isn't the better pizza. Damn. You just **** I got I'm Well, I'm going to give a shout out. I've talked about this before. I don't know where or when, but a shout out to Domino's for the most self-degrading marketing campaign of all time, which was like for years they were like, \"We suck.\" That was like all they used to say in the commercial like, \" Our pizza sucks. Our dough sucks. Our cheese sucks. Like, we have to be better. Our",
            "start": 170.16
        },
        {
            "text": "which was like for years they were like, \"We suck.\" That was like all they used to say in the commercial like, \"Our pizza sucks. Our dough sucks. Our cheese sucks. Like, we have to be better. Our delivery sucks. We don't know. You can't pizza cookie and all that other stuff.\" Yeah. Like they they keep like just making fun of themselves and it's awesome. Like it's it's totally self-deprecating and I think it's whoever like whatever marketer or like group came up with that campaign. It's brilliant because it's like listen guys like people think you suck. You have to acknowledge it and then make it better and that's what they've done. Start there. That's your baseline and then kind of go from there. It's brilliant. You can see like a you can see a uh a madman kind of boardroom scenario with that. Yeah. I had um did we get to your topic yet? No, we didn't. No, we have no idea. Let me let me go on this tangent real quick and then I was in I was in Amsterdam. Did we get there? Did we get",
            "start": 220.64
        },
        {
            "text": "that. Yeah. I had um did we get to your topic yet? No, we didn't. No, we have no idea. Let me let me go on this tangent real quick and then I was in I was in Amsterdam. Did we get there? Did we get Javic? We're on a tight schedule. **** that. Here's a tang. We're going to have to do the fourth one after our our not the do your topic. No, no, no. Go on your I was going to say I was We have to do the Patreon Q&A today for the Kinda Funny Games folks. And of course, in true Kinda Funny fashion, we're cutting it down to the **** wire. So, we'll just do the Go set it up. I thought Here's what I was throwing out there. It's an exclusive Q&A. We could just start the Q&A while we finish the topic. Oh, hey everybody. We're going to finish this topic. You get to see a topic early. Thought Yeah, you could do that. I don't know technically if that's a thing. problem. Kevin's shaking his head. He's like, \"What is he just take a break for it? Let's just take a break for it. Can you just",
            "start": 252.64
        },
        {
            "text": "Yeah, you could do that. I don't know technically if that's a thing. problem. Kevin's shaking his head. He's like, \"What is he just take a break for it? Let's just take a break for it. Can you just **** let me do my thing? Let me let me do my thing in the middle here so you guys can see it .\" But it's also going to be No, no, we're not doing that. Funny story. We don't need to see the laptop. Funny story. My story by now. We're wasting more time now. Guess what? It's already over. We've blown it up . No matter what, something's happening. All I was saying was that we could do the fourth topic after the Q&A and Nick, go on your T. That's fine. Uh I was in Amsterdam one time on a job and we were it was like a three or four day job very hell ish and it was one of those things where like you're hung over, you've traveled too long, you're out of your normal environment and the food is different because the food in in Holland is like it's different. It's just different, right? So we had this",
            "start": 288.48
        },
        {
            "text": "hung over , you've traveled too long, you're out of your normal environment and the food is different because the food in in Holland is like it's different. It's just different, right? So we had this one moment uh Brennan and I was a Brennan job um where he was like, \"Dude , I just want something American.\" And there happened to be a Domino's down the street from us and we're like, \"Dude, it can't taste the same. It's not going to taste the same.\" So, of course, we ordered two extra-large like Domino's pizzas with like chicken wings and all that stuff. And I think we got like a barbecue or not barbecue, a chicken wing pizza and it was exactly the same. And it brought it home. It got us through the trip cuz you know when you're in a foreign country, you're like, I just want something that tastes like America, you know, and then you get it and you're like, I'm good. I can go the extra mile. How long are you gone? Like 4 days. Yeah. When I mean like you're like **** talking like you're",
            "start": 324.24
        },
        {
            "text": "like America, you know, and then you get it and you're like, I'm good. I can go the extra mile. How long are you gone? Like 4 days. Yeah. When I mean like you're like **** talking like you're an Afghany when I go to Gamescom takes like eight hours to get there. In the Cologne train station right by Gamescom, there is a Pizza Hut. And I go to that Pizza Hut religiously when I'm in when I'm in Cologne because it's like I got to have a piece of pizza, man. And and again, it's it's bad pizza , but it's bad American pizza. Bad American pizza. And it's better than having another whatever the hell I'm eating over there. The food in Germany actually actually resonates with me quite a bit, but uh I hear you 100%. Okay. So, my topic is if you could talk to your future self, have a conversation. Am I going forward in time or is he coming back? Uh, he's he's coming up. You're sleeping in bed, right? You and your girl sleeping in bed in the present time. You're you're just chilling in bed and at",
            "start": 357.92
        },
        {
            "text": "I going forward in time or is he coming back? Uh, he's he's coming up. You're sleeping in bed, right? You and your girl sleeping in bed in the present time. You're you're just chilling in bed and at like 3:00 in the morning. Am I sleeping? Future you pops in and you're wakes you up. It's like Tim or Nick Greger call. Yeah, I understand. Yeah. What do you want to know about the future? I can tell you anything. Now, here's the the thing. You can't use this for gain. Like, you can't do any Back to the Future **** You can't like, oh, I want to make money off of this. There's no profiting from this. It's just information that And the the other caveat here is whatever they tell you isn't going to change the future. That's what I was going to say. So, there's no assumption of paradoxes. There's there's no paradoxes, none of that stuff. So, I can't be like, \"Hey, uh, should I get in the car tomorrow ?\" And he's like, \"Don't do it because that's where it ends.\" I don't I don't think that you",
            "start": 401.6
        },
        {
            "text": "there's no paradoxes, none of that stuff. So, I can't be like, \"Hey, uh, should I get in the car tomorrow?\" And he's like, \"Don't do it because that's where it ends.\" I don't I don't think that you would ever like that's okay. I guess that's my question is what are your questions? Future you clearly from 10 years in the future and you're like do I get in the car tomorrow and he's like yeah it's going to be okay. He's like that's a waste of your question and then recedes but but the thing is like what questions would you ask? Like what are the first things to come to mind? I can ask one a lot. I mean it's you know it's a conversation like eventually he's going to leave. You can't just ask him forever. But like he has things to do in the future. Come on. Obviously. But uh it's I don't know if my question should be what questions would you ask or what would you not want to know? Both of those. I would ask a bunch of questions about like politics and depending on how much in the future he",
            "start": 442.08
        },
        {
            "text": "my question should be what questions would you ask or what would you not want to know? Both of those. I would ask a bunch of questions about like politics and depending on how much in the future he was, space travel, where are we? How much technology do we have? Like what's the cool new piece of technology? Like after the success of the iWatch, he was like, \"Well , the iWatch was the most successful piece of technology ever created. So now we all wear watches only.\" Mhm. Watch. Totally naked except for an iWatch. You wear a watch on your dick. You wear a watch around your waist. So many watches. Is this an eye belt? Also, just in case. So tell when your pants are going to fall down. Uh I don't know. It's hard because I think every question that pops in my mind I think I could benefit from. The immediate question is what's the dominant medium for entertainment like 10 years from now? like where how are people gonna consume what we do so that we can make sure we're there when it's",
            "start": 484.16
        },
        {
            "text": "from. The immediate question is what's the dominant medium for entertainment like 10 years from now? like where how are people gonna consume what we do so that we can make sure we're there when it's happening, right? And like and like or make sure that we're staying ahead. Like I would have loved to I would love to go back to 2005 and tell myself, hey, this YouTube thing that you think and you're arguing to every single person you know that it's going to be shut down because it's like **** Napster and it should be shut down because it's illegal. Hey, that's going to be a really big deal. Get on that right now. You know, that guy I didn't like. Oh, I was like, \"Dude, this is such bullshit.\" It seemed obvious at the time though, like what you're saying was going to be true. Oh, yeah. Like, how does anyone that this is happening? It was in lawsuits like YouTube was being sued and then Google came like clean because we have more power than you and this and I was like , that's weird. That",
            "start": 525.52
        },
        {
            "text": "how does anyone that this is happening? It was in lawsuits like YouTube was being sued and then Google came like clean because we have more power than you and this and I was like, that's weird. That doesn't make any sense about the lawsuits when they came off . Um, so I mean that's that it's hard for me to be altruistic about this because I'm like what else would I ask myself unless it's questions that pertain exactly to like me and my wellbeing. Well, no, but that's what I'm saying though. It's just just what are things that you're interested in knowing. Yeah. Just curious. Like for me, first thing to come to mind is how are the Star Wars movies? Yeah. I know it's not important, but I'm just saying like this is But that's my thing. I don't want to know that. I don't want me cuz it's if it's me, I'm going to be like they sucked and then I have to believe me cuz it's me. It's not like your opinion where I'm like, well, it's just him. I don't I don't trust like Kevin's opinion is going",
            "start": 564.8
        },
        {
            "text": "me, I'm going to be like they sucked and then I have to believe me cuz it's me. It's not like your opinion where I'm like, well, it's just him. I don't I don't trust like Kevin's opinion is going to be different because it's Kevin. He's bringing to it everything he does with his own set of circumstances and like and experiences and his his version of it's going to be totally different. His experiences could be completely different than mine. He's younger than me. He didn't go through he didn't see the original Star Wars film in a movie. Like he's not bringing that same nostalgia. So if he says it sucks, I might see it and go, \"This is amazing.\" But if I see it, I'm going to be like, \"Nick, you hated it.\" And I'm like, \"Fuck.\" Right. That creates a paradox, too. Yeah. But that's what I'm saying. There's no paradox. It's just like what's information that you would you would there's nothing fun about knowing everything about the feature. That's whole that's the part of So your answer is",
            "start": 599.44
        },
        {
            "text": "There's no paradox. It's just like what's information that you would you would there's nothing fun about knowing everything about the feature. That's whole that's the part of So your answer is nothing. You would have nothing probably unless it were it were to pertain specifically to me where I'm like hey if you follow this set of instructions the Lambo in 10 years or like 10 years then I probably like let's just hang out and get some coffee and **** But here's the interesting thing Tim is that is that you said like 10 years in advance right for instance just as an example. I didn't put a time frame. Okay. So I thought someone said it uh let's say it's 10 years in advance . You can infer a great deal from that. You can infer that you are still alive in 10 years. You can infer what you look like in 10 years. And so there's certain things that you will know just by looking without even asking any questions. Like you could you can just somehow verify that this is your future self and be",
            "start": 635.2
        },
        {
            "text": "like in 10 years. And so there's certain things that you will know just by looking without even asking any questions. Like you could you can just somehow verify that this is your future self and be like, \"Well, where are you from?\" And you're like, \"Well, I'm from 2035.\" And you're like, \"Okay, so I'm still alive in 2035.\" Dope and this is what I look like in 20. But like I would really ask like questions. I'd be like, \"So who's the president?\" You know, and you'd get some name of some junior senator from some obscure state probably. Or you'd be like I'd be like in 10 years I'd be like are we on Mars? Yeah. You know like like like questions like that like did we go to we in the moon and we on Mars? Like did we did we solve the oil crisis? Did we does California have water? Like all like I would be like I would ask myself a lot of current questions that would be like almost systemic like is has anyone fought a war since we've been gone? Has anyone gone? Like awesome. Is there an al oil",
            "start": 670.0
        },
        {
            "text": "would be like I would ask myself a lot of current questions that would be like almost systemic like is has anyone fought a war since we've been gone? Has anyone gone? Like awesome. Is there an al oil alternative? Did we finally adopt alternate fuel sources? I don't know. I'd have a lot of pretty curious questions to ask 2035 column. You know, that has nothing really to do with my personal game, but I would I would also love to ask him questions. Yeah. Would you ask would you ask like do I have kids? Would you ask how many kids do I have? Yeah. Like like who did I marry? How many kids? Yeah. It would be it would be curious. But then that creates a paradox. No, that's what I'm saying. Like and that's why the rules of this are there's no paradox. It's like just you get the information and it ends there. Yeah. Yeah, but see that's the thing. Like I don't know if again I don't want to keep beating a dead horse, but like I don't want I want that experience of like if I were to have children",
            "start": 704.64
        },
        {
            "text": "ends there. Yeah. Yeah, but see that's the thing. Like I don't know if again I don't want to keep beating a dead horse, but like I don't want I want that experience of like if I were to have children finding out with my wife the sex of my child for the first time. I wouldn't want me 55year-old Nick to come back and be like, \"Hey dude, it was a boy and recede into the shadow.\" That's what your future brother tip of his finger . That's what Matt Scarpino from the future would do if he came back to like that for you. Let's be honest, my brother would not wake me up with his voice. Oh, he would wake me up by probably putting his ball sack on my face or something crazy like that. I would like to believe that by then, he hasn't done it in years. Ball sack. I would like to believe that by then he would have grown out of that. But when we were young and living together still, that was how 99% of my drunken like p like passing out drunk I I I would wake up and be like, \"Those better be",
            "start": 740.96
        },
        {
            "text": "then he would have grown out of that. But when we were young and living together still, that was how 99% of my drunken like p like passing out drunk I I I would wake up and be like, \"Those better be walnuts.\" Like that better be the the leftovers of that Costco nut bag that you you get my mom gets every year, you know, with like the 50 different kinds of nuts. You're like, \"What is where is this from? What region of Peru is this nut from the fuck?\" You know what I mean? No. No, I don't. I think I understand. Yeah, I'm kind of there. I'm going I'm tired, guys. I'm up against the wall. It's okay. Um you're always up against the wall. Okay. What about you? Uh I Yeah, my first question was did I ever get married again? And then I was kind of bored with the situation because like I don't know who the president's going to be. I don't care. Whatever. I'll know. And like does California have water? Spoiler, we have water in 2035. Life's just about how it is now. More a little bit more",
            "start": 785.6
        },
        {
            "text": "who the president's going to be. I don't care. Whatever. I'll know. And like does California have water? Spoiler, we have water in 2035 . Life's just about how it is now. More a little bit more tech. You could see with, you know, with catastrophes though, like what what just happened in Tibet for instance, like things can change on a dime and and geographic locations pretty quick. In 1815, a volcano erupted that that affected uh the entire world's uh global temperature and cause crops to fail all over the world. Like things there and it was like attached to a lot of people died. So things like that can happen. I'd just be curious like we're in such a volatile world. I'd be like well but again you can infer all the things. So I'm like, \"You're still alive. Is America still exist?\" Exactly. You don't have like scars. You're not in Mad Max clothes. I'd be like, \"Can you show me the money in your wallet?\" Like I'd be curious about like all like, you know, like this thing's like, \"Do we",
            "start": 823.2
        },
        {
            "text": "You don't have like scars. You're not in Mad Max clothes. I'd be like, \"Can you show me the money in your wallet?\" Like I'd be curious about like all like , you know, like this thing's like, \"Do we still use the same money?\" Like like, \"Do you have a wallet?\" I wouldn't want to ask him if he if the the rest of the movies were good. I'd want him to bring me all the DC movies so I could just watch them right now and not have to wait for all this crap. Fascinating. That's what I always think about going to the future and then like if you got to the future and like there's all the cool future stuff, but just being able to watch all the movies, play all the games that aren't out yet that you've been waiting for, you know, play Uncharted 4, play whatever came after that, play Paton 4, whatever the **** that is. For me, it's like it's like this the spoilers of life where it's just like when when something's revealed for a movie before it comes out, it's so tempting to read about it, you",
            "start": 858.24
        },
        {
            "text": "the **** that is. For me, it's like it's like this the spoilers of life where it's just like when when something's revealed for a movie before it comes out , it's so tempting to read about it, you know? And it's just like sometimes you break and you do it and it's like but then like if he spoils your entire life then and and you can't ever change it then you're going to live the next 30 years knowing everything that's going to happen. You know how boring that is? Like it's still not boring. Just because you know it's going to happen doesn't mean it's not sure. It's just it's just that the I like this question because it forces you to throw away the whole paradox and self-gain kind of thing. But I do agree with Nick that it would be hard to play this game without creating a paradox or doing something for self-gain. Like in other words, you would be hardressed. Like there are all sorts of paradoxes that are created even from knowing that we went to Mars, you know, like like so like",
            "start": 889.44
        },
        {
            "text": "something for self-gain. Like in other words, you would be hardressed. Like there are all sorts of paradoxes that are created even from knowing that we went to Mars, you know, like like so like if I knew that then how would I not predict it? How in other words, how would I force myself if I knew who if I knew person X was going to be president in 2035 and it's a totally ridiculous thing cuz he's 5 years old right now getting stoned in grad school or something like that. How would I not use that to how would I keep my mouth shut? Yeah, you'd have No, there's like there's something about I would go I would have to bet someone and be like, \"Hey, I'll bet you $1,000 right now that this dude's president in 19, you know, 2050.\" I don't think that's what you use you're using it for. In the history of the game of a great show, I don't think we've ever had a topic where we talk about the topic more than we talk about the parameters of the topic. It's true. which is it's fas it's fascinating",
            "start": 925.04
        },
        {
            "text": "of the game of a great show, I don't think we've ever had a topic where we talk about the topic more than we talk about the parameters of the topic. It's true. which is it's fascinating because I I'm I'm just saying that like you have to just throw away you have to have a suspension of of disbelief basically in playing this particular game. I mean yeah that's the thing that I would probably like I would want to ask myself a ton of questions about us like am I still together with my wife like are you you know uh did I ever make a film would probably be the only thing like a really big burning question after am I still together with my wife um just because I would want to know if that that's been a lifelong goal of mine and always will be. So if I don't achieve that, I'll be like, \"Oh god, I got to I got to.\" But then it's like super depressing if he's like, \"No.\" And there's nothing you can do. You never have you never achieved like the thing that you've wanted since you were",
            "start": 960.4
        },
        {
            "text": "\"Oh god, I got to I got to.\" But then it's like super depressing if he's like, \"No.\" And there's nothing you can do. You never have you never achieved like the thing that you've wanted since you were a kid. I'd be like, \"Yeah, you'd rather not know that. I'd rather not know that. I'd rather like live with the hope that I will one day achieve.\" Like check that off the bucket list, you know? It's like knowing that It's like knowing the day the age you're going to die. Remember when Remember when I told you guys that I played Ouija with my friends when I was a kid and it told me I was going to die when I was 23? Mhm. And this was when I was like 10 and that was terrifying. Yeah . That's not good. Um, but I agree. Like there's got to be some sort of parameter, extra parameter, subparameter. Like if I knew we went to Mars, for instance, and they're like, \"Yeah, we went to Mars.\" And I'd be like, \"So who got us there? Was it SpaceX or NASA?\" And they're like, \"Well, SpaceX got us there.\"",
            "start": 997.6
        },
        {
            "text": "Like if I knew we went to Mars, for instance, and they're like, \"Yeah, we went to Mars.\" And I'd be like, \"So who got us there? Was it SpaceX or NASA?\" And they're like, \"Well, SpaceX got us there.\" What's stopping me from investing all? Yeah. Same with me. I mean, like that's I'd want to know. I'be like, \"Who's the who's so s like who's the first car company that really hit it big with electric cars? Like, or was it just a slow evolution?\" If they're like, \"Oh, no, no, there's this great company called Tesla.\" I'd be like, \"Done. I'm putting all my money in Tesla stock right now.\" You know? Yeah. So you like it almost that your future self almost has to be like I'm going to tell you but you can't do this and I'm going to lie to my future self. I don't know if I'm going to lie to myself. Oh my god. I'd be like this. You can't do it. Lie to myself. No way. Like this. No problem. And I'd be like you **** You're totally going to I know you. Don't you think I know you? Yeah. Would",
            "start": 1029.16
        },
        {
            "text": "Oh my god. I'd be like this. You can't do it. Lie to myself. No way. Like this. No problem. And I'd be like you **** You're totally going to I know you. Don't you think I know you? Yeah. Would Yeah . Interesting question. I think Yeah. The question's interesting. The parameters of the question even more interesting. The manipulation of the questions are even more interesting. I'd like I could spend all day on this topic. I'd be really fascinated probably by how I looked. That's probably the thing I'd be most fascinated by. But like, do I still look good? Well, you will be able to see other eye. Yeah, you look right at yourself. You can look. I'll be like, \"Dude, take your clothes off.\" Jesus. Take them off. Did it get bigger ? Please tell me it got bigger. Cuz if you It can't get any smaller. I can continue to lose weight. Technically, I'm supposed to gain about a half an inch on that point. Really? It's all I need. Yeah. They say, well, not anymore, but like they say, obese people",
            "start": 1058.48
        },
        {
            "text": "I can continue to lose weight. Technically, I'm supposed to gain about a half an inch on that point. Really? It's all I need. Yeah. They say, well, not anymore, but like they say, obese people, you gain inches on the old uh man tool because it your fat in that area depletes. Oh, interesting. The old man actually. Yeah, the old man. Uh, should we should we put a pin in it now? Maybe this topic's over. I don't know if we're comfortable moving on from it, but we have to do the Kinda Funny I mean, very candidly for our people out there. Kinda Funny Games. Uh, April Patreon exclusive Q&A is going to happen now and then we'll do topic four, which I believe is my topic. Your topic. Uh, so should we end here? Yeah, you're all letting Kevin run the show. No big deal. Kevin's not running the show. Kevin's doing a lot of things, but I'm not sure. I said we should just do the thing exclusively. Kevin shook his head. Everybody agrees with Kevin now. So yeah. Well, can we do it ? I mean, how do",
            "start": 1094.08
        },
        {
            "text": "Kevin's doing a lot of things, but I'm not sure. I said we should just do the thing exclusively. Kevin shook his head. Everybody agrees with Kevin now. So yeah. Well, can we do it? I mean, how do we how do we do it? How do we do it? It's just all I need is this cable that I said, can you have ready? And then Kevin didn't at all have ready. I think we should take a break and do the Q&A. Yeah, we should do the Q&A properly, I think. Yeah. All right. So, we're going to we're going to cut now and then we will see you for topic four, which will be seamless. You're not actually going to have any time waiting at all. Byebye. There's no time for you. There's no time manipulation for you.",
            "start": 1130.88
        }
    ]
}