{
    "id": 887,
    "video_id": "p-985d7oTU0",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Portillo"
    ],
    "title": "Splatoon's First 15 Minutes - Kinda Funny Plays",
    "description": "Kinda Funny's daily Let's Play series jumps into the single-player Splatoon campaign!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1432926004,
    "duration": 1027,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to another Kinda Funny Let's Play here on youtube.com/kind afunnygames. I'm Greg. That's Tim. This is Patillo. And this is Splatoon. Splatoon. Tim you're starting your Splatoon single player career adventures. We're going to start and give you this is going to be a video of your first 15 minutes. So go ahead and choose if you're a girl or boy squiddling. Let's see. Let's see. Splatoon. Not this week of course. It's the one everybody's waiting for. I'm going with the boy just cuz he has this little blue man bun going on . All right. So he's got the Darren Brazil man bun. Pick a skin tone. You want ghostly white of course just like us. That's starting to look more and more like me. Okay we're we're going through. Got to go with the baby blues. Yeah even though it's not baby blue but you know. Is this cool? Hey look. He wrote it. You can totally change this stuff later if you want. That's awesome. Good job so far Splatoon. So I don't know anything",
            "start": 0.08
        },
        {
            "text": "it's not baby blue but you know. Is this cool? Hey look. He wrote it. You can totally change this stuff later if you want. That's awesome. Good job so far Splatoon. So I don't know anything about Splatoon. All I know is But you're Mr . Nintendo. We're starting your timer of your first 15 minutes as soon as you get through this. Hey you. Yeah you want to be the freshest squid in the block? Of course we do. Oh my god. Did Mike Ducker go back to Nintendo? No. This is all riding stuff . Oh it is. It is. It is. We'll teach you some funky fresh moves on the way to Inkopolis. Inkopolis. Inkopolis. Inkopolis. All right cool. Here we go. And I started your timer. This is your first Tim Getty's first 1 5 minutes. Oh wa wa wa. Okay. Wow. Wow. Wee. Wow. Tim doesn't understand. Wow. Wow. Wee wows. All right. So Splatoon. Okay. Making waves. Everybody says it's got its own Wii U bundle. It had all these global test fires cuz it's a multiplayer game. IGN got really been out of shape that",
            "start": 34.56
        },
        {
            "text": "wows. All right. So Splatoon. Okay. Making waves. Everybody says it's got its own Wii U bundle. It had all these global test fires cuz it's a multiplayer game. IGN got really been out of shape that there's no voice chat. Fran Marbell wrote an article about it and the internet responded. What did they do? Gaff thread about IGN. IGN's upset about Splatoon. And I was like for some reason I knew it was Fran. Of course it was. They're like \"Oh man we got something bad to say about Nintendo. Bring out Fran. No one will forgive the 79.\" A 79 for Mario Kart Double Dash. Fran get the **** out of here. Uh right now you're going through your So I don't know much about Splatoon either. It turns out you have to shoot by aiming the game pad. So okay I'm going to say something good Greg. There's something about Nintendo games that's special is when you play it it feels intuitive. Sure. This instantly felt intuitive. As weird as this is okay cuz it's motion controls and stuff that I'm I",
            "start": 71.64
        },
        {
            "text": "something about Nintendo games that's special is when you play it it feels intuitive. Sure. This instantly felt intuitive. As weird as this is okay cuz it's motion controls and stuff that I'm I on paper I feel like you and I would be like \"No thank you.\" But it's like I'm kind of feeling into it. I'm feeling it. I can swim up walls. Okay. I missed that. You can even ink swim up. **** I'm squidding. I'm not doing Oh. Oh we should have done the go global test fire. Now I understand why people think this game is dope. because it's dope. Holy crap. That's cool. Look at Look at him go. Let's hit him. The squid. I don't think you can shoot those services. So you have to make the jump over there. Oh yeah. I'm not reading. I'm just I'm not either. I just We probably should read. I'll read and you go. There is a problem. Squid. The problem. Shooting. Okay. Jump. Reset. Camera. Move. Look. Jump is this guy is the top button. Well I'm telling people that are you know that don't",
            "start": 112.64
        },
        {
            "text": "read and you go. There is a problem. Squid. The problem. Shooting. Okay. Jump. Reset. Camera. Move. Look. Jump is this guy is the top button. Well I'm telling people that are you know that don't play Nintendo. I mean also you understand it's shouting out on the screen where it is. Literally everything you would say is on the screen right now. All right. But the problem is you jump with the Xbox. We said cameras with Square. Yeah. No it was square. I'm talking to your people. My people the PlayStation people. I see what you're saying. Wouldn't that be awesome if we could just get on board with one global button configuration? I know we can't until somebody wins the console wars. Looking at you Ouya. But one day. That's That's why I messed up though. Instead of also press X I did press X but I clicked PlayStation X. Yeah. All right. So now I know. Yeah I guess that's true. I mean you know right now if you handed me an X if you drew gave me right now obviously I'm",
            "start": 159.28
        },
        {
            "text": "did press X but I clicked PlayStation X. Yeah. All right. So now I know. Yeah I guess that's true. I mean you know right now if you handed me an X if you drew gave me right now obviously I'm looking at this game but if you know 10 minutes before we started this let's play you'given me the the blank diagrams like you used to get in grade school you know to fill things out. It was the Wii U Xbox and PlayStation 4 controller. Xbox PlayStation 4 controller. I'd be great. But then I'd get here and I'd be like \"Really? I can talk to Xbox. Uh really? Oh my god. I I can I know every button on there. The hamburger button. I'm a big fan of you get here though and I would have been like \"Yeah is it is it X or Y? Is it Y or X? Is it A or B?\" Like the fact that it goes backs to forward screws me up. The old backs to forwards. You know what I'm talking about with that Xbox hamburger button. Hand me the hand me the Kevin. Everybody right there. This is the burger button pretty",
            "start": 201.92
        },
        {
            "text": "screws me up. The old backs to forwards . You know what I'm talking about with that Xbox hamburger button. Hand me the hand me the Kevin. Everybody right there. This is the burger button pretty clearly. Everyone knows that. Everyone says that. I've gotten official documentation from developers who tell me how to install games and I hit the hamburger button . Damn right. All right. Burger burger burger bun. What's happening now? So okay. I'm having some camera issues. Oh. Whoa. Whoa. Hold on. Hold on. I'm having some other issues too. Use ZR to cover enemy ink with your color. Okay. Now see now I'm starting to lose it. Hold on. Hold on. Hold on. You got to cover. Yeah. There you cover up the enemy ink bro. I'm low in ZR. There you go. Yeah I know. I was throwing some ink. Oh you knew but you just didn't know. I was throwing. Now the game pad of course if you didn't know ladies and gentlemen is a map and it shows all of Tim's goo on the on the ground. Yeah Tim's goo is all",
            "start": 241.84
        },
        {
            "text": "but you just didn't know. I was throwing. Now the game pad of course if you didn't know ladies and gentlemen is a map and it shows all of Tim's goo on the on the ground. Yeah Tim's goo is all over the ground. Man I've been waiting for this. You've been practicing for years putting your goo all over the ground . Yeah but now that I get to know where it all is at any given time right? Usually we need a black light to find that. Yeah. Get in everyone's eyes. I This is This is another game with a good soundtrack. Yeah. Just chilling. I I'm liking the style of this game. Yeah. Oh yeah. Yeah. Um Okay. So I was complaining about the camera a second ago. Well you're saying originally it was very intuitive and a little bit No no no it is intuitive but the problem is it's the c I was saying that the the fact that the reset button is this is really weird. Oh okay. So that's weird. But then you can control just the horizontals with the stick. You can't control the up and down.",
            "start": 283.44
        },
        {
            "text": "saying that the the fact that the reset button is this is really weird. Oh okay. So that's weird. But then you can control just the horizontals with the stick. You can't control the up and down. This is another one of those games where you're doing it so it makes sense to your head but it's making me nauseous. Oh like watching you jack the camera left and right boost everything. Jacking the camera. Jacking the camera. Didn't mean to do that. Maybe you did. Look at that. You unlocked a secret area. You won Splatoon. Get up there. Dink it baby. Ah **** brilliant. That was really good. I don't know what that song is. Now when you go do you have to refill your ink? Is that what's happening when you go into the ink you've made? I don't know what's happening here. Oh my god. Oh we're going Inkopolis. Has there ever been a better time to be a sea creature in video games? You got Octodad. You got Splatoon. Look at this. You like You think you're gonna get a dope opening? I like it.",
            "start": 318.8
        },
        {
            "text": "going Inkopolis. Has there ever been a better time to be a sea creature in video games? You got Octodad. You got Splatoon. Look at this. You like You think you're gonna get a dope opening? I like it. I think you're gonna get a dope opening. I think Splatoon. Yeah you're right. Those squids are good. Squids are a thing. Octopus Squids. I don't know what's happening here but we're in We're in We're in this Inkopolis. Yeah kind of. It's kind of looks like Makahari. I bet that's what it's based on with the big crosswalk and the crazy ass stuff. Greg that was a lot more fun than I expected it to be. Seriously. Okay good. I want I want Splatoon to succeed. I want people to play. They're not going to. I want them to. They should. Okay. But they're not going to. Now what's interesting about Splatoon? Hold on to your tentacles ladies and gentlemen. You be Cali and I'll be Marie. Okay. It's Inkopolis News time. Let's unveil the current regular battle stages. All right. This reminds me of",
            "start": 362.16
        },
        {
            "text": "Splatoon? Hold on to your tentacles ladies and gentlemen. You be Cali and I'll be Marie. Okay. It's Inkopolis News time. Let's unveil the current regular battle stages. All right. This reminds me of Luigi's Mansion and I like that. Mario Black the salt spray here really gets in my eyes. You know salted squid is a delicacy in some places . I should have said that sad. She looks sad. Yeah she looked all sad. I'm just doing it like my I always accidentally splat innocent bystanders here. Sure. Accidentally. I can't handle this. Why am I such a baby? It's funny. It's a It's a good cute game. And now the current ranked battle stages. Splattastic. Splattastic. I know what I'm saying. Splattastic. Next time I'm in the right situation I'm definitely going to say Splattastic. Jud is great at his job but man he sleeps a lot. I hear he's way more active at night. All right just start skipping through this stuff. Get to some gameplay. This is gold. New slash. What is it? What? What? What's",
            "start": 404.88
        },
        {
            "text": "job but man he sleeps a lot. I hear he's way more active at night. All right just start skipping through this stuff. Get to some gameplay. This is gold. New slash. What is it? What? What? What's happening? Don't need these knockoff Mario. The great Zapfish is vanished. Vanished. The great Zapfish is sleep much last night guys. UFO sighting. I don't think so. Sounds likely to me. Stay fresh. Stay fresh. Can that be our new signup? That can be our new signup. Okay. This is now you'll there's now a marker ladies and gentlemen on the Let's Plays with Tim and Greg that were filmed pre-Splatoon and after I guess post Splatoon the crazy tall building in front of you Inkopolis Tower. It's the city's most famous landmark. Okay. Okay. Okay. Yeah. Go do something. Go shoot some stuff. Booya Base. All your inkling needs. All right. All right. This is definitely a 2015 Nintendo game. Why? Cuz it's telling you everything. Yeah. As opposed when they used to be like \"Hey you're Link. Go do stuff.",
            "start": 454.24
        },
        {
            "text": "your inkling needs. All right. All right. This is definitely a 2 015 Nintendo game. Why? Cuz it's telling you everything. Yeah. As opposed when they used to be like \"Hey you're Link. Go do stuff. He'll do **** How did you know that? That to knock out that one pixel your friend told you on the playground. Look at this dude. Who's the creepy old dude? Yeah he does seem like the type who get you mixed up as something dangerous. So from now on we're calling whatever. Just head to the lobby. So all right. So the creepy old dude in this game you know what his name is? What ? Nick Squidpino. Oh damn. He's named after our creepy old dude. Look at him. He would get he would our Nick Scarpino would get us into dangerous situations just like creepy old dude Nick Squidpino pino no L on the second part we'll make a shirt soon I like that here I am there's old Nick Squidpino Nick Squidpino what are you up to Captain Cuttlefish you hear that the Octarians are coming I enjoy how much he",
            "start": 505.84
        },
        {
            "text": "second part we'll make a shirt soon I like that here I am there's old Nick Squidpino Nick Squidpino what are you up to Captain Cuttlefish you hear that the Octarians are coming I enjoy how much he could look like a Nick Squid from the future. Yeah this is what Nick would look like in in old man times. His his his crazy ass beard all white like that. Yeah it's like kidnapper for squids. Oh I like that. That's cute. Did you make that up? No they said that. Oh okay. They wrote it. You You're the one who coined the phrase if you would. How much time you got left here? Oh god. You got six minutes . You should probably shoot something with something. I'm trying to shoot things Greg. Not really. You You just ran after You just ran after the creepy old man. That's what they told me to do. Oh I thought they said whatever. I got a new hero suit. Nice. They hand me down from agents one and two. You think they're like descendants of thing one? Here we go. Save three more Zapfish. Octo",
            "start": 548.8
        },
        {
            "text": "Oh I thought they said whatever. I got a new hero suit. Nice. They hand me down from agents one and two. You think they're like descendants of thing one? Here we go. Save three more Zapfish. Octo dead. Nobody Octo. You going to play it when it comes out? I don't know. It's out this week. Everybody Tim's out. Jury's out. I just know how much you love. I love this music. I like it. Okay. So now that it's not just target practice we're actually getting in. Yeah. So see how you are refilling ink. It looks like when you go down. Oh **** Oh I see your ink's depleting. And then every time you dip down you get more. Okay. Wait you going to swim up behind him? Instead of rolling sign up behind him. Oh okay. Look at him go. You **** shot. Oh man it's just an octopus arm. My favorite kind of sushi. Yeah. Taco nigiri. I like how that's a roll. That's different. Little sushi. Get at a sushi restaurant. It's not nigiri or sushimi. That's over. Don't overdo it. I was overdoing it. Oh",
            "start": 602.08
        },
        {
            "text": "of sushi. Yeah. Taco nigiri. I like how that's a roll. That's different. Little sushi. Get at a sushi restaurant. It's not nigiri or sushimi. That's over. Don't overdo it. I was overdoing it. Oh this octed up. What? What did he drop? Get launched. Octo jerks. He's already distracted with the bombs and attack from behind. My favorite thing to do. He's already distracted. Bomb. No I wasn't. I was just reading it for Oh good job. You get distracted. Watch. Do you think Ricky Martin's going to play this game ? Ricky Martin? I mean he's living a crazy life you know. Upside inside out. Mhm. Let's see. Hard to distract him with the B. Wait. Okay I got that part. Well you got to do it again. You know what? So I haven't been paying attention . Okay. Is the Are these little little balls here you're picking up? Are they just I'm rolling. They're the bombs. They're the bombs. Yeah. Really? I think so. You have 0. Throw one. Let me see. No they're not. They're not the bombs. Shoot it.",
            "start": 664.72
        },
        {
            "text": "you're picking up? Are they just I'm rolling. They're the bombs. They're the bombs. Yeah. Really? I think so. You have 0. Throw one. Let me see. No they're not. They're not the bombs. Shoot it. Oops. Okay. Okay. I'm wrapping my head around this game. What are they? They're little I think I think it's just your collectibles. Your collectathon. I'm sure they maybe at the end they're currency. They look to be some kind of they according to the thing next to the 7 they look like they're orange balls that can crush whales. So I believe that's what they are. Yeah. You use these to crush whales when you get out of here. Whales of course the squid's natural predator. Yes . I like that I learn things with you. Greg I'm happy to be here to teach you something once in a while. If it was Colin Morardi we'd only be talking about history all the time. You'd know nothing about squids and whales. Squid. the squid and whale war of 1 81. That'd be awesome if animals could have wars. Like hey",
            "start": 740.8
        },
        {
            "text": "Morardi we'd only be talking about history all the time. You'd know nothing about squids and whales. Squid. the squid and whale war of 181. That'd be awesome if animals could have wars. Like hey something's something's brewing out there. Awesome. The right word. And you we have like a satellite cam. It's like the astronaut who's going around spending a year in space. He always sends these cool photos to Twitter. And he just looks down. It's just this like **** one side of the ocean's all orca whales and the other side's all squids. And he's like \"Uh somebody should check in on this.\" And then we'have no way to communicate. We wouldn't know how they figure this out. They would have bombs . I don't know why you're like \"That wouldn't be cool. Why would it matter to us?\" We fly over the oceans. Oh god. Hold on. Go go go. Oh I see you're trying. Why don't you drop? There you go. There you go . There you go. There you go. So close. Ah there you go Tim. Tim it won't let me",
            "start": 790.32
        },
        {
            "text": "the oceans. Oh god. Hold on. Go go go. Oh I see you're trying. Why don't you drop? There you go. There you go. There you go. There you go. So close. Ah there you go Tim. Tim it won't let me just keep going. Okay Mr. go. Come on. Thank you. Nailed it. I keep trying to get cute. You're cute all the time. You have to worry about it. Oh man. No problem. I'll tell you what the effects for the ink are really cool. Like the effect Well the Mario Sunshine. Please don't ever say that around me again cuz then I have to hate this game. Why? Cuz Mario Sunshine was stupid. But it had good water effects. I was so disappointed I couldn't even tell you. Really? I didn't like Mario Sunshine. I like I know you. I know you actually like it more than 64 right? There's some games. Oh Colin likes it more than 64. I don't have a key. If only I had a key. I think you'll get one here in a second. You're probably going to fight the key master. Fight the key master. Video game. Mhm. Mhm. Mhm. You",
            "start": 826.92
        },
        {
            "text": "it more than 64 right? There's some games. Oh Colin likes it more than 64. I don't have a key. If only I had a key. I think you'll get one here in a second. You're probably going to fight the key master. Fight the key master. Video game. Mhm. Mhm. Mhm. You Yeah. That guy. I have a key to open the vault. So how talk to me now. You You're You're running out of time. Am I? You're 43 seconds left. No. So give me a summation of how it feels. The controls. What do you think of it? I'm liking this a lot. I want the key. Hold on. Go. Damn it. You got to You got to ink it up a bit. Ink it up. Ink it. See now I feel pressure though. Well thanks. I didn't mean to. I don't really cuz I have time. There's there's a clock running. Did I make it in time? Yeah. This is going to go duck when it's off. So Oh really? Yeah. You're still going. Final checkpoint. Oh there's no way I'm getting up there in time. No you suck. But you know what? But you like this game? I do. You enjoyed it? Yeah. What about way more than I thought I would? Does the idea of",
            "start": 885.68
        },
        {
            "text": "Oh there's no way I'm getting up there in time. No you suck. But you know what? But you like this game? I do. You enjoyed it? Yeah. What about way more than I thought I would? Does the idea of multiplayer appeal to you? Cuz that's Yeah I can see it being fun. Yeah there it is. There's the duck. You hear the duck? It's time to get out of the hair. Okay. This is cool. All right. Good. Um so you're going to You think Are you going to play it this time? I'm going to play a little bit more. Okay. Yeah. I want I want to see I I want to play a little bit of the multiplayer . I want to play with you guys. I think that'd be fun. Okay. We'll see how we we feel about it. I wonder how the multiplayer would be though with you inking each other. That's how it's shooting. Yeah. It's not local I don't think. Okay. I mean yeah cuz I don't know. This is our first 15 minutes of the game. All we know is that there's an old squid that looks like Nick Scarpino. And it was way more enjoyable than we",
            "start": 951.44
        },
        {
            "text": "think. Okay. I mean yeah cuz I don't know. This is our first 15 minutes of the game. All we know is that there's an old squid that looks like Nick Scarpino. And it was way more enjoyable than we thought. Yeah that's that's the review. Splatoon review. Way more enjoyable than I thought it'd be. Well ladies and gentlemen what do you think of Splatoon? Whether you played it the final version whether you've played the beta tests let us know in the comments below. Then make sure you keep coming back to youtube.com/kindafunnygames each and every day for a new Let's Play. Until next time stay fresh. Yo stay fresh. You got to you got to do it again. Until next time stay fresh.",
            "start": 991.36
        }
    ]
}