{
    "id": 829,
    "video_id": "SBv8ZdJZUWo",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Are eSports Sports? - Kinda Funny Gamescast Ep. 18 (Pt. 3)",
    "description": "ESPN talked some shit about video games, should they get shot?\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1430917203,
    "duration": 1086,
    "transcript_chunks": [
        {
            "text": "All right, thank you very much. Topic number three, I cannot wait to see what happens with this one with Colin. Are eSports sports? This has been a big topic of discussion recently in video games because on ESPN they showed some eSports stuff. What'd they show? Uh, Heroes of the Storm. Yeah , Heroes of the Storm. Yeah, there you go. And it was, it UC Berkeley versus someone else. It was called Heroes of the Dorm, I believe. Yeah, I love that. Yeah, like what they did there. I love that a lot. But yeah, so really what I want to know is, are sports sports and why does this upset so many people? I saw there was some ESPN dude and he's like talking mad shit. You know what happens to people that talk shit? They get shot. He didn't get shot yet, but he was like just being like, if he gets shot, you're going to get the police are going to be R like, no, it's a body count song. Body, you got your internet fans to do it, didn't you? But yeah, so uh, some dude that's high up at ESPN, if I, Colin Cowherd. Yes, he, Colin Cowherd.",
            "start": 0.31
        },
        {
            "text": "The police are going to be R like, no, it's a body count song. Body, you got your internet fans to do it, didn't you? But yeah, so uh, some dude that's high up at ESPN, if I, Colin Cowherd . Yes, he, Colin Cowherd. Yeah, C H E R D. He's been doing this stuff for a long time. A shitty name. He likes to, um, so he comes out and he's just like, you know, if ESPN turns into, like, if we're going to cover video games, I'm, fuck out, fuck this shit. I don't want to work with this. It's just like, wow, those, I was okay with it when it was Donkey Kong, but no, even then he tolerated, tolerated. We all did. I know we all back in 198, we all tolerated kid doing the Mario. Get out of here. Yeah, and so then we see the internet get kind of split and I feel like the majority of people are kind of saying, fuck him, whether or not they care about video games or care about eSports or any of that, they're just more just like, you don't know what the hell you're talking about. You're not connected with our generation. Be positive and don't talk",
            "start": 50.24
        },
        {
            "text": "video games or care about eSports or any of that, they're just more just like, you don't know what the hell you're talking about. You're not connected with our generation. Be positive and don't talk shit, right? Because that's what people like doing. Uh, it's, you know, the Facebook trending thing of the day of like, oh, someone saying something that sounds mean, fuck you. Um , but then there was the other side, I'm assuming Colin's side, they're just like, well, they're not sports. He's right, you know, and whether or not he's right, but just that's the thing is that there's a big huge gap there, right? This is something we talked about extensively on Colin and Greg Live and the fact that whether you want to say sport, it's a sport or not, right? It's this choice of how you're framing it, right? For this guy to come out on ESPN and be, you know, be an ESPN reporter talking shit now about ESPN and video games in general and going after all these fans that he doesn't understand this thing he doesn't get, that's where",
            "start": 98.2
        },
        {
            "text": "on ESPN and be, you know, be an ESPN reporter talking shit now about ESPN and video games in general and going after all these fans that he doesn't understand this thing he doesn't get, that's where like, there's a giant gap to jump from between is there's two questions is, you know, how big of a dick is this guy and then are eSports sports? And that's the whole thing is like, Colin doesn't think eSports are sports and that's fine. He's presented his case on why he thinks that, right? I think calling them eSports and not like just competitive gaming was like one of the, it could have solved so many shit discussions. Like it's, I , I'm totally with you. It's like the idea of them being sports even or that there is this area where these are like, they're, they're individual games. It's not even like we, every game is involved in this. They are like individual games that are like a handful, like a half dozen games that are designed in a way that makes them competitive and designed in a way where they can",
            "start": 135.64
        },
        {
            "text": "game is involved in this. They are like individual games that are like a handful, like a half dozen games that are designed in a way that makes them competitive and designed in a way where they can be leveraged into like tournament like structures. So it's, it's, it's not like a sport which will be around for decades. Most of these games are going to Peter off and have new versions of the more like they go Counter-Strike back in the day. Like I know there's like a resurgence in Go and whatnot, but like everyone knew that Quake wasn't going to be around in the next 10 years or so. Uh, and like that fundamentally changes the person who want to like the culture of what that thing is because it isn't something where people are like, oh, I like watching all of these. Like there are people who like watching LoL and they're different people to the people who like watching CS. Like NBA versus WNBA. It's like, it's just, it's the idea of like forcing it as like a as so it's not like that. Yeah, it's just, I mean, all",
            "start": 175.84
        },
        {
            "text": "and they're different people to the people who like watching CS. Like NBA versus WNBA. It's like, it's just, it's the idea of like forcing it as like a as so it's not like that. Yeah, it's just, I mean, all right, so humor like a square thing or something, you know what I mean? Like it's, it's calling them sports attached all this like social cachet and they don't apply in the same way. So all it means is that we just have these endless discussions about, you know, the legitimacy of a thing that is, it's a thing that people find entertaining, that's what it is. What's weird to me is like that people get so caught up on the words of sports. Like why, why is, I mean, the fact that there's an E in front of it is just like, I feel that's the the worst thing. Colin, if they were just sports and people like their sports, people would be upset about that obviously, but like why are they not sports? What is a sport? And that's where we get into a huge problem. Chess sport? Exactly. I mean, that's the thing is that, you know, I",
            "start": 213.8
        },
        {
            "text": "people would be upset about that obviously, but like why are they not sports? What is a sport? And that's where we get into a huge problem. Chess sport? Exactly. I mean, that's the thing is that, you know, I play chess. I love, love chess. Like my, and I've said before many times, chess is my favorite game. Like I love chess more than any video game. Chess is according to the Olympic Committee, a sport, but that's stupid. Chess isn't a sport, you know what I mean? And like, I'll be, here's the thing that we have to remember, you know, when we're trying to define things is that the way Colin Cowherd went about it is, and we talked about this again on Colin and Greg Live, is that we, he was completely rude and disrespectful with what he was saying, how he was delivering what he was saying. It was totally improper. There's an incredible, and I learned it over the years, an incredible amount of crossover between the audience that likes what traditional sporting events and video games and I am one of those people. So I don't like",
            "start": 257.52
        },
        {
            "text": "and I learned it over the years, an incredible amount of crossover between the audience that likes what traditional sporting events and video games and I am one of those people. So I don't like hearing someone disparage someone for playing a game or calling block the your parents basement, all go fuck yourself, you know what I mean? You don't have to disparage these people because they're doing something that you don't understand, which is really what what the problem is. Now in terms of definitions, to me something a sport is is basically something that's athletic, right? And so people were asking me like, is golf a sport? And I'm like, I don't really know. Is bowling a sport? I don't really know if it's a sport or not. Hunting, driving, racing a car, no. Here's the other, but this is why there's different degrees in different gray areas because it doesn't disparage what it is. You have to have incredible talent to play golf. You have to have incredible talent to play B to bowl at a high level and you",
            "start": 298.68
        },
        {
            "text": "degrees in different gray areas because it doesn't disparage what it is. You have to have incredible talent to play golf. You have to have incredible talent to play B to bowl at a high level and you have to have incredible talent to play League of Legends at a high level, you know what I mean? So just because there's an argument about whether it's a sport or not, Colin Cowherd crossed the line because what he was basically saying was like, this shit is illegitimate. And my whole argument is, no, it's just as legitimate to shoot a puck in a net as it is to, you know, lead your team to victory in a MOBA. It's that's not one is not better than the other. It's just to say like, how do we categorize them? And I think that we have to look at a sport as something that is physically grueling. Soccer is a sport, hockey is a sport. There are, and there are proper definitions of sports obviously . Well, so yeah, the proper definition according to Mariam Webster is a contest or game in which people do certain physical",
            "start": 334.76
        },
        {
            "text": "is a sport. There are, and there are proper definitions of sports obviously. Well, so yeah, the proper definition according to Mariam Webster is a contest or game in which people do certain physical activities according to a specific set of rules and compete against each other. So the thing there is the physical activity. Sure, but then they go on to use examples such as hunting, fishing, you know, yeah, no, know, I mean, hunting and fishing, yes, there there is physical stuff. L els of there's still physical stuff in using a controller, a physical thing with literally everything unless you're like sitting in a in a box just not breathing. But I feel like the physical thing is the one weird question there. But like besides that, if you just read it, a contest or game in which people do activities according to a specific set of rules and compete against each other. I guess the way to like form it is if you take out the competitive nature of it, like a sport is something that there is a professional part of and",
            "start": 370.68
        },
        {
            "text": "specific set of rules and compete against each other. I guess the way to like form it is if you take out the competitive nature of it, like a sport is something that there is a professional part of and there's also an amateur part of. I can go out and play soccer outside with my friends. Do I consider sitting down and playing Uncharted playing a sport? No, but that's the thing though is it's like, is there traditional sports that you can do at non-competitively similar to Uncharted? You get what I'm saying? Like so Sho like shooting Hoops in your in your in your in your driveway, batting practice, bowling, bow yeah, bowling you bowl . Yeah, I that I mean it's an interesting point in the sense that yeah, bowling that's a good example. There's an interesting there's an interesting point in the sense that I mean it's just it's just one of those things about how we define words and like what things mean and again, it's not a disparaging comment because again, being good at League of Legends takes as much",
            "start": 413.2
        },
        {
            "text": "I mean it's just it's just one of those things about how we define words and like what things mean and again, it's not a disparaging comment because again, being good at League of Legends takes as much talent, just a different amount of talent than being good at golfing or being good at basketball or something like that's just a different rule set and in terms of the physical nature, there is stamina and Agility necessary to play a shooter properly or to do all you know, to use a mouse and a keyboard. I mean, there's no doubt about it. I just think that like we have an idea what sports are and a SP like when we talk about the big four in United States, baseball, hockey, basketball and football, like there those are physical things, you know, like that's that's and and this is where I kind of differentiate between maybe what uh I play as chess even though people consider it a sport and what uh I did as a hockey player when I when I played hockey. When I played hockey, I was an athlete, you know, I",
            "start": 452.56
        },
        {
            "text": "between maybe what uh I play as chess even though people consider it a sport and what uh I did as a hockey player when I when I played hockey. When I played hockey, I was an athlete, you know, I worked out and I I was sweating and you know, all those kinds of things. When I play chess, I'm using my mind, you know what I mean? And I'm I'm playing a game and I feel like playing a video game is more of a mind game than anything else. It's it's it's something that you have to use you know, your intelligence in. Now that's not to say you're not using your intelligence when you play football. Football, I think is one of the smartest games in the world and I'm talking about American football, notum sorry about it. I've been I've been here for a year and a half. I'm I'm good with it's football, got it. But uh you know, so it's just it's just a level of degrees. I think that like this is all erupting um because of the way he positioned himself and I think that that's the unnecessary thing and you know, a friend",
            "start": 492.44
        },
        {
            "text": "know, so it's just it's just a level of degrees. I think that like this is all erupting um because of the way he positioned himself and I think that that's the unnecessary thing and you know, a friend friend of the show, Total Biscuit, uh put up a video just a day or two ago where he really I think explained it in very base terms which is to say like no one in eSports see and he knows better much better than I do as being a PC Centric guy and that's where kind of eSports is happening. He was saying like no one in orts is really claiming this is a real sport and who cares? And that was and that was the big and that was the bigger thing. Of course, I'm reducing his video of 10 or 15 minutes to something you know, more bite-sized, but his whole argument was like, who cares? Like ESPN is enter M and sports. I mean that's in the name and they put on things like poker and the spelling be. Yeah, so like why is it a big deal if they're putting on video games? You just want to disparage it because you don't",
            "start": 529.76
        },
        {
            "text": "I mean that's in the name and they put on things like poker and the spelling be . Yeah, so like why is it a big deal if they're putting on video games? You just want to disparage it because you don't understand it and I get that. I think that something like League of Legends is incomprehensible, but that's me and I can only and I play video games and I'm in the gaming industry. So I can only imagine what someone else watching it feels like that hases no idea, but that doesn't mean it's wrong or it's bad. Yeah, and ESPN has a long history in the 90s. I was watching the spelling be on ESPN. So it's like, you know, and it's fun. I like watching the spelling B. There's just nothing wrong with it. And so I think Total Biscuit had a really good point where he was like, it doesn't matter. Like ESPN's going where the money is . This is not an altruistic Pursuit. Yeah, you know what I mean? They want to make money and people are playing video games competitively. Do we have to figure out people are watching us exactly",
            "start": 570.24
        },
        {
            "text": "money is. This is not an altruistic Pursuit. Yeah, you know what I mean? They want to make money and people are playing video games competitively. Do we have to figure out people are watching us exactly and they're getting new advertising revenues. They're getting new um you know, metrics in terms of the people that are watching it, maybe non-traditional fans that don't watch ESPN. I watch ESPN every day, but there are people I'm sure watching The Heroes of the Storm on there that never turned on ESPN in their lives and that's a new demographic. Um so this this all makes sense. It's just a matter of like what what are sports? I don't know. I agree with Danny what Danny was saying. It should have never been called a sport to begin with because it and and it is not a sport in the traditional sense. Do we want to expand with the definition of it? Sure and do we want to include all those things fine, but that's not in my mind in my opinion very respectfully, I do not think that it's a sport. See, I don't know.",
            "start": 601.96
        },
        {
            "text": "to expand with the definition of it? Sure and do we want to include all those things fine, but that's not in my mind in my opinion very respectfully, I do not think that it's a sport . See, I don't know. I just I disagree with that just because I think that like you're defining it by like the big four, but it's like sports also include a lot of the other ones too. Like sports does include all these other things and that's where it gets fish y though cuz cuz Colin's saying that like and I'm with right the fact that I don't I don't look at eSports as sports, but I'm not a I'm but I don't look at bowling as a sport, spelling be as a sport, but they're you know, I me they're being lumped in here too. So that's the thing. I think the definition is already broken and weird, you know what I mean? I don't think there is an easy way to box any of this up. The fact of the matter is when you talk about it, is there a better Network for any kind of competitive gaming to be on the ESPN? No. Yeah, I mean that's when I",
            "start": 636.84
        },
        {
            "text": "there is an easy way to box any of this up. The fact of the matter is when you talk about it, is there a better Network for any kind of competitive gaming to be on the ESPN? No. Yeah, I mean that's when I heard it, I was like, oh man, what a perfect fit. Yeah, the ways in which uh competitive games and traditional sports are the most alike is in how they're broadcasted, which is the weirdest thing about this is that like no wonder he was mathing alphabet had the they had commentators and they were like mimicking what it's like when we commentate on real sports and stuff like that. I was like, well yeah, I guess in a way those games have sort of lended themselves like the path that has been trotten down already laid by sports broadcasting is where these games went when they decided to like try and broadcast them to a wider audience. So so like in that way it perfectly fits the ESPN mode like it could not be a better place for them to expand whether or not it's a sport. Yeah, like TB said, yeah, but it's",
            "start": 673.04
        },
        {
            "text": "them to a wider audience. So so like in that way it perfectly fits the ESPN mode like it could not be a better place for them to expand whether or not it's a sport. Yeah, like TB said, yeah, but it's just it's the same argument we always have in the internet, right? Whether it be this or cons Wars or whatever, the whole people are riled up, right? Because now somebody's putting down something they love and somebody doesn't understand it. Not even I mean we're getting hung up on the ESPN guy, but I mean like there were so many tweets that night, right? They got you know, I saw and wrap up articles the next day was like, what the fuck this ner shit doing on ESP, you know what I mean? Like and then it just immediately like there's a dividing line of like, well I'm not I'm not I don't even understand what a fuck MOBA is, but I'll tell you what it should I you are wrong sir and video games are up and coming and they're bigger than movies and you know there like things your high starts to raise on that to",
            "start": 717.44
        },
        {
            "text": "fuck MOBA is, but I'll tell you what it should I you are wrong sir and video games are up and coming and they're bigger than movies and you know there like things your high starts to raise on that to regardless let alone it's just like H yeah, it's just a way of positioning the way you speak about things like and that and I think that that was the bigger thing than the point he was making and if he wants to quit SPN because no one's going to make Colin Cowherd doesn't know anything about video games. So like why would they that was the confusing thing. He wasn't saying he's quitting SPN because they're they're covering. He's like if I was ever asked to cover it, I would quit and it's like why would they ever do that? You know, like you don't know anything about it. Like they're going to find the people the people that were commentating that are the people that would do it, you know what I mean? So like you don't have to be it seemed to me that he was he felt isolated in some strange way about",
            "start": 756.0
        },
        {
            "text": "people the people that were commentating that are the people that would do it, you know what I mean ? So like you don't have to be it seemed to me that he was he felt isolated in some strange way about this is kind of a movement on ESPN to maybe get more video games and it's not he's an older man now and he's not into it. I mean, but he's entitled to his opinion. I just think you should position it a little more politely and a little less rudely because again, I'll say it like as someone who watches hockey compulsively as someone who has not missed a Jets game in years, you know, like and watches literally five or six football games a week when it went during football season, I'm quite offended for my fellow gaming Brethren when I hear someone in sports that's well respected talk about us like that because I'm one of them, you know what I mean? And that's the kind of shit that really bothers me because again, there's plenty of crossover between sports and games and I see it every day on Twitter",
            "start": 785.48
        },
        {
            "text": "because I'm one of them, you know what I mean? And that's the kind of shit that really bothers me because again, there's plenty of crossover between sports and games and I see it every day on Twitter when I tweet about hockey or I tweet about football or whatever it is. So see it on the commercials during games. Yeah, exactly. Yeah, Call of Duty commercial and Assassin's Creed commercial, PS4 commercials were on during football all the time. UFC has got Assassin's Creed stuff on it all over. So that really bumped me out because I was like, I'm like man, what a disrespectful thing to do. But you know what, like like many things, there's two different topics here and one of them is is eSports a sport and that's like a different topic because that wasn't even what this was. I don't think this was more him being like, this shit sucks and this shit doesn't belong and to that I say that's shit. The people are speaking clearly loud and clear. They sell out Arenas and shit coliseums all over the world",
            "start": 821.96
        },
        {
            "text": "being like, this shit sucks and this shit doesn't belong and to that I say that's shit. The people are speaking clearly loud and clear. They sell out Arenas and shit coliseums all over the world and they play these games and they deserve a respect and that's the way I'm I'm I'm coming forward with it . I'm like just because I don't think your sport your your competition is a sport doesn't mean I disrespect you. I just look at sports as something that is physically grueling which this isn't any more than when I sit down at the chess board across from someone. I'm not take I'm not breaking a sweat and therefore it is not you know, it's me playing a game and that doesn't mean that chess is worse or better than football and it doesn't mean League of Legends is better or worse than baseball, you know, and that's the way we have to we can't have these black and white arguments. That's that's the problem and I think and and I think the the Total Biscuit's point, who gives a flying shit if this",
            "start": 852.0
        },
        {
            "text": "know, and that's the way we have to we can't have these black and white arguments. That's that's the problem and I think and and I think the the Total Biscuit's point, who gives a flying shit if this is what you like? It's I think Greg made the point when we were talking about it a day or two ago which was, you know, we want games to be called art because we want them to be taken seriously and we get into these huge arguments or games art or games art like who fuck cares? Do you like games or don't you like games? And if games are art to you then games are art to you and if League of Legends is a sport to you then God bless you. League of Legends is a sport to you, you know, that's yeah, like we don't have to have these like systemic arguments over definitions. We can just all have our own if we really want to. I would just prefer that we all had a unified definition that'd be nice. But now real quick too, the thing about it is if you're super offended about how the CN guy handled himself and",
            "start": 885.84
        },
        {
            "text": "really want to. I would just prefer that we all had a unified definition that'd be nice. But now real quick too, the thing about it is if you're super offended about how the CN guy handled himself and everything he did, remember this next time you go to talk shit about sports. This is easy because it's the sport sports which is this big mainstream popular thing picking on video games, but I see it flipped all the time where it's Super Bowl or playoffs and all of my video game friends are like, oh sports ball, can't wait to stay off Twinter. Shut the fuck up. I'm enjoying that. I don't need to hear you talk shit about it, you know what I mean? Like I'm sorry you don't enjoy it. I'm sorry you're going to get shot. You can you're you are talking shit which is going to lead to you being shoted. That's what's that's how this shit happens. Shit. All right guys, I worked in Raider for years and years and years and this is just like number one, this is Howard Stern and you just R up controversy",
            "start": 917.4
        },
        {
            "text": "that's what's that's how this shit happens. Shit. All right guys, I worked in Raider for years and years and years and this is just like number one, this is Howard Stern and you just R up controversy. People say your name next time. Now a lot of people know this. Now a lot of people know this guy's name. They'll forget what the thing was about. Yeah, man, that sucks. His name's Cowherd and and the one the one thing I want to point out real quick and and another reason why you know what would Colin Cowherd think of Colin and Greg Live if you saw it, right? Like Colin and Greg Live came out of my mind because I am obsessed with Pardon the Interruption in Mike and Mike. I took something out of the Sports World and made it a video game thing and it works and we were really one of the first people to do it if not the first people to do it and I was inspired by sports. So why can't there be some cross-pollination and some love between the two things and like like you were saying with the commentation of",
            "start": 953.96
        },
        {
            "text": "if not the first people to do it and I was inspired by sports. So why can't there be some cross-pollination and some love between the two things and like like you were saying with the commentation of of uh you know, League of Legends or with Heroes of the Storm, whatever is being commentated as if it was a soccer match as if it was a hockey game with the same excitement and verbiage and all these kinds of things. There's a lot to be learned from these different things. We learned it firsthand with Colin and Greg Live. This is a sports show about games, you know, or a political show about games and so we took something from another environment, another ecosystem and made it our own and now these guys are doing it with that too. So he can be a relic of the past if he wants to be. He's tilting against shit windmills because it doesn't matter, you know what I mean? And that and so it doesn't matter and that's and that's well you have to kind of walk away from it. Be mad if you want. I mean that's more",
            "start": 989.52
        },
        {
            "text": "windmills because it doesn't matter, you know what I mean? And that and so it doesn't matter and that's and that's well you have to kind of walk away from it. Be mad if you want. I mean that's more more power too. Everyone's mad on the internet, but you know, but if you know or just don't or just just move on and play your games and enjoy it in spite of him. MH revenge is best served uh Tim when you're having a good time and you're not letting other people bother you. The old the old well no best Ser of cold which is not the way I feel at all. You could feel that way or revenge is living well. Yeah, but what I'm saying is that revenge is really something that like if you want to have revenge on this guy or like get it back at him, go about your business. Yeah, and just ignore him. Ignore him. Do you you know what I mean? There you go because someone like that as we said loves the controversy, loves being talked about is not going to suffer. His viewership is not going to suffer. He's speaking to his",
            "start": 1026.8
        },
        {
            "text": "you know what I mean? There you go because someone like that as we said loves the controversy, loves being talked about is not going to suffer. His viewership is not going to suffer. He's speaking to his people. Mhm. You know, there you go.",
            "start": 1068.92
        }
    ]
}