{
    "id": 815,
    "video_id": "Szbt6B7aZ8M",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Thank You, Luis Menchaca!",
    "description": "Your support allows us to live our dreams! Check out Luis' channel: https://www.youtube.com/channel/UCNhOY0xpWYw3_rv7fbTvp6A\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com.\n\nBuy our shirts! http://www.districtlines.com/kindafunny\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1430517227,
    "duration": 340,
    "transcript_chunks": [
        {
            "text": "Rock the cast. This is the thank you video for Luis Menchaca, man. He been a long time coming for him to get his own video. Yeah, for he came here totally sold out to come here rather than just go right to the thank you video. He wanted to get to know us first. Thank you. App reciate it. How's the YouTube channel? Let's go check it on that. Let's go peep it. Well, I feel like Tyler Duran after he held the gun to the guy's head in Fight Club where he like, I'm going to come back and check on you in a month and if you're not well on the way of being a veterinarian, I'm going to **** kill you. Well, Luis Menchaca, this is nothing like that. We're just checking out your YouTube channel. We're just seeing what's going on. We're just going to see what's up, dog. All right, Luis Menchaca 9s cartoons. I like that. What was that image he used? Uh, it's a mish mash of a million different carto. I see SpongeBob. I'm pretty blind. Yeah, yeah, you got the Powerpuff Power puff dig. Uh, SpongeBob, try not to sneeze.",
            "start": 0.24
        },
        {
            "text": "that what was that image he used? Uh, it's a mish mash of a million different carto. I see SpongeBob. I'm pretty blind. Yeah, yeah, you got the Powerpuff Powerpuff dig. Uh, SpongeBob, try not to sneeze. Recess, uh, Sewer Sharks, right? Johnny Bravo, Street Sharks. Street Sharks, sorry. That was I was I was getting laid when that right? Yeah, right. I'm still not convinced you've ever had sex. I would not be surprised. I would not be surprised if Greg's idea of sex was position one cuddling and like no. Greg's idea of sex is sitting with his girlfriend and playing Borderlands like a bunch of **** nerds in opposite rooms. In opposite rooms. She's on her PC, he's 360. If only PS4 was that power. So seems like things are going well. 75 Subs. All right, seems like he's got a slick ass inir now. Yeah, that's actually that's really cool. Domino's, why don't you make something cool like that, Nick? Because I'm not talented. We've established this already, man. Yeah, you I mean you're this Mayweather pack one from three.",
            "start": 38.44
        },
        {
            "text": "that's really cool. Domino's, why don't you make something cool like that, Nick? Because I'm not talented. We've established this already, man. Yeah, you I mean you're this Mayweather pack one from three weeks ago is doing real well. 57. My name is it sounds like you were inspired by something. No, remember he got when after he did it he he well he had asked permission a long time ago. It was like to say this table and stuff and he did and like feedback from kids after he was on our show were like you shouldn't like exactly ape it and say he's gone and done it. Look, he's got all sorts of Graphics now too. F your mics are on. That was a big thing. You got the Modella out there. Damn. Yeah, he's got all sorts of lower thirds here, upper thirds, all sorts of lower thirds. I just you know, we do one damn. We got boom shakalaka four. Yeah, can we get boom shaka Locka for guys? We get boom chak right now and see what happens on iTunes. He's pretty good at getting all his **** out there in the beginning. Doesn't take",
            "start": 93.04
        },
        {
            "text": "shakalaka four. Yeah, can we get boom shaka Locka for guys? We get boom chak right now and see what happens on iTunes. He's pretty good at getting all his **** out there in the beginning. Doesn't take him 5 minutes to get into his show like it does us. We've been doing this for a lot longer. Nick will talk about whatever the **** it is he's talking about. Greg will **** talk about whatever he's talking about. For me, it's generally whatever song I just listen to. I'm like Van Halen, let's talk about that for 55 minutes. And then Colin, you always jump on that because you love Van Halen. We have very similar tast. I love Van Hal en. Can't stop. I still can't believe that Tim doesn't know any Van Halen. So you don't know Panama? You know Panama. Come on. You say Panama. I have no idea what's I'm going to play you Panama. Playing Panama. Yeah, I'll his thumbnails are really good. Well, I mean that one caught my eye last time we saw him. Remember it was just like just it was him now it's like that's a guy that's a",
            "start": 139.4
        },
        {
            "text": "Panama. Playing Panama. Yeah, I'll his thumbnails are really good. Well, I mean that one caught my eye last time we saw him. Remember it was just like just it was him now it's like that's a guy that's a guy kissing a very tall girl. It's do bottom left is that the AT&T girl? Yep. Yeah, that's what what's her name though? She's from something. Milana what's the I can't see she a YouTube person, right? That is stories of person J resting **** face and movies. Oh, resting **** face. Yes, yeah, we all know resting **** face. What's resting **** face? It's what I have when I'm not when I'm sitting there listening to you or not and I'm just like and I'm listening have it you got resing **** facea has it Real's always SM no yeah yeah when she's not smiling she ain't smiling py we're going to spring break this is their one of their best songs. I don't know this you got to go to the hook you want me to go to the course to the hook oh I just want to okay just L we can make it louder it's fine Louis doesn't",
            "start": 177.8
        },
        {
            "text": "is their one of their best songs . I don't know this you got to go to the hook you want me to go to the course to the hook oh I just want to okay just L we can make it louder it's fine Louis doesn't care. Uh, yeah, here we go. It's the pre if you don't know the song I'm kicking out of the house is me spin the thing I've never **** this heard song this is in movies I it's never been like you see Superbad yeah when they're in the cop car spinning it around stuck with me it restarted all right uh just knows one of those songs is that good you need to hear it again uh true story when I used to hang out with Dave Clayman all the time like 2007 2008 uh we would go into any bar we were going into and play Panama on the on the box even if we were leaving absolutely ABS **** lutely you did that Panama that sounds like such a Dave Clayman thing to do guys let's **** play Panama five years later crash **** crawls out or whatever and Panama's playing as he's being dragged out by cops da clayon",
            "start": 223.24
        },
        {
            "text": "that sounds like such a Dave Clayman thing to do guys let's **** play Panama five years later crash **** crawls out or whatever and Panama's playing as he's being dragged out by cops. Dave Clayman was the skiest smallest most fierce **** person I've ever met in my entire life. He was not afraid of figh a fool. He was Fant he was fantastic. Thanks Luis as always for your incredible support. We hope to see you again soon. He's not coming into a Kinda Funny live, but he is going to see us when we go down to Texas. I think it's RTX. Well, it's also Screw Attack though. I can't remember which one. It's one of the two. Both Texas is a small state. You can just drive across. You can walk it probably. It's like a 4our drive. I heard Bernie thr Rock from the r te office and hit the Screw Attack and hit George Bush in his head at Texas Rangers stadium. Damn, always a pleasure, Luis. We'll see you soon. Bye, Luis.",
            "start": 281.96
        }
    ]
}