{
    "id": 812,
    "video_id": "Wg-INgsWfy0",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Gary Whitta",
        "Colin Moriarty"
    ],
    "title": "Thank You, Emma vas Normandy!",
    "description": "Your support allows us to live our dreams!\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com.\n\nBuy our shirts! http://www.districtlines.com/kindafunny\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1430516697,
    "duration": 325,
    "transcript_chunks": [
        {
            "text": "thank you Emma Vos Normandy for your support these past three months. Nick Scarpino is adjusting the camera for you. This is this is how the sausage gets made . Nick, what did you do right before we started recording? Spilled coffee everywhere on on a power strip on a power strip and you kicked a monitor almost into another monitor. Do we're working on we're working on. On purpose. Emma, usually we don't typically work on Friday. We typically do Colin and Greg live and then kind of work remotely and just take care of emails and other business and we are here recording our videos today, right? And every the universe is telling us probably not a good idea to be doing this to record anything other than Colin and Greg. Friday afternoons are no records no Roland. Yeah, which we're getting smited. You know, Roland Emmerich, no, the director Independence Day Independence Day. I love Roland Emmerich doing Independence Day too . Now I remember this. Emma Vos Normandy, I remember we did a video for her.",
            "start": 0.36
        },
        {
            "text": "smited. You know, Roland Emmerich, no, the director Independence Day Independence Day. I love Roland Emmerich doing Independence Day too. Now I remember this. Emma Vos Normandy, I remember we did a video for her some time ago. She didn't stop. She didn't stop her support. Thank you. So we're looking at your Twitter again as usual. Sii's cats at the top. I don't remember them before. I don't know if they were there. 30-year-old who loves food, video games, and paranormal football, the Paranormal football F1 of my cats is my enemy. Tada doesn't get much more British in football. Bo. Now what's interesting is you're also followed by Adam Smith. Adam Smith, a graphics guy. Adam Smith, the The Economist. No, no. Uh, she watched Game of Thrones on April 13th. Cool. You watched that too and a bunch of **** dumb soccer ****. I don't give a f a **** about happy birthday Commander Shephard Mass Effect. Yeah, just received an email about putting money aside for my funeral so I don't burn my family members when the time comes. Well,",
            "start": 39.44
        },
        {
            "text": "give a f a **** about happy birthday Commander Shephard Mass Effect. Yeah, just received an email about putting money aside for my funeral so I don't burn my family members when the time comes. Well, that's a down er. Sounds like a downer, but that's you know, that's realism. It cost a lot of money, you know, the the preparations for it cost money to be real. Call getting bibbed at a set of traffic lights by a group of people who clearly believe they know you, but you don't know them dot dot that well that's top. What's bib? Bib's got to be like a honk a honk honk. Bibbed is honking. I imagine. I like it when they say top bib drink drink something alcoholic P par bib bib bib slang no bibs **** on back no that's Bob right? What is bib stand I would assume that's Bob **** on back yeah did you ever have a bob no what does that mean what does **** on back mean when you ride a motorcycle and you got oh no I didn't do that when I was riding motorcycles I was terrified enough that I was going to kill",
            "start": 84.64
        },
        {
            "text": "a bob no what does that mean what does **** on back mean when you ride a motorcycle and you got oh no I didn't do that when I was riding motorcycles I was terrified enough that I was going to kill myself let alone put another human being in that position yeah um it's cool but I also wrote like 50s like little dirt bike Styles so putting another person on the top of that yeah he's our expert I've been we need to understand our people's Bobs before I spilled this coffee everywhere it's now it's at a place where Gary it's Greg how are you hey how's it doing good we're recording our thank you videos for our Patreon supporters and Emma Vos Normandy is in the UK and she uses a word in context we're not sure and we were hoping you could decipher it are you ready what are you just calling me because I'm British yeah exactly I'm a racist go on she says on April 10th getting bibbed at a set of traffic lights by a group of people who clearly believe they know you but you don't know them #",
            "start": 132.8
        },
        {
            "text": "because I'm British yeah exactly I'm a racist go on she says on April 10th getting bibbed at a set of traffic lights by a group of people who clearly believe they know you but you don't know them # awward what is bibed spell it b i b b e d b yeah um I don't know it you're such a fake you're such a fake British person it yeah and then it was all like sex stuff and **** on back no it said it said something about drinking now have we considered that this is actually just a spell a spelling error on I think it's a honk I think like you like H like bibbed oh no no no no sorry no sorry yes that's what it is you you you beep your horn okay all right yes God I've been away for so long that's one of the ones that kind of slipped through until you jump by memory yes in instead of beeping your horn you bib your horn all right well don't worry I'm bibing my horn from now on perfect nailed it that's what I thought thank you Gary wi thank you Gary thanks Gary worries bye bye bye what a good what a",
            "start": 173.92
        },
        {
            "text": "you bib your horn all right well don't worry I'm bibing my horn from now on perfect nailed it that's what I thought thank you Gary wi thank you Gary thanks Gary worries bye bye bye what a good what a nice young getting bibbed how the **** do you get that out of honking a horn bib now you're just trying because their horns it's a beep in the UK though their horns do sound differently it's not a beep see in in my in America where we decided that everything has to be big with the giant set of balls on it it's a honk right but when you go to the UK where they're a little bit more like refined human beings they don't need that much energy coming at you it's a little beep beep beep beep beep see what I'm saying yeah I understand I just like a honk like get out of my way I have a a **** tire of the size of a human being that is rotating fast and I would lik to make it rotate faster but with in the UK stop him Greg it's a tiny little they all Drive Emma Vos Normandy thank you as always for your",
            "start": 229.56
        },
        {
            "text": "tire of the size of a human being that is rotating fast and I would lik to make it rotate faster but with in the UK stop him Greg it's a tiny little they all Drive Emma Vos Normandy thank you as always for your support. Tim, we love you. We make this content for you. Thank you for being one of the best friends. I hope you're coming to live event. I have no idea if you are. I know it's a long way. Teach us more British words if you do. Yeah, keep stumping Gary Wh itta. That should be a new segment on the show. What's Gary Whitta STP Gary Whitta is that a thing that's toy of some sort you play titly winks in America oh Nick plays my titly wink I'm play Wink's watching hockey I'm going to be in the background playing with the tily wink yeah watch my puck drop",
            "start": 274.12
        }
    ]
}