{
    "id": 824,
    "video_id": "ZEUhg7u91F8",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Let's Play Super Smash Bros. Mewtwo DLC - Kinda Funny Plays",
    "description": "The boys return to Smash bros. once again with the first round of DLC!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1430852401,
    "duration": 954,
    "transcript_chunks": [
        {
            "text": "What's up guys, welcome to Kinda Funny Games. I'm Tim Gettys, this is Greg, this is Colin, that is Nick, and once again we're playing some Smash Bros. Why? Mewtwo DLC. Who's excited? I'm very excited. I've always said he's my favorite Dragon Ball character. He's a really good Dragon Ball character. He awesome in Aura. Not my favorite character in Smash though, I got to say, back when he was in Melee. So we're all playing Mewtwo. We are all playing. Have you played as him yet? I have not. I mean, I played as, I used to play in Melee. I'm going pink Mewtwo. I'm doing the blue. Yeah, maybe no. All right, I'm dark blue. I I don't know what color I am. Let's see. I'll do yellow. Oh, did I go dark? It's just his pubic hair. That's a different color, huh? Oh, it's his tail. It's it's actually it's it's his dick goes back down right now. Are we doing what are we doing here? Yeah, what are we doing? All right, we okay, we're doing a a tournament style. I got this, I got this. We're going to go, we're going to go three stock, sure, and it's first hold",
            "start": 0.12
        },
        {
            "text": "doing what are we doing here? Yeah, what are we doing? All right, we okay, we're doing a a tournament style. I got this, I got this. We're going to go, we're going to go three stock, sure, and it's first hold on items on. We do first of two victories is the winner. Okay, so overall victories. Mhm. All playing Mewtwo. Yes. Oh, okay. Now, does he have any range? Fuck that. Nick's going to go spam on the side. Yes, his B is a, he's like Lucario. If you're familiar with Lucario, another Dragon Ball guy. Yes. Okay, it's good that they're using all the precious room in the roster to make characters out. Don't like other characters. Well, yeah. All right. God forbid they put Ice Climbers in this thing. Yeah, I know. I don't know where they've been. Dry Bones. They'll come. No big deal. One of the best fighters, Solid Snake, you ever heard of him? I whoa, this guy, look at him go. What the hell? Come, Josephine, in my flying machine. I feel like a kangaroo. Yeah, I don't want, I already hate him. Like he's, get your shit together. I'm",
            "start": 45.8
        },
        {
            "text": "of him. I whoa, this guy, look at him go. What the hell? Come, Josephine, in my flying machine. I feel like a kangaroo. Yeah, I don't want, I already hate him. Like he's, get your shit together. I'm sorry, I'm not King of the Mewtwo here. All right, his air um, called no, what's the thing when you when you air dodge, air dodge is uh, he disappears for a second. He's just teleport move. A lot of psychic Pokémon have. Oh, he's a Pokémon. He I was under the assump, I was under the assumption he was a Dragon Ball. Why didn't he come out of the Poké Ball then? I don't see what. Well, he's I thought you were kidding when you said he was was Dragon Ball. Yeah, I know he wasn't Dragon Ball, guys. I thought he was. I thought you were kidding. I was kidding, Nick, everyone. Why weren't you kidding about it, Greg? Get off me, bro. Uh oh. I I wasn't even over there until you knocked me out. Mewtwo had a very troubled path. He's a man-made Pokémon. Oh my God. So he's like experiment. He's an experiment. It's really sad for. Oh, really? Like Oldboy.",
            "start": 94.72
        },
        {
            "text": "even over there until you knocked me out. Mewtwo had a very troubled path. He's a man-made Pokémon. Oh my God. So he's like experiment. He's an experiment. It's really sad for. Oh, really? Like Oldboy. Like they just tortured him for years. He's really floaty. Yeah, I don't like, I really hate this character. Oh my God. He's the exact opposite of the the king. He has some really cool moves too. He disable. Hey, did anybody see the remake of Oldboy? Yeah, with did any of you guys watch the Oldboy? You never seen Oldboy? No, we got to watch that. It's on uh, Netflix. It's awesome. It's on my C. Oh, lost who I was for a second. I'm just a cat creature over here. Don't worry about me. Check out my giant bulb's tail. We already covered it. It's a dick. I really don't quite understand how what the hell is going on in this fight. It's a bunch of Catman fighting each other. Catman sometimes. That was a good one. That was one of the first songs I ever downloaded on Napster. Oh my God. Why? I don't know what just happened. No, went",
            "start": 158.6
        },
        {
            "text": "fight. It's a bunch of Catman fighting each other. Catman sometimes. That was a good one. That was one of the first songs I ever downloaded on Napster. Oh my God. Why? I don't know what just happened. No, went out like a bitch. No, Tim, no. I do like to teleport. Fuck. God damn it, Tim. My paws. I'm a Catman. I'm a Catman from here by a test tube. You know, some man did this to me. Cinnabar Island. My dick's my tail. Oh God. Yeah, just don't like the way he feels. It's not right. I love the way. I just want you to know that Tim has two lives. Fuck. Not anymore. You're welcome. Now you can repay me by ending his next one and then finish it with me in the pit of destruction. Come again? No, was that? I don't know. You had your chance, Nick. You could have been on the winning team destruction. Greg, you 161. Yeah, what were you doing? You know who was too? George Washington. But he came back. George Washington was a very skilled Smash. He went across the Delaware playing Smash. No one else could play on a boat because they got seasick. You",
            "start": 227.4
        },
        {
            "text": "you know who was too? George Washington. But he came back. George Washington was a very skilled Smash. He went across the Delaware playing Smash. No one else could play on a boat because they got seasick. You know who his main was? Olimar. Weird odd pick for him, by the way. See that Olimar? A lot of strategy involved and you know and see. Wait, why why, Nick, why was it an odd pick? Because there's a lot of pick. It's a lot. You got to do the Pikmin. It's not easy. It's not easy. Well, you were expecting me to say something right racist, weren't you, Greg? No, I just didn't know what you. I didn't even say anything. Oh God. All right. Okay, I gave I gave you. Not bad, huh? I like he's no good. No, he sucks. He sucks. Sucks his own tail dick. Oh, you would suck your own tail dick. I would. I would. You suck your own tail dick. You'd be home all day. I would even leave that. Wait a second. All cool. We're going again. We're going again. Yeah, and if I win, he's got to win another one. That's what he's doing for the record. Stunning. Mhm. Mewtwo's not fun",
            "start": 330.16
        },
        {
            "text": "I would even leave that. Wait a second. All cool. We're going again. We're going again. Yeah, and if I win, he's got to win another one. That's what he's doing for the record. Stunning. Mhm. Mewtwo's not fun to play as. So let's all just jump in a pit and give him the victory. I like Mewtwo. I think he's not bad. He's very, he's exactly like Lucario though. Slow. He not, he's actually really different than Lucario. Floaty. He's more floaty. You just said before other fight that he was like Lucario. So okay, it gets complicated because Mew was in Melee. Then he was not in Brawl. They made Lucario in Brawl and he played kind similarly to Mewtwo. He wasn't a clone, but he was very similar and now he's a little more different than used to be if that makes sense. There different moves. I don't know what the fuck you just said, little kid. Oh, fuck. No, but you reached that, touched him. Talk. Okay, well, him. Yeah, I don't think you can talk and play at the same time, bro. Good. Oh, you know, you had me. Nobody has. Tim, what are you doing?",
            "start": 380.84
        },
        {
            "text": "little kid. Oh, fuck. No, but you reached that, touched him. Talk. Okay, well, him. Yeah, I don't think you can talk and play at the same time, bro. Good. Oh, you know, you had me. Nobody has. Tim, what are you doing? This is the oppos. We didn't want to play another one, Tim. Yeah, Tim, I don't know if you noticed this or not, but you're supposed to win win this shit. Tim can't handle the pressure when I don't like this. Oh, fuck. I'm losing myself here. You got to lose yourself in the music. Oh, fuck. You better never let him go. You only get one, Tim. This is not a chance. Oh, hey, Nick, hate you. Hate you so much. You your stupid little shit. You know, do that again and I'm going to fuck knock you out in real life. Tim, get off me, bro. Tim, Tim, I get Nick. Okay, then, is it bother you that I'm just probably going to win because I'm just over here doing this? I hate this so much. Does it bother you that you're no longer playing? This is how high skill, high skilled Mewtwo players play, Tim, in case you couldn't tell. Sit back and",
            "start": 423.84
        },
        {
            "text": "I'm just over here doing this. I hate this so much. Does it bother you that you're no longer playing? This is how high skill, high skilled Mewtwo players play, Tim, in case you couldn't tell. Sit back and learn something. So Mewtwo wasn't never that good in Melee. And uh, I remember this when right before Brawl came out, I imported it from Japan. So I had pretty powerful. And then me and Kieran went to go do a tournament before the game came out in America. And we just fuck wrecked shop 'cause no one had played the game yet. And we just, he played as Meta Knight and played as Ike. And no one knew how to fuck like deal with them. So that was great. But then when we were in lined for that tournament, there was this guy that was pretty good that hadn't played. It was this Asian dude named Simon. No, there this hot girlfriend. And they uh, came over to my house after. I was like, dude, I got the game if you want to come play it. And then he showed us him playing as Mewtwo in Melee. And it was like unreal. Correct. Jesus.",
            "start": 523.48
        },
        {
            "text": "girlfriend. And they uh, came over to my house after. I was like, dude, I got the game if you want to come play it. And then he showed us him playing as Mewtwo in Melee. And it was like unreal. Correct. Jesus. Mewtwo was a beast. That was going to be my. I was hoping that Greg would kill you. I should have just got and let you do it. We wouldn't help either way. Now, do you know why he's named? Yes. Did you see we just backward? Why why do you think it is? Correct. I think when the designer or was like developer or the cartoonist, I'm not really sure where Pokémon starts, was like, hey, we're going to put this new character in. And somebody's like, what's his name? And he went, Mew, Mew. And so they simplified Mewtwo. Why is it more simple? It seems more complicated. It's kind of like that, but it's different. So remember when um, what what's that guy's name? R. Kelly. Oh, yeah, released the the hit single, \"Ignition (Remix)\". Yeah, but he did that. He did it before came out. And that was weird. It's like, why would you release the remix?",
            "start": 563.24
        },
        {
            "text": "um, what what's that guy's name? R. Kelly. Oh, yeah, released the the hit single, \"Ignition (Remix)\". Yeah, but he did that. He did it before came out. And that was weird. It's like, why would you release the remix first? Sure. It's similar to that. Did he ever release what is that attack? Yeah, he did. It's a drastically different song. Interesting. Um, so Mewtwo is Pokémon number 150 and Mew is 151. You didn't come till later. Interesting. So it's kind of weird if you think about it. It's like Mew once get on the do, but he's a Pokémon over there. Well, you're beating me so well. That was more through attrition. Now that we actually have to fight each other. I mean, I really want Colin to win. I'm not going to win now that attitude. I'm definitely not going to win. It's like George Washington. 'Cause if Colin wins this, I can mess up one more time. 'Cause if I mess up again, think Nick will win the next one. Well, you us go down like a badass, arms crossed, floating to death. All right, you know what? You're going to fuck this character. No.",
            "start": 606.24
        },
        {
            "text": "up one more time. 'Cause if I mess up again, think Nick will win the next one. Well, you us go down like a badass, arms crossed, floating to death. All right, you know what? You're going to fuck this character. No. College ruined everything. All right, this guy just sucks. My plan is to win this one. It keeps going and it just keeps going. The hits keep coming, Nick, Nick. So, Tim, if you win this one, you win, right? Yes. Okay. But if you win, Nick, you win. Yeah, I don't really want to win as his character, but I'm going to try. I don't give him my shot. But I want you guys to know my heart's not in this. So if I win, that's even worse for Tim. 'Cause you know he practiced with Mewtwo like all last night. Of course he did. R. Kelly make the R. Kelly reference and trip. Now they not going to know what's happening. Bounce, bounce, bounce, bounce, bounce, bounce. Come, let's just chill out here and sit together. Okay, Tim, come here. I want to grab you. The fuck. Oh, fuck. Oh, you fuck. It's really smart that they're doing this, by the way, 'cause",
            "start": 654.16
        },
        {
            "text": "bounce, bounce, bounce. Come, let's just chill out here and sit together. Okay, Tim, come here. I want to grab you. The fuck. Oh, fuck. Oh, you fuck. It's really smart that they're doing this, by the way, 'cause we're just going to pound each other into the ground and then they're going to come kill one of us. But it's fine. Oh, fuck. Damn it. I keep thinking this down B is a counter. Yeah, let's wreck them for a little bit too. And by that, I mean you go wreck them and I'm still wreck you. Oh, I got dazed and confused. Look at this. Just two cats over here. A big old tail. Oh, fuck. Damn, fell right into his trap, man. I still haven't been hit at all. Oh, fuck. I get to really, oh, I get to really enjoy the music though. Why'd you come punch? I I wasn't trying to hit you, bro. I'm just a cat. Why must I chase the cat? Oh God. I'm just going to hold on to it if I get too close. What the hell just happened? Too close. Oh, I think I just killed you, Nick. Nick, we just where we just want to watch you guys understand that if I don't win",
            "start": 704.2
        },
        {
            "text": "just going to hold on to it if I get too close. What the hell just happened? Too close. Oh, I think I just killed you, Nick. Nick, we just where we just want to watch you guys understand that if I don't win this or Tim doesn't win this, we have to keep playing. We don't have to do anything. That's true. This isn't. Oh God. Fuck everything, Tim. All right. I the best. I am the best of me. He is the champion of Mewtwo. Look at him talk. You, Tim. He was talking you. I hate this. This is the first time I've ever lost one of these things. Oh, now you know why I won by playing by beat. I want you guys to know I won by beating Tim at his own game. 'Cause Tim would always win these by beating me first and then taking you two guys out. Yeah, but together we bested him. Together we broke the streak. The Black Knight is done. This is the biggest upset since the Undertaker losing at WrestleMania. I don't understand. Kevin, cut in the guy from with like cut that guy right there right now. Do that. Ladies and gent. Not yet. Right here. Okay.",
            "start": 843.08
        },
        {
            "text": "is the biggest upset since the Undertaker losing at WrestleMania. I don't understand. Kevin, cut in the guy from with like cut that guy right there right now. Do that. Ladies and gent. Not yet. Right here. Okay. Good. Thank you, ladies and gentlemen. That's another Let's Play here on youtube.com/KindaFunnyGames. We bring them to you each and every day. Tim, yes, we're doing another Smash Bros. We are doing one more Smash Bros. Are we doing it right? Is tomorrow? Is it the next Let's Play? Is there a weekend involved here somewhere? There's no weekends. Okay. But you know what? Yes, we're going to do it tomorrow. More Smash DLC coming your way tomorrow. The Mii characters and stuff, right? Mhm. All right. Until then, it's been our pleasure to serve. Wait, wait, wait, wait, wait. I can't play as King Dedede even in this. You have to play as Mewtwo. Oh God.",
            "start": 908.16
        }
    ]
}