{
    "id": 1336,
    "video_id": "1LkMtt_aoPc",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Reviews and Impressions of New Games - Kinda Funny Gamescast Ep. 44 (Pt. 1)",
    "description": "We give you our thoughts on Halo 5, Triforce Heroes, Yokai Watch and more!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1447077600,
    "duration": 2514,
    "transcript_chunks": [
        {
            "text": "Today's sponsor is Loot Crate. For less than $0 a month, Loot Crate gives the geek in you a special treat every month. Loot Crate's a subscription box service with $40 worth of geek, gamer, and pop culture gear, collectibles, apparel, comics, and more delivered to your mailbox every month. This month they're bringing you a fight for the ages. Suit up, choose your allies, and enter the arena for combat. They're ready to stand their ground this month and exclusive items from Blizzard, Fallout 4, Capcom, sponsor worthy loot from The Hunger Games, as well as a few more items will help your winners emerge victorious in this box. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate, and when the cut off happens, that's it, it's over. So go to LootCrate.com/KFam, enter code KFGAMES to save $3 on your new subscription today. What's up, guys? Welcome to the first ever episode 44 of the Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin",
            "start": 0.04
        },
        {
            "text": "to save $3 on your new subscription today. What's up, guys? Welcome to the first ever episode 44 of the Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. Hi, hello. Uh, oh man, today's going to be a good one. Is it? Yeah, there's a lot of research put into this one, more so than normal, I would say. You go to Wikipedia. By that, I meant there's a lot of copy and pasting of articles that I'm going to have to read at some point, but there was a lot, there was a lot of facts and details that I didn't want to just kind of be like saying words and not really know what I'm talking about. Instead, I'm going to say someone else's words and they definitely knew what they were talking about. Got so I'll sound a lot smarter. Gotcha. Smart. You know what I should do? I should just go back and just read all of Colin's articles just aloud. Then I'm just like, yeah, like is like old ones. Mhm. Why the hell would anybody want to know about what's happened",
            "start": 37.12
        },
        {
            "text": "I should do. I should just go back and just read all of Colin's articles just aloud. Then I'm just like, yeah, like is like old ones. Mhm. Why the hell would anybody want to know about what's happened on the ****? Here's what I've heard about the NGP. No, nobody cares about the NGP. No one knows what it is. No one knows what it could be. New Game Portable. Next Generation Portable. New Game Portable. Wow, you're really in. You heard first. This is the show where every week we talk about video games and why we love video games and what's going on in video games and all that stuff. If you like it, you can go over to Patreon.com/KindaFunnyGames. Throw a through dollar, throw a few dollars our way and that can get you the show early every week and get you exclusive episodes every month. That's pretty damn cool. I said this last week and I'll say it again, the episode I did with Colin one-on-one where I interview him about his gaming history, one of my favorite things we've done so far, so you should definitely",
            "start": 81.32
        },
        {
            "text": "I said this last week and I'll say it again, the episode I did with Colin one-on-one where I interview him about his gaming history, one of my favorite things we've done so far, so you should definitely check that out. If you don't want to give us money, that's cool. YouTube.com/KindaFunnyGames. Every week you'll get this show topic by topic on the YouTubes until the last day you'll get the full video, or you go to iTunes.com/KindaFunny, get in audio forms. You can listen to it and let it just dance with your your your inner inner ear workings and that'll be fun thing to do. And then maybe you'll hear Greg talk about the New Game Portable. Mhm. And it'll be good. Yeah, I prefer to just go back and read Colin's articles because they're correct. Yes. Okay, so what do you guys been playing that I don't know what you call it? It's the Next Generation Portable. That's what I said the second time, but I think New Game Portable is more what it's called, because is then it's a combination of Batman which debuted",
            "start": 122.12
        },
        {
            "text": "what you call it, it's the Next Generation Portable. That's what I said the second time, but I think New Game Portable is more what it's called, because is then it's a combination of Batman which debuted New Game Plus. You probably guys don't remember that when Batman. Batman didn't debut New Game Plus. Yeah, he did. Batman invented. Batman himself invented New Game Plus. Lucius Fox invented it. What's the earliest game you remember New Game? Say my first, the first one I ever encountered, it was Final Fantasy X. I know it was before that, but that was the first time I came across. Chrono Trigger was the first game I, I mean, my mind that I remember having something called New Game Plus. Yeah, but I, I mean, Zelda had, you know, well, Second Quest and stuff like that. But yeah, I remember, I mean, I think in Chrono Trigger it is called New Game Plus, and I wonder if that's where. Could be wrong about that, but I think so. I remember correctly, the first people to call New Game Plus. Yeah, that's an interesting, uh, little piece",
            "start": 160.2
        },
        {
            "text": "it is called New Game Plus, and I wonder if that's where. Could be wrong about that, but I think so. I remember correctly, the first people to call New Game Plus. Yeah, that's an interesting, uh, little piece of what are some ones after that? What's in between Final Fantasy X and Chrono Trigger that have used New Game Plus, um, and called it that? Yeah, in between. So like in between '94 and 2003. Yeah. Um, ****, I don't know. Yeah, I don't. Let us know in the comments the first game that, uh, you had a New Game Plus in. It's an interesting question. Yeah, just an interesting piece of trivia. Mhm. It can't be Chrono Trigger. Chrono Trigger couldn't have made it up, but that's, that's definitely like the earliest one I remember. I mean, it could have. Yeah, the term. I'm not saying the idea of playing the game again, because like you said, The Legend of Zelda, the original one had. Mario, a good example. Yeah, The Legend of Zelda's really is a New Game Plus. M. Actually, it's really not. It's like a different game. It's plus a new game.",
            "start": 195.72
        },
        {
            "text": "like you said, The Legend of Zelda, the original one had. Mario, a good example. Yeah, The Legend of Zelda's really is a New Game Plus. M. Actually, it's really not. It's like a different game. It's plus a new game. Yeah, anyway, I don't know what we're talking about. What you guys have been playing? Lots of stuff. Can't talk about a lot of it. Yeah. Uh, so yeah, end of the topic. What have you been talking about that you can talk about? Halo. Played Halo with Christine and man, I'll tell you what, Tim, I know it's just not going to shock anybody on the internet. I just don't get Halo, really. I've played every Halo co-op and I've never had a great time, really. Yep. I play them. They're fun enough. It's okay. I'm doing something together, but it's just like, and like this one, the story sounded cool and I still think the story is cool. I'm like, Christine says we're six chapters in. She's like, we have to finish it. We're almost half, we're halfway through. And I'm like, that doesn't sound right, but she says it is. She's looked at her",
            "start": 243.24
        },
        {
            "text": "cool. I'm like, Christine says we're six chapters in. She's like, we have to finish it. We're almost half, we're halfway through. And I'm like, that doesn't sound right, but she says it is. She's looked at her chos. I guess it's just, it just goes, it just does its thing. Mhm. I think it's a good thing though. It's fun. Is it? I think it's fun. I, I, is it? Yeah, I'm a couple missions in. The problem I'm having is my Xbox is like flipping out. So right. Yeah, your controller keeps disconnecting. Yeah, every couple minutes my controller will disconnect and it's the worst. But that didn't stop me from forcing myself playing. Uh, we've been trading off a little bit just because it's, it's the most annoying thing in the world. Um, but no, I was just playing the single player thing, trading off the single old school saying. I see what you're saying. So you do this level, I'll do that level, which I mean, I want to be positive about this game, but that's the biggest negative I have to say about it is I can't believe there's not",
            "start": 281.6
        },
        {
            "text": "see what you're saying. So you do this level, I'll do that level, which I mean, I want to be positive about this game, but that's the biggest negative I have to say about it is I can't believe there's not split screen. That's Halo, man. And I get that, you know, modern games and, you know, things change, hard to run it. Yeah, and I get all that, but it's like, that sucks because that's what I like the most about Halo, specifically the campaign. I like co-op split screen, being in the same room with them playing. And it's like, I, I enjoy it so much that I was like, all right, how do I get two Xboxes, two Halo 5s and like, let's get two TVs in the same room. Let's do it. But then it got to the point I was like, that's, I just don't have the time nowadays to like make that all happen. Um, did you get another Xbox? You have two Xbox. I thought isn't there one kicking on your house still or is it just the one? Just the one. Yeah, that's what sucks. I sold that Goa. There you go from. Um, but I mean, it good just the the setup of",
            "start": 315.56
        },
        {
            "text": "two Xbox. I thought isn't there one kicking on your house still or is it just the one? Just the one. Yeah, that's what sucks. I sold that Goa. There you go from. Um, but I mean, it good just the the setup of all of that. It's like back in the day when I had all the time in the world, it was like, yeah, this is awesome. Now it's like, all right, I have real things to do. Sure. Instead of, you know, setting up a ridiculous gaming setup. Get in the TV, Tim. HDMI cord, TV and the Xbox. It's set up pretty much. I mean, think, think of the cost of that, Greg. Think the cost. Fine. The time isn't a thing. Whatever. Colin and I were watching football out there. I brought up that second screen. I was sitting out there playing games. Yeah, but yeah, Halo 5, it just doesn't click for me. And I, and I've, I've always thought it was like, maybe it's just not this Halo, you know what I mean? But I think it's just the fact that since I didn't have an affinity for Halo 1 or 2, they were games that I, my friends were playing, but I wasn't playing",
            "start": 353.64
        },
        {
            "text": "just not this Halo, you know what I mean? But I think it's just the fact that since I didn't have an affinity for Halo 1 or 2, they were games that I, my friends were playing, but I wasn't playing, you know what I mean, alongside them or anything. But I knew how important they were, kind of thing, that I just don't think I have that built-in, here's the foundation of why I, I care about Halo. And since I don't have that, I play this game and I'm just like, all right, just run around shooting ****. Like, what's happening? All right, what's going on? Halo's one of those things where the gameplay is just fun to me. I like it. The gameplay is annoying to me. Hey, here's this gun I really like. Oh, out of ammo. Better pick up one of these **** alien guns and shoot until I get back to the gun I like. Like, why? I just run around with the gun I like all the time. I don't know. I think that's part of the, the fun of, and again, this is coming from someone that has enjoyed the past Halo games, so I like that it plays like a",
            "start": 394.88
        },
        {
            "text": "around with the gun I like all the time. I don't know. I think that's part of the, the fun of, and again, this is coming from someone that has enjoyed the past Halo games, so I like that it plays like a Halo game. See, that's the thing. I have no, I, I've played the past Halo games, but never enjoyed them, really. Right. So I don't have that like, I enjoyed this part of it. Now it's, it's compounded by the fact of it's like, I'm playing with Christine who immediately jumps to Laura Bailey to play as her or whatever. So I'm kicked into being Lock or whatever and has a shitty **** gun too. And I get to play as Chief once in a while. He's got a good gun. But then inevitably now I got to pick up the **** needle dick here and do this stupid thing. But again, I think that's part of the design and like, whether or not you like that, that's, you know, up to you. But like for me, I like the, the weapon management kind of system. I mean, it's not like it's that deep of a thing, but just like understanding how much ammo you",
            "start": 427.84
        },
        {
            "text": "you like that, that's, you know, up to you. But like for me, I like the, the weapon management kind of system. I mean, it's not like it's that deep of a thing, but just like understanding how much ammo you have and knowing like the, the power weapons versus just the alien weapons, which most of the time aren't as good, at least the ones you find in the campaign and stuff. So I, I've always enjoyed that. My biggest thing is in terms of the story so far, I'm not like in love with it. I like that it's not the Cortana. Uh, I think we did maybe three, three missions in. Um, and it's just like, I, I like that there's not the same old Cortana, like same old thing. But it is kind of weird that there's this, the teams you're with, but there's not really a backstory. Like unless you read the books and like know the stuff. And like my friends that I'm sitting in the same room with, like they know, so they're like, oh, this is cool, this is cool. But it's like, I don't know that. So it's like the game kind of assumes that I know more",
            "start": 459.6
        },
        {
            "text": "my friends that I'm sitting in the same room with, like they know, so they're like, oh, this is cool, this is cool. But it's like, I don't know that. So it's like the game kind of assumes that I know more than I do. And I think that's a problem. Otherwise, there're just four people on my team. Right. You know, and the other thing is, at least in the single player, the AI of my teammates wasn't always great. Like I'd tell them to do things and then they wouldn't. Um, but I think that's a case by case basis. But, uh, I'm having fun with the game and I think it's good. And I think that, uh, I mean, if the sales have anything to say about it, like people are super into it. Like we were seeing today that it broke the record, broke the record, man. For's the, no one really knows. No one knows what copies are, but like we know that it broke the record that they won't say. Yeah, it's so annoying. They were like a gross $400 million between the game and the, and they, they insinuate that it also counts console bundles. Just wish",
            "start": 501.64
        },
        {
            "text": "that it broke the record that they won't say. Yeah, it's so annoying. They were like a gross $400 million between the game and the, and they, they insinuate that it also counts console bundles. Just wish like, just say how many copies the **** game sold. Why does everyone do this? Yeah, so annoying. Dress it up. Activision does the same **** with Destiny as Jason Schreier pointed on in Kotaku. Like every time they've never said how many copies the game sold. Yeah. Um, yeah, I know. I watch Greg play Halo 5 quite a bit. And, and, uh, you know, I was a fan of Halo 1 and Halo 2 and, and, but I wasn't a fan of their story. Like I, I don't, the, the, I like the, like the gameplay. Those games, they, they were really unique and special at the time, especially. I think there just wasn't many games. There weren't many competent, you know, console shooters in the early 2000s. I mean, there just weren't. So, um, not like we have today. So, uh, that's why I played those games. The story never really appealed to me. Halo to me always and the reason",
            "start": 535.04
        },
        {
            "text": "console shooters in the early 2000s. I mean, there just weren't. So, um, not like we have today. So, uh, that's why I played those games. The story never really appealed to me. Halo to me always and the reason I'm not engaged in it anymore, just from the an outsider's point of view, is that it's just, it's a very ster, it looks like a very sterile sci-fi universe in a way. Like I don't, it just doesn't vibe with me. I was, I was talking to when I watched Greg play for maybe an hour and, uh, just so I can get a little taste of it. I'm like, this is just, I just don't, I don't, I don't get it from an aesthetic point of view even. Like I, like I don't, I don't get it. I don't get what this, like what the necessarily the, the, I understand why people like it. I understand people like the gameplay. The multiplayer has a lot of feelings, like nostalgic feelings. I'm like, Greg, I played those games at the time and, you know, back in the day and, and so I get that in a sense, but they never want, maybe want to go back and play more. Um,",
            "start": 574.52
        },
        {
            "text": "like nostalgic feelings. I'm like, Greg, I played those games at the time and, you know, back in the day and, and so I get that in a sense, but they never want, maybe want to go back and play more. Um, and, uh, it's the same reason I, it's the same way I feel about Killzone. Um, until Shadow Fall came out, I really didn't like Killzone. I played all those Killzone games on, you know, PS3 or two of them on PS3 and, you know, obviously the PS2 one, um, was supposed to be like the Halo killer and back in the day, clearly it wasn't. But I, I had the same, I had a, I had a similar yet different problem with those games, which was like, this is so gray and black and brown and **** boring, you know, like, and with with Halo and I kind of, you know, grudgingly went through those games so I can like at least talk about them on on Podcast Beyond back in the day. But with Halo, I see a sci-fi universe that I'm just like, this is just not that interesting to me. I like gritty, dirty, dark sci-fi like Battle Star Galactica or or Mass Effect",
            "start": 611.68
        },
        {
            "text": "Podcast Beyond back in the day. But with Halo, I see a sci-fi universe that I'm just like, this is just not that interesting to me. I like gritty, dirty, dark sci-fi like Battle Star Galactica or or Mass Effect even where it's like, I so I just the world don't feel lived in. Everything feels like it's like a set piece and it's just this thing that I'm running through to shoot things. But that's just, but that's just my perspective from an an outside. I did not play the game other than trying to use a vehicle really quick because I was laughing at Greg not being able to do it. And then I realized the controls was really bad. Well, yeah, but, uh, but so take my my opinions with the grain of salt. I mean, I'm sure the game plays fantastically. See, I don't even think it does. Like, and that's, and like, it's just, I totally get to come at it as the guy who's just not Mr. Halo. Right. I play him once every time they come out and I'm done with them. Right. Like I was playing it and the whole time I'm playing, I'm like,",
            "start": 648.6
        },
        {
            "text": "I totally get to come at it as the guy who's just not Mr. Halo. Right. I play him once every time they come out and I'm done with them. Right. Like I was playing it and the whole time I'm playing, I'm like, man, I should just go play Destiny. Like I'd much rather play Destiny. Destiny, I like the guns better. I like, I like that I have my own guns. I like the world's better. I like the story better. I like the controls better. Like Alfredo, when I learned Titanfall and he taught me, like, I was like, I want to be good at Titanfall because I like Titanfall. Teach me your ways, Alfredo Diaz. He sat me down and, you know, built me from the ground up. He's like, here's Bumper Jumper. That's the one to use. And I'm like, great, thank you. The Bumper Jumper in here has no iron sights on the triggers. So if I want to use Bumper Jumper, I still have to click in the stick to go or no, it's click in the stick, I believe, to go iron sight ever. It's like, this is terrible. Or no, it isn't stick. It's off a button or something or whatever.",
            "start": 684.12
        },
        {
            "text": "I still have to click in the stick to go or no, it's click in the stick, I believe, to go iron sight ever. It's like, this is terrible. Or no, it isn't stick. It's off a button or something or whatever. It's weird to get to iron sights in Bumper Jumper. So then I have to go back and not use Bumper Jumper. So then it's just, it doesn't feel right. Like none of the control schemes I like. Yeah, see, I don't know. I guess it's one of those things. I grew up with the Halo that is my dual stick first-person shooter. Like kind of like everything else is based on on how that feels to me. So it's like I play all these other games and my biggest complaint is it doesn't feel like Halo. And in terms of the look and stuff, I love the look. I love the, the way that the, the enemies look compared to your characters. And in terms of the story, like I don't think anyone's claiming that the story is this like, it's not Last of Us, you know, it's not. I don't think people are playing it for the story in the same way that they say",
            "start": 714.28
        },
        {
            "text": "of the story. Like I don't think anyone's claiming that the story is this like, it's not Last of Us, you know, it's not. I don't think people are playing it for the story in the same way that they say that about other games. For me, it's just, I really, it seems like people play it for the story. Like I, I like this. I like the story. I'm into it. I'm into the, the characters and the different like races of the characters and the classes and all that stuff. And like the war going on between like the Elites and the Jackals and all this stuff. Like it's all just the little details that as you play through the games, you kind of just pick up on and like the different looks between them all and all that. But I think it's just more of like, it's a dumb action movie. You, you know, it's like the, it's like Fast and Furious. Like the plot of it, it's not like a revolutionary story. I still love the story, you know what I mean? Like it's more, it's fun. I like it. It's just action movie spectacle. And Halo to me has always",
            "start": 748.28
        },
        {
            "text": "like the plot of it, it's not like a revolutionary story. I still love the story, you know what I mean? Like it's more, it's fun. I like it. It's just action movie spectacle. And Halo to me has always kind of been that. And the, in terms of the levels not feeling lived in and just kind of being like, uh, environments for things to happen. I like that. I, I like that it's, it's very linear. It's designed like there's this course. That course is obviously to ride a Warthog through, you know, this, there's this jump that is, it's the point, you know. Yeah. Um, playing through when you play Super Metroid and there's the escape scene in the beginning. It's like that is designed that way, you know, all the, the things that you face and stuff. That ship, why would it be designed that way? It's designed that way just to make the escape fun. And like in Halo, there's constantly those moments. It's constantly just you need to get from here to here really fast in the Warthog. And then there's like all the things along the way that",
            "start": 779.56
        },
        {
            "text": "escape fun. And like in Halo, there's constantly those moments. It's constantly just you need to get from here to here really fast in the Warthog. And then there's like all the things along the way that are make that fun. And I've already seen that a couple times in the limited time I put into Halo 5. But well, with this game in particular, I'm interested to see when games get really hyped up, it takes people a while to gain distance from them in order to like kind of critique them in in different ways. Not necessarily so it's not to say that the initial critique is wrong, because I think The Last of Us is one of those games that I really, I really loved, um, and thought it was a masterpiece. But, you know, a lot of people didn't and they have valid critiques about the game that I think are more and more valid the more, the more time we are, you know, distant from The Last of Us and the more we see different things. And so I'm interested to see, you know, there are three games come to mind that I think are",
            "start": 819.08
        },
        {
            "text": "valid the more, the more time we are, you know, distant from The Last of Us and the more we see different things. And so I'm interested to see, you know, there are three games come to mind that I think are going to differ in people's minds as we gain more distance from them. And one has already, BioShock Infinite is a great example of this. Uh, people were up that game's ass and then it took a little while and then people started to say like, I don't know about this game. Like there's this, this is a great game, great story, it's fun, but there's this, this and this wrong with it. And it took people a little bit of distance to figure that out. I think Metal Gear Solid 5 is going to be another one of those games. I've not played it, but I see more and more significant criticism of that game every day that from people that, um, I trust and that people that have just got gained distance and thought about it for a little while. I've been like, well, gameplay is excellent and impeccable, but what about this, this and this?",
            "start": 852.16
        },
        {
            "text": "that, um, I trust and that people that have just got gained distance and thought about it for a little while. I've been like, well, gameplay is excellent and impeccable, but what about this, this and this? And so I'm interested to see with Halo, which I think is another one of those games. Like what, what people think about in a year? Um, is it going to be one of those games like the original BioShock that I think actually even gets better with age, uh, and people have more and more positive things to say about it? Or is it going to be more like Uncharted 3 where people liked it, then they didn't, then they did, then they really don't. And like, and like people, so I'm interested to see be one of those. It's definitely not going to be like a BioShock. It's another Halo. I mean, that's the thing. That's the thing. Isn't it going to be Halo 4 or Halo 3 was the last time anybody thought about or talked about any of those games? There, Halo 1, Halo 2 is the only Halo anybody. I'm the thing that I acknowledge with Halo and just with",
            "start": 883.56
        },
        {
            "text": "to be Halo 4 or Halo 3 was the last time anybody thought about or talked about any of those games there Halo Halo is the only Halo anybody I'm the thing that I acknowledge with Halo and just with with some of these Xbox exclusives not Gears or anything that I actually care about but like Halo some people took issue with the fact that I said I don't care about Halo last week and I didn't have anything to say like I don't know what they want me to say you want me to like pretend that I like it so we have a conversation about it um it's just not one of those things that that grabs me so I have to look around the landscape and find the people whether it's Ryan McCaffrey whether it's Mitch Dyer like people that I know know it yeah and see what they think about it's same thing with Assassin's Creed like I'm so jaded by Assassin's Creed that I just can't even trust my own judgment in a way on it I need to go to the people that I trust that I I know know this stuff like they would come to me",
            "start": 922.4
        },
        {
            "text": "like I'm so jaded by Assassin's Creed that I just can't even trust my own judgment in a way on it I need to go to the people that I trust that I I know know this stuff like they would come to me for the things that I know so um really well so I'm just interested to see how it all pans out because I think what I'm seeing in my own little social media bubble anecdotally about Halo 5 is that people are disappointed in it but there's a lot of people that like it people seem to be disappointed in the campaign people seem to be disappointed in the campaign's length which apparently is really short um I was reading something I think Angry Joe or something I think there was a NeoGAF thread about how he hours which if that's true completely inexcusable to make a campaign 4 hours it's the same shit problem we have with The Order: 1886 so we have to call I mean The Order: 1886 didn't have anything else people buy so it's way worse with The Order: 1886 being five or six hours when there's nothing",
            "start": 955.32
        },
        {
            "text": "problem we have with The Order: 1886 so we have to call I mean The Order: 1886 didn't have anything else people buy so it's way worse with The Order: 1886 being five or six hours when there's nothing else to do in the game that number doesn't sound wrong right because Christine and I played it for one night and she says we're halfway through I'm like really that I mean that's just that's just bizarre so I think yeah but that number does it sounds a little that's on the fast side you know I would say me and her just at Halo you know yeah five I mean five to six hours even I think is too short for a campaign I don't need games we've talked about this in the past with The Witcher or whatever where I think games can like there's a definition of a game being too long and too dense and actually someone just K.Z. McDonald our friend put up a piece today on Kotaku I think where she was like I played The Witcher 3 for six months and I've gotten nowhere in it I mean this is my exact complaint about",
            "start": 994.08
        },
        {
            "text": "someone just K.Z. McDonald our friend put up a piece today on Kotaku I think where she was like I played The Witcher 3 for six months and I've gotten nowhere in it I mean this is my exact complaint about the game so there's something to be said about games that are too big and too long I think The Witcher 3 too big um did you read an article uh no I didn't I saw the headline too I flagged for later I was interesting I'm interested to see if she's going to have a positive spin on it or a negative spin yeah we'll see I mean it depends on the density of of the game like what you know this goes back to a conversation I was having with some of our friends on NeoGAF and our Thread about PS I Love You where I was talking about on PS I Love You how um retail games I think will become cheaper once Publishers are comfortable competing with each other on a digital Marketplace uh what happens when Ubisoft is like all our games are $50 and then you think EA is going to stay at $60 whatever the reason I",
            "start": 1026.44
        },
        {
            "text": "are comfortable competing with each other on a digital Marketplace uh what happens when Ubisoft is like all our games are $50 and then you think EA is going to stay at $60 whatever the reason I bring that up is because is it possible that a game like The Witcher might be even worth more because it is so big so it's a conversation for a different time kind of an ancillary kind of conversation is worth $100 you know um but with so with Halo I I just I'm I'm interested I have to trust other people mhm because I'm not going to play it I'm not interested in really playing it but I'm very interested as a student of the industry what it is and how it does um because my prediction about it even though we were talking to Aaron when he was on the show and and just kind of anecdotally my my feeling was like I just don't see the hype about it now the numbers indicate that I was wrong so I want to see how people really feel about it with a little bit of distance and you know that's what I'm super",
            "start": 1060.64
        },
        {
            "text": "was like I just don't see the hype about it now the numbers indicate that I was wrong so I want to see how people really feel about it with a little bit of distance and you know that's what I'm super anxious about it's the same thing with BioShock it took time before I really got down to like hearing some good criticism about it and I think Halo 5 is going to for good or for bad yeah I'm not saying it's going to be you know all bad I'm sure people can look back at Halo 5 in two years and be like that was great um but it also seems like they're going to continue to churn these games out yeah so and the other thing about Halo is like to me a six-hour Halo campaign that sounds perfect I don't need more than that and also the game's designed around replayability and going back on Legendary and the skulls and all that stuff so it's like I think a a very polished 6-hour experience would be better than an 8 or 10-hour experience that have a little things missing the problem is a lot of",
            "start": 1096.2
        },
        {
            "text": "and the skulls and all that stuff so it's like I think a a very polished 6-hour experience would be better than an 8 or 10-hour experience that have a little things missing the problem is a lot of people are saying that this isn't perfect you know but what game really is that's the other thing that that these games this is why 343 is in an impossible situation they're in impossible situation for two reasons one is that they're not the people that that gamers really want to make Halo I mean that's that's the that's the first thing like it's not their series and and I know they've been working on it for a while but I think they're always going to be fighting against it it's like it's like uh the way people felt about Treyarch forever until they didn't with Call of Duty um now everyone loves Treyarch but everyone remembers when Modern Warfare came out every shit hated Treyarch WB Games Montréal with Batman anytime anytime somebody steps into a franchise somebody he's already done stuff with",
            "start": 1134.08
        },
        {
            "text": "Treyarch but everyone remembers when Modern Warfare came out every shit hated Treyarch WB Games Montréal with Batman anytime anytime somebody steps into a franchise somebody he's already done stuff with it's no matter what it's never going to be as good as the I think this one is different because there is a lot of key people like the key people that worked on Halo are sure I'm not saying I'm not saying the reality on the ground is true I'm saying that they're always fighting against this this impression that this isn't there so I think that they're always fighting against that trend and I also think that when you have a central IP Uncharted is going to suffer from the same thing and Zelda's going to suffer from this on Nintendo side too there's such significant expectations placed on these PL on these games that they almost can't be met ever and and what I've been finding with all the games that I've been playing this year up till you know I would say Mad Max even in a sense like",
            "start": 1171.32
        },
        {
            "text": "these PL on these games that they almost can't be met ever and and what I've been finding with all the games that I've been playing this year up till you know I would say Mad Max even in a sense like so up until the September region is that there I'm finding people think I'm jaded and I'm a little too hard on games but I'm just finding that my mind is clear enough to see that a lot of these games are just not hitting the mark in some ways that there's something off about a lot of different games and I think that that's just the nature of them they're never going to please everyone they can be fun but we can still criticize them and I think that um a game like Halo 5 has this crushing weight under it yeah especially when like you know we're we're critiquing the campaign and stuff but I think that for a lot of people specifically the ones that actually played it Halo 4 is like their favorite campaign like you look back like everyone has different favorite I thought everyone Halo 3 the best",
            "start": 1206.44
        },
        {
            "text": "for a lot of people specifically the ones that actually played it Halo 4 is like their favorite campaign like you look back like everyone has different favorite I thought everyone Halo 3 the best but but see that's the thing did they cuz the campaign of that like like Halo 3 is multiplayer but the Halo 3 campaign story made no sense they added the I forgot what the character's name was but like the weird ass Master Chief not Master Chief it was like the shit thing with the tentacles and stuff what the shit where's this even coming from the Prophet storyline just was weird and not well fleshed out enough um they had the Arbiter which at the time nobody shit liked and then it just ended and one of the most upsetting cliffhangers not a great cliffhanger upsetting like it was like oh that's the end of the game what the hell and so I don't know man I think that these these games might even have a better campaign than those Halo 1 had a great campaign but had some really bad levels",
            "start": 1248.16
        },
        {
            "text": "that's the end of the game what the hell and so I don't know man I think that these these games might even have a better campaign than those Halo 1 had a great campaign but had some really bad levels like the Library was like a chore to get through and especially when you're going replaying it on on Legendary whether it's co-op or single player and doing all that like these games I think they're more modern they're more designed around different things sensibilities yeah and so it's like it's it's different but you're right I mean people are they're never going to compare it campaign to campaign it's campaign versus memories of campaign and that will always come out on top Nostalgia play is a factor I I I I I like I said I think last week or the week before at some point like I Halo is f people love Halo I if I was Microsoft though I would be focusing on on trying to elevate something else you know into that into that place Sony's gonna have that problem after Uncharted out like what",
            "start": 1287.16
        },
        {
            "text": "people love Halo I if I was Microsoft though I would be focusing on on trying to elevate something else you know into that into that place Sony's gonna have that problem after Uncharted out like what are they going to do after after Uncharted in terms of like what's the marquee probably Gran Turismo but it's you know something like Gran Turismo but that's not even really what they need maybe it's something like Horizon whatever I'm interested to see what kind of feedback they get on this game what kind of metrics and heat mapping they find when people are playing the game in terms of like what they're doing what they're not doing or whatever because I just and I'm interested also how the console sold I'll be really interested to see the NPDs for um for October and November um to see what shifted hardware and stuff like that the thing that Halo 5 has to deal with which is the same thing that a lot of other shooters have to deal with is this idea of a ubiquitous platform this idea of",
            "start": 1324.52
        },
        {
            "text": "shifted hardware and stuff like that the thing that Halo 5 has to deal with which is the same thing that a lot of other shooters have to deal with is this idea of a ubiquitous platform this idea of ubiquity in games Halo 5 has to be something very special to keep people away from Call of Duty and to keep people away from Battlefront this fall um and this is only a problem on Xbox One this isn't a problem on PlayStation 4 PC um but there's a lot of competition there's always been a lot of competition for all these games but I feel like the AAA tier hundred million dollar plus shooter um is like going to be a very competitive space this fall and I'll be interested to see like how on Xbox One how Halo stacks up against Battlefront um and Call of Duty because people seem to be really excited about this Black Ops 3 because now they love Treyarch apparently I'll never forget I'll never forget 2008, 2009 how everyone hated Treyarch and I was like I think I thought I like Treyarch and and they were",
            "start": 1357.52
        },
        {
            "text": "this Black Ops 3 because now they love Treyarch apparently I'll never forget I'll never forget 2008, 2009 how everyone hated Treyarch and I was like I think I thought I like Treyarch and and they were like oh it's all about Infinity Ward I I just stopped paying attention to that chatter in that community and then suddenly when I was predicting that Black Ops 3 was going to fall off a lot of people think I'm wrong because it's a Treyarch game and it's going to do great I'm like really prove you hated Treyarch they prove themselves call so it shows show goes to show how I really don't pay attention to that community very much even though I play Call of Duty every year so this isn't a game but another thing that in video in the video game world that uh that happened this week was the Metroid: The Sky Calls short film oh the Jess Chobot film yeah so Jess Chobot's in it it's made by Rainfall Films which are the same dudes that made the Zelda video for IGN the started it all exactly yeah um they",
            "start": 1399.08
        },
        {
            "text": "Sky Calls short film oh the Jess Chobot film yeah so Jess Chobot's in it it's made by Rainfall Films which are the same dudes that made the Zelda video for IGN the started it all exactly yeah um they made that and they also last year made the Wonder Woman short nice that that you know got like five million views six million views I'm not sure um so this this video came out kind of out of nowhere and what's really cool about it to me is that at IGN like we had talked to the guy that made the Samus many times about one of the April Fools' videos being a Metroid uh short film and we've always kind of had an idea of like how would you do that that requires big budget and this and that um because it's it's different than Zelda you know Zelda's like all right let's go out to a shit green grass field be good Metroid what are you gonna do like even the suit alone is a pretty big investment um and to see him actually make this short I'm like it's it's awesome it's awesome to see the growth of",
            "start": 1433.08
        },
        {
            "text": "be good Metroid what are you gonna do like even the suit alone is a pretty big investment um and to see him actually make this short I'm like it's it's awesome it's awesome to see the growth of technology and just how things have happened that he reached a point where he can make this happen and he did it and it's really cool you guys should definitely check it out it's called Metroid: The Sky Calls if you haven't already seen it did you guys watch it at all yeah so it's it's really cool and I like it because you know fan films are a dime a dozen these days and like especially with YouTube and like muzzle flare tutorials and all this shit like anybody can make these things this is the first one I've seen in a long time that I was like oh shit this actually kind of impresses me at any level like this looks cool they it has a really nice um alien feel to it um they had a lot of film grain and like it just it it was very it's claustrophobic it's creepy it's got when they go in and",
            "start": 1473.28
        },
        {
            "text": "level like this looks cool they it has a really nice um alien feel to it um they had a lot of film grain and like it just it it was very it's claustrophobic it's creepy it's got when they go in and get Jess's eyes in the Samus suit like Iron Man that's really really cool it's cool and they they did a really good job with it um the music was like on point it was like very it was Metroid when it needed to be and it wasn't exactly Metroid at other times which is good um they they really kind of got a lot of the the key Metroid stuff in there they got the Morph Ball they got the Grappling Beam and all that stuff and it's it was cool it was very nice there was the Chozo like the plot of the short made sense it was contained it has a it feels good you watch it and when it finishes you're like oh that was worth watching mhm now is it perfect absolutely absolutely not you know like but is anything perfect no you know but even more than that I feel like people are are being a little harsh on",
            "start": 1511.36
        },
        {
            "text": "oh that was worth watching mhm now is it perfect absolutely absolutely not you know like but is anything perfect no you know but even more than that I feel like people are are being a little harsh on it just because it's like this isn't right or this isn't right but it's like this is the best Metroid fan film I think like I've ever seen best piece of Metroid content in years well that's that's also true you know and it's it's really awesome my biggest critique of it is the fact that like Samus isn't that scared you know like she seemed a little bit like what's going on the whole time where usually she's a little I would assume she's a little bit more of a badass usually she talks like this and then I saw the baby Metroid and I didn't know what to do remember that Metroid: Other M remember this that's not the remember uh but I I really like it I definitely think you should check it out if only to have your own criticisms of it and and you know see what you have to say about links",
            "start": 1552.92
        },
        {
            "text": "this that's not the remember uh but I I really like it I definitely think you should check it out if only to have your own criticisms of it and and you know see what you have to say about links in the description yeah yeah I'll do that for sure that's where Kevin takes a note usually and then make sure you did it good job K shout out to Sam I'm really happy you finally got to make this project happen um other games I've been playing I've been playing a lot of games little bit at a time so I put a couple hours into a couple games learned that a couple games weren't for me and learned that a couple are for me let's go let's start with a Guitar Hero Live we've talked about this before but we we played a bit more over the last couple weeks and we haven't really talked about it what are your thoughts I haven't played it more since the like the two the weekend I spent with it I I brought it home it came in on a Friday I played it the Saturday and the Sunday of that weekend did a lot of the",
            "start": 1593.88
        },
        {
            "text": "I haven't played it more since the like the two the weekend I spent with it I I brought it home it came in on a Friday I played it the Saturday and the Sunday of that weekend did a lot of the Guitar Hero TV stuff which is I I thought not that they undersold it but they didn't they made such a big deal about you're playing in front of the live audience right that I wasn't paying attention and then they're like oh there's Guitar Hero TV I'm like all right whatever the hell that is I don't you know what I mean whatever and then to jump in and play it I was like oh this is actually kind of awesome and I saw people in the some of the reviews were harsh on it like oh it's a microtransaction game and then it's like for me it wasn't you know for a weekend of play where I jumped in I you start earning credits like nobody's business and then you go and pick the songs you want and then you level up and then you get more credits and I never spent any money to go play the song as I wanted to they were just",
            "start": 1633.64
        },
        {
            "text": "like nobody's business and then you go and pick the songs you want and then you level up and then you get more credits and I never spent any money to go play the song as I wanted to they were just there you know what I mean but the idea of jumping in and there's just like an alt-rock station that you jump in and you're in the middle of a song and you start playing or whatever and then the next song comes up and you you don't like that you jump out go to the next station stuff like that I thought it was a cool idea it's different right the big thing about this Guitar Hero and why I played it longer than I played Rock Band was the fact that this is different this isn't oh I'm just playing Rock Band again okay that's that's all right this is I got I'm relearning how to play you know it's these six buttons you know in total three on top of three and I'm trying to figure out how to do that stuff I'm doing this the the Guitar Hero TV stuff I'm I am playing the live shows trying to elevate",
            "start": 1666.6
        },
        {
            "text": "six buttons you know in total three on top of three and I'm trying to figure out how to do that stuff I'm doing this the the Guitar Hero TV stuff I'm I am playing the live shows trying to elevate the band there and seeing what that looks like there's a lot going on that made it feel hey this is something new to learn and that's exciting that's interesting my my review of the game in one word is satisfying like I feel like the game is very satisfying it's what I was looking for from the revival of music games where yeah it is relearning it's recapturing that magic that I had so many years ago of I don't know what I'm doing oh shit now I know how to do it oh shit let's make this better let's keep doing this and like I was telling Colin last week on the Patreon exclusive episode like it gives me a sense of music discovery that I haven't had in music games for years like I'm hearing songs that I've never heard before that I'm like I like this who is this artist I want to know about",
            "start": 1699.44
        },
        {
            "text": "gives me a sense of music discovery that I haven't had in music games for years like I'm hearing songs that I've never heard before that I'm like I like this who is this artist I want to know about this and that's great and it's also has a whole bunch of music that I actually like the set list is good especially when you add Guitar Hero TV like that there's so much more to the set list than what's on the box and it's weird and what you're saying is right like they didn't do a good job of explaining what Guitar Hero TV is right cuz you don't own those songs they're not included on the track list so when we first got on Colin & Greg Live I read the track list to Colin and he's like that's marginally better than what Rock Band's was right and I was like yeah I agree and then I played some of those and then you jump into Guitar Hero TV and it's like oh here's Lit and here's this and here all these things that weren't on the box that I liked but then it was the same thing of like I'm just",
            "start": 1735.36
        },
        {
            "text": "those and you jump into Guitar Hero TV and it's like oh here's Lit and here's this and here all these things that weren't on the box that I liked but then it was the same thing of like I'm just going through I'm like I don't know any of these songs but I like I'd stop and listen and be like oh this is in this is alternative this is pop this is like something I would like and maybe I know a little bit of it but since I'm not trying to sing it or anything else I'm just trying to play yeah why not and I'll watch the video in the background and have fun with it like it was a great distraction game you know what I mean the weekend it hit was perfect because we were in between getting whatever the next big thing was that I was super excited for so I was like I have time to kill and I played it one night and then the next night I finished The Walking Dead I was like you know what I could go for more more songs and I jumped on and did it again now that said games I've wanted have shown up",
            "start": 1770.04
        },
        {
            "text": "it one night and then the next night I finished The Walking Dead I was like you know what I could go for more more songs and I jumped on and did it again now that said games I've wanted have shown up since then and I haven't played much of it at all right they're just there and it's like well do I hold on to this guitar am I ever getting back to it or what does it matter mhm I've had four real experiences with the game three of them have been absolutely awesome I've had so much fun playing and one of the times I could not get the guitar to sync at all and I spent maybe an hour and a half really trying to like keep syncing keep playing and I realize like it's not right and that ruins it absolutely ruins it and that's that is a that's something that I've seen everyone that's played the new guitar or Rock Band has dealt with yep no and that's the thing is like I think we talked about it just tangentially at the table right when we got Rock Band that first day right we set it up and it was",
            "start": 1800.44
        },
        {
            "text": "or Rock Band has dealt with yep no and that's the thing is like I think we talked about it just tangentially at the table right when we got Rock Band that first day right we set it up and it was totally **** and we all and you were like I wish we just plugged in where it was just done again and this was the same thing where yeah like I played for a while and then it's like what you're saying of like I finish a song and be like I can do that better I finally at the end there got the feeling for going up and down you know going from black to white or whatever I can do that I can do that and go back and replay it but then you get good enough to where it's like well this isn't perfect and then you start tinkering and then it's 30 minutes of like that's almost there but not there wait I got to wait for the ball to hit the cowbell but when you know I moving this thing around trying to **** get it perfect and it never is perfect right exactly that's the problem in none of my experiences",
            "start": 1834.88
        },
        {
            "text": "to wait for the ball to hit the cowbell but when you know I moving this thing around trying to **** get it perfect and it never is perfect right exactly that's the problem in none of my experiences did I feel like yep nailed it I was always playing maybe like a microsecond off and then it gets in your head where you're like I **** that up but did I **** it up or is the game **** up and can I make it back you know what I mean like that it's like yeah it's like such a **** headache to have to worry about and I never had that problem back with Guitar Hero on the PS2 like I was just like I just need to play it they're giving me the song and if I get it wrong it's my fault yeah um other things I Mario Maker oh my God I'm addicted to that game yeah I can't stop playing I keep going back to it and like we did a let's play um yesterday that's going to it's already last it be yeah so uh check that out we did the Nintendo World Championships levels the reason I'm talking about this",
            "start": 1867.96
        },
        {
            "text": "back to it and like we did a let's play um yesterday that's going to it's already last it be yeah so uh check that out we did the Nintendo World Championships levels the reason I'm talking about this now is Nintendo today is doing the update for Mario Maker which adds checkpoints and the power up thing where if you're small Mario and you hit the power up you get a mushroom if you're big you get the Fire Flower that's **** awesome but even more than that they're adding the the what are they called um event mode and official makers tab so official makers tab is going to be Nintendo constantly updating Nintendo made levels which I like hell yes that's **** great and event mode is like Nintendo World Championship style things where they already did it at PAX before where they like they made there was like a the contest have levels or whatever and then they put them out there for everyone to play and there's a more focused idea behind it I'm like thank you for making this game that I",
            "start": 1902.72
        },
        {
            "text": "there was like a the contest have levels or whatever and then they put them out there for everyone to play and there's a more focused idea behind it I'm like thank you for making this game that I love so much even better yeah like man Mario Maker the more I play it the more I'm like I just I'm in entirely in love with this game that's great um so I'm very stoked about that others on the Nintendo front Yo-kai Watch the the 3DS game played for about an hour it's not for me but I can understand who it's for this is for the people what is this game so it's to boil it down it's the new Pokemon you know it's like it's a huge thing in Japan like very very very big and um all the kids love it and it's the new digital monster like Digimon they call them yeah they're Digimon um that type of thing they're ghosts ghost creature things this weird paranormal stuff going on and like there's one kid that sees them like he goes TR have pack no no no no no no Proton Pack this kid goes and there's one",
            "start": 1944.92
        },
        {
            "text": "they're ghosts ghost creature things this weird paranormal stuff going on and like there's one kid that sees them like he goes TR have pack no no no no no no Proton Pack this kid goes and there's one of those like you know the capsule machines where you put a out like you get that and like there's ghost in that thing which are huge in Japan those Mach yeah and um just it's very similar to Pokemon in in a lot of ways and the it's it's an RPG and there's like the battle systems and stuff I don't really like the battle system it's uh it's a little bit more like there's a lot of tapping involved and it feels like in Pokemon you're the Pokemon trainer fighting with the Pokemon but you still kind of feel like you're in control of the Pokemon whereas this one how to put it into words let these ghosts out and they're just doing whatever the **** they want it just feels a little bit more like you're managing ghosts as opposed to using the ghosts even though with Pokemon you're the Pokemon",
            "start": 1991.48
        },
        {
            "text": "ghosts out and they're just doing whatever the **** they want it just feels a little bit more like you're managing ghosts as opposed to using the ghosts even though with Pokemon you're the Pokemon trainer there's a different feeling like I I feel they're your slaves in Pokemon these are sentient beings dead grandfathers children who were involved in bus crashes and now you have their spirits and you have to make them fight ex I do want to give a shout out to my favorite one his name is Cheek Squeak and he looks like a butt and if he blows on you he makes you fart Cheek Squeak sounds like my boy so I'm really into that but it's things like that that make me realize like this is not for me like Pokemon I will always love Pokemon because I loved Pokemon and I've grown with that and so there's just that with me I don't know that I could get into this game because now because it it is it's a kid game like it's straight up is a kid game gotta whereas Pokemon I feel like I would argue it's",
            "start": 2038.36
        },
        {
            "text": "just that with me I don't know that I could get into this game because now because it it is it's a kid game like it's straight up is a kid game gotta whereas Pokemon I feel like I would argue it's like oh but adults going to like it too but it's like maybe I'm wrong about that no Pokemon's a kids game it's just it's just that I've called it and I've called Pokemon this before and it's not an insult to it but it is baby's first role playing game and that is what Pokemon is so it's it's it's a great entryway and gateway drug for younger kids to get into statistical based games um but I agree with you Pokemon can be enjoyed by adults it is enjoyed by millions of adults around the world including you know us me until more recently I guess but um it's a children's game so I wonder I wonder like I I was I was when we were at IGN I was talking a lot about watching Yo-kai Watch on on um on the charts in Japan and being like this is going to be really big here um and it surprised me that it",
            "start": 2079.88
        },
        {
            "text": "I I was I was when we were at IGN I was talking a lot about watching Yo-kai Watch on on um on the charts in Japan and being like this is going to be really big here um and it surprised me that it took so long to come here um but I'm interested to see how it resonates with Western audiences I haven't I know the review embargo was today as we're recording this but I not read any of them so I don't know how it's doing but that game **** murdered in Japan I mean like it's it's it's hard to it's hard to overestimate or overstate rather just how well that game did in Japan yeah it killed for a long time who'it kill going back to squeak no but going back to what I was saying about the the kids game thing whereas I feel Pokemon is a kids game that can be enjoyed by adults and stuff like it it always kind of had a you know it's just fun the story Line's cool and there's all that with this one it does feel pretty dark for a kids game like The Ghost and all that stuff yeah like it does",
            "start": 2121.28
        },
        {
            "text": "it always kind of had a you know it's just fun the story Line's cool and there's all that with this one it does feel pretty dark for a kids game like The Ghost and all that stuff yeah like it does feel a little bit more advanced for kids but it's not enough to make it like an adult thing it's young adult well right I don't even know it's it's weird well that's what always that's what always struck me about literature well just always young adult lit the last 20 years or so is like this is pretty **** dark you know like uh like especially The Hunger Games which is super **** dark um or even something like Lois Lowry is The Giver or whatever I'm like this is a really dark theme for young adult I me even Twilight yeah Twilight well Twilight's you know a timeless vampire story so 50 Shades of Gray yeah not made for not sure if it's young adult but yeah oh it is yeah anyway I'll I'll be watching this I'll be watching this game with with intensity uh yeah I'll be Yo-kai Watching it",
            "start": 2161.32
        },
        {
            "text": "50 Shades of Gray yeah not made for not sure if it's young adult but yeah oh it is yeah anyway I'll I'll be watching this I'll be watching this game with with intensity uh yeah I'll be Yo-kai Watching it because it's 3DS is really slowing down a lot in the West in terms of sales and I'm wondering it's it's it's at 50 million I think worldwide now or something like that which is great but I wonder if it's going to get one or two more pushes before they inevitably pull the plug on it which I think the NX is going to be you know if NX is a hybrid then you know 3DS's days are numbered um so I'll be interested to see like what are the games that can give it that one last push and I wonder if this is going to be if this hits the way a hit in Japan um it's anywhere near where it hit in Japan it's going to be a huge hit here too uh cuz it's millions and millions of copies I mean a demonstrable amount of the Japanese population has that game there are 20 what what is it something like 20% of the",
            "start": 2202.12
        },
        {
            "text": "to be a huge hit here too uh cuz it's millions and millions of copies I mean a demonstrable amount of the Japanese population has that game there are 20 what what is it something like 20% of the Japanese population has a 3DS so I mean that's an incredible for for that to be for that to be the case here 3DS would need to sell would would need to in just in United States have pushed um like 67 million units so that's an in that's an incredible amount of people that own a 3DS and so you know here it's it's less so and I'm interested to see like what games can possibly proliferate this unit even further because I think the 3DS is looking quite aged at this point speaking of 3DS the last game that I put some time into was Triforce Heroes Zelda game I enjoy it a lot I loved uh Four Swords Adventures back in the day or Four Swords Adventures um back when it first came out on GBA with the Link to the Past as like the thing that was impossible to play with your friends because it required way too",
            "start": 2243.6
        },
        {
            "text": "back in the day or Four Swords Adventures um back when it first came out on GBA with the Link to the Past as like the thing that was impossible to play with your friends because it required way too much **** then I bought the GameCube version that was even more impossible to play because you need to way too much **** to play with your friends but I made it happen and I loved the **** out of and it was really fun one of the first games um that I ever played definitely the first Nintendo game that was kind of that co-op competitive multiplayer that now is everywhere in every game they ever make but where you're working together but it's also funny things happen when you work against each other and you are trying to see who can get more rupees or whatever who gets the crown yes so this one's been cool because I I can just play it single player which is something that you couldn't do on the GBA one and GameCube you could but it wasn't whatever this one I played single player I tried",
            "start": 2288.48
        },
        {
            "text": "one's been cool because I I can just play it single player which is something that you couldn't do on the GBA one and GameCube you could but it wasn't whatever this one I played single player I tried playing online a bit um I it was lagging out and stuff I'm like it's not even worth it I'm not even going to try then I played through uh a good amount of the game and it's fun I like it the the game changes based on if you're a single player or playing with other people so like they change some of the um like puzzles and **** so that they're possible with one person you kind of switch off between the different Links and um it's cool and I I definitely think that I mean it's not Zelda this is not a Zelda game but once you kind of turn that off in your head and be like this is a multiplayer Zelda game it's is it good on that sense yes it definitely is it's fun it's great um I don't think it's like a 10 out of 10 but it's fun it's a cool little diversion it's a 3DS game I love the the",
            "start": 2325.76
        },
        {
            "text": "Zelda game it's is it good on that sense yes it definitely is it's fun it's great um I don't think it's like a 10 out of 10 but it's fun it's a cool little diversion it's a 3DS game I love the the hacken slash Zelda like Link to the Past where you're like kind just walking around like slashing **** I like we're getting more of that it's really cool um I can imagine playing with two other people being really good so yeah okay mhm all out good so next next topic of then oh d one more for for Colin what you been playing I mean I've been the only game that we can talk about that I've been playing is Oregon Trail on Vita um I was pretty harsh on it when I first started playing it because the controls are really **** terrible but I figured out a way to the shooting control specifically in the game for people that don't know Oregon Trail is an Oregon or so Oregon Trail, Oregon Trail is the game but it's it's based on Oregon Trail, Oregon Trail and it's about like riding in a station wagon",
            "start": 2366.88
        },
        {
            "text": "game for people that don't know Oregon Trail is an Oregon or so Oregon Trail, Oregon Trail is the game but it's it's based on Oregon Trail, Oregon Trail and it's about like riding in a station wagon across the country with survivors of a zombie apocalypse and it's it's really **** weird but in a but in a good way um the major problem I have with it is the shooting mechanics are just **** whacked out I don't understand how what does that mean I don't understand how they botched it so badly that you shoot on the you aim on the sticks but it's not you're not pointing in the direction you're shooting it's like you're pulling back and it's like all it's just people play I mean it's bad on it's just bad really bad but I but someone pointed out to me you can use the screen to point but even then you have to pull back and go in the opposite Direction things and this is this is during sequences think about an Oregon Trail like the original one how you would go and Hunt animals well in this",
            "start": 2412.08
        },
        {
            "text": "you have to pull back and go in the opposite Direction things and this is this is during sequences think about an Oregon Trail like the original one how you would go and Hunt animals well in this one you have to like go and find things in a very similar screen but zombies are coming at you so you have to shoot them as like you're grabbing all this **** so that really was so I behind the guy and I'm pulling back to shoot right so so if if yeah if I'm shooting in front of me I have to pull back okay so like slingshot yeah exactly um so it's a little weird in that sense and it's a little off-putting because it's just it's just not intuitive at all but uh other than that I think the it's an interesting game you can you can trade with people and you have to kind of keep an eye on your car and and keep an eye on the health of your people and and feed yourself and have ammo and gas so it's very similar kind of thing to to Oregon Trail um and I've been playing on Vita so I I recommend",
            "start": 2454.36
        },
        {
            "text": "and and keep an eye on the health of your people and and feed yourself and have ammo and gas so it's very similar kind of thing to to Oregon Trail um and I've been playing on Vita so I I recommend people maybe take a look at it it might not be for everyone but that's been the only game I've been spending any amount of time with that I can talk about right now cool what are you guys playing let us know in the comments below it'll be a grand old time",
            "start": 2489.72
        }
    ]
}