{
    "id": 1376,
    "video_id": "7Jzp-kgAuDo",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Portillo"
    ],
    "title": "Assassin's Creed Syndicate - Kinda Funny Plays Through Its Backlog",
    "description": "Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1448902800,
    "duration": 3308,
    "transcript_chunks": [
        {
            "text": "Hey guys, Kinda Funny is having a holiday sale! That's right, if you go to KindaFunny.com/store for the next week, from Black Friday until the next Friday, you can get 10% off everything in the entire store. That's all the beautiful shirts that you know and love, that's the cups, the mugs, the stickers, all of that stuff is there. And the Let's Him Host shirts, they're there for this week only. You need that, you need that in your life. Oh, are these all the T-Shirt Tuesday shirts that we exclusively had only on those Tuesdays? Yeah, they're back for one week only, all of them in one place. Buy them for you, buy them for your sister, your friend, your neighbor, whoever you want to buy them for, even people you don't know. It's going to be great! 10% off KindaFunny.com/store. What's up everybody? Welcome to another Let's Play here on YouTube.com/KindaFunnyGames. I'm Greg Miller, this is Portillo the Weer Doog, who you can't see, but I assure you was there. And if you didn't know already, ladies and gentlemen, we are doing",
            "start": 0.08
        },
        {
            "text": "here on YouTube.com/KindaFunnyGames. I'm Greg Miller, this is Portillo the Weer Doog, who you can't see, but I assure you was there. And if you didn't know already, ladies and gentlemen, we are doing something called Backlog Week, where we jump into our backlogs, personal backlogs, and play things we've missed. Of course, I missed a bunch of stuff, but this year it's been annoying me that I missed Assassin's Creed Syndicate. Now, what do I know about Assassin's Creed Syndicate? It's in England, Merry Old England, oi, and all that jazz. Everybody says I should have done the voices, but I'm not upset about it. And that's it, really. I totally, you know, I do like the Assassin's Creed franchise, unlike Colin. Um, I've played pretty much not all of them. I skip some of them. Didn't play last year, loved Black Flag, didn't play the one, didn't play three, love, you know what I mean? That's how it goes. Um, but I'm excited, just this one, knowing nothing about it, and I'm upset that I've missed it, so I thought I'd play my first a",
            "start": 40.96
        },
        {
            "text": "play the one, didn't play three, love, you know what I mean? That's how it goes. Um, but I'm excited, just this one, knowing nothing about it, and I'm upset that I've missed it, so I thought I'd play my first a bit of it with you. Oi, Governor! In such for our European audience, if they're watching. I'm a card. Here we go. The East is your... oh, these guys up go. You can't trust them. So this is a slow opening. Sorry, how would I know? I've never played before. I so I know that, yeah, you can play as a girl, right? Um, you can play as a boy. You can, uh, hello, initiate. Recently, Abstergo Historical Research began several new projects in London. Touch down in London. Can we get weekend? Oh, the Templar up to something. No, no, no, ****, new Piece of Eden. Okay, it's just, it's a normal ass ass. Bishop Jacob and Evie Frye are twins. How awesome is that? Speak of the devil. Fire up your cameras, Beck, Becks. I wish I had a cool nickname. Used to be called Bugs as a kid, not not as an adult. ETA on the payload. That's Becks. Who's this nerd? Shaun Hastings.",
            "start": 74.92
        },
        {
            "text": "is that? Speak of the devil. Fire up your cameras, Beck, Becks. I wish I had a cool nickname. Used to be called Bugs as a kid, not not as an adult. ETA on the payload. That's Becks. Who's this nerd? Shaun Hastings, Assassin historian. Smart. You look weird with a weapon. Let's Chris Hardwick. I'm assuming he's great in Tales from the Borderlands here in a few hours. Gotcha. Doesn't say with who. Five. Now we're are the future. I suppose it's down to Muggin here to find out. Oh, he's British. The mission was to find data to locate a Piece of Eden in London. We did. And now I am eager to try this new kit. She doesn't like that one bit. She doesn't appreciate. I don't like it when those two go off book like this. Well, all we can do is take a deep breath and move forward. You'll be searching for them through the lives of Jacob and Evie Frye, twin Assassins who operated in Victorian London. Got it. First of gen memories are downloaded. Let's do it. I mean, I'm ready to run. Oh, I got a bear. Brother George, it is as I feared. London has fallen.",
            "start": 139.56
        },
        {
            "text": "Evie Frye, twin Assassins who operated in Victorian London. Got it. First of gen memories are downloaded. Let's do it. I mean, I'm ready to run. Oh, I got a bear. Brother George, it is as I feared. London has fallen. Thrice I have written to you. Thrice, I love it. Thrice you've responded with silence. And yet I write again, so desperate my need, so few my options. I need you. London needs you. We're going to get all up in this London. We're going to climb these to do this stuff. Is not, I'm not going to, I'm not going to make. Steal. Someone help these children. Someone write The Jungle by Sinclair. Consolidate their power. They have chosen a grandmaster so ruthless, so thorough, one might think Reginald Birch himself had returned. His name is Crawford Starrick, and he intends to rule the world. He's mad. I've known this guy. He abandoned his boy. He does not control no industry that escapes his grim touch. I mean, like, what a great setting. The one thing these Assassin's Creed games nail every year, right, is the setting and how beautiful it",
            "start": 205.96
        },
        {
            "text": "boy, he does not control no industry that escapes his grim touch. I mean, like, what a great setting. The one thing these Assassin's Creed games nail every year, right, is the setting and how beautiful it is. Look at this London Street. Known as the strikes terror in the hearts of. There is no. The water doesn't look great, but I'm letting them go. Look at how great the the environment. United by duplicity or force. So for me, Assassin's Creed Syndicate has this weird, on the highest, this weird, uh, rollout, right? Is I feel like they got, remember, the got leaked, people got spoiled, it was going to be in London. Then it came out, and then I felt like it was just quiet all year long, which is, you know, not normal really for Assassin's Creed. I feel like, right? It feels like you hear about Assassin's Creed game a lot leading up to that launch, and we didn't hear a lot about this. That's why we're so interested in sales over on KindaFunnyGames.Live. And time again, whoever velvet gloves, man, I can dig that, controls the",
            "start": 263.48
        },
        {
            "text": "a lot leading up to that launch, and we didn't hear a lot about this. That's why we're so interested in sales over on KindaFunnyGames.Live. And time again, whoever velvet gloves, man, I can dig that, controls the world. Mhm, mhm. So yeah, it just flew under my radar. Then it came out, and it was, came out around other stuff. There's always, there's always something else we're playing for a review or whatever. But now, you know, done with Fallout spoilers. We're recording this in advance. This is the week before Thanksgiving. So I've been playing Battlefront this week, going to go away for Thanksgiving, come back, and I want to hit Tomb Raider hard, probably hit this hard if I like what I play here today with you. Ferris Iron Works. That now that, of course, is a reference to Carol Ferris from DC Comics, which is the Green Lantern Universe. Clearly, there's a Tycho City here. The Templar running things is Rupert Ferris. And our target two is Sir David Brewster, who's got his hands on a bible that could ruin us in this wretched war. Mhm.",
            "start": 309.24
        },
        {
            "text": "Universe. Clearly, there's a Tycho City here. The Templar running things is Rupert Ferris. And our target two is Sir David Brewster, who's got his hands on a bible that could ruin us in this wretched war. Mhm. Think you both can handle it? What a question, huh? All right, my mistake, ladies and gentlemen, the unstoppable Frye twins. See them. He's got a good hat. Here we go. Going to hop on a moving train. Why not? I don't know if can't the microphone is picking it up too. My PlayStation's doing that awesome thing where it tries to eject a disc every 5 seconds, even though there's no disc inside it. Good job, PS4. Got to get a **** eyeglasses screw in here, tighten it up. Hopefully that fixes it. ****. What, what were you going to say? Guide you, Aunt? Oh, and I don't be insulting. Oh, she's cute. I like the freckles. Years have not been kind. He looks like every hockey player Colin's ever shown me. The same place as you, Jacob. Have fun. I think it's a violin everywhere else, but we call him the F, 'cause we be America, yo. Rupert Ferris.",
            "start": 353.36
        },
        {
            "text": "not been kind. He looks like every hockey player Colin's ever shown me. The same place as you, Jacob. Have fun. I think it's a violin everywhere else, but we call him the F, 'cause we be America, yo. Rupert Ferris. Here we go, getting straight into it. Where is Carol Ferris, his grandfather? That's all I want to know. Great-grandfather, probably great-grandfather. Let's blow up some trains and ****. Come on, here we go. No. Oh my God, how long does he intend to go on like this? I'm going to **** murder this guy. Disrupting the other workers. Oh, you're dead, you **** child beater. Get the machine fixed and send me some laudanum for my head. Laudanum is probably some kind of drug. Up. We're going to kick the guy's ass. Nobody crushes a kid in my town. I'm in control, guys. My XP is up as well. Let's see if I can just go. There we go. Well, I was going to say, I'm assuming I have to avoid everybody here, right? Um, maybe not. Hi. You care? Nope, doesn't care that I'm here. Got it. Just making sure. I thought I had to be like Assassin, avoid these",
            "start": 411.48
        },
        {
            "text": "I was going to say, I'm assuming I have to avoid everybody here, right? Um, maybe not. Hi. You care? Nope, doesn't care that I'm here. Got it. Just making sure. I thought I had to be like Assassin, avoid these people. What? Nobody cares about this weird ragamuffin running over here, huh? Did it. Look at that. Game over. Pop me a trophy, pop me the Platinum. A problem. Go. You see, nobody explain that to me, sir. Just where my Green Dot was, that door opens and I have my route to Ferris. Just the, just a tutorial here. I'm not going to bust his balls too bad about. Everything's done. Hey guys, just going to sabotage this. Don't worry about me. Clearly I work here a bit and I know that spinning this thing is a good thing to do. Always on the fly, always work on the fly. Can we please get back to the music? Give me some fiddle back in this ****. You could do. You tell me to hold to free run one more time, G? We get it, Free Run is cool. Well, hey now, get up there. You're this ****. All right, come on. I want you to run back up",
            "start": 487.72
        },
        {
            "text": "back in this ****. You could do. You tell me to hold to free run one more time, G? We get it, Free Run is cool. Well, hey now, get up there. You're this ****. All right, come on. I want you to run back up that thing like you did before. Remember when? Okay, F, we'll go back over here. You can have, oh, you can have your way. Do. Go back here. Up you go. Over you go. Over you go. Good. Now we'll do the exact same we did. Get in here. Yeah, run this way. Yeah, do this thing. Yeah. And then do this. See, that wasn't so hard, was it? Now this guy who doesn't even notice I'm sabotaging and all this ****, 'cause he's more worried about these women scrubbing boards up here that nobody cares about. Over here, I'll go this way. Yeah, there he goes. Big leap, big leaps, big ups, they call them. He's wearing the original Chuck Taylors. Moccasins. Sabotage that ****. Go. What the hell? No. Still more to sabotage. And all these people up here, who's, I don't even know what these people's jobs are if they're not even paying attention that I'm",
            "start": 562.44
        },
        {
            "text": "sabotage that ****. Go. What the hell? No. Still more to sabotage. And all these people up here, who's, I don't even know what these people's jobs are if they're not even paying attention that I'm sabotaging the hell out of this thing. Crap, that one. There you go. We're sabotaging. Oh my God, I'm so in love. So many sabotages. This guy comes out pissed. What's all this? Which one of is responsible? Do it. Done. See you, Chief. The inspector. That's it, man. Is he dead? I was like, what the hell? Like, we're not going to get in trouble for this. Damn, man. This guy's like a UFC fighter. Come on, take your shot. So now, when that yellow bar goes, is when I, I should be countered. Is there any sense to countering when I can just kill him? Sorry, Chief, your friend's dead. I guess your boss. Nobody was friends with anybody back in the day, were they? Then just go. See you guys. Pleasure. No, I'm not going to hurt you, weirdo. You're not lit up. It's, it's the door. Open the **** door. Uh oh, Ferris, I'm coming. We just killed the Ferris to",
            "start": 623.2
        },
        {
            "text": "in the day, were they? Then just go. See you guys. Pleasure. No, I'm not going to hurt you, weirdo. You're not lit up. It's, it's the door. Open the **** door. Uh oh, Ferris, I'm coming. We just killed the Ferris to ground. Oh, interesting. What this guy, what you guys do to this dude? Help. I'd love to help you or hit on your face. Probably. Excuse me. Ding, ding, ding, ding, ding, ding, ding. And yes, this is the Harry Potter theme dinging. It's the only British music I know. Ding, ding. You're an Assassin. Mark, hold R to. Oh, hey, how you doing? I'm just some dude. Enemy who can see you will become suspicious if you stay in their line of sight. They will become aggressive and attack. Move behind cover to lose enemies. They will investigate your last. Come on, ****. Hey, come investigate me. Oh good, I'm glad you're just telling me what you're doing. Look, I'm getting on the train to Hogwarts. Harry Potter, National Treasure of them. Okay, come on. Platform, what is it, three and three-quarters? I don't, I didn't watch. I don't",
            "start": 710.56
        },
        {
            "text": "me what you're doing. Look, I'm getting on the train to Hogwarts. Harry Potter, National Treasure of them. Okay, come on. Platform, what is it, three and three-quarters? I don't, I didn't watch. I don't enjoy Harry Potter, but I know it. I've reached the wall. Everybody find out where I'm supposed to go there, right? Oh, look at this. Now I'm just some weirdo climbing a wall. A lot of people see me climbing the wall, though. They're going to come investigate my last. No position on the wall. See you, losers. Nailed the guys. Tutorial. Stealth. Sneaking. X makes you harder to detect and allows you to move faster. The stealth ring shows enemies above and below you from behind cover. L aim. Okay, put in stealth mode. Apparently, everyone still knows I'm here. Let's see the Eagle Vision. It's okay, guys, don't worry. I'm here. I'm not here to stealth kill you guys. Oh, I think when I went to stealth, I put up my hood to prove that I'm really an Assassin. He did. What's wrong with you? I say you. He did. Nope, nope, not not what I",
            "start": 800.24
        },
        {
            "text": "I'm not here to stealth kill you guys. Oh, I think when I went to stealth, I put up my hood to prove that I'm really an Assassin. He did. What's wrong with you? I say you. He did. Nope, nope, not not what I wanted you to do. It was going pretty well until, as usual, the controls of Assassin's Creed got the. Now he's got to kill everyone. I see. Take his eyes out. Absolute. **** stealth. **** your goddamn Industrial Revolution going on here with your steam machines and whatnot. Not even the cool steam machines with weird ass controllers. I was going to try to stealth kill him or something. No, touch back. Boom, dead. So many **** got to die today. I told you all when I came out, it was about Rupert Ferris, but then y'all had open your mouth with the **** opinion. Okay, well, you're going a little bit higher than I wanted you to. There you go. Walk, walk, walk, walk like a. All right, get on that beam, right? Get on that beam right there. There we go. Jump over there. Drop. Here we go. Go to stealth mode. Can I do cool",
            "start": 888.72
        },
        {
            "text": "than I wanted you to. There you go. Walk, walk, walk, walk like a. All right, get on that beam, right? Get on that beam right there. There we go. Jump over there. Drop. Here we go. Go to stealth mode. Can I do cool stealth kills? Oh, this guy's not. I want a stealth kill. What are you doing, kid? You shining a wrench on your knee in the middle of nowhere? Get out of here. Damn, locked. I assume you assume it's locked. 'Walk Like a Man,' fast. You remember the song, everybody? You remember the Howie Mandel movie, 'Walk Like a Man,' where he was like, 'Raised by Wolves'? I think it was a weird ass movie. They used to just make movies on anything. People just walk into Hollywood executive's office and be like, 'Hey, what about this?' And they be like, 'Print it.' Movies are going to be around forever. All you got to do is make enough to feed somebody at lunch. Early. Still early in the morning. Coffee's good. Let's see these notices. Checks out. All right, this all checks out. It's fun to be in Merry Old England, 'cause I can read the signs when",
            "start": 1005.2
        },
        {
            "text": "feed somebody at lunch. Early. Still early in the morning. Coffee's good. Let's see these notices. Checks out. All right, this all checks out. It's fun to be in Merry Old England, 'cause I can read the signs. When we're back in Italia, I couldn't, you know, Ezio was talking. I'm like, 'God, what you're talking about?' Rupert. There's a name I can get behind. Mr. Ferris, sir. Like Rupert from Harry Potter. Here we go. The lad in the factory should be taken to be bandaged by the Apothecary room in the river. Fine, but dock his wages. Yes, sir. All right, now we get in here. We kill this ****. He has a nice factory. I'll tell, I'll tell you that. A final price was the F. Yeah, we shall. Eagle Vision. Fighting for freedom wherever there's trouble over land and sea and air. The Assassins were there. Assassin's Creed, Assassin's Creed were there. Assassin's Creed. They want fair wages for everyone. They're the Assassins. Yeah. Now, can I, can I do anything like a Batman Takedown? No, I just hit him with knives, huh? That didn't kill",
            "start": 1071.0
        },
        {
            "text": "Creed were there. Assassin's Creed. They want fair wages for everyone. They're the Assassins. Yeah. Now, can I, can I do anything like a Batman Takedown? No, I just hit him with knives, huh? That didn't kill him. Let the bodies, loot the bodies to restock. That was stupid. I haven't been looting anybody. I forgot all about it. It's been so long. Good. Three shillings. Here you guys go. Here's some mini Euros for you. Go get some Wonka candy or whatever the **** you guys eat over here. Probably more kidney pie, you weirdos. Game's beautiful. You didn't need to go up there. Trade different approaches to reach your target. Oh, we want to go from the top down. I want to air assassinate this **** on his desk. Dock the wages. Dock the wages, will you, Governor? Done. Memory complete. Prelude. It is done. It is done. Oh, what did you accomplish, boy? What are you talking? How you dead? A bolt loosened in Starrick's machine. A large bolt, but not enough. Your grandmaster will fall, you Assassins. Why am I talking down to him, but he's standing",
            "start": 1141.24
        },
        {
            "text": "accomplish, boy? What are you talking? How you dead? A bolt loosened in Starrick's machine. A large bolt, but not enough. Your grandmaster will fall, you Assassins. Why am I talking down to him, but he's standing content? The mechanism we have built has been going strong for a hundred years and will run a thousand more. It is the very city itself. We will take London from him. See, something's wrong here, right? This shouldn't be happening. From him, you lurk in the shadows like a coward. I doubt it. He's a pretty guy. This guy's pretty. He kind of has like London, like Sam Witwer vibes, you know what I'm saying? Why was he standing when he was talking? Whatever. Escape on the train, everybody. You know what a good game was? Lego Harry Potter 1 and 2. Of course, got him. Oh, really? You guys are so dedicated, you couldn't even **** pay attention when I was in there doing stuff. You're going to jump on the goddamn train, though. Somebody would have to be stealing for you for me to jump on a train again. I guess it",
            "start": 1219.64
        },
        {
            "text": "couldn't even **** pay attention when I was in there doing stuff. You're going to jump on the goddamn train, though. Somebody would have to be stealing for you for me to jump on a train again. I guess it was a different time back then. Throw them off. There you go. Hey guys, I said I did the break button. Where's the Batman DLC coming out? Oh yeah, **** yeah. Oh, finally. Oh yeah, I remember I have cool things to use. Let's loot this mofo. Let's throw his body off too. Oh no, no, no, no. Oh God, I wanted to pick up the body, not fall down, but it didn't matter in the end. Wasn't on the last car. Here we go. Loot your bodies, boys, you're nerve. Oh, look at they, they translate English to for us. Oh no, jump off, dude. Get out of there, Doc Brown. Oh, shoot. Good job. Good job, everybody. Jump. You're **** Assassin. Is what you do for a living. I don't know why you're running backwards so far. It's going to be cool. I know it's going to be cool, but no way, no way, no way. Okay, all right, I see what we're doing now. Little bit of Uncharted",
            "start": 1315.44
        },
        {
            "text": "a living. I don't know why you're running backwards so far. It's going to be cool. I know it's going to be cool, but no way, no way, no way. Okay, all right, I see what we're doing now. Little bit of Uncharted 2, but I'm not saying anything about it. We seem to have made an unscheduled. Oh, you ****, you got it. You nailed it. I like this kid. I like British Sam Witwer. Also, yes, if you're, if you watch my other Let's Plays, just every, every white guy is Sam Witwer to me, 'cause he's just the default character. Also, he's a good human being. Everybody follow Sam Witwer on Twitter. Go say I said hi. Oh, **** son. This is all the song, but like, Hyrule is kind of like England, 'cause they have like a king and a princess and stuff. Dude, British Sam Witwer. All he. Damn right. Belts. I got initiate belt. **** yeah. Rate this memory. I rate **** yeah. You're welcome, Ubisoft. Stop trying to shove the Uplay or whatever the you're calling it now down my throat, which I haven't seen this game. I guess I shouldn't complain too much. Mhm. Mhm.",
            "start": 1409.12
        },
        {
            "text": "**** yeah, you're welcome, Ubisoft. Stop trying to shove the Uplay or whatever the you're calling it now down my throat, which I haven't seen this game. I guess I shouldn't complain too much. Mhm. Mhm. Now we're talking. These are always fun, right? Just run around, wait for the game to load. All I can do is run, though. Oh, there we go. Let's see what she's been up to. Evie, I think they call her, right? Evie Frye. Your best deals are always at Fry's Electronics. You know that. I tell you what, ladies and gentlemen, video games. So anyways, I enjoyed that mission. It's more Assassin's Creed. That's the one problem I have. It was good, it was fun. It's Assassin's Creed. Like, you know, do I need to play this whole game? Like, I've played Assassin's Creed before. I feel like I know what's into. I like the environments. I'd like to get into the free roaming, right? That's always fun. Going around, fixing up my house, buying paintings and stuff, dying my clothes and such. Yard guard. Memor. Brewster's laboratory. This is where the",
            "start": 1493.72
        },
        {
            "text": "Piece of Eden will be located. Got firm fingers now. Did a couple. The locomotive and create a version. Where is it, huh? Where's Brewster's supplies? He drunk these drunks. Miether, coward, Miether. I'm going to call Colin a Miether today. We'll see what he says about that. See how he claims to be such a history buff. Let's see if he knows Miether means coward. Hey, got a wish over here, do you? Oh, his lantern rolled away. And you die now. Oh, **** Jesus. Time to deploy the diversion. Time to deploy the diversion. I talk like Alan Rickman. Can I air assassinate him from a? I'm not looting these bodies. I mean, stupid. Sorry. This like all the best part. Back to the Future 3 and 1. Who are you going to tell? You don't have radios, idiot. **** man. Oh, she's awesome. Damn. Oh no. Oh my God, his arm twisted all around. That was ****.",
            "start": 1551.48
        },
        {
            "text": "all the best part. Back to the Future 3 and 1. Who are you going to tell? You don't have radios, idiot. **** man. Oh, she's awesome. Damn. Oh no. Oh my God, his arm twisted all around. That was **** phenomenal. Now I finally understand the Assassins came. People were walking around with that Stone Chin fella. Follow Stone Chin on Twitter, everybody. This is just your, your follow. So far we know to follow Stone Chin and Sam Witwer. So I'm just like laying it out for. Can I help these people? They'll send us to the lab. The lab. Our soon as the trolls. Give him some money. Evie, give him some money. Can't we help? Can't we interact with these people? Can't we give them money, sir? I want to give you money, ma'am. Miss child. Can't change history. They always say in Assassin's Creed, don't they? I don't think that's the slogan, but it could be. Right in the heart. I don't know why she's saying right before she does it. It almost sounds like a McDonald's thing. That's all wrong, 'cause I'm all high. I'm loving killing.",
            "start": 1646.2
        },
        {
            "text": "the slogan, but it could be. Right in the heart. I don't know why she's saying right before she does it. It almost sounds like a McDonald's thing. That's all wrong, 'cause I'm all high. I'm loving killing. You chest. I saw a chest on. Who? Oh, this guy sees me. All right, I'll stop doing that now. I'm sorry, guys. Sometimes I get caught up in the docile tones my mouth makes, you know what I'm saying? Mouth tones. Smells like Jacob's cooking. God, you guys, you **** guys. I here. Catch it. Our diversion is in place, folks. Damn, she's punching it. See you later, sucker. While I head into your lab. Couldn't even catch a **** family in the back. F going to catch me. Please. I'm an Assassin. I can't believe we're said the Pieces of Eden. I gave up in the Assassin's Creed story a long time ago, right? Like Black Flag. I was like, I don't know what's. I don't even care what's happening in the real world and, you know, the current times now. Just let me go be a pirate. Great. Cool. Follow me down the tracks. You stay here and keep a look.",
            "start": 1710.68
        },
        {
            "text": "don't know what's I don't even care what's happening in the real world and you know the current times now just let me go be a pirate great cool follow me down the tracks you stay here and keep a look out all right I'll shout if I get any bother yeah you you meter first for a bird's eye view can't be too careful come yeah meters they all meters tell you what I kind of miss is the Metal Gear run and dive Metal Gear Solid 5: The Phantom Pain you might have heard of it here we go here I go here I go here I go again what's my weakness man oh salt and pepper there's your bird's eye view we syncing, we synchronizing I need two more weeks with the device oh you'll get it mad scientist person practices are beginning to draw unwanted attention you have been given more than enough time to achieve results Sir David I was unaware that you expected me to perform like a **** spy permit me to remind you of your obligation to the Order. Oh, The Order: 1886 is this a crossover game like a racehorse, Sir David I",
            "start": 1796.08
        },
        {
            "text": "Sir David I was unaware that you expected me to perform like a **** spy permit me to remind you of your obligation to the Order. Oh, The Order: 1886 is this a crossover game like a racehorse, Sir David. I will return tomorrow if you have not unlocked the devices' Secrets forget your dogs and horses I will leave you to the Wolves good day run out of time here Sir David I was merely promised to tour the premises oh my God this guy's going to get his ass kicked sent you one of green spies get that man to interrogation then I want him brought he's like the worst spy ever it's like me showing up at the Mounds candy bar factory and be like I was promised I'm all covered in chocolate I was promised what oh tutorial be an assassin all right assassins are stronger when okay cool use Eagle Vision okay okay okay okay okay okay I'm just going to immediately fall to the ground of course and kill things but whatever however you want me to try to do this it's a leap of faith when I believe someone out there this is",
            "start": 1870.96
        },
        {
            "text": "okay okay I'm just going to immediately fall to the ground of course and kill things but whatever however you want me to try to do this it's a leap of faith when I believe someone out there this is Michelle Branch song It's a leap of faith when I believe truly care when I call out to you will you be everybody follow Michelle Branch on Twitter tell her I sent you right there I'll be waiting by the window for your smile to come through and I anyways I want you to know that that song I'm a big Michelle Branch fan has been with me since College you know what I mean and every time I play an Assassin's Creed game and they ask for leap of faith that plays in my head and this is the first time I've ever singing it to you so now it will play in your head too everyone Michelle Branch on Twitter and go to iTunes and get leap of faith if it's even sold that offer that might not be off that was off Broken Bracelet which was her independent album I'm not sure if Broken Bracelet's on iTunes yet if",
            "start": 1928.84
        },
        {
            "text": "go to iTunes and get leap of faith if it's even sold that offer that might not be off that was off Broken Bracelet which was her independent album I'm not sure if Broken Bracelet's on iTunes yet if it's up there get it and if not go get a a bootleg copy of uh Michelle Branch Broken Bracelet her independent album come get me **** it's like infiltrate from high areas and then it just dropped me down here means with hanging barrels yeah come get me come investigate come in me see come and get me come and get me G come on love now why don't I have a cool assassination thing from behind just **** club him to death sure just **** have him on the ground just beating his head in over and over and over and over and over again and like the people are coming up and they're running up on they like stop he's dead and she's like all Templars must pay and then like he doesn't even know what Templars are he's just a guy he had a family where the hanging barrel I don't see no hanging barrel do you",
            "start": 1977.92
        },
        {
            "text": "like stop he's dead and she's like all Templars must pay and then like he doesn't even know what Templars are he's just a guy he had a family where the hanging barrel I don't see no hanging barrel do you guys see hanging barrels oh there we go and I wasn't paying attention as to how to use the hanging hanging barrels well I used the hanging barrels thank goodness but I did not do what I was supposed to do oh I hit circle come on guys come on Big Daddy and I'll be waiting by the window for smile to come through hanging barrels above this **** no trust in you now we just climb one in doubt climb as Nathan Drake used to said got Point here here here nearly there kind of giving up on the hanging barrels thing I don't care having too much fun just singing a plain all reconnaissance pointed straight here I can trust in you a secret laboratory well well perhaps I can Aid this interrogation trap door I can come up under you think no no there is not guys oh but there's Treasure Chest oh piece of",
            "start": 2031.24
        },
        {
            "text": "here I can trust in you a secret laboratory well well perhaps I can Aid this interrogation trap door I can come up under you think no no there is not guys oh but there's Treasure Chest oh piece of candy keep that **** open 4 our smoke bombs are full wanted you to know pill you are dropping real bombs though Portillo is old now so he farts a lot if you missed the beginning of this this let's play and joined 36 minutes in Portillo is my wiener dog he's in my lap farting away home empty handed now it's what do I have oh I was going to say do I have cool **** great no no these guys are all going to get **** up nailed them look at they're they're both dying in unison behind me idiots this guy's like what what you're the coolest I'm the worst spy ever but you're the coolest thank you kindly I was in ever such a squeaky fix when what do you know you rescue me where's the hidden laboratory untie me and then we can parlay my lady I'm pressed for time tell me now it's underground requires",
            "start": 2137.36
        },
        {
            "text": "I was in ever such a squeaky fix when what do you know you rescue me where's the hidden laboratory untie me and then we can parlay my lady I'm pressed for time tell me now it's underground requires a key one of the guards nicked my cheeky sword thank you uh now you got yourself in I trust you can get yourself out again not to worry my lady can still record a couple of tricks from me carnival days Charming he's already out now he's going to tie you up he's going to tire up in in this game you know what I'm saying they have a love affair is what I'm saying guys I remember being in love and I'll remember when you told me I could trust in you I wonder if Michelle Branch ever plays Assassin's Creed games know she's she's got those kids she married she I I actually stop following her Twitter cuz she all she was talking about is this health food crap she was doing it's like all right I get it you know what I mean like sustainable farming and whatnot great you know I I buy local and organic and",
            "start": 2218.08
        },
        {
            "text": "all she was talking about is this health food crap she was doing it's like all right I get it you know what I mean like sustainable farming and whatnot great you know I I buy local and organic and everything just shut up there's a lot of talk about us you know what I can't do this anymore now I'll never know if she puts out new albums is this where I'm going sorry I've been talking about Michelle Branch yeah I'm going in here Eagle Vision on she doesn't put on her Hood when she does it I want to see that oh now she not if you value your life I can hide in there hey leave them rats alone the goddamn people your own I'll feed to rats what should be here **** well drop and kill this **** who else wants some got it got it not from a Jedi is this gu not bad he's bad oh right in the butt oh ML got him I could trust in you also this G on that Broken Bracelet album this Jam called Stewart's Coat Soap Sun spread like a disease from a washing machine I'm not stand around waiting for my lips to be",
            "start": 2297.8
        },
        {
            "text": "him I could trust in you also this G on that Broken Bracelet album this Jam called Stewart's Coat Soap Sun spread like a disease from a washing machine I'm not stand around waiting for my lips to be are falling through I don't if this is even washing machine actually my is a guy coming from okay he can see me like what is the deal here what's the deal okay the secret entry is that entry point is that the secret jump jump Portillo this is not the time we're being stealthy Portillo you can't be barking Portillo Portillo do you understand how what is on the line here I don't think this is the secret entrance, Portillo and I blame you're barking press L3 to locate the secret entrance using Eagle Vision so hard to see that's not what I wanted I urge you to listen to Michelle Branch when you play this game I'm all right **** everybody let's just kill them all kill them all jeez Jesus Christ stop sneaking it's over we're not sneaking anymore the sneaking is done now it's the fullon **** murder",
            "start": 2383.12
        },
        {
            "text": "I'm all right **** everybody let's just kill them all kill them all jeez Jesus Christ stop sneaking it's over we're not sneaking anymore the sneaking is done now it's the fullon **** murder no these guys wanted to work for a bad guy now they all die please sir yeah keep blocking bam that **** goddamn duck topper on her you came there no we hurting fools we ain't playing so now tap this thing to find the secret entrance I'll find the secret entrance when I'm goddamn ready to everything was going fine now everybody's got to die you understand you're Marked for Death sir there you are walking around with the goddamn butcher's knife what the hell's your problem o okay I like that you you attacked fast there but you still die boom Jesus Christ her kills are brutal that's awesome oh do we find the secret entrance loot this **** oh he peed himself there you go I didn't know we had the key we took the key from the dude is that right Top Hat McGee laboratory shout out to Dexter's",
            "start": 2536.16
        },
        {
            "text": "do we find the secret entrance loot this **** oh he peed himself there you go I didn't know we had the key we took the key from the dude is that right Top Hat McGee laboratory shout out to Dexter's Laboratory Dee Dee stay out of my laboratory this doesn't look like a laboratory at all anger men working over got a cool little elevator get all right all right all right all right there we go this is the first elevator in the existence of humanity first one she's ever ridden in for sure learn two skill points everybody earning XP got it oh it looks like I have to do double assassination take it sure shink all right then the soap spreads like a disease from a washing machine I creep yeah I just creep D he's cool she's really cool her brother's not as cool as she is no can't you bloody to by the way it's sir to you the BLS are dead, sir someone's going to get hurt if you push too hard honest to God locate Sir David Brewster hey dude I just killed two dudes behind you can you help me what the",
            "start": 2630.4
        },
        {
            "text": "the way it's sir to you the BLS are dead, sir someone's going to get hurt if you push too hard honest to God locate Sir David Brewster hey dude I just killed two dudes behind you can you help me what the **** so many people just watching me kill these people but they hate these people so these the people who hate these people don't mind me killing these people because they're like I hate those people of something what yeah yeah yeah there we go yeah that of course was Link, Legend of Zelda: Ocarina of Time you're allowed to politely golf clap for that impression yeah whoa Piece of Eden increase the electricity that looks like the thing from a Batman we have to shoot it said we need results now oh man see this is when accidents happened in Laboratories cool this game's going to be short we just get in there we get it and game's over exciting huh watch me I'll probably get a platinum trophy right when I do that too can I jump to that thing cool can I air assassinate this **** you goddamn",
            "start": 2724.68
        },
        {
            "text": "get in there we get it and game's over exciting huh watch me I'll probably get a platinum trophy right when I do that too can I jump to that thing cool can I air assassinate this **** you goddamn right I can't Assassin's Creed dead big tough guy dead The Jig Is up Professor oh I got to kill the doctor I thought I was going to like save the doctor oh no kill do man and done oh **** Jesus can you imagine how much that would hurt just getting beaten over the head with lay down your head Sir David Brewster but I have so much more to discover do not be afraid I'm not I could have swore I remember them talking when they were like being held I will continue your experiment you will not stop s Miss Thorne has already found another Piece of Eden more powerful than damn Piece of Eden I will take that one too will we fight to gain what we cannot take with us it's in our nature can't take it with you everybody oh I'm going to wipe your neck with this thing cuz this is what we do now this is",
            "start": 2828.28
        },
        {
            "text": "that one too will we fight to gain what we cannot take with us it's in our nature can't take it with you everybody oh I'm going to wipe your neck with this thing cuz this is what we do now this is our thing this is what US Brits do Brit assassins uhoh Portillo we're going to find out what's going on with this Eden this Piece of Eden Portillo, Portillo it's too much I have to get out of here now come on idiots everybody run with me don't stand there like a bunch of morons we supposed to do be **** oh my God oh Lord Almighty come on why do we care so much about this thing damn aliens o keep going that was far too close you're telling me lady I must find a way out oh little crack to go through did do the old Shimmy Shake video game thing through there you go i' still moving much much quicker than this and I'm not even a fast guy I'm a fat guy but I'd be like you know what we're going as fast as I can goddamn go here I have an adorable wiener dog to get home too oh watch your fingertips I like the",
            "start": 2901.32
        },
        {
            "text": "and I'm not even a fast guy I'm a fat guy but I'd be like you know what we're going as fast as I can goddamn go here I have an adorable wiener dog to get home too oh watch your fingertips I like the different perspectives on there you go come on yep oh daylight we have daylight I think maybe kind of no we may we do we do no yes we do we did it Portillo we didn't do any of the things we were supposed to do Portillo but we got out of there alive that's all that matters right Doug right Doug right Doug right Doug right Doug come on we did it0 you and me the best let's play Team there ever was party party want to see what they say now what was that explosion what explosion Evie, Evie Piece of Eden destroyed and took the lab with it the magic lump of hyperbolic metal I'm shocked simply because you have never valued the pieces does not all went according to plan oh you guys are in trouble now Joe Rogan the Assassin over here doesn't like it one bit the lab exploded Jacob you derailed a train oh he did",
            "start": 2994.52
        },
        {
            "text": "valued the pieces does not all went according to plan oh you guys are in trouble now Joe Rogan the Assassin over here doesn't like it one bit the lab exploded Jacob you derailed a train oh he did did he well the Train derailed and I happened to be on it I killed my targets they're funny I like these also no more then all in all a successful mission in spite of you two what about London what about it we're wasting our time out here true we need to get London as I do that London has been the domain of the Templars for the last 100 years this time we take to fight to the Templar they are far too strong yet patience no we're going to write for them the Templars have found a new Piece of Eden so Sir David is dead they do not know how to use it the council shall guide us Sound Advice that your father would have seconded we'll see about that I see you back in Crawley these twins man they want to get in there and tear it up I appreciate that a gentle sound of opportunity passing Us by Go Rogue so what's",
            "start": 3067.72
        },
        {
            "text": "have seconded we'll see about that I see you back in Crawley these twins man they want to get in there and tear it up I appreciate that a gentle sound of opportunity passing Us by Go Rogue so what's stopping us Assassin's Creed Rogue London is waiting to be liberated forget Crawley father would have wanted us to listen Our Father you could continue his legacy in London I like where your head future Generations from a city ruled by Templars you know Jacob Frye you might just be right huh then shall we we shall yes let's onward to London let's jump on trains don't you have possessions folks what lucky that door was open huh well there you go off to London we go just touchdown in London can we get away this weekend take you to my i'like to see what's good go into London go to climb Big Ben do other things in London hey do the funny hands red I know you've only had a taste of our latest acquisition but I want to check in on Shaun and Rebecca nobody cares about think attacking a Templar",
            "start": 3122.04
        },
        {
            "text": "Big Ben do other things in London hey do the funny hands red I know you've only had a taste of our latest acquisition but I want to check in on Shaun and Rebecca nobody cares about think attacking a Templar is a mistake I tell you what ladies and gentlemen I'm going to stop here I'm enjoying it I will pick it back up probably later on after you know the December time period uh sorry you sat on my shelf for so long sorry when we never talked about it sorry we never did a let's play but here we are right here on youtube.com/KindaFunnyGames where we put up a let's play just about every day except Tuesday when we put up this little podcast called PS I Love You XOXO which is doing pretty goddamn well um m remember it's backlog week so other folks like Tim, Nick, and Colin will be or already have depending on my let's play Post in there popping up and putting all their different games up that they have been waiting to play and miss and all these different things so come see all of our",
            "start": 3193.6
        },
        {
            "text": "have depending on my let's play Post in there popping up and putting all their different games up that they have been waiting to play and miss and all these different things so come see all of our embarrassing embarrassing games we've skipped so far recently long I know Tim's was a long time ago Nick's is really long ago but Nick you know plays nothing so whatever oh man stuff's happening oh **** oh **** indeed I guess I shouldn't have looked at this should probably stopped Agent Aosta deal with them please lots of things oh explosives are going to go off guys oh look at him go damn see this interesting too well there's plenty to play when I come back ladies and gentlemen until next time I'm Greg Miller this is youtube.com/KindaFunnyGames that's a trophy which I have a lot of and until next time it's been my pleasure to serve you in reality I hate the do I just use them for YouTube views",
            "start": 3240.56
        }
    ]
}