{
    "id": 1317,
    "video_id": "9WszBGyvAVk",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Brian Horton"
    ],
    "title": "Let's Raid a Tomb in Rise of the Tomb Raider - Kinda Funny Plays",
    "description": "Tim sits down with Rise of the Tomb Raider director Brian Horton to raid some tombs.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1446570000,
    "duration": 1142,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome back to Kinda Funny Games. I am Tim Gettys, and this very special guest, Brian Horton, director of Rise of the Tomb Raider. I'm very excited for this. We're doing a little let's play of this business. Yeah, it's it's a really great time. Obviously, the game's in the can. Teams worked very, very hard, and now it's just gravy. It's just us being able to talk to you guys, hopefully showing you a little bit more of Tomb Raider, uh, and you know, getting an idea of what's going to come out November 10th. Yeah, exactly. So by the time you guys are watching this, the game will be out pretty much a week from when this releases. So, so I'm very excited to to get into this. Let's see some tombs. Let's raid some stuff. Let's rise up and do it. Well, that's the most exciting thing, right? Because you know, our fans really wanted to see more tombs, and that's a big investment for us on this game. So this is, um, to give a little background, this is the Prophet's Tomb. It's very early in the game, and it's the first",
            "start": 0.08
        },
        {
            "text": "fans really wanted to see more tombs, and that's a big investment for us on this game. So this is, um, to give a little background, this is the Prophet's Tomb. It's very early in the game, and it's the first Tomb Lara will enter in, and it sort of sets her on her path to finding the lost city of Kitezh. Cool. So Lara's crashed, um, her Jeep was attacked by, uh, Trinity, the organization that's also looking for this lost city, and she's got to find her way into, uh, the the tomb, and she doesn't quite know where she's going at this point. Okay, we have the city of Syria in the background. It's a good looking game. Oh, thanks. Get some heat effects, I'm assuming. Yeah, well, she's she's just been knocked out. She just slid down a mountain, dizzying, and she's a little bit, uh, disoriented. She's got a little bit of head trauma, uh, and don't worry, the G she's not going to be injured throughout the entire game. She'll be okay. She's going to be okay. She's she's a strong, you know, determined archaeologist, and you just saw there",
            "start": 36.04
        },
        {
            "text": "uh, and don't worry, the G she's not going to be injured throughout the entire game. She'll be okay. She's going to be okay. She's she's a strong, you know, determined archaeologist, and you just saw there she she pulled out this tapes, um, cassette tape recorder. Who uses cassette tapes anymore? Well, her father did. Lara Croft. Oh, okay. Her father did. So these are her his recordings about the last place he found his research around the, um, the Prophet's Tomb, and she's actually going a lot further than her father actually got. Okay, so that's sort of her continuing her father's work. I love how cinematic these games are. Yeah, we really try to make sure that the player feels, um, connected to every movement that they're doing. Um, in addition to fidelity and just trying to produce a really dramatic story, we're also invested a lot in the systems of the game and things that that people love, like people love to collect stuff, right? So in Tomb Raider, artifacts and relics are extremely important. So here's here's an",
            "start": 83.68
        },
        {
            "text": "invested a lot in the systems of the game and things that that people love, like people love to collect stuff, right? So in Tomb Raider, artifacts and relics are extremely important. So here's here's an example of one of the the crosses that you can pick up, um, in the game, each one of these having a story, and Lara narrates that story as she goes. That's cool. Yeah, I love just the cam work too. So is this the Tomb in there? Well, we're getting sort of to threshold. She's she's finding evidence. She's getting closer. She's excited because she's starting to see evidence of someone carving into this mountain, um, and it's probably good evidence that she's on her way. Even just lighting effects are really nice. So we've invested a lot at this point into, um, Lara's facial animation system, uh, obviously you're seeing spline hair animation, something that we've invested in for Definitive Edition. We've we've continued to evolve that, so really make sure the fidelity of her motion and, uh, and her emotion comes through.",
            "start": 135.04
        },
        {
            "text": "spline hair animation, something that we've invested in for Definitive Edition. We've we've continued to evolve that, so really make sure the fidelity of her motion and, uh, and her emotion comes through. Camilla Luddington is returning as Lara Croft, and that was a big part of the definition of the reboot Lara was was Camilla's, um, performance. Yeah, so we wanted to bring as much of that performance through into her, uh, model as possible. So, you know, that that that, uh, fidelity of the characters was extremely important to us here. Yeah, something cool that, uh, that we saw last time when we played, when we did the last let's play of it, is whenever you see the different languages and stuff on the walls that she kind of learns the languages as she she goes, and she gets better at like deciphering what they all say and stuff, and that's part that's the introduction to the system. It's our translation system. So every mural, every journal that she picks up gives her a little bit more of an understanding of that",
            "start": 197.52
        },
        {
            "text": "say and stuff, and that's part that's the introduction to the system. It's our translation system. So every mural, every journal that she picks up gives her a little bit more of an understanding of that language. In this case, it's ancient Greek, uh, and she's finding out not only about the story of the Prophet, but it's helping increase her language skills. So it's part of a system and gives you the veneer and and the feeling of Lara as an archaeologist, like discovering these ancient civilizations. Cool. So I I have one more thing to upgrade. I'm going to do that to, uh, translate the the monolith. He his the lighting engine has been completely rewritten. The the feeling of, uh, radiosity, which is the light bounce, uh, is all been, uh, enhanced in our game. We we use what we call physically based rendering, where all the surfaces and materials are as realistic as you can possibly simulate them. The lens flare is awesome too. Cool, right? Let's go. So we try to put some of that environmental storytelling, uh, is is",
            "start": 240.96
        },
        {
            "text": "all the surfaces and materials are as realistic as you can possibly simulate them. The lens flare is awesome too. Cool, right? Let's go. So we try to put some of that environmental storytelling, uh, is is still, you know, people that just shot you and, you know, sent you careening over this edge, they're looking for you in addition to their goal, trying to find this tomb before Lara can. So now she's translating this monolith. Uh, she's she's gained enough skill points, and that gives her the ability to then seek out secret locations, uh, that she can find stuff in. In this case, we go to our map, zoom in, you can see that new icon over here, and that's going to be a coin cache. Cool. And these coins are not just there just, oh, cool, coins are cool. It's like they're actually part of an in-game economy that will be able to buy stuff later on in the game. So now if I use my Survival Instinct, it's I've marked the the location. So the Survival Instinct's the thing where, uh, you can activate it. It kind of guides you and tells",
            "start": 283.64
        },
        {
            "text": "buy stuff later on in the game. So now if I use my Survival Instinct, it's I've marked the the location. So the Survival Instinct's the thing where, uh, you can activate it. It kind of guides you and tells you the direction you're supposed to be. You need to use Survival Instincts. It's just another way for a reminder for the player or to illustrate to the player there are things in the world that you can pick up and find and interact with. But for those that don't want it, we can even disable it in the UI. A lot of people want that seamless experience, and they don't want any kind of assistance. Um, this is one of those instances where we, uh, have just tutorialized find some way to get across here. Of course, there's birds. We always got to have birds. You got to have it for the the epic entrance. Epic entrance always has to have birds and the music and the music. I'm sure she hears in her head too. Of course, who doesn't hear that that epic music? Um, but yeah, we the the artists, I'm really proud of what the",
            "start": 332.44
        },
        {
            "text": "always has to have birds and the music and the music. I'm sure she hears in her head too. Of course, who doesn't hear that that epic music? Um, but yeah, we the the artists, I'm really proud of what the artists were able to achieve, uh, in in this, uh, in this game in general, because, you know, our job is twofold. We want to make an environment that players understand and can navigate, but also something that has wonder and discovery and and that feeling like I I'm vacationing in the most extreme hostile locations in the world, and I get to do that with one of the most interesting and compelling characters, Lara. So, you know, I think they've just done an awesome job of realizing that next step for us in in fidelity and and visual storytelling. How was that dealing with such an iconic character like Lara? You know, I mean, like she has such a legacy with the old older games, but then now she's kind of beloved just for the the reboot, and, um, how is it kind of meshing those two fandoms? Cause there was a lot of",
            "start": 395.2
        },
        {
            "text": "know, I mean, like she has such a legacy with the old older games, but then now she's kind of beloved just for the the reboot, and, um, how is it kind of meshing those two fandoms? Cause there was a lot of crossover. Oh, absolutely, absolutely. It's it's one of those things where because we're telling a story of the birth of of a hero in a way, a birth of of this mythical character, Lara Croft, we had to find a way to dismantle, you know, the preconceptions of who she was and what she was all about. We wanted her to be smart. Uh, we wanted her to have some sense of athleticism, but she wasn't going to be as confident and just go in there and and no matter what happened, be successful. She's cool. Yeah, there's going to be some struggle and some learning, but in this game, we're seeing a much more confident character, you know, someone who who understands the threats that she's going to face, and she goes in there, o, open open eyes, knowing this is going to be a dangerous exercise, but I have to do it. Yeah, I'm assuming",
            "start": 435.84
        },
        {
            "text": "you know, someone who understands the threats that she's going to face, and she goes in there, o, open open eyes, knowing this is going to be a dangerous exercise, but I have to do it. Yeah, I'm assuming there will be many threats. One of my favorite things about these games is that at every turn, she is this close to death. Like it's never like she grabs a ledge, and that ledge is fine. That ledge is going to fall one second later. Yeah, you have to have, um, there has to be stakes, you know, when you have stakes like this, there's got to be some kind of threat. Yeah. And, uh, you know, we we try to make sure that these situations are as grounded as possible in the world. But yeah, it's some some people call it Lara's worst day ever, you know, and she often has to go through that, um, but she'll prevail, and the player will prevail with her, and that's what's kind of exciting. Yeah, and we do these things where you go from these big open epic spaces to these claustrophobic tight spaces, and and that is another thing",
            "start": 476.76
        },
        {
            "text": "will prevail with her, and that's what's kind of exciting. Yeah, and we do these things where you go from these big open epic spaces to these claustrophobic tight spaces, and and that is another thing that's sort of new to our franchise is really playing with that sense of scale. Yeah, and, uh, we call these our implosion moments or really emotional moments, and you can really bring up the horror, the phobias, you know, everyone has fears. I mean, that imagine that. I'm not okay with that. Nope, nope. I mean, there's not many people that's going to go willingly into a dark place with scorpions in it, spiders and yeah, scorpions. Yeah, exactly. If I saw a scorpion, I'd be like, peace, I'm done. Sorry, Dad. Exactly. It's it's it it's paying off on your, you know, your classic Indiana Jones moment here. You get the creepers, you know, you know, just it's gross, right? But it's also it's exciting too to be able to to see a place with, you know, hundreds of scorpions around it, and you have to navigate your way through it. Mhm. This",
            "start": 518.08
        },
        {
            "text": "you know, you know, just it's gross, right? But it's also it's exciting too to be able to to see a place with, you know, hundreds of scorpions around it, and you have to navigate your way through it. Mhm. This is what it's all about, right? The tombs. Uh, this is why people get extremely excited about playing a Tomb Raider game is they want to discover these ancient spaces that people haven't been to in thousands of years, you know, and that's what we wanted to deliver on in this game. Um, in addition to the graphics and and the character, you know, it's the tombs. They're the second most important character in the world is these environments, and, uh, we wanted to realize them in with a sort of ominous beauty, you know, it's there's stories that happen here. Well, that's what's cool. You walk in here, and it's like, I instantly want to know what happened. What happened, right? And, you know, you have people with spears in them. You have people with armor and people without armor, and then you start to piece together the",
            "start": 561.36
        },
        {
            "text": "instantly want to know what happened. What happened, right? And, you know, you have people with spears in them. You have people with armor and people without armor, and then you start to piece together the story. Even through these murals, you start to understand that the Prophet Trinity goes back thousands of years, and this is not something that's just a modern military organization, that they have deep roots in history, and that's what that's what that sort of what is what grounds this, uh, this adventure is, um, this is a story that goes back son. And then Lara of closing the loop was building a great Tomb at an oasis. So you get these murals, you get these journals, and they and they're a great companion to the the main narrative in the cinematic. So, you know, for the Tomb Raider fan who really wants to dig in on the explorer, you're going to find a lot of cool story just to be found in. Oh, of course, traps. Yep, there'll be traps. Yeah, and this is just an introduction, right? There was no threat in there, but",
            "start": 603.56
        },
        {
            "text": "in on the explorer, you're going to find a lot of cool story just to be found in. Oh, of course, traps. Yep, there'll be traps. Yeah, and this is just an introduction, right? There was no threat in there, but it was saying, hey, this is a dangerous. Yeah, exactly. Good gameplay design is what they say. Yeah, teach you what's to come. Exactly. Don't don't have a cheap death. Oh, this is cool. Very Indiana Jones. Okay, see, this all just looks so cool. That's what I I like so much about this this the franchise here is it's just like it's you want to play. You want to know what's around the next corner because you don't have an idea. You know, you want to have what the pull, right? You know, there's something pulling you forward, you know, and and in this situation here, we're introducing puzzles, but we want to do them in such a way that aren't a big barrier to entry. We want to teach you some concepts. So in this in this instance, we taught you that you can shoot these sort of, uh, wood blocks on the traps. Well, what if I I",
            "start": 643.96
        },
        {
            "text": "a way that aren't a big barrier to entry. We want to teach you some concepts. So in this in this instance, we taught you that you can shoot these sort of, uh, wood blocks on the traps. Well, what if I I shoot that, it's going to make this thing drop, and then you we're dealing with principles of buoyancy. You know, I I can go up to this this platform, say, oh, I won. Then you realize, oh, no, I'm not high enough. I can't I can't get up to that ledge yet. What if I could make the water rise? What if I can make the water rise? So, you know what, that's another classic throwback. Like, you know, water in gameplay and and in the original Tomb Raiders was was a huge component, but we're making this a little bit more intimate, making bringing the fidelity up, and, um, and really pushing physics as a means to to fully express that. There you go. There we go. And that's what we call a puzzle nugget. That's that's just an introduction of mechanics. Oh, man, can I can we copyright that and use that future things? Yeah, puzzle nugget.",
            "start": 696.92
        },
        {
            "text": "that there you go. There we go. And that's what we call a puzzle nugget. That's that's just an introduction of mechanics. Oh, man, can I can we copyright that and use that future things? Yeah, puzzle nug nugget. Big fan of the puzzle nugget. That's what we that's what we do at Crystals. We build the puzzle nuggets, and then that leads us into the learnings that we need to go into for the tune itself. Yeah. Oh, man, you want to see it? You want to see it? You want to see it? Yeah. Oh, that's not fun. Yeah, so there's got to be consequence, right? I mean, a lot of people say, hey, you had these gruesome deaths in the last game. Were they coming back? Yes, they are. But we're going to give you plenty of opportunity to succeed. But if you don't, if you want to, that's what's fun is kind of like even when you fail, you get something out of it. You yeah, and you and you get a learning. You're like, oh, I don't want to do that again. So I'm going to pull your mic up just a bit. We're good. I have mic management issues. Oh, I'm not going",
            "start": 737.92
        },
        {
            "text": "out of it. You yeah, and you and you get a learning. You're like, oh, I don't want to do that again. So I'm going to pull your mic up just a bit. We're good. I have mic management issues. Oh, I'm not going to die again. Oh, yeah. All right. All right. Now we have swimming. That's another thing that that we didn't have in the last Tomb Raider game, and we're introducing the concept, um, where you can sort of sprint swim, uh, tapping the B button that makes you swim faster, and there is a sort of oxygen meter that's implied by the by the UI there and just the music. What? Okay. Yeah, wow. The scope of this game is cool. I do love how it goes from like really kind of tight interiors to like these. You want to give these reveals, right? You want you want the player to feel a sense of reward once they finally get to those locations, and this is our discovery. This is where we we get to figure out how am I going to get up to the top of that? That's that's where we we, you know, beckon the player to say, all right, you've",
            "start": 781.12
        },
        {
            "text": "locations, and this is our discovery. This is where we we get to figure out how am I going to get up to the top of that? That's that's where we we, you know, beckon the player to say, all right, you've learned a few things. Now here's your goal. Figure it out, you know, and, uh, you know, we get get to do some fun dives to swim. So it's it's just going to be, you know, it this level to me as a Tomb Raider fan, as a fan of the classics, was a great level to work on because it sort of itches all of those, uh, scratches all those inches. Throwbacks and all that stuff. Throwbacks all through our modern lens. I'm just hoping that at some point we get to put a butler in a freezer. Well, at this game, I can't I can't promise that. You can't promise it, but, you know, we'll see. We'll see. Maybe next time. But, you know, in addition to tombs, I I will say the other things that for the Tomb Raider or someone who might not know a lot about Tomb Raider, you're going to see an investment that we made into our hub spaces and our",
            "start": 841.92
        },
        {
            "text": "to tombs. I I will say the other things that for the Tomb Raider or someone who might not know a lot about Tomb Raider, you're going to see an investment that we made into our hub spaces and our exploration two to three times larger than what we had in the last game. Many more things to upgrade, more challenge tombs to find. L challeng and things like Crypts to discover that aren't necessarily puzzles. You'll just as you find and you discover things, you'll enter into a cave. All of a sudden, you'll find this Crypt, you know, could it be the architect of Kitezh? You learn a little bit of story about him, and you get some XP or gold or things that are going to help you and your upgrade Lo. Yeah, earlier you kind of telling me like before we started shooting this that you can upgrade the weapons differently. You can kind of choose your play style, so it's not necessarily, you know, you just play through the game and then upgrade everything, but you can kind of really focus on, you know, using guns or using the bow",
            "start": 882.92
        },
        {
            "text": "can kind of choose your play style. So it's not necessarily, you know, you just play through the game and then upgrade everything, but you can kind of really focus on, you know, using guns or using the bow or using other stuff. Can you talk a little bit about that? Yeah, depending on your play style, like if you're a stealth player, if you're a action player, you can choose to upgrade the weapons that both that most reflect your play style. So if you if you're a big action person and you really want to make sure, you know, you make your your machine guns as awesome as possible, you can go out and find those resources and upgrade it. But if you let's say if you love the bow, you know, there's not only just one bow. You have now multiple types of bow that you can choose from, whether it be a compound bow or a recurve bow, and those have different upgrade paths that one recurve goes more towards accuracy and stealth and speed, and then the other side, the compound bows goes more to power. So depending on what",
            "start": 919.92
        },
        {
            "text": "recurve bow, and those have different upgrade paths that one recurve goes more towards accuracy and stealth and speed, and then the other side, the compound bows goes more to power. So depending on what you want to do, you can upgrade those things, and there's other skills that you can invest in. Like you can, um, you can actually craft corpse bombs, where you you have corpse bombs, corpse bombs. You have a guy that falls, right? And you take your ingredients that make a bomb, and you can, uh, craft that a bomb to trigger on a corpse. So it draws multiple enemies towards that corpse. It will go off into a smoke cloud of poison. You take out multiple guys with one with one trap. So it's like you set a trap for for the enemy. So this guerrilla combat style, this this, uh, smart smarts that we want to give Lara, these are all part of of the tool set we want to give the player to have choice in how they go about, um, reaching the lost city of Kitezh and dealing with the Trinity forces. Cool. Um, let's see. So so this is",
            "start": 954.12
        },
        {
            "text": "are all part of the tool set we want to give the player to have choice in how they go about, um, reaching the lost city of Kitezh and dealing with the Trinity forces. Cool. Um, let's see. So so this is this is a tomb right now that that we're in. So what is the the goals of the tombs compared to like the more like exploration areas? Well, we have we have what we call now nested puzzles, and the the different than puzzle nuggets, different than puzzle nuggets. So you have a puzzle nugget, right? We have all these special terms in Crystal. Puzzle nugget is teaching you the the the the, um, components of a puzzle, and then a nested puzzle just means you have smaller activities that all need to be done at different places in the room that will lead to your final result. So I'm trying to raise the water. I you saw I broke open a wall. I climbed up. Oh, I can't get up all the way. I'm going to to go find another space and find another area that I can raise the water up even further. So that's how the puzzle",
            "start": 1000.16
        },
        {
            "text": "you saw I broke open a wall. I climbed up. Oh, I can't get up all the way. I'm going to to go find another space and find another area that I can raise the water up even further. So that's how the puzzle nugget recipe works. And in this instance, um, she's going to have to raise the water up significantly with a big event, and that's what this next room is going to start to show. Cool. So those traps we've introduced that there's spike traps, two of them, two, you know, so we're escalating the the traps, and then we take some of the same ingredients that you might have saw before, but we've now introduced more complexity. So we take simple ideas like I can just I can bring this raft down. That's great, but it doesn't lead me anywhere. I'm going to have to find something else to do. I've seen these sluice gates before. I know they pour water out. Then this is the idea that this raft can be moved around through currents. So the puzzle itself just naturally progresses through physics, things that we can understand.",
            "start": 1041.48
        },
        {
            "text": "I know they pour water out. Then this is the idea that this raft can be moved around through currents. So the puzzle itself just naturally progresses through physics, things that we can understand. And I saw the sluice gate open up, but there's not enough water. So I see that that thing gets there, but I'm trying to get over to here. So I'm going to have to crack open this wall. So these are the kind of things that we don't want to solve the puzzle for for everybody. Just these are the principles, little hints, little tidbits, little tidbits. And then that ultimately will, you know, give you an idea of the kinds of puzzles that we're going to do in the game, this being a very early one. Yeah, it's really cool, man. I very excited to play this game next week coming out. Get hyped. Rise of the Tomb Raider. Thank you so much for joining us. It's great to talk, man. This has been a lot of fun. So please check that out. Leave some comments below, letting us know what you think of the tombs being back and being so so cool and",
            "start": 1086.88
        },
        {
            "text": "for joining us it's great to talk man this has been a lot of fun so please check that out leave some comments below letting us know what you think of the tombs being back and being so so cool and awesome what you think of Lara what you think about all of this and keep coming back to Kinda Funny Games",
            "start": 1125.48
        }
    ]
}