{
  "id": 1354,
  "video_id": "B6DJyJnjaRY",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Conspiracy Theories - The GameOverGreggy Show Ep. 102 (Pt. 2)",
  "description": "Colin Moriarty ponders conspiracy theories.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1447747201,
  "duration": 1479,
  "transcript_chunks": [
    {
      "text": "today's sponsor is Loot Crate for less than $0 a month. Loot Crate gives the geek in you a special treat every month. Loot Crate is a subscription box service with more than $40 worth of geek, gamer, and pop culture gear. Collectibles, apparel, comics, et cetera, delivered to your mailbox every month. This month they're bringing you a fight for the ages. Suit up, choose your allies, and enter the arena for combat. They're ready to stand their ground this month with exclusive items from Blizzard, Fallout 4, Capcom, sponsor-worthy loot from The Hunger Games, as well as a few more items that will help their winners emerge victorious. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate, and when the cut off happens, that's it, Jack. It's over. So go to LootCrate.com/kindafunny and enter the code Kinda Funny to save $3 on your new subscription. Today, Colin, what's your topic? Uh, first of all, I want to say that it's funny that Scott or um, Spectre's in the theater with all",
      "start": 0.04
    },
    {
      "text": "enter the code Kinda Funny to save $3 on your new subscription. Today, Colin, what's your topic? Uh, first of all, I want to say that it's funny that Scott or um, Spectre's in the theater with all the money it's grossing at the same time as that Jem movie, which apparently is the fourth lowest grossing wide release movie ever released. Um, there in the movies, nobody likes that Jem movie. Uh, well, to be fair, no one liked that character on Nashville either. Boom, boom. Now here's the thing, she was the most annoying character on that show. Here's first off, shut your **** mouth. Secondly, we are not, you, let's not, she was supposed to be annoying. Let's not cross our lines here. We are not talking about Aubrey Peeples, we're talking about the movie Jem. I'm not talking about her as a person or act. I'm telling her character on Nashville was purposely designed to be annoying and she nailed it. Great actress. Give her an Academy Award or whatever they give TV people, Emmys. They give them Emmys and you keep",
      "start": 40.32
    },
    {
      "text": "her character on Nashville was purposely designed to be annoying and she nailed it. Great actress. Give her an Academy Award or whatever they give TV people, Emmys. They give them Emmys and you keep talking the past tense. She's still very much active on the show. There's a very interesting storyline right now with her and Jeff. I don't want to spoil anything. Jeff the **** Jeff Fordham. Yeah, why don't they just kill that guy? Just put a **** bullet in the back of his head. He's dead. I'm sorry to break it to this way. F***, really? He did die. Yes. Did someone put a bullet in the back of his head? Did I kill him? No. Was it me? No. Okay. How die? No, tell me offline. Don't spoil it for people. Well, you already spoil it. How does he die? Don't spoil it. Nobody watching right now **** cares and you should be caught up on Nashville. It was actually Juliette going through a really hard time. She's she got post, she's got postpartum depression, so she was on a roof about to commit suicide, right? And Jeff saw it and ran over to",
      "start": 98.16
    },
    {
      "text": "Nashville. It was actually Juliette going through a really hard time. She's she got post, she's got postpartum depression, so she was on a roof about to commit suicide, right? And Jeff saw it and ran over to save and pulled her back, but then he fell. Show so **** stupid. Are you ****? I'm dead serious. I got to get back. Luke Wheeler's son saw it all, but he had been boozing. So what does he do with this information? Like the Game of Thrones. Oh, wow, wow. We all win in this one though. They Kevin put up his hand to be clear, it's better than Game of Thrones. Oh, there's there's monsters on the other side of the wall. Maybe in another seven seasons they'll get here and do ****. Uh, anyway, uh, I was just thinking recently about uh, conspiracy theories, which I love conspiracy theories. That doesn't sound like a thing you'd think about. I I like reading about them because I like reading about, I don't believe most conspiracy theories, but I but I enjoy reading about how people kind of jump to these conclusions and why",
      "start": 141.92
    },
    {
      "text": "think about. I I like reading about them because I like reading about, I don't believe most conspiracy theories, but I but I enjoy reading about how people kind of jump to these conclusions and why. There's some interesting stuff like the moon landing clearly happened, but you know, there's some interesting stuff that can be all proven false, but you know, people still go down this this rabbit hole of, you know, why they believe that the United States never went to the Moon. We went to the Moon. If you really believe that, you need to get checked. But there are some, there are some conspiracy theories that I think are really interesting, um, and some I even believe. Uh, and I was curious if there were any conspiracy theories, and they not to be necessarily like well-known conspiracy theories, but things that the record states happened that you just don't believe happened the way they said it happened. Um, and my example is the JFK assassination, which I think is like **** weird and clearly something went",
      "start": 188.4
    },
    {
      "text": "record states happened that you just don't believe happened the way they said it happened. Um, and my example is the JFK assassination, which I think is like **** weird and clearly something went happened. There was clearly a second shooter. Um, right. There's like all sorts of evidence like the government's own panels like were saying that something was off when after this happened in the 60s. Um, and we kind of just like swept it under the rug like a man just goes into a School Book Depository, goes out of window, aims at the President and just kills him for no reason. Like there's just no motive with a shot that's similar to uh, what was that, Wanted, where he **** curves the bullet. Wasn't there like some crazy trajectory **** that happened? Well, there that's why they think that there was a, you know, the shooter on the grassy knoll and all that kind of stuff. And like the way that the, because he, you know, he killed, he hit the governor in the front seat and all that kind of stuff too. And",
      "start": 224.0
    },
    {
      "text": "was a, you know, the shooter on the grassy knoll and all that kind of stuff. And like the way that the, because he, you know, he killed, he hit the governor in the front seat and all that kind of stuff too. And I don't know. So I don't want to get too deep in into the JFK assassination, but I I I've always been fascinated by that particular conspiracy theory because I believe that that there's some veracity towards that conspiracy theory, whether or not I don't know who the **** was responsible for, whether it was the mob or it was just like Lee Harvey Oswald was a crazy person, but also a really good scapegoat, right? He was a communist sympathizer. He lived in the Soviet Union. Like there's all this weird **** about him. And then Jack Ruby kills him and Jack Ruby has like mob ties and like, why, why do they kill? Why? Yeah, Jack Ruby doing America service and jumping up and killing this guy who killed the President. Like I I don't like there's just, it's just very, very weird. Meanwhile, like there's clear film",
      "start": 269.84
    },
    {
      "text": "kill. Why? Yeah, Jack Ruby doing America service and jumping up and killing this guy who killed the President. Like I I don't like there's just, it's just very, very weird. Meanwhile, like there's clear film footage of weird **** happening and there's people that were there that like swear to God that there was like a shot coming from another area in another place too. So it makes sense though. I mean, like think about it this way, if you're going to assassinate a high, you know, a high ranking public figure, why would you have one shooter? Why if it's an open car, which is ridiculous that they used to let that happen anyway. I guess learn the hard way. But like, yeah, it makes sense. You'd have, you'd have at least some backup, right? Wouldn't you have a couple people out there with a couple more sniper rifles? Yeah, that's why I think it's there's just more. Do you feel like, do you feel like Harvey Oswald took a shot though? Yeah, I think he was, I think he was in on it. Yeah. And I think that Jack Ruby someone told",
      "start": 310.52
    },
    {
      "text": "yeah, that's why I think it's there's just more. Do you feel like, do you feel like Harvey Oswald took a shot though? Yeah, I think he was, I think he was in on it. Yeah. And I think that Jack Ruby someone told Jack Ruby to kill him because he was going to talk, right? And you know, Lee Harvey Oswald wasn't alive that long afterwards. Like everyone forgets like Lee Harvey Oswald didn't get a chance to say anything really. And the only thing that it's really fascinating to watch the footage of him walking by like claiming that he's like, there's more to the story, like he's innocent and all. I'm sure he's definitely one of the shooters clearly. But why did Jack Ruby just, and what's crazy is Jack Ruby killed him on **** National TV. That's like one of the other, that's like one of the other crazy things. Everyone just saw it happen. Jack just walks up to him and **** shoots him. I'm like, this is ****, this is insane. Like how they talk Ruby into doing that? I don't know. Bad **** on him too. That was just his",
      "start": 343.76
    },
    {
      "text": "just saw it happen. Jack just walks up to him and **** shoots him. I'm like, this is ****, this is insane. Like how they talk Ruby into doing that? I don't know. Bad **** on him too. That was just his life. Yeah. Like I don't, so I we don't have to go fall down that rabbit hole, but I'm using that as an example of something where I'm like, okay, we landed on the Moon. There was probably nothing super untoward about when Reagan was almost assassinated in 1981. Uh, like all this kind of stuff. But with this, there's something about this, you know what I mean? Uh, another great conspiracy theory that I don't believe in, but you know, it's possible and there's some interesting evidences, uh, that we knew that Pearl Harbor was going to happen and and that we let it happen. Isn't that kind of substantiated a little bit by the fact that like half the or like all the all the fleet had moved out like the day or two before? Yeah, well, I think we just, the carriers were all not like all the carriers were gone. I that was",
      "start": 378.16
    },
    {
      "text": "bit by the fact that like half the or like all the all the fleet had moved out like the day or two before? Yeah, well, I think we just, the carriers were all not like all the carriers were gone. I that was actually vital to to our Navy was gone and they just sunk a bunch of old ships. Yeah, well, it's more about, yeah, there was some ship movements with the Navy, but there was more like, you know, cables being sent back and forth like indicating that like they knew and the Japanese were still in Washington like feigning, F.E.I.G.N.T., you know, like saying that they were peace talk. Yeah, exactly. Like they were, they were conducting peace talks with the the with Washington at the same time. But like there was apparently people that knew and it's all sorts of weird **** going on. But been a little pissed off. I was in another nation's capital conducting a peace talk and behind my back my **** superiors bomb that nation. I'd be like, well, I'm going, I'm dead. Well, they knew, was that wasn't behind their backs? No, they",
      "start": 414.84
    },
    {
      "text": "in another nation's capital conducting a peace talk and behind my back my **** superiors bomb that nation. I'd be like, well, I'm going, I'm dead. Well, they knew, was that wasn't behind their backs? No, they knew what they were. Oh, they knew it was going to happen. Yeah. Um, so that's just an, that's just an example. You know, Area 51, all this stuff. There's a million different 9/11, little thing that I saw that no one else saw called Loose Change. And um, it was pretty convincing. Did you like, did you like actually real talk? I did enjoy it a lot, but I was, I think I was like 15 when I first saw it and I remember seeing like, holy ****. Like, but that this is the problem is when people say things that are, do you know what this is? No. What's Loose Change? Documentary. I'm sorry. Throw the about the conspiracy theory of 9/11 of how it was all America's fault and like every, it was all an inside job. And got it. The part of 9/11 that gets me is I don't at no point, I mean, the whole, what is it, uh, jet fuel can't melt",
      "start": 454.16
    },
    {
      "text": "of 9/11 of how it was all America's fault and like every, it was all an inside job. And got it. The part of 9/11 that gets me is I don't at no point, I mean, the whole, what is it, uh, jet fuel can't melt steel beams. Like that, I'm I'm I'm fine with the jet fuel melting that and crashing, collapsing the building. Pentagon still gets me. I still think something else happened at the Pentagon. Not something else, a missile or something. I don't know. I don't know what it is. But like the worst was when they're like, all right, fine, we've heard you all. We're going to release the footage. I'm like, well, thank you very much. And they put it out like three frames and you see like something and then the explosion. Like what the **** is that? Like, you know what I mean? Like that's the whole problem of like, like there's some weirdness about what a hard shot that is to make the fact that no cars were blown off the road, that there's no like that it was a perfect thing. There was, you know, it's like, see the problem with conspiracy",
      "start": 495.08
    },
    {
      "text": "about what a hard shot that is to make the fact that no cars were blown off the road, that there's no like that it was a perfect thing. There was, you know, it's like, see the problem with conspiracy theories though, is that whenever something bad happens, every, it's like if something were to happen, no one's prepared for it to happen. So then once it happens, it's easy to be like, oh, well, how did that happen? But it if it happened, it happened, you know, like Princess Diana's death. That's another one that people talk about conspiracy theories. Okay, you know, or or um, um, wow, what you just talked about JFK. Yeah, JFK. It's like all these things. It's just like things happen. So then it's easy to kind of look at and be like, well, how did that happen? Exactly. That's the problem. That's why it doesn't keep me awake. But I feel like I feel like there's a, there's always a level of detail that the public just doesn't get. And that's I think where a lot of these the conspiracy theories start to kick in where it's like they",
      "start": 532.2
    },
    {
      "text": "feel like I feel like there's a, there's always a level of detail that the public just doesn't get. And that's I think where a lot of these the conspiracy theories start to kick in where it's like they don't, they don't release full reports on all this stuff for National Security. Maybe it's for altruistic reasons or not altruistic, but good reasons, right? Like maybe they don't want to give details out in in ongoing investigations, things like that. But that's where I feel like it starts to open up a little bit of a wedge with the public where you're like, wait a minute, how is that even possible where there is an answer for it? They just can't share that with you. Yeah. And you're like, ****. And then the crazies start to come out like me. Aliens are real. Well, the the the what the way I always gauge conspiracy theories is and why I don't believe in the 9/11 conspiracy theories, regardless of like whatever, you know, a lot of the science is weird anyway about it. But uh, is you just have to look at it rationally.",
      "start": 568.92
    },
    {
      "text": "theories is and why I don't believe in the 9/11 conspiracy theories, regardless of like whatever, you know, a lot of the science is weird anyway about it. But uh, is you just have to look at it rationally. Like simplest explanation tends to be the right one. But also like how many people are involved in the conspiracy? So for a conspiracy to be true, no one has to, no, everyone has to keep the secret. So like the moon landing conspiracy was always nonsense because that would have have involved thousands of people, including the Soviets, by the way, who tracked the **** ships going to the Moon, you know, and would have loved if we didn't actually go. They would have, they would have, they would have **** said that in two seconds. They know we went because they watched it happen, you know? So it was like the Soviets were in on it too. Like we embarrassed them, but they're in on it. Okay. And then everyone in NASA is in on it and the Executive Branch is in on it. This involves thousands of people, you know, uh,",
      "start": 607.04
    },
    {
      "text": "Soviets were in on it too. Like we embarrassed them, but they're in on it. Okay. And then everyone in NASA is in on it and the Executive Branch is in on it. This involves thousands of people, you know, uh, Kubrick in on it, by the way, as well, since he's the one, you know, is the one who filmed or who, you know, I think it was Kubrick, right? They used to say was the one who filmed. They thought, oh, the one that actually filmed. Yeah. So it's like, okay, so everyone's, so I'm like, all right, that doesn't make any sense. And now with the Moon, the moon landing conspiracies are so **** stupid now because we can like, I I've said before, you can point a **** telescope at the Moon and see the evidence that we were there. We were there whole. So like that. So, you know, the Moon doesn't even exist. Yeah, bigger. So we, so we were there. That the same thing with the with with the the Pearl Harbor one is interesting because we did want to get in and when Pearl Harbor happened, that conspiracy so much as it just as like a lack of",
      "start": 644.92
    },
    {
      "text": "there that the same thing with the with with the the Pearl Harbor one is interesting because we did want to get in and when Pearl Harbor happened, that conspiracy so much as it just as like a lack of information. Like would it be considered a conspiracy if if we let it happen? Yeah, I guess it would. It's definitely a conspiracy. It cost thousands of lives too. But it was, you know, because Churchill was the one who said like, you know, paraphrasing like, finally the Americans are going to get in because, yeah, because like we were, people forget or just don't know, like we were very neutral. Like we were chaotically neutral in during like the early 20th century. Like we did not get involved in ****. That was like, that was how it was. So there's there is cause to expect that they would need something terrible to happen and the Nazis were not going to do it. So we needed the Japanese to do it to us because the Japanese had interest. We have an oil embargo on Japan. So like they",
      "start": 683.24
    },
    {
      "text": "would need something terrible to happen and the Nazis were not going to do it. So we needed the Japanese to do it to us because the Japanese had interest. We have an oil embargo on Japan. So like they they're in a lot of trouble. And and if you guys can read, I'm not going to get too into that, but we really strangled the **** out of the Japanese economy. And they had that was their imperative. They, you know, they attacked the Philippines and everything at the same time. Um, so there's something to it. But again, I just don't believe it because of how many people must have been involved. You know, from state from the Department of Defense or Department of War to, you know, the Executive Branch, the military, everyone like was in on this, you know, like the people that were reading the radars, everyone just, you know, so like again, like it doesn't, it doesn't make any sense. But I mean, think about how many, think about how many people are sitting in the NSA right now that are privileged to to that kind of",
      "start": 722.48
    },
    {
      "text": "you know, so like again, like it doesn't, it doesn't make any sense. But I mean, think about how many, think about how many people are sitting in the NSA right now that are privileged to to that kind of information every day that don't leak, right? Like it's amazing that we've only had one gigantic massive leak come out of that organization in the last however many decades. Well, sure, but but it's different now too. Like when Snowden leaked, every he had a flee. But when when Deep Throat leaked a bunch of ****, he stayed exactly where he was because it was different. The technology was different. It was harder to track people. Dead drops were way easier to do. So, but the reason that I believe the JFK, there's something up up with the JFK is it doesn't involve that many people if like you, well, not that, but they also started killing people too. It's like that, it's like that old school first rule of assassination, kill the assassin. Like that's what they did. Yeah, literally that's what they did. He was alive",
      "start": 758.4
    },
    {
      "text": "they also started killing people too. It's like that, it's like that old school first rule of assassination, kill the assassin. Like that's what they did. Yeah, literally that's what they did. He was alive for like a day, died. Didn't Ruby die early in prison? Ruby was in prison for a while and there's all sorts of, he died I think later in prison, but he started saying some **** too. And you and and that was like the, so the reason I believe in that is like the JFK assassination, if it really happened, regard depending on who might have been responsible for it, if it is indeed a conspiracy, may have only involved a few people, you know, and an organization like say the mob, which was one of the organizations that might have, you know, is assumed to maybe have some conspir, you know, relation to it with JFK or whatever, is known to keep their secrets. So it's not like, it's not like, it's not like this involves departments of government and all this kind of stuff. This might involve an assassin, a few people. Well,",
      "start": 797.48
    },
    {
      "text": "is known to keep their secrets. So it's not like, it's not like, it's not like this involves departments of government and all this kind of stuff. This might involve an assassin, a few people. Well, wasn't one of the theories why the mob was involved with it because of the Bay of Pigs? Didn't they, didn't they utilize some of the mob's resources to go down there and then Kennedy totally **** everyone over and they were like, well, we got to kill this guy now. Or was it different? Was it, was there something else that went to it? There's like a million of them. The one, the one that the, the one that I find most convincing has to do with LBJ and and just like weird ****. Dallas being a perfect place to do it since it's in the Deep South. Um, there's some animosity towards Northern Catholics. You know, there there's a lot of like weird stuff. And I'm not, I I want to be clear that I'm not saying that it happened like this. I'm just saying that it's it's out of all these different things. This is really one of",
      "start": 836.52
    },
    {
      "text": "a lot of like weird stuff. And I'm not, I I want to be clear that I'm not saying that it happened like this. I'm just saying that it's it's out of all these different things. This is really one of the more interesting ones to me because and why I pay attention to it, why I like to read about it, just because it's the most plausible of all the major conspiracy theories that I can think of. The 9/11 doesn't make any sense to me because again, all the people involved in having like, you know, controlled explosions in the buildings, putting bombs in the buildings beforehand. Like this involves **** lots of people. Like I I just, I don't trust that no one would say anything. It's what it's, I think that there's some weird **** that happened on 9/11 for sure. I think that fourth plane was shot down like in Shanksville. I think that a fighter pilot shot that **** plane though. Yeah, but that's understandable why you wouldn't tell the public that, right? Like I don't necessarily, I mean, as we have a right to",
      "start": 875.04
    },
    {
      "text": "Shanksville. I think that a fighter pilot shot that **** plane though. Yeah, but that's understandable why you wouldn't tell the public that, right? Like I don't necessarily, I mean, as we have a right to know, but at the same time, I can imagine being put in that position as like as the President and going, you know what, the nation does not like this. We might want to wait on this one a little bit. Well, they're never going to, they'll never admit it. And but the reason that I'm I'm convinced that that happened or that that's plausible is again, because no one's involved in this decision. There's one fighter pilot, maybe a few planes, so a few fighter pilots, the people that make the decisions in the military and the Executive Branch. That's it. So it's not like saying like, go into the building a week beforehand, set the explosions. Did anyone see you? All these people are now involved. The people that sent you the orders are now involved. The people that made the bombs are involved. And now we have to",
      "start": 915.12
    },
    {
      "text": "beforehand set the explosions. Did anyone see you? All these people are now involved. The people that sent you the orders are now involved. The people that made the bombs are involved. And now we have to involve the terrorists that went that came in from Portland in Boston. Then we like, I'm like, oh, no, no, no, this is way too, this is way too crazy. After the fact happened, after the fact, it it's believable that pilots were dispatched and they shot down anything that was in the air, you know? And so and and I believe that. I 100% believe that that happened to that Shanksville plane, regardless of the story they fabricated about it, whether or not I'm and I'm saying fabricated in quotes because it could it could have happened. I mean, that was supposed to be a very like uplifting when people over. But I just don't know that that's really the case. The wreckage was spread over like too far. So then what do you think of the phone calls and such to that the people on plane made to their family? And this is where and",
      "start": 948.52
    },
    {
      "text": "know that that's really the case the wreckage was spread over like too far so then what do you think of the phone calls and such to that the people on plane made to their family and this is where and this is where the conspiracy gets complicated because then this involves more people um but there could be all sorts of like false flag **** going on during this but but again again but again think about like think about when people like our government the fact that they're running Black Ops around the world right now think about how many people are involved in that and think about how little the public knows about those things right this is an organization that the military is an organization that's supposed to be keeping secrets it's supposed to be covert it's supposed to be like there's it's not it's not founded on the tenets of of transparency with the public so I don't think it's beyond the realm of of uh of doubt that you could keep a secret of this magnitude considering when you",
      "start": 983.16
    },
    {
      "text": "not it's not founded on the tenets of of transparency with the public so I don't think it's beyond the realm of of uh of doubt that you could keep a secret of this magnitude considering when you start going back and looking at some of these like Black Ops missions that like Navy Seals did in Vietnam or even the mission to go get Osama Bin Laden I mean these are a lot of people that had to be involved in this in order for it to actually go off without without a hitch and they do so I I don't know it it's it's it's not but the Bin Laden raid is not a secret no but like it was until it happened right but it's not a secret like it happened it's it's but but there's a little bit behind that cuz a lot think it happened well well some people don't think it happened other people also think that they knew they had an idea of where he was and they were just waiting to go and get him until it was politically uh advantageous but that's a well that's one thing and also people think that like we got rid",
      "start": 1014.56
    },
    {
      "text": "they had an idea of where he was and they were just waiting to go and get him until it was politically uh advantageous but that's a well that's one thing and also people think that like we got rid of his body and there's no proof that we ever got him at all but I think I think I think I think we got him I think it would been really would popped **** no people are people are missing people are missing the forest for the trees with that one it would have been a super propaganda tool to release a picture of him dead you know so we killed him too prematurely and then we just sat on it for a while like I I always think that that's one of my weird unfounded uh theories I'm like I bet we knew I bet we found him like a month after it happened killed him and just sat on him for a while well we could have gotten him really quickly and like Tora Bora and all that kind of stuff we acted quickly enough but but uh so so it's it's it's just yeah because a perfect example like we got Saddam that",
      "start": 1054.16
    },
    {
      "text": "could have gotten him really quickly and like Tora Bora and all that kind of stuff we acted quickly enough but but uh so so it's it's it's just yeah because a perfect example like we got Saddam that **** was everywhere remember we got that how many times you see how many times did you see the shot of him like coming out of the **** hole with his hair all **** up and he's like where am I and then they showed his being hung that's yeah the video of him actually getting hanged was like really disturbing that was very disturbing um because you even it's hard to say but even like my feeling on that was like doesn't he like he's definitely a war criminal is definitely going to get executed but doesn't he deserve like due process you know like like this almost this almost seemed like this almost seemed yeah it was a a kangaroo court you know like he should have went to The Hague or something but and and I say that not as someone who likes Saddam Hussein no one likes Saddam Hussein I'm just saying like",
      "start": 1090.52
    },
    {
      "text": "seemed yeah it was a a kangaroo court you know like he should have went to The Hague or something but and and I say that not as someone who likes Saddam Hussein no one likes Saddam Hussein I'm just saying like you can't you can't terrible precedent where you know you let the people you destroy a government let his opponents try him and then just execute him like that to me I'm like that's not Justice you know like like when I saw that I'm like that's not a good look for us uh let that happen nothing to do with it but we we let it happen so but the verbiage of the president was saying around that time too was very very very like very uh very harsh where he was like I ordered the ex I mean he basically ordered the assassination of a of a another dictator which was it was very interesting to hear that it was very interesting to hear the I maybe I'm sorry I'm mixing this up with Osama Bin Laden my apologies when Osama Bin Laden was found he basically was like yes I ordered them to go in there and well",
      "start": 1127.68
    },
    {
      "text": "was very interesting to hear the I maybe I'm sorry I'm mixing this up with Osama Bin Laden my apologies when Osama Bin Laden was found he basically was like yes I ordered them to go in there and well that's different I mean that's that's anyone would have taken a shot of I'm not saying that that Saddam Hussein is a good person he's a **** awful person I'm just saying that that was a little **** up just the way that all went down the way that video was released and and uh you know I don't know it doesn't matter but the he's dead and he that's what he deserved but anyway I don't know if you guys have any any things you want to bring up cuz I know those are the ones that kind of stick out to me Roswell of course is another one but alien yeah aliens are always the ones that I that that I I'm fascinated by what did you think of the missile test then I find it highly suspect that there was a missile explosion five weeks after we found a Dyson Sphere right Kevin highly suspect highly",
      "start": 1169.72
    },
    {
      "text": "I I'm fascinated by what did you think of the missile test then I find it highly suspect that there was a missile explosion five weeks after we found a Dyson Sphere right Kevin highly suspect highly suspect Kevin no I don't know I mean you never know I I feel like all those can be very easily explained with like with they are just testing new technology that occasionally goes a right right there's always the fly in Los Angeles telling you man that's how you test it you got you got we fight over one popular cities people everyone has a camera yeah that's a great idea actually um read the story on that so what was the official word from it was war game I think yeah over Los Angeles I like hey stop doing that yeah it's not a good look there's something there's something there's definitely something up with that but that's not really a conspiracy theory I mean it is but it's not what like bad thing happens or interesting thing happens or like the Moon Landing good things happen and then",
      "start": 1207.12
    },
    {
      "text": "up with that but that's not really a conspiracy theory I mean it is but it's not what like bad thing happens or interesting thing happens or like the Moon Landing good things happen and then how can you deconstruct it to make it seem like it doesn't happen and what what is the motivation behind it obviously the motivation with the Moon Landing was huge um the motivation with JFK was nefarious but huge depending on who you cons who you're talking to and what the motivation was that's why it's so interesting to read Because and that's why one of the things that works against the JFK Assassination is that being anything more than just a crazy person in a building is that there's just way too many motives for way too many groups and so like who is it who was it you know and uh but out of all of them if I if some if someone were to like lay out 10 of these things or all the ones we've talked about today and said like which one is the one that was **** not the way they told it I would be",
      "start": 1254.72
    },
    {
      "text": "of them if I if some if someone were to like lay out 10 of these things or all the ones we've talked about today and said like which one is the one that was **** not the way they told it I would be JFK Assassination oh yeah 10 out of 10 times so here's a question then we've talked about ghosts on this show we've talked about aliens we've talked about Bigfoot I mean not this episode but the show right all the time and I talk about how much I used to love those shows about uh all these paranormal and things d d but how technology and the camera and the video and the YouTube and the live streaming have crushed all that I don't know about you like 9/11 seems like it was yesterday to me but in reality in terms of technology it was a lifetime ago because of where we are our conspiracy theories at least in the way we're talking about them right now thing of the past like right because I don't believe I don't I don't think there's like a conspiracy for 9/11 necessarily I don't know I want to",
      "start": 1292.72
    },
    {
      "text": "at least in the way we're talking about them right now thing of the past like right because I don't believe I don't I don't think there's like a conspiracy for 9/11 necessarily I don't know I want to know more about the Pentagon I want video footage of what happened at the Pentagon right well what is the motivation for bombing the Pentagon I mean no that's what I'm saying is I don't I've never thought through this theory I think something weird happened there I want to know why something weird happened there but but what I'm saying is like now if that was to happen there'd be 14 different angles of it right when that **** uh jet a few years ago bottomed out at SFO I was like well just going to wait for the footage and sure enough some random guy was on a hotel balcony shooting planes landing and had the whole crash on you know what I mean like it seems like you can't get away with anything anymore there be there'd be footage everywhere I think there though it's then it's the is the",
      "start": 1335.32
    },
    {
      "text": "and had the whole crash on you know what I mean like it seems like you can't get away with anything anymore there be there'd be footage everywhere I think there though it's then it's the is the video fake or not I think that's the new conspiracy theory of what's real when everyone has cameras and everyone has After Effects you know yeah Nick let's make a fake video but we make fake videos every day but I mean a good one okay I think we made one last night okay yeah um yeah I don't know I don't know may I don't waste a lot of time thinking about conspiracy theories because I don't research things to begin with so I really have no knowledge base period but yeah I mean I think that there is there is something to be said when there's a gigantic fireball in the sky there's got to be a little more to that I think it's natural curiosity it's like even if it was a military think what the **** going on yeah what happened I mean I enjoy conspiracy theories because the people that get",
      "start": 1370.8
    },
    {
      "text": "little more to that I think it's natural curiosity it's like even if it was a military think what the **** going on yeah what happened I mean I enjoy conspiracy theories because the people that get really into them like they're **** whack jobs in the best way where like they get so into it and they have such like proof and evidence and they're just like how come this **** happen like the questions the questions are always like you're right you sit there you're like there is a great point why would that be but it's like the problem is you can adapt it to literally anything so going back to Loose Change a couple years ago the guys made the I forgot what it was called but the the Star Wars Loose Change oh those guy okay I know what you're talking about they took Loose Change but then applied it to the star and how the whole thing was a conspiracy theory and that's **** hilarious cuz everything they said was right what was it called Luke's Change which is amazing that's really",
      "start": 1412.2
    },
    {
      "text": "applied it to the star and how the whole thing was a conspiracy theory and that's **** hilarious cuz everything they said was right what was it called Luke's Change which is amazing that's really funny um but yeah like that video is so funny because it is the same as any of the conspiracy theory things except just about something that's made it believe make believe I was going to say made up make believe got stuck in there it's okay it happens best to us things get stuck in places all time oh yeah like last night okay that was stop it with the Bas",
      "start": 1444.6
    }
  ]
}
