{
    "id": 1341,
    "video_id": "fTjo1WjeBYY",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Reviewing Our 20s - The GameOverGreggy Show Ep. 101 (Pt. 3)",
    "description": "Nick Scarpino wants to know what we think about our 20s.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1447228800,
    "duration": 1201,
    "transcript_chunks": [
        {
            "text": "today's sponsor is Loot Crate for less than $0 a month. Loot Crate gives the geek in you a special treat every month. Loot Crate is a subscription box service with more than $4 worth of geek, gamer, and pop culture gear, collectibles, apparel, comics, etc., delivered to your mailbox each and every month. This month they're bringing a fight for the ages. Suit up, choose your allies, and enter the arena for combat. They're ready to stand their ground this month with exclusive items from Blizzard, Fallout 4, Capcom, sponsor-worthy loot from The Hunger Games, as well as a few more items that will help their winners emerge victorious. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate, and when the cut off happens, that's it, Jack. It's over. So go to LootCrate.com/KindaFunny and enter the code Kinda Funny to save $3 on your new subscription. Today, Nick, yes sir, what's your topic? So Greg, I'm not young anymore. No, no, no, no. It's time we told everyone, don't put down",
            "start": 0.04
        },
        {
            "text": "and enter the code Kinda Funny to save $3 on your new subscription. Today, Nick, yes sir, what's your topic? So Greg, I'm not young anymore. No, no, no, no. It's time we told everyone, don't put down the mask. Time we told everyone, I'm midway through my 30s, and it's making me look back on my life, and now I think I have enough distance for my 20s to really like, you know, examine them, dare I say, even review my 20s. Oh, you're going to review them? So I want those of us that are out of our 20s to go back. You want me to go away? No, I need more water. You can give us kind of, you can give us sort of whatever input you think is valid. Okay, I can review into this. You can review your mid-20s, your your halfway through your 20s. Uh, but I want to go because because I look back in my 20s and and they were very, very opposite sides of the spectrum. My early 20s, I was at a school that I wasn't particularly enamored of. I was super overweight and I had no career prospects. Then flash forward to my my end of my 20s, I",
            "start": 37.08
        },
        {
            "text": "opposite sides of the spectrum. My early 20s, I was at a school that I wasn't particularly enamored of. I was super overweight and I had no career prospects. Then flash forward to my my end of my 20s, I got a great job, I'm on my way to being married, and we're on the way to starting this business. Might have been a little early for the business, but we're on the way. So it's very fascinating. I don't know, I just wanted to ask, open that up to you guys, like what do you think overall of your 20s? Were they were they the best decade? Because I actually think that my 30s have been better in almost every way, shape or form already than my 20s. Okay, I see the question. That's kind of where I'm angling toward because I'm as I'm approaching lucky number 40, I think I'll look back. How far how far out are you? Five years out? Yeah, four years out. I'm almost 36 in January. Okay, so that's what I'm thinking, like when I look back at my 30s, I'm going to say without doubt, knocked, I love that decade. I knocked it out of the",
            "start": 100.84
        },
        {
            "text": "years out. Yeah, four years out. I'm almost 36 in January. Okay, so that's what I'm thinking, like when I look back at my 30s, I'm going to say without doubt, knocked, I love that decade. I knocked it out of the f***ing Park. But my 20s, I'm like, 'Eh, I got a lot of regrets for my 20s.' Regrets? Yeah, things that I wish I could go back and redo. And I know everyone's always like, 'No regrets,' and that's true. I mean, I like the person I'm at right now, but let's be honest, everyone's got something they go back. You're f***ing real. That's real life. Yeah, you ever see that guy's the tattoo? So good. That would've been me. That's why I don't get tattoos. I like, 'I think it's spelled right. I think beautifully spelled with eight E's.' See, the you're asking is that you led with is was the best decade of your life, which is is hard to answer. Now I'm 30, so I'm into my my third decade of life here or whatever. And so like, I you can't rate this is this currently the 30s would be a review in progress, which we've never done on The GameOverGreggy Show, so I'm not",
            "start": 142.08
        },
        {
            "text": "now I'm 30, so I'm into my my third decade of life here or whatever. And so like, I you can't rate this is this currently the 30s would be a review in progress, which we've never done on The GameOverGreggy Show, so I'm not sure how to put that on the scale, the patented 10-point scale. Uh, I mean, like the 20s were definitely better than my 10s to 20s. Yeah, you know what I mean? Like high school sucked. School sucked. Yeah, you know what I mean? Like there was great parts obviously, but that's the problem, there's so much sweet and sour to everything. You know what I mean? Right now I would say my 20s were in terms of like on the scale, I would say probably were better than my 30s right now, maybe. I don't know. But I I think it's 'cause I'm in the weeds with my 30s right now, and so it's the the negatives that stand out to me, right? The stress of the business, like making sure all this stuff happens. I think I had more friends back then. Maybe I didn't. Maybe I had more acquaintances that I was close, I was around, right? But like this",
            "start": 184.24
        },
        {
            "text": "the stress of the business, like making sure all this stuff happens. I think I had more friends back then. Maybe I didn't. Maybe I had more acquaintances that I was close, I was around, right? But like this whole business and leaving everything definitely like changed my perception of friendship and who my real friends are. Do you think that's the business or do you think it's because like I remember distinctly having a much active, much more active social life in my 20s, but I just don't have energy for that anymore. I still all my friends are still there. I could call people up and be like, 'Let's go into a loud bar next Saturday night and try to scream at each other,' or I could eat frozen yogurt and watch Arrow, right? No, I hear you. No, there's part of that for sure. I mean, it's I've always found it interesting the older I got, right? And I guess it's more like in in college, right? Which is, you know, the end, the beginning of my 20s there, you know, or whatever, when it ramped up for you. Exactly. And even I",
            "start": 229.96
        },
        {
            "text": "the older I got, right? And I guess it's more like in in college, right? Which is, you know, the end, the beginning of my 20s there, you know, or whatever, when it ramped up for you. Exactly. And even I guess when we first started at IGN, right? Like when we were all like that, like M, the hive mind, we all had the same interest. Like, you know, Friday would end, we'd all go to the movies at the Metreon, and then Saturday we'd go drink somewhere, and then we'd go do this. You know, we'd all hang out in these groups or these clicks. It's fun to see. It's been interesting to see like now it's like, yeah, we get to Friday and like if somebody's doing something on Friday, I'm like, 'F*** these people! What the f***? God damn it! I don't want to drive into want to be.' You know what I mean? Like, but that's this weird thing for us. I feel like that especially with when we're in convention season, right? That we live our social life during the day all the time around these things and stuff. So then when it gets to a Friday or",
            "start": 266.64
        },
        {
            "text": "us, I feel like that especially with when we're in convention season, right? That we live our social life during the day all the time around these things and stuff. So then when it gets to a Friday or Saturday where there's not a trip to go on or something to do or a work event, that it's like, 'Well, f*** it, I just want to sit here and play video games,' and I'll get really cranky if I'm not allowed to, even if it is to go to somebody's wedding, if even if it is to go to some something. Know you're getting there, right? Yeah, I mean, that's but like, but I remember like, you know, in in in in college and then when we started to hear like if you weren't doing something on Friday, Saturday was like, 'What's going on? Like, am I sick? Who's sick? Why wouldn't I want to go out and do something? Did I die that no one told me?' Right? Yeah, I feel like I feel like you just you're just a lot more focused in your 30s. That's what I'm enjoy. Sure. No, I mean, we're super focused on what we're doing right now, and that's the thing. But I",
            "start": 301.16
        },
        {
            "text": "right? Yeah, I feel like I feel like you just you're just a lot more focused in your 30s. That's what I'm enjoy. Sure. No, I mean, we're super focused on what we're doing right now, and that's the thing. But I don't know if that's necessarily good or bad. No, I it's definitely good. I I'm definitely I'm I'm not of the mind that, you know, we're going to look back in our 40s and like, 'Oh man, why did we work so hard in that business?' Or what, you know what I mean? Like, no, like I like, but I mean, like I don't know, like I don't hang out with as many people anymore, right? But it goes both ways that I don't call them and they don't call me. So it's just like one of those things like, 'Oh, we were acquaintances, not friends.' That's interesting. You know what I mean? Like that's not a real thing. Yeah, I mean, I have really good friends though that I still just don't see anymore. Like people have kids, people have wives, people have like, you know, they have they have different types of lives than we used to have when we would",
            "start": 337.24
        },
        {
            "text": "friends though that I still just don't see anymore. Like people have kids, people have wives, people have like, you know, they have they have different types of lives than we used to have when we would all band. Like when I was Tim's age, I would be at I would be thinking about the comic club right now. No, that's and we would all be there in that booth Saturday night trying to hit on whatever walked through the door. That's why I'm talking about why it worked back then, right? Is that you all were like-minded in the exact same situation. You know what I mean? You moved here, you didn't some people had a girlfriend, somebody didn't. But even if you had a girlfriend, they were like down to go to Itty Bitty and Boozy's at 9:30 on a f***ing Thursday. You know what I mean? And get f***ing destroyed and pet a cat all night long. That weird cat. Like, I mean, like I always talk about it, like, you know what I mean? Like I remember a random I remember a random Sunday one day when we were I was living downtown in the high-rise",
            "start": 369.56
        },
        {
            "text": "long that weird cat. Like, I mean, like I always talk about it, like, you know what I mean? Like I remember a random I remember a random Sunday one day when we were I was living downtown in the high-rise so early in the IGN career where I was just like, 'I feel like getting drunk in the middle of the day,' and I called Ostrager. I'm like, 'What are you doing?' And he's like, 'Nothing.' I'm like, 'You want to come drink?' He's like, 'I'll be there in 10 minutes.' I'm like, 'All right.' That's how life was, right? Now, you know what I mean? Like you that's how it worked. Can't do that now. He's got a wife and a kid living in Texas. It would take him a little longer than 10 minutes. Exactly. He ruined he ruined he'd come though, he would come. Now I don't know. I feel like the the decade of the 20s was about the big group. We have this huge group of friends, we're all going to do this or that or the other. And now I feel like so far the 30s are very much like, 'It's a small, it's Colin and I, let's go to dinner tonight and do that,' or I'm",
            "start": 404.8
        },
        {
            "text": "huge group of friends, we're all going to do this or that or the other. And now I feel like so far the 30s are very much like, 'It's a small, it's Colin and I, let's go to dinner tonight and do that,' or I'm going to reach out and try to touch base with somebody I haven't touch base with in a while and go hang out with them or do that or whatever. And then having you here every day. Yeah, I the acquaintance thing is really interesting. I mean, well, first off, talking about my 20s, best thing ever. But I definitely out of 10, so far, 10 out of 10. I mean, for sure, it's like I feel like every year of my life has been better than the last. Like more bullshit's happened, like s*** happens, bad things happen, like a lot of bads happened. But every year I'm getting closer and closer to things being better and better and better. And through that, I've kind of weeded out the people, the acquaintances and whatever, and I've never really been like a big friend group type of guy. I've always been more like, 'I really like this person. I",
            "start": 437.88
        },
        {
            "text": "through that I've kind of weeded out the people, the acquaintances and whatever, and I've never really been like a big friend group type of guy. I've always been more like, 'I really like this person. I want to spend every waking moment with this person,' whether that's f***ing Kevin or like all my other friends. And like I've had my same group of friends, and since I haven't really moved or whatever, like it's my click is my click, right? And there's been members added to that click. And I think that throughout, you know, my my teens, like my pre-teens and then teens and then early 20s, those groups of friends never really like meshed. And then now in my 20s, it's finally that thing where everyone else is weeded out and all those people have weeded out their s***. So now it's just like this core group of people coming together. So now Kevin's hanging out with my friends from high school and my friends from middle school and Nick and all these people, and we could all be together. We just drove down to LA",
            "start": 478.72
        },
        {
            "text": "coming together. So now Kevin's hanging out with my friends from high school and my friends from middle school and Nick and all these people, and we could all be together. We just drove down to LA with Sean Finnegan, Kevin Coello, me and Nick. That's like such a random group of people, but now that's not random at all. Like that's Bros, you know? So I feel like I've just become better, at least more how I want to be, and 20s been f***ing awesome. I still got a couple years left. Like I can't see things going down. No, 20s are awesome. Yeah, going to be better than that. I'm with you that yeah, year year over year it gets better and better, right? That's just 'cause you become more adult in a better, comfortable situation. You know yourself, you know your group, right? But it's just an interesting thing of looking back at like I think look back at 20s and I think these crazy rock band things at IGN or the antler parties or this or M, you know what I mean? Like all these different things, whereas like so far the 30s",
            "start": 518.12
        },
        {
            "text": "at like I think look back at 20s and I think these crazy rock band things at IGN or the antler parties or this or M, you know what I mean? Like all these different things, whereas like so far the 30s have been this, which is great, don't get me wrong. Like I love Kinda Funny, obviously. I love hanging out with you guys. I love traveling the world with you and seeing the best friends and stuff, right? But it's different. I don't know. I don't know if I'm I'm expressing I mean, and you know, we last week we were talking about Nostalgia a lot. I think this kind of feeds into and I I've really reflected on that topic and I was thinking about it a lot because I was like, 'Man, like why am I so positive about it when I feel like overall it was a negative thing?' And I was like, 'It's because,' and me and Kevin even talked about it, 'it's like we've constantly been trying to just make things better and it's like the things that we love, we just carry them and we just keep going.' And it's like we look back at that, but",
            "start": 557.0
        },
        {
            "text": "about it, it's like we've constantly been trying to just make things better and it's like the things that we love, we just carry them and we just keep going. And it's like we look back at that, but then we also look now in my life, I'm like, 'This is great. There's not a day that goes by that something doesn't happen where I'm like, 'I love my life.' Like this is so weird.' And uh, it's f***ing awesome. And I think another thing that for people that are in their 20s right now that's a little bit different is the fact that we grew up with technology and we grew up with um, instant messaging. Like from the time that I became a real person, so like 13, when like the people that I met became, you know, my friends that I'm going to have, and I'm not just like someone learning how to read and all that s***. Like at any moment I could message people, you know, and we'd be that was what I wanted to do. You got every single one of us with that. Yeah, but it's like talking talking to to people at all times, right? I get off",
            "start": 590.68
        },
        {
            "text": "moment I could message people, you know, and we'd be that was what I wanted to do. You got every single one of us with that. Yeah, but it's like talking talking to to people at all times, right? I get off of school and it's like, 'I want to talk to you,' and so we'd AIM or it's like, 'I want to talk to you,' whatever. And then as things progressed, now that's what text messages are, and you just text your friends. So even though a lot of my core friends have moved on to like going to grad school and at f***ing Yale and like all this s***, living different lives, or like going down to LA for uh, med school. So my core group of friends that I have here, I have here, but the ones that have left, I feel like I'm still very close to them because we talk all the time, whether it's text or whatever. And so it's like all the other people I don't need to go hang out at bars with anyone. Yeah, because I don't like that s***, you know? Yeah, I feel like you just naturally eventually drift away though from people. Yeah, that's what",
            "start": 629.92
        },
        {
            "text": "other people I don't need to go hang out at bars with anyone. Yeah, because I don't like that s***, you know? Yeah, I feel like you just naturally eventually drift away though from people. Yeah, that's what happens. They drift away from you, you drift away from them, and it just happens. They the cut. It's not the cut. I mean, I have friends that I I I every once in a while I'll hop on the phone with after a year haven't talked to. I'm like, 'S***, I forgot how great of a relationship we used to have, and this is really fun catching up with you.' And then a year goes by and I don't talk to him again. That's not getting the cut then. That's just them like that's just that relationship. I mean, I never cut. I don't think guys ever cut anyone. I see women. I feel like my I feel like I've seen my wife cut people before. Like literally like strike them time people get the cut really. Oh, for sure, man. I don't got time for s***, man. I like investments. Oh, see, I don't mean like I mean, yeah, I've actually seen my wife break up with",
            "start": 664.92
        },
        {
            "text": "like strike them time people get the cut really. Oh, for sure, man. I don't got time for s***, man. I like investments. Oh, see, I don't mean like I mean, yeah, I've actually seen my wife break up with girlfriends, and that's not as sexy as it's supposed to sound. She has friends who are who are female, and they have had falling outs, whereas I feel like guys just go like, 'I'm just not calling that dude anymore.' Call if I don't call him or text him back, then it's just going to end. They take care of it's on his own. I don't know. To to sort of wrap this up, I'd give my 20s seven out of 10. Wow. Yeah, my 30s I think are nine. It's a review in progress, but I think 9 out of 10 so far. See, that's why I don't want to do it though, is and that's why I mean, I have incomplete information. Six years in, 30s are great and amazing. I mean, but I think my 20s were amazing too. Yeah, they were different kinds amazing. You're not going to give a score nine really? Yeah, good for you. I had a great time. I lived. I enjoyed",
            "start": 703.36
        },
        {
            "text": "great and amazing. I mean, but I think my 20s were amazing too. Yeah, they were different kinds amazing. You're not going to give a score nine really? Yeah, good for you. I had a great time. I lived. I enjoyed myself. But it was like, you know, the it was a little bit of everything. Like I'm an adult now, right? I didn't feel like an adult in my 20s back then. You know, this entire decade, right? And you look back and you definitely weren't an adult, a child. Yeah, and it's like you wish you could go like back to the Nostalgia topic, right? Of like you wish you could go back and tell I could tell myself like, 'Appreciate this day in college where all you have to do is go to one class and then play NCAA Football with Reese all day.' You know what I mean? Like that's not normal. Yeah, those are good days. Except for when you do it on a Twitch stream, probably your friends. That's true. Also, NCAA Football won't be there past Greg, so enjoy it while it's run. Mine gets a 10. You go 10 out of 10 straight up 10. I mean, I'm I'm not done",
            "start": 748.72
        },
        {
            "text": "do it on a Twitch stream, probably your friends. That's true. Also, NCAA Football won't be there past Greg, so enjoy it while it's run. Mine gets a 10. You go 10 out of 10 straight up 10. I mean, I'm I'm not done with it, but like I can't imagine anything happening that would make it any worse than my teens at all. Like I remember a distinct moment when I was 19 when I was like, 'This is the best year of my life.' Like I it's the biggest year of my life. I got my first real girlfriend. I lost my virginity. I got my first real job. I got my driver's license in a car. Like all of those things. Yeah, okay, those are I was late in a lot of things just um, but I was like, 'I this is huge. Nothing will ever be bigger than that.' In the past nine months alone, everything everything's been bigger than that. So it's like cool. And I'm expecting much bigger things to happen in the future. So it's like 10 out of 10. How do you rate your your 20s? I don't know. It depends on it depends it depends on where I am. Like 20, 21, it's an 11",
            "start": 783.36
        },
        {
            "text": "expecting much bigger things to happen in the future. So it's like 10 out of 10. How do you rate your your 20s? I don't know. It depends on it depends it depends on where I am. Like 20, 21, it's an 11 out of 10. Like my days at Northeastern were f***ing awesome. And I've been reflecting a lot about those days recently. And and uh, I miss those days a lot. Um, and uh, when I came here 2007, I would say it started to go down a little bit. But it I mean, I I professionally everything's great. I mean, in my 20s everything professionally was on the up and up. But you know, it's like it's the same real talk I had with my Nostalgia topic where I'm not going to sit here and like paint the rosy picture. Like I I there are things I regret. There are decisions I regret. There are there's time that I I wish I had back. There's um, I'm never going to get my 20s back. And and uh, so I think that, you know, there there's been dubious some decisions. I don't want to say like a series of dubious decisions because that's not true at all. But",
            "start": 829.88
        },
        {
            "text": "um, I'm never going to get my 20s back. And and uh, so I think that, you know, there there's been dubious some decisions. I don't want to say like a series of dubious decisions because that's not true at all. But a series of dubious decisions. The Colin story. I'm writing that down right now. But uh, no, I said my my my my life story was going to be called the series of trivial events. I like dubious decisions. Uh, but uh, you know, I've been reflective more lately in my 20s, and I'm not sure that I I did everything that I wanted that I should have done the right way. I think that, you know, I stopped being as social. I used to be, you know, people look me as like a hermit and stuff like that. But I was the fact of the matter is, and I think Greg and Nick know this version of me a little better. I used to be very social and like very um, not like social butterfly or bubbly, but I was like really out there. Like I was one of those people Greg could call and and we would drink or I, you know, I I've known Nick for a very long time. And uh,",
            "start": 875.44
        },
        {
            "text": "not like social butterfly or bubbly, but I was like really out there. Like I was one of those people Greg could call and and we would drink or I, you know, I I've known Nick for a very long time. And uh, I've had on many a girlfriend of yours, I know. Not not only one girlfriend, but multiple multiple. Um, that's how long I've known Nick. So it's it's uh, so it's um, it's one of those situations where I I just, you know, I'm not the same that I used to be. And I think that that's that's normal. But at the same time, like I don't I don't like that I become more jaded. I don't like that I become a little more complainy. And like those are things I'm just very self-aware of, and I'm not quite sure why it happened or when it happened or how it happened. I've always I would love to see a bubbly Colin. I mean, when I was 23 or 24 years old, I was like a a kind of a partyer. And and I don't know that you were ever bubbly. No, no, that's what I was saying. I wouldn't call a bubbly. No, but I was I was definitely very social",
            "start": 919.64
        },
        {
            "text": "23 or 24 years old, I was like a a kind of a partyer. And and I don't know that you were ever bubbly. No, no, that's what I was saying. I wouldn't call a bubbly. No, but I was I was definitely very social and like always out. I mean, you know, and hanging. I mean, that's how I got to know Nick back in the day. I've known Nick since I was like 20 years old, 21 years old. So it's it's it's, you know, yeah, we did. We drank a lot. And that and and I think part of it was what Greg was saying was that that group of friends, um, Dave and Eric and Nate and Charles are still here. But like we don't we don't, you know, in sync. Like these guys are still here. But like we were all together together. And so I think we all hyped each other up and got out there. Ty and Brennan and, you know, there's a lot of just we all came up together in some respect. And I think that was part of it. I think that otherwise life would have been a little more mundane and normal, um, even back then. So I think that my days in Northeastern were awesome. But",
            "start": 955.56
        },
        {
            "text": "in some respect and I think that was part of it I think that otherwise life would have been a little more mundane and normal um even back then so I think that my days in Northeastern were awesome but um and I miss them a lot and I miss those people a lot but um I think that my 20s kind of you know were okay in terms of a in ter from a social ramification from from different perspectives professionally they were very successful I want my 30s to be a I'm 31 now and I want my 30s to be a little bit different I'm trying kind like seize the bull more by the horns and make the decisions that I need to make to like make myself happy yeah and not just keep the status quo and not just go along with the ride anymore because I'm kind of I feel like I've wasted a lot of time and ways in my life that I um that I'm very self-aware of right now and it's not like necessarily major ways but just things that you can't you know time is f***ing precious you know and I'm trying to become more aware of",
            "start": 993.64
        },
        {
            "text": "I um that I'm very self-aware of right now and it's not like necessarily major ways but just things that you can't you know time is f***ing precious you know and I'm trying to become more aware of that that's why I'm not like trying to be up you know necessarily be up video games ass all the time and not trying to like you know trying to like spread my time around and and talk to people and go out like we were talking about keep keeping up with their friends the fact of the matter is and I've told Greg this like I have schedule on the schedule like just meetings that I have with my friends at night like my my friends Chris and Sarah I go to I go to I go to dinner with them every other week just to make sure that we see each other and try to be more active in that way so that I can you know so that I can you know find uh so that when I'm 40 or 41 that I don't I don't look back at my 30s and been like well another wasted f*** you know not a waste but another decade that could have",
            "start": 1030.44
        },
        {
            "text": "know so that I can you know find uh so that when I'm 40 or 41 that I don't I don't look back at my 30s and been like well another wasted f*** you know not a waste but another decade that could have been better that I don't want to look back and be like I I wish I made all these engineering tweaks to my f***ing life at that time I want to be like you learned from your 20s and and uh made things better and more productive but that said that's a very f***ing shitty way to look at it because you know my 20s were also very positive in a lot of ways I you know I made myself in my 20s and I'm really proud of that you know so it's I don't think it's a bad way look it I think it's good because it all it's saying is you want those to be better yeah I definitely want it to be better like yeah if if like you was you know 2004, 2005, 2006, 2007, like these were 2008, I mean these were great f***ing years, 2009 and 2010, man you know like yeah things really changed when you know when I became",
            "start": 1066.72
        },
        {
            "text": "like you was you know 2004, 2005, 2006, 2007, like these were 2008, I mean these were great f***ing years, 2009 and 2010, man you know like yeah things really changed when you know when I became more we were talking about adulthood and I was like the older I got the more things became serious and the more things changed and the more in my head I became and the more f***ing neurotic I became and the more nervous I became and it's like f*** man like I got to get this s*** under control in a lot of different ways so that's just me being real I think that's one of the things about yeah like looking back and looking forward right now right it's like right now I'm in the middle of the my 30s and trying to figure things out like doing work right now like on myself personally right in my relationships and my friendships and stuff like that and so then right now I'm I'm underneath the hood of the car tinkering on the car whereas I can look back at the 20s and they finished car right you",
            "start": 1102.32
        },
        {
            "text": "and my friendships and stuff like that and so then right now I'm I'm underneath the hood of the car tinkering on the car whereas I can look back at the 20s and they finished car right you know exactly what they look and how where the dings were or whatever but like right now it's this decision of like man who do I need so who are my real friends how do I spend time with them what does that mean if they live far away how do you know what I mean like what do you do with all that information a work in progress Tim you'll understand one day yeah I understand you don't understand right now f***ing sex goddamn time I got s*** figured out until you guys have a Kevin you don't understand like we have Kevin he's Kevin yeah I know but we have Kevin Kevin raise your hand there he is but put no raise the other one and put it in front of the camera so people see that there look at that f***ing stupid ass watch he wears Kevin doesn't even get the right emails anymore can't even do it anymore Google text",
            "start": 1140.64
        },
        {
            "text": "the other one and put it in front of the camera so people see that there look at that f***ing stupid ass watch he wears Kevin doesn't even get the right emails anymore can't even do it anymore Google, text hey Google, text Paula, we're over. Send. one day I'm going to get it one day I'm going to get it",
            "start": 1176.52
        }
    ]
}