{
    "id": 1340,
    "video_id": "IjIyn0s4NoY",
    "show_name": "Gameplay",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "Call of Duty: Black Ops III Zombies with Colin Moriarty - Kinda Funny Plays",
    "description": "Colin's back from more Black Ops III, but this time, he wants a piece of the undead.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1447261201,
    "duration": 1304,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, welcome to Kinda Funny Games. My name is Colin Moriarty. Today I wanted to play Call of Duty: Black Ops III campaign for you, and we'll get to that maybe in another Let's Play. I think we will, but it's not installed yet on our machine. As you can see here, it says it's still installing multiplayer, so it seems to be installing the things in order of their pertinence. It'll probably get the campaign last, but as you can see here on the menu to the left, Zombies is available, so let's just jump into Zombies and see what happens, shall we? All right, so let's look at the maps here. That's all I have. Shadows of... I have no choice, Kevin. I have to play Shadows of Evil. Gobblegum? I don't even know what the **** that means. What is this? All right, I don't care. Weapon Kit. All right, let's... I'm just going to jump in and see what happens. We're going to play local. I'm just going to play by myself and we'll see how it all goes. Of course, one of the things that people love about Treyarch Call of",
            "start": 0.2
        },
        {
            "text": "just going to jump in and see what happens. We're going to play local. I'm just going to play by myself and we'll see how it all goes. Of course, one of the things that people love about Treyarch Call of Duties, um, generally is the Zombies mode, and you're going to get that here in Call of Duty: Black Ops III. So let's see how it goes. Let's see if I can survive. Of course, I'm gonna have to hit the start button at some point, go into options and invert my controls. I hope you're patient with me while I do that. This guy seems scared. I can't really hear it. I'm gonna put it up a little bit on my TV. Oh my goodness, what in the hell? Oh man, it's getting real in this. Oh dear, scissors. That's not going to... Oh my God, oh no. Oh, okay, well that happened. Now this guy's smoking a cigarette. Looks good. Mayor cracks down on police corruption. Bad news for you, Kevin. Little bit of poola. There's like a whole story here, and you know, I don't know if I know if I care. You know, I mean, that's the thing about it is I don't know if",
            "start": 38.08
        },
        {
            "text": "police corruption. Bad news for you, Kevin. Little bit of poola. There's like a whole story here, and you know, I don't know if I know if I care. You know, I mean, that's the thing about it is I don't know if I care. Let's see. Now this guy's wrapping himself up. He doesn't look happy. Got his brass knuckles. Oh, now he's boxing. What is... what? It's just like non sequiturs here. Are these the people that you're playing as? I guess. Are these your characters? I don't know anything about it. Damn, that was like some Tiger Uppercut **** right there. He dead. Killed him. All right, I've seen enough. I'm hitting the X button. We're going in. You bear the Mark. You are cursed. All right, I got to hit the... I got to go into options. Let's see. Graphics, audio, network, controls. Oh, that was all right. Perfect. There we go. That's nice. All right, here we go. That's some smooth jazz. What is this? Do I kill it? I don't think so. I don't kill it, Kevin. Can I... can I go in there? What is this? Hold to become the Beast. Do I want to do that, Kevin? You must",
            "start": 102.8
        },
        {
            "text": "here we go. That's some smooth jazz. What is this? Do I kill it? I don't think so. I don't kill it, Kevin. Can I... can I go in there? What is this? Hold to become the Beast. Do I want to do that, Kevin? You must turn on the power first. Oh my God, okay, okay. Not aiming very well. Try again. There we go. All right. Oh my God, is this... I need a gun. I need a better gun than this. Got him. Guess we'll rebuild the barrier here, if you'll allow it, and I think you will. I don't want any more surprises, you know what I mean? All right, you are... think someone's going to crawl out of there, Kevin? See? No, that look safe to you? Oh my God, Jesus Christ. I can't even... what this gun? There we go. This guy's a nice old zombie mustache. Now, now can I jump in here? I want to go in here, but I guess I'm not allowed. I'm going to rebuild this barrier. I'm earning so many points right now. I'm feeling this already, Kevin. I like little horde mode type things like this. I think I just opened the door behind me. There we go. So now I can get out of here.",
            "start": 177.72
        },
        {
            "text": "I'm earning so many points right now. I'm feeling this already, Kevin. I like little horde mode type things like this. I think I just opened the door behind me. There we go. So now I can get out of here. Now I need a... I need a gun that's not this gun is what I need. What is... what is this? What do you think that means something, Kevin? Yeah, a gun there. One would assume that I would find a gun there, but I'm feeling like the music. I quite enjoy the music very much. Now what is... what is that? You think he's my friend, this plant? No, no, definitely not. There's that what's that blue like eye? This thing here, the left screen. Oh, I don't know. That would require me to do research. Go down, woman. Oh Jesus, oh my God. All right, well now they're really coming at me here. What do you think that means? What is this? What the hell is that? I might have to become the Beast, but not when I'm picking him off like this, Kevin. You see, now I'm really getting the hang of it here. I can't be stopped. You think I can be stopped? No, no, not",
            "start": 273.24
        },
        {
            "text": "is that I might have to become the Beast, but not when I'm picking him off like this, Kevin. You see, now I'm really getting the hang of it here. I can't be stopped. You think I can be stopped? No, no, not yet. Okay, let's make sure the barrier back here is... my barrier over here. Oh no, who broke through this barrier? Who dare would do that? And my skull's running out. I don't know what that means. It's gone now. Did a lot more damage. Wait, what is this? Pick up the Fumigator. Okay, don't know what that means, but we'll find out. Got you. Nope, there we go. Got you, Beast? Should I become the Beast? No, no, no, we don't want to do that. I know it is. Think there's something in that box, in this creepy box? Oh yeah, you have blood on your hands. All right, let's see. You have allowed others... can't jump over there. There's something here that's definitely creepy. I don't know what that is. I can open this. Oh my God, this guy's shambling a little quickly now. I don't like it. Oh God, get away from me. Whoa, that was... was close, Kevin. I'm gonna tell",
            "start": 366.84
        },
        {
            "text": "that's definitely creepy. I don't know what that is. I can open this. Oh my God, this guy's shambling a little quickly now. I don't like it. Oh God, get away from me. Whoa, that was... was close, Kevin. I'm gonna tell you what. Oh my God, oh my God, I got to get out of here. Oh, I'm already dead. Oh, that's not... I'm going to do it one more time. I got to show more of Zombies mode than just that. That wasn't a... that wasn't a satisfactory show for me. But I've not played the game at all. I mean, it's the first time I played the game. You... you know what I mean? Yeah, makes sense. I survived four rounds. I'm not going to... I'm not going to sit here and pretend I'm... I'm disappointed in it. I really want to see you turn. All right, I'm going to turn into the Beast immediately and see what happens on this one. No, you want me to wait? Well, you have to earn it during that little... All right, is there another like... I don't know that I appreciate the effort into the story. It's fine. Not really why I'm playing it. Should we see what happens? No, I'm I",
            "start": 433.16
        },
        {
            "text": "have to earn it during that little... All right, is there another like... I don't know that I appreciate the effort into the story. It's fine. Not really why I'm playing it. Should we see what happens? No, I'm I can't. I think it's loading because I can't skip it. There we go. All right. 8 kills, 0 headshots. Gobblegum. I still don't know what that means. Uh, so let's go in there and take a look at it. Always Done Swiftly. Arms Grace. Coagulant. In Plain Sight. Stock Option. Always Done Swiftly activates immediately. Last three full rounds. Walk faster when aiming. Raise and lower your weapon. Aim more quickly. Arms Grace activate immed... activates immediately. Respawn with the gun you had when you last Bleed Out. Longer bleedout time. You are ignored by Zombies for 10 seconds. Stock Option. Ammo is taken from your stockpile instead of your weapon's magazine. Interesting. Okay, yes, presumably. So I'm not going to mess around with that. It's too complicated for me. Can I change map? No, still can't. All right, a girl. Now I was a",
            "start": 477.68
        },
        {
            "text": "instead of your weapon's magazine. Interesting. Okay, yes, presumably. So I'm not going to mess around with that. It's too complicated for me. Can I change map? No, still can't. All right, a girl. Now I was a girl at the beginning with... I think what that cutscene, those cutscenes were showing was them introducing the car... the four characters to us. You see, I think you understand. Looks like you're everyday normal kind of New York City kind of place, right? And I gotta... you got to sit through this every time. I don't like that. There she is. I don't like... Do you really have to sit through this every time? Can't skip it. I mean, it's loading probably, but it's like that's a little dumb. How long can it possibly take to load a map? I can't imagine. I imagine I'm missing something here. Oh dear. There we go. All right, I can skip now. So that must just be loading. You bear the Mark. You are cursed. Okay, you must use your hand upon Stone. But this is good. That's good. Get out of here immediately. G. I don't think",
            "start": 531.24
        },
        {
            "text": "I can skip now, so that must just be loading. You bear the Mark. You are cursed. Okay, you must use your hand upon Stone. But this is good. That's good. Get out of here immediately. G. I don't think so. Oh Jesus God, it's almost easier to shoot from the hip than it is to aim with... with this particular gun. I want to go through this door this time. How many? I have a thousand. So I got quite a ways to go here. See what is this? Oh, it's the more of the Gumballs. Okay, I can become the Beast. Pick up the Fumigator. Can I jump in here? No. Where's everyone? Oh, there's a downstairs area. Oh, I don't want to go down here. That's a trap, Kevin. Oh my God, where did this guy come from? Got him. Oh no, I'd be nervous just using this pistol here. I just don't feel like it's an effective weapon against the Zombies hordes. All right, so I'm building up my point. I'm the... I'm the gumshoe now. I think I still think this might be my friend. No, you don't think? No, no chance. No chance at all. All right, so here's where I can buy. All right, so I",
            "start": 591.28
        },
        {
            "text": "so I'm building up my point. I'm the... I'm the gumshoe now. I think I still think this might be my friend. No, you don't think? No, no chance. No chance at all. All right, so here's where I can buy. All right, so I understand. I didn't go close enough. Do I want... what do you think this is? Do I want it? I'm going to get it. Okay, cool, cool. It's like, all right, this is more money. Yeah, it is. And I can switch with triangle. Perfect. So now I have options. Uh oh, who's behind me? Yeah, yeah, I'm doing some damage. I'm doing some... I'm doing some work here now with this particular weapon, Kevin. Now I went this way before, right? I don't have enough points to even open any of the gates yet, 'cause I spent it on this lovely... oh my God, this lovely weapon. I want to go into this one, but I need just a little bit more. 900, 90 more points. This guy might... your boy Colin up a little bit. Fumigator. I still don't know what that means. Only by invoking the... All right, item you need. You must X. Going to give it to you. Where is everybody? Am I doing",
            "start": 687.24
        },
        {
            "text": "guy might your boy Colin up a little bit. Fumigator. I still don't know what that means. Only by invoking the... All right, item you need. You must X. Going to give it to you. Where is everybody? Am I doing such a good job? Oh no, I'm not. I'm not doing a good job here at all. Got to rebuild this. I just like games where you just earn points for everything. Oh my God, these guys are going to try to bust through. Let me take care of this real quick. Oh no, I got to back up. Should I become the Beast? What is... what? Maybe they... those things are play. So I guess this is like really to help you out when you're kind of like overloaded. But I don't think I'm earning points for any of this. The curse sleeps. I'm a chronic reloader. Oh, there's a skull. Okay, in... Oh my God, that was scary. What the hell did you just say? I'm Kevin. I still think this watermelon here is my friend. I think so too. Won me over on the watermelon. We didn't go this way for, so let's see if we can get in here. You have allowed others to tear",
            "start": 749.64
        },
        {
            "text": "say I'm Kevin. I still think this watermelon here is my friend. I think so too. Won me over on the watermelon. We didn't go this way for, so let's see if we can get in here. You have allowed others to tear their way into your world. Oh, this guy is getting a little crazy with it. Uh oh, oh, oh my, I died again. I just feel like you die so rapidly. Should I call it one more? All right, one more. Get a little... Uzi. I don't know if I want the Uzi. I really liked that gun. It looked like a good gun. It was a good gun. I performed only one kill better there than I did. I so the one thing that we're missing, of course, is that you can play... you're supposed to play this with multiple people. And if I... I fall out, I bleed, I start to bleed out, but my team should be able to revive me. When I'm playing by myself, well, I have no recourse. You know what I mean? What's the back of the box say? The bestselling franchise on PS4. PlayStation exclusive. Play map packs 30 days early. Campaign, co-op, multiplayer, and Zombies. 50 gig install.",
            "start": 859.4
        },
        {
            "text": "recourse, you know what I mean? What's the back of the box say? The bestselling franchise on PS4. PlayStation exclusive. Play map packs 30 days early. Campaign, co-op, multiplayer, and Zombies. 50 gig install. Pretty substantial. All right, let's go back in one more time. One more time. One to two players locally. Two to 18 players over the network. PS4 Remote Play on Vita. Of course, is there anything inside the box? There is. Oh, smells good. I love the smell of the instruction manual. Oh, there's a code for my Nuke Town bonus maps. Bonus multiplayer maps. Okay, we so we have to watch this every time. This girl get on top of this guy and the guy thinks he's going to get laid and then he gets stabbed with a **** scissor by this extremely naughty woman. It looks really good. The game looks really good. All right, let's skip, Kevin. I believe in myself. I believe that I can do this. You were cursed. You... I just want to beat my other score. That's all I want. And if I don't, well, I'm just going to **** lose my mind. You",
            "start": 909.88
        },
        {
            "text": "skip, Kevin. I believe in myself. I believe that I can do this. You were cursed. You... I just want to beat my other score. That's all I want. And if I don't, well, I'm just going to **** lose my mind. You understand? I need to get out of here immediately because there's... I need more space. Colin needs to roam free. Let Colin roam. What the hell was that? Hello, friend. Good to see you today. All right, I got to rebuild this. It's nerve-wracking when you do this 'cause I can't look anywhere else. I don't know where anyone's coming. Some of those Zombies are a little spry, you know what I mean? I don't like that ****. Yeah, I find that it's just easier not even to aim at all with this gun. Double time, two double points. Got a kill. Got to kill. Where are my dudes? Don't want to waste this opportunity. Hey, how are you? They have already corrupted this world with their... I feel like this opportunity is coming and going and I'm not having nothing to kill. What a waste. All right, there we go. Is that the only guy I'm going to be",
            "start": 981.88
        },
        {
            "text": "already corrupted this world with their... I feel like this opportunity is coming and going and I'm not having nothing to kill. What a waste. All right, there we go. Is that the only guy I'm going to be able to kill before I lose my ****? You know that pisses me right the **** off. Later. Yeah, you know, I'm not acting strategically. I don't know what I'm doing. You see, you understand. This guy knows what I'm talking about. Jesus Christ. All right, there we go. All right, I should have enough points to get my pistol, or not my pistol, my... my assault rifle, which I want right now. What is that? I just don't know what I'm supposed to do with this, Kevin. But how can I select it? I can't select it with a triangle. Circle makes me crouch. X jump. Square reload. I just threw a grenade on a with R1. Is it going to explode? There it goes. I don't know how to do it. Maybe she knows. You know, never mind, Sirah. Excuse me. You find... All right, see there anything for us to rebuild down here? I don't like necessarily getting",
            "start": 1062.04
        },
        {
            "text": "explode. There it goes. I don't know how to do it. Maybe she knows. You know, never mind, Sirah. Excuse me. You find... All right, see there anything for us to rebuild down here? I don't like necessarily getting trapped down here. Is still here. The sh wrenched from this music really does it for me. I don't know. It just, it's, it's, it's, it's resonating with me a lot. It's, it's unsettling. Going to try to get cute now. Stop. I just put those together. What are you thinking? Oh Jesus, everyone needs to chill out for a minute. Give your boy Colin a chance to breathe. All right, you have blood on your head. I like that the corpses are just staying on the ground. I wonder how long they stay. No, no, no, no, no, no, no, no, no. Okay, all right. Hello. Only... oh **** run. Who's be... where did he come from? What the... All right, but I did better that time. 36 kills. And on that note, end scene. That's the end of this Let's Play for Call of Duty: Black Ops III Zombies mode. Quite excited about it. Zombies mode is back. It's fun. I hope you",
            "start": 1140.16
        },
        {
            "text": "I did better that time. 36 kills. And on that note, end scene. That's the end of this Let's Play for Call of Duty: Black Ops III Zombies mode. Quite excited about it. Zombies mode is back. It's fun. I hope you enjoy it. I hope you enjoyed the Let's Play of Call of Duty: Black Ops III, and you played a little more confidently than I did. We'll go see now if the campaign's available and I'll do a campaign Let's Play for you as well. Thank you for joining us here on youtube.com/kindafunnygames. We'll see you next time. Goodbye.",
            "start": 1268.08
        }
    ]
}