{
    "id": 1345,
    "video_id": "kJsqKYuoP54",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Are We Going To Heaven? - The GameOverGreggy Show Ep. 101 (Pt. 4)",
    "description": "Colin Moriarty questions if we are going to Heaven.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1447315201,
    "duration": 1443,
    "transcript_chunks": [
        {
            "text": "today's sponsor is Loot Crate for less than $10 a month. Loot Crate gives the geek in you a special treat every month. Loot Crate is a subscription box service with more than $40 worth of geek, gamer, and pop culture gear: Collectibles, apparel, Comics, etc., delivered to your mailbox every month. This month they're bringing you a fight for the ages. Suit up, choose your allies, and enter the arena for combat. They're ready to stand their ground this month with exclusive items from Blizzard, Fallout 4, Capcom, sponsor-worthy loot from The Hunger Games, as well as a few more items that will help their winners merge victorious. You until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate, and when the cut off happens, Jack, that's it, it's over. So go to lootcrate.com/kindafunny and enter the offer code Kinda Funny to save $3 on your new subscription. Today, Colin, yes, what's your topic? Okay, so, um, I have an interesting one. We've talked about religion and God and all the s stuff.",
            "start": 0.04
        },
        {
            "text": "the offer code Kinda Funny to save $3 on your new subscription. Today, Colin, yes, what's your topic? Okay, so, um, I have an interesting one. We've talked about religion and God and all the s stuff. That's not what I want to talk about today, unless that's where we end up going. You know, who the hell knows where we go, but I want to talk about Heaven and Hell. Um, I've recently been talking to a friend of mine about all sorts of different subjects, and one of the things she and M pop, damn it, no, not Mike Pop, one of the things that she and I were talking about, she likes kind of serious conversations. We know each other for a long time when we've talked about some serious things, kind of serious conversations, and and but just in topics. I mean, there's array of topics, and one of the things she and I had talked about that really resonated with me and kind of gave me pause, like, you know, just in my, you know, going about my business, is it what what what is so bad about what I said? No, no, no, but you",
            "start": 39.12
        },
        {
            "text": "I had talked about that really resonated with me and kind of gave me pause, like, you know, just in my, you know, going about my business, is it what what what is so bad about what I said? No, no, no, but you said kind of gave me pause and C oh looked at my hands. They were funnier to me. It should have been, but it was. Um, you two share brain sometimes, I swear to God. So, uh, one of the thing she and I were talking about, uh, that just, you know, I was just thinking about after the fact was the idea of Heaven and Hell. And, um, you know, she and I are not religious people, so we don't really believe in the the dynamic of these these places, but a lot of people do. And I was kind of curious about not necessarily where you stand now with your religion or anything, that's kind of your business, and it's not really the topic. Do you think you will go to Heaven or you go to Hell if you die and maybe they exist? Let's say they exist, and like, what is your mental criteria? Like, because everyone has their criteria, right?",
            "start": 90.32
        },
        {
            "text": "topic. Do you think you will go to Heaven or you go to Hell if you die and maybe they exist? Let's say they exist, and like, what is your mental criteria? Like, because everyone has their criteria, right? Everyone has like their excuse and their scapegoat of like, oh, I'll go to Heaven because, you know, even though I did blah blah blah, I'm going to go to Heaven. Um, 'cause I have because I that is personally my personal mentality. We talked about that on the before that I don't I just don't believe that even though I'm not a believer that if I went to the gates that they look at my record what and be like, well, you lived a bad life. It's like, I've been a good person. Um, I think I've done the right thing way more often than I haven't. Um, you know, those without sin are, you know, they don't exist. So it's it's so I was just curious like what you guys like mental criteria is like, what do you how do you think about the afterlife and where you're going to go and and uh do you think you'll go to Heaven? I'd get in.",
            "start": 129.76
        },
        {
            "text": "I was just curious like what you guys like mental criteria is like, what do you how do you think about the afterlife and where you're going to go and and uh do you think you'll go to Heaven? I'd get in. Well, you'd figure out a way. That's my thing is like, do I deserve to get in? No, absolutely not. Like, I know that for a fact, which that alone proves that I shouldn't be able to get. Why wouldn't you get into Heaven? Why wouldn't I? Yeah, I don't know, 'cause I don't you're shoeing for Heaven. No, my ideas of what Heaven is is is like is way, way, way above me. I think that there's if real talk, if like Heaven and Hell were what we think they are, there's like three people total getting into Heaven. Like everyone else is ****. But I'll get in there. I it's like Club 33 at Disney. Like one day I'll find my way in. And the thing with that is all you got to do, it's the Mike treatment. You just got go get Mike. You can get in anywhere by telling them to go get Mike. You walk up and they're like, who are you? I'm like, no.",
            "start": 163.56
        },
        {
            "text": "the thing with that is all you got to do, it's the Mike treatment. You just got go get Mike. You can get in anywhere by telling them to go get Mike. You walk up and they're like, who are you? I'm like, no, go get Mike, go get Mike. Mike, I'm with Mike. I'm with Mike. There's always a Mike. Mike might not be working that day. Mike might be there. And if Mike comes, you're just ****. Act like you know Mike. Mike will be confused. You know how how many people Mike knows? Mike knows everybody. You'll get in. Didn't John Travolta play Michael? He did in the movie Michael. Movie Michael. He brought a dog back to life and Joey Lauren Adams **** him. Would you be crazy if John not the dog? Sorry, that was bad sentence structure. Damn, damn you ****. The dog was great. Hey, you brought that dog back to life. Go **** that woman. What? There's a lot of things going on right now. Michael, though, yeah, you smell different to everybody. This is also when Andie MacDowell was a leading lady. She was awesome, like Groundhog Day time period.",
            "start": 204.72
        },
        {
            "text": "what? There's a lot of things going on right now. Michael, though, yeah, you smell different to everybody. This is also when Andie MacDowell was a leading lady. She was awesome, like Groundhog Day time period. Yes, not good movie. No, Andie MacDowell. Deeds for Andie MacDowell. Groundhog Day was a great movie. Michael was not a good movie. Now, it was Phenomenon. That was a weird movie. Remember that one moving you? That was I don't know. Did you see the the Anna Kendrick thing, the shower tweets, shower thoughts? You were amazing video. One of the the deep shower thoughts was they should uh announce a reboot of Groundhog Day and then just re-release Groundhog Day. That's awesome. That would be funny. That's good. That's pretty awesome. Uh I don't think I think I deserve to go to Heaven because I feel like I'm a I'm more of a good person than I am a bad person. So is that the I feel like I wouldn't and I feel like it would be a very close race and I I can imagine they're bringing lots of Archangels in and lots of other people.",
            "start": 249.28
        },
        {
            "text": "person than I am a bad person. So is that the I feel like I wouldn't and I feel like it would be a very close race and I I can imagine they're bringing lots of Archangels in and lots of other people in that are going to kind of look through my history, but I feel like the sticking point would not necessarily be from the hours of when I wake up till like 8 or 9:00. It would probably be the the the activities post 10:00 till like midnight and my wife goes to bed and I look at excessive amounts of porn. You know what I mean? Yeah, like I feel like they would look and be like, he's not but he's not hurting anyone. And God would be like, but look at the damage it's done to his soul. Just look at his search history. Just who strings these words together to search for this and why would you watch whatever pops up? You know what I mean? Let in here. I I've told you the worst thing I've ever searched for when it comes to porn. It's like I got so tired of searching for all the other crazy things like, you know,",
            "start": 295.12
        },
        {
            "text": "up. You know what I mean? Let in here. I I've told you the worst thing I've ever searched for when it comes to porn. It's like I got so tired of searching for all the other crazy things like, you know, well, I'm not going to go too far. I don't want to go that far into it, but like the other day I was like, I'll just I'm going to type in love and see what comes up. The craziest thing I everra. I love sometimes I type in kissing and it's twisted, Colin, it's twisted, dude. No, that those are the best. Um, but no, I mean, I think to to be serious, I feel like everyone does. I think I'd get in. Absolutely. I would get in. I'm a good guy. I'm a good person. I do good stuff. I got a wife. I treat her real real good, real good. Treat her good. Um, I don't I don't break laws. I don't go out of my way to hurt people. I don't really hurt people in general. I try to be good. I really yeah, and more I think of it, the the only sticking point, it's going to be that porn. It's going to be that extraordinary, but I could probably chalk that up.",
            "start": 346.68
        },
        {
            "text": "hurt people in general. I try to be good. I really yeah, and more I think of it, the the only sticking point, it's going to be that porn. It's going to be that extraordinary, but I could probably chalk that up to some sort of addiction. I'd be like, look, God, if you had porn at your fingertips, what would you do, bro? And then it would be slow dolly into God's eyes, slow dolly into my eyes, and he'd be like, let him in. Yeah, that makes sense. I said, let him in. I feel like there'd be a lot of questions about you, Nick. Like there'd be a lot of searching 'cause they'd be like, all the cocaine. You're like, I never did. I never did cocaine, never once. Like, but you talked about it so often. Do you know how many people did cocaine because they heard about it from you? I would actually want to know that number. I'd be like, what is that number? This is one of those things where St. Peter wouldn't be able to handle it himself that they would call God in. You'd put on a side list and then have to go to an appointment where God's at.",
            "start": 392.8
        },
        {
            "text": "that number. This is one of those things where St. Peter wouldn't be able to handle it himself that they would call God in. You'd put on a side list and then have to go to an appointment where God's at. The appointment so they can really go through your record and they'd go through complicated. I feel at the end of the day, though, I'd be charming enough so they'd be like, this guy's kind of let's let him in. He's fun to party. Yeah, no, I I can't imagine you. That's the thing is you give yourself not enough credit when it comes to like getting into ****. I feel like you can get into pretty much anything just because within two minutes of talking to somebody, you go from creepy to charming to qu like the person questioning if they want to leave the person that they're with. Wow. And then it goes creepy again for a second, but it it does come back out and you're like, man, this guy's really cool. You always have to have a sense of danger talking to the opposite sex. I was it talking about the crazy and creepy?",
            "start": 436.48
        },
        {
            "text": "for a second, but it does come back out and you're like, man, this guy's really cool. You always have to have a sense of danger talking to the opposite sex. I was it talking about the crazy and creepy sometimes? I don't know. Yeah, I feel like we'd all get in. Yeah, we would. Without that, we'll all get in. Oh, P.Y., he'll beat he'll meet us there. Who do we know wouldn't get in? I like nobody. You don't know anybody. We don't know anyone that wouldn't get in. No, really? I do, but I does everyone just **** get? Do you know any murderers? So only murderers go to Hell? I I mean, like, it's a binary weird thing. Do do we really believe in that version of Heaven and Hell? Well, so I I mean, that's what's the point. It's if the question is, are we getting in? And there's like not really anything that any question of if we are or not. I can think of a couple people. I you only know good people, though. What saying? I don't know, man. I could think of a couple people I've met that I'm like, you're you're not get you're going. I",
            "start": 473.96
        },
        {
            "text": "are or not. I can think of a couple people. I you only know good people, though. What saying? I don't know, man. I could think of a couple people I've met that I'm like, you're you're not get you're going. I think you guys are missing the I mean, maybe not, maybe it's just my interpretation, but I think intent is a really big part of it from in my mind. Like, what is your intent? The power of intention, as Wayne Dyer used to say, who was like a motivational speaker that I like. He also did hockey. No, no, no, he didn't do hockey. Wayne Dyer was I was Wayne Gretzky. You're right. Uh, but, uh, so I think that that's it. It's like it like really is like, I do think that people have a like, what is in your heart? Like, what is what is your intent? Like, what do you how do you carry yourself? What do you do? Everyone has their **** terrible moments and everyone has their their things that they would take back or the things they wish they didn't say or the things they wish they didn't do. And I I really believe that that that",
            "start": 512.28
        },
        {
            "text": "terrible moments and everyone has their their things that they would take back or the things they wish they didn't say or the things they wish they didn't do. And I I really believe that that that really can go from like the best person in the world like on the outside to someone in prison. Like I think that that like I think that that can span the gamut from like, sure, you know, I like I think that there are people walking around Wall Street right now with hearts of darkness. I think that there are people in prison for 30-year sentences for assault or whatever, assault and battery over 0 years that have good hearts. Yeah, you know, and I think that that a mistake. Exactly. I'm not saying that if you murder or rape or something that that's something you should be forgiven for because I don't believe that that's the case, but I do think that that there there's a, you know, there's intention is really important. Like what how you carry yourself and how you treat other people, I think is really important.",
            "start": 552.44
        },
        {
            "text": "that's the case, but I do think that that there there's a, you know, there's intention is really important. Like what how you carry yourself and how you treat other people, I think is really important. And again, we all treat people in different ways. Sometimes I remember just as an example, I I I hate cab. I hate cabs. And I remember getting into a cab like a year or so ago and you I'm sick of them. And I I get no cab at SFO. I'm back from like a business trip and I get in and I'm like, I you know, I need to go to my address. And he's like, or like the area I'm going to like we always say. And he's like, all right, like and the guy's like, John, like, all right, do you have an address? And I'm like, dude, do you not know where the ****? Like I literally like I'm just so ter I'm siing. I'm like, are you **** kidding me? Like you drive a cab and you don't know like had to get to this place. He's like, I just want to put it in the thing like and like just kind of turn it around or whatever. And I was like, ****.",
            "start": 585.52
        },
        {
            "text": "me like you drive a cab and you don't know like had to get to this place. He's like, I just want to put it in the thing like and like just kind of turn it around or whatever. And I was like, ****. Sorry, you know, like that was totally uncalled for. I didn't mean to talk to you like that. You going to Hell? But but the point is is like there the cabby said it and then he flipped the cab. But the point is is that there are people out there that it um talk to people like that all the time and don't care. Um whenever I like know I'm rubbing someone the wrong way or like not with what I'm saying, but how I'm saying something, then that that's something I try to correct 'cause I just think it's about how you treat other people that's most important. It's the please and thank you culture. It's all that kind of stuff. Like I I I I think that my in my heart, even though I we've all done bad things, like for sure, like everyone everyone has done something that's bad. Um, but it's a matter of like, what is in your",
            "start": 627.48
        },
        {
            "text": "of stuff. Like I I I I think that my in my heart, even though I we've all done bad things, like for sure, like everyone everyone has done something that's bad. Um, but it's a matter of like, what is in your heart and the nature of your the like not to be like too reductive, like the content of your character. I think that that's really balance, right? How how how far toward good you have to be percentage wise? Yeah, I mean, does so if it's like, can 50/50 is 50/50 or is it like you need to be 80% good to go into Heaven? I would say more good than bad. I would imagine by by a wide margin. This is where I think the whole Catholic Purgatory argument comes in too. Like the like if I'm not going to Purgatory, it's either Heaven or Hell. I have time to space forat. I don't Purgatory even exists. Going to turn him down like, listen, where just flip a coin. I got to go somewhere. I'm not sitting here with all these unbaptized babies. It's just it's just going back to the conversation I had my friend. It is the conversation.",
            "start": 658.96
        },
        {
            "text": "like, listen, where just flip a coin. I got to go somewhere. I'm not sitting here with all these unbaptized babies. It's just it's just going back to the conversation I had my friend. It is the conversation she and I had. It's just an interesting conversation in the sense that I don't really believe either of these places exist. The the sad thing, the scary thing about dying from for me because and I am scared to die, not like the act of dying, but the the feeling of being gone, 'cause I really do believe it's over. MH. Like it's done. MH. And that's a scary thing for it to shut off. You're gonna one day you will shut off and like, what is that? You know, and and nothing. You got nothing. So that's a scary thing. And so these things make you feel better. It makes you feel like you it philosophically makes you feel like you have control. And that was the and so when you know, when you look at things like Calvinism, which is a sect of Protestantism that showed you that the idea of Calvinism was predestination that you",
            "start": 701.0
        },
        {
            "text": "you have control. And that was the and so when you know, when you look at things like Calvinism, which is a sect of Protestantism that showed you that the idea of Calvinism was predestination that you had no control that that you everything was predestined. Everything, every decision you made was already written and it's already conceived whether you're going to go to Heaven or Hell before you're even born. And so the thought of even like saying like, oh, but but I'm my mind's saying to go left, so I'm going to go right today to prove it. It's like, no, you they knew you were going to have that argument and do that. Yeah. Um, so that's a powerless position to be. That's why like Calvinism to me is like, I respect, you know, I respect all religions, all sex of Christianity, whatever, but that was always a really powerless place to me. And and so that's why I think people like look forward to to having some sort of control over the situation. The other side of it, of course, is like the idea of Catholic indulgences.",
            "start": 741.32
        },
        {
            "text": "powerless place to me. And and so that's why I think people like look forward to to having some sort of control over the situation. The other side of it, of course, is like the idea of Catholic indulgences and stuff like that. Like the idea that you can buy yourself into Heaven. Um, which was what caught one of the things that drove Luther to nail the thesis to to the door of the church. Anyway, so I don't know. I just find it a fascinating philosophical conversation about the different criteria we have. And we've already shown by the four of us talking about it that the criteria is not set in stone. The criteria is not even really set in stone in in the Bible. So it's it's it's it's just interesting. You know, what do you how do you come down on the the argument, not even argument, theory or whatever you want to say that the Kingdom of Heaven is here on Earth right now? No, I don't. I don't buy. I don't. I mean, that's to me, that's ridiculous considering the the war and the pestilence and the famine and for I",
            "start": 778.88
        },
        {
            "text": "to say that the Kingdom of Heaven is here on Earth right now. No, I don't. I don't buy. I don't. I mean, that's to me, that's ridiculous considering the the war and the pestilence and the famine. And for I got in not for no, not for me, but for everyone, everyone around us. I mean, look what we were talking Colin & Greg Live. We talked about the Syrian refugees. That's just a great example. Like a war-torn like that's that goes back and we can get into that later about why I don't think God exists because I just can't imagine a situation where it's just like, let it play. Like just roll the dice and see how it plays out. You just sit there and let this **** happen to just innocent people. Like that's why that's my major problem with religion. Doesn't make any sense. I mean, at the end of the day, it doesn't make any sense. Uh to me, that's always the problem we come whenever we bring up this topic. This is what we always get to is that I think you have trouble separating in your arguments God from religion because",
            "start": 814.44
        },
        {
            "text": "sense. Uh to me, that's always the problem we come whenever we bring up this topic. This is what we always get to is that I think you have trouble separating in your arguments God from religion because what if God created this Big Bang and walked away and he's not this thing think about or do or have anything to do? That's what I was talking about. I feel like I I see the influence of God every day, every moment of my life. This divine inspiration. Yeah, the light on Tim's face right now. It's beautiful. You know what I mean? I can't imagine there wasn't some divine hand in getting us to that point to this thing, not taking away man's uh ingenuity, the creation of the light bulb. You know what I mean? Like don't get me wrong. I'm not saying God's like, let's **** make a light to you know what I mean? But I'm saying like, I don't know if he needs to be there guiding every step of the way. I think indulgences are **** clearly. Predestination, I don't agree with. You know what I mean? Like I don't think he's",
            "start": 849.44
        },
        {
            "text": "saying like, I don't know if he needs to be there guiding every step of the way. I think indulgences are **** clearly. Predestination, I don't agree with. You know what I mean? Like I don't think he's there nudging things into the way as much as maybe this happened and that's it. You know what I mean? And then that was his that was his or whatever the **** it was. Well, the passive the passive God you're discussing is like more of a deist God, which is like what a lot of the founders were. That's like what a lot of Enlightenment thinkers believed, which is that God created and turned his back on everything. Um, I me in a nutshell, but I I mean, I just it's hard for me to rectify that. It's hard because I feel like going back to an earlier point you made. Well, just it's it's comforting. The whole thing is comforting. Oh, yeah, but the danger with that is when you when you say that there's something after like life, when there's, you know, you can die, but there's something beyond that, it puts less importance on kind",
            "start": 887.88
        },
        {
            "text": "oh, yeah, but the danger with that is when you when you say that there's something after like life, when there's, you know, you can die, but there's something beyond that, it puts less importance on kind of what you accomplish in this life. And that's the biggest problem I've always had with it, right? Where people like, well, if I live a good life and do everything I'm supposed to do, I'll be rewarded in the afterlife. And I'm like, I'd like to be rewarded now. I'm not going to make that bet because I feel like all of your decisions are way more important if you know that at the end of that road, lights out, that's it, right? Suddenly your life becomes very important. You might only have 10 years left. What are you going to do with that? Or you might go to Heaven. You have an attorney, whatever. So just, you know, that's the difference. A great man did once say, YOLO. It is YOLO. He did say that. Yeah, and that's what and that's back to your point. That's what I'm when we're talking about the 30s, that's what I'm",
            "start": 922.64
        },
        {
            "text": "know that's the difference. A great man did once say, YOLO. It is YOLO. He did say that. Yeah, and that's what and that's back to your point. That's what I'm when we're talking about the 30s, that's what I'm learning now in my mind slowly just like really more recently over the past few months is just I have got to take control. You know, like there we like time is finite. Yeah, you any of us can die tomorrow. I don't know if it's a matter of control necessarily because you and I, but we're smart enough to realize you never really have control. Like we could have the best life possible in a **** tsunami. It could come just wipe us out like that. We can't do anything about it. But I think what you're more referring to is you've got to take sort of a more, well, you're a pretty proactive guy in general, but I feel like you and I, all of us could probably we feel that urgency, right? Where as we get older and we start accomplishing things in our in our 30s or you know, early 40s, whatever the **** Tim is.",
            "start": 959.24
        },
        {
            "text": "I feel like you and I all of us could probably we feel that urgency right where as we get older and we start accomplishing things in our in our 30s or you know early 20s whatever the fuck Tim is still um or infancy you you start to feel like well I've gotten just a little bit fuck I should get more I should I should accomplish more I'm capable of more and I'm not living up to that and that there comes that that sort of that need to keep up and then surpass where you were before I feel it every day I feel like every day I sit I go home and I'm like I I could do more today I could accomplish more I I could I have the capability to do these great wonderful things we've proven that we've made this thing together now we can do more can I do more and that's my biggest fear is that I won't accomplish the things that I want to accomplish before I die that's it that's my biggest fear in life and I do have that fear every day um I don't know is that kind of do you vibe with that or are you",
            "start": 998.04
        },
        {
            "text": "the things that I want to accomplish before I die that's it that's my biggest fear in life and I do have that fear every day um I don't know is that kind of do you vibe with that or are you thinking yeah well I think what you're talking about I think is more like agency over your life like the the idea that you can control the asset this aspects of your life that you can control you should yeah we cannot control the meteor that's going to fuck crash on Earth one day and kill us all or something or the moon just leaving right the moon leaving and maybe something and maybe something happens and maybe maybe it doesn't uh my biggest thing is you control how you react to it I think that's that is what life is it's not it's knowing that you don't have control of what's happening but things happen and how you handle it is what makes you who you are and your life so true I think I think what I'm realizing now is that I was more I guess what the core of the issue for me and this goes back to",
            "start": 1037.2
        },
        {
            "text": "and how you handle it is what makes you who you are and your life so true I think I think what I'm realizing now is that I was more I guess what the core of the issue for me and this goes back to the previous topic is I was way more comfortable wasting lots of time when I thought I had lots of time yeah and now that I get older I know it's like a fuck morbid we're not fuck cavemen that die at 27 years old anymore like our average you know age is you know by the time we get older we we we're all gonna probably live to be well over a hundred as long as things like go the way that they're going I mean that's obvious um and what that means for the future of this planet and the future of our our society is probably bad actually but um I realized when I was 20 years old I had no problem you know getting crazy with my friends and and wasting time and just going to class and just Meandering through my life and then when I was 25 I had no problem putting my 9-to-5 in and working",
            "start": 1073.12
        },
        {
            "text": "you know getting crazy with my friends and and wasting time and just going to class and just Meandering through my life and then when I was 25 I had no problem putting my 9-to-5 in and working really hard and then drinking with my friends and just watching TV shows and all you know whatever the things that is that keep you happy and make your life pleasant but then when I when I'm when I now that I'm 31 which I feel like is such a it's been a weird paradigm shift in my life where this is the first age where I'm like fuck you know like I'm old I'm old old you know and I'm I'm not trying to be like uh I'm not trying to be like uh you know melodramatic you know it's should I am old I mean it's just the I'm not very old I'm not fuck 70 years old that's what I'm saying I'm saying I'm old like if you were if there was a high school kid here they would be like why am I had a fuck AARP meeting exact that's exactly right and now that and now that I'm 31 I'm like there's time is more",
            "start": 1112.72
        },
        {
            "text": "like if you were if there was a high school kid here they would be like why am I had a fuck AARP meeting exact that's exactly right and now that and now that I'm 31 I'm like there's time is more precious and like the like what is my intention to make my life better were 30-year-olds when you were in high school yes you're fuck old they were you were like you're so all like doody something can I get you some juice Grandpa when I when I went to when I went to college when I went to college my brother was a year a year and a half younger than I am now you know and I remember and I remember I remember looking at you know he was so cool he's still cool in my mind he's in his 40s now and he's still the fuck coolest thing to me but but it's like I just don't want to get to this point where we can reflect and still change things eventually we have to come to terms with the fact that we are going to get to a point where we reflect and we can't change anything anymore and that's and I don't",
            "start": 1150.0
        },
        {
            "text": "can reflect and still change things eventually we have to come to terms with the fact that we are going to get to a point where we reflect and we can't change anything anymore and that's and I don't want to get to that point because you're because you're locked in you have a family or kids you have a fuck you know all these things like the more you lose that agency the more the more you're unable to shake things up so shake them up while you can yeah and that's like kind of the that's kind of where I'm at right now you know my mind I'm like I've been very deep in my mind lately with this kind of fuck interesting yeah I haven't thought about heaven or hell or death in Forever live it just live it yeah well that's what we were saying we were kidding around but the Bon Jovi line that that you were remember we were uh it's my yeah it's and he says yeah what does he say going to live forever and I just want to Live While I'm Alive that's the line I think and I remember you turning around",
            "start": 1190.12
        },
        {
            "text": "were remember we were uh it's my yeah it's and he says yeah what does he say going to live forever and I just want to Live While I'm Alive that's the line I think and I remember you turning around like you're like but for real that's a deep line and I'm like yeah it is it is it is a deep line so let's live by it let's live by Bon Jovi don't worry about your tsunamis you'll be fine living your good life oh Coastal California is gonna be all fucked up you ever think about that by the way cuz I think about that sometimes we've all had just for Real Talk cuz you guys have lived here for you heard you felt bigger earthquakes than we have but I felt my fair share of earthquakes in eight years here some more violent than others but nothing like out of control nothing like the Loma Prieta whatever like that or even you know the 1906 one but sometimes I sit in bed and I'm like it could happen right now you know like there's nothing we can do about it I'm sleep so well tonight with that with a smile I",
            "start": 1226.0
        },
        {
            "text": "or even you know the 1906 one but sometimes I sit in bed and I'm like it could happen right now you know like there's nothing we can do about it I'm sleep so well tonight with that with a smile I love Colin so much Colin wants to sit back secretly and not so secretly wants to sit back and just watch the world burn he just does and then he wants to get his rifle and go hunt some commies and that's what he wants to do yeah the fall of the Soviet Union was like the saddest thing that ever happened to me at seven years old Jesus that's so fucked up ladies and gentlemen that topic was brought to you by Loot Crate would you classify yourself as a geek gamer pop culture nerd then Loot Crate is a subscription box for you Loot Crate is a subscription box service with more than $40 worth of geek gamer and pop culture gear Collectibles apparel Comics Etc deliver to your mailbox every month make sure you head to lootcrate.com/kindafunny and enter the code Kinda Funny to save $3 on any new",
            "start": 1265.4
        },
        {
            "text": "gamer and pop culture gear Collectibles apparel Comics Etc deliver to your mailbox every month make sure you head to lootcrate.com/kindafunny and enter the code Kinda Funny to save $3 on any new subscription this this month they're bringing you a fight for the ages suit up choose your allies and enter the arena for combat they're ready to stand their ground this month with exclusive items from Blizzard, Fallout 4, Capcom, sponsor worthy loot from The Hunger Games as well as a few more items that will help their winners emerge Victorious you know you're a winner you already emerge Victorious but I'm not insulting the copy whether you're risking your life in battle are taking no prisoners in the Wasteland our loot will be at your side to help keep things interesting basically Loot Crate is like a friend that knows you and loves you and surprises you with an awesome present every month did we mention they shipped over 13 countries too you have until the 19th at 9:00 p.m. Pacific to",
            "start": 1312.64
        },
        {
            "text": "is like a friend that knows you and loves you and surprises you with an awesome present every month did we mention they shipped over 13 countries too you have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate and when the cut off happens Jack that's it it's over so go to lootcrate.com/kindafunny and enter the offer code Kinda Funny to save $3 on your new subscription today thank you Loot Crate and of course thank you ladies and gentlemen for listening and or watching this episode of The GameOverGreggy Show if you didn't know each and every week The GameOverGreggy Show is four sometimes five best friends around this table he's bring a random topic of discussion for your amusement you like that head over to KindaFunny.com where you get to all the YouTube channels and subscribe you can support us on Patreon where we get the episodes early you can go to YouTube.com/KindaFunny where we post every episode day by day topic by topic until we post the",
            "start": 1353.76
        },
        {
            "text": "channels and subscribe you can support us on Patreon where we get the episodes early you can go to YouTube.com/KindaFunny where we post every episode day by day topic by topic until we post the entire things for free as a video in MP3 what's wrong well one Kevin's trying to kick me in the face and two Colin said and I quote the fall of the former Soviet Union was the worst day in my life seven-year-old, seven-year-old worst thing to happen is a seven-year-old yeah but the tsunami hasn't happened yet cuz we're all good people and we live good lives heaven on Earth true though in the 80s we had we had the villain we had the enemy and now and we let it go we beat him up that's why we use these Nazis all the time now and everything we do tired house Nazis until next time it's been our for sure.",
            "start": 1396.44
        }
    ]
}