{
    "id": 1353,
    "video_id": "O3vFWG6BMQA",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Why We Love PSN Trophies - PS I Love You XOXO Ep. 9",
    "description": "Go to http://www.squarespace.com and use promo code kindafunny for 10% off!\n\nGreg Platinumed Fallout 4, but one fan wants to know why we're all obsessed with these PSN Trophies. (Released 11.17.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://youtu.be/HNf3thhglyQ\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/kindafunnyvids\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1447779537,
    "duration": 6143,
    "transcript_chunks": [
        {
            "text": "PS I Love You XOXO is brought to you by Squarespace. Squarespace is the easiest way to create a beautiful website blog or online store for you and your ideas. Squarespace features an elegant interface, beautiful templates, and incredible 24/7 customer support. Try Squarespace at squarespace.com and enter the offer code kind of funny at checkout to get 10% off. Squarespace build it beautiful. What's up everybody? Welcome to PS I Love You XOXO episode 9. I'm one of your hosts, Greg Miller, alongside he only does everything, Colin Moriarity. It's good to be here with you today. It's good to be here with you today, Colin. There it is the the firm grip, the Kung Fu Grip as they wrote songs about back in the day. Whatever happened guys? Well Bradley Nowell died uh 19 years ago. I oh man I thought it just happened. I missed must have missed that news. Bradley that's your always thing with them that they could how how would they have been remembered if he hadn't died right? Yeah I've thought about that a great deal",
            "start": 0.08
        },
        {
            "text": "missed must have missed that news. Bradley that's your always thing with them that they could how how would they have been remembered if he hadn't died right? Yeah I've thought about that a great deal cuz they really those I mean they had two records yeah and they were good. I mean the self-title album was very very good. Everyone likes 40 oz to Freedom a little bit more. I'm like you're not you're not going to back down. No I mean no there's no way there's no way that album is better than the self-title album but I me they had other stuff like I think In the Hood and stuff like that but gotta they're uh yeah you often I often wonder about that like would anyone care yeah and the answer probably same thing with like Nirvana right? Yeah like well would their legacy be if Kurt Cobain was still around making music exactly and what would have would Foo Fighters have ever happened and all that that's that's great question we would have never known Dave Grohl he would have just been the Little Drummer",
            "start": 66.84
        },
        {
            "text": "making music exactly and what would have would Foo Fighters have ever happened and all that that's that's great question we would have never known Dave Grohl he would have just been the Little Drummer Boy in the back nobody would have ever seen inter thing I mean I think the Foo Fighters are a way superior band in Nirvana but uh Nirvana is certainly a more important band so sure um that's not to understate the Foo Fighters importance to rock music should say Nirvana's seminal grunge Seattle you know that 89 991 era very cool what is this podcast about this podcast is about PlayStation if you didn't know ladies and gentlemen we are kind of funny.com we are the PlayStation podcast on kind of funny.com we are the number one PlayStation podcast in the world we are the only PlayStation podcast at PSX make sure you come to our live podcast recording Saturday December 5th at 5:00 p.m.. I guess on the fifth part I'm pretty sure that's right that sounds right the Saturday of PSX 500 p.m. main stage",
            "start": 101.88
        },
        {
            "text": "make sure you come to our live podcast recording Saturday December 5th at 5:00 p.m.. I guess on the fifth part I'm pretty sure that's right that sounds right the Saturday of PSX 500 p.m. main stage can't miss us only PlayStation podcast there and then of course come to our meet and greet that night at Jillian in conjunction with Just Cause 3 uh 8 o00 for that bad boy that's who we are that's what we do here every week every Tuesday we come to you with all the PlayStation news you need to know about 9:00 a.m. it's a YouTube video on youtube.com/ kind of funny games it's an MP3 wherever you get your MP3s we put them up on Soundcloud and then they proliferate around the world they just scoot them out it's like a virus PS I Love You XOXO the virus it's like a virus that's a good catchphrase before we go any further Colin we last week's big news the PSX panel we've already covered it here with your incisive line of questioning you're right in there you had them all we need to say I'm",
            "start": 139.4
        },
        {
            "text": "before we go any further Colin we last week's big news the PSX panel we've already covered it here with your incisive line of questioning you're right in there you had them all we need to say I'm nominated for a game award Jeff Key does these game awards every year right we do have to say that I guess we change it every time he changes the names a lot this year it's still the game awards you go to the game awards.com I'm nominated over there it would be a personal favor to me if you voted for me you can vote by tweeting hash PGA Greg Miller all one word because that's how hashtag works or you go to the game words.com go down to nominees trending gamer click on me you you can vote via your Facebook profile if you like and remember you can vote for Greg Miller using hash TGA Greg Miller or Greg Miller's ego # TGA Greg Miller's ego if you do that that that doesn't count that just do the TGA Greg Miller and we will assume it counts for the ego as well I don't know I I wouldn't make that",
            "start": 181.96
        },
        {
            "text": "Greg Miller's ego # TGA Greg Miller's ego if you do that that that doesn't count that just do the TGA Greg Miller and we will assume it counts for the ego as well I don't know I I wouldn't make that assumption I want this Colin I'm not going to lie to you I know you want I hope you get it but don't want you to get your hopes up and I'm not saying because I don't think you deserve to win I'm saying you're going against PewDiePie I'm up against PewDiePie and total biscuit and total biscuit and a couple other guys but those are the big ones and if any moment one of them wakes up and know realizes they're in this competition they would say the same thing and Their audience would squash I'm pulling for you I'm not going to vote for you because I want to vote for PewDiePie but the but so I'm goingon to vote I thought about that just voting for total put PewDiePie is what I'm going to vote but gotcha no I hope you do win but I just don't want you to get your hopes my hopes aren't up here's",
            "start": 224.32
        },
        {
            "text": "to vote I thought about that just voting for total put PewDiePie is what I'm going to vote but gotcha no I hope you do win but I just don't want you to get your hopes my hopes aren't up here's the thing it's been a Cinderella year for us we start this thing January 5 2015 here we are coming into December coming in strong uh we got our own PlayStation experience panel and then of course yeah I got this nominee for the game awards fantastic don't get me wrong the nomination enough but I think it'd be cool to have the trophy back there when we do these shows it would you're list3 we record in a room and behind us as things I hope you win our people can do it I know it's going to require a great deal of vote engineering and uh lot of hanging Chads a lot of hanging Chads you're GNA have it's a Grassroots effort this is I think how Barack Obama won Iowa in 2008 sure uh and you're going to win this the same internet the same way I'm not suggesting Obama stole the election in Iowa I'm saying",
            "start": 257.48
        },
        {
            "text": "Grassroots effort this is I think how Barack Obama won Iowa in 2008 sure uh and you're going to win this the same internet the same way I'm not suggesting Obama stole the election in Iowa I'm saying the Grassroots part is what you know is what Obama stole the election from Romney in 2011 but you're not saying like how George W bush stole it from Al Gore uh in Florida well the Supreme Court stole it from out and Ralph Nader why don't we Ralph Nader stole the election this wouldn't even have been a problem had Ralph Nader stayed out I love the fact that Ralph Nader thought he had a **** chance to be president with the name Nader we're never gonna have President Nader sorry Ralph you have to understand or Ralph either remember when Ralph Nader invented the seat belt I do remember that right after Al Gore invented the Internet politics are funny ladies and gentlemen this is PS I Love You XOXO let's begin it with what is and forever will be Roper's report time for some singular",
            "start": 294.96
        },
        {
            "text": "that right after Al Gore invented the Internet politics are funny ladies and gentlemen this is PS I Love You XOXO let's begin it with what is and forever will be Roper's report time for some singular possessive news there are only nine items on the list nine items I don't know it's a b do um um put some good ones on here I want to uh that's a great song I remember I remember listening to that getting that record I was in seventh grade something like that and uh just thinking I was so cool listening to that especially uh Caress Me Down sure when you got when you got deep into the uh when you got deep into the the that's a long record yeah you know the self-title I don't know but yeah and you and you get deep in there because it start you know Garden Grove is a **** great song you got to work you know you know what you got right yeah what I got uh and uh you know Etc and so on and then you get the Santa Ria and all that stuff but when you really get deep into that this some good song",
            "start": 336.36
        },
        {
            "text": "work you know you know what you got right yeah what I got uh and uh you know Etc and so on and then you get the Santa Ria and all that stuff but when you really get deep into that this some good song which album is that that's the self album that's the one that came out after that's one you think's better like you remember sania's video where it was like him as a ghost no like like it was like footage of him playing but like it was all like an apparition and it was all sad and stuff like he never even got to enjoy the F the fruits of that and uh they played very few of those songs live ever which is such a shame yeah yeah but I digress uh before I get into it I want to uh um we have a substantially European audience and we do have a French audience yep uh so I do want to uh you know tip my hat and wish the very best to our our fans and our listeners over in France obviously we have you know Greg and I are are stupid Americans so we we we do have fun at your expense often",
            "start": 387.48
        },
        {
            "text": "know tip my hat and wish the very best to our our fans and our listeners over in France obviously we have you know Greg and I are are stupid Americans so we we we do have fun at your expense often uh but in all reality what happened last week was awful barbaric barbaric and um just an absolutely terrible thing so uh we stand in solidarity with our French fans and obviously France the United States's oldest Ally um and uh hopefully we can uh take it to these uh radical Islamic terrorists at some point uh totally unacceptable what happened and so our thoughts and prayers are with you indeed our French Brethren and I wanted to say that before we begin number one as predicted Xbox One outsold PlayStation 4 in October in the United States on the back of the release of Halo 5 Guardians which was the bestselling game at retail for the month PlayStation 4 games charted it two with NBA 2K16 Assassin's Creed Syndicate at 3 Madden NFL 16 at 4 WWE 2K16 at 5 FIFA 16 at 6 Destiny the Taken King at",
            "start": 431.16
        },
        {
            "text": "the bestselling game at retail for the month PlayStation 4 games charted it two with NBA 2K16 Assassin's Creed Syndicate at 3 Madden NFL 16 at 4 WWE 2K16 at 5 FIFA 16 at 6 Destiny the Taken King at seven Uncharted the Nathan Drake collection at nine and rock band 4 at 10 the PS4 iterations of all games mentioned sold best compared to their competition except for the Nathan Drake collection which is only on PS4 and rock 4 which did better on Xbox One interestingly now do you think it's not though right cuz like I requested Xbox version all my DLCs on Xbox that's a good point yeah it's interesting I I the numbers so it's worth noting here that well things we've talked about in the past I said that for Microsoft to remain super relevant with Xbox One in the United States they need to win two of three months in the fall so October November December they've already won one my suspicion is that they will not win November so the The Fallout 4 should drive some consoles Tomb Raider should drive",
            "start": 473.84
        },
        {
            "text": "three months in the fall so October November December they've already won one my suspicion is that they will not win November so the The Fallout 4 should drive some consoles Tomb Raider should drive some consoles but Battlefront and Call of Duty are going to drive PS4s and I just don't see how they're going to compete um but maybe they win December but nonetheless this is a good start for them but from an doal evidence that I've read on neoaf and other places the numbers overall for consoles were very soft um it seems like Xbox One barely edged out PS4 something maybe Xbox one might have sold about 305 000 units in October which is not very good no um but November these you know PS4 should drive over a million you assume in in November black um just in the United States yeah Black Friday and all this small business sat Bund and the bundles there was no I mean Uncharted was a bundle okay Uncharted was a bundle that was of some relevance but I think this Call of Duty in this obviously",
            "start": 519.96
        },
        {
            "text": "and all this small business sat Bund and the bundles there was no I mean Uncharted was a bundle okay Uncharted was a bundle that was of some relevance but I think this Call of Duty in this obviously Battlefront bundle are going to be **** huge everybody loves how the the Call of Duty Xbox or I'm sorry PlayStation looks so that's really where they're going to Wi so ugly isn't it the ugliest thing you've ever seen who the **** not ugliest thing I've ever seen the ugliest I Ryan Clement oh okay that's a good point but uh I don't know who was like yeah that's a great design I'm like ship it I I don't like it I don't like it at all but I whatever it doesn't matter who cares like I always said my PS4 could be a cardboard box I really don't give a **** who cares what it looks like um so yeah it's worth noting there's other things worth noting we're gonna get into Fallout 4 sales in a minute uh but if if we're being honest if they release a cardboard PS4 that'd be awesome that would be",
            "start": 558.48
        },
        {
            "text": "it's worth noting there's other things worth noting we're gonna get into Fallout 4 sales in a minute uh but if if we're being honest if they release a cardboard PS4 that'd be awesome that would be pretty awesome probably burst in the Flames but they'll figure it out she weighs on it uh but uh it seems that uh Tomb Raider we'll get more into this but Tomb Raider sales were extremely soft apparently um not surprising considering when um Fallout 4 came out and speaking of number two Fallout 4 has officially sold huge but does to ship 11 million copies of Fallout 4 in day one likely to fulfill demand if all those copies are sold which they will be that accounts for $750 million in Revenue a l Mone it's unclear how many copies were sold to consumers or how quickly Bethesda intends on working through that 11 million before shipping more it's also unclear how many digital copies sold though games industry International reports numbers from a group called super data which places Fallout for",
            "start": 593.84
        },
        {
            "text": "through that 11 million before shipping more it's also unclear how many digital copies sold though games industry International reports numbers from a group called super data which places Fallout for his digital sales at 1.87 million in 3 days 1.1 million of which were via PC uh which leaves only about 670 000 if those numbers are accurate from that time period for Xbox One and PS4 not a huge surprise the game is massive um it' be a pain in the ass to download that I we both have retail copies of and it still has a substantial install I was going to say even then there's a giant install and that's the big I I think actually might be a question coming up when you download a game you're like I downloaded and you start it and there's an install on top of that you're like **** it sucks it's annoying Fallout 4 takes a very long time to install but uh it is a very big game and also I really like the special videos yeah very very cool honestly there's a in recent right now right we're",
            "start": 635.04
        },
        {
            "text": "it's annoying Fallout 4 takes a very long time to install but uh it is a very big game and also I really like the special videos yeah very very cool honestly there's a in recent right now right we're talking about these installs after you start the game Fallout does it really well with the special videos and then I like that Battlefront has a little mini game too while it's installing you play as Darth Vader you run around kill guys yeah yeah it gives you a little place to start something to do I love the end of the special videos where it's like and then it cuts off it's like it's so cool like it's just they're really well written yeah and super violent and stuff like that it's very Fallout um so what do you make of these numbers 11 million copies um people say that these are ship numbers they are ship numbers but uh Bethesda like any publisher not dumb they don't put games out there that they're not going to sell um so we have to assume that that number is Maybe even already through",
            "start": 670.96
        },
        {
            "text": "they are ship numbers but uh Bethesda like any publisher not dumb they don't put games out there that they're not going to sell um so we have to assume that that number is Maybe even already through yeah at this point I think it's a great number that's a really I mean kudos to them right the game's awesome they did a really good job with it they deserved it and I'm glad that it's selling so well or they expected it to so so well but again that's where pre-orders come in and a million other things so I think they're confident that that's what they're going to move yeah and I think uh we'll compare it to Call of Duty numbers let's do it I think I might have been a little too bullish on Call of Duty numbers saying Fallout 4 might beat it but I think that there's going to be some parody there as we're going to see in a minute um before I move on though I just want to verify that my numbers are right um yeah so I'm at the Wikipedia for Fallout 3 so we can give some context gotcha for sales",
            "start": 709.92
        },
        {
            "text": "as we're going to see in a minute um before I move on though I just want to verify that my numbers are right um yeah so I'm at the Wikipedia for Fallout 3 so we can give some context gotcha for sales uh it says from its release in October 2008 through the end of 2008 Fallout 3 shipped 4.7 million copies so be shipped in one day almost three times that many copies um let's see as of January 2009 1.14 million units were sold on Xbox 360 55 th000 were sold on PlayStation 3 um Electronic Entertainment design and research a marketing firm estimates that the game is sold 1.4 million copies um I don't know when that date comes from if I click on the citation it brings me to uh Fallout 4 could be bigger than Skyrim yeah so this this is recent number so it seems like Fallout 4 might have already outsold Fallout 3 yeah I believe that we'll see now Colin before we switch gears I want to go to cona funny.com psq that's where you send your questions just like Pi blon said he says I have a",
            "start": 742.16
        },
        {
            "text": "outsold Fallout 3 yeah I believe that we'll see now Colin before we switch gears I want to go to cona funny.com psq that's where you send your questions just like Pi blon said he says I have a Fallout 4 Bethesda questions my question is simple he has questions multiple or is that okay that's my question is simple I've played Fallout 4 for a couple of hours at this point and I've got to say the performance on PS4 is rough the frame rate is not up to Snuff visible in Colin's let's play does Bethesda before making their next game need to quote fix their **** engine end quote as Colin would say this idea that the frame rate is fine as it is fine is a matter of tolerance for people this idea the frame rate is fine at is a matter of to what the **** are you saying can you just this idea that the frame rate is fine is a matter of tolerance for people I thought you're having a stroke okay well I'm trying to put as in as is because that would make more sense but it's fine fa this idea that",
            "start": 791.72
        },
        {
            "text": "the frame rate is fine is a matter of tolerance for people I thought you're having a stroke okay well I'm trying to put as in as is because that would make more sense but it's fine fa this idea that the frame rate is fine a matter of tolerance for people but if Ubisoft made the this idea that the frame rate is fine do you vet these questions but if Ubisoft made this game they'd be bummed and burned for the sake of how it runs they'd be burned for the sake of how it runs I don't even understand the all right do they need to fix their **** engine are are you chalking them up to Telltale are you chalking them up to Assassin's Creed are you chalking them up to no this is such a different story than Telltale The Telltale Games aren't ambitious in any way you know like there's nothing to a Telltale Game it's it's and I'm not insulting them they're fun I'm just saying you're talking about on a technical level not a storytelling level that there's nothing to it yeah there's nothing to it",
            "start": 841.08
        },
        {
            "text": "Telltale Game it's it's and I'm not insulting them they're fun I'm just saying you're talking about on a technical level not a storytelling level that there's nothing to it yeah there's nothing to it though I mean there's there's no excuse why why those games don't run better right like the um they're not taxing the system they're making choices and moving things around not massive open World Games with endless streams of dialogue and moving Parts million different ways it can go you could be wearing this outfit that outfit this AR I've been reading the way Fall 4 could break yeah and again it's just totally random just like it was with New Vegas and three and Skyrim um do I think that they need to fix their engine probably I think that people aren't giving them enough credit for what Fallout 4 does better than Fallout 3 or New Vegas the engine is certainly overhauled um it looks better I'm I think you hear a lot less of all this looks like Fallout 3 it doesn't uh the art style looks",
            "start": 882.12
        },
        {
            "text": "4 does better than Fallout 3 or New Vegas the engine is certainly overhauled um it looks better I'm I think you hear a lot less of all this looks like Fallout 3 it doesn't uh the art style looks like Fallout 3 it's still not a very pretty game um at all I I wouldn't deny that at all I think that I think there's pretty moments to it but I agree there there are moments of geographic moments I would say more than character models or locations there's times when it swings around and I'm shooting my gun and it doesn't slow motion it frames it like perfectly I'm like that actually looks really good now granted I'm not that's my character and the arm **** that I've put on sure but it's not dying light or Witcher you know and that's where I think the where what are the excuses kind of thing comes in yeah and I think that's a valid point do I mean it's the problem though just like even now is they set out to work on probably the next Elder Scrolls and then the next Fallout that like you said",
            "start": 919.64
        },
        {
            "text": "in yeah and I think that's a valid point do I mean it's the problem though just like even now is they set out to work on probably the next Elder Scrolls and then the next Fallout that like you said this game Fallout 4 made in a vacuum right they go in they start working and then whatever happens around them what other games find out well it's too late for that Fallout 4 was in production what before Skyrim even came out so you have to assume that there's only so much you can do this was 2011 you know you have to assume that the game left pre-production so it's it's uh do they do do they get a free pass I think sometimes Bethesda does get a little bit of a pass I just think that it's not necessarily unearned considering the vastness and the ambition of their games and I don't like making excuses I just don't I just don't see it getting much better than it is except that we now have examples of games in Worlds that are much prettier that are just as vast and just as populated that do run",
            "start": 954.56
        },
        {
            "text": "I just don't I just don't see it getting much better than it is except that we now have examples of games in Worlds that are much prettier that are just as vast and just as populated that do run better so they have much to learn I think Bethesda not from the way you make a game but the way your engine probably works and I think that if they look at CD project and techland and what they've done with these open world games of their own they can probably learn a thing or two but I I don't I don't I wouldn't give beesa the hard time I give Telltale or something like that because these are these are complicated games and they can break in many different ways and I I'm sure Qing a game like FL 4 is a really really daunting task I mean the ways you can break these games is vast and we all break them and but he's talking specifically about frame rate yeah the frame rate is is is unfortunate but again you have to wonder like what's streaming in the background and how much they're loading and",
            "start": 993.56
        },
        {
            "text": "them and but he's talking specifically about frame rate yeah the frame rate is is is unfortunate but again you have to wonder like what's streaming in the background and how much they're loading and stuff like that I think that I don't the frame rate having played now 0 hours or so far far on PS4 doesn't bother me that much it's actually the lad times that are ridiculous the the um the lad times are insane actually like actually insane I think and it's something they're long I wouldn't classify as insane on the Greg Miller scale but I understand what you're saying yeah I mean I think well it's like Bloodborne's load time I mean they're almost the same yeah you know uh the problem for me is with the load times right is the fact that I'm on the map right I'm inside a building and I'm like okay I've got my mission objective I have to go to this place across the map and it's like I'm going to fast travel you can't fast travel from inside the building I'm like well that's some ****",
            "start": 1034.92
        },
        {
            "text": "okay I've got my mission objective I have to go to this place across the map and it's like I'm going to fast travel you can't fast travel from inside the building I'm like well that's some **** whatever so I step out into the world there's a load there then as soon as I get out I fast travel over there there's a load there I get to where I'm fast traveling to on the outside of that so then I have to go inside the door and load there too we can just fast travel building to building all right I get the point I know what I'm doing yeah it's it's unfortunate but we do get to go unlike Grand Theft Auto for instance we do get to go into the buildings and so there's there's not all of them but many of them and and so it's there are always going to be uh differences in the way an engine runs in these open world games and the way these are developed I mean if you look at I'm not really that impressed I mean having I didn't haven't played since 2013 but the little time I played with Grand",
            "start": 1071.36
        },
        {
            "text": "in these open world games and the way these are developed I mean if you look at I'm not really that impressed I mean having I didn't haven't played since 2013 but the little time I played with Grand Theft Auto 5 I'm like I'm not that impressed with this either so I I think that it's and I know people love that game so I just think the bar has been unusually set by unusual companies and I think um we're all goingon to have to pay close attention to that uh moving forward I think it makes me more excited for Cyberpunk for instance uh you know I I think CD Projekt did a really great job but I I don't know the the the the the frame rate and all this kind of stuff I understand these people's technical complaints they're the same as they were for Fallout 3 in Fallout New Vegas and we knew we were getting they're not stupid it's not like Bethesda can't attract great talent in any respect obviously they have great storytelling Talent art Talent whatever they can attract engine talent and",
            "start": 1107.0
        },
        {
            "text": "were getting they're not stupid it's not like Bethesda can't attract great talent in any respect obviously they have great storytelling Talent art Talent whatever they can attract engine talent and Engineering talent and they've have done that and I'm sure they're doing the best that they can considering how vast the game is I'd rather them release something like this than not even try you know because it could be easy to get that I can't imagine how daunting it is to put a game out like that you know developers put up um you know in a lot of Studios will make many many many build of a game and they'll upload it and people will play the new build every day or whatever can you imagine having to put everything together in a game like that sure these guys yeah these guys like all right these guys finished some **** with UI you have to tweak that now make sure it works and these guys finish the side quest which is now in the game and you can walk to it and do it and they have to like",
            "start": 1139.28
        },
        {
            "text": "guys finished some **** with UI you have to tweak that now make sure it works and these guys finish the side quest which is now in the game and you can walk to it and do it and they have to like it's a lot it's a lot of work this thing's got to pop over here at this time this has got to go you need this guy to say that but he can only say he not only does he have to say this he can only say it if these three conditions have been met or whatever yeah it's it's complicated I'm not asking for people for you know give bees a **** if you want I just think that all things being equal they do a pretty good job and uh again the epitome of a game made in a vacuum I do not expect that Skyrim or Elder Scrolls 6 and Fallout 4 will be like this you know it wouldn't really hurt for them to maybe Retreat a little bit and make a new engine sure I mean you've already seen like what we talk about what I talk about being one of my most impressive parts of the game right the the fact that you see your",
            "start": 1176.6
        },
        {
            "text": "a little bit and make a new engine sure I mean you've already seen like what we talk about what I talk about being one of my most impressive parts of the game right the the fact that you see your character speak you hear a voice you see the dialogue system I mean that's Mass Effect right like that is the even camera angle I feel on the way you choose thing is Mass Effect so you can see where they took that inspiration and put it into this game think about everything they've played or seen since then now that they can put into the next Skyrim the next Fallout sure I'm excited good we'll get some more Fallout later right now oh number three speaking of Fallout 4 famous porn website PornHub reported that its traffic fell by 10% on the day of Fallout Fallout 4's launch good job according to GameSpot which related the statistics traffic was up 5% during the early morning of Fallout 4's launch date which the site indicates was when the game was is installing for some people this is",
            "start": 1214.28
        },
        {
            "text": "to GameSpot which related the statistics traffic was up 5% during the early morning of Fallout 4's launch date which the site indicates was when the game was is installing for some people this is interesting by 5 a.m. traffic ban the drop from PornHub's norms and dropped 10% in total from 7:00 a.m. to noon that day PornHub noted that quote in the afternoon traffic returned to normal but after 6 p.m. it dropped again when we assumed the nine of five workers arrived home and fired up their games after midnight it seems like everyone finally took a break and traffic jumped as high as 15% above daily Norms end quote got to catch up on all that porn I thought that was pretty clever PR for them that's awesome for PornHub yeah totally attach yourself to this game they really needed I mean every PornHub is but now but it's one of those like usually we don't talk about PornHub on our shows here we are talking about pornhub.com great time to tell you this episode's brought to you no that'd be",
            "start": 1252.4
        },
        {
            "text": "porub is but now but it's one of those like usually we don't talk about PornHub on our shows here we are talking about pornhub.com great time to tell you this episode's brought to you no that'd be awesome that would be awesome number four Sony has revealed the top selling digital games on PlayStation Network for the month of October the top 10 bestselling digital games on PS4 for the month were in order Assassin's Creed Syndicate Uncharted the Nathan Drake collection NBA 2K16 Destiny Minecraft Story Mode episode 1 FIFA 16 Grand Theft Auto 5 rocket League Minecraft and WWE 2K16 so those were the top 10 PS4 games digitally on PS3 the top 10 bestselling games were in order Minecraft Story Mode episode one Minecraft NHL 16 Destiny Grand Theft Auto 5 Motor Storm apocalypse hell yeah Catherine BioShock Bioshock and Dead Island Riptide sale sale sale sale the top 10 best-selling VA games digitally for the month were in order Sword Art Online Hollow fragment Minecraft Don't Starve uh I'm",
            "start": 1286.16
        },
        {
            "text": "BioShock Bioshock and Dead Island Riptide sale sale sale sale the top 10 best-selling VA games digitally for the month were in order Sword Art Online Hollow fragment Minecraft Don't Starve uh I'm sorry Minecraft Don't Starve giant Edition Persona 4 dancing all night Deni Bunko fighting climax which I know you're a huge fan of organ Trail Zero Escape virtue's last reward Heroes of loot which I enjoyed quite a bit Grim Fandango HD and the Firefly diary and the top 10 best-selling PS1 Classics were in order Mega Man Legends Grand Theft Auto San Andreas Resident Evil Resident Evil 3 Nemesis siren Final Fantasy 7 Crash Bandicoot Grand Theft Auto Vice City Resident Evil director's cut and Grim grimoire rocket League what up rocket League Destiny and Call of Duty dominated the add-on charts yeah that Back to the Future DLC for the rocket League everybody wants a DeLorean bet you didn't know that colum a a DeLorean yeah well I went to say Colin it's complicated it's complicated I think I",
            "start": 1332.72
        },
        {
            "text": "yeah that Back to the Future DLC for the rocket League everybody wants a DeLorean bet you didn't know that colum a a DeLorean yeah well I went to say Colin it's complicated it's complicated I think I went to say Kevin so I stopped okay because usually nine times out of 10 I'm yelling at Kevin so I need to make sure his voice his words his name are always fresh in my mind what's next are you surprised are you surprised to see AC at the top of the charts talking about there was no real buildup for that I am surprised yeah but digital sales still seem to be soft Assassin's Creed I think sales were soft I think we would hear a lot more about that if it wasn't the case um so am I surprised I guess but not really I mean you know depends on how they it you did it made you do this but then you went yeah I mean fig that it's way more important for these big AAA games to be on MPD at a high position and they were at number three I'm not saying Assassin's Creed didn't do well I'm saying",
            "start": 1378.04
        },
        {
            "text": "you went yeah I mean fig that it's way more important for these big AAA games to be on MPD at a high position and they were at number three I'm not saying Assassin's Creed didn't do well I'm saying Assassin's Creed didn't do as well as dollars to Donuts I bet you it's down year over year okay you know I agree I'm not goingon to bet you actually anything at all no I know and I might be wrong but that's my inst I just don't feel like listen I said this about Halo 5 and I was right and I was wrong right Halo 5 sold really well compared to everything else but when you look at the we talked about the MPD numbers on Colin and Greg live about how people were doing a lot of math and stuff like that like the numbers for Halo 5 are soft M definitively soft um and I just feel like it's probably the same thing with Assassin's Creed so Assassin's Creed came in thir third but everyone's sales are soft I think people are waiting I I think there's a lot of anticip for the big three this month which",
            "start": 1422.76
        },
        {
            "text": "same thing with Assassin's Creed so Assassin's Creed came in thir third but everyone's sales are soft I think people are waiting I I think there's a lot of anticip for the big three this month which would have been Battlefront Fallout 4 and and Call of Duty so Tomer that's the thing man we were talking I guess we could talk about it now I was looking at MPD um well uh European region sales for on on neoaf for um for Tomb Raider Tomb Raider uh sold something like a third as many copies on Xbox one as it sold when it came out you know when the original tomb raid reboot came out some a couple years ago and uh seemed to have sold maybe an eighth as many copies as playst or as a Fallout 4 at uh retail in the UK or in in Europe funny you mentioned this I thought on our PlayStation podcast we'd make this topic of the show tots tots tots tots tots so you let me read you a quick excerpt here from the internet all right rise the Tomb Raider debuted in fifth place on the UK all format charts",
            "start": 1462.52
        },
        {
            "text": "make this topic of the show tots tots tots tots tots so you let me read you a quick excerpt here from the internet all right rise the Tomb Raider debuted in fifth place on the UK all format charts after selling less than a third of the amount of copies achieved by its predecessor within the same period though rise of the Tomb Raider was universally well received among critics critics it seems that the game gam launch coinciding with the release of the much anticipated Fallout 4 not to mention its exclusivity deal with Microsoft which led to it only releasing on Xbox One and Xbox 360 had a negative impact upon its sales after chart track released the pal all format charts for the week neoa member Bruno MB provided a breakdown of the numbers pulled in by the game revealing that the Xbox One version sold fewer than 48 copies while thex while the Xbox 360 version which debuted in 3rd Place on the charts sold fewer than 8500 copies now that alone is hashtag Colin was right you've been",
            "start": 1508.2
        },
        {
            "text": "version sold fewer than 48 copies while thex while the Xbox 360 version which debuted in 3rd Place on the charts sold fewer than 8500 copies now that alone is hashtag Colin was right you've been banging this drum I mean it was obvious I I know well I know this is one of your easy ones this isn't one we need to get the shirt like it's different audiences and I'm like yeah well nobody wants to ever listen to you Colin I don't know why you're so beautiful I know and right all the time too yeah close you're almost always almost always right that was a false statement we got him honey we got him right there um yeah no surprise there and that honestly that's why you just said you know everybody's looking forward to this month's results right with the big three you just named I I'm really interested to see where Tomb Raider Falls you know what I mean to what exactly that means what extent this is actually all done to it where will it chart you know where does it chart what happens to it",
            "start": 1550.08
        },
        {
            "text": "to see where Tomb Raider Falls you know what I mean to what exactly that means what extent this is actually all done to it where will it chart you know where does it chart what happens to it it's bad I mean it it's it's and I I you're you're right critically the game is killing everyone everyone I know that's played it has said it's great it's fantastic people love it some people's game of the year I think I believe it I absolutely believe that Crystal delivered a game here I can't wait to play when I get back from Thanksgiving um based on like I we have so much stuff to play I probably not even play till PlayStation 4 gets it sure um and maybe even not then um Pro you know what probably never goingon to play it okay I'll tell you about it you can just take my opinion and use it good um but this was obviously gonna happen now I don't think that Square Enix is looking at the numbers and sweating it because there must have been a lot of money exchange for this exclusivity deal I think it",
            "start": 1592.32
        },
        {
            "text": "this was obviously gonna happen now I don't think that Square Enix is looking at the numbers and sweating it because there must have been a lot of money exchange for this exclusivity deal I think it was a huge **** mistake for them to do that if they care about proliferating the game and I think it was obviously a big mistake to release the game when they did um but to Aaron Greenberg's point when he was on the Gam some weeks ago he said that they were just they didn't have any good options and and in a way he's right because it's like well they can put it up against Halo which makes no sense that's their other big exclusive that they actually really own yeah um and then they could put it up against Call of Duty which would have been bad they could put it up against Fallout which they did that would be bad or they can put up against Battlefront I still don't quite understand why you wouldn't hold it until next year or release it earlier really grind and and crunch and get this game",
            "start": 1629.08
        },
        {
            "text": "that would be bad or they can put up against Battlefront I still don't quite understand why you wouldn't hold it until next year or release it earlier really grind and and crunch and get this game done out um but I don't know what it tells us I think that the simplest explanation tends to be the right one right I think that Fallout 4 cannibalized this game just as I told you it would yeah and uh it could be other things it could be that Tomb Raider doesn't have a huge resonance anymore I don't know if I believe that the number the flast one we all love the reboot exactly and it could be that Xbox One just isn't in many people's hands that's true to an extent but there's still about 14 or 15 million there so that's not really it and it's on Xbox 360 as well which there are 80 million of um so I I think that it's just a difficult situation for them being and I wonder when this deal was made and I wonder if this is a what I always say about Titanfall which is that EA in my mind I don't",
            "start": 1662.08
        },
        {
            "text": "so I I think that it's just a difficult situation for them being and I wonder when this deal was made and I wonder if this is a what I always say about Titanfall which is that EA in my mind I don't know one way or the other would probably take that deal back if they could have because Titanfall was really sent to die on Xbox platforms um compared to the way it would have done if it was on everything but I think that even if to their credit even if the game was on PlayStation 4 I don't know that it would have done any better considering PlayStation 4 also gets all these games so it's a tough situation for them and I feel bad I feel bad for them aloom rode in to KindaFunny.com psq just like you can it says hey guys I have a question or a general topic of discussion perhaps how hard is Sony laughing with the temporary exclusive tune Raider being launched the same week as the massive Fallout 4 yes there will be specific players for either game but we both know there are plenty of",
            "start": 1702.56
        },
        {
            "text": "is Sony laughing with the temporary exclusive tune Raider being launched the same week as the massive Fallout 4 yes there will be specific players for either game but we both know there are plenty of Gamers who just want to play both is it a mistake made by Microsoft what could be the point the reviews seem quite good but they are not but they are both not groundbreaking both are basically the same games as this year's predecessor BL does it matter is Sony what do you think Sony is laughing at this one yeah probably and I I think that I think that uh not I don't think you know Sean sitting in his office having a **** chuckle about it I think they look at this and they're like well our third party deals are working and we don't even get these games exclusive we didn't even pay for any of this **** you know they pay obviously for the DLC exclusivity with Call of Duty I'm sure they have some marketing funds that they use for Destiny and stuff this is a there's a transition of",
            "start": 1742.96
        },
        {
            "text": "any of this **** you know they pay obviously for the DLC exclusivity with Call of Duty I'm sure they have some marketing funds that they use for Destiny and stuff this is a there's a transition of capital between these companies whether it's like the destiny deal might be like Sony just pays for the advertising that's a that's a if just anecdotally I don't know if that's true or not but that could be that could be a way for them to save money in the long run right yeah I think that they look at this and are like well what I'm really interested in and people have been saying this for a long time is when the game comes to PS4 which we assume will happen in October November next year will it sell more copies than it sold a year before on an on a platform exclusively that's when Sony has the chuckle that's it get interesting yeah but no I think that Uncharted or Sony has Uncharted coming up which is too Tom Raider is Uncharted was inspired by Tomb Raider and Tomb Raider is now inspired",
            "start": 1786.28
        },
        {
            "text": "chuckle that's it get interesting yeah but no I think that Uncharted or Sony has Uncharted coming up which is too Tom Raider is Uncharted was inspired by Tomb Raider and Tomb Raider is now inspired by Uncharted and so they're going to they're going to have these two things to to kind these two pillars to look at and say like well are Uncharted is gonna sell millions of copies I mean Uncharted 4 is gonna be fine it's gonna sell many millions of copies um so no I don't think Sony's like actively having a laugh but I sure they look at this and been like well that's great for us well Trevor graphy also wrote in to KindaFunny.com psq and says hey guys is it possible that Tomb Raider being a timed exclusive is actually a blessing in disguise coming out on the same day as Fallout 4 was an unfortunate coincidence but it will have an opportunity to shine again a year or so down the road when it's released on PlayStation 4 and probably in some sort of collector's edition with the DLC added",
            "start": 1819.96
        },
        {
            "text": "coincidence but it will have an opportunity to shine again a year or so down the road when it's released on PlayStation 4 and probably in some sort of collector's edition with the DLC added in do you guys think this will help compensate for the loss of sales that went out with Fallout 4 it might but I I think it's all about the way you judge it this deal didn't happen in a vacuum Square got money for this there's no doubt about it they wouldn't do this and and isolate their you know it's the same thing with Titanfall I'm sure like there's got to be some sort of money exchange so I don't think in in a in a revenue point of view that they really care but if they want to have this thing where like we sold x million amount of copies they aren't going to be in trouble you know because I don't game sales are front loaded and we have to assume that this isn't going to be an anomaly where Tomb Raider is going to sell again in December or January maybe it will but that would be unusual you",
            "start": 1857.04
        },
        {
            "text": "game sales are front loaded and we have to assume that this isn't going to be an anomaly where Tomb Raider is going to sell again in December or January maybe it will but that would be unusual you know really unusual yeah you get your you get your sales up front when you have your big move and your pow you're right up there your commercials are running it's brand new everyone's talking about it no one talked about this game and people were yelling at us when we were when we were both saying that before but it's true I on the day it went up I saw tweet about it and Alexa tweet about it and other people tweet about it and every so often I'll see somebody now say oh man two but that's it the rest is Fallout photos this that the other oh my god oh I just got into EA access for Battlefront it's like a delug of other games people are talking about and no one is talking about this so I don't know where you make that ground up when it comes around to PlayStation 4 and the exclusivity deal is",
            "start": 1893.8
        },
        {
            "text": "like a delug of other games people are talking about and no one is talking about this so I don't know where you make that ground up when it comes around to PlayStation 4 and the exclusivity deal is up is it a bigger deal if Sony wants to get behind it and push it if s have no reason to do yeah exactly that's the thing I mean they and they're not going to do that I mean why would you do that you know why would Sony do that when when Square got in bed with Microsoft just make any sense you don't want to reward that kind of behavior if you're a company I don't really give a **** one way or the other but that seems like a weird thing for them to do uh they'll get a cut of every copy sold and that's just the way it works when you own the platform um yeah I think that we have a situation here where I'm I'm blunder this is a blunder and and and I but here's the thing is it even a missable blunder you know what I mean is there a way could like I think Greenberg when I've listened to the",
            "start": 1929.12
        },
        {
            "text": "where I'm I'm blunder this is a blunder and and and I but here's the thing is it even a missable blunder you know what I mean is there a way could like I think Greenberg when I've listened to the show he was on with you guys when I was gone and what you're saying makes sense where or what he says makes sense of like what are we going to do you know what I mean and even when we say all right well **** it you know go gold earlier push it out have a bigger day one patch get it out two weeks early everybody you know then you're on top of Halo right so isn't that the same problem yeah but but this is the assumption that that they knew like it's not like the Fallout 4 date snuck up on Microsoft they knew for probably a really long time I mean they knew the game was in development probably for years I mean I'm sure both platform holders did yeah but Asda has the plat you know has the dev kits they have to go through Microsoft to get the game on there they're not and they were at the ****",
            "start": 1962.16
        },
        {
            "text": "years. I mean, I'm sure both platform holders did. Yeah, but Asda has the plat, you know, has the dev kits. They have to go through Microsoft to get the game on there. They're not and they were at the **** conference, so you have to assume they knew and and I just don't understand why they held to that date. Like I I Aaron Greenberg's a smart dude and I think he knows way more about both of us combin times 100 about how to market a game and all. There's no doubt about that, but I don't understand. I don't understand the loss of saying let's just hold it. It's done. Let's just hold it, you know, like and release it in February. It's contractually obligated the way they're going through maybe, but like who it, let's say it's contractual, then who does that benefit the hold of the contract? Like that's just that would be weird too. Yeah, Square was probably like holy ****, like what are we going to do and I'm sure and the argument can be made of course and it was made and Aaron made the argument very",
            "start": 1998.28
        },
        {
            "text": "that would be weird too. Yeah, Square was probably like holy ****, like what are we going to do and I'm sure and the argument can be made of course and it was made and Aaron made the argument very eloquently that well where do we go and and we we we can't go anywhere, but my argument is like if you can't get the game done earlier which it makes sense then you hold it and you release it in February. To his point, he says that that yeah, that can really injure, I think he says it on the podcast that that or I read it somewhere else that that can injure a game by holding it and then releasing it in in the winter, but it couldn't it can't be any worse than this. Like I mean that's the is like this is bad and and that's why mum's the word. Like I haven't heard **** about Tomb Raider sales like in an official capacity. Microsoft's not touting like how well the bundle sold or anything like that. They're not saying anything. Yeah, so it's bad and and uh I think that this is a unfortunate this is a",
            "start": 2037.6
        },
        {
            "text": "an official capacity. Microsoft's not touting like how well the bundle sold or anything like that. They're not saying anything. Yeah, so it's bad and and uh I think that this is a unfortunate this is a tragic this is a tragic kind of thing for a game and if you look at it from aat people who work super hard on this yeah like it's i' if I was I'd be like this sucks yeah you know like we really worked hard on this game we made a great game and and uh no one's playing it and I'd be really **** bummed about that if I was them and I feel bad. I really do feel bad for them. Yeah, um I just don't understand how you think that it's a good idea to release it at the same day as Fallout 4. I mean, I told people I said this for **** months since E3 and a lot of people believed me and agreed, but some people were like you're wrong blah blah blah no I wasn't it I mean it was so obvious it was so **** obvious this was going to happen in this game yeah um and uh I don't think that it can live again like",
            "start": 2073.4
        },
        {
            "text": "were like you're wrong blah blah blah no I wasn't it I mean it was so obvious it was so **** obvious this was going to happen in this game yeah um and uh I don't think that it can live again like I I just that's not the way it works that's not the way the market Works maybe when the game gets so like $40 $30 people going to start buying it maybe people for Christmas people will buy but you'll never have that moment you know what I mean you have a moment when you release a game this was the game's moment and if you're going to say well maybe it'll have a moment when it's released coming up on PlayStation 4 as you know the special edition did The Definitive Edition of Tomb Raider have a moment it did okay on P came out but it wasn't it wasn't again like holy **** everybody stop what you're doing this is all anyone's talking about yeah and Sony's not going to market this game by by if you assume that Final Fantasy 15 is really going to come out next year which I don't but if you if",
            "start": 2112.0
        },
        {
            "text": "doing this is all anyone's talking about yeah and Sony's not going to market this game by by if you assume that Final Fantasy 15 is really going to come out next year which I don't but if you if you assume that it's going to come out in the fall Square Enix's marketing money is spoken for so like what do you do you know like I just it's really an unfortunate situation it's an unfortunate situation for Microsoft unfortunate situation for Square Enix and it's an unfortunate situation for gamers because we are Gamers we as a group of Gamers typically move forward and we have to move to the next thing we're excited about the next thing and Tomb Raider is just going to lose like it's going to lose so unless the anomaly is totally broken I mean this would be a huge anomaly if if Tomb Raider sales were better in November than they were in October for instance I mean that just doesn't happen yeah you know like or I guess that's wrong no better nove December than they are in November um yeah I'm",
            "start": 2147.64
        },
        {
            "text": "were better in November than they were in October for instance I mean that just doesn't happen yeah you know like or I guess that's wrong no better nove December than they are in November um yeah I'm I'm it's a quagmire Colin it is it is and I I I agree that there's no good way around it again we have made a living of talking about things that we don't understand always understand 100% or well I think we understand things quite well uh I think that's what people like the show but we don't quite understand the the minutia and the In-N-Outs of or the ins and outs of marketing a game how much it costs what's the burn of holding a game yeah uh what does the evidence show when you do something like that does it work out or doesn't it work out uh marketing dollars could already be allotted for Quantum Break and Crackdown and all these kinds of things next year there's all sorts there's all sorts of **** that you have to think about um and getting in in the way of other games so you know",
            "start": 2179.68
        },
        {
            "text": "Quantum Break and Crackdown and all these kinds of things next year there's all sorts there's all sorts of **** that you have to think about um and getting in in the way of other games so you know we don't quite understand it and I don't think that them I don't think that it was just it seems like a blunder and I think it was a blunder but I just don't there might not have been every choice might have been a blunder and that's the thing this wasn't an arbitrary choice I don't think it was them just standing their ground like no **** Fallout we're a big deal too I think it was that they were played into backed into a corner right like well what do we you know any way you go something bad happens this is the way we're going to go yeah but the people I really feel bad for are Crystal Dynamics 100% uh number five is uh I'm gonna read an article from Kotaku's Jason Shrier a friend of ours um instead of distilling it down I just want to read this article we read it on Colin Greg live",
            "start": 2223.6
        },
        {
            "text": "Dynamics 100% uh number five is uh I'm gonna read an article from Kotaku's Jason Shrier a friend of ours um instead of distilling it down I just want to read this article we read it on Colin Greg live today um but people might have seen Jason's piece or just a lot of the news going around after the ISIS attack in Paris uh reporting error leads to speculation that terrorists use PS4s to plan Paris attacks and I thought instead of distilling it down into a story you know rewriting it basically and citing Jason I thought I'd read the story because this shows you this is relevant to our audience because it's a PlayStation 4 story and it's a story that we've all seen in the news over the last few days but it also goes to show you like how bad journalism is getting in the game industry and I think Jason did a really nice not just the games IND no not just the games industry but in the industry at large but we games develop games journalists have to take you know let's just get into it read",
            "start": 2256.72
        },
        {
            "text": "Jason did a really nice not just the games IND no not just the games industry but in the industry at large but we games develop games journalists have to take you know let's just get into it read the article Colin Jason writes The Following last Friday Islamic State terrorists attacked several locations in Paris France killing more than 1 0 people and injuring hundreds more over the weekend as more information emerged reporters and analysts began to speculate that the terrorists use an unlikely tool for coordination the PlayStation 4 as it turns out that was all based on a reporting mistake anyone can log into a PS4 and use Sony's Online service Playstation Network to communicate by text or voice with others on the platform excuse me the service is both easy to use and difficult to track which would presumably make it perfect for people who want want to plan criminal activity there's been no proof however that ISIS used PS4s to plot out what happened last week despite the wave of",
            "start": 2292.44
        },
        {
            "text": "which would presumably make it perfect for people who want want to plan criminal activity there's been no proof however that ISIS used PS4s to plot out what happened last week despite the wave of media reports this weekend so why have so many people link the PS4 to last week's attacks the speculation appears to have started with a rather silly Forbes article titled how Paris ISIS terrorists may have used PlayStation 4 to discuss and plan attacks the article which has over 475 000 page views and theorizes that a terrorist could also quote spell out an attack plan in Super Mario Maker coins and share privately with a friend end quote which is yeah similar to when Mike Duer spelled that fart right exactly reports that a Belgian official Drew links between the PlayStation and the Paris attacks Forbes originally wrote The Following quote the hunt for those responsible eight terrorists were killed Saturday night but accomplishes may still be at large led to a number of raids in nearby",
            "start": 2334.92
        },
        {
            "text": "Forbes originally wrote The Following quote the hunt for those responsible eight terrorists were killed Saturday night but accomplishes may still be at large led to a number of raids in nearby Brussels evidence reportedly turned up included at least one PlayStation 4 console Belgian Federal home affairs minister Yan Yamon said outright that the PS4 is used by ISIS agents to communicate and was selected due to the fact that it's notoriously hard to monitor quote PlayStation 4 is even more difficult to keep track of than WhatsApp end quot he said Jason continues what Forbes missed was that Yanon actually made those comments on November 10th 3 days before the Paris attack Yambo was speaking in broader context of Belgium security weaknesses not drawing a connection between the PS4 and last week's terrorism and as for the PlayStation 4 that Forb said was found in the raids turns out that was an error which theyve since edited out the writer of the Forbes article Paul Tassi gave Kotaku the",
            "start": 2371.04
        },
        {
            "text": "terrorism and as for the PlayStation 4 that Forb said was found in the raids turns out that was an error which theyve since edited out the writer of the Forbes article Paul Tassi gave Kotaku the following statement he said quote this was actually a mistake that I've had to edit and correct I misread The Minister's statement because even though he was specifically saying that PS4 was used by ISIS to communicate there is no public list of evidence list or evidence list of what was found in the specific recent raids I've edited the post to reflect that and it was more meant to be about discussing why or how groups like Isis can use consoles it's my fault as I misinterpreted his statement in quote the timing of Yan Bon's statement and some leading and some misleading reporting has led to a wave of unfounded speculation that's blown up all across national news or national media from CNN the Fox News and continues to all that said there's plenty of evidence that terrorists have been taking",
            "start": 2410.4
        },
        {
            "text": "of unfounded speculation that's blown up all across national news or national media from CNN the Fox News and continues to all that said there's plenty of evidence that terrorists have been taking advantage of online video game Services the Edward Snowden leaks in 3 revealed that NSA kept tabs on games like Second Life in World of Warcraft in May an Austrian teenager with ties to Isis was arrested for allegedly using his PlayStation to store bomb plans and of course Yone State uh comments can't be dismissed even if they're not directly connected to last week's terrorism when we ask Sony for comment on all this it sent over a mundane statement it says quote PlayStation 4 allows for communication amongst friends and fellow gamers in common with all modern connected devices we take our responsibilities to protect our users extremely seriously and we urge our users and partners to report activities that may be offensive suspicious or illegal when we identify or are notified of such",
            "start": 2443.84
        },
        {
            "text": "responsibilities to protect our users extremely seriously and we urge our users and partners to report activities that may be offensive suspicious or illegal when we identify or are notified of such conduct we are committed to taking appropriate actions in conjunction with the appropriate authorities end quote of course whether or not the Paris attackers use PlayStation Force to coordinate the possibility will always be there short of strictly monitoring every bit of communication between the PlayStation Network's 65 million active monthly users there is much Sony can do to prevent terrorists from using their service to coordinate attacks it's a chilling thought um that's the end of the story yeah I wanted to read that because that I've been seeing a lot of this and I'm like I saw this morning on uh whatever Willie G show is that he was talking about and that he yeah they were quoting the still as Joe probably yeah well I feel like he was guest starring on like the The Today Show or",
            "start": 2479.96
        },
        {
            "text": "on uh whatever Willie G show is that he was talking about and that he yeah they were quoting the still as Joe probably yeah well I feel like he was guest starring on like the The Today Show or something anyways that they're still using this as fact they brought on an FBI analyst that he were talking to him about like is this a real thing he's like yeah it is and it's the hardest thing but the problem that what raised my hair was when he was talking about the fact of uh yeah this is still a thing and it's really you know Silicon Valley not working with us in that us being the government you know what I mean or the justice department or whatever and that they're building these things and then not helping us monitor the people on them and and the the people he was talking to were like that is and it's like the way he phrased it I'm like I don't really want Silicon Valley to feel like they need to bend over backwards to work for you totally complicated issue I'm not I'm not you know what",
            "start": 2511.8
        },
        {
            "text": "and it's like the way he phrased it I'm like I don't really want Silicon Valley to feel like they need to bend over backwards to work for you totally complicated issue I'm not I'm not you know what I mean I'm not saying it's cutting dry here but it's like I don't like but we have a responsibility I think to there's so much churn in games journalism like a disgusting amount of it yeah that it seems to be more about like getting a story right like up and and citing things that are not even factual and then misread **** and like it propagating stories that aren't true and one of the things I was thinking about For Better or For Worse is you know we know Sony people at Sony very well what happened you're like leaning on your phone or whatever Siri's going off oh it is Siri that's relax um we know like the Sony PR Team all of them yeah and I was just thinking about them this weekend where I'm like man this I like when I thought that it was actually true at first I was like oh man this is",
            "start": 2548.72
        },
        {
            "text": "know like the Sony PR Team all of them yeah and I was just thinking about them this weekend where I'm like man this I like when I thought that it was actually true at first I was like oh man this is a tough one then when I saw that like it's it's kind of just a statement being made that maybe it's happening that we don't really know the connections and people are just kind of talking out of their ass frankly um and I feel like that Forbes article is talking out of his ass um it's it's just unfortunate that we the drive for clicks and the drive for just taking advantage of the zeit at the time which unfortunately in this situation is a **** terrorist attack it's just it just sucks you know I mean and and I I I just I we owe journalism all Ross the board is just getting really not very good and and um we just owe it more to ourselves and our audience I think to just you know we sometimes we you know whenever I make a mistake I always go out of my way to correct it and and and I think",
            "start": 2594.68
        },
        {
            "text": "and and um we just owe it more to ourselves and our audience I think to just you know we sometimes we you know whenever I make a mistake I always go out of my way to correct it and and and I think people that make mistakes on these sites correct them as well but I just get why people are very skeptical recently of of the media right like especially in my party the Republican party it's like oh we don't trust the media well I get I don't really trust the media either and you see **** like this and it's just it's just clickbait you know like it it really is like it's it's this is what you draw out of this is like this is this is what you draw out of this is is is a is a a man says something 10 three days before the attacks and it spiral is just added **** out thing about it is it would have been even if you weren't linking it to the if you weren't saying the attacks that just happened on Friday were based on or you know talked about on a PlayStation 4 right the even with the lens of",
            "start": 2637.76
        },
        {
            "text": "been even if you weren't linking it to the if you weren't saying the attacks that just happened on Friday were based on or you know talked about on a PlayStation 4 right the even with the lens of that these attacks just happen on Friday and this guy said like you know they do have the dude saying that that they believe this is happening da D that's good enough you know what I mean in terms of what you're we don't have to exactly we don't have to spin it in like Spin A Yarn here about yeah about it's if you don't have journalism is supposed to be about facts you know I mean and that's that's we've talked we've had this conversation on Colin Greg we've had this conversation on the Gamescast and on Kinda Funny or on a Gamer Greg show I think we've had it here where are the **** facts people are injecting themselves way too much into the news and they're and they are injecting their opinions way too much into the news which is fine if it's an editorial there's a place for editorializing",
            "start": 2682.96
        },
        {
            "text": "are injecting themselves way too much into the news and they're and they are injecting their opinions way too much into the news which is fine if it's an editorial there's a place for editorializing and op-eds and all that kind of stuff but where are the facts this is the problem is that like I don't just generally has nothing to do necessar with games journalism although it's it's certainly a culprit it's like who do you trust who do who's giving you the facts that's why when people ask me I'm like well if it's not from the AP reiders I don't even really believe it yeah well the problem here is like the fact that I don't like the Forbes guy made a mistake you know what I mean he made a mistake he didn't get this date is there something you would like to had him caught sure of course but you're going you think you have something you ran with it whatever the problem now with checking your facts or whatever right is everyone still reporting it I I **** I saw this on the news this",
            "start": 2719.36
        },
        {
            "text": "but you're going you think you have something you ran with it whatever the problem now with checking your facts or whatever right is everyone still reporting it I I **** I saw this on the news this morning at my vet's office then I came in to call live a Twitch Morning Show and we're setting the record straight and it's like wait where where's the disconnect there you know what I mean why weren't any of these people going through and checking it but they were doing the same thing of there's the clickbait right there's everybody who's regurgitating the original article without looking at the dates or trying to check anything right trying to do any of their own leg work for it yeah and I'm not I'm not hypotheticals are interesting and they're fascinating I love hypotheticals you know like I I we we talk about them a lot but we're not journalists and and and we don't claim to be you know um I'm certainly not a journalist yeah and you're certainly not a journalist and I just I want",
            "start": 2752.68
        },
        {
            "text": "like I I we we talk about them a lot but we're not journalists and and and we don't claim to be you know um I'm certainly not a journalist yeah and you're certainly not a journalist and I just I want people to just find those sources you trust and and support those sources and stuff like that but I just I I'm just sick of taking everything with a grain of salt it's like I just want to be able to turn on the TV or read a news article and be like this is the way it is and if we find out that the ISIS terrorist for instance used PlayStation 4 definitively then report that that's the news yeah you know but I don't know I just wanted to read that out there because the the other thing to take away from this is that in the eye of the hurricane of any disaster horrible you know tragedy don't believe the news you're reading you know what I mean don't immediately jump on this you know we were getting ready to watch something last night with dinner and flipped over and it was CNN reporting on",
            "start": 2785.52
        },
        {
            "text": "the news you're reading you know what I mean don't immediately jump on this you know we were getting ready to watch something last night with dinner and flipped over and it was CNN reporting on these people fleeing the scene and that people were running people were running in in Paris you know while they were getting ready to do some standup interview and Christine was like what and we both are like oh God what's happening you sit there and you listen to them for seconds you're like okay they don't have any **** idea this is nothing we went and watched our show came back an hour later you know you turn off the DVR comes back to live TV same thing they're talking about the people are running and it turns out that it was firecrackers right it's the same thing I I always go back I I recently I had to do this with a A friend of mine who's going to Mizzou right now right Mizzou it was in all sorts of turmoil last week which is now forgotten because of this cuz our cycle of course is not",
            "start": 2828.04
        },
        {
            "text": "I had to do this with a A friend of mine who's going to Mizzou right now right Mizzou it was in all sorts of turmoil last week which is now forgotten because of this cuz our cycle of course is not to analyze something act on it fix things right the national story is is that here's the next disaster here's the next disaster here's the next you know what I mean but all this stuff was going on at Mizzou right and he was telling me that oh my god there I we're hearing reports that you know the KKK's on campus that people are walking around with guns da da da da da and I was like I understand that and you need to stay safe and don't get me wrong don't go out of your way I'm like but none of that's happening and I'm like I can say that as a guy sitting on his couch in San Francisco totally away from this but I can tell you right now I remember right after 9/11 when I was going to Mizzou all it was was go get your car f up right now the gas is going to go up they're invading this this is Happ",
            "start": 2860.28
        },
        {
            "text": "this but I can tell you right now I remember right after 9/11 when I was going to Mizzou all it was was go get your car f up right now the gas is going to go up they're invading this this is Happ you know what I mean like these things happen and one person says something that they think they saw and it becomes news in fact and that's the thing and so that's the problem I mean that's one of the main problems right you're talking about go to people you trust yes that's when you have to turn off the Twitter blinders and actually go to a reporting thing like like you're saying with AP yeah like the soci or something it's just I don't know not the cable news that's trying to fill a 24-hour cycle and tell you I'm not trying to pick on anyone specifically or any Outlet specifically it's just let's just slow the **** down a little bit and and talk about the facts yeah that's all I care about I'm really not curious about your opinions on you know X Y and Z if there are no facts to back up",
            "start": 2899.16
        },
        {
            "text": "just slow the **** down a little bit and and talk about the facts yeah that's all I care about I'm really not curious about your opinions on you know X Y and Z if there are no facts to back up what you're saying because I'm looking at the article and it's and and the title is how Paris Isis terrorists may have used PlayStation 4 to discuss and plan ATT taxs and then it says updated in in Brackets and then it says correction it is not been confirmed as originally written that a console was found as a result of a specific Belgian Terror raid you know Minister yo was speaking about tactics he knows Isis to be using generally okay well that under the entire notion of the article at that point I don't know if it's so much correction as it should be a retraction yeah exactly so see how that like your headline is what people are reporting on it's still talking about it's just strange I just I just don't understand like and as people who use PlayStation 4 messaging I would tell you I will",
            "start": 2932.64
        },
        {
            "text": "like your headline is what people are reporting on it's still talking about it's just strange I just I just don't understand like and as people who use PlayStation 4 messaging I would tell you I will never plan anything in it terrible can you imagine oh I mean all the maybe that was what Isis wanted to do and then they were like oh forget it wait I can't change my I got to update my firmware I can't CH update my firmware I can't change my PlayStation name I got this guy trying to join me in 13 groups number six number six some Street Fighter 5 news for starters Capcom has decided to tone down some of the more sexual animations in scenery portrayed by Fighters Armika and Camy which has caused some controversy I don't know if you've seen that right I've seen yeah well from the beginning we've been saying I remember when they debuted that new person we like she's voluptuous yeah she is she's not the game may also be more accessible than previous Street Fighter games Capcom's Brian Ayers",
            "start": 2971.04
        },
        {
            "text": "been saying I remember when they debuted that new person we like she's voluptuous yeah she is she's not the game may also be more accessible than previous Street Fighter games Capcom's Brian Ayers told MCV quote the Ambitions with Street Fighter 5 were to make the game approachable and accessible again but also to make everything with the feel a lot more individual and bring out more chances for people to find the right competitor that suits them Ellipsis we really hope that Street Fighter 5 can bring in a newer younger audience perhaps more of an Esports audience as well Street Fighter is actually one of the first Esports titles out there but it's relatively underground compared to the likes of Dota and League of Legends and quote I imagine that's going to infuriate Street Fighter fans but they can let us know that because I'm not a hardcore Street Fighter fan um but accessibility that's every street fighter every street like I feel like the last the last one for sure had like one",
            "start": 3011.8
        },
        {
            "text": "but they can let us know that because I'm not a hardcore Street Fighter fan um but accessibility that's every street fighter every street like I feel like the last the last one for sure had like one button mode or some garbage like that right where it's just like no going to be totally except one I look at it still I'm like no thanks not to mention why do I want to play the dumb down version of the game it's this is like he's saying it's an ort right it's a sport it's a skill sit there and put in the time to get good at Street Fighter I don't want to come in and be like all right now I just say a all the time and this happens it's Mortal Kombat pay for your fatalities you can just use them on the fatality button it's like what the hell you talking about number seven it looks like we're going to have a good long time to enjoy Fallout 4's upcoming DLC offerings and a conversation with mingle media as transcribed by Game Zone Fallout for game director Todd Howard noted that his team is",
            "start": 3044.24
        },
        {
            "text": "to have a good long time to enjoy Fallout 4's upcoming DLC offerings and a conversation with mingle media as transcribed by Game Zone Fallout for game director Todd Howard noted that his team is on the DLC grind quot we're doing it we have a bunch coming next year the game is huge but it's not just this launch it's going to be well deep into next year it's like the game is done but it's not done because until everyone plays it it's not really done end quote so what he's indicating is that they am they're working on the DLC it's going to go well into 2016 the DLC schedule which is not a huge surprise and um there what I read into this is that their entire vision is not realized until until it's realized and that com game the complete thing Colin wolf a47 wrote into kindafunny.com psq just like you can to get your questions read by the time you read this it would be a week of playing Fallout 4 so my question for you is so far what is your most likely to be favorite Andor memorable",
            "start": 3080.08
        },
        {
            "text": "just like you can to get your questions read by the time you read this it would be a week of playing Fallout 4 so my question for you is so far what is your most likely to be favorite Andor memorable quests in the game no spoilers for example my most memorable and favorite quest in Fallout 3 was helping Mor Moria I don't remember Moria brown right the Wasteland Survival Guide P remember that I love Fallout 4 that was an early one that's an early and you but mostly Fallout 4 do you have a quest so far that stood out to you yeah I mean how would we talk about without spoiling it I don't I don't I do but I'm not going to say anything I don't want to spoil it I mean mine's I think I can do it with Mine mine's the glowing sea when you're told to go to the glowing sea for the first time or whatever right and it's just for me it was this epic moment of like all right cool and you get in there and you have to kind of get prepared for it you're going in and it just keeps building and building",
            "start": 3120.52
        },
        {
            "text": "right and it's just for me it was this epic moment of like all right cool and you get in there and you have to kind of get prepared for it you're going in and it just keeps building and building and building and all this cool shit's happening all this it's crazy visuals and all these different and it's like that was like the time playing the game where I was like the first one of the first times I guess where I'm playing I'm like oh this is **** awesome like so you know what I mean like this is the moment I'm going to remember I was in that moment like celebrating what was already happening similar to how I felt Fallout 3 was when you left the Vault for the first time when there's that buildup and it opens and da we always talk about it or have talked about in the show Fallout for didn't have that exact same Vibe because we' already seen it and plus we've already done it you've already left the Vault you know what that's like from Fallout 3 so this one though was the this is",
            "start": 3169.28
        },
        {
            "text": "didn't have that exact same Vibe because we' already seen it and plus we've already done it you've already left the Vault you know what that's like from Fallout 3 so this one though was the this is unexpected oh oh oh oh oh and like I liked that a lot I love that cool yeah I don't want to I I don't want to speak too okay I don't want people are sensitive about the spoilers double blink for me if it involed Rick I don't know what you're saying number eight I was talking in code Call of Duty Black Ops 3 absolutely slaughtered during its first three days on the market generated northward of $550 million in Revenue around the world making it according to Activision quote the biggest entertainment launch of the year end quot according to Gamespot however it's unclear whether the money made is attributed only to software sold or if the PlayStation 4 bundle was also counted however the numbers still seem soft by Black Ops and Call of Duty standards as Gamespot points out that Call of Duty",
            "start": 3202.0
        },
        {
            "text": "attributed only to software sold or if the PlayStation 4 bundle was also counted however the numbers still seem soft by Black Ops and Call of Duty standards as Gamespot points out that Call of Duty Black Ops 2 made $500 million in only a day in 2012 nonetheless Activision states that sales of Black Ops 3 Rose significantly in quotes over the last two Call of Duty games 2013's ghost and 2014's Advanced Warfare digital downloads were apparently a Big Driver this time around so Duty doing you know driving along you enjoyed what you play I did I haven't gotten back to it yet but yeah we that's the time of year right now and number nine final some uh random things here to talk about as we usually end the rer report single possessive Gravity Rush remastered the PS4 re-release of the VA game is coming February 9th as we already knew but it's now confirmed to be getting a retail release in addition to a digital release it was originally scheduled to be digital only as a tease for the upcoming",
            "start": 3239.48
        },
        {
            "text": "February 9th as we already knew but it's now confirmed to be getting a retail release in addition to a digital release it was originally scheduled to be digital only as a tease for the upcoming PS4 exclusive Gravity Rush 2 and people were Furious they were ready to claw Sony's eyes out they demanded their physical copy of this game Colin I know now they're getting it o says I loved Gravity Rush and I'm extremely excited to see it coming back to PlayStation 4 but I find it really strange how often articles about it are flooded with comments saying they won't buy it because it isn't on Vita acting like it's a big betrayal to move the game to PlayStation 4 but if people really like the game enough to get that passionate about it shouldn't they want it on the leading platform as much as I love my vaita wouldn't releasing it on the handheld be a huge detriment to the development of the series thanks odino yeah I get both sides of it I mean the the gra the region Gravity Rush is relevant at",
            "start": 3278.88
        },
        {
            "text": "my vaita wouldn't releasing it on the handheld be a huge detriment to the development of the series thanks odino yeah I get both sides of it I mean the the gra the region Gravity Rush is relevant at all is because of the people that bought it on Vita so there there is some sort of ownership over the over the game from the Vita the vaita clan that bought it and it and it supported that that game at the same time if if Sony thought that it was viable on Vita they probably would have made the sequel on Vita so you know I my question is could it have been on both you and I don't know the answer to that they want look good on PlayStation 4 then V would be the whole back if you want the the honest answer to your question here odino the real thing is like you know people are this is totally what we're always talking about with vote with your wallet there are tons of people Furious about this and guess what they're all gonna **** buy it if you're a Gravity Rush fan you're going to buy",
            "start": 3317.08
        },
        {
            "text": "what we're always talking about with vote with your wallet there are tons of people Furious about this and guess what they're all gonna **** buy it if you're a Gravity Rush fan you're going to buy Gravity Rush on PlayStation 4 I I have I think there is no credibility to the people who are and don't get me wrong I'm sure you're out there like wait I said it and I do think it sure a few of you but the overwhelming majority who are like well no buy then if it's not on Vita no you're the hardest of Hardcore PlayStation fans and you love this franchise and by the time it gets here you'll be excited about it and want to support it and that's the whole thing that it comes down to yeah if Sony thought they would have moved units and done it they would have done it and so even if it you the hardcore Gravity Rush fan out there right now are like well I'm not buying it then the the number of new people who will buy it are going to outpace what it would have sold on Vita what it probably sold",
            "start": 3356.36
        },
        {
            "text": "Gravity Rush fan out there right now are like well I'm not buying it then the the number of new people who will buy it are going to outpace what it would have sold on Vita what it probably sold on Vita the first time around it's it's an econ a game of economics and I don't believe the people who are saying they're not going to do it uh yeah I we joke or I've joked around about it in this show that this is you know this that and the other whatever you know what I mean like I as long I'm more concerned the fact the game looks exactly like the Original Gravity Rush it did they do I reviewed that did you read my review and did you make any of the changes I wanted you to make or is it literally the same setting and same everything just upred models because I don't want that yeah people like the game way more than I did anyway so I wasn't I wasn't into it at all yeah um other stuff from number nine number nine strategy RPG IU seni the world Conquest will be coming to Playstation 3 on",
            "start": 3389.48
        },
        {
            "text": "the game way more than I did anyway so I wasn't I wasn't into it at all yeah um other stuff from number nine number nine strategy RPG IU seni the world Conquest will be coming to Playstation 3 on November 4th looks pretty cool and Ronda Rousey will be the cover Athlete on EA's UFC 2 with EA Sports Brad Hilderbrand confirming ESPN that she will still be on the cover even though she lost a big fight this weekend Underdog Holly Holm apparently she got you know kicked in the neck knocked out yeah um so she'll still be on the cover that's not a huge surprise I was reading I don't know much about about MMA and I know that Ronda Rousey's been in the news or whatever and she beat the **** out of that other chick you know like a few months ago um that's how she's been all of her opponents is beating the **** out of them for two seconds but apparent I was reading the comments on ESPN I just went on ESPN like a day or two ago to you know I just I read ESPN and uh they um the comments were",
            "start": 3425.0
        },
        {
            "text": "the **** out of them for two seconds but apparent I was reading the comments on ESPN I just went on ESPN like a day or two ago to you know I just I read ESPN and uh they um the comments were quite unkind to her I it seems like hate her like I didn't realize that I thought that yeah I thought people liked her people were like hard as hell on Rousey like I can't speak to the ESPN ESPN audience it was Despicable I thought last night or two nights ago no last night right or whatever no the night of the fight Saturday I'm on there right and literally you know I I like Ronda Rousey fine you know what I mean I enjoy her fights I enjoy she's a Pokemon fan fan she likes video games she's entertaining she's every every like movie I've seen her in I'm like all right cool you're whatever I follow her on Instagram like yeah I like what you're doing here lady and the fever pitch that is built with every one of her wins and people tweeting about her and doing all this stuff all washed away in one",
            "start": 3461.76
        },
        {
            "text": "on Instagram like yeah I like what you're doing here lady and the fever pitch that is built with every one of her wins and people tweeting about her and doing all this stuff all washed away in one night she got and everyone was like celebrating this like crazy thing not like they hated her but like oh I can't believe she went down there like using like the Friday gifts and you got knocked the **** out and all stuff and it's just like what you all liked her so much a second ago like what I mean like I like you want to talk about fair weather you know what I mean like this what I was talking about with Nick today when I was like did you watch Fight he's like no but he's like he's like fighting fans are already fair weather cuz there's really there's the hardcore fighting people who understand it and then there's everybody who gets excited about one person and when they get excited about one person they think that person can't lose and then you know they go out there and get kicked in",
            "start": 3500.44
        },
        {
            "text": "it and then there's everybody who gets excited about one person and when they get excited about one person they think that person can't lose and then you know they go out there and get kicked in the neck like 7 seconds into the match or whatever and it was just like but damn like it was like all of a sudden just work everybody was like making jokes at expense I couldn't uh I couldn't believe the harshness of the comments I was reading about her just uh yeah generally that like she's unlike people think she's unlikable and she's cocky and all these kinds of things and it seemed like the way she was fighting this particular person wasn't a very smart way to fight her that like she had a plan and she stuck with it and she probably should have you know not stuck with um but people Everyone Lo well not everyone I guess but people people lose not everyone not every fighter loses um I've never lost but uh you know she'll be back yeah she's 1 and one or something I mean that's pretty good",
            "start": 3534.88
        },
        {
            "text": "Lo well not everyone I guess but people people lose not everyone not every fighter loses um I've never lost but uh you know she'll be back yeah she's 1 and one or something I mean that's pretty good yeah I hope she comes back and has her whole that'll be the funny thing though she'll come back and she'll win again every be back like ah never doubted you Dana White was talking about how he wants them like wants a rematch yeah I'm sure Dana White does yeah that's the whole thing is like UFC like it's cuz like after not this the last fight the fight before this fight there was all the articles of like UFC's **** like they're doing great right now everybody loves her though and she's unbeatable you know what I mean like what there's no one that can compete with her and how are they going to deal with that and da and like ESPN or I'm sorry UFC is just happy I'm sure to have people talking about UFC in you know this volume right and have her on she was on you know Jimmy Kimel and Jimmy F",
            "start": 3567.08
        },
        {
            "text": "deal with that and da and like ESPN or I'm sorry UFC is just happy I'm sure to have people talking about UFC in you know this volume right and have her on she was on you know Jimmy Kimel and Jimmy F All That Jazz you know have this like celebrity star that they have who's in movies and doing all this crossover stuff and getting the sport out there to different people and so I'm sure that yeah Dana White wants her hungry and ready to go and like that's the thing is like that might be that'll be a super interesting fight because now she's going to be like oh **** well what I my plan didn't work so I have reild it there was some absurd I saw some people saying some absurd **** though too about like all the conjecture that like it was so ridiculous when people were saying like she could fight take Floyd Mayweather and stuff like that and I'm like everyone needs to relax you know a little bit that was yeah before this fight there was a lot and she was the first I think to say like no",
            "start": 3605.8
        },
        {
            "text": "fight take Floyd Mayweather and stuff like that and I'm like everyone needs to relax you know a little bit that was yeah before this fight there was a lot and she was the first I think to say like no that does that that wouldn't really work out yeah I don't I don't I don't think so um that said she could walk into this room and **** murder me and you in one second and that's with us having weapons we have chains and I'll be clawing up this **** wall trying to get out of here climb the castle colins that's that's it for the news oh is it it is well col on I'll tell you what I'm not that excited about that UFC game but maybe by the time it gets here I will be if I wanted to know what was in mom and grop shops right now where would I go the upcoming lists of PlayStation 4 and Playstation V software by the kinda funny Cod Founders some interesting things here starting with arcade arcade archives Shanghai 3 PS4 digitally in the sequel to the legendary majang tile matching puzzle game",
            "start": 3643.12
        },
        {
            "text": "V software by the kinda funny Cod Founders some interesting things here starting with arcade arcade archives Shanghai 3 PS4 digitally in the sequel to the legendary majang tile matching puzzle game players pick from an assortment of zodiac themed tile patterns such as Dragon Tiger Etc yes the object is to clear all the tiles from the screen by matching them in pairs so it's Maj yes thank you for explaining thank you explaining the rules of ma Borderlands triple pack comes to PS3 retail shoot and loot as you explore the Mayhem field world of Borderlands across all three critically acclaimed games experienced the award-winning FPS RPG series including the Mayhem of Borderlands handsome Jacks rise to power in Borderlands the prequel and his reign as maniacal Hyperion CEO in Borderlands 2 The Crew wild run Edition comes to PS4 digitally in a retail get the crew open world driving MMO and the crew wild run expansion in one ride recklessly across the entire US map customize your cars",
            "start": 3685.36
        },
        {
            "text": "The Crew wild run Edition comes to PS4 digitally in a retail get the crew open world driving MMO and the crew wild run expansion in one ride recklessly across the entire US map customize your cars monster trucks and motorcycl for Mayhem on and off road crew man I'll tell you what that was the game in the preview cycle I was like this is cool I'm like I don't like racing games or whatever but driving cross Smugglers Run it's reminding me all that stuff and then I forget what it came out against it's a Tomb Raider situation came out against something never ever played it's like Titanfall with you no I played Titan H fall longer than you said I was I did barely and you sold those avocados Deadpool comes to Ste avoc Deadpool stealth release PS4 digital in retail on PlayStation 4 a few important things I need to say before you crack into my insanely sweet game o here we go again this is De I'm a mercenary with an accelerated healing Factor I've been described as unstable which is just",
            "start": 3733.92
        },
        {
            "text": "things I need to say before you crack into my insanely sweet game o here we go again this is De I'm a mercenary with an accelerated healing Factor I've been described as unstable which is just playing cuckoo I'm going to battle for the safety of humans and mutants be prepared for just about anything holla that's what it says I'm not throwing that in there Deadpool the game was a lot of fun until the last like chapter or whatever then I I couldn't even beat it because it was so annoying I remember you playing it yeah dreamals comes to PS4 digitally having been summoned to a dream world the three animals embark on an adventure to go back to their world each animal can move only in One Direction combine them wisely to find a path to the key sounds thrilling thank you for that really great write up Game of Thrones a Telltale Game series episode 6 comes to PS4 and PS3 digitally you either win or you die episode six of the six-part episodic game series set in the world of HBO's",
            "start": 3774.28
        },
        {
            "text": "great write up Game of Thrones a Telltale Game series episode 6 comes to PS4 and PS3 digitally you either win or you die episode six of the six-part episodic game series set in the world of HBO's groundbreaking TV show that's not even a full sentence Game of Thrones a Telltale Game series season pass do they even try does anyone even care I don't know probably not Game of Thrones a Telltale Game series season pass uh disc PS4 PS3 retail Game of Thrones man this is an interesting one cuz like this got announced it was like oh man people were like what a great fit for Telltale and we love Game of Thrones D and then like I feel like this is the one that's gone no one has talked about this because Game of Thrones is so big yeah exactly that's I thought I thought it would be the I thought when they did uh Borderlands you think I thought Borderlands was going to be the one that dropped off and no one ever talked about and Borderlands is the one that's hilarious and really super well acted",
            "start": 3815.92
        },
        {
            "text": "they did uh Borderlands you think I thought Borderlands was going to be the one that dropped off and no one ever talked about and Borderlands is the one that's hilarious and really super well acted and fun and every L the finale and I need beat it I still need to play that people seem to enjoy it got to play that finale maybe I'll do it tomorrow night Game of Thrones a Telltale Game series season pass disc PS4 PS3 retail see the story of house Forester a noble family from the north of Westeros loyal to the Starks of Winterfell caught up in the events surrounding the war of the five Kings they are thrown into a malstrom of bloody Warfare revenge intrigu and horror malstrom is one of my favorite words I know don't spoil we got to use it so HTR plus comes to PSVita digitally HDR plus is a slot car racing simulator a virtual version of the classic toy of the 80s and 90s HDR plus offers three different difficulty levels in 18 tracks that include several challenges like Loops jumps",
            "start": 3855.28
        },
        {
            "text": "is a slot car racing simulator a virtual version of the classic toy of the 80s and 90s HDR plus offers three different difficulty levels in 18 tracks that include several challenges like Loops jumps Crossroads Narrows and highspeed curves Gotcha Monster High a new Ghoul in school comes to PS3 digitally welcome new Ghoul come roam the halls of Monster High and get to know your new classmates join clubs make friends and dress up in Fierce Fashions but be aware there's something strange going on or who would have thunk it Resident Evil Revelations Deluxe Edition comes to PS4 and PS3 digitally this one's out on the 18th so this is a Wednesday release the beginning of the Resident Evil Revelations's tale sees fan favorite Claire Redfield make a dramatic return survivor of the Raccoon City incident depicted in previous Resident Evil games Claire now works for the antibiot terrorism organization Terra save she and Moira Burton are attending a company party for Terrace save when unknown Armed",
            "start": 3891.68
        },
        {
            "text": "depicted in previous Resident Evil games Claire now works for the antibiot terrorism organization Terra save she and Moira Burton are attending a company party for Terrace save when unknown Armed Forces storm the office capture Clare and Moira and take them to a dark and abandoned Detention Facility on a mysterious island I've still been meaning to play that on Vita when will I probably never never Star Wars Battlefront comes to PS4 digital and Retail feeling the ominous thud of an ATAT or AT8 depending on how you want to say some people get mad at me that I say ATAT everyone used to say ATAT feeling the ominous thought of an ATAT stomping down on the frozen tundra of Hoth Rebel forces firing blasters as Imperial speeder bikes zip through the Lush Forest of Endor I don't like the way this is right now immerse yourself Coming For You EA immerse yourself in the Epic Star Wars battles you've always dreamed of I'm having fun with it good I'm glad I want you to know that you know first it's",
            "start": 3934.72
        },
        {
            "text": "is right now immerse yourself Coming For You EA immerse yourself in the Epic Star Wars battles you've always dreamed of I'm having fun with it good I'm glad I want you to know that you know first it's a game that you would think would pass me by not a huge I like Star Wars fine but I'm not like you I don't like I don't love Star Wars you know what I mean and then multiplayer Shooters whatever you don't got that love for re no no no I do like CEO Luren okay I do like him and his his singing Styles um uh but I'm enjoying this game I'm enjoying what I'm playing of it people who I've seen the you were talking about it some of the comments about it right that it's not that deep or whatever so people are dropping out pretty quick on this EA access anecdotally sure but I even Kevin who's played a lot over the weekend was saying like it's fun but it's not like super involved or whatever right now I like that I'm coming off Fallout I have this week to kill before I'm leaving or whatever I'm",
            "start": 3971.08
        },
        {
            "text": "a lot over the weekend was saying like it's fun but it's not like super involved or whatever right now I like that I'm coming off Fallout I have this week to kill before I'm leaving or whatever I'm just jumping in playing a few matches here and there unlock a new Blaster do this you Platinum Fallout by the way I did congratulations thank you very much clap for me everybody I I know you're at your you're right now at your office at your desk just quietly clap for me everybody that's enough that's too much talk about talk about we have some trophy questions well let's get through the rest of this when we talk about the trophies I'm excited about this one Super Star Wars comes to PS4 and Vita now digital crossby lay this one down to me this is is that one we did a let's play about right so it's that like Super Nintendo game yeah I was going to say very weird yeah and I wonder if we're going to get super Empire and super Jedi which even better enhance for PS4 with new save features leaderboards",
            "start": 4009.08
        },
        {
            "text": "like Super Nintendo game yeah I was going to say very weird yeah and I wonder if we're going to get super Empire and super Jedi which even better enhance for PS4 with new save features leaderboards trophies and updated display and controller options risk your life as a Jedi Knight join Luke Khan and Chewbacca in their Fierce war against the eil empire I'm down I remember getting that game I remember getting all three of those games when I was a kid love them Sword Art Online lost song comes to PS4 and PS Vita digital and a retail I have it maybe we'll do a let's play of it journey into the world of Alim online for the very first time join Kito as he Ventures online to explore zart Alim a brand new area of Alim online the original storyline includes new and returning characters in exclusive environments in the ultimate virtual reality universe as far as I know the the the anime is about uh kids that are sucked intoing MMO right I tried to play the Vita version couldn't just didn't very badly",
            "start": 4046.6
        },
        {
            "text": "in the ultimate virtual reality universe as far as I know the the the anime is about uh kids that are sucked intoing MMO right I tried to play the Vita version couldn't just didn't very badly translated not this one but the the hollow fragment apparal bestelling apparently it's awful I have it get to when I get to that's it for the games Gregory all right Colin then let's jump into reader mail reader mail mum uh Colin shocking news for you motov cocktail there it is give it to me right there pigeon mail get out this reader mail is brought to you by Squarespace if you didn't know we built kind of funny.com with Squarespace uh it's super easy to use because it's so easy Nick Scarpino could do it when we were quitting our jobs and had a million other things to do and it looks really good and it works on mobile and it does a million things so if you need to build a website for anything go over to squarespace.com and use the code kind of funny all one word to get 10% off your new purchase now",
            "start": 4086.64
        },
        {
            "text": "works on mobile and it does a million things so if you need to build a website for anything go over to squarespace.com and use the code kind of funny all one word to get 10% off your new purchase now you're talking about trophies because again Platinum Fallout Fallout 4 M very exciting a tough one right you here's well here let's just go through this right now and I would I'll bring it all in all right strength 107 many great games don't have great trophy lists to accompany that although great trophy lists are subjective what do you guys feel are the quintessential types of trophies games need to have and which types should be left off this list I want to bring this then into Fallout cuz Fallout 4 literally all but one were I thought great trophies you know what I mean they especially going off of three and New Vegas even though I know it was in their game but New Vegas right in the way that New Vegas trophies were rough exactly and I really feel like Bethesda whoever was in charge of",
            "start": 4137.72
        },
        {
            "text": "off of three and New Vegas even though I know it was in their game but New Vegas right in the way that New Vegas trophies were rough exactly and I really feel like Bethesda whoever was in charge of trophies looked at all the talk about that it was like okay let's make this trophy list accessible fun and attainable you know what I mean the whole thing from the get-go with it when we looked at them on Colin Greg live the first day they were up right is like this is a a platinum you can get it's going to take a lot of time but it's not going to feel grindy for the most part right like I went through it and enjoyed myself uh you know people are so worried about missable trophies I was too when I played through blindly and I didn't know know what was happening but when you get to decision points where it's like if you do this then that's going to happen the game pops it breaks the mo it breaks the fourth wall it's like if you do this this is going to happen so make sure you're ready to do",
            "start": 4182.0
        },
        {
            "text": "where it's like if you do this then that's going to happen the game pops it breaks the mo it breaks the fourth wall it's like if you do this this is going to happen so make sure you're ready to do this which means you say no and you pop out and you make a save and then you go in and you play through and like so what I did is I got to that decision Point made my decision played the additional lots of hours handful of hours that all runs together now beat the game right and then went back to that save and played off in the other directions I needed to play to go get those trophies so it's really that simple it wasn't like it was like I was that close to being screwed at any point bobbleheads aren't locked away anywhere that there's a bobblehead you can get back to even if you didn't get on your first one that was a designed flaw right yeah it's the same thing that they ran into I hope they fix it with South Park right stick of truth I missed one chin Pokemon on the alien ship and I'm",
            "start": 4220.36
        },
        {
            "text": "your first one that was a designed flaw right yeah it's the same thing that they ran into I hope they fix it with South Park right stick of truth I missed one chin Pokemon on the alien ship and I'm like I'm not going to go back and get this guy shitty when that happens yeah so that's great you know most of the things are you know get to level 50 get 50 hacks get 50 locks do all this stuff like again that's stuff that's like not going to just like come over like immediately to you you have to work at it but I enjoyed working at all that I loved Fallout 4 you know what I mean it is my favorite Fallout games I enjoyed just playing through it and doing everything bobbleheads sure I went off the Maps find the big creatures I went to YouTube videos what up shout out to youtube.com/ PS4 Trophies by the way listen to the show oh I know Brian Brian's a big fan no he always wants to collaborate with us and I'm always like yeah and then we get busy and it never happens yeah I mean maybe when he",
            "start": 4255.04
        },
        {
            "text": "by the way listen to the show oh I know Brian Brian's a big fan no he always wants to collaborate with us and I'm always like yeah and then we get busy and it never happens yeah I mean maybe when he comes to San Francisco we can have him over he's coming to PSX yeah we should try figure that out yeah no he does great work and his trophies work great the one that **** I was furi yester furious at yesterday was benevolent leader which is get your settle get a large settlement to 100% happiness and I really really feel that the reason I'm furious at it is number one I think the settlement stuff in the game never something I wanted to do happy people like Christina are having so much fun you know I go on Reddit all the time and go to the Fallout Reddit happy to see the crazy **** people are building if that's your angle with it I've talked to people I was on uh Fallout on the record or what off the Record the podcast about Fallout and they you know one of the the woman on that is",
            "start": 4290.96
        },
        {
            "text": "are building if that's your angle with it I've talked to people I was on uh Fallout on the record or what off the Record the podcast about Fallout and they you know one of the the woman on that is super into it and building all these different things if you love it great and I love the fact that in the game Fallout 4 it does not put a gun to your head to do it it is not like hey your base is being attacked oh your stuff it's not like Metal Gear your stuff's getting lost it's like no like yeah you may get told that hey the Settler's under attack and if you don't do it you fail the objective and hours later that'll come back through and you can go do it if you want to right but getting to the end and going in and I'm like all right let's do this and it's like I started watching videos in Brian's video on PS4 trophies right is literally like this is the longest trophy it's going to take you forever and like we're not it's one of those where it's like even really know yeah I I really feel",
            "start": 4326.6
        },
        {
            "text": "video on PS4 trophies right is literally like this is the longest trophy it's going to take you forever and like we're not it's one of those where it's like even really know yeah I I really feel like right now cuz it right now this is for the first time in a long time I guess cuz everything's so explained out in guides and Wiki right this trophy feels like what it used to feel like to go on the playground and talk to your friends be like well how did you get that like I hold the button like how do I do that fatal you know what I mean like everyone has a different thing cuz like Brian's video is very much like build the level three clinics get everybody assigned have more food than you need have more this da d da d da and I did that and it starts working and it's super slow but then it's like I started complaining about it online and some people are like well build statues build this and Brian's like that doesn't work and other people are saying well I heard TVs get it to go go up",
            "start": 4360.64
        },
        {
            "text": "like I started complaining about it online and some people are like well build statues build this and Brian's like that doesn't work and other people are saying well I heard TVs get it to go go up faster and down and I'm so desperate I'm like all right fck I'm just doing all of it yeah I saw that you built like 7,000 clinics in your I put yeah the clinics I did for sure I had like yeah I had a ton of clinics and then I just put down like hundreds of carpets I put TVs everywhere I put power generators everywhere that are connected to nothing just to get the stat up so like you know what I mean it's like the problem is that it goes up so incredibly slow you know what I mean I left the PlayStation on yesterday from probably 6:00 in the afternoon till 10:00 and got it up to I think it was like when I turned it off last night it was up to maybe 9 you know what I mean and that's from like 60 you know what I mean and then this morning I woke up and did it and I turned it on and then went to",
            "start": 4397.56
        },
        {
            "text": "when I turned it off last night it was up to maybe 9 you know what I mean and that's from like 60 you know what I mean and then this morning I woke up and did it and I turned it on and then went to the vet and came back and and I put it on and I was at 98 but all of a sudden I had a red arrow going down indicating that happiness was going down now and I looked I didn't have the trophy so I panicked ran around found that the people who like have have you signed anybody to anything I don't even know how to do that so and this is the how do you walk up to you have to be in like The View mode of settlement thing walk up to a person click X to command and then walk over to whatever you want them to do and hit X on that so that they'll go do it convoluted not explained in the game and really Cluny well it's super clunky when you want to talk about crops cuz like you know I'm planting food or whatever and so I had already signed a bunch of food there but then I got more people so I",
            "start": 4436.8
        },
        {
            "text": "really Cluny well it's super clunky when you want to talk about crops cuz like you know I'm planting food or whatever and so I had already signed a bunch of food there but then I got more people so I needed more food so I'm like all right I'll just put down more stocks of corn right here and I put the stocks of corn down next to other stocks of corn they don't Auto assign and I'm like **** and I'm like I think I'm like all right I'll go over I click this guy who I can like some sometimes you'll select somebody and if they're they're around with they're running it'll all highlight so like they're highlighted blue and then the thing is and I'm like well this dude's only working two crops I'll put him on this crop too I do that onto the one stock of corn which he suddenly forgets about his other crops and my number starts dropping I'm like no godam and like it's this game of like **** like how do I just you know like just little changes without **** it up so this morning I came",
            "start": 4474.72
        },
        {
            "text": "his other crops and my number starts dropping I'm like no godam and like it's this game of like **** like how do I just you know like just little changes without **** it up so this morning I came back saw I was at 98 but now I had a red arrow signifying I was going to go down run around and it turned out that yeah of like 14 clinics I built six people were all a sudden like **** it and walked away they just walked away and they were unassigned enough so I had to run around and find people who weren't assigned and the problem is like everybody just wanders so like I'd find people on the other side of the map not near the thing like God click on them I'm commanding you to go and I just to get them closer and closer that I could select them and look I'm like all right you're not assigned to a clinic come on **** you like put them on a Clint it's like Jesus Christ I wonder what it all is because I I I have five people in my settlement and no electricity I have some CR and water",
            "start": 4508.8
        },
        {
            "text": "to a clinic come on **** you like put them on a Clint it's like Jesus Christ I wonder what it all is because I I I have five people in my settlement and no electricity I have some CR and water like everything you got to do for that that Quest that main quest and my happiness is like in the mid 80s yeah and like I I just wonder I just like like and it's going up I think so I'm like I wonder if I just leave it alone like it's one of those again the rumor is like that you know like people who are doing that is like that they get unhappy if you leave and are gone a long time so if you come back a lot they're happy about that so like they're like when you start this trophy don't leave so I just never left because if you leave sometimes I guess on PS4 there's a massive drop and stuff like this what I'm talking about the like I don't know if that's 100% true I don't know if anything you know what I mean like like I go watch the youtube.com/ PS4 trophy video that trophies that worked for me",
            "start": 4545.28
        },
        {
            "text": "what I'm talking about the like I don't know if that's 100% true I don't know if anything you know what I mean like like I go watch the youtube.com/ PS4 trophy video that trophies that worked for me you know what I mean that video worked for me from Brian uh but I did do everything else too just in case you know what I mean that was my thing of like well **** it I'd ra even if the TVs don't help and the carpets that I'm just piling up in the street don't help I don't care I was hanging I kept making paintings and hanging them on the outside of houses just like spamming them till the point where I like there's a meter up on the top that say size which I thought signified how large Your settlement was but it's like a little big planet where what it really meant is how much you can build so when I maxed it out putting **** paintings on the wall and Carpets on the ground it was like you can't build anymore I was like oh **** then I go back and delete carpets and I'm putting down",
            "start": 4579.24
        },
        {
            "text": "so when I maxed it out putting **** paintings on the wall and Carpets on the ground it was like you can't build anymore I was like oh **** then I go back and delete carpets and I'm putting down generators to get you know it's just like it's interesting it's a pain in the ass is what it is but like they'll probably they'll probably fix it I think they will totally tweak that system in some under the hood eventually so if you're not going for it yet I bet by the time better get they probably focusing in QA didn't get that feedback right but back to strength and common here strengthen I like that uh he's talking about what is a great trophy list what are you know what are the essential types of trophies the game need and what should they avoid like I said I think for the most part benevolent leader aside fallouts is a really great example of a really great way to do it of we want you to play all this stuff and have fun and go through and like even when I you know I finished the game",
            "start": 4615.0
        },
        {
            "text": "leader aside fallouts is a really great example of a really great way to do it of we want you to play all this stuff and have fun and go through and like even when I you know I finished the game at level **** 46 seven I'll say or whatever right and then it was like okay now there's still a boatload of quests and bounties and **** to go do it's not like oh **** where am I going to get these these XP you know what I mean I'm still getting XP and I'm still having fun I'm still collecting finding things that was great I mean I like I like a trophy list that doesn't that lets me have the game on its terms and have fun with the game that way right like that's a great look at a trophy list I think comparatively that's not terrible but not one I enjoy a lot is the Uncharted of like cool you finish the game now go kill 5 enemies with this gun you never liked it's like what was weird about the Uncharted trophies on PS4 is that they made them worse and that was like so weird to me it",
            "start": 4649.88
        },
        {
            "text": "you finish the game now go kill 5 enemies with this gun you never liked it's like what was weird about the Uncharted trophies on PS4 is that they made them worse and that was like so weird to me it was like oh you used to have to kill 10 guys in a row or five guys in a row with brutal combos now you kill 10 or like you have to kill 70 or you know 10 guys with the Hang like hanging the hangman Gren like grenade now you kill 20 and I'm like why would you do that right like did you really get feedback that these trophies were fun I think the um Bioshock has a really good list I think um I like I like TR I like lists that are that give you you have to continue to give people a carrot at the end of the stick I don't like trophies or games Uncharted is a good example where it's like there aren't trophies at the end of the chapters I think Last of Us's trophies were **** awful um shockingly bad yeah uh I can't believe that they did the trophies like that it's so bad like the trophies are so finish",
            "start": 4688.44
        },
        {
            "text": "at the end of the chapters I think Last of Us's trophies were **** awful um shockingly bad yeah uh I can't believe that they did the trophies like that it's so bad like the trophies are so finish that game and you're like I don't and this is such a shitty way of putting it right but stick with me right is that I finish that game and I'm like oh what an amazing experience d y we talked about how great The Last of Us is but I'm like oh I didn't really get reward on the trophy front you know what I mean and it's like that doesn't take away from it but for me you know like I loved Fallout 4 right and so I wanted a platinum Fallout 4 because of that I love Lego Dimensions I wanted Platinum I I loved Metal Gear right and that that plat on extra life broke me but I still want to do it as a way of not paying homage or whatever but it's hey I put in all this work into your game cuz I like it so much but Last of Us trophy I looked at I was like **** this never I mean clearly it doesn't matter",
            "start": 4728.88
        },
        {
            "text": "not paying homage or whatever but it's hey I put in all this work into your game cuz I like it so much but Last of Us trophy I looked at I was like **** this never I mean clearly it doesn't matter to the quality of the game I get the game of 10 yeah uh but exactly know but you don't understand but no but I agree I was like so I felt so unrewarded on the trophy front not that that's very important but I just think Naughty Dog should know better and I'm really interested to see what Uncharted Force trophies are going to be because I cannot imagine for one second that The Last of Us trophies were well received or they did not get feedback from people that these trophies **** suck you can't and you can't do trophies like this I think you're going to get Uncharted three two and On's trophies treasures and random kills and stuff like that they should put a bronze trophy at the end of every chapter there's not there's nothing wrong with that it's they're progression chap they're",
            "start": 4766.4
        },
        {
            "text": "trophies treasures and random kills and stuff like that they should put a bronze trophy at the end of every chapter there's not there's nothing wrong with that it's they're progression chap they're progression trophies yeah um it's always a nice way of seeing how much more of a game you have left yeah I like I they're or whatever but you see it yeah I do too or it doesn't have to be chapter related could be like oh this happened in the game or whatever right right reunited or whatever I think I think I think Infamous is trap trophies were really good Infamous one two and second Suns and first slight um so there are there are good examples I like progression trophies I like collectible trophies a lot um the thing that makes me nervous about collectible trophies is when they're broken that was one of the major things that happened in Techland games Dying Light's trophies were broken even so San parga writes in and says hey guys I was wondering if you ever run into a bug trophy that",
            "start": 4799.2
        },
        {
            "text": "was one of the major things that happened in Techland games. Dying Light's trophies were broken. Even so, San Parga writes in and says, \"Hey guys, I was wondering if you ever run into a bug trophy that really bothered you? I normally don't care about trophies in general, but I decided to go for the platinum in the Uncharted collection. I got all 100 treasures and the strange Relic in Uncharted 1 with their corresponding trophies, but the one for getting both treasure and Relic refuses to pop. Tried everything with no luck and it really pisses me off. It's also the second time this happened, happened with Witcher 3 too, after I had done everything, one lousy trophy decided just not to pop. It's turning off the whole Platinum thing. Ever happened to you guys? P.S. I love you, but I think we should see other people.\" Yes, it happens to us. I don't know that it's happened to me in a significant way. Okay, I mean mine mine, but I know yours was was Dead Island. No, Dead Island. Yeah, sorry there's so many",
            "start": 4831.0
        },
        {
            "text": "people yes, it happens to us. I don't know that it's happened to me in a significant way. Okay, I mean mine mine, but I know yours was was Dead Island. No, Dead Island. Yeah, sorry there's so many **** Dead Islands. Yeah, Dead Island Rip Tide we had ahead of time and I was going to be the first person in the world of platinum and I was going and everything was fine and it got down to Collectibles and I could not find this I don't remember any tap recorder or whatever and I ran out to GameStop because they had the got early I went downtown bought it came back on the bus got home went through did big black X's through everything and got to where this one's supposed to be and it's just not there and it's one of those like I'd be **** **** kid this is a Techland problem they do this in every one of their games the the and I don't I'm always curious how trophies are QA. Mhm. Like does Sony QA the trophies you know like do they have someone in in in the studio being or like someone",
            "start": 4869.32
        },
        {
            "text": "in every one of their games the the and I don't I'm always curious how trophies are QA. Mhm. Like does Sony QA the trophies you know like do they have someone in in in the studio being or like someone at Sony that's like or people at Sony that are like you're going to platinum this you know yeah I doubt it they have like you have to be able to QA them in some respect but you'd imagine that it's done developer side but how hard could it possibly be to make the troes correct and like what's wrong with Techland that this keeps happening to their games like this happened in Dying Light as well and I haven't gotten the Platinum In Dying Light obviously I haven't beaten the game yet um but there's some you know they fixed it they have like their whole patch update or whatever but it even says in the in the thing like well like people on online like well you started getting these things before the patch like you have to start again and I'm like that that's so **** stupid dude that sucks at",
            "start": 4904.88
        },
        {
            "text": "the in the thing like well like people on online like well you started getting these things before the patch like you have to start again and I'm like that that's so **** stupid dude that sucks at some point if the trophies broken you should just put a patch in and be like a little selector on an option be like if you select this you'll just get the trophy yeah because like it's it's **** broken you know you know to the first question from strength 107 right he was like what are ones you hate I hate online Trophies i to the thing we're talking about right now the people who do did it really really well Uncharted yeah they did hey we're going to give you two two bronzes for each of or one bronze for each mode which is basically jump in play a match jump in and play a match right then the DLC is going to come and give you a boatload of DLC multiplayer trophies that don't count towards the brilliant **** move when you get put it in there and it's like even Last of Us you know what",
            "start": 4941.84
        },
        {
            "text": "DLC is going to come and give you a boatload of DLC multiplayer trophies that don't count towards the brilliant **** move when you get put it in there and it's like even Last of Us you know what I mean if you like the multiplayer great but I mean multiplay I have those trophies and that that uh that took oh that noise is awful you don't like that it's not me swallowing it though that's even swalling the water is even worse man you're really testing my **** patience though um yeah I have the the funny thing is I have the hardest trh the hardest trophies in I played the last for like 50 hours online and and those trophies are **** hard the gold trophies for beating it on both both for fireflies and whatever the survivors whatever the **** was um yeah I I I think there is an art to Trophies yeah and I understand it's not important to a lot of people I think that people that it's not important to overestimate how many of them there are I think that a lot of Hardcore people that",
            "start": 4978.6
        },
        {
            "text": "Trophies yeah and I understand it's not important to a lot of people I think that people that it's not important to overestimate how many of them there are I think that a lot of Hardcore people that listen to this podcast hardcore PlayStation audience they do care even if they don't want to get the platinums there are people that care about trophies that don't care about platinums like they don't care they always look at the trophies though they don't even go out of their way to get any of them so it does matter no I agree 100% um and uh it's just not that **** hard that's the thing is like it's not that hard like show me your game and I'll tell you exactly what to do that's why we don't give it away yet we always talk about when we leave this world behind there's life behind this life I don't want to this world behind I'm I quite ready for that we're going to start a trophy Consulting business which I think's reliz questions col we talked a lot about journalism getting it right",
            "start": 5020.92
        },
        {
            "text": "I don't want to this world behind I'm I quite ready for that we're going to start a trophy Consulting business which I think's reliz questions col we talked a lot about journalism getting it right I've meant to start with this one but we got it we got it wrong last week so we need to go through this we have a correction sure from light fret okay Greg and Colin thanks for the great podcast every week I really enjoy them one remark last week you called Spelunker World pretty much a ripoff of Spun Spelunker World is a sequel to the 80s game called Spelunker in the 2008 announced remake Spelunker HD though just wanted to clear that up yeah Spelunk is actually inspired by this game we got I got it wrong the other way and then we were just like a made a funny joke and I didn't say one way the other but I wouldn't have known that but you didn't correct me so there you well I didn't know I'm uh one tweet I got about it was yeah sorry for the error of course we're always going to make errors",
            "start": 5051.0
        },
        {
            "text": "other but I wouldn't have known that but you didn't correct me so there you well I didn't know I'm uh one tweet I got about it was yeah sorry for the error of course we're always going to make errors uh we have no stat boy the uh we don't have a stat boy the one thing that someone said to me is like how do you not know that and I'm like do you want to take a seat and I'll tell you all the things you don't know uh so obviously we don't we don't uh know everything you know we're going to make mistakes we appreciate the correction though and that was that was a pretty common tweet that we were getting this week yeah uh Snarky Starky a friend of ours wrote in to kindafunny.com psq and says what what's up guys my question this week is on Drinkbox Studios game Severed I haven't seen or heard much since going hands- on with it at PSX last year I know it's confirmed to be there again this year so my question is this with the waning Vita support what are the chances that Sony is pushing them",
            "start": 5090.0
        },
        {
            "text": "since going hands- on with it at PSX last year I know it's confirmed to be there again this year so my question is this with the waning Vita support what are the chances that Sony is pushing them to make the game multiplatform using the DualShock fors touchpad as an analog to the V's touchscreen or even optimizing it as a PlayStation VR game I know you're friends with them so you might have to you might have Insight that says I'm complet completely off the mark but I thought I'd present it to you as food for thought as far as I know that's that's not that's not even remotely the case uh yeah we I had dinner with them at PAX East um and uh we talked about the game and and uh you know I'll leave that conversation to to our years but um the game they're working on it and it's coming it's going to come out and it's a be again uh I don't I I've not heard anything from them I mean they don't tell me everything they do but of course uh they they do do trust us and they do know us and they",
            "start": 5129.88
        },
        {
            "text": "to come out and it's a be again uh I don't I I've not heard anything from them I mean they don't tell me everything they do but of course uh they they do do trust us and they do know us and they listen to the show I think what up Chris and uh everybody else **** off uh the game's not coming to PS4 I don't think that that's the reason I think that they're working on the game and I think they have the luxury L unlike that that they used to have to to to make it right and I want to reiterate that you should reward them you know and I'm not saying that because there are friends Drinkbox Studios has been one of the great Vita supporters of all time and you want to maybe s's going to be bad and maybe you don't want to do that but I I hope that I I for a review but that's great and you're the ones who are like going to boycott Gravity Rush then yeah this is what you need to do is jump out and get this and so what if first person dungeon crawling isn't your thing right then get you don't",
            "start": 5174.52
        },
        {
            "text": "ones who are like going to boycott Gravity Rush then yeah this is what you need to do is jump out and get this and so what if first person dungeon crawling isn't your thing right then get you don't see many studios dedicating a lot of resources to Vita exclusives anymore and it will be probably on iOS eventually or something like that too but um they have taken they've made their careers recently on Vita and we we they deserve credit for that because there's not a lot of people that are doing that anymore and they're going to do that in 2016 you know yeah so good for them I'm proud of them speaking of PlayStation Vita Gregway GBL Lopez writes into kindafunny.com psq just like you can says greetings Colin Greg hello I remember Colin talking about how excited he was for Hotline Miami 2 and the PlayStation Vita however I don't remember him giving his thoughts on the game personally I absolutely love it it's longer more challenging the soundtrack is still fantastic and I love the new",
            "start": 5208.04
        },
        {
            "text": "the PlayStation Vita however I don't remember him giving his thoughts on the game personally I absolutely love it it's longer more challenging the soundtrack is still fantastic and I love the new character abilities particularly the Dual willing what are your thoughts thanks guys P.S. I only like you as a friend I think I got through about half of it I really liked it uh other things came out and I didn't get a chance you know it's always there's always something in the **** way yeah yeah um but I really liked it it was more Hotl Miami I really think that's you and I were on the same page in terms of being super stoked for that I had loved playing Hotline Miami 1 on my PlayStation video getting Hotline Miami 2 I was into my problem with Hotline Miami 2 was I felt that it got away from the close Corridor stuff when it it started really using big Maps which sounds great but when you're on any screen and the way you had to pull it around I'd walk into a room and immediately get killed",
            "start": 5246.72
        },
        {
            "text": "close Corridor stuff when it it started really using big Maps which sounds great but when you're on any screen and the way you had to pull it around I'd walk into a room and immediately get killed you're like **** and I understand well Greg sucks games and like you have to learn to play that way and it's like sure but what I loved about Hotline Miami one was moving into a close Corridor moving into a tight room and then making my choice not going in and getting shot and then be like all right so there's a guy over there so now even though I can't pull the screen that far I'll cut rightest you know what I mean like trial and air wasn't it was the way you played Hotline Miami 1 but it wasn't the way you played it in Hotline Miami 2 Hotline Miami 1 the trial and air was I've gone into this room there's a guy coming I want to pop out and get oh he killed me but I knew I had a chance to kill him whereas this it felt like they had the upper handle yeah it seemed a little bit bigger uh but",
            "start": 5281.76
        },
        {
            "text": "room there's a guy coming I want to pop out and get oh he killed me but I knew I had a chance to kill him whereas this it felt like they had the upper handle yeah it seemed a little bit bigger uh but still yeah I like I mean I like the story's **** weird and then the uh the music is ambient yeah I think it's it's a good game from what I played from what you played Oz Mt b14 Ro Inc of funny.com psq just like you can says Hey guys hey why do we have such an obsession with trophies he he already heard the first part of the podcast wrote this and beamed it to my iPad I love I love them just as much as you guys but why Sony doesn't reward us with getting Platinum trophies example themes PlayStation store money they are going to do that with Bloodborne by the way what are they giving you I think they're giving you a theme that only platinum trophy guys or tra you and they also do send out emails all the time like being in the congrat you know being top 1% or whatever I rarely go back and",
            "start": 5318.4
        },
        {
            "text": "they're giving you a theme that only platinum trophy guys or tra you and they also do send out emails all the time like being in the congrat you know being top 1% or whatever I rarely go back and admire my old trophies and no one outside of our ecosystem cares or even knows what they are can you envision a future where PlayStation gives us rewards for our plats or does Sony feel like we don't care so why should they thanks John from Tennessee P.S. I love you no really I do no I think that they do care I think that they Tres are important and I think Sony knows that that's why they talk about them all the time um but uh I think their risk they're running is that having a reward program for platinums means that you'll go farm platinums that you you can go on PS3 especially and get **** a bunch of easy platinums so I don't think the numeric there's not a numeric solution it's like 100 platinums you get this because people are just farming and it's not fair I do like their solution with",
            "start": 5359.44
        },
        {
            "text": "of easy platinums so I don't think the numeric there's not a numeric solution it's like 100 platinums you get this because people are just farming and it's not fair I do like their solution with Bloodborne which is like we're going to give you a theme for getting a platinum blood they going to do that and uh so I think it's appropriate for them to do that I suspect that they'll do more of that I think there is also a possibility you know remember what kept trophies off of the PSP were uh was piracy um so what if one day the trophies get hacked and people do hack trophies still and they do cheat and and if you go on the uh leaderboards on PSN profiles or whatever you can see like there's a list for cheaters and a list without cheaters like there there's clearly a way to cheat still to get tropies um and uh so how do you deal with that and and how is that fair so I think it's more complicated than you're giving than you're letting on it would be nice to have some more director rewards",
            "start": 5401.6
        },
        {
            "text": "tropies um and uh so how do you deal with that and and how is that fair so I think it's more complicated than you're giving than you're letting on it would be nice to have some more director rewards but I don't think it's as simple as flipping a switch I think that there are you know unintended consequences to doing that my thing is you know like why do we drive ourselves for trophies and stuff and his comment here of no one outside our ecosystem cares or even knows what they are for me like that's not what it's about right like the fact that I was blown away by the number of you who emailed in or tweeted or whatever asking why Colinize trophies were private I didn't realize that many people were looking at our trophies that often you know what I mean and that's for me what it's all about is like I don't give a **** if my mom has no idea my trophy level I care that you guys do or that it matters to you if it matters to you you know what I mean that's part of our ecosystem but more",
            "start": 5433.24
        },
        {
            "text": "is like I don't give a **** if my mom has no idea my trophy level I care that you guys do or that it matters to you if it matters to you you know what I mean that's part of our ecosystem but more important it's part of our community you know what I mean there is that thing of like I I have the Fallout 4 platinum and you're like oh like there's like it is a congratulatory thing because you are with your best friends and this is a cool thing that you've done you know what I mean like I like the fact that it's funny like with the Fallout 41 in particular right of like I guess that wasn't the one what what whatever trophy whatever I was chasing back in the day where I ran into the fact of like oh man this PS4 trophies guy on YouTube was really good and then you find out like oh he listens to our shows and knows who we are and does all this stuff and then like uh I over the weekend I was all over and I more than usual I guess I was all over uh the boards for the Fallout 4 stuff",
            "start": 5471.64
        },
        {
            "text": "listens to our shows and knows who we are and does all this stuff and then like uh I over the weekend I was all over and I more than usual I guess I was all over uh the boards for the Fallout 4 stuff on playstationtrophies.org right but I'm I'm a lurker on those boards I rarely rarely post but this one in particular I was chasing one guy posted a he Platinum one are the questions I hit him up and and I was just in the in the chat or in the you know comment thread or whatever I'm just like yes so I don't understand this about the settlement trophy how does that work he responded but recognized my name and then reached you I mean like that's the thing of like I'm not on my site I'm not a personality there da da da da but he knew me because of the PlayStation community and like that's where it gets down to like the same reason our show is a big deal even though it's not like millions of people listen to it right it's cuz we have this awesome Community around it and that's what trophies",
            "start": 5506.76
        },
        {
            "text": "it gets down to like the same reason our show is a big deal even though it's not like millions of people listen to it right it's cuz we have this awesome Community around it and that's what trophies are awesome for is connecting all of us so we can have this nerdy little Morris code we talking about how this bronze goes or what goes there I love it God damn it it's real to me damn it still one of the Great Clips of all time I love that I **** love that that's that happened our final question to kindafunny.com psq comes from khj woo Colin Greg if Shu Yoshida came up to you and said quote we will make you one first party Vita game you picked the studio you pick the franchise but this will be the last Vita game we will ever make what would you pick and why P.S. I love your work XOXO It's a good question the last Vita game ever made who would we want to have it made and shoe is coming so it's first party I always felt like they really missed by not putting Infamous God damn you can't steal",
            "start": 5543.4
        },
        {
            "text": "good question the last Vita game ever made who would we want to have it made and shoe is coming so it's first party I always felt like they really missed by not putting Infamous God damn you can't steal mine on Vita so I would say Sucker Punch to make an Infamous game maybe a maybe some sort of epilog to Infamous 2 that connects it to First Sun more directly yeah or right no first light last what would you want it to be you want Infamous 2 to connect to second song what am I doing yeah you want Cole of course yeah we know where the **** that really that really was a lost opportunity I have no idea why Infamous go and God of War um didn't come over sure uh so that's what what my choice would yeah I mean mine if you're going to steal Infamous out from under me then it's got to be Patapon go to Japan studio right and get them to make a Patapon and be like hey not a collection here's this here's this awesome music rhythm game that's about battling and doing all these different things and",
            "start": 5592.72
        },
        {
            "text": "to Japan studio right and get them to make a Patapon and be like hey not a collection here's this here's this awesome music rhythm game that's about battling and doing all these different things and let's get it out there because Patapon is like so underappreciated you know what I mean like don't get me wrong I I don't mean to Bang the Drum on my this is me coming down off my nerdy Love of Patapon and being just like even that said different kind of gameplay beautiful game the games got so deep as you went on you know what I mean we're talking talking about PSP and they were still like let's do online let's have all this stuff where you can jump in and play and trade and do all stuff and they you want to talk about a game that learned iteration to iteration you know what I mean Pat upon one to Pat upon two to Pat upon three each one of those games was like all right let's cut off the fat here's what it is O let's cut this you know what I mean patapon three was such a great game I'd",
            "start": 5637.0
        },
        {
            "text": "one to Pat upon two to Pat upon three each one of those games was like all right let's cut off the fat here's what it is O let's cut this you know what I mean patapon three was such a great game I'd love to see what they would do with the Vita especially as it is now if they would have done it originally it would have been all **** back touch and weird ass and I would have been like it's good but not great little deviant yeah luminous even which wasn't terrible but like wasn't needed right like now you'd have this like P that stripped down and ready to **** run and rage and that'd be awesome that's what I want thank you I try Colin I'm always looking for your approval I know I love you I love you too buddy um Colin how would you like a new segment sure we have it it's called PS I Love This best friend xoxo Camp beta 18 says can I be the PS I Love You XOXO version of hit of the",
            "start": 5672.08
        },
        {
            "text": "This best friend xoxo Camp beta 18 says can I be the PS I Love You XOXO version of hit of the week yes you can and we're calling it PS I Love This best friend xoxo so if you don't remember hit of the week ladies and gentlemen on our old show we would read you a PSN name you would then go friend this PSN send them fun messages and be nice the whole point is we're being nice we're getting you all connected via the community so the first ever PS I Love This best friend xoxo is mycore outlet mycore outlet is Camp beta 18 uh he wants you to all go be his best friend on the PlayStation Network so send him messages of support love xoxo ps's and whatnots Colin M time for now an old segment as we reach episode 9 with it this week's forgotten PlayStation game I put this one down because I had forgotten to put my pick in and then I started thinking I was this I know you have an affinity for this game too I don't think you've used it yet but don't punch me if you have have you put on here magic",
            "start": 5711.2
        },
        {
            "text": "to put my pick in and then I started thinking I was this I know you have an affinity for this game too I don't think you've used it yet but don't punch me if you have have you put on here magic orbs SL magic balls no I haven't all right God okay good I like magic orbs magic orbs give me a pound down magic orbs was the **** Jam I reviewed that one I was in bed with it for forever when it was magic balls when it was still magic balls then they renamed it magic orbs you know brick breaker uh but threedimensional what do you want to call or I guess it's like 2.5d kind of you're up you're shooting things all sorts of crazy objects on the field that you're hitting it's not just bricks I liked it yeah they cerebral themes to every level it was relaxing great music you just put it on a shield to it I love I have a soft spot for Brick Breakers um the best best brick breaking game is a PSN game so the not magic corpse but that's but shatter oh my oh my God shatter is so **** good um that's",
            "start": 5763.36
        },
        {
            "text": "it I love I have a soft spot for Brick Breakers um the best best brick breaking game is a PSN game so the not Magic Corpse but that's but Shatter oh my oh my God Shatter is so **** good um that's a good choice thank you I you like that one and the best part about it they supported it forever tons of DLC for that game get Magic Orbs everybody if you and if you think you might have already bought it look for Magic Balls they changed the name I don't know why they would change it from Magic Balls to Magic Orbs whatever speaking of changing your name time to talk about PSN's worst name of the week remember Shuhei Yoshida refuses to let us change our names he stands in the way people come to Sony about it he just knocks them down all the time they come up with money knocks it out of their hand he's like I don't want it keep it away this one comes from Matt Willis 30 of course if you want to submit your bad PSN name or one you've seen or now and I guess now you have to start submitting the",
            "start": 5801.68
        },
        {
            "text": "he's like I don't want it keep it away this one comes from Matt Willis 30 of course if you want to submit your bad PSN name or one you've seen or now and I guess now you have to start submitting the PS I Love You XOXO best friend xoxo uh go to kindafunny.com forums just like Matt Willis 30 did and he says glad you guys are back doing a dedicated PlayStation podcast you've been missed thank you I've had a bad experience with Sony due to my PSN ID I joined PSN with the launch of the PS3 I grabbed a bundle of I grabbed a bundle of the 60 gab play 3 with Heavenly Sword and Motor Storm all was fine until 2011 when my PS3 experienced the orange light of death I called PlayStation UK o to get it fixed and they asked me for the security to give my PSN ID I was on a loud speaker and my girlfriend immediately started laughing I didn't want to say it so I spelled it out phonetically whiskey India Lima Delta whiskey India lima lima Yankee 69 to which the girl on the phone replied is that Wild Wily 69",
            "start": 5841.76
        },
        {
            "text": "started laughing I didn't want to say it so I spelled it out phonetically whiskey India Lima Delta whiskey India lima lima Yankee 69 to which the girl on the phone replied is that Wild Wily 69 Not only was that embarrassing enough but the repair to cost was uh almost as much as a new slim PS3 so I bought a new one and lost PS2 backwards compatibility to top it all off I had to buy a new PS3 as well as I traded mine in to get the PS3 after breaching the 60 platinum trophy count I don't want to abandon my existing ID but at 30 now in a professional rather at 39 a professional rather than a student I would like it to be changed please Sony let us change our name Matt Willis 30 AKA Wild Willy 69 what the **** are you thinking when you put in Wild Wily 69 that's good stuff Shuhei let us change our names Shuhei let us change our names Kirk Hamilton wrote another piece I think piece on uh Kotaku this week about how he hates his **** PSN name and wants to change it whatever so people are",
            "start": 5889.0
        },
        {
            "text": "change our names Shuhei let us change our names Kirk Hamilton wrote another piece I think piece on uh Kotaku this week about how he hates his **** PSN name and wants to change it whatever so people are getting privy I've been saying this for years but people people are getting people are getting wild that's the r that's the R I hope so I'm I don't know I'll be skeptical Tiex if you're listening to this let me know just more reassurance just just tell me I still believe it's true from what I've heard ladies and gentlemen this has been PlayStation I Love You XOXO episode 9 you didn't know this is a product of kindafunny.com so go there watch all the videos you know subscribe to the Twitch feed subscribe to all the YouTube channels back us on Patreon if you want some exclusive content early and of course please keep downloading and watching this show each and every time it airs Tuesday 9:00 a.m. brand new episodes coming for you we missing a beat with the Thanksgiving break don't worry",
            "start": 5943.6
        },
        {
            "text": "and of course please keep downloading and watching this show each and every time it airs Tuesday 9:00 a.m. brand new episodes coming for you we missing a beat with the Thanksgiving break don't worry about it we'll be right there uh remember PSX is coming up really quick quickly it's going to be Saturday December 5th we will be there as the only PlayStation podcast doing anything so come out Saturday main stage 5:00 p.m. come watch us do the show guests will be there I'm already starting to book people of importance far beyond Ares to come be part of that show then we're doing our PlayStation experience panel kind of funny is Just Cause 3 meet and greet Jillian's 8:00 it's right across the street from where you'll be at PSX so you have no excuse not to come it's free to get in it's free to eat if you want to booze you probably have to either line up really early or just bring money and be 21 because we can't let the kids booze no no can't let that happen and of course if you love me",
            "start": 5979.88
        },
        {
            "text": "to eat if you want to booze you probably have to either line up really early or just bring money and be 21 because we can't let the kids booze no no can't let that happen and of course if you love me please help me win the game awards uh trending gamer thing the game awards.com you can go there and vote or you can just tweet and what is the hashtag hashtag is TGA Greg Miller or no it's implied the ego is implied #TGA PewDiePie no we don't don't even say he's nominated Colin don't you want the trophy right there ladies and gentlemen each and every episode of PS I Love You XOXO ends in a song in a segment we call singing a Shoei today's submission comes of course from kindafunny.com PSM that's where you go to submit your music hopefully and preferably a YouTube link and some kind of Bandcamp link or SoundCloud link where I can just download the MP3 and put it on both versions of the show today's submission comes from long time patreon.com of funny and Kinda Funny Games uh",
            "start": 6019.28
        },
        {
            "text": "of Bandcamp link or SoundCloud link where I can just download the MP3 and put it on both versions of the show today's submission comes from long time patreon.com of funny and Kinda Funny Games uh subscriber Tack Track who put in his submission all he said was my submiss and then two links he's a man who knows I like like cutting right to the chase it's Tack Track's uh single here out for justice Tack Track is spelled t- a k t r a c k so just t a is the weird part about that Tack Track uh he has an album out Mission of Mercy we've been giving it away for years it seems like on Conor Greg live because he's do set bajillion copies but you can go get it on iTunes uh and keep in mind if you're the YouTube Watcher here you're going to roll off into this to an annotated slate click on that to go watch the video on his channel if you're listening to the MP3 we will play you the song right now so ladies and gentlemen here is Tack Track without for justice it's been our pleasure to serve you",
            "start": 6068.32
        },
        {
            "text": "go watch the video on his channel if you're listening to the MP3 we will play you the song right now so ladies and gentlemen here is Tack Track without for justice it's been our pleasure to serve you",
            "start": 6110.4
        }
    ]
}