{
    "id": 1329,
    "video_id": "q3RJQzEv7OQ",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino"
    ],
    "title": "How to Platinum Metal Gear Solid 5 - Kinda Funny Plays",
    "description": "Greg teaches Nick how to play Metal Gear Solid 5 in preparation for Greg trying to Platinum the game during Extra Life.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1446829201,
    "duration": 1254,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to another let's play here on youtube.com/KindaFunnyGames. I'm Greg. This is Nick. And this is Metal Gear Solid 5: The Phantom Pain. Now Nick I know what you're thinking. Sweet golden arm. I kicked the **** out of this game and I've played it for forever. I want that sweet golden arm. Mine's still red. I don't like that at all. How How long you been playing? I hate the share button. I hate that crap. I'd have to go back and look but easily 40 hours maybe. See I'm 100 hours in. Whoa. Now some of this Have you calculated how many months that is? how many hours that is in terms of and how many months it is. Not not even a month yet. I'm messing with me. Now this game's old. We've I've played a ton of it. You've played a ton of it. I've played a little bit more than you. Um a lot more than you. People might be wondering why are we looking into this Metal Gear. Uh if you didn't know ladies and gentlemen you are watching this leading up to Extra Life",
            "start": 0.16
        },
        {
            "text": "more than you. Um a lot more than you. People might be wondering why are we looking into this Metal Gear. Uh if you didn't know ladies and gentlemen you are watching this leading up to Extra Life November 7th 8 a.m. Pacific time twitch.tv/KindaFunnyGames. We will all be streaming video games for 4 hours to benefit the Children's Miracle Network. Uh taking your donations and we play for 4 hours and make fools of ourselves. Uh what I will be doing for part of my stream if not the entire stream Nick is platinuming Metal Gear finally. I'm excited about that. Now you know we talked about this you know a long time ago. It came out I said I was going to platinum it. I'm 63% of the way there which might sound like I'm not that far especially 100 hours in. It does sound like you're not that far but like the thing is as you know you're a big trophy connoisseur. The trophies of course like silver's here gold's here those carry more weight in the in the in the rubric. Mhm.",
            "start": 36.96
        },
        {
            "text": "not that far but like the thing is as you know you're a big trophy connoisseur. The trophies of course like silver's here gold's here those carry more weight in the in the in the rubric. Mhm. So I've done the work. The work is being put in currently. I'm still doing the work. Once once these are going to start coming it'll be no big deal. They're going to come on Saturday November 7th. I'll need you to be there 8 a.m. specific throughout Greg. Right now they're not even breathing hard. I just want you to know that they're not even breathing hard. They're not working. Is that what you're saying? What? No. It was a sexual joke. Said they're going to come on Sunday. I said right now they're not even breathing hard. It was It was a stretch but I like where it got to in the end. So I like that a lot. So so you look through I have just golds and silvers pretty much left here. All right. So these are one do all the missions which you'd think I would have done but I'm leaving",
            "start": 73.68
        },
        {
            "text": "I like that a lot. So so you look through I have just golds and silvers pretty much left here. All right. So these are one do all the missions which you'd think I would have done but I'm leaving some because I'm just trying to go through and S-rank everything right now to get the S-rank. Then I got to do all mission tasks. Sure. You come down here do all the key dispatch missions. Those are almost done. Those I'm knocking out but they start to take a while. Like I have guys out right now in a -hour long mission. You know what I mean? That stuff takes a lot of time. The big ones however are down here which Well this one's going to happen no problem. They'll 300 items. But these hidden ones here one is for making the nuke one is for disarming the nuke and then I got to get all the species and then I got to collect all the blueprints and stuff. So this is why I put it off. I was playing a lot of Metal Gear obviously as you know as you'd assume with somebody who was 100",
            "start": 109.44
        },
        {
            "text": "species and then I got to collect all the blueprints and stuff. So this is why I put it off. I was playing a lot of Metal Gear obviously as you know as you'd assume with somebody who was 100 game. Uh and so it started to feel like work. And so I I pumped the brakes went and went and played other things jumped around but I set this Extra Life as my goal. So right here the nuclear weapons being built it takes 17 hours. Well it takes 4 but I've already knocked off seven hours today because I've just left my PlayStation running. Important to say to my 100 hours of game time. I have let the PlayStation run a while. So seven hours today. We've I did that fuel resource glitch back in the day. So I'm probably more in the realm of 110. Yeah keep telling yourself that. It's not bad. Well I mean the wor I worries me because I think I still have work. So you can jump over. You do. You got you have you conservatively? Yeah. How many hours do you think you got to put back",
            "start": 142.88
        },
        {
            "text": "bad. Well I mean the wor I worries me because I think I still have work. So you can jump over. You do. You got you have you conservatively? Yeah. How many hours do you think you got to put back into this? I think it's going to be I think it's going to be tough for me to beat it on the one day. Here's the thing. Not tough to beat it on the one the 4-hour live stream. Tough for me to beat it in my window because my window of the day is in the evening. Like it's like what? 8:00 to 1:00 a.m. or something is my thing. Yeah. No I think Oh yeah. Pretty sure. So just shut up and roll the schedule or 1:00 a.m. to 8 a.m. Yeah you guys are doing other It's not that long. You Whatever. Okay whatever. 7 a.m. 6 a.m. Oh look at the schedule. But it's true. I don't think you're going to I don't I I mean I have faith in I think some of this stuff's just going to take a little longer than that's why I'm already chipping away right now. You see I have all these S-ranks. They're no big deal. I",
            "start": 183.52
        },
        {
            "text": "I I mean I have faith in I think some of this stuff's just going to take a little longer than that's why I'm already chipping away right now. You see I have all these S-ranks. They're no big deal. I got to go back get that one. Mission tasks I'm doing pretty good. But see what I was doing is I was being kind of anal about it here where I was going through just trying to get all the S-ranks. Thank you for not stinkering. And also like you know some of the mission tasks whatever. But you can see I have a lot of S-ranks and then it's here where I I haven't actually committed down to doing the S-ranks and stuff. And then I still have these other extreme mission subsistence missions I haven't done. Oh God. I don't even know how you're going to do this on this. I'll be fine. I'll be fine. Don't worry about it. That'll be These will be fine. I'll be able to go through and get those. Like that's just going to The code one was hard dude. Yeah I know. But those are real hard. The main thing",
            "start": 219.2
        },
        {
            "text": "worry about it. That'll be These will be fine. I'll be able to go through and get those. Like that's just going to The code one was hard dude. Yeah I know. But those are real hard. The main thing you have to understand is that I've taken so much time off. That's the main concern right? I was at the top of my game and now I got to shake off the rust. And I've decided to shake off the rust. What I've I've been chipping away at today is getting the animals in check. See I'm 57% through the animals. We got How hard was it to find the gerbil? He's a common one actually. If you see the scene next to him the ultra Is that ultra common? Ultra rare. Ultra common I believe. Yeah. What's the ultraist rare? Okay you can try. The most ultra rare. Wait go. Seriously what was that bird? Cuz I found the bird the other day. That took me a while. The one you find near the mansion. No that's not it. That's one of those missions. Like they had a bunch of ones out there you know? They're",
            "start": 250.4
        },
        {
            "text": "I found the bird the other day. That took me a while. The one you find near the mansion. No that's not it. That's one of those missions. Like they had a bunch of ones out there you know? They're like \"Go get the one's like the mythical something. Got to find condor.\" And I I had to I ended up killing an entire species of birds to find this **** thing. That seems like a lot. Well they didn't say I had to but I had to go above and beyond. So I thought for this let's play cuz now you're getting you're you're looking in on the window here. You get the Black Mamba. There's snakes. The hell do I Yeah of course there's snakes. Uh the thing about it Nick is you've never platinum a game correct? Correct. So do you understand what goes into platinum a game? I understand that you have to pretty much beat every single thing in the game. Sure. Well whatever they have said the objective of the trophies. Yeah. Yeah. But I wanted to introduce you to a site called PlayStation",
            "start": 280.8
        },
        {
            "text": "you have to pretty much beat every single thing in the game. Sure. Well whatever they have said the objective of the trophies. Yeah. Yeah. But I wanted to introduce you to a site called PlayStationTrophies.org. Okay. Now this is you'll see me throughout the live stream. I'm going to my plan is to sit at the back of the kitchen t in the kitchen table where we'll be sitting and I will sit there and I will go through and I'll be working in the back constantly on Metal Gear while whoever does whatever the hell they do up there. Uh PlayStation Trophies of course lists all the trophies but more importantly they have awesome uh message boards where people go and post walkthroughs and collectible guides and all this stuff. So right here now I'm looking at a thread posted by PowerPyx who will then link to his PowerPyx. First off look at how beautiful this is. every one of the animals we need numbered so they're right there and then annotated out to where they are on the video. So",
            "start": 315.04
        },
        {
            "text": "will then link to his PowerPyx. First off look at how beautiful this is. every one of the animals we need numbered so they're right there and then annotated out to where they are on the video. So now we're gonna look down. We're gonna find Black Mamba. Where's Black Mamba? There's Black Mamba. I'm missing two Chinchouko. So he comes in he comes up 1 seconds in the video. So I click on the video now and it pops him right there. Annotated. Beautiful. Right. He's going to I'm on a bad internet connection cuz I just switched over to the internet. That's on me. Not on. Not Not on PowerPyx. Now the internet figures out that it's on a bad internet connection. Doesn't show me the other ones. Of course. There it is. Doesn't need to. Doesn't need to. What do you mean doesn't need to? It's the internet. It can do whatever it wants. So you're going for the Chinchouko. No we're going for Chinchouko. The Chinchouko. I'll reload this one. But this is like what I'll be doing through Extra Life. I'm sitting in",
            "start": 350.0
        },
        {
            "text": "It can do whatever it wants. So you're going for the Chinchouko. No we're going for Chinchouko. The Chinchouko. I'll reload this one. But this is like what I'll be doing through Extra Life. I'm sitting in the background doing this. And then what'll be really exciting. So you're going to you're going to So while I'm doing my blocks there and there you're going to be in the background basically looking for Mambas. Whatever I need. Yeah. Like right here. So now here we got to go to Africa. He can He's ultra rare. I need the cage. Africa. Night and day. Pop out of here. Come over to the missions mission list. Good. Go over here to free roam. We're going to Africa buddy. See this just doesn't seem to me like a traditional version of fun. I mean that's just like how you feel about it you know? I assume that this is sort of a hobby of yours. Yeah. You know where you get off style. Yeah for sure. This is something I get to point to and say \"Look at how I'm such a Metal Gear fan. I did this.\"",
            "start": 391.52
        },
        {
            "text": "that this is sort of a hobby of yours. Yeah. You know where you get off style. Yeah for sure. This is something I get to point to and say \"Look at how I'm such a Metal Gear fan. I did this.\" Right? This is sort of like when I when I was living in my parents house when I was in high school junior high and they would be like \"Hey you have to mow the lawn today but you also have to edge the lawn.\" You remember that? We'd edge it. Sure. Where it would take all the overgrowth and you would just cut it straight. And I hated doing it cuz it was very anal retentive and it was an extra step that was completely needless really. Sure. because I could just cut I could just cut the lawn really well and get everything I needed out of it. But you understand that like the days of playing a video game just the way you wanted to play a video game are done. They are dead in the water. That's over with. That doesn't happen anymore. Now you play games for these little trinkets and to grow your e",
            "start": 434.48
        },
        {
            "text": "game just the way you wanted to play a video game are done. They are dead in the water. That's over with. That doesn't happen anymore. Now you play games for these little trinkets and to grow your e-penis and make yourself feel really really cool about how high your trophy level is. Which by the way is level 6. About to be level 7. Probably by the time you see this video I'll be level 7. But I'm not bragging. I'm just letting you know high. Is that high? That's a very high people. Not me. And they look they trounces. I mean Colin and I are into it. Colin's still into the platinum game so he's he's out in front of me. He took over when I left the PlayStation team right? He took over Command but then there's people like Will Powers who have like obscene amounts of platinum so they're way way ahead of everybody. But to a normal person to our fans my level 6 and Colin's level 6 are pretty impressive. That's impressive. Actually I'm guessing based on your your uh your description there that I'm somewhere",
            "start": 471.68
        },
        {
            "text": "everybody. But to a normal person to our fans my level 6 and Colin's level 6 are pretty impressive. That's impressive. Actually I'm guessing based on your your uh your description there that I'm somewhere in the one area. If I had to guess. No you've got to guess one. So well you know I've only played three games on PlayStation. Okay then you're probably So I'm pretty low on the ones. Not really. I'm getting dropped off here. Go over here and drop it. Is that where it's supposed to be? Yeah I'm going off of PowerPyx again. This is PowerPyx. PYX. Is that how you say? You think it's Pyx or Pikes? I guess Pyx. Pyx. Okay. Yeah PowerPyx. Cool. PX. And I like to play his video while I play my video. So I see. Well he's already over there so I got to get over there to my This is my sniper. Let me show you. You're all white like a Stormtrooper. Yeah I told you. Like I went through and I did the whole customization. It was super fun. Mine are like yellow though. Yeah I did. I I went for",
            "start": 506.64
        },
        {
            "text": "me show you. You're all white like a Stormtrooper. Yeah I told you. Like I went through and I did the whole customization. It was super fun. Mine are like yellow though. Yeah I did. I I went for black and gold for MGSV for a while and then it just wasn't After a while I was like you know what? That's dope. I want white. You want all white? Well you know in a stealth game there's nothing better than white. Yep. Yep. They say that. They say it blends in really well in this green lush jungle environment especially at night. Yeah especially at night where there's nothing around you that's white. So here would not command me. What do I do here? Now I see we watched the video. He does that. Now I got to try to figure out I'm always afraid he sometimes I'm you don't like the thing about this Nick is that it's not guaranteed by the way. Yeah it might not be there. Yeah. Well it's not even that it might not be there. I might drop my things and not not not get them. Like you can",
            "start": 547.92
        },
        {
            "text": "this Nick is that it's not guaranteed by the way. Yeah it might not be there. Yeah. Well it's not even that it might not be there. I might drop my things and not not not get them. Like you can you can not. See I don't like that. Yeah I know. It's it's it's it's a it's a pain. I won't lie to you. It's not fun for me. Well that's just like your opinion man. To not have something there. Trying to find the exact rocks exact. You know what I mean? Yeah I'll be honest. had to follow a couple a couple walkthroughs during the normal game play just because some of the times we had to just randomly find **** dudes that were hiding behind rocks you know like prisoners that were like they stumbled around and then dropped right by a rock that they just happened to be camouflaged to look exactly like the rock. That was annoying. But overall I really liked the game except for that really annoying rock part. There was a couple there's always a couple missions in every game that you're",
            "start": 585.52
        },
        {
            "text": "exactly like the rock. That was annoying. But overall I really liked the game except for that really annoying rock part. There was a couple there's always a couple missions in every game that you're just like I could have done without this. And finding some of the prisoners just out in the middle of **** nowhere. I could have done without those. I could have also done without everything that had to do with parasites because they terrify the human. I get really scared. But that's the whole thing though. They want you you know they want you should be terrified. I know. I'm a better person. I overcame adversity and all that yada yada yada. But uh it's a I feel like I have a lot more fun when um I am the predator. They are the prey. Sure. You know but you got to earn that. You know what I mean? To get to that point. What are you doing? You run back and forth trying to stir the snake. I'm trying to figure out like you know like I'm I was dropping it from the sky. So I was looking",
            "start": 620.8
        },
        {
            "text": "I mean? To get to that point. What are you doing? You run back and forth trying to stir the snake. I'm trying to figure out like you know like I'm I was dropping it from the sky. So I was looking for points of reference that would then make sense to me. And here I am. Where's that guy? Cuz I want it I want I want these things to be done. You know what I mean? How did he find this? You know nobody asks how PowerPyx on YouTube does his magic. What is he doing? Do this. Let me do this. Let me do this. Do this. Pour that. Portello. You're going to scare off the Chinchouko. And I don't need that right now buddy. So you just put these down in in a circle right? And then what are you doing? Then we're gonna get back on our helicopter and leave and hope that we get him. Oh okay. So that's what I'm saying is I might not get him. That's a lot of traps you just put. Well we're trying. I mean we got to **** try man. Like this isn't the the Chinchouko man. He's not",
            "start": 655.36
        },
        {
            "text": "So that's what I'm saying is I might not get him. That's a lot of traps you just put. Well we're trying. I mean we got to **** try man. Like this isn't the the Chinchouko man. He's not here to **** around. I think it's Chinchouko. Let's just say Chinchouko and call it. I'll tell you. Does the Chinchouko often like to wait in like light pools of water? Apparently that's what our friends PowerPyx on YouTube and on PlayStationTrophies.org figured out. All right. And so this is what we do. Now see we're fishing right now. We're fishing right now. We're toss out. Now he's ultra rare so there's no guarantee we pick them up on this one. You know what I mean? We might have to come back and do this again. Does it just stay forever? No no no no no no. Oh we drop these. We evac out and see what we get. Oh I see. Okay. So if we don't get them we repeat the process. A friend of mine Total Stealth over there on Twitter and he was telling me to look out for the",
            "start": 695.68
        },
        {
            "text": "We evac out and see what we get. Oh I see. Okay. So if we don't get them we repeat the process. A friend of mine Total Stealth over there on Twitter and he was telling me to look out for the tortoise I got to get soon. Took him a long time to get that tortoise. But you can have better luck. Maybe I have better luck. Maybe Kojima himself will smile upon us. Maybe he was like \"You know what? When GameOverGreggy logs into PlayStation 4 and tries to platinum for a charity stream November 7th 8 a.m. uh on Twitch.tv.\" So it's Kinda Funny Games. Uh I want him to get every animal on the first try. Man from your mouth to Kojima's ears. Yeah. Well he doesn't have any power anymore. He's on permanent vacation. He has as much power as he wants to have. He's a demigod. Well that's true but he's on I'm not even sure he's real. Have you ever met the man? Yeah. Well I' I've met him but I don't know. I mean he Did you touch him? Yes I hugged him but I'm not sure. You're blowing my",
            "start": 737.76
        },
        {
            "text": "but he's on I'm not even sure he's real. Have you ever met the man? Yeah. Well I' I've met him but I don't know. I mean he Did you touch him? Yes I hugged him but I'm not sure. You're blowing my theory out of the water. I know. I'm sorry about that. I was trying to figure a way to back out here. We got Don't worry we got him. We got you. You fat **** snake tadpole. Whatever the **** you are. What the **** is he? Suchin? I don't know. I don't know what a such is. He looks He's got like he's a snake. A big **** snake though. If I saw that thing coming towards me kill it. It looks like a It looks like a slug had sex with a snake and then had a tadpole tail. It looks like Yeah it does look like a snake swallowed a shoe. And we got another gerbil. I get **** gerbils all day long. I'll tell you right now. That's nice though. Gerbils are cute. They're cute. Yeah. But it's just like whatever. So now he's checked off the list Nick. All right cool. And the process",
            "start": 775.68
        },
        {
            "text": "all day long. I'll tell you right now. That's nice though. Gerbils are cute. They're cute. Yeah. But it's just like whatever. So now he's checked off the list Nick. All right cool. And the process continues. Continues. How many more uh ultra rare animals do you need to find? I have 19 animals left. That's not that bad. Overall 76% complete. Do you want to do one more and then call it a day? I've explained it. I think we've pimped Extra Life. You and I are having fun. I want to I want to watch you S-rank a mission. That's what I want to watch. And I'll watch it. I think I'm going to try to join you for Extra Life of course. But that's what I'm very interested in cuz I want to see how you play. Now I understand the correct way to play. Yeah. Is to sneak around and not get spotted. Right. That's probably what I'm doing wrong because I immediately go into every mission with a rocket launcher and just sit back there and shoot everyone with it. Now we're going for the Namakua Chameleon.",
            "start": 811.36
        },
        {
            "text": "That's probably what I'm doing wrong because I immediately go into every mission with a rocket launcher and just sit back there and shoot everyone with it. Now we're going for the Namakua Chameleon. Let me see this. Where is it? Well it's cuz he doesn't remember he is annotating. Oh he's smart. He's very smart. This is what we're looking for. What's it called? This Namakua Chameleon. I also have to finish off my combat deployment so I'm I'm okay they're all going these are not your forward operating bases though right this is just normal **** right good cuz I got I was like too long I think hold on real quick I want to know for my own edification and if you're bored at home I'm sorry you chose to watch this but I want to see it tells you how close I'm having the combat deployment missions done That's done. Mission complete. Share. Sure. Sure. Neutralization. I didn't know this **** menu existed. You ever take your walkers out for a",
            "start": 849.36
        },
        {
            "text": "I'm having the combat deployment missions done That's done. Mission complete. Share. Sure. Sure. Neutralization. I didn't know this **** menu existed. You ever take your walkers out for a walk? No. Here we go. 100%. Key. Dispatch. Mission completion. 95. Let's do one. That means I'm really **** crush. I've already done them. I've sent them out. They're out. They're doing their thing. Oh those are the dispatchers. I got it. I'm 90% done on documents. Oh **** of documents but I got the blueprints 4% and then 5% on key items. That's going to be a **** to do. I think blueprint be easy to find. Well I don't that's easy. You look at a map for that. Sure. Key items I can too. My concern is I haven't looked into that. So chat let me chat let me know in the comments. I and I because I have the video also from PowerPyx to do that one but I'm not sure where to go to see what key items I have and don't have. Like the the animals are in one list. So I'm like I need Namakua Chameleon",
            "start": 890.4
        },
        {
            "text": "I because I have the video also from PowerPyx to do that one but I'm not sure where to go to see what key items I have and don't have. Like the the animals are in one list. So I'm like I need Namaqua Chameleon. I'm like this **** is mine. I know exactly where to go get them. I'm going to Africa in the day night. Do whatever I want. So go there. Yeah. I feel like there's got to be a menu for blueprints. I Yeah you can check your blueprints are easy. Key items. I don't know. I I don't I'm not 100% set on that in my head. You know what I mean? Yeah. Yeah. Yeah. Yeah. Yeah. We mute history. We don't We don't hit that stuff here. So here's what we're looking for. Namaqua Chameleon. That's the best part of that song. Dude culture clash is the **** They come and go red golden green Namaqua. Just I can't I got to figure something. No it's Namaqua. Now **** your It's tough. It's tough. We have 4 hours on November 7th on twitch.tv/KindaFunnyGames to figure it out.",
            "start": 934.32
        },
        {
            "text": "green Namaqua. Just I can't I got to figure something. No it's Namaqua. Now **** your It's tough. It's tough. We have 4 hours on November 7th on twitch.tv/KindaFunnyGames to figure it out. Well actually we won't cuz that's what it is right? It comes and goes. It comes and goes. What does this **** thing look like? Or can we find it? We already saw. It looks like this stupid thing. You just climb that. I I would prefer to hunt these animals if I'm being honest. There's a few you have to capture. You shoot with your tranks. You did them. You were talking about it. I did. I did a couple. But it was like That's fun. Yeah that is fun. The bear wasn't you know was early on in the game but it's a blast. Yeah cuz you stood up on a rock and just over and over again. He's like \"What are you doing?\" And I'm like \"I'm taking you.\" He's like a 400 lb man on PCP man. He just keeps coming. All right. So here's what we're going to do. Do this. See I brought in the do these angles.",
            "start": 986.84
        },
        {
            "text": "are you doing?\" And I'm like \"I'm taking you.\" He's like a 400 lb man on PCP man. He just keeps coming. All right. So here's what we're going to do. Do this. See I brought in the do these angles. So I'm bringing in I'm going to use him to orient myself. You playing the football song. Yeah. Call. That's not the right. I mean that's That is a football song but that's not He's watching hockey. Oh I'll be quiet. I just hear the crowd and the announcer. I just assume it's football. That's what what person in their right mind would choose to actually want to talk. Good point. Good point. Oh look at this **** It's just right there. It's right here. See that's the thing. You can say you can talk all the **** you want about this. I know a lot of people are like \"Ah capturing animals but like they're all right here which I like.\" This does seem arduous. Oh you have infinite amount of cages. Yeah you can only put down the eight or whatever I put down there. And I'm not sure",
            "start": 1038.16
        },
        {
            "text": "but like they're all right here which I like.\" This does seem arduous. Oh you have infinite amount of cages. Yeah you can only put down the eight or whatever I put down there. And I'm not sure how much you know the whole like **** satanic ritual of putting you know capturing snake in inside of these. I don't know how important that really is to it but it's what the video does and I just want to have it done with. It seems a little cultish like you're you're about to get back on the plane and sacrifice a virgin. And I don't even get to watch. Oh you can watch. Okay. See if we got him. Remember we're looking for the Namaqua Chameleon. He comes and goes. He comes. Remember ladies and gentlemen we're This is a buildup for Extra Life. So go there twitch.tv/KindaFunnyExtraLife uh November 7th Saturday 8 a.m. Also though you can go right now to KindaFunny.com/ExtraLife donate money which would be great for us because of course we're doing this to raise money. ****",
            "start": 1079.2
        },
        {
            "text": "November 7th Saturday 8 a.m. Also though you can go right now to KindaFunny.com/ExtraLife donate money which would be great for us because of course we're doing this to raise money. **** got this guy's ass. You nailed it. And I got somebody else. I got a horned it looked like too which is good for me. All right. Yeah I have more gerbils. I don't **** care about the gerbils. Kojima can you push the gerbils? Look there he is. Look at this **** He looks like Kevin. He does look like Kevin. Kevin was a chameleon. And I got this guy too. He was new cuz he I got the call. I got the call sign for him which is important. But now I got him. So I just knocked out two. Important Bill. Look at you. So you got 17 left. Yeah we're doing it man. I think we should just let this let's play and do them all right now. This feels great. It feels great. But doesn't it is reward. You get that reward. I was 77. I was teasing you earlier. I do I I appreciate and I respect that feeling",
            "start": 1125.2
        },
        {
            "text": "play and do them all right now. This feels great. It feels great. But doesn't it is reward. You get that reward. I was 77. I was teasing you earlier. I do I I appreciate and I respect that feeling of accomplishment you get. And there is an alien part of my brain that would love to do this but I just first of all I don't have the skill to S-Rank all the missions. I would actually have to train and figure that out and I just get too frustrated. Plus it kind of takes to me it's it just takes a little bit of the fun away. I'm like you know what if I find something I find it. And that's the thing like of why I stopped what I was doing before right? Where I was like you know what? I can't force myself to play cuz I was forcing myself to play it and I wasn't having fun. And like granted Saturday at some point Saturday it will become work right? I will be frustrated at a mission that's not going my way. I'll have to do this. But bring me in. I'll ask Frank. Thank you. I'll let you",
            "start": 1160.56
        },
        {
            "text": "Saturday at some point Saturday it will become work right? I will be frustrated at a mission that's not going my way. I'll have to do this. But bring me in. I'll ask Frank. Thank you. I'll let you That's exactly what I'll do. Ladies and gentlemen this has been a let's play here on youtube.com/KindaFunnyGames. Remember we put up one each and every day. But more importantly at least for this week we are doing Extra Life. Saturday November 7th 8 a.m. Pacific time until Sunday November 8th 8:00 a.m. Pacific time. We'd love it for you to come watch us. It'll be on twitch.tv/KindaFunnyGames. We'd love if you'd support us. A dollar will go a long way. We're already killing it in terms of our team. Kinda Funny Team which is us and then all sorts of best friends who are out there. We've raised a lot of money for charity. You can come look at it on twitch.tv/KindaFunny. Not like a pile of money but we'll have the total up for how much we've raised. But if you can go to kind of",
            "start": 1193.76
        },
        {
            "text": "We've raised a lot of money for charity. You can come look at it on twitch.tv/KindaFunny. Not like a pile of money but we'll have the total up for how much we've raised. But if you can go to KindaFunny.com/ExtraLife right now you can toss us a few bucks to support this amazing charity event. And until next time been my pleasure to serve you.",
            "start": 1232.48
        }
    ]
}