{
    "id": 1362,
    "video_id": "R1OJpHD8i3A",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "Cloud in Smash Bros. and Half Life 3 Predictions - Kinda Funny Gamescast Ep. 45",
    "description": "Our impressions on Nintendo's latest Direct, now that Fallout 4 is out, Colin reflects on his predictions, we discuss the most emotional moments in video games, and we question if Half Life 3 will ever be released. (Released on Patreon on 11.13.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1448028001,
    "duration": 6328,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome to the first ever episode 45 of the Kinda Funny Gamescast. As always, I'm Tim Gettys. I'm here with the coolest dudes in video games, Colin Moriarty and Greg Miller. Now, we're doing something special today. A Nintendo Direct just happened yesterday. We recorded topics three and four that you will hear in the future after this happens, but for now, we're just going to Nintendo. We're getting right into it. I am so excited. That was a good one. It was a good one. Y'all talking **** the whole time, but I don't care. We weren't ****. No, it was a good one. It was good. It was fine. It was good. It wasn't just fine, it was good. Big surprise there. But here's, here's the thing. Yes, of course, there was the big surprise, but my thing with the Nintendo Directs, there's nothing besides E3 that gets me more excited in video games than Nintendo Directs. When Nintendo games, you get more excited about the Direct. That's the thing. I like announcements. I'm a big fan of announcements. That's why",
            "start": 0.31
        },
        {
            "text": "gets me more excited in video games than Nintendo Directs. When Nintendo games, you get more excited about the Direct. That's the thing. I like announcements. I'm a big fan of announcements. That's why, besides the thing, my favorite announcement from the Direct was the announcement of more announcements to come in December. That's true. That was the biggest pop you gave that whole thing is when at the end they're like, \"The Smash Bros. There's more Smash Bros. coming December.\" You're like, you put up your hands, \"Great!\" That's such a good sign screen, man. I just, but I love it. I love announcements and I love that there's this, this presentation and here's 45 minutes. Yeah, we're going to see a bunch of **** we don't want, sure, but that's, they need to do that. It's a press conference. You know what I mean? Usually you have to wait for press conference, you got to wait for E3s, your games comes or whatever. Like, yeah, Nintendo comes out and they drop them and especially for you, Mr. Nintendo, who you love Nintendo so",
            "start": 50.28
        },
        {
            "text": "you have to wait for press conference, you got to wait for E3s, your games comes or whatever. Like, yeah, Nintendo comes out and they drop them and especially for you, Mr. Nintendo, who you love Nintendo so much. I'm not Mr. Nintendo. I know I'm the NX's biggest fanboy, yes, but I'm not Mr. I hear next week we're installing a Nintendo World Championship belt. I wonder if who's going to win it. Yeah, I don't know. We'll have to see in the Let's Plays next week. No, but I thought I had a good time. It was a fun conference. I wasn't talking ****. We're doing the same thing we do at every conference. We just like Mystery Science Theater, but I just, you know, I get really defensive over Nintendo. I can see it in your eyes, so why I just back off a little bit sometimes. No, you don't need to. That like with the Star Fox game that looks like it's a GameCube game. You know what, we'll get to the Star Fox game, but overall to me, it's not just me because you go on NeoGAF and there's 100-page threads, very excited. Twitter in",
            "start": 85.88
        },
        {
            "text": "game that looks like it's a GameCube game. You know what, we'll get to the Star Fox game, but overall to me, it's not just me because you go on NeoGAF and there's 100-page threads, very excited. Twitter in general was flame. I mean, I'll tell you right now, I mean, this just broke right before we started recording. NPDs are out. Yoshi's Woolly World was the eighth bestselling game at retail in the United States and it out, so you're the Yoshi's. I've been telling it out sold Uncharted and Nathan Drake Collection, um, which came in at number nine. That's crazy. Although, uh, it's worth noting that the NPD numbers do not count, uh, bundles, um, which I'm sure PS4 sold plenty of with the Nathan Drake Collection. But I, I say that just to show that there is a group of people that are still buying these even more obscure, um, or not as desirable exclusives. So when you see something like Zelda being confirmed as still a Wii U game, um, which is not a huge surprise, uh, that shows that that game's going to sell very well. Yeah, when",
            "start": 120.68
        },
        {
            "text": "not as desirable exclusives. So when you see something like Zelda being confirmed as still a Wii U game, um, which is not a huge surprise, uh, that shows that that game's going to sell very well. Yeah, when it comes out. So let's just go down, down the order of how things happened in this Nintendo Direct, this beautiful, beautiful Nintendo Direct. Zelda: Twilight Princess HD finally confirmed. Greg owes me a burrito 'cause he said, \"This ain't happening.\" I was like, \"What's wrong with you?\" When did you say that? Why cannibal, yeah, but I thought, why cannibalize your Zelda game that apparently is not coming in 2016? I don't care. They said 2016. It's not coming 2016. I'll double down. I'll put another burrito on the line that you're not getting your Zelda Wii U in 2016. I mean, I don't want to bet that if it doesn't come out in 2016, they're going to be in trouble. I don't believe that. I, I'm still holding out even though they're **** saying all this stuff. I'm still holding out that it's not coming to Wii U. Like, and",
            "start": 156.96
        },
        {
            "text": "out in 2016, they're going to be in trouble. I don't believe that. I, I'm still holding out even though they're **** saying all this stuff. I'm still holding out that it's not coming to Wii U. Like, and again, this is just my, my warped thing. I'm hoping it doesn't come to Wii U. I see saying it's coming to Wii U. It makes no sense for it not, especially this, this Direct confirms it to me. Yeah, absolutely. So, but I'm wait, wait, before we move, why would you make that bet? It like conclusively leaked that like a month ago. I like making entertaining shows where Tim and I argue about things and I, I'll buy a burrito anytime. It's not like I bet him 100 bucks. I wasn't like, I was like, \"It's going to happen.\" But so you make bets just to make them. Your bets don't mean anything. People get engaged. They talk about it then on Twitter and they tweeted us about it. I thought it was a dumb move. So, but now if I, if I really don't, now if this Zelda game is going to be so far out, yeah, yeah. So I mean, yeah, we got the release date of March",
            "start": 197.96
        },
        {
            "text": "and they tweeted us about it. I thought it was a dumb move. So, but now if I, if I really don't, now if this Zelda game is going to be so far out, yeah, yeah. So I mean, yeah, we got the release date of March 4th for Twilight Princess HD. Yeah, I will say that looking at it didn't excite me the way, of course not. It's not a good Zelda game. I mean, it gets, I think it gets shot on a lot. It's definitely not, it's, I, I don't think it's, it's not, it is good. It's not amazing, forgettable. It's definitely, it was definitely a decline in quality, um, that I think really actually started with more like the Minish Cap than anything else. And then kind of just started like Wind Waker was to, to me, the last, I **** love Wind Waker. And, and to me, that was the last truly interesting, just aesthetically pleasing, really interesting looking, different kind of Zelda game. By the time I got the Skyward Sword, I just didn't care anymore because Twilight Princess I felt so burned on. So Twilight Princess was the first Zelda game",
            "start": 234.12
        },
        {
            "text": "looking different kind of Zelda game. By the time I got the Skyward Sword, I just didn't care anymore because Twilight Princess I felt so burned on. So Twilight Princess was the first Zelda game that I sat down to play that I didn't, with the exception of the 3DS ones or the DS ones, because you had to use a stylus. I just didn't, I was like, \"Nah, no way. Not for me.\" So I, I don't get, I'm, I'm with you that I don't, so you never beat it? No, no, no, really? No. I did. And all I remember is fringe fingers turning into a wolf in the beginning. Like, I don't remember that game. I played that game, sucked. I played that game stem to and just don't know, don't remember anything about it 'cause I just, meanwhile, Ocarina of Time, Majora's Mask, uh, Wind Waker, these are things, you know what I mean? Even, uh, Link Between Worlds recently, right? Like, I remember moments of how much fun I was having in this game and what I remember about Twilight Princess is getting stuck in one of the dungeons and my girlfriend at the time quietly",
            "start": 277.88
        },
        {
            "text": "right? Like, I remember moments of how much fun I was having in this game and what I remember about Twilight Princess is getting stuck in one of the dungeons and my girlfriend at the time quietly looking it up on IGN and then be like, \"Well, what if you went over there and did that?\" I'm like, \"I've done that before.\" Like 10 minutes later, \"Shh, I really think you should go do that.\" Like, \"All right.\" And it worked. Like, God damn, that's funny. I, I like Twilight Princess. It's not my favorite Zelda game, but I don't think it's as bad as people make it out to be. But I will say that watching the an HD trailer, I was excited because I knew this was coming. I want a burrito off of it, damn it. But I was excited to see the trailer because I thought it was going to be impressive to me in the way that Wind Waker HD, when I saw that trailer, I was like, \"Ooh, this looks good.\" You know? And yeah, the cell shaded, it cell shaded works better in the HD buing of things, but I thought Twilight Princess was going to look a little better.",
            "start": 315.32
        },
        {
            "text": "that trailer. I was like, \"Ooh, this looks good.\" You know? And yeah, the cell shaded, it cell shaded works better in the HD buing of things, but I thought Twilight Princess was going to look a little better. This, looking at it, I'm just like, \"Oh, that's what Twilight Princess looks like.\" I'm sure compare him side by side. What you totally not, you think you remember? It's, I thought I'd get a little bit more of like, \"Ah!\" And I didn't. Yeah. Um, but there's a Wolf Link amiibo, so Zigger's happy out there. Of course, Zigger must be. He's probably in a coma right now with all the amiibo talk and all these different amiibos. I'll say that I think it's a smart move for them to release the game because a lot of people do love it. And, and there is not, you know, there's a dearth of games on Wii U. So I mean, I think it makes perfect sense. Even if it was, even if Zelda, the new Zelda was going to come out in the summer or something like that, I don't think it, I don't think that the release of it affects it at all. But this was the least",
            "start": 352.4
        },
        {
            "text": "even if it was, even if Zelda, the new Zelda was going to come out in the summer or something like that, I don't think it, I don't think that the release of it affects it at all. But this was the least surprising news because this, this conclusively leaked. So I, I, out of everything that I thought we would see, this was like the one I knew we were going to see. So I was glad that they opened with it. Artwork leaked. There was little like, it was on the eShop. Yeah, it was like, \"Of course it's going to happen.\" Yeah. And the, the big thing about the Direct for me is like, there's, there was so many games talked about, some of them for just three seconds. But like, that's all I need. It's just like, there's a lot of Nintendo things happening. Not all of it's going to be for you, but there's going to be a lot of it. This Direct had so many things that I was just like, \"Yes! Thank you! This is what I care about.\" Maybe no, no one else does, but I **** do. Um, moving on, my boy Bill Trinen. Oh, also they talked about the, the new Zelda and",
            "start": 388.68
        },
        {
            "text": "so many things that I was just like, \"Yes! Thank you! This is what I care about.\" Maybe no, no one else does, but I **** do. Um, moving on, my boy Bill Trinen. Oh, also they talked about the, the new Zelda and they said 2016 that it's coming. It's coming to Wii U in 2016. Still coming. They showed like 10 seconds of footage of it. It, it was new footage, but I mean, it didn't show anything new. Link kind of like had a weird like hood on. Yeah, scar thing. Um, I have a, I have a lot, I have a lot of hope in that game actually. I hope with the Wolf amiibo or whatever that's worth. There's other, you can put the other amiibos, Zelda themed amiibos. Take your time with that game. All the time you need on NX. But they, I mean, it's, I mean, they, they re, I still think it might be on the NX too. But if we believe the NX might come out next fall, which I don't think it will, excuse me, I'm burping. Uh, so I think that, you know, they, you know, there's no question it's coming to Wii U. I mean, there's just no question anymore. We've definitely",
            "start": 422.12
        },
        {
            "text": "next fall, which I don't think it will, excuse me, I'm burping. Uh, so I think that, you know, they, you know, there's no question it's coming to Wii U. I mean, there's just no question anymore. We've definitely debated this in the past. I mean, it's coming to Wii U. Yeah, and it's upsetting, but it's upsetting to me. And I think I, but I think for the like the success of the NX, I think it's upsetting. I wished that in the time we hadn't heard about the game, they just completely moved over and started fresh on the NX. It's still possible that they're doing that again. Remember like we said it before, they're in the space in between right now. And so they can't necessarily, you know, Twilight Princess was a GameCube and a Wii game. And I, I don't, I don't necessarily think that it's not, it's impossible that this is the same thing. They just can't say that, you know. Yeah, no. And I, I think I will be shocked if this game's not on NX in some form. My biggest question is if this is a 2016 game, the NX isn't in 2016, what do they",
            "start": 465.88
        },
        {
            "text": "thing they just can't say that, you know. Yeah, no. And I, I think I will be shocked if this game's not on NX in some form. My biggest question is if this is a 2016 game, the NX isn't in 2016, what do they do with it? And the thing is, they might not do the exact same they did with Twilight Princess. They might do something more similar to Smash Bros. on the 3DS and Wii U where it's the same game, but there's more stuff on the NX one. And that's going to make people want to buy it either again or wait and buy that version. Yeah, I think I just, I don't believe that NX is going to come out next year simply because it doesn't seem, it seemed so back in like between the NES and SNES transition in '91. NES was still like really viable actually for a long time. I mean, they were releasing first party Nintendo games in 1994. Um, so it was, it was, it was different then. SNES and N64 was a little more tapered. And by the time you got to GameCube, N64 was basically dead. Um, I remember the last N64 games I bought were in",
            "start": 505.8
        },
        {
            "text": "in 1994. Um, so it was, it was, it was different then. SNES and N64 was a little more tapered. And by the time you got to GameCube, N64 was basically dead. Um, I remember the last N64 games I bought were in the spring of 2001. And obviously it was in the fall of 2001 that GameCube came out. So I just, when you think about the transition from GameCube to Wii, 2004 and 2005, especially 2004, were really strong years for that console. But by 2006, the console was dying or dead already. And the, the, the release schedule of some of the games still on Wii U, uh, in 2016 indicate to me that NX, it just wouldn't make sense to release NX then. You know, I don't think it's, I don't think NX is a fall 2017, but I think it's probably maybe spring 2017. Yeah, I don't know. I mean, my money's on 2016, but just because I, we don't have anything besides Zelda left for the latter half of the year. No, but, but still, I just feel like you want it to taper and have some a vacuum of excitement before you, you don't want. This was the same",
            "start": 544.44
        },
        {
            "text": "anything besides Zelda left for the latter half of the year. No, but, but still, I just feel like you want it to taper and have some a vacuum of excitement before you, you don't want. This was the same, was the argument I made with why Zelda shouldn't move over to NX completely. It's because you don't want to burn the people that are going to be there for you, the only people that are guaranteed going to be there for you, the people that own Wii U. So it's, it's as long as you treat them well towards the end of the life cycle. Like Nintendo's fan base is, is demonstrably shrinking. And you need to take care of those people before you try to expand out where the Blue Ocean strategy kind of thing only works when you have a strong core, which is why, why the Wii, I think, succeeded because I just don't, I feel like I just, burn me, burn me hard. Let's move on. I want, I want good things. I think you're in the minority on that. I think you're in the minority on that. But I mean, I, as we, we're adults with, with some",
            "start": 588.64
        },
        {
            "text": "like I just, burn me, burn me hard. Let's move on. I want, I want good things. I think you're in the minority on that. I think you're in the minority on that. But I mean, I, as we, we're adults with, with some disposable income, right? Like, I just don't know that everyone's in a position where they, they, they don't want, you know, they don't want to be **** by, by Nintendo in terms of, of the Wii U or whatever. Like, give it some time to die. See, my argument to that would be that the people that aren't adults with money aren't the people that are clamoring for this Zelda game. Like, those are the ones that are playing all these other games that I don't care about. Like the Animal Crossing: Amiibo Festival or whatever the hell it's called. We'll find out. I hope I'm, I hope I'm wrong just in the sense that I want to see what the hell this thing is. But and I, I think we will see at E3. But, um, it would be nice for it to come out in the fall. I mean, you know, you don't want to be in a Dreamcast situation where you're",
            "start": 621.8
        },
        {
            "text": "see what the hell this thing is. But and I, I think we will see at E3. But, um, it would be nice for it to come out in the fall. I mean, you know, you don't want to be in a Dreamcast situation where you're coming out in the middle or towards the end of a generation because then you, then you are in a weird space and there's really no success stories of that happening, uh, when you think about it. So, um, yeah, yeah. Um, so then Bill Trinen comes out, talks about Triforce Heroes. There's an update, 30 stage free download. Talks about Splatoon, new stages, equipment, tournament mode. Mario Maker has a portal site where you can go on the internet and like look at websites that way, download them and sync them to console later. Hell yes! All of this to me is great news. This is what I want from Nintendo where it's these games are platforms. You're not going to need to wait for 10 years for the sequel to come out or whatever. You get these, we're going to keep giving you updates. Some of them are free, some of them paid.",
            "start": 656.04
        },
        {
            "text": "games are platforms. You're not going to need to wait for 10 years for the sequel to come out or whatever. You get these, we're going to keep giving you updates. Some of them are free, some of them paid. Whatever, it's going to be worth it either way. Like you getting stuff and how they're treat Mario Maker so far, I am in love with. It's only been out a couple months. We've already gotten multiple announcements or updates and stuff. So very stoked about that. Then they started talking about some eShop titles. Pokemon Picross, which I've never been a big Picross guy. No, it's, it's interesting to see that come out and it's a, it's a, you know, this was, this one of the free to start games. Picross. Yeah, it seems like this is like a new model in conjunction with the, the rumors that all the Nintendo mobile games are going to be free to play. So this seems like they're just exploring, not that this is the first time they've done it, but to explore, uh, the a different kind of pricing model. Whatever, Picross",
            "start": 693.24
        },
        {
            "text": "are going to be free to play. So this seems like they're just exploring, not that this is the first time they've done it, but to explore, uh, the a different kind of pricing model. Whatever, Picross games have been huge for Nintendo for a really long time, just not like a really long time. Um, just not in, uh, the West. So it is cool to see, um, them kind of support that again. But Picross games on Nintendo, Picross games have been huge for five plus years in Japan. So then the eShop title that I'm most excited about is the one called Fast Racing Neo. We've seen it before a little bit, but we're not getting a new F-Zero. Yeah, like F-Zero or something, but it's like pretty much a spiritual successor to the N64, um, era of those games. And oh my God, looks, that looks great. **** four player split screen. I'm not a racing fan, so I really don't have judg. See, I love that type of stuff. Like I, I love the future I Racers and I loved F-Zero. So very stoked about that. Surprised they just slap F-Zero on it. I know. Um,",
            "start": 732.04
        },
        {
            "text": "a racing fan, so I really don't have judg. See, I love that type of stuff. Like I, I love the future I Racers and I loved F-Zero. So very stoked about that. Surprised they just slap F-Zero on it. I know. Um, then Yo-kai Watch and Animal Crossing, they just, you know, did more bits on that, which not for me. Uh, then new bundles with both Splatoon and Smash Bros. That's great. You know, let's just get as many Wii U's out there and get people playing the good games that exist on it. Uh, Pokkén Tournament. We saw a new Shadow Mewtwo trailer. That game looks amazing to me. Like, I mean, when I say amazing, I mean very, very solid eight out of 10. Are you going to fight? Yeah, that looks awesome. I mean, it looks, it's a fighting game that, that's how I imagine Pokemon games would be when I was a dumb little kid. You know, like that's what the cartoons looked like. You know, just the Pokemon actually fighting with each other and stuff. Hell yeah, that looks great. Very stoked about that. Um, it's interesting the Tekken, you know, crossover",
            "start": 774.48
        },
        {
            "text": "what the cartoons looked like. You know, just the Pokemon actually fighting with each other and stuff. Hell yeah, that looks great. Very stoked about that. Um, it's interesting the Tekken, you know, crossover. And the name is horrible. It is horrible. I can't believe they're just because it's, it's, it's spelled Pokkén. So that's one, one problem with the K's. Pokkén. But, but it's, it's, uh, it does look pretty cool. Uh, I mean, it's not for me either, but it's, uh, they're taking advantage of Pokemon in weird ways. I don't know what they're doing. You know, like just do what you need, you know, you need to do with this series. Put a **** full Pokemon game on mobile and make an MMO for your console. Just do it. Just **** do it already. I don't. NX, NX, bro. We'll see. Final Fantasy Explorers on the 3DS. I think I can most cool. Yeah, I don't really care too much, but that definitely looks like a Colin Moriarty special if I ever saw. Yeah, it's just cool. A little cool matchup. I mean, I, I like, I like that kind of stuff",
            "start": 818.64
        },
        {
            "text": "most cool. Yeah, I don't really care too much, but that definitely looks like a Colin Moriarty special if I ever saw. Yeah, it's just cool. A little cool matchup. I mean, I, I like, I like that kind of stuff with, uh, kind of celebrating Final Fantasy's heritage before it was, uh, what it is now. So, um, yeah, it's, uh, it's cool to see those characters all in the same world. Not the first time we've seen that, but yeah. Um, yeah, I mean, it's a game that I'd certainly look to maybe play later. It's cool to see them all together in more of a actual, it's not really, didn't look too much like an RPG, but like an action RPG game. Usually we see them together in fighting games or like music games or stuff like that. Um, then Star Fox. We saw a trailer. April 2nd is the new release date. We saw more of the Walker. The Landmaster now has a Gravmaster mode that like the tank kind of hovers and stuff. They went through the controls and stuff. That's just the normal thing. It's always been, right? They unfortunately, and that's my",
            "start": 862.64
        },
        {
            "text": "now has a Gravmaster mode that like the tank kind of hovers and stuff. They went through the controls and stuff. That's just the normal thing. It's always been, right? They unfortunately, and that's my biggest thing with this game is from every time I've played it, it's not good. Like just straight up, it's doesn't play right. And you know, Colin's biggest thing is that it looks like it just looks old. And I, I'm not, I'm not a, I'm not a guy that really gets hung up on aesthetic. I really don't. Like we're playing Fallout 4 now and I know a lot of people think that game's ugly, but that's not really one of the problems with the game in my opinion. Um, it's just that when you think about Star Fox's heritage, especially on Super Nintendo and N64, those games showcase those consoles in ways that other games didn't. And they weren't necessarily the prettiest, the most technologically advanced by the time you got to the end of the cycle. But when you look back at what Star Fox was doing early on SNES, uh, early to",
            "start": 899.52
        },
        {
            "text": "and they weren't necessarily the prettiest, the most technologically advanced by the time you got to the end of the cycle. But when you look back at what Star Fox was doing early on SNES, uh, early to mid through, through its life, it was a pretty extraordinary game. And, um, you still look at it and you're like, it doesn't age very well, especially at Star Fox 64. But they, they, these were kind of showpieces in their own way and their own respect in my opinion. Like I, I just think that these were, it's just disappointing to see a game that really straight up looks like it's a GameCube game. Like or a Wii game. It really doesn't look like a Wii U game. And some people are like, \"Well, it's indicative that maybe it's been in development for a long time.\" I don't, I don't know anything about that. I think it may, might have been a Wii game, but because they decided, I mean, think to think back on, on the Super Nintendo version, especially the, the N64 version of Star Fox, the polygonal way the ships were rendered was",
            "start": 934.6
        },
        {
            "text": "have been a Wii game but because they decided I mean think to think back on on the Super Nintendo version especially the the N64 version of Star Fox the polygonal way the ships were rendered was was due not only to an aesthetic choice but due to the fact that that's what those consoles could do so they decided to keep the same shapes there's it's still angular and ugly and and I understand that that's kind of the known aesthetic the old school aesthetic of Star Fox but it does not have to look like that like when I and when I look at you know people on Twitter a few people are saying to me like well the Wii U just can't do that much and I'm like the Wii U can do way better than this I mean look look at Zelda there's there's no there's no excuse look at Mario 3D World Bay yeah Bayonetta it's like it's like you can do way better than this I'm I'm really shocked the way this game looks and I think it just the explosions the way like when you just I was paying close attention to just the",
            "start": 968.36
        },
        {
            "text": "like it's like you can do way better than this I'm I'm really shocked the way this game looks and I think it just the explosions the way like when you just I was paying close attention to just the little things in the trailer and like the explosions look awful the like when you destroy a ship in in its component parts it just depart just disappear it's like I'm like textures are low res there's there's there's nothing compelling about it and I I like Star Fox and I kind of expected more about it it's and what I said on Twitter was I'm sure it's gonna be fine I'm sure it's gonna be fun maybe the control scheme not going to be great I have not gone Hands-On with it but certainly their aesthetic choice to stick with the way the ships always looked was a mistake in my opinion because they don't have to look like that anymore they did have to look like that you know like and they just don't have to look you can like you don't have to have sharp 90° angle **** you know 90° angles on your",
            "start": 1006.8
        },
        {
            "text": "have to look like that anymore they did have to look like that you know like and they just don't have to look you can like you don't have to have sharp 90° angle **** you know 90° angles on your ships all over the place anymore you can have curvature and and you know it's just I don't know it it just bothers me so much that this game has been in development for so long and this is going to be a game that was released in 2016 I feel bad for Star Fox fans I mean that's the thing is I I'm a huge Star Fox fan like I'm like that Star Fox is one of my favorite franchises of all time and I have a very special connection with the the series even like the ones that people don't like like Assault I think is one of the best Star Fox games just because of the the flight mission there's very few of them in the game and the on foot ones suck they're horrible but the flight missions seem like a sequel to 64 which is amazing SNES it doesn't hold up like it's great as a technological thing going",
            "start": 1043.84
        },
        {
            "text": "of them in the game and the on foot ones suck they're horrible but the flight missions seem like a sequel to 64 which is amazing SNES it doesn't hold up like it's great as a technological thing going back but like looking at it now playing it now it's it's not well nothing like that holds up it's the same thing with Pilotwings or anything like that like 64 does though yeah I I I think so to the degree that N64 games hold up at all I but but they hold up because of the gameplay and yeah the graphics and whatever it is what it is and that's not a Nintendo 64 ER that is a polygonal play ER too yeah um no I I I I don't I don't disagree with you it's just that like these were I was I remember being so impressed with Star Fox when I was a kid with like how it looked and and what it was doing and it's I don't know it's just it's just it's it's a disappointing thing to to tarnish the legacy of the games like that the graphics don't bother me like they're not good but they don't bother me",
            "start": 1078.56
        },
        {
            "text": "and it's I don't know it's just it's just it's it's a disappointing thing to to tarnish the legacy of the games like that the graphics don't bother me like they're not good but they don't bother me because it's like at least it it does look like Star Fox like you were saying it is very like that's how things look that's the Star Fox universe and I know that that is just like it doesn't need to be that way and yeah if we got like a beautiful cell shaded thing and like there was way more going on that could be cool and I'd love to see that that's not what we're getting I wish perhaps we'd gotten that instead but looking at this I don't look at this and go oh I don't like I don't want to play this because of how it looks no I don't either but I I but it's definitely it definitely if you drop that game on me like if you just showed me this game and you're like this is a canceled Star Fox game from seven years ago I'd be like I believe it 100% believe it yeah but I mean I think that's also",
            "start": 1118.08
        },
        {
            "text": "that game on me like if you just showed me this game and you're like this is a canceled Star Fox game from seven years ago I'd be like I believe it 100% believe it yeah but I mean I think that's also one of those things like when people compare games like oh that looks like that's how Twilight Princess looked back then it's like that's not true like this doesn't look like a GameCube game no it doesn't make me look a GameCube it looks like a Wii game uh I mean but it's HD and that's the thing is like that's all I Really Ever Needed from from Star Fox all right cool I'm good yeah but to be I mean and and to be fair to Star Fox I mean there's aesthetic choices being made that you can use Mega Man as an example of like well why do you make that you have to keep making NES games when it's an eight-bit game and why would you keep going back to that but I still think the we were playing Symphony of the Night when we did our our um on PlayStation One when we were doing our our stream for",
            "start": 1153.52
        },
        {
            "text": "an eight-bit game and why would you keep going back to that but I still think the we were playing Symphony of the Night when we did our our um on PlayStation One when we were doing our our stream for charity last weekend and I was talking to people in the comments about this is actually a technological this game was a technological feat and it's still pretty today because it's it's beautiful pixel art and um these multiple layer parallax scrolling in the background and all these little secrets and hidden things whatever like that game still stands up side scrollers typically stand up very well but when you go into the when you go into the realm of 3D or whatever you you have to keep kind of evolving um because there's just greater expectations and you see that Fallout with Fallout 4 right now um based on the way it looks compared to Dying Light in The Witcher in other words there's just no excuses anymore so when I see a game like this it's just like well there's no excuse for this",
            "start": 1184.32
        },
        {
            "text": "now um based on the way it looks compared to Dying Light in The Witcher in other words there's just no excuses anymore so when I see a game like this it's just like well there's no excuse for this to look like this regard if they're making a choice or not it's I think and I I know I'm not the only person with that problem with the game I mean this is common that's the thing though but like my thing is just like that those are all problems but like to the hardcore Star Fox people I don't think that that's that big of an issue like my issue is the gameplay if the Star Fox gameplay is good I don't care about any of that and so far it's not and that's my biggest issue with the game and I wanted this Direct to come out and be like hey we're also adding just normal controls you don't have to use the gyro thing and I'm Still Holding Out for that cuz I will be shocked if they release this game and it can only control the way that we've played it so far no I don't think they'll make that",
            "start": 1219.32
        },
        {
            "text": "to use the gyro thing and I'm Still Holding Out for that cuz I will be shocked if they release this game and it can only control the way that we've played it so far no I don't think they'll make that mistake with with the the the thing cuz it's like it's not good I straight wouldn't play it if it was that way me neither I mean that's I will not play it and like that sucks but I don't think they're going to do that I think I think they have extra time and they're polishing it maybe that was one of the reasons is that they had to go and that's what I'm expecting from it and I thought we'd have heard it in this but but maybe maybe it's a marketing thing too where you know they don't want to see the thing about Nintendo Directs to me which is which is awesome and both both awesome and funny is that it's also very markety like it's like don't forget you can buy byy byy byy by by by by by by byy so like you know uh to me since it's so consumerist focused not consumer Focus but but about",
            "start": 1253.12
        },
        {
            "text": "is that it's also very markety like it's like don't forget you can buy byy byy byy by by by by by by byy so like you know uh to me since it's so consumerist focused not consumer Focus but but about consumerism specifically it would be weird for them it would be weird for Nintendo to come out and be like by the way we know the controls suck and we fix them you know like that's something you've released like for sure in a press release or something um I'm still hopeful for the game and I am hold reserving judgments because I do not like it right now I want to like it right now the graphics aren't the thing holding me back and when with Star Fox like you were talking about the Star Fox games have always been kind of a big technological meter for systems no but I even think like Assault like Assault graphically and a lot of the ways no but Assault was one of the first GameCube one of the first Nintendo games to have a fully orchestrated soundtrack and like that's a huge deal like since then",
            "start": 1286.48
        },
        {
            "text": "Assault graphically and a lot of the ways no but Assault was one of the first GameCube one of the first Nintendo games to have a fully orchestrated soundtrack and like that's a huge deal like since then we've seen you know Galaxy do it and Galaxy and like a lot of the Zelda games and stuff so now it's fairly standard but that's a level of polish that most most games any developer don't really do you know we see it with Uncharted and we see it with some of like like top top tier things but Nintendo does that stuff in a very unique way cuz their overall polish of their games is it's special you know and sure we'll see how this all goes but I hope that I hope for you I hope for all the Nintendo fans out there it works we got some more Fire Emblem Fates details Birthright and Conquest two different games this it sounds less like a Pokemon Red and Blue situation more like a Zelda exactly what I was thinking and an Ages thing that's exactly that's funny that's exactly the reference I was",
            "start": 1324.6
        },
        {
            "text": "games this it sounds less like a Pokemon Red and Blue situation more like a Zelda exactly what I was thinking and an Ages thing that's exactly that's funny that's exactly the reference I was thinking but the discount we didn't get with Oracle is going to be here which is cool very cool so it's buy one and then you get the other one for $20 as a digital download it's two sides of the same story then there's a third story that is like a third perspective on the two things that's cool it's God's perspective I think I think it sounds really neat I'm not a huge Fire Emblem fan but I I think I think this sounds uh this sounds really cool I think it's thoughtful to you know I know that there was a lot of questions when if this game was going to come out here at all and then uh which we knew it was you know a while ago but because of the two iterations how are they going to do this they only going to release one or they going to somehow compound them I really think it's a thoughtful way for",
            "start": 1366.8
        },
        {
            "text": "was you know a while ago but because of the two iterations how are they going to do this they only going to release one or they going to somehow compound them I really think it's a thoughtful way for Nintendo to get both games out to be like you can just get the other one for half off yeah that's pretty cool I got to respect the **** out of that because um it's a lot of money to spend on a game that I I I assume will not be very different you know like the um I'm trying to think of an example came to my head oh it was Tales of Xillia the original Tales of Xillia which um on PS3 which could be played from the perspective of two different protagonists but the story was the same and you got some different cut scenes but the it was the same game and I my assumption is that these aren't going to be radically different again like Oracle of Ages and Oracle Seasons which might even be more different from each other than these are but that remains to be seen but that definitely invoked those",
            "start": 1402.6
        },
        {
            "text": "to be radically different again like Oracle of Ages and Oracle Seasons which might even be more different from each other than these are but that remains to be seen but that definitely invoked those those Capcom Zelda games to me yeah and you can get all three of them in the special edition for $80 on February 19th I'm happy we got a release it look it looks like I'm going to have a really fun spring 2016 a lot of games that I'm looking forward to there uh games you're looking forward to Mega Man Legacy Collection yeah Legacy Collection's coming to 3DS uh they get that at amiibo too which I'm not I'm not super interested I can just take one and spray it with a **** with gold gold Mega Man amiibo and it has an exclusive challenge mode that you well the challenge was in the other ones too but the there there are new challenges in this one and I made one of them so uh Moriarty's Challenge will be in this uh and I'm excited about that uh it's really **** absurdly hard so I'll be",
            "start": 1437.56
        },
        {
            "text": "too but the there there are new challenges in this one and I made one of them so uh Moriarty's Challenge will be in this uh and I'm excited about that uh it's really **** absurdly hard so I'll be interested to see what when I designed it um I just went I it's hard you know I couldn't go to their offices or whatever and so um I was talking to them over email to com and I basically just took a bunch of YouTube videos that were already existing and I'm like from this point to this point is the first phase and then from this point to this point in this video is the second phase and so on and so forth and it's really long and really it's going to be quite difficult classic call yeah really long it's gonna be awesome um Hyrule Warriors Legends for 3DS we got some new character announcements we got Toon Link, Tetra, Skull Kid and a new character called Link looks like a female Link but instead of having a sword spin she has a spin kick yep yep Linkle Link Spin Attack kidding me with that ****",
            "start": 1478.2
        },
        {
            "text": "got Toon Link, Tetra, Skull Kid and a new character called Link looks like a female Link but instead of having a sword spin she has a spin kick yep yep Linkle Link Spin Attack kidding me with that **** name kick it's cool that you know it was funny I was just thinking about this not Linkle know what I was just think I was just thinking about what and it's not gonna happen in this new Zelda game either but it would be cool to roll reverse Zelda at some point at some point to make the to make Link the female and still I guess you'd have to roll reverse their names maybe too because you know you can't have like a male Zelda I guess but it would be cool to play as the female and go to save the male and I'm not saying that because you know I want you know uh A diversity or whatever necessarily I just think that that would be kind of neat we've seen this one story so many times You'heard that all the time that like they'd love I'd love to see a Legend of Zelda where you play as Zelda and",
            "start": 1516.04
        },
        {
            "text": "I just think that that would be kind of neat we've seen this one story so many times You'heard that all the time that like they'd love I'd love to see a Legend of Zelda where you play as Zelda and you're after and you played I mean she and all these kind things but it's it's it's it would be cool to play I guess you would even have to you wouldn't have to roll overse even with names it would be cool to just play as Zelda and go to say Link and it could still be a Legend of Zelda game yep um so I just think that that would be a neat perspective uh because there does need to be some freshness thrown into the series although I think we're going to get that actually with the Wii U game because I really do believe that this is going to be like a true open world RPG a very Western inspired game I mean I think it's I think it's they do that that sounds awesome I think it has the it seems like that's what they're doing and we've seen very little of the game but it seems the reason we've seen",
            "start": 1557.64
        },
        {
            "text": "I mean I think it's I think it's they do that that sounds awesome I think it has the it seems like that's what they're doing and we've seen very little of the game but it seems the reason we've seen so little of the game is because it's that you know like the little things we've seen have just been kind of traveling around and that says a lot for trying my dream Zelda game is a Romeo and Juliet 90s movie Style version of it where it takes place like in the future and remember Romeo and Juliet like the swords were guns and stuff like that yeah you're talking about the Leo DiCaprio John Leguizamo opponent to be like a motorcycle and **** I'd be **** into that um Dragon Quest VII and VIII confirmed to come to 3DS early 2016 no one cares hug absolutely no one it's a huge deal um most people probably don't care but it's uh Dragon Quest VII especially but Dragon Quest VII and VIII are games people really **** love people really love those games and one of my friends uses the",
            "start": 1587.84
        },
        {
            "text": "probably don't care but it's uh Dragon Quest VII especially but Dragon Quest VII and VIII are games people really **** love people really love those games and one of my friends uses the term JRPG as JRPG meaning like it's a really these are **** insane deep games like that Dragon Quest VII is 100 150 hour game I mean it's it's not it's that game's no joke and a lot of people missed it because it was it was a PS1 game and it came out pretty late I think it was a 2000 or 2001 even uh release so it came out around when like remember there was some late PS1 RPGs like Final Fantasy Origins and all that kind of stuff this was around that era a little earlier and so people people missed out on it um and that was a I if I remember correctly that was a pre-Square Enix game that was that was an Enix published game and that might be the last one of the last Enix published games um so uh it's cool to see that game again and then Dragon Quest VIII was a PS2 game with a similar pedigree of",
            "start": 1630.48
        },
        {
            "text": "that was an Enix published game and that might be the last one of the last Enix published games um so uh it's cool to see that game again and then Dragon Quest VIII was a PS2 game with a similar pedigree of just incredible depth and um I like Dragon Quest IX I thought it was a good game it was a 3DS or a DS exclusive I think um I reviewed it I think when we were at IGN but it it was missing like a certain something about it Square that I think VII and VIII had because VII and VIII were bucking the trends of what was going on in RPGs around them by remaining very true and that's always been Dragon Quest kind of Mantra until X which was like an MMO for some reason um so it's cool that these games are coming out people have been begging for these games the last time I was in Japan um which was over a year ago VIII was about to come out I think on 3DS and and it just didn't seem like it was going to happen because these games are very dense and localizing them is not going to be easy so um",
            "start": 1673.4
        },
        {
            "text": "over a year ago VIII was about to come out I think on 3DS and and it just didn't seem like it was going to happen because these games are very dense and localizing them is not going to be easy so um or isn't easy but it's it's awesome that they're coming out um Dragon Quest is really um whether it's Dragon Quest Heroes on PS4 that Dragon Quest Builders game that's going to be on Vita um these Dragon Quest uh re-releases the PS4 and Vita bundles that are in Japan whatever Dragon Quest is really living again plus the announcement that Dragon Quest XI is going to be a traditional Dragon Quest game which got a lot of people very excited Dragon Quest is kind of going through a Renaissance right now in addition to like some of the games like Joker and all these kinds of games monsters that that are kind of the um the ancillary you know spin-off kind of games whatever that are kind of still floating around so I have a real like a soft spot for Dragon Quest I always have it's one of it's",
            "start": 1714.36
        },
        {
            "text": "are kind of the um the ancillary you know spin-off kind of games whatever that are kind of still floating around so I have a real like a soft spot for Dragon Quest I always have it's one of it's one of the games that got me into high fantasy and into role playing games so um when I was very young so it's exciting that that these are coming out and that's I haven't played a 3DS game since Zelda so um so those will probably be the next two I play and I'll probably lose myself to them because I just they're grind fests and I like those kinds of games they're not like super story driven or very pretty or anything like that they're just fun you um if you like that kind of stuff so I skipped over this somehow but Pokemon Red, Blue, and Yellow coming to Virtual Console on the 3DS I had no idea that they weren't out so oh my God this so this is huge news this is the first time a Pokemon game has been released digitally like on Virtual Console like an old one at least I didn't know that I",
            "start": 1746.0
        },
        {
            "text": "that they weren't out so oh my God this so this is huge news this is the first time a Pokemon game has been released digitally like on Virtual Console like an old one at least I didn't know that I didn't know that that was a why is that a thing so that's the thing because of how Pokemon work like the way that the there's so much trading and battling and how the games interact and all that stuff where you know Pokemon Red and Blue and then Gold and Silver those Generations happened and then when the GBA Generations happened it was kind of like a reboot of the series because you couldn't have GBA games and Game Boy games talk each other yeah so then they they released Ruby and Sapphire and then they released Fire Red and Leaf Green which were remakes of Red and Blue and then that allowed you to catch all the the Pokemon like between the different you know Generations or whatever and then when the DS happened the DS could also interact with GBA games so that was never an issue okay you",
            "start": 1785.52
        },
        {
            "text": "to catch all the the Pokemon like between the different you know Generations or whatever and then when the DS happened the DS could also interact with GBA games so that was never an issue okay you know I got you and so Pokemon games are one of those things where they don't drop in Price ever because you always need them you always need them so Nintendo has you know a very special thing with how they release games where their **** just doesn't ever get cheap Smash Bros. will always be retail price you know yeah and uh Pokemon's one of those things so to see them actually do this is huge I never thought that we'd see them on Virtual Console and I'm super excited this means that we might get to see Gold and Silver and I would love to play the original Gold and Silver again like as of now the only ways to play those games are either originally with the consoles which at this point's hard because my batteries are all dead and **** so it doesn't save right or emulation via PSP or however",
            "start": 1825.08
        },
        {
            "text": "only ways to play those games are either originally with the consoles which at this point's hard because my batteries are all dead and **** so it doesn't save right or emulation via PSP or however you want to do it I like that there's now going to be an official way to play these games again and oh yeah you jumping back in oh I'm jumping in I think I might make Nick play too I want Nick to beat a Pokemon game specifically Yellow Version Pikachu Edition if you didn't know you didn't know the Yellow Version Pikachu it's so there's Red and Blue yellow was like the enhanced version of it that was based on the anime so you come across Team Rocket Jessie and James walks around follows you should I play one these are three so I can play one you do I need to play one oh yeah you should we can each choose a different star we can trade wirelessly now which is a new function which is cool no link cables needed I'm very excited about this we got a date too what was the date hold on no link",
            "start": 1864.24
        },
        {
            "text": "each choose a different star we can trade wirelessly now which is a new function which is cool no link cables needed I'm very excited about this we got a date too what was the date hold on no Link Cables no Linkle CA uh what a terrible **** name Link February 7th the same came out back in the day Tingle my talk **** about Tingle I **** dare I am upset about this though because Japan apparently is getting retail versions of Red, Blue, Green, and Yellow I was to say we never got Green ever we never did well we which was the original Pokémon yeah we got Leaf Green when they remade it but we didn't get to remake of Blue it's weird yeah it was always I was always fascinated by Pokémon Green because I was always like this is like what the **** is it it's just that was like the OG Pokémon game mhm oh well then the biggest announcement all of a sudden Cloud Strife announced in Super Smash Bros. what the **** who saw this coming yeah no one it was weird this is a weird one this is a",
            "start": 1905.88
        },
        {
            "text": "mhm oh well then the biggest announcement all of a sudden Cloud Strife announced in Super Smash Bros. what the **** who saw this coming yeah no one it was weird this is a weird one this is a weird one because I think it I think like we said we did a video about it and I said this could either have like deep meaning in terms of the future or this could really literally mean nothing at all and I think that's great because I think that this at least hints at Final Fantasy VII Remake coming to the NX and I would love that that this is good signs for the future of the NX right now not necessarily anything's going to happen yeah I think I think you might be reading into it too much but I think that but I don't necessarily know if you are I mean that's the kind of the thing is I just this is such a weird one this is a weird one uh Cloud has literally nothing to do with Nintendo he has everything Theatrhythm Final Fantasy but it's like people have been comparing this on Twitter to like when Snake",
            "start": 1949.8
        },
        {
            "text": "a weird one this is a weird one uh Cloud has literally nothing to do with Nintendo he has everything Theatrhythm Final Fantasy but it's like people have been comparing this on Twitter to like when Snake was in was in Smash and I was like well no it's not the same at all because Snake Twin Snakes and and the first Metal Gear game was an MSX and NES game so it's it there there's there's lineage there it's a history there's like a definitive history there are three Metal Gear games that were on Nintendo platforms only um so including a few Snake's Revenge as well so it's it's one of these things where I see Cloud and I'm like all right well Final Fantasy VII's only Nintendo Connection in the main is that it was going to be a Nintendo game um and that it just wasn't it couldn't be um they couldn't you know execute their Vision on a cartridge so it's it's interesting in that way my what I what I what I read into this is that it might not mean anything at all except for the fact that",
            "start": 1992.2
        },
        {
            "text": "couldn't you know execute their Vision on a cartridge so it's it's interesting in that way my what I what I what I read into this is that it might not mean anything at all except for the fact that there's two things this is a clear shot at Sony if my if my mindset is right in the sense that Sony could not secure this character for PlayStation All-Stars or they just they lightning no they they couldn't get anyone they couldn't get **** they couldn't get Crash if Crash comes to Smash Bros. ladies and gentlemen and that's possible I mean you know that's possible as well but it's you think that's the December announcement oh my God no I don't think they would I don't think they would do that but there was a lot of rumors or conjecture that no one wanted or a lot of Publishers and IP holders didn't want their their characters involved in All-Stars because it wasn't a proven IP and this says that if that was the case with Square and we don't know if it was or not that they actually you",
            "start": 2035.76
        },
        {
            "text": "didn't want their their characters involved in All-Stars because it wasn't a proven IP and this says that if that was the case with Square and we don't know if it was or not that they actually you know unlike All-Stars they see a lot of Promise in Smash and of course they do because Smash is a fantastic series and a fantastic game um but it it shows that you know people were desperate for Cloud and for Crash um and they just got Cloud in in I wouldn't even say the competitor it's just the game that inspired All-Stars in a way so I I think at the very least this is an shot at Sony um to get one of their characters a character I mean there's there's really few characters that are more closely associated with PlayStation's history than Cloud um but again the conspiracy theorist in me kind of thinks that this means more than just uh than just getting and I don't know if it's I don't know that it's the the Final Fantasy VII Remake necessarily because as far as I understand that is a",
            "start": 2071.56
        },
        {
            "text": "kind of thinks that this means more than just uh than just getting and I don't know if it's I don't know that it's the the Final Fantasy VII Remake necessarily because as far as I understand that is a PlayStation first game um and will come out on PC as well yeah exactly but I wonder if this maybe insinuates that the Final Fantasy VII Port is going to come to Wii U that would be great um so I I wonder if that might be a little more reasonable to to assume than than um than the game being ported an yeah you know Smash has a weird history of kind of predicting what's going to happen and it doesn't necessarily like you're saying mean anything you know we saw Pit in Brawl and then we eventually saw the Kid Icarus game on 3DS but then we saw Ice Climbers still haven't seen them come back and do anything no they're still missing so they are still missing there there's a lot of stuff like that that it really doesn't mean anything and I think Smash kind of gave up on the whole this needs to make sense",
            "start": 2107.76
        },
        {
            "text": "no they're still missing so they are still missing there there's a lot of stuff like that that it really doesn't mean anything and I think Smash kind of gave up on the whole this needs to make sense stuff a while back like Snake was like what the **** even though he has lineage Nintendo really he's this the odd man out when it came to at least up till Brawl you know no he was but now that we have the Wii U one with Pac-Man yeah okay Pac-Man games are on Nintendo but that doesn't mean **** Namco made the game that's why that happened no I think that that's why I mean well that's what I'm that's what I'm saying is that you didn't have to there could have been deeper meaning in Snake or Pac-Man being on on the the systems except for the fact that there's just obvious reasons of why they probably were Snake with his age and Pac-Man just being a you know Bandai Namco's like icon as Pac-Man so of course they're going to shove him in there somewhere well then Ryu is another thing he's a",
            "start": 2150.36
        },
        {
            "text": "were Snake with his age and Pac-Man just being a you know Bandai Namco's like icon as Pac-Man so of course they're going to shove him in there somewhere well then Ryu is another thing he's a newer character that I could once Ryu was added I was like nothing I can no longer predict what's going on this that that that too but again there is a significant Nintendo Legacy like the original Street Fighter '89 was a Nintendo game and so it's it's you know that's an NES game and then Street Fighter II was was at home on Super Nintendo that's where everyone played the **** game because the Genesis version was so borked you know with the control scheme so it was so again there might be more to it or there might not there clearly isn't with Street Fighter V because that's a PlayStation game but and a PC game but that made sense to me too I mean that's where I played Street Fighter II Street Fighter II Turbo Super Street Fighter II like I played all those on Super Nintendo so there is a uh uh an",
            "start": 2185.4
        },
        {
            "text": "a PC game but that made sense to me too I mean that's where I played Street Fighter II Street Fighter II Turbo Super Street Fighter II like I played all those on Super Nintendo so there is a uh uh an obviously Street Fighter the original Street Fighter so that wasn't as confusing to me the point I'm making with Cloud is that there's nothing connecting also they overtly I mean there was Final Fantasy VII music like and they even showed the Final Fantasy VII Logo like it was built up to make it kind of look like Final Fantasy VII was coming in some form usually Smash trailers start with Smash like the bur thing and in the Direct it didn't in the trailer if you watch on YouTube now it does but except um that's interesting because they usually always show that first so they were trying to trick us um I'm so excited about this but like you were saying earlier I'm more excited about the fact that we're getting a **** Smash Direct next month yeah like that's huge what do you think it's going to be stages",
            "start": 2222.0
        },
        {
            "text": "excited about this but like you were saying earlier I'm more excited about the fact that we're getting a **** Smash Direct next month yeah like that's huge what do you think it's going to be stages characters oh yeah I mean there's definitely characters definitely State we'll get a release date for Cloud it might I am willing to bet it will be one of those like they're available now and it's going to be Cloud. Wolf will come back to promote Star Fox um Shovel Knight I'm going to be shocked if he's not in it like he has the amiibo um Ice Climbers for God's sake maybe I mean at this point the only characters in Smash that aren't back are Ice Climbers, Snake, Wolf, Pichu I think that's it Pichu doesn't need to come back Pichu's not coming back that was a waste I will be shocked I never thought Roy would come back either though so I don't know there's no no rules I know that there are some I know there are some technical limitations with the Ice Climbers apparently I don't really believe",
            "start": 2261.92
        },
        {
            "text": "Roy would come back either though so I don't know there's no no rules I know that there are some I know there are some technical limitations with the Ice Climbers apparently I don't really believe that uh and making those characters run on 3DS that that's the rumored reason why there or maybe that is the reason but I just figure it out you know me like I I I know that they weren't very popular characters but those were my characters and I and I and I loved playing as them you can't change your name on Sony because of technical limitations you can't play his Ice Climbers I have a feeling that the reason I think that they're not there for a reason and that is they just want to bring them back at some point as DLC and I think that they will but it's not even that exciting for most people you know like this was something you should have done like immediately like this should have been the first piece of DLC because I think that I think now so deep it's like people are going to be like",
            "start": 2308.28
        },
        {
            "text": "you know like this was something you should have done like immediately like this should have been the first piece of DLC because I think that I think now so deep it's like people are going to be like well they're just people are going to be disappointed and that and that's going to disappoint me I think but I think that this is going to be like a Lucas announcement where it's just like yeah you get Roy well Roy is kind of a big deal coming back from Melee and for you and Lucas you know so and Mewtwo as well it's like these returns they're not supposed to be the like oh **** things it's more like you also get this just so they can say there's three characters you know uh the roster is getting ridiculous at this moment it's getting it's quite robust and there are there are some third parties that I would you know or some other I would I always really wanted Wily in the game um I would have rather had Wily than Mega Man uh but to play like I've always said they play like Pokémon",
            "start": 2341.04
        },
        {
            "text": "third parties that I would you know or some other I would I always really wanted Wily in the game um I would have rather had Wily than Mega Man uh but to play like I've always said they play like Pokémon Trainer which I think would have been fun with the different Masters but you know we'll see they're probably rounding it out I can't imagine they're going to sport this game for much longer after that I just not not because it's not selling it's an extraordinarily popular game it's just like you got to kind of wane it let it wane and and maybe bring it to NX at some point I mean so that's my thing is I can't believe that a Smash Direct was just announced like we got this is going to be the third Smash-specific Direct that we've gotten over the last couple years like right before one came out they had one and they announced I thing was like 50 huge things coming to Smash Bros. so not only did they give me a Smash Bros. video they gave me a list video announcing a whole bunch of **** I'm",
            "start": 2375.84
        },
        {
            "text": "they had one and they announced I thing was like 50 huge things coming to Smash Bros. so not only did they give me a Smash Bros. video they gave me a list video announcing a whole bunch of **** I'm like what and now at this point we can play an eight player match where those players are Pac-Man, Mega Man, Mario, Sonic, Cloud, Ryu and I don't know whatever Pikachu that's insane no Dry Bones though yeah not yet I doubt ever but then then they had the the other Direct where it announced Roy and um Ryu and stuff that's insane now we're getting another one this might be the last one like this might be that Here's the final thing but also I love that it's going right into the holidays I'm stoked it's fun to see you so excited oh this is so usually always just Nintendo news for you here you are Sunshine so good but then talk about the NX I think that there is a chance for them to keep supporting this game and then somehow just transfer it over to NX I think that's probably the smart move I",
            "start": 2412.52
        },
        {
            "text": "Sunshine so good but then talk about the NX I think that there is a chance for them to keep supporting this game and then somehow just transfer it over to NX I think that's probably the smart move I think that's probably the smart move and and I wonder if I wonder if Bandai's not already working on that so it's it's uh yeah it's fun I mean I I I'm of two minds with the Nintendo Direct mentality like I said like I it's it's really a cool very cool way to speak to your fans um in a way that's unfiltered um and rehearsed so it's meaningful and impactful whatever I also like I was saying I always kind of make fun of Nintendo Directs as well just because they are very like bye bye bye bye bye bye bye bye bye and don't forget and don't forget and don't forget and you can have this this this this this this and I'm like that's cool but I feel like because that's what games are right that's what **** E3 every Sony conference every Microsoft conference but it's not quite as like shilling yeah",
            "start": 2458.96
        },
        {
            "text": "this this and I'm like that's cool but I feel like because that's what games are right that's what **** E3 every Sony conference every Microsoft conference but it's not quite as like shilling yeah like I'm like it feels a little dirty sometimes I'm like I **** get it guys like the games are for sale like just show them to me and let's talk about release days but I don't have to kind of like you know it seems a little it comes off as a little much to me too but but that said like I do think it's it's uh extremely effective yeah I see I love it because we either get to see it in a fun video that creates an event out of this thing or it's the same information in a press release that's just release date in a price tag you know I would much rather he stupid jokes and then this thing just because even though I would never have watched the trailer for some of those things now I'm forced to to see the Cloud Strife announcement you know and I love that it's 45 minutes it's not like it's no I",
            "start": 2494.96
        },
        {
            "text": "even though I would never have watched the trailer for some of those things now I'm forced to to see the Cloud Strife announcement you know and I love that it's 45 minutes it's not like it's no I mean it's not a time-consuming it's fun I mean it's it's a fun we always said when Vita come out and really start to die immediately that that it would uh it would have been cool for them to have like Vita Directs and stuff like that or that kind of style but it's just that's a Nintendo thing and I don't know if anyone can even really mimic it or attempt to mimic it because they'll be called out on it I think Nintendo kind of hit gold with with this notion of cutting the middleman they're good at that because the middlemen are not that important anymore like it's it's more about just speaking directly to your fans you're you can find a group of anyone that likes go to the fire and when people go to the Pokémon people you can just talk directly them you don't have to filter it through like a bunch",
            "start": 2533.56
        },
        {
            "text": "to your fans you're you can find a group of anyone that likes go to the fire and when people go to the Pokémon people you can just talk directly them you don't have to filter it through like a bunch of other people so they they were really the first ones to realize it and so you know more power to them for that yep so guys topic two of the day Colin this one's really for you now Greg I want your thoughts as well but I'm glad you know for months we've been doing this show this is the 11th month 11th month of the Kinda Funny Gamescast and every month we we've talked about Fallout 4 ah coming mhm going to be this thing that takes over everyone's lives the world's going to stop you know everyone will see the light no video game will sell a single copy because Fallout 4 I don't think all of the copies now that it's here now that you you put uh put some time into the game has Fallout 4 changed the world no Fallout 4 hasn't changed the world but I never said it was going to change the",
            "start": 2565.68
        },
        {
            "text": "of the copies now that it's here now that you you put uh put some time into the game has Fallout 4 changed the world no Fallout 4 hasn't changed the world but I never said it was going to change the world being being an **** but it's definitely changed the gaming world I mean you know it's it's not like change the way we're going to look at games forever or anything like that I don't think it's it's that particular game but it's fun watching the statistics especially on PC how the game's doing it sold 1. million copies uh in a day on PC it had more concurrence than Dota um which is like ridiculous uh for a single player game um it's definitely a phenomenon I mean it's definitely clearly going to sell very very very very very well I don't know if I'd call it a phenomenon I'm right I think everybody's lives are just about normal I love how you were waiting for that I like boy, I'm so loud I'm excited I've been Uncorked lately you've been Uncorked yeah oh on your loudness just",
            "start": 2607.96
        },
        {
            "text": "I think everybody's lives are just about normal I love how you were waiting for that I like boy, I'm so loud I'm excited I've been Uncorked lately you've been Uncorked yeah oh on your loudness just lately yeah yeah yeah the last couple days of Colin & Greg Live we've been having fun you brought out the good in me yeah it's been I forgot about how much fun that show can be you guys can just keep doing it I just tot I mean so you know going back to it though like I'm being hyperbolic about it but like you really did kind of hype this up as as like it was just going to change like not change the world but like you know like things were **** that were around this and like did do you still stand by that uh yeah I mean it's been interesting to watch I think I was probably wrong about Black Ops III considering and I I think I I don't know where I talked about that I think I thought it was on the show but but about how I kind of didn't really understand the undercurrent of Call of Duty",
            "start": 2644.64
        },
        {
            "text": "Ops III considering and I I think I I don't know where I talked about that I think I thought it was on the show but but about how I kind of didn't really understand the undercurrent of Call of Duty fandom about how it's swayed out of nowhere to Treyarch um and uh you know people hated Treyarch like five years ago so I didn't realize that that had changed um so I think I saw the game uh people have been sending me links I didn't I didn't read any of them but but about Call of Duty: Black Ops III selling extraordinarily well yeah today we did a story on KFG Live from Variety that it's the biggest entertainment launch this year of all time of this year yeah $550 million right beating Jurassic World not explaining if it included the bundle prices mhm yeah so it's it's definitely selling well um you know it remains to be seen how Battlefront is doing obviously Microsoft's been weird with Halo numbers they don't really have anything because of Ghosts though the Call of Duty",
            "start": 2693.44
        },
        {
            "text": "selling well um you know it remains to be seen how Battlefront is doing obviously Microsoft's been weird with Halo numbers they don't really have anything because of Ghosts though the Call of Duty thing cuz you know forever it was just the Modern Warfare Black Ops kind of switch off right and then Ghosts was kind of the one that just came out of nowhere yeah well there was World at War and and other things and then Advanced Warfare was after that as as well I mean yeah I understand what you're saying but I mean it was more Studios you're right there was um so it's it's uh I don't know if it's specifically that I think it's more that there's more developers in the mix now and and these games seem to be more Collective efforts as well the Call of Duty games seem to be just a kind of a whole Activision first party kind of effort when they you know with Raven and and all these other Studios kind of working on them just way never saw worked on them for a while yeah um so has it changed like",
            "start": 2729.56
        },
        {
            "text": "first party kind of effort when they you know with Raven and and all these other Studios kind of working on them just way never saw worked on them for a while yeah um so has it changed like everything no I mean it I we I played it you know for 15 hours before it came out I actually haven't played the game in like a week um just because other things have come up in in my own life and I've not really been playing games but uh you know it's just watching anecdotally the way people feel about it it seems like some people don't like it um that's not surprising to me uh a lot of people I don't say a lot but people didn't like Fallout 3 in New Vegas as well the same problems they have with those games are the problems that they have with this game so so that's the kind of stuff you can't really solve for I mean Bethesda could potentially solve for it I guess but but then that's alienating the people that like what this is well that's what's fascinating about the whole thing is the people who",
            "start": 2765.4
        },
        {
            "text": "for I mean Bethesda could potentially solve for it I guess but but then that's alienating the people that like what this is well that's what's fascinating about the whole thing is the people who are against it who are saying well it's this it's that it looks bad it's glitchy this that and the other I just feel like what did you expect you know what I mean like I feel like this is back to what we talk about a little bit with when I talk about my Batman DLC right like I had my expectations set at the correct level and I you know that's what this game is you know what I mean I'm I'm getting what I expected out of Fallout 4 and that's awesome and great and I'm loving it you know what I mean but I do see people super B out of shape about it that it's this that the other I'm just like well just because they jumped to a platform didn't mean their engine was going to suddenly like snap into shape, it'd be amazing and there draw distances and this that and the other couple weeks ago we were talking",
            "start": 2800.4
        },
        {
            "text": "because they jumped to a platform didn't mean their engine was going to suddenly like snap into shape, it'd be amazing and there draw distances and this that and the other couple weeks ago we were talking about that where you were saying that like you expect this but you you're hoping that like something crazy changes but like I mean you didn't expect that that's why you're not let down you know you're enjoying what you got it is interesting to me to see everyone else freak the **** out though because like the internet right now they're like oh like this is like a Telltale Game the engine **** sucks and this and that it's just like I don't know about that I think it's the back to what we're talking about with like again we've talked about this on multiple shows and you know we make Colin and I hatch one point usually and then just beat it into the ground through five or six shows I had made this point right that I thought what this Fallout would be is you know similar to what Persona 5",
            "start": 2829.48
        },
        {
            "text": "I hatch one point usually and then just beat it into the ground through five or six shows I had made this point right that I thought what this Fallout would be is you know similar to what Persona 5 is going to be right where all of a sudden there's finally this giant game that comes out in a series everyone's talked about forever you know what I mean and I don't know how many people who are like it's a Telltale Game I had ever played Fallout 3 and really understood what that game looked like and felt like and ran like you know what I mean so now they're jumping into this game this franchise that everyone's made out to be so beloved so amazing so lifechanging and you get there like this isn't that at all yeah I think the the problems are predictable I mean I I I didn't I didn't I wasn't under under No Illusion that the Bethesda it's a Bethesda game and it's going to run like a Bethesda game and there's a lot of again hyperbole out there about the way the game looks and the way the game",
            "start": 2864.32
        },
        {
            "text": "under No Illusion that the Bethesda it's a Bethesda game and it's going to run like a Bethesda game and there's a lot of again hyperbole out there about the way the game looks and the way the game runs and I understand that I mean all I can speak of from from my point of view having only played about 15 hours of the game is I've not run into any gamebreaking bugs or anything like super bad in the game in 15 hours and I I I I can tell you that I I didn't go that far into Fallout 3 or New Vegas without running into significant bugs or getting stuck in the environment or something I'm not saying that that's not happening to people it definitely is but but it's not happening to me so that didn't suck me out of the experience the hyperbole about the way the game looks and it looks like Fallout 3 like no it doesn't you really don't know what the hell you're talking about if you think the game looks like Fallout 3 no no offense like just put the put twoes next to the art styles are the same",
            "start": 2900.64
        },
        {
            "text": "3 like no it doesn't you really don't know what the hell you're talking about if you think the game looks like Fallout 3 no no offense like just put the put twoes next to the art styles are the same postapocalyptic art styles and I'm not a huge fan of that I think what people are reacting to is Dying Light and Witcher 3 which are these gigantic next-gen open world games that just look and run way way way better and they're no less ambitious than Fallout and I think that's the problem that's why I said in our review discussion Fallout 4 is the epitome of a game that was made in a vacuum this is a game that has been underdevelopment since before Skyrim came out so this is a game that was in development since at least 2011 if not 2010 so it's just the nature of the way the game was developed and I don't I'm sure Bethesda they're not stupid they know that they they're they're sacrificing one thing for the other it's a matter of if you it's a matter of if you enjoy being sucked into that",
            "start": 2932.32
        },
        {
            "text": "and I don't I'm sure Bethesda they're not stupid they know that they they're they're sacrificing one thing for the other it's a matter of if you it's a matter of if you enjoy being sucked into that world and you can let those things go I do think it doesn't look good aesthetically next to Witcher 3 which is really just as big and maybe even more ambitious in some ways and so I understand why people are upset about that that's why I'm so impressed with the way CD Projekt Red and Techland really came out of nowhere and are making games on Bethesda's level because that was see when Fallout 3 came out no one was making games like that like no one was really really really making games like that except for Bethesda whether it was Morrowind or Oblivion or Fallout 3 or Skyrim I mean these were kind of uniquely Bethesda games but now there's it's not to say no one was making open world RPGs or anything like that I was just to say that the breadth of those games were really unrivaled and that's",
            "start": 2967.6
        },
        {
            "text": "of uniquely Bethesda games but now there's it's not to say no one was making open world RPGs or anything like that I was just to say that the breadth of those games were really unrivaled and that's not the case anymore so um I think people are reacting to that as well it's a matter of the content of the games in the world and whether or not you enjoy those things or not but I think I I think that um I'm not super surprised about people's reaction to Fallout 4 because it's people's reaction to Fallout 3 nothing anyone is saying about this game on an aesthetic or engine level is anything new you know and so like none of it not not a single thing so what I'm bit more surprised about with Fallout 4 are the things that I don't like that have nothing to do with that um and that's not something that I that I hear a lot of people talking about because I think I'm kind of in the minority on that so what about you Greg what about it how you feeling love it good 58 hours in Beat the story last",
            "start": 3005.4
        },
        {
            "text": "that I that I hear a lot of people talking about because I think I'm kind of in the minority on that so what about you Greg what about it how you feeling love it good 58 hours in Beat the story last night tonight's Mission will be to go back play play the other way go you know go make other choices to see the other side of the ending keep working on the Platinum uh and keep chipping away at it keep going at it you know uh yeah beat a 58 hours in level 43 I believe is where that ended for me uh plenty more to do tons more to do you know what I mean uh I'm gonna keep I'm gonna go out to Platinum and do all that stuff it's like what we're talking about right it's what I expected I don't think it I don't think it you know I was talk like we talked about in the show right like I this is what I expect it to be and I hope it you know supersedes those you know gets gets past that did it maybe a little bit here and there but overall it's very much Fallout and that's what I was in the mood for",
            "start": 3043.56
        },
        {
            "text": "expect it to be and I hope it you know supersedes those you know gets gets past that did it maybe a little bit here and there but overall it's very much Fallout and that's what I was in the mood for and that's the thing is like you know I I remember when I was getting excited for Witcher like Christine was giving me such **** she's like you've never played the other Witcher games you don't even like high fantasy like why are you into this and I'm like I just want to get into a world where I can exist and that's what Fallout is Fallout's the you know the the the world I'd want to exist in in terms of you know Witcher or Fallout right that's the you know I like Western role playing games but I like them when they are set in America or there's these touchstones for me to connect with whereas when Geralt's fighting all these goddamn witches I'm like I don't know what the **** happening or care this is the game where yeah I want to keep chipping away and I want to get to level 50 and I",
            "start": 3083.56
        },
        {
            "text": "when Geralt's fighting all these goddamn witches I'm like I don't know what the **** happening or care this is the game where yeah I want to keep chipping away and I want to get to level 50 and I want to do all these things I'm I'm a little bit not not upset I guess but right like going back tonight and playing the other this other direction in my story and then going back and going to this one place to do these quests that I I didn't get the chance to First do is fun but I'm actually kind of disappointed in that because I made my choices and I made my thing and now I want to explore the world after those choices you know what I mean my and what I built but now it's like well now I got to go back and do these like fake little things go back to go there do Platinum I want a Platinum so you you miss trophies because of the decisions you made yeah you there are you definitely have to have safe files before you make choices to Platinum the game in quote quote unquote One play through and",
            "start": 3117.84
        },
        {
            "text": "you miss trophies because of the decisions you made yeah you there are you definitely have to have safe files before you make choices to Platinum the game in quote quote unquote One play through and not go back and replay and do a different thing like late in the game yeah well that's not that no that's not uncommon but the the at least it doesn't end like Fallout 3 ended right um and they actually had they actually had a like really patch that yeah they made a big deal about that that when this game ends you can keep playing that was such a that was like so stupid I hated that um yeah I I I think that Fallout 4 yeah it's definitely I mean the game is going to sell you know 10 plus million I have no doubt about that the um if if that's like that's only like a couple more million I think than Witcher sold so it's obviously it's obviously going to be this huge phenomenon so do I stand by this like gamechanging all game altering mind altering kind of thing yeah in the sense that it's it's",
            "start": 3155.0
        },
        {
            "text": "Witcher sold so it's obviously it's obviously going to be this huge phenomenon so do I stand by this like gamechanging all game altering mind altering kind of thing yeah in the sense that it's it's very disruptive game Tomb Raider is supposed to be really really good on Xbox One I'll be really interested to see how poorly it sells like like I I I don't see anyone talking about it and I don't and I well I see a lot of people talking about well I see people the reviews went up and I see people saying like oh it's good and I saw a few people from IGN like our old friends having played it I don't see any like organic conversation in our community about it at all there was yeah the other day have you been on the Facebook page not since yesterday but no no I mean I haven't seen anything Kinda Funny Facebook group I mean I I was almost going to make this a topic on the the show of just like the fanboyism going on of the people that are fighting for Tomb Raider versus Fallout the Xbox One",
            "start": 3191.52
        },
        {
            "text": "Funny Facebook group I mean I I was almost going to make this a topic on the the show of just like the fanboyism going on of the people that are fighting for Tomb Raider versus Fallout the Xbox One versus PS4 and I just thought it was ridiculous of how passionate people are getting about um the specific things but I see a lot yeah I that's Fanboy stuff I don't think I don't think Tomb Raider is going to sell very well and I and I I don't think it's a reflection on the game I'll be really interested to see based on the install base of Xbox One if the game actually sells better on PlayStation 4 um because it'll come out there next year I think that that's probably not a likely but but a possible scenario but yeah you got to take these things kind of with a grain of salt because I'm looking more for data than than passionate the thing about it was yesterday it was something along the lines of this is wrong but it was like you know on Twitter for the trends right it was like 200,000 tweets",
            "start": 3220.96
        },
        {
            "text": "for data than than passionate the thing about it was yesterday it was something along the lines of this is wrong but it was like you know on Twitter for the trends right it was like 200,000 tweets about Fallout 4 and then it was like 2,000 about Tomb Raider there was like this giant Gap that where it was like they were right next to each other on my little Trends thing and then the numbers were way way off yeah I mean I'm seeing a lot like on Gaff and everywhere like there's definitely a lot of positive chatter about I want it to do well I just I don't think that it's I mean it's doing very well um critically I just don't I I think it was just a huge mistake to release it then I think they'll see that when the NPD plays out but um because between that and Call of Duty I mean where is the mind share really and then Battlefront comes out next week so um it's pretty much game over for Tomb Raider I think but but uh not in a critical way and I'm sure I hope it's profitable I hope I'm wrong I",
            "start": 3256.64
        },
        {
            "text": "share really and then Battlefront comes out next week so um it's pretty much game over for Tomb Raider I think but but uh not in a critical way and I'm sure I hope it's profitable I hope I'm wrong I mean that's one of those another one of those things where I'm hope I'm wrong because it seems like the game's quite good but I just don't see how it how it it's going to exist in and in a world where on PC alone Fallout 4 is there's like 500,000 people at one time playing the game at any given time on it's like okay so that's just that's just an extraordinary amount of mind share being taken up by a single player game and a lot of new people are coming to the fore as well and remember that Fallout 3 sold like four four and a half million units by the end of 2008 so like you're going to look at three times that if not more probably with Fallout 4 just based on similar install bases of these consoles you know remember PS3 at that time was only two years old um which is hard to you know hard",
            "start": 3291.12
        },
        {
            "text": "three times that if not more probably with Fallout 4 just based on similar install bases of these consoles you know remember PS3 at that time was only two years old um which is hard to you know hard to kind of kind of contextualize but it's true so um PS4 outselling PS3 there's going to be more of these consoles in in the wild Fallout's very popular on PC so I don't know it's just there's only so much oxygen so I mean I'm excited to play Tomb Raider when I'm done with Fallout but when am I going to be done with Fallout and then on top of that Battlefront's going and I want to be actually you want to play Battlefront when other people are playing Battlefront it's like I my Tomb Raider time keeps slipping and slipping and then it's Thanksgiving and I'm not bringing an Xbox One to Chicago you know what I mean like you'd have to you'd have to check that **** right I'd have to get one of them Pelican cases wheel it in there put the big fraggy so heavy probably to pay more money so when",
            "start": 3328.0
        },
        {
            "text": "know what I mean like you'd have to you'd have to check that **** right I'd have to get one of them Pelican cases wheel it in there put the big fraggy so heavy probably to pay more money so when do you when do you think you're going to get back into Fallout Colin uh I'd like to I mean I just have not had the moment to do it I I had a kind of a crazy weekend we were doing Extra Life I don't play games on Sundays because I watch football um Monday I mean then we're working and you know yesterday I had dinner plans tonight I have dinner plans so it's uh I as soon as possible but I don't know like I it just kind of life has intervened how many hours do you see yourself putting into it once you do get back I mean I want to beat it um and I I I assume I'll Platinum it as well so I mean I however long that takes but um you know I want to spend time with it I mean I it's nothing the reason I've not played the game is nothing against the game it's just that you know uh life has intervened so",
            "start": 3362.2
        },
        {
            "text": "long that takes but um you know I want to spend time with it I mean I it's nothing the reason I've not played the game is nothing against the game it's just that you know uh life has intervened so um I did not anticipate life was going to intervene in this way but uh but it has and so I just roll with it and I'm kind of happy about it because I'm not really anxious to play it right now mhm my mind excuse me my mind's kind of occupied with other stuff so it's just uh I'll get to it when it'll be there see that's all I want to do everything we do every conversation with Kevin I'm like shut up and get out of my house so I can just play Fallout and again not because I'm trying to run through and be crazy I just want to exist in that world sorry Kevin you suck so another big question and I don't want like the actual answer to this because we'll save that for uh uh the end of the year probably but the Game of the Year conversation is this still in the same place going into going into like",
            "start": 3400.12
        },
        {
            "text": "want like the actual answer to this because we'll save that for uh uh the end of the year probably but the Game of the Year conversation is this still in the same place going into going into like you beat it you haven't beat it yet but just going into still having two months left of this year is where is this in the conversation it's going to be high on the in the conversation I think I mean I I haven't beaten yet but I don't know that right now it's not unseated games that I prefer over it but it's it's um it's going to be I mean it's going to win Game of the Year awards from big big websites I mean in Publications there's no doubt about that so you know we have to remember I think it's settling more in the high 80s in Metacritic which is a little lower than I thought it was going to but sites have given it Nines and 9.5's pretty universally um so it would be hard to imagine that it's not going to be a be up in there you know with Metal Gear all up I think it'll be between that and",
            "start": 3437.64
        },
        {
            "text": "sites have given it Nines and 9.5's pretty universally um so it would be hard to imagine that it's not going to be a be up in there you know with Metal Gear all up I think it'll be between that and Metal Gear I still think that Witcher is going to get ignored by most Outlets we'll see Kinda Funny forums M well between that and Metal Gear Greg I mean that's pretty much right up your alley yeah no and that's the thing right now is like I've been sh I shied away from it on the live stream I did on whatever where I played seven hours on Monday right uh cuz people are asking me and when I'm in the moment I think that's really hard I want to step step back and really take it all in and da d da and Jud G I mean all that said all that **** out the window I mean having just beaten it last night I think Metal Gear still my pick I love Fallout it's great but it's it is Fallout it is what I expected uh the ending didn't blow my hair back you know what I mean like it was like okay and but and",
            "start": 3477.28
        },
        {
            "text": "I think Metal Gear still my pick I love Fallout it's great but it's it is Fallout it is what I expected uh the ending didn't blow my hair back you know what I mean like it was like okay and but and like this morning I was talking to Christine about it in vague reference because she's still like you can hear her screaming and she streams it right now right of Just Like For Me Fallout games are about the journey not the destination and so there was like Great Moments there's so many Great Moments in the journey you know what I mean so many things that I remember my moments and da d da da da and I think they did so much right like I keep going back to you know the fact that you finally speak and you see yourself when you talk and all these different things but like overall especially after trying trying and failing to Platinum Metal Gear at Extra Life right like jumping back into Metal Gear it's like this is such a good **** game like this is so well put together you know what I mean",
            "start": 3512.4
        },
        {
            "text": "trying trying and failing to Platinum Metal Gear at Extra Life right like jumping back into Metal Gear it's like this is such a good **** game like this is so well put together you know what I mean yeah okay well I'm really excited to see where this goes with all of us I'm excited to get Tomb Raider in the mix cuz that is the thing like you know that is next for me is in terms of single player games and I I like the first Tomb Raider a lot you know what I mean and like the reaction it's gotten from our critic friends you know I mean Alexa Mitch all these people who talk about it the way they're talking about it too it's like it sounds hyperbolic like some of it just like that sounds too good for what I would think a Tomb Raider game could be um but it's still downloading at my house I'm bring your unit over here yeah but now it's like it's like last I saw last night it was like 56% downloaded so I'm like I'm not gonna stop it now I'm not surprised that it's good I mean I this was this",
            "start": 3549.12
        },
        {
            "text": "your unit over here yeah but now it's like it's like last I saw last night it was like 56% downloaded so I'm like I'm not gonna stop it now I'm not surprised that it's good I mean I this was this was a weird thing when people were talking about where I'm like where's why is everyone surprised you know like I it's good I had no I had no doubt it was gonna be great I mean the like the what I was concerned I felt bad for them because they're sending it out to die and like I I I just don't understand how you can't see it any other way but but like Aaron Greenberg told us on the podcast a few weeks ago there was really no good choice so yeah like the there they move it out of the way of Fallout and they're just going to be in the way of something else so it's it's that might even be more catastrophic for them so I get that um I I just felt bad cuz I knew the game was going to be great and and uh you know I feel bad that it's going to you know it's just not going to be able to shine the way",
            "start": 3587.28
        },
        {
            "text": "for them so I get that um I I just felt bad cuz I knew the game was going to be great and and uh you know I feel bad that it's going to you know it's just not going to be able to shine the way it probably should be able to shine but um I I still don't know that I'll play until it comes to PS4 I just don't I don't see that happening um because after after Fallout I I'd like to maybe you know try some other games that I missed this year I still want to go back and beat Dying Light um which I I **** adore I adore that game and I'm interested to see how since I haven't played it in six plus months if I still adore it or not and then I I really like I keep saying I really want to go back to BioShock Infinite and and Evil Within and so I'm gonna try to use that time this this this fall and winter if I can to to kind of get through those games I'm not really trying to like I said on our Fallout 4 review I'm not trying to be up in any game's ass anymore like and that's why that's why I was",
            "start": 3622.6
        },
        {
            "text": "if I can to to kind of get through those games I'm not really trying to like I said on our Fallout 4 review I'm not trying to be up in any game's ass anymore like and that's why that's why I was trying to kind of trying to be a little more restrained when I had time to play Fallout 4 to not play it um the way I would play games back in the in the day because I'm kind of just trying to savor them a little bit more in play at my leisure and and mix things up a little bit in terms of my entertainment so that I'm really looking forward to going back to it and now I'm in a position where I'm really looking forward to going back to Fallout um I just don't have time now so that's just the way the cookie cross crumbles I that's just the way it is dude topic three for the day comes from Patreon thank you all for supporting us on Patreon your names will be flowing across this beautiful screen I'm not sure which way but one of those two no they scroll down they scroll down down yeah man I",
            "start": 3655.56
        },
        {
            "text": "thank you all for supporting us on Patreon your names will be flowing across this beautiful screen I'm not sure which way but one of those two no they scroll down they scroll down down yeah man I haven't seen them for a while they come through and they go like this that's cool down also this topic brought to you by Patreon from Brandon Ferguson he says thanks for the help my Gamescast topic is what video games have brought out the most emotion in you while playing thanks I'm interested in hearing you answer this Tim I Colin and I talk about this stuff all time emotion stuff I mean I have so many and the thing is emotion doesn't necessarily mean sadness I think a lot a lot of people kind of you know put those two things together we talk about things like Journey and you know uh Last of Us and talk about Walking Dead a lot Gone Home and all that and it's like yeah those are for the games I've played of that those are definitely emotional experiences but for me like the most emotion I've",
            "start": 3689.96
        },
        {
            "text": "talk about Walking Dead a lot Gone Home and all that and it's like yeah those are for the games I've played of that those are definitely emotional experiences but for me like the most emotion I've ever felt during a game I would say is Yoshi's Island first game I ever beat that was an emotional moment yeah but the the final boss fight in that I remember it being so epic and feeling so grand and uh just like it was different than the rest of the game and like Baby Bowser is giant he's like in the the the **** like way way out there and like the Super Nintendo's using some effect that like I hadn't seen before and I was like what the **** is going on I remember being overwhelmed with like it felt epic the emotion of just like holy **** this is intense and um it was just a **** Yoshi game you know um and with Pokemon playing through anytime there was a choice that you had to make that would affect stuff that you couldn't go back and change choosing your starting Pokemon choosing",
            "start": 3732.84
        },
        {
            "text": "game you know um and with Pokémon playing through anytime there was a choice that you had to make that would affect stuff that you couldn't go back and change choosing your starting Pokémon choosing which Evolution Eevee turns into um where are you going to use the Master Ball Pokémon felt like it was my life it felt like just as important to me as going to school and getting good grades to get into a better school to get a job you know what I mean like every single choice felt like it had so much uh resonance in my in my entire life because all my friends were talking about the same things all my friends were making the same decisions and we had to make sure that all of our decisions kind of correlated so we can trade each other and and you know do all that type of stuff and like that that was definitely an emotional thing where it just took over I've made a couple other notes um Metal Gear there's so many moments sure um I think the The Sniper Wolf in Metal Gear Solid that's what I",
            "start": 3780.0
        },
        {
            "text": "that was definitely an emotional thing where it just took over I've made a couple other notes um Metal Gear there's so many moments sure um I think the The Sniper Wolf in Metal Gear Solid that's what I always talk about when it goes back to me you know I talk about Metal Gear being a turning point in my life in terms of what I I when I figured out what video games could be or where they were going kind of thing and yeah I always go back to that you know it's me and P.O. in my basement playing that on a summer night right and it's like two teenagers sitting there and we're just like totally enraptured as like she's saying goodbye and a comes up crying and like we're both trying not to get choked up while we watch this probably me as you know I cry yeah I mean but uh that moment was it definitely hit me and then Metal Gear Solid 3 I think the entire end most of the plot of that game but uh the most emotional moment in video games ever for me Metal Gear Solid 4 the microwave microwave holy",
            "start": 3821.84
        },
        {
            "text": "hit me and then Metal Gear Solid 3 I think the entire end most of the plot of that game but uh the most emotional moment in video games ever for me Metal Gear Solid 4 the microwave microwave holy **** and I mean the reason it was is because they treated it like a movie there's the multiple aspects going on the music swelling everything was edited and cut perfectly like that wasn't so much gameplay as much as it was an interactive experience but like they **** they played with my emotions so much and they I felt exactly what they wanted me to feel and that was four games of build up to that moment and that game specifically every single thing you did led to that and like it was overwhelming you know I remember after it stopped I wanted to save and just redo it again just to be like holy **** like show people you know that's the best when you're playing something you know this is awesome you know this moment is awesome you can't believe it's happening you know what I mean for me",
            "start": 3858.16
        },
        {
            "text": "**** like show people you know that's the best when you're playing something you know this is awesome you know this moment is awesome you can't believe it's happening you know what I mean for me like those awe-struck moments right there's always one in the Batman games from from Rocksteady right when you're going when I remember when uh I remember when and then I immediately go wait which one was it I believe it was yeah the original Arkham Asylum when I was playing that for review right and you get dosed with Scarecrow gas right and you turn the corner and you are young Bruce Wayne and you're like walking down the hallway and your parents are there dead at the thing and it was like whole like it was just like I didn't not knowing anything about Rocksteady and what they were going to do you I for sure wasn't expecting that you know what I mean and then you get there and that happens and you're like what what a **** amazing moment and then even in Arkham City there's moments like",
            "start": 3906.76
        },
        {
            "text": "you I for sure wasn't expecting that you know what I mean and then you get there and that happens and you're like what what a **** amazing moment and then even in Arkham City there's moments like that and then Arkham Knight no spoilers you know there's still things where all of a sudden it's like like holy **** like I it it seemed like every time a new one came out they would lull you into that sense of yep it's it's Batman you're punching and reversing and this and gliding and then all of a sudden here's this crazy thing you didn't expect them to do and you sit there and you're like slack jaw watching or playing it you know what I mean the same thing even with Fallout again no spoilers but like there's this one quest I went on and I don't know if everybody gets it or what but like you it's like you know it's going to be this thing it's death defying mission and you suit up and you're going and you're going and you're marching you're marching and it's a part of the game that",
            "start": 3943.44
        },
        {
            "text": "you it's like you know it's going to be this thing it's death defying mission and you suit up and you're going and you're going and you're marching you're marching and it's a part of the game that looks like nothing else and you're just going and going going and it's just like as I'm doing I'm like this is **** awesome you know what I mean like this is not what I expected to happen in this game in this moment on this mission and then you like there's spoilery stuff all over there but yeah you know it's just cool no I mean something a moment like that for me was surprisingly in Twilight Princess like there's everyone talks about Ocarina of Time and Hyrule Field and all that stuff but for some reason Twilight Princess had that moment for me like kind of just I experienced it in Ocarina but then Twilight Princess just the the graphics like it felt so vast in a time where I already knew what vast meant in video games and I remember being on on a pony just running around and just",
            "start": 3977.8
        },
        {
            "text": "but then Twilight Princess just the the graphics like it felt so vast in a time where I already knew what vast meant in video games and I remember being on on a pony just running around and just being like holy **** this area is huge this is **** Hyrule this is the best Hyrule will ever get you know it's like it wasn't but that was the same thing with Ocarina of Time people always talk about Hyrule Field yeah but for me like the moment in the touchdown crazy moment of that is when you jump forward in time for the first time and you're you know Teen Link or whatever and you open that those doors and they had done such a great **** job of setting up what like the Town Square looked like and how lively and bright and vibrant and fun and light you know I mean light in terms of brightness and then light in terms of character and like emotion right and you open it up and it's **** mummies and it's destroyed **** and there's like like holy **** you know what I mean like I",
            "start": 4014.4
        },
        {
            "text": "and then light in terms of character and like emotion right and you open it up and it's **** mummies and it's destroyed **** and there's like like holy **** you know what I mean like I remember flipping out at how great that that distinct difference was you know what I mean that they totally you don't even when somebody's setting something up in a game and you don't even know it till you get there then like there's the flip you're like oh that's why this was like that yeah man uh but the the moment that I didn't expect from the game was in Twilight Princess the boss fight um I don't remember who what the fingers he's got his hands out like this his fingers are but it was like it was when you get the hook the dual hook shots and you're like **** Spider-Man and around and you're fighting this like giant not Dragon but like big bird thing and like it's going around there's four towers and you have to hook shot from the tower to tower and it's like I might even be remembering more",
            "start": 4056.56
        },
        {
            "text": "this like giant not Dragon but like big bird thing and like it's going around there's four towers and you have to hook shot from the tower to tower and it's like I might even be remembering more epic than it was but there's like **** like rainstorm happening and like and **** and I remember being like holy **** this is Zelda like I can't believe that this is in this game yeah um and I there's just overwhelming emotion with these moments that like I'll just never forget and you know Smash Bros. I have a million of them sure yeah well I mean that's the I always talk I've written about it it's arguably my most favorite or famous non-review from IGN is how Infamous affected me when I was going through my divorce or whatever right and why I'm so connected to that but like in Infamous One when you're playing right and you like you you probably did you ever play I forget and like Trish drops or whatever and there some other lady drops you have to make your choice of who you're",
            "start": 4093.12
        },
        {
            "text": "One when you're playing right and you like you you probably did you ever play I forget and like Trish drops or whatever and there some other lady drops you have to make your choice of who you're going to save right and like I'm playing through is the good guy or whatever and you run and you get the other person and turns out Trish is going to die regardless but like Trish's final words to you're like holy **** like this is so **** touching you know what I mean of like she's like this her dying words are tell me as good good Cole right that she wants me to go on and save people and I'm doing the right thing it's like **** that's awesome you know what I mean like what a great thing for this like weird open world superhero game we've gotten where I used to be a bike messenger I mean deaths are always one of those things where deaths are made to make you feel stuff you know and like when games do it it's either overly cheesy just like movies yeah or it just it **** hits right and",
            "start": 4132.0
        },
        {
            "text": "are always one of those things where deaths are made to make you feel stuff you know and like when games do it it's either overly cheesy just like movies yeah or it just it **** hits right and like the end of Final Fantasy X was one of the first times where there was like a big buildup to a I mean it's a death it's it's a weird death but it's a death and when Tidus **** like goes to hug Yuna and like disappears through her and like just jumps off the the ship like disappearing into like cuz he's a **** dream or whatever cuz that game's weird um I remember being like holy **** like video games are making me sad you know like I feel sad that these characters aren't going to be together and then Final Fantasy X-2 when the plot gets way convoluted and then there's like the same characters from a thousand years ago whatever and there's like a flashback of them **** standing with their lover getting shot down by these armies I was like holy **** like this is **** crazy yeah",
            "start": 4164.36
        },
        {
            "text": "from a thousand years ago whatever and there's like a flashback of them **** standing with their lover getting shot down by these armies I was like holy **** like this is **** crazy yeah yeah but that's Final Fantasy um Portal Portal was one that made me feel very uneasy really yeah like playing through the game I love I mean I love that game so much uh but when you're playing I didn't know that towards the end of the game you like leave the beautiful looking stuff and go go behind the walls Behind the Walls and all that stuff and that for some reason it hit me in a in a very creepy way where I was like it felt like a horror game to me at that point and like it scared me more than most horror games do interesting um no yeah Portal for me I thought you're going to go the opposite way and be like you know the humorous the funniness you know I mean bring how much that brings out you because I remember like with Portal One even like laughing at GLaDOS and da da da but then Portal",
            "start": 4205.84
        },
        {
            "text": "and be like you know the humorous the funniness you know I mean bring how much that brings out you because I remember like with Portal One even like laughing at GLaDOS and da da da but then Portal Two especially with Wheatley once you get them involved and how genius the humor is in that right where if you sit there and like Wheatley keeps talking to you and he just wants you to say apple or whatever and he keeps like doing it and like if you just let him go Stephen Merchant just goes and goes and goes stuff right and like those are games I sit there and think about like yeah having fun with in terms of laughing you know what I mean like moments we remember in terms of emotions or whatever it's you know stirring up there having a good time at that point yeah man emotions are crazy emotions are crazy to Gettys **** fear the like I there's nothing that scared me as much as being at Kevin's **** uncle house then playing period end the end the sentence there playing Resident Evil for the",
            "start": 4252.6
        },
        {
            "text": "crazy to Gettys **** fear the like I there's nothing that scared me as much as being at Kevin's **** uncle house then playing period end the end the sentence there playing Resident Evil for the first time and the **** dogs just like even in the no no no no not even through the **** glass I'm talking about just the **** dogs in the intro like that like zombie dogs yeah period I was a little kid and that was scary as **** and then the first zombie that turns around like that iconic first shot oh my God that's nightmares see it's similar to me like the or similar to you like talk emotions like how I when I first went in I gone home we talk about all the time and how you know I went hug Christine afterwards and D but when I start Gone Home right like I had specifically or on purpose been told by friends to stay away and not read anything about it it's just awesome go play it and so you start that game and I was convinced it was a horror game you know what I mean knowing",
            "start": 4286.44
        },
        {
            "text": "purpose been told by friends to stay away and not read anything about it it's just awesome go play it and so you start that game and I was convinced it was a horror game you know what I mean knowing nothing about that I'm in this creepy house everybody's disappeared exactly and like I like you keep finding books about like ghosts and satanic satanic stuff and stuff and so I kept doing the thing of like like what did I hear like turn around like look around and then I like I'd go side there'd be a doorway and I'd come up to the side of it and peek my head back around and keep going cuz I'm like I'm going to I'm going to trigger this go somehow where is it going to pop up da you know what I mean and it doesn't happen and then that I'll that game's so special knowing nothing about it going in because I go from that to being like this story line's cool but I gotta be worried about go well what's happening this wait this go I'm like wait a second is the second is what I thought the subplot",
            "start": 4323.8
        },
        {
            "text": "because I go from that to being like this story line's cool but I gotta be worried about go well what's happening this wait this go I'm like wait a second is the second is what I thought the subplot of the game the plot of the game like what the **** that's **** cool Braid's another one for me like in terms of like going into it thinking one thing and like my God that **** you saw the Soldier Boy video and you're like oh I just rewind time with this kid great exactly um and a weird one for me Star Fox 64 the when you beat it on hard you get the special ending and then Fox's dad comes back and like I was like oh my God and I take the the story of Star Fox way too seriously good for I was always super into it and thought it was **** really cool and I loved the cast the characters and I thought they created such a good world um even like specifically 64 yeah um of just like depending on which path you go different different people come and just for one level they'll be with you and",
            "start": 4357.68
        },
        {
            "text": "thought they created such a good world um even like specifically 64 yeah um of just like depending on which path you go different different people come and just for one level they'll be with you and it's like oh this is Fox's friend from college or oh this is Falco's old girlfriend like all this **** I'm like that's **** cool I like I want to know more about these characters you like Star Fox universe you know what's Bill the Bulldog doing like come on I want to know more hopefully Star Fox Zero will explain all of that sure I think about emotional games that I'm connected to I think always about uh wrestling games and I've told my wrestling stories of chasing him down but like the one that I don't talk about too much right is just like I get to Mizzou I'm a freshman there I know no one not a single person on that campus other than like my roommate who I met over the phone you know what I mean and on that that first week of classes I left the my dorm room turned the corner and as I",
            "start": 4398.04
        },
        {
            "text": "not a single person on that campus other than like my roommate who I met over the phone you know what I mean and on that that first week of classes I left the my dorm room turned the corner and as I was going I heard the SmackDown menu music for SmackDown on PS1 and like I went back and I'm like looking door to door and finally I looked in and saw who would go on to be one of my best friends at Mizzou John playing it I was like you play you play SmackDown and I'm like some crazy guy in my backpack with blue hair and a Hawaiian shirt you play SmackDown and he's like yeah I'm like I'm coming back and playing SmackDown with you tonight like that was the thing you know what I mean like that like moved out huh and then he moved out I came back that day and he's just gone all his things are gone he was your best friend what about you Colin there's a lot I mean I I think I mean Journey is the most the most emotional game I've ever played um and it's a game I refuse to play again um because of",
            "start": 4435.2
        },
        {
            "text": "he was your best friend what about you Colin there's a lot I mean I I think I mean Journey is the most the most emotional game I've ever played um and it's a game I refuse to play again um because of that I mean it game made me cry and I have no idea why still have no idea why um there was just something about that game that was it's like really one of the great games scares there's something very there's something there's something very **** up about that game like I it crafted to make you feel that way yeah like I have no idea what like it was really and I know I I can appreciate even though Jenova Chen doesn't really talk a lot about it we've talked to them about I can appreciate the crushing weight that they're under to deliver after that because they're not going to be able to deliver a game like that again it's just that I mean I hope that they are because that then they really are very very very special developer but um Journey is like a once in a-lifetime kind of game I think uh",
            "start": 4469.4
        },
        {
            "text": "a game like that again it's just that I mean I hope that they are because that then they really are very very very special developer but um Journey is like a once in a-lifetime kind of game I think uh I mean to give him credit though Flower like Flower I would put on my list of like most emotional games Flower's emotional but it also has a a more overt story Journey I don't know this it's I don't know I don't know I just remember like crying when I was playing it and I like at the end it's just like a whole thing um yeah I think uh Final Fantasy IV is definitely one of or four is one of the most emotional uh games uh when the twins kill themselves to save you is like a really um although you know that's you'll find out more later but at that time you think that they commit suicide and and uh to save the team and it's like super you know the beauty of those games of those 16-bit games is that they didn't have any presentational excuses they the writing had to be good the music had to",
            "start": 4507.28
        },
        {
            "text": "to save the team and it's like super you know the beauty of those games of those 16-bit games is that they didn't have any presentational excuses they the writing had to be good the music had to be on point it's just Sprites and I remember like the music stops and they like they cast stone on themselves to stop these walls from going in uh like to crush the the party and they're just stand and like they turn into stone and the walls stop and the entire party is just sitting there being like what the **** these like 10-year-old kids just killed themselves in front of us you know and it's it's uh Porom and Palom are like some of my favorite characters of all time and I've always wanted to get a white and a black cat named Porom and Palom um because they're white and black mages um and that was a really super emotional scene and Final Fantasy IV when you really think about that game is actually really sad it's probably the saddest Final Fantasy game um by far I think there's a lot of death and",
            "start": 4551.24
        },
        {
            "text": "really super emotional scene and Final Fantasy IV when you really think about that game is actually really sad it's probably the saddest Final Fantasy game um by far I think there's a lot of death and **** up **** in that game there's you you start the game out committing an act of terrorism like and you have no choice but to do it and um that's what that's like what sets you know uh Cecil and Kain on this like this this you know they go to this they go to this village to deliver a package I don't know if you guys you people out there know they go to this village to deliver a package the package being this huge bomb that destroys this entire city just like Infamous and uh you know it it and like they're doing all these things in the name of the King they're like both officers in this in this army and and they're both like we don't want to do this anymore like what are we doing and and you know the game and then you know you meet Tellah you",
            "start": 4586.04
        },
        {
            "text": "the King they're like both officers in this in this army and and they're both like we don't want to do this anymore like what are we doing and and you know the game and then you know you meet Tellah you know which is he's an old Mage it's just it the the game's like a really emotional kind of roller coaster and I think the same thing with Final Fantasy VI it's there's the overtones of love in Final Fantasy VI I think are really cool with Locke and Celes um I the Opera House scene which is one of the most famous scenes in any Final Fantasy game by far um where you watch uh you watch Locke try to like fake seduce Celes to trick Setzer into coming and kidnapping her but he's really like falling in love with her and again it's like the sprites it's all Sprites and like the music is just right and the writing is just right and and the localization is just right and in a way that you know and then the entire world ends in Final Fantasy VI and that's like another really",
            "start": 4621.56
        },
        {
            "text": "music is just right and the writing is just right and and the localization is just right and in a way that you know and then the entire world ends in Final Fantasy VI and that's like another really cool thing like where the world just is destroyed this like me it's it's a very the the way that Emperor Gestahl and Kefka deal with each other is a very Emperor and Darth Vader way where like Kefka is not the main bad guy or the guy with any power until later Gestahl is the one who's like has this out of control like thirst for Magitek and and like these Espers and like empowering the human race and and they have this whole city dedicated to it and um and it's not until later that Kefka like you know basically like flips a script on him and becomes the bad guy and that's why I I Kefka is like my favorite bad guy of all time in any video game because he's just like he's insane and he has no real M.O. like which is why it's it's so like he's so unsettling it's the same reason why I think people find",
            "start": 4660.44
        },
        {
            "text": "bad guy of all time in any video game because he's just like he's insane and he has no real M.O. like which is why it's it's so like he's so unsettling it's the same reason why I think people find the Joker unsettling because it's and maybe why Kefka is a crazy clown like that's what he is he's a court jester and uh you know watching the world end and and being on the Floating Continent and Shadow might die on the Floating Continent and you have to wait for him to come back like you can leave without him and he dies um so there's like a lot of really cool stuff in there there's a lot of undertones about who Relm's father is and is Shadow Relm's father and like if you sleep it ends with Shadow in your party you have like a one 100 chance of seeing these random ass dream sequences that tell these **** up stories and like there's just so much that game is **** awesome I mean like Final Fantasy VI is like so superior to most other role-playing games and just the way it tells its story it's",
            "start": 4699.56
        },
        {
            "text": "fucked up stories and like there's just so much that game is fucking awesome I mean like Final Fantasy VI is like so superior to most other role-playing games and just the way it tells its story it's it's like a it's it's an art form I would love to see them remake that instead of Seven um and then uh Wild Arms is like really it's one of my favorite games and that game is really sad when you find out you know it's you I'm sorry I'm going to spoil it's 19 years old uh uh when you find out Rudy who's the main character is not even human um it's like super fucking weird weird and sad and transcendent moment in that game uh in terms of like humor and stuff I I I I I don't think I ever knew a game could make me laugh like South Park: The Stick of Truth uh made me laugh and and the way I connected with that game was that's really one of the great games I think of last generation when you really think about it totally um because of how fucking just ridiculous it was uh I didn't know a game could",
            "start": 4737.52
        },
        {
            "text": "with that game was that's really one of the great games I think of last generation when you really think about it totally um because of how fucking just ridiculous it was uh I didn't know a game could do that I didn't I knew a game could make you feel feelings but I didn't know a game can make you really like hysterically laugh at it and like all the like the the scene when the guy they're like fucking each other and like but you're like walking aren't you like a you're like ant-size and like your dad's balls are swinging in and fucking your mom it's so there's like so many and I'm like this is so fucking awesome what a fantastic game that game was so good and so funny and Alano and I were playing it the exact same time and so I would just text him I'm like have you gotten here like oh my and I I've never laughed like this you know what I mean I've never played a game and had this much fun with it in terms of like mystery um and the feelings of of just imminent doom I think nothing beats",
            "start": 4774.52
        },
        {
            "text": "I I've never laughed like this you know what I mean I've never played a game and had this much fun with it in terms of like mystery um and the feelings of of just imminent doom I think nothing beats BioShock which is why I think that game is really special um Rapture is just a character in and of itself and uh that game made me feel a lot of weird emotions in terms of like just a foreboding which I don't think a lot of games like Resident Evil does like horror games do that but it's because you expect the next jump scare or something like that like you didn't really know what you were scared of in BioShock you had no fucking idea like it's really unsettling when you run into a Big Daddy for the first time and he has no interest in you and you're like what the hell is this yeah and the first time yeah and then the first time and you just stand there and he just walks around you and you and like you just and you're like should I attack and you attack and then he just totally fucking like",
            "start": 4815.04
        },
        {
            "text": "time yeah and then the first time and you just stand there and he just walks around you and you and like you just and you're like should I attack and you attack and then he just totally fucking like loses his mind you know um these little girls like running around like going in and out of these tubes like and then it's like what the fuck is going on here BioShock is that's why I was so disappointed in Infinite because I was like it kind of lost the feeling of that I mean it's hard to replicate that but um so there's that and I think Dead Space is another one of those games that gave me like this really this feeling of mystery and foreboding I think that game is supremely special I think that might be a claustrophobic thing too yeah and I think that might be the best survival horror game of all time um when you really really really sit and think about that game I mean a lot of people love Resident Evil 4 and and I appreciate that you know um but there's something about Dead Space One where",
            "start": 4856.68
        },
        {
            "text": "all time um when you really really really sit and think about that game I mean a lot of people love Resident Evil 4 and and I appreciate that you know um but there's something about Dead Space One where like this is a really really really really special game so those are the ones that come to mind for me Dead Space One for survival horror versus Resident Evil 4 right is just the different of your protagonist I think like right Leon Kennedy is a badass he's been sent in to save this girl that's the thing Isaac Clarke is an engineer and he is desperately trying to get off this thing or at least yeah can right there or desperately get off this thing or just find his girlfriend you know what I mean like it's awesome well final topic of the day as always brought to you by the Kinda Funny Forums go over to games.kindafunny.com/gamescasttopic to submit your topic for the show just like Innocence did hey guys this might be quick but oh what the hell my topic suggestion is Valve and Half-Life 3",
            "start": 4888.76
        },
        {
            "text": "over to games.kindafunny.com/gamescasttopic to submit your topic for the show just like Innocence did hey guys this might be quick but oh what the hell my topic suggestion is Valve and Half-Life 3 will they ever release it it may seem obvious to some but in reality Valve doesn't have to thank you and keep up the great work I think they will but I agree that they I agree that they won't have to and I always I've said it before I always love Charles Anette's idea that that they'll just release it when it's done um they won't no lead-up no nothing just serious and I would be I would love if they did it where they didn't even say anything like just they just uploaded there's nothing ever said resp emails one of the most epic things in Humanity's history Life 3 just fucking came out now to the credit of his part of this question is where like they don't have to it's true they don't have to and in fact they have more to lose by doing it than than gain to gain because the the",
            "start": 4928.48
        },
        {
            "text": "out now to the credit of his part of this question is where like they don't have to it's true they don't have to and in fact they have more to lose by doing it than than gain to gain because the the the fact remains that Half-Life is a really beloved franchise but it is not Grand Theft Auto or something like where there's not a financial imperative for them to do this they might hurt themselves not financially because they have so much money from Steam but they might hurt the creative like if Half-Life 3 isn't good or not as good as people expect it then they then if it isn't fucking life-changing fantastic yeah and that's the problem it's it's Duke Nukem Forever It's The Last Guardian it's the it's been cooking for so long and it's more than those I think sure but I'm I mean to give you a touchstone of like it's been going for so long expectation and hype is to such a fever pitch without anything you can't yeah you can't do it you can't it can't come out and not be amazing yeah so I",
            "start": 4969.48
        },
        {
            "text": "a touchstone of like it's been going for so long expectation and hype is to such a fever pitch without anything you can't yeah you can't do it you can't it can't come out and not be amazing yeah so I think that's I think that's definitely the the the problem yeah for them is I don't know it's the same it's what I said about The Last Guardian would would have you know I don't know in what uh state of readiness it was on on PS3 when when Clement played it a long time ago when he went to see NGP um in uh in Tokyo so this was in 2010 maybe 2011 I don't know like what state it was in at that point but would Sony have gained more financially and critically if they just release a 6.0 then release this game now that cannot no matter how good it is will never live up to the hype like The Last Guardian has to be one of the best games of all time to live up to the hype that it's behind it and I think that's one of the problems of they must see something in the game they've dumped a lot of money",
            "start": 5008.08
        },
        {
            "text": "has to be one of the best games of all time to live up to the hype that it's behind it and I think that's one of the problems of they must see something in the game they've dumped a lot of money into it it's going to sell well but if I were there I would have definitely considered canceling it so it's and I'm sure they did consider that um so it's a similar conundrum where the game you know no matter how good Half-Life 3 is it's not going to be as good as people want it to be which is the you know which is a credit to Half-Life 2 but also uh a problem for a company like Valve that has no financial imperative to make a game ever again and um they can just make their money passively on Steam and be fine do you think we'll see it before 2020 yeah I do Half-Life 3 before 2020 I think it's in development right now I think it has been for several years yeah why not MH if it's not before 2020 they might as well not even release it yeah because at that point at that point it's been 13",
            "start": 5051.28
        },
        {
            "text": "in development right now I think it has been for several years yeah why not MH if it's not before 2020 they might as well not even release it yeah because at that point at that point it's been 13 or 14 years or something like that yeah like why even bother at that point yeah you they're almost at the point I was like why even bother now yeah I mean I feel like it pretty much is at that point like in terms of at least you know getting new people on or whatever it's just don't do what or do it cool Borden says how much do you guys think streaming support or the lack of could the scales of VR reality really catching on streaming games or streaming movies I think I think what he's talking about is being it there's no way to stream VR like with Twitch and YouTube and all that stuff but that's the thing now hold on isn't there the whole the PlayStation VR's thing is that you can you can have it displayed on a TV while you play it and it isn't I mean it is Oculus right when you look at an",
            "start": 5090.04
        },
        {
            "text": "the thing now hold on isn't there the whole the PlayStation VR's thing is that you can you can have it displayed on a TV while you play it and it isn't I mean it is Oculus right when you look at an Oculus thing it's the thing where it's got the two windows right that are like in your life covered up and to make one giant thing but there it looks all fucked up PlayStation says that it's going to be that so if it's like that then I mean what you wouldn't be able to read the chat but you'd be able to have it on and talk and then have if it was if I'm playing a game and Colin's next to me he can watch what's happening read the chat be part of it yeah I mean I I think that uh the whole you Twitch is definitely a benefit to games but I don't think it's like a game changer I don't think it's going to like screw everything but VR stuff I think Twitch does help for specific types of games I think VR experiences or games that we see might be those games that that's a great point I actually I",
            "start": 5134.52
        },
        {
            "text": "to like screw everything but VR stuff I think Twitch does help for specific types of games I think VR experiences or games that we see might be those games that that's a great point I actually I had not actually thought about what it's going to be like with VR on Twitch and like we always talk about trying to overcome people's uh ignorance of it how do you get people to do it you have to you have to be using it to understand it but if it if you can do it where yeah you're on green and you're moving your head and it's moving with you granted it's another huge fuck let's see how latent it is and let's see you know there's any lag or anything like that but that could be actually a really interesting way to showcase those games MH Billwood Marble says my question is regarding local multiplayer my love for video gaming stems from the memories I have my friends and I sitting on the TV playing split screen GoldenEye Mario Kart all that stuff till today the majority of my gaming",
            "start": 5172.76
        },
        {
            "text": "multiplayer my love for video gaming stems from the memories I have my friends and I sitting on the TV playing split screen GoldenEye Mario Kart all that stuff till today the majority of my gaming takes place over split screen Rocket League or party games such as Fibbage you guys know Fibbage is yeah Fibbage is awesome don't know what Fibbage is it's like a little game show game you're playing there it's a game where like it'll ask you a question then you have to make a fake answer to the question then the people have to pick which answer they think is should play that it's a great game that sounds good I last played it on Xbox One with our friend Nate however it's becoming increasingly difficult to find games that are that offer local multiplayer outside of the Wii U and the exclusion of split screen in Halo Guardians increases my concerns what are your thoughts on this and do you feel is the local multiplayer is on its way out completely I mean I feel yeah it's like it's already",
            "start": 5209.24
        },
        {
            "text": "of split screen in Halo Guardians increases my concerns what are your thoughts on this and do you feel is the local multiplayer is on its way out completely I mean I feel yeah it's like it's already out but there will always be people that like Rocket League is a perfect example they understand the importance of that and that's what that game was designed to do right so I think I think I feel like since I've been in the industry it's been on its way out that's all you ever I mean it's just as the machines get more and more powerful the harder and harder it is to do this to render the game twice to make it look as good to deliver the experience you want well in addition to that with with online going from this like kind of niche thing that's just kind of a gimmick to being the way people play games split screen is you know on its way out I remember when the first time that I was upset by a game not having split screen was Counter-Strike on the Xbox yeah it came and I was just like well",
            "start": 5244.4
        },
        {
            "text": "games split screen is you know on its way out I remember when the first time that I was upset by a game not having split screen was Counter-Strike on the Xbox yeah it came and I was just like well I'm fucked I love playing Halo split screen but I'm not going to fucking play this shit online I just want to play with my friends and I couldn't so that stop me from playing that game entirely and now with Halo 5 I mean it sucks like it is definitely like when my friend's birthday comes up uh around Thanksgiving we're playing all weekend we're not going to be playing Halo 5 because it's not split screen we'll play Master Chief Collection just for fun you know so I mean it's their technical limit I mean people have to remember that it's really hard to make a game run twice or four times these days because they're so they're so intense these games are so intensive and they push the units so hard um but people also have to remember that in the in the in the day and age of connected video games",
            "start": 5280.6
        },
        {
            "text": "because they're so they're so intense these games are so intensive and they push the units so hard um but people also have to remember that in the in the in the day and age of connected video games even if you're playing single player like on PlayStation Network um developers and are collecting data about the way you play games and they they they have heat maps of the way where you go in maps they have like all sorts of things very minute depending on the way they've calibrated their game to be able to see like do people like this weapon do does anyone go in this corner on this fucking map at all does anyone find this collectible like they know they have very detailed statistics and I'm telling you that they looked at their stats and they're like no one cares about couch co-op you know like like they if if it was important to to the to if they looked at Halo and they're like this is actually important to lots of Halo gamers then it would be in there they would have figured it out but",
            "start": 5321.2
        },
        {
            "text": "like they if if it was important to to the to if they looked at Halo and they're like this is actually important to lots of Halo gamers then it would be in there they would have figured it out but they they don't they don't do that because they know that it's not important anymore so like the people even in addition to that though it's not that it's not important to a lot of people it's just the fact that like there's they also want to control the narrative they want more people playing online so by not having the split screen why do they care if the people play online though like why why does the developer care like how you play the game if if if if people if they looked at Halo and and we're like 90% of people play Halo couch co-op like they're not going to cut it out they probably that they like less than 5% of the people that buy Halo play couch co-op so why would we even bother you know like I don't Microsoft and Sony have every intention of making you play online so you pay $60 a",
            "start": 5357.4
        },
        {
            "text": "like less than 5% of the people that buy Halo play couch co-op so why would we even bother you know like I don't Microsoft and Sony have every intention of making you play online so you pay $60 a year for that but the publishers I don't think in fact it's cheaper for the developers for you not to play the game online so it's so I don't agree with that I think that they're looking at very detailed statistics on everyone that's putting these games into their machines and and finding out that this is not important like it might be important to some of the people that write into this or people on you know something's important to everyone yeah you know what I mean like something missing out of a game is going to important to literally every single person but they have to make choices remember it goes both ways I always tell the story right that you know they went out of their way the Lego guys to make sure that Lego Star Wars when it came to 360 right I'm getting all this right when it",
            "start": 5393.28
        },
        {
            "text": "it goes both ways I always tell the story right that you know they went out of their way the Lego guys to make sure that Lego Star Wars when it came to 360 right I'm getting all this right when it made the jump or whatever at the time and they put out the one collected edition of all of them they put online in there for like the first time ever in Lego and no one fucking used it and so no Lego game again has ever had online co-op because it just well why put money into servers this that and the other to do it it's the same thing and that's what you're talking about like I think the ref the places he's referencing you know he's talking about Rocket League you know we about games like Chariot these indie games that are easier to play games together with couch co-op Diablo right like those are developers saying it's not only if you're starting from not scratch I guess but if you're starting from a game where you're going to get big like Rocket League you know your game works that way and it's",
            "start": 5425.84
        },
        {
            "text": "developers saying it's not only if you're starting from not scratch I guess but if you're starting from a game where you're going to get big like Rocket League you know your game works that way and it's it it works well that way it's fun to play those games that way you know what I mean like that's the whole thing I hate that's the funny thing is I love local co-op like I love playing with Chin and I hate split screen so just suck it up and get another TV and put them side by side admit you're a nerd so many other XOX and another copy of Halo you should have all those things already if you're if you're a true fan no I mean I understand where it's coming from it sucks if people are into those things it's just that like that's a dying me that's a dying way to play games it's just not it's not going to be that way anymore there's always going to be local co-op games but you talk about Chariot or something like that like this is a very easy to render sidescroller that even if you play it",
            "start": 5458.72
        },
        {
            "text": "going to be that way anymore there's always going to be local co-op games but you talk about Chariot or something like that like this is a very easy to render sidescroller that even if you play it co-op like it's just another Sprite on the screen it's not games because so many of them are like that yeah and and Rocket League just rendering a soccer field four times so it's not like it's it's you know it's just way like running Halo 5 is probably really complicated to run it twice you want Halo not having split screen co-op is not Halo you know but sure but you have to ask yourself if like 343 and back in the day Bungie were looking at statistics and and realizing that these things were going to die like that like they're keeping these into play a certain amount of people and when you're making a game you know when you're a producer of a game you have producers live in spreadsheets they live in in fucking you know calendars and like they have resources that need to",
            "start": 5494.0
        },
        {
            "text": "and when you're making a game you know when you're a producer of a game you have producers live in spreadsheets they live in in fucking you know calendars and like they have resources that need to be allocated to these certain things that need to be hit at these certain checkpoints and if you really see like and I I don't know the numbers but if you see 5% of the people that play Halo 4 use couch co-op then it's like no we're cutting it there's no reason to have that in the game anymore because we're only going to annoy one in 100 people that play the game MH and we might even sell more copies like that there's there's also a financial imperative too so I just you're really actually if if you assume 5% of the people that put the the game into the system are playing you know couch co-op than than that you're actually affecting two and a half% of the people that actually bought your game so it's like so the numbers are even are even smaller so I don't know I don't I'm just assuming that",
            "start": 5529.68
        },
        {
            "text": "than that you're actually affecting two and a half% of the people that actually bought your game so it's like so the numbers are even are even smaller so I don't know I don't I'm just assuming that they're looking at fucking like just like any developer does just like they did with Lego where they were like well why would we put online in this I think it makes sense it's it's it's the same reason I think why when they released the Uncharted Collection on PS4 they were like yeah Uncharted is popular online but and Bluepoint can probably manipulate these and put servers up and stuff like that but why like x amount of people played it yeah you know they're you don't play Uncharted to play online MH George Love says hello Lads I was wondering what location and time period you'd like to used in an open world game is there any city or country or a particular point in history that you would think would be particularly interesting to explore and what aspects of that time and or place would you like",
            "start": 5568.32
        },
        {
            "text": "world game is there any city or country or a particular point in history that you would think would be particularly interesting to explore and what aspects of that time and or place would you like to see included thought this one was really interesting for you I mean I the reason I wanted to play Assassin's Creed III so badly was because of it's like the setting and the time period were fucking perfect and the and the way the way it was the way it looked was just so good um it's just that it was an Assassin's Creed game so it wasn't fun you know that's that's a that's that's a problem so I always wanted a real time or not a real time a turn-based almost cartoonish economic and strategy game based in the revolution um so like a Final Fantasy Tactics style game um in the American Revolution I think would be fucking awesome but I mean that's that's I I even had like ideas and little designs drawn down about it being a 3D or it was back in the DS game um but that would be like I just",
            "start": 5604.24
        },
        {
            "text": "I think would be fucking awesome but I mean that's that's I I even had like ideas and little designs drawn down about it being a 3D or it was back in the DS game um but that would be like I just like that time period I don't think it's of see we we don't explore complicated time periods like that in traditional genres like shooters is because you can't play a shooter in in Revolutionary War because it take you know even the best minute man had you know needed 45 seconds to fucking load his musket and shoot it so that's not fun World War I isn't really fun to explore in that because it's it's it's fucking trench warfare and the and the front line moved like 1 miles in five years I mean who cares you know it's it's so it's we need to figure out new and clever genres and new ways to attack these different these different things and I think Assassin's Creed was the one that could have done it the best but they just you know uh Kirk Hamilton at Kotaku wrote a great story last week about",
            "start": 5646.92
        },
        {
            "text": "these different these different things and I think Assassin's Creed was the one that could have done it the best but they just you know uh Kirk Hamilton at Kotaku wrote a great story last week about Assassin's Creed where where his basic line was like why isn't this fun like in terms of like why like when are they going to get that the game doesn't control right when are they going to figure that out when it stop selling you know well I think this might be the year you know so it's it's number one downloaded PlayStation game for October I mean we'll see you know I I think that this is a matter of buzz versus sales versus economic reality again you know um but it was nice to see someone else echo what I've been saying for years about that series which was like it's just not everything about it so great so why can't it play like it looks Mmm you know like why can't it play like Infamous I've always wanted to see an open world thing in San Francisco specifically because I'm from here",
            "start": 5683.72
        },
        {
            "text": "about it so great so why can't it play like it looks Mmm you know like why can't it play like Infamous I've always wanted to see an open world thing in San Francisco specifically because I'm from here and I'm very familiar with the Driver San Francisco so but so here's the thing there's been a ton of maps and levels and experiences that have been in SF but none of them have ever really matched where I want them to be there's been levels in Tony Hawk that I feel like got closer than any like San Andreas had uh San Francisco but like it didn't feel right and also that was last last gen so it just you know wasn't up to to speed for what uh GTA 5 did for LA I would love to see that for San Francisco um and actually have the districts and see how it all works together and stuff and what I would really like gameplay wise so Mark Ecko's Getting Up I don't know if you guys are familiar it was a graffiti game on the PS2 great game excellent game chance of a sequel no way in fucking hell I asked",
            "start": 5718.76
        },
        {
            "text": "really like gameplay wise so Mark Ecko's Getting Up I don't know if you guys are familiar it was a graffiti game on the PS2 great game excellent game chance of a sequel no way in fucking hell I asked Mark Ecko himself nice job and uh he said no but um it was a really fun game it was about graffiti and it was about all this stuff and I think an open world graffiti game in San Francisco would be really cool cuz there's such a crazy graffiti subculture in the city and just once you start knowing about it like looking up and seeing all the buildings and seeing different pieces and being like how the fuck they get up there and like if there was like a online thing where there's a lot of different people playing and like having different crews and fuck like trying to take over the city I think it'd be fucking awesome why are you great I got nothing okay go to Chicago none enough games in Chicago watch Watch Dogs was close close but it wasn't enough get in there not this fake Wrigley-ass",
            "start": 5764.76
        },
        {
            "text": "think it'd be fucking awesome why are you great I got nothing okay go to Chicago none enough games in Chicago watch Watch Dogs was close close but it wasn't enough get in there not this fake Wrigley-ass fuck Tom Hawkins says Hey guys if you could pick any Fallout perk to have in real life what would it be the one that gave me more money every time I looked into a a bin yeah that's a really good one the one yeah barter get better prices on everything all the boring ones I don't want to actually kill people CBass6978 says Hey guys longtime viewer firsttime poster I'm curious in your thoughts on video game addiction do you think it's a real condition if so would you consider yourselves game addicts this came to mind because I recently had a fight with my girlfriend about my obsession with video games keep creating some of the best content on the internet best friend for life see obsession is a better way to put it addiction is a real thing it's a disease I think you can be addicted to",
            "start": 5804.2
        },
        {
            "text": "video games keep creating some of the best content on the internet best friend for life see obsession is a better way to put it addiction is a real thing it's a disease I think you can be addicted to anything so none of us at this table are addicted to video games now no yeah I mean that's that would be a real life-altering Ur like that fucks up everything being addicted to something obsessed I think is a better way we get obsessed with games all the time I mean I do I mean the definition video game addiction is a thing and I've seen people get addicted to video games and I've seen it affect their lives poorly being obsessed also affects your life but like I think that the addiction level is when that's when a professional needs to step you're letting your health get in the way you're fucking up your relationships like and I've I have a very close friend that like for a couple years was on a bad bad fucking path because of video games yeah and I'm happy that that's no longer the case sure",
            "start": 5849.84
        },
        {
            "text": "up your relationships like and I've I have a very close friend that like for a couple years was on a bad bad fucking path because of video games yeah and I'm happy that that's no longer the case sure yeah you can be addicted to anything I mean you can be addicted to relationships you can be addicted to obviously drugs alcohol you can be addicted to whatever but you be addicted to you can literally be addicted to food you can be addicted to anything so yeah you can be addicted to games of course um I never considered myself addicted to games I've been I've definitely had obsessive periods with them um my concern I mean the last game I obsessively played that came out was Mega Man 10 that was like the last game where I'm like everyone just shut the fuck up and go I don't care what anyone's saying I don't care about you uh I'm gonna play this game now and that was really the last time I ever like had a breakdown moment in my life where I'm like this is just has to be this way I would give so",
            "start": 5887.08
        },
        {
            "text": "I don't care about you uh I'm gonna play this game now and that was really the last time I ever like had a breakdown moment in my life where I'm like this is just has to be this way I would give so much to be able to just go back back and see your reaction when Mega Man 9 was announced yeah I ran around the IGN office I couldn't I I couldn't believe it uh but my concern now is that I'm I'm not is that like do I play games enough you know to to satiate myself I play games all the time but I'm like you know I wish I had more time to play them I wish I had more of a drive to play more um but I don't see I was talking to someone recently about like I have so many of these I have so many interests that I'm trying to balance that I'm trying to fit in fit in more that has nothing to do with games like I still really want to rekindle my you know playing hockey again and and you know do and I want to join a chess club and do all these other things like things that I really love like really",
            "start": 5919.96
        },
        {
            "text": "like I still really want to rekindle my you know playing hockey again and and you know do and I want to join a chess club and do all these other things like things that I really love like really really love and uh so you have to start cutting things out and so then you realize that like video games are one of those expendable things in your life that you have to um or at least you know in my I feel that way where if I can play 10 hours or I can play five hours and fit in five hours of other stuff I'd probably rather fit five hours of other stuff in um so it's it's all about balance you know it's okay to be it's okay to have a little addiction or obsession with a game or games whatever you just have to find that balance but that's different for every different for for different people I was there was a really fascinating NeoGAF thread I read some time ago like a couple months ago where people like how often do you play video games the question was like how many hours a week do you play",
            "start": 5962.44
        },
        {
            "text": "there was a really fascinating NeoGAF thread I read some time ago like a couple months ago where people like how often do you play video games the question was like how many hours a week do you play games and I read like the whole thing it was fascinating because it was like it spanned literally anywhere from like I don't play video games because I have a kid and fucking wife my life and or I have a job or I just don't care anymore you know like and then all like 50 hours a week yeah and like everyone in between and it seemed like and it made me feel good good because these are NeoGAF obviously attracts like hardcore dedicated game enthusiasts and it seemed like the the average was like 5 to 10 hours a week and I was like cool because I okay I play more than that and and I feel like I'm not playing enough so sure final question from the day comes from SweetAction1981 he says Hey guys what do you think of the Warcraft trailer and does it give you any hope for the future video game movies",
            "start": 5997.84
        },
        {
            "text": "enough so sure final question from the day comes from SweetAction1981 he says Hey guys what do you think of the Warcraft trailer and does it give you any hope for the future video game movies I personally really liked it and even more I liked the fact that they kept the CGI for the Orcs extremely close to that of the game cinematics I'm always hesitant to be excited for any video game movie announced but this seems pretty good and gives me hope for future game movies did you guys see the trailer yeah I did thought it was fine like I mean like the problem is you're jumping back to a topic earlier right like I'm just not the high fantasy guy so like I will not see that movie like I thought I thought just at a glance the CG didn't look that great yep but I thought the world and what the way they were acting was like oh this is like a legit movie at least this is you know what I mean for me I I'm not a Warcraft guy at all don't really know about the world there's worlds yeah uh don't don't",
            "start": 6036.08
        },
        {
            "text": "were acting was like oh this is like a legit movie at least this is you know what I mean for me I I'm not a Warcraft guy at all don't really know about the world there's worlds yeah uh don't don't know much about it I know you know basic shit and I know enough to watch the trailer and be like okay cool like this seems checks out on a yeah yeah back back of the shit game somewh um but like the reaction to it that I've read seems mixed but not as bad as it could be sure but I mean from just a pure movie standpoint this shit doesn't look good doesn't look good at all the CG looks bad you know and like everyone was saying that the CG and the the game trailer for Legion that they show looks way better and it does it looks way better yeah so so it's like uh I don't know I don't think that this is going to be the the huge hit that a Warcraft movie could have been at a different time I think people's expectations for these type of movies has changed and the ship has sailed for this",
            "start": 6074.24
        },
        {
            "text": "that this is going to be the the huge hit that a Warcraft movie could have been at a different time I think people's expectations for these type of movies has changed and the ship has sailed for this movie to hit that audience like I think it this would have been an amazing 2008 movie but do you think it hits a wider audience outside of it is this a movie that kids in high school are going to go out to see on Friday and have no idea that they're it's based on a video game or whatever I think it that it is ex that movie but it's not going to be that movie that those kids then tell their friends to watch you know which I think in 2008 it could have been okay but now that we have you know Iron Man and everything every fucking three months there's some movie of things that people actually care about see cool to care about gotta then it's like this is just like oh this is based off a video game like people want to like non-comic readers non-nerds want to go into superhero movies watch it",
            "start": 6114.12
        },
        {
            "text": "about see cool to care about gotta then it's like this is just like oh this is based off a video game like people want to like non-comic readers non-nerds want to go into superhero movies watch it and pretend they know more about superheroes than anyone else because it just it's cool you know superheroes are cool so oh yeah oh in the comics this happened it's like you've never read a fucking comic in your life you know this I don't think is going to have that same thing of oh well in the game you know this happens it's like we should go there and say stuff though in the game there's pandas and they're in the mist and they fight if the fucking pandas aren't in the Mist I'm going pissed yeah you have any thoughts on this did you watch it yeah we watched it I think on Colin & Greg Live I I barely pay attention to it I mean that that movie has bomb written all over it I think but but who knows I mean that that that series certainly has a lot of resonance with a lot of people over a long period",
            "start": 6156.24
        },
        {
            "text": "pay attention to it I mean that that movie has bomb written all over it I think but but who knows I mean that that that series certainly has a lot of resonance with a lot of people over a long period of time uh and different kinds of gamers too you know World of Warcraft and then just Warcraft so yeah it'll certainly draw people in but I don't I don't I don't understand this drive to make video games in the movies I just don't get it you know like why like it's the same reason we talked about The Last of Us movie where it's like I don't want that I don't want that at all it's okay for things to be games it doesn't mean that they're less legitimate you know does making a movie out of something doesn't legitimize it I don't know how many times you have to see these movies come out before we realize that this is maybe more destructive to games than than helpful you hope our industry is waking up to that that they don't have to chase that it seems like it's slowing down but then there are",
            "start": 6193.64
        },
        {
            "text": "realize that this is maybe more destructive to games than than helpful you hope our industry is waking up to that that they don't have to chase that it seems like it's slowing down but then there are like Uncharted pops up or whatever last like that was the argument I was having at IGN at the end there was just the fact that people like when's the what's the first video game movie that's going to matter and I kept saying The Last of Us and people would say Warcraft I'm like maybe I guess sure but like The Last of Us at least has Neil Druckmann in it you you would say Crazy Taxi yeah okay when's that fucking movie coming I don't I hope they it's just not all if it does come I hope it is just 90 minutes of just driving it's just driving around picking people take me to Pizza Hut taking a a priest a Pizza Hut yeah ladies and gentlemen that topic brought to you by DraftKings football season marches on and while your season long fantasy team might be going nowhere fast every week is a new shot for glory",
            "start": 6225.52
        },
        {
            "text": "Hut yeah ladies and gentlemen that topic brought to you by DraftKings football season marches on and while your season long fantasy team might be going nowhere fast every week is a new shot for glory at DraftKings.com. DraftKings is the destination for one-week Fantasy Football where you can relive the fantasy draft and play for huge prizes each and every week challenge your friends in a custom league or join an existing one to play for your share the billion dollars and prizes up for grabs this year this isn't fantasy as usual this is DraftKings welcome to the big times heard DraftKings.com now use promo code Kinda Funny to play for free with your first deposit in Sunday's million-dollar fantasy football contest first place takes home 100 Grand and a lifetime of bragging rights and you're Kinda Funny for free entry now only at DraftKings.com that's DraftKings.com thank you guys very much for joining thank you Greg you can go get back to Fallout now thank you very much I do have like",
            "start": 6262.44
        },
        {
            "text": "Kinda Funny for free entry now only at DraftKings.com that's DraftKings.com thank you guys very much for joining thank you Greg you can go get back to Fallout now thank you very much I do have like 40 minutes before we have to do this Q&A so you're you're stoked and I know thank you all for joining us again thank you all for supporting us on Patreon you're beautiful people that do beautiful things we see you next week",
            "start": 6302.12
        }
    ]
}