{
    "id": 1360,
    "video_id": "SSZ8lYRdBJ4",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "The Best Way To Get Arrested - The GameOverGreggy Show Ep. 102 (Pt. 4)",
    "description": "Tim Gettys explains what he would do if he could get out of being arrested.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1447920000,
    "duration": 785,
    "transcript_chunks": [
        {
            "text": "today's sponsor is Loot Crate for less than $0 a month. Loot Crate gives the geek in you a special treat every month. Loot Crate is a subscription box service with more than $40 worth of geek, gamer, and pop culture gear: Collectibles, apparel, Comics, etc., delivered to your mailbox every month. This month they're bringing you a fight for the ages. Suit up, choose your allies, and enter the arena for combat. They're ready to stand their ground this month with exclusive items from Blizzard, Fallout 4, Capcom, sponsor-worthy loot from The Hunger Games, as well as a few more items that will help their winners emerge victorious. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate, and when the cut off happens, that's it, Jack. It's over. So go to LootCrate.com/KindaFunny and enter the code Kinda Funny to save $3 on your new subscription today. What's your topic? I want my topic for the day is if you can get arrested for anything, mhm, but then kind of like have a",
            "start": 0.04
        },
        {
            "text": "enter the code Kinda Funny to save $3 on your new subscription today. What's your topic? I want my topic for the day is if you can get arrested for anything, mhm, but then kind of like have a get out of jail for you pass. So I can, you're you're unarrested. I can break a law, whatever law I want, yeah, and I get I get a pass. You get out. What would you do? I would kill Kevin. No, you would. I would. I would try. He might, he might, he might beat me, but it would be a cat and mouse game till the end, buddy. You you might beat you get out of jail free card. Yeah, that's what whoever wins gets the card. Oh yeah, whoever loses. We don't actually get the card, Kevin, but if we did, I would hunt you down like the Red Dragon, my friend. I would just glue you to a chair and roll you down a **** street on fire. You know what I mean? It's a very comp kill. It's great movie that actually happens in the movie and Manhunter. Little more Vis Manhunter. We're talking about Red Dragon, the the uh uh yeah yeah yeah, the remake",
            "start": 40.32
        },
        {
            "text": "what I mean. It's a very comp kill. It's great movie that actually happens in the movie and Manhunter. Little more Vis Manhunter. We're talking about Red Dragon, the the uh uh yeah yeah yeah, the remake of uh Manhunter. Well, yeah, the book was called Red Dragon. No, I thought man, I'm thinking of something different. I thought it's right. It's the same thing, man. I thought, wa wait, I thought Red Dragon was associated with Hannibal, right? Yeah, Manhunter was the original movie. They were going it was based on the book Red Dragon and they were going to call it Red Dragon, but for some reason they they called an audible at the end and exact same movie Manhunter. No, the only reason they called it Manhunter was because they thought Red Dragon had too many connotations for like Kung Fu or something like that. I saw Red Dragon in the theater. That's Red Dragon is a remake of Manhunter and it is a prequel to The Silence of the Lambs. I like Ed Norton anyway. Go ahead. Ed Norton is a good guy. He's a good stand up fellow.",
            "start": 100.04
        },
        {
            "text": "saw Red Dragon in the theater. That's Red Dragon is a remake of Manhunter and it is a prequel to The Silence of the Lambs. I like Ed Norton anyway. Go ahead. Ed Norton is a good guy. He's a good stand up fellow. Tim, I would uh probably do what most people would do and rob a bank for a **** ton of money. You get get out of jail free pass. Yeah, but they still take money. Can I get ruling on this? I know. I mean, that's you're the it's your topic. Get to keep the money. No, I mean, unless you get rid of it before they catch you, right? Well, you bury it, right? You take it out to the desert, you bury it. You get a free jail and then you go back to the you go back to the **** spot and dig it up, right? Watch you rest of your life to be like, ah, no, there's the money. They would never know. I would just put it in a safety deposit box and slowly take it out. Okay, if I don't get to keep the money, I'm not robbing a bank. Then I probably wouldn't do anything. That's the whole thing. I don't get this topic. Yeah, there's no crime.",
            "start": 141.32
        },
        {
            "text": "box and slowly take it out. Okay, if I don't get to keep the money, I'm not robbing a bank. Then I probably wouldn't do anything. That's the whole thing. I don't get this topic. Yeah, there's no crime I want to commit really. I'm playing Fallout right now and I feel bad when I when the red thing and I accidentally pick it up. I'm like, oh ****. I I've stolen one item and it was by mistake and I was like, oh God damn it. You're a delicate. I don't think there's anything bad like I wouldn't do anything that's like gonna, you know, hurt people or like I'm not killing anyone or I'm not going to what's the point? What what lot of little crimes that like I would just do like jaywalking. Just obviously the problem. I don't want give give it away on one **** thing. Like I feel like there's just a lot of little **** things, but that doesn't count. Like you don't get out of jail for I want to jaywalk a thousand times, you know, or like little thefts. I'm okay with little thefts. What do that mean? I know downloading",
            "start": 186.32
        },
        {
            "text": "things, but that doesn't count. Like you don't get out of jail for I want to jaywalk a thousand times, you know, or like little thefts. I'm okay with little thefts. What do that mean? I know downloading music or download like, you know, online piracy. It's digital, so it's not real. It's **** stealing, but I'm okay with that right now. You know, that doesn't even require a **** get out of jail free thing. So I'm like, if I'm this morally ambiguous and **** crazy that I'm downloading music and ****, what would I do if I could do a little bit more and it'd be okay? And I don't think it'd be that that crazy. Like steal a parade. That doesn't make any sense. No, it it definitely doesn't. I don't know about that's not even a crime. If you can take control of a parade, you become the parade master. Ferris Bueller's Day Off. It would be on the news. You get your Twitter handle. No, I like that. I definitely like this idea of stealing a parade. Thanks. Sounds weird, but I'm sure that but I don't think I need to get arrested. I'm",
            "start": 224.28
        },
        {
            "text": "it would be on the news. You get your Twitter handle. No, I like that. I definitely like this idea of stealing a parade. Thanks. Sounds weird, but I'm sure that but I don't think I need to get arrested. I'm pretty sure I this happens in Animal House. They just push the guy over and take the baton and they just lead it wherever they want. Cause if you're in a parade, if you're in a parade, you're already so **** stupid. You'll just follow whoever's marching in front. Cause you're already wasting your God damn Saturday walking around waving. It's not how parades work. Yeah, it is actually. Go to a parade. Really? I used to be in a lot of parades. Was the drum major of the marching band. I was I was I was I was poppy boy one one year. I was not the triangle. Okay, you can go the Dr. Does he walks the triangle and hits it? That's not that's not what that. What are you even doing? That's the triangle. He's hitting the triangle on the prairie right now and you're telling the kids to come out from playing with the cows cause",
            "start": 267.88
        },
        {
            "text": "it. That's not that's not what that. What are you even doing? That's the triangle. He's hitting the triangle on the prairie right now and you're telling the kids to come out from playing with the cows cause dinner's ready. Do they make different sounds? No, they don't make different sounds. It's one chime. You know, different sounds sides the cacophony of your stupidity, Kevin. Oh my God, you're just missed, Kevin. Colin, can you just miss him please? You're just missed. I just feel like there's a lot of illegal things that I'd want to do. I mean, okay, yeah, right. Why not burn a house down? No, see, I don't want to hurt people. No, no. Okay, I feel like there's a lot of crimes are bad things usually. I don't understand like where that's true. That's true. You know, I don't have any good examples really. I thought maybe you guys would. I know for me, thinking about it, the problem is there's a lot of things I'm like, yeah, I would do that. And then the moment I start thinking about it, I'm like, no, that's probably not something I",
            "start": 309.4
        },
        {
            "text": "would. I know for me, thinking about it, the problem is there's a lot of things I'm like, yeah, I would do that. And then the moment I start thinking about it, I'm like, no, that's probably not something I should do. Yeah, you know, like I'm trying to think of like sex things outdoors. I got one. But see, here's the thing. I want to have sex outdoors and I want to get like I want to **** front of the **** world. I want the whole world to see my dick. Oh, then she goes to jail. Yeah, no, no, no. Let's get out of here. That's not how it works. You there's one get out of jail. Then fine. Tim and Kevin can kill one another. Masturbating. Are you just masturbating in a window somewhere where everyone can see you? But see, here's the problem though, is it's like to me, this is like, yeah, that's what I'm going to do. And then I'm like, that's sexual assault. Like not it. You know, I mean, people watch and all that. So I'm like, oh ****. So then I'm like, do I need to give like NDAs? Do I need to have people sign it? Like no, but at",
            "start": 351.72
        },
        {
            "text": "I'm like, that's sexual assault. Like not it. You know, I mean, people watch and all that. So I'm like, oh ****. So then I'm like, do I need to give like NDAs? Do I need to have people sign it? Like no, but at that point, performance art, performance art. Yeah, you can actually get away with that. Really? Yeah, if you had if you if you brought everyone in. No, I if you brought anyone in, had them sign NDAs and it was a closed-off environment where no one else could see you away with it. Like I'm talking about like I want to be outside. I want to be on the streets with a Z or an S. Any anything really. Just give me concrete. It's harder when when it has a Z. Great. Don't look at me like I'm not I'm crazy. This all makes sense in my brain. I know it. No, it makes sense to me too. I'm not I wasn't knocking it. I want to **** on a mountain. You can **** on a mountain right now if that's not illegal. No, yeah, it is **** on a mountain. Yeah, if someone sees you. No, I know, but it's still illegal cause no one saw you. Does me oh",
            "start": 385.04
        },
        {
            "text": "on a mountain. You can **** on a mountain right now if that's not illegal. No, yeah, it is **** on a mountain. Yeah, if someone sees you. No, I know, but it's still illegal cause no one saw you. Does me oh, I stole. No, no one has sex outside. No, that's never happened before. I've certainly never had sex outside, Kevin. Nobody's saying that they I've had sex in a car. So what? So that's what you would use your had sex in a bed. I didn't say he ****. I want to a terrible want be a crowded mountain. I ski slope space having sex skiing down. Holy ****. See, no, there's kids. Yeah, and they're getting. Birds be talk real early. Big Mommy, why does that man have his cranberry pants around his ankles? It's not really a talk. It's more of like, I didn't know something could be that white. Oh, in regards to Tim's ass. Ah, I got a white. Your ass is white too. Don't don't ****. Look at your arms. If your arms are that white, your ass has to be even whiter, son. Never sees that thing. Look at you. Are you are so white. You are",
            "start": 424.16
        },
        {
            "text": "I got a white. Your ass is white too. Don't don't ****. Look at your arms. If your arms are that white, your ass has to be even whiter, son. Never sees that thing. Look at you. Are you are so white. You are Wonder Bread, my friend. Can't all be ethnic. I'm sorry. I like to take your I am very ethnic. I'm very ambiguously got that nice Mediterranean skin. I do. Look, we know I Greg goes outside more than I do. Way more. Yours is just natural. You have that glow to you. I do. That healthy TV baked in glow. The documentary is hitting you at 3:00 a.m. dude. I'm watching a great I'm watching a great documentary. I think it's called How We Got to Now or something like that. It's on it's on Netflix. It's a PBS documentary. Okay, it's **** awesome, dude. Each one is about like really random ****. The first one was about water and the second one's about um I saw I think I've seen that on on the suggested stuff. I'll they talk about the aqueducts uh with water. They talk about how like, you know, how water's been clean and",
            "start": 470.2
        },
        {
            "text": "and the second one's about um I saw I think I've seen that on on the suggested stuff. I'll they talk about the aqueducts uh with water. They talk about how like, you know, how water's been clean and how we made sewers and all these like it's about it's about like unsung heroes of history and how like these certain people that made these about one of the guys that they talk about is how one of that guy lifted Chicago up to to install sewers underneath it or whatever. Um one man. You get him in there. True story. When we were on our way back from LA, we got into another argument about what is the that wasn't the ar. There was it was it was a shut up. You're not miked. You're also very distracting. Look look at the other direction. Look into the fan. Turn the fan on and put your turn the fan on and look into it. Put your tongue in the fan. No, we got into an argument about what is the um what is the single most, you know, important uh invention for man? iPhone. And uh Kevin was like, the sewers, huh? And it he",
            "start": 512.8
        },
        {
            "text": "it put your tongue in the fan. No, we got into an argument about what is the um what is the single most, you know, important uh invention for man? iPhone. And uh Kevin was like, the sewers, huh? And it he may very well be right. No, that's not true. Came good answers in thinking about this. The moon. No, I want not invention. It would like if I can get arrested for stuff. And again, like I'm yeah, I'm the one coming up with this topic. So I'm now going to be my crew can get like one group of people validated. I'd want to try like a heist. I'd want to see if we can heist something or I want maybe rob a bank. Yeah, I don't know about a bank. Like not like not like a I don't want to scare people. Okay, let me back up. When I say I rob a bank, I don't mean I'm going in gunslinging midday. Get on the ground. Every would be cool as a **** robbery. Like any of you **** move, I'm going to execute every last **** ones of you. Um I mean like what's that? I I don't know. I honey bear. What is it? Uh I love you, Honey Bunny. I",
            "start": 553.64
        },
        {
            "text": "cool as a **** robbery. Like any of you **** move, I'm going to execute every last **** ones of you. Um I mean like what's that? I I don't know. I honey bear. What is it? Uh I love you, Honey Bunny. I love you, Pumpkin. I love you, Honey Bunny. Yeah, Pumpkin. That uh I mean like The Thomas Crown Affair. Going at night. No one's there. Ice the alarm. Kill the security feed. Like a little Hudson Hawk action where we're figuring out kind of like how to rob the mus weeks in a row with Hudson Hawk reference, man. I just got to watch it again. I got to bite down and rent it on. There was an NES game for Hudson Hawk and I and for years, really? Yeah. And for years, how bad was that game? And for years, I was like, I always was like, there's a game called Hudson Hawk. And then like in the '90s, I was like, ****, there's a movie called Hudson Hawk that the game's based on. I didn't even know that. It was kind of like when Konami released Goonies II on NES and I I and for 10 years, I walked around been like, is there a Goonies II?",
            "start": 596.24
        },
        {
            "text": "called Hudson Hawk that the game's based on. I didn't even know that. It was kind of like when Konami released Goonies II on NES and I I and for 10 years, I walked around been like, is there a Goonies II? Because I never saw it. And they're like, no, the game is **** called Goonies II.com. I'm like, oh, okay. I didn't know that. Anyway, uh I really want to play the Hudson Hawk game now as a let's play. We should do that. I bet it's great. But yeah, I'm talking like cool. We get to wear cool outfits. Like where we're like head to toe black. Like Ninja. Maybe we have the remember when the G.I. Joe characters would have the rope that you couldn't take off of them. That used to piss me off. We'd have that rope that we don't use. It's just there if we need. We know when you're going to need rope. I don't you they had rope. They had it there. Is that was like their cyanide pill? They would just swallow Cobra's to get a snow. Then they'd make a noose and hang themselves real quick. Duke's Last Resort. No, don't do that. And",
            "start": 635.96
        },
        {
            "text": "had it there. Is that was like their cyanide pill? They would just swallow Cobra's to get a snow. Then they'd make a noose and hang themselves real quick. Duke's Last Resort. No, don't do that. And they take it out their ass and they floss their whole body with it. How many sporting event? Two, maybe three max streak. You know, cause you can swallow it. Keep going. Eventually it would work its way down. You'd have to have like a mile and a half. How much? How how long are your intestines? 10 miles? 18 miles? Doesn't matter. You'd have to have a lot of rope, but you could do it. You just keep pulling it through. No, you can't. It's Poltergeist, Kevin. That's how bodies work. It's a straight shot from your mouth right to your ****. The rope maybe if it was lead lined, it wouldn't dis. It was a cough. I know. I wasn't sure what it was going to be. It'll happen so fast. I just turned over and it was mid mid thing. All right, stop, collaborate and listen. Don't fall for his traps anymore. He sets these traps for you to fall",
            "start": 668.76
        },
        {
            "text": "what it was going to be. It'll happen so fast. I just turned over and it was mid mid thing. All right, stop, collaborate and listen. Don't fall for his traps anymore. He sets these traps for you to fall into and I don't want you to do it. He's smarter than me. Is he? Yeah, he is. I can absolutely say that, ladies and gentlemen, this has been The GameOverGreggy Show. Each and every week for sometimes five best friends gather on this table. Each bring a random topic of discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny where you can get the shows early by tossing us a few bucks. But if you have no bucks to talk, head over to YouTube.com/KindaFunny where you can go. I said GameOverGreggy, didn't I? That's an old one. Patreon.com/KindaFunny. You didn't. You almost did though. I I fixed it. Yeah, I saw you reacting. So I saw you did fix it. I just I was, you know, YouTube.com/KindaFunny where we break it up top of topic day by day before entire show Friday. Three in video. Hilarious.",
            "start": 715.68
        },
        {
            "text": "I fixed it. Yeah, I saw you reacting. So I saw you did fix it. I just I was, you know, YouTube.com/KindaFunny where we break it up top of topic day by day before entire show Friday. Three in video. Hilarious, hilarious, hilarious. Heroin. Until next time, cocaine. It's been our pleasure to serve you.",
            "start": 756.6
        }
    ]
}