{
    "id": 1331,
    "video_id": "TAa7FLZctt0",
    "show_name": "Gameplay",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "Colin Moriarty Plays Fallout 4 - Kinda Funny Plays",
    "description": "Colin wrote two Fallout guides, and now, he's knee deep in Fallout 4. How is it treating him? Let's find out!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nCheck out all our Fallout 4 content!\n- Our Review: https://www.youtube.com/watch?v=NtT6YdVHLM4\n- Greg's Let's Play: https://www.youtube.com/watch?v=XyxrPskQH7M\n- Colin's Let's Play: https://www.youtube.com/watch?v=TAa7FLZctt0\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1447074001,
    "duration": 3088,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, welcome to Kinda Funny Games. My name is Colin Moriarty. This is the game, of course, you've been waiting for, it's Fallout 4. Now I'm recording this uh before the game uh is out. Um at the point that I'm recording this, I am only 11 or 1 hours into the game. Um but it goes without saying that if you don't want the game spoiled for you, you probably shouldn't be watching this right now. So I'm just warning you right now, the what I want to do is just show you a little bit of the game, some of the things that I think are cool in it, but also we'll just do um maybe a couple quests together as well. I just did a quest here, I won't spoil you for you what quest this was, but I just did this for this man named Paul Pembroke who I can light up here with my Pip-Boy and you can see me here. He's a fine looking gentleman, very Dapper, not really. Um so let's go right into Pip-Boy and I'll show you um what we can possibly do and so I'm going to go to data and I have a bunch of outstanding",
            "start": 0.04
        },
        {
            "text": "he's a fine looking gentleman, very Dapper, not really. Um so let's go right into Pip-Boy and I'll show you um what we can possibly do and so I'm going to go to data and I have a bunch of outstanding quests as you can see. I've only done these are the quests that I've already completed, so I have a bunch of quests that I haven't completed yet. Um and right now I'm doing that's the quest I was doing was Diamond City Blues, but let's start like a Quest from the beginning and see like what let's just see what happens. Um so this is a good one, Curtain Call, let's try this one and see what happens. I'm going to unelect, I'm going to select that, unselect that and um you'll see on the bottom of the screen there it is. If you see it, there's a door with like a little square above it, that's like the direction I need to go, but I can also just go into the map and figure out exactly where it is I need to go. So let's see if I can find it. So I'm I'm in the I'm in the appropriate area, it's telling me that I",
            "start": 37.4
        },
        {
            "text": "I need to go, but I can also just go into the map and figure out exactly where it is I need to go. So let's see if I can find it. So I'm I'm in the I'm in the appropriate area, it's telling me that I need to go to Trinity Tower to investigate the radio broadcast and I've already been there. So I've not been inside of it yet, but I've walked past it and thus unlocked it to Quick Travel. So we're going to Quick Travel there and it's going to take a minute, so be you know, be patient with me. Uh one of the cool things uh at the load screens, if you're bored or whatever, they'll show you just random objects from the game that are just in the game. So this is like an oil lantern um and you can just kind of circulate it and kind of on it while the game loads. Um if you want, there would be a bunch of different objects, guns, people, you know, creatures, whatever. You can kind of just take a look at them. Um the VDSG Catalog below on the bottom left will show you little tips for the game as you play and",
            "start": 84.68
        },
        {
            "text": "different objects, guns, people, you know, creatures, whatever. You can kind of just take a look at them. Um the VDSG Catalog below on the bottom left will show you little tips for the game as you play and obviously the bar above it is your level. I'm level 1 right now. There is apparently no level cap in the game. Um you get a trophy for reaching level 50, I think. I don't know how much further you want to go than that. We should level up during this Let's Play and I will show you that whole system because it is different in Fallout 4 than it is in Fallout 3. I don't know if I like it as much as Fallout 3 is and I'll show you why in a second. All right, so you can see on the bottom of the screen there, the door is there, it's closer and it's telling me I'm like, you know, 10, 9, 8, 7 meters away. So it sounds like, oh, I'm already under attack. All right, so I'm equipped with my 10mm pistol here and I'm going to use V.A.T.S. to attack the Mutant Hound. Shoot him right in the head, do some damage. My dog's also",
            "start": 123.28
        },
        {
            "text": "like, oh, I'm already under attack. All right, so I'm equipped with my 10mm pistol here and I'm going to use V.A.T.S. to attack the Mutant Hound. Shoot him right in the head, do some damage. My dog's also attacking. Dogmeat's with me and so that should take him out. 15 experience points for that, but I'm out of AP, so I kind of have to be careful here. There's at least one more creature over here. Looks like my dog's attacking him, he is. So I'm just going to pump the Super Mutant in the back here. Oh, ammo, there we go. And the dog took him out and obviously I want to search and take his ammo. Maybe I'll take his my look meat as well. His hunting rifle he can keep. My dog's under attack by this guy, so let's see. I'm going to try to shoot him in the head. I have a 60% chance of hitting him, so I missed that one. I got that one and I'm out. So you can see here that Super Mutants are not as daunting as they were in the uh in Fallout 3 at all. You didn't want to fight these guys at all. Um they're much more um easy to",
            "start": 157.44
        },
        {
            "text": "that one and I'm out. So you can see here that Super Mutants are not as daunting as they were in the uh in Fallout 3 at all. You didn't want to fight these guys at all. Um they're much more um easy to take advant to take out here. Super Mutant Cowl Armor, let's see. I'm going to take it. I'll go into my inventory and see how it stacks up. So if I go over to apparel, this is weaker than everything I have, so I'm actually and it's not really well, you know, to hold on to. I can sell later, it's only worth 30 caps, but every cap counts. So let's see if we can find anything interesting before we go up around the building. Doesn't look like there's anything too interesting going on here. No enemies. I'm hitting L1 just to use V.A.T.S. to see if there's anything alive around me. There isn't. And then we can go up the stairs and continue on our way. And here's the door, you can see the icon there that I was talking about before, that that means that that's the direction we need to go. Before I go in there, of course, I",
            "start": 202.44
        },
        {
            "text": "stairs and continue on our way. And here's the door, you can see the icon there that I was talking about before, that that means that that's the direction we need to go. Before I go in there, of course, I want to explore to make sure there's some bottle caps and Mole Rat, Mole Rat meat that I can use. There might be more meat in here. I can grab a skull eye socket. I don't know if I need that. See, I keep going up, but I don't think there's anywhere for me to go from here. Oh, I can go on the roof. See, this is the major distraction of Fallout 3 or Fallout 4 rather, and Fallout 3 and every other Fallout game is just getting sidetracked. It's just so much to do. Everything you see, you can go to everything. It's pretty cool. And right now we're in the middle of Boston in the game. There's just, you know, nothing up here. Now you'll wonder, we'll get into this in a minute, but like in Fallout 3 and Fallout: New Vegas, the world was populated with things like this, like battered clipboards and TV Dinners and they really",
            "start": 253.64
        },
        {
            "text": "up here. Now you'll wonder, we'll get into this in a minute, but like in Fallout 3 and Fallout: New Vegas, the world was populated with things like this, like battered clipboards and TV Dinners and they really had no purpose. In this game, everything has a purpose and I'll show you why that is in a little while. But in the meantime, let's go back and continue on with the quest so we can show you something a little cool. Is there anything in here? I just saw gold watch, I'll take that. That's going to be worth money. All right, so let's go back down, make sure there's nothing else over here that we need. Oh, there's a chest here. I don't think I can open. There's another meat bag, some ammo, bottle caps and ammo. Every a little bit helps. So I'll put my gun away for now. I don't really need it. I'll move a little faster without it and we'll go into the elevator and see what happens here. Dogmeat, you coming? Well, I'll see you down there. Okay, got on you. Only kill the weakest of us, it only makes us stronger. Someone's",
            "start": 294.92
        },
        {
            "text": "without it and we'll go into the elevator and see what happens here. Dogmeat, you coming? Well, I'll see you down there. Okay, got on you. Only kill the weakest of us, it only makes us stronger. Someone's yelling at me, if they can not kill one human, they are less than. So you can see on the bottom left of the screen, my HP meter and I'm actually quite radiated as you can see with the red meter means that my health can only go so far. I can use RadAway to get rid of that, but I don't know if I really want to right now. Warriors are for you. So if I crouch down, I'm hidden, no one knows I'm here. So for now I can explore with impunity, but I see someone over here. Okay, so I need to get the hell out of here. Do he see me? Yeah, he knows I'm there. All right, so we'll aim the head. Shot's below 50%. Let's see what we can do. So I got him in his head twice and someone else is attacking me. I'm in a lot of trouble here already. So let's see Aid. I'm going to use a RadAway to get rid of the radiation, a couple things to",
            "start": 343.04
        },
        {
            "text": "do. So I got him in his head twice and someone else is attacking me. I'm in a lot of trouble here already. So let's see Aid. I'm going to use a RadAway to get rid of the radiation, a couple things to preserve water and and a Stimpack. And because shit's getting a little crazy, I'm also going to use Psycho and I might actually become addicted to drugs if I can using drugs like this in the game. And yes, Kevin, you can become addicted to drugs when you use them. And then we'll see what happens from there because these guys are on my ass. That guy needs to go. I'm cornering myself here, but at least my AP will be filled up a little bit. I can maybe get a headshot. He moved, so he's dead and he's dead. All right, so let's he's got a fragmentation grenade that should come in useful later. This guy's a Molotov cocktail that'll be useful. Bottle caps, et cetera. So right now if I crouch down again, I'm in danger. There's still someone there and it says if you see on the radar below, if I turn around, you can see the red",
            "start": 397.08
        },
        {
            "text": "cocktail that'll be useful. Bottle caps, et cetera. So right now if I crouch down again, I'm in danger. There's still someone there and it says if you see on the radar below, if I turn around, you can see the red dots. The triangle above the Red Dot means he's above us, the the one below means he's below us and then just the square um means that they're on my level. So they're coming at me, they're coming towards me. We don't quite know where they are. I also can't hear the game very well. There's packs of cigarettes in here, I can sell those later. No, it's okay. Kevin's asking if I want headphones, but it's fine. Um because usually there's I mean, you're hearing them better than I can hear them. Um but there are audio cues in the game obviously to let you know what's going on. This toolbox is locked in indicating there might be something valuable in there. So let's pick the lock if we can. Easy enough, it's a novice lock. Got it. And there's nothing really that useful in here, but here's what I was talking about",
            "start": 455.6
        },
        {
            "text": "there might be something valuable in there. So let's pick the lock if we can. Easy enough, it's a novice lock. Got it. And there's nothing really that useful in here, but here's what I was talking about before. The items don't just exist in for to exist anymore, populate the the world. Now they exist because they have pieces of something that's useful to in enhance your town called Sanctuary, which we'll go to in a little while and I'll show to you. Uh so the duct tape has adhesive and cloth in it. The gold watch can be sold for 40 caps, but you can also get Gears, gold and spring out of it which can be used. Um and then the wrench is just steel. So I'll grab the watch, I have plenty of the other stuff right now. Um so that's the indication of why you like the game's a little bit different in that sense than it used to be. I can go this way. Let's see, there's anything of use in here. You have to come out sooner or later. Oh, there's one of their dogs. That should be the killing blow. So he's dead. Don't trust",
            "start": 497.16
        },
        {
            "text": "it used to be. I can go this way. Let's see, there's anything of use in here. You have to come out sooner or later. Oh, there's one of their dogs. That should be the killing blow. So he's dead. Don't trust those guys, Kevin. Now, Kevin, does this game intrigue you very? Have you ever played Fallout? I've never. Have you seen it? Um very little. You find almost as good as a super. So all these doors should be able to be open. So there's like all sorts of stuff around here, but there could be he's already dead, but there there could be traps and you got to be very careful. I'm I'm collecting all the meat even though it's radiated because I can eat it and it will help me later. So there's another lock to blocks. Let's see if we can open this one. Oh, wrong way. More. There we go. Sweet. So a ball-peen hammer, duct tape and a silver pocket watch which should be valuable. So grab that. More meat. Oh, there's a guy over here. He has bottle caps, InstaMash, Mutfruit, some other stuff that I don't need. A radioactive gland I can probably use",
            "start": 535.08
        },
        {
            "text": "pocket watch which should be valuable. So grab that. More meat. Oh, there's a guy over here. He has bottle caps, InstaMash, Mutfruit, some other stuff that I don't need. A radioactive gland I can probably use later. Is there anything in the trash can? Med-X in the trash can, that's very useful. More cigarettes which will be valuable to sell. Nothing in the filing cabinet, nothing on the desk. There's a drinking glass there, we don't need that. So as you can see, see this is the way I came. So we were here first, we cleared this area out, then we went this way, we killed that guy, we explored that room. So we can go up these stairs. I'm not sure that there's anything in these other rooms that we might want to look for before we go. Also, there's a way back down to the floor below. Oh jeez. So there's there's the guy that was below us. I got to get a little closer to him to get a good shot. All right, so a little better than 50/50 hitting him. Miss both of my first shots, hit him in the third shot, hit him with the fourth shot.",
            "start": 597.72
        },
        {
            "text": "below us. I got to get a little closer to him to get a good shot. All right, so a little better than 50/50 hitting him. Miss both of my first shots, hit him in the third shot, hit him with the fourth shot, missed the fifth shot. So pretty much completely 50/50. We'll grab that. Is there anything on the table? Sugar Bombs, I can use those. Okay, and actually since we're collecting so much food, I'll go into my Aid. I'll start eating some of it. So we the Bloatfly Meat that will do. Going to eat some corn, crispy squirrel bits. That should heal me a little bit. As you can see there, healing is not automatic even when you eat. You can see it's slowly filling up. So if you're healing during a battle, that might be problematic for you as it was for me before. Oh, there was Psycho over here, that's good. I just used some of that, so that can replenish that for me. See anything else? Anything else? This is an advanced lock, so this is going to be a tougher one for me to open. Me a little more stubborn, but not that bad. Nice.",
            "start": 647.64
        },
        {
            "text": "of that, so that can replenish that for me. See anything else? Anything else? This is an advanced lock, so this is going to be a tougher one for me to open. Me a little more stubborn, but not that bad. Nice. Okay, anything interesting in here? Empty milk bottle, folder, Cap Stash. So we can grab that and it's caps, the Stimpack and RadAway. Now we can unhack a computer. This is another different thing and of course Fallout veterans are used to unlocking doors and hacking computers. So let's see if we can do this one. So of course first we want to look for things that we can use to make it easier for us if there's any in here. So we want to look for like parentheses that are attached to each other if we can and I'm not seeing all. So here's one, so selecting this will get rid of a dud. So one of the codes are gone now that are fake. I don't see this is another one, but this will give me an extra turn I think if I use it. No, that removed a dud as well. And then any other ones I don't see. Oh, there's another one.",
            "start": 703.68
        },
        {
            "text": "gone now that are fake. I don't see this is another one, but this will give me an extra turn I think if I use it. No, that removed a dud as well. And then any other ones I don't see. Oh, there's another one here. So oh, and another one. Oh, my tries were reset with that one, so I should have kept trying. I should started trying at that. All right, so let's see if we can unlock Star. Sorry, we know that none of them are in there at all. So S.T.A.R. This might be it. They all right. T.H.Y. Ship. Is it ship? Nope. All right, I got to try again. You try a fourth time, it's going to lock you out of the terminal. So the idea, Kevin, is that you're looking to unlock this is a novice computer. So you're looking to unlock using one of these words, so cast, Boys, Save or whatever. So if I select tile, it'll say entry denied, likeness one, which means there's uh one of those letters is in the right place. So now I can say like, okay, T.L.E.L.O.S.E. So maybe it's lose and it's the same thing. So we know that it's the E at the end that",
            "start": 759.32
        },
        {
            "text": "one which means there's uh one of those letters is in the right place. So now I can say like, okay, T.L.E.L.O.S.E. So maybe it's lose and it's the same thing. So we know that it's the E at the end that probably is the one. And again we fail out, so we have to go back in. If you do it a fourth time, you're not locked out permanently like you are in some in in like Fallout 3. Um you're locked out temporarily, but it's just going to take time to. So laws, it's not that. Trap, not that. Bunk. Man, oh man, we're going to be here for a while. I want I'm now I'm more curious than ever what this computer does. Find. F.N.D. N.D. F.N.D. Orn. N.D. I.N.D. Corn. F.I.N.D. It's not any of those. I.N.D. There we go. All right, so there's a safe somewhere around here. We can use this to disengage the lock, so we don't have to pick the safe. We might not be a even strong enough to pick the safe yet. So this the safe is now unlocked and I don't know where it is. Oh wait, there's also a remote door control here, so we can actually probably",
            "start": 810.84
        },
        {
            "text": "we might not be a even strong enough to pick the safe yet. So this the safe is now unlocked and I don't know where it is. Oh wait, there's also a remote door control here, so we can actually probably unlock a door too. Oh no, it's already open. Okay, perfect. All right, so that's done. I wonder I wonder where the door is that I unlocked. Might not be down here. I mean, there's nowhere else for me to go. Might be above. So let's get into the elevator and see where it brings us. This of course is part of the great love of Fallout and you just don't know where you're going and what you're doing. I mean, if we go back to the um to the screen here, the data screen and go to Quest, like all I know about this is I'm investigating a radio broadcast. That's all I know. Like I so I caught a radio broadcast on my radio here that I listened to that gave me information that something was going on here, but I have no other information. All right, I'm going to close the door. We'll see. Dogmeat above. Is this elevator broken?",
            "start": 867.84
        },
        {
            "text": "that I listened to that gave me information that something was going on here, but I have no other information. All right, I'm going to close the door. We'll see. Dogmeat above. Is this elevator broken? Might be. Looks like it. All right, so I guess we'll go back up the manual way. I could use the exercise anyway. All right, so there's a guy above me and I'm actually being told now on the screen that what I need to do is above me as well. So here's one of the dudes I need to fight, but a little better than 50/50 hitting him in the head. So let's shoot. Heavy sniper rifle, I'll leave that. I have some pretty good sniper rifles. Super Mutant Leg Guards, I wonder if these are going to be useful for me. Let's go to the to our apparel look. Nope, none of this is stronger than what I have right now. And by the way, this is what I look like right now. You can't really see, but that's me. Okay, I'm fine, thank you. So here's a safe expert lock. I can't oh, I actually can't open expert lock, so I did spend it that that time, but",
            "start": 919.72
        },
        {
            "text": "is what I look like right now. You can't really see, but that's me. Okay, I'm fine, thank you. So here's a safe expert lock. I can't oh, I actually can't open expert lock, so I did spend it that that time, but this is going to be a hard one to unlock here. Oh no, not at all. Look how good I am at unlocking. I picked it. So there's a lot of stuff in here. 44 caliber rounds, 50 caliber rounds, 10mm rounds, compensated, calibrated 10mm pistol. Take it. Missiles, plasma cartridge, pre-war money and a silver pocket watch. Sweet. That's a pretty good that's a pretty good find there and I get a little experience for unlocking that as well. Take a poop and wash my hands if I wanted to here. I'm not going to. All right, so there's nowhere else to go but up and it seems like up is where everything's happening. What's up, Kevin? No, you can't. Would you like to poop in the game? Kevin asked if we can poop in the game. Oh, someone's using a flamethrower. This is no bueno. I'm on fire. I need to heal. See, just going to be eating a",
            "start": 996.08
        },
        {
            "text": "no, you can't. Would you like to poop in the game? Kevin asked if we can poop in the game. Oh, someone's using a flamethrower. This is no bueno. I'm on fire. I need to heal. See, just going to be eating a little bit trying to get my health up. So I'll stay back for just a minute. Someone's up there using some crazy **** and I think they're **** with my dog. I can hear my dog, he struggling. There he is. Seems like the fire might be hurting him more than it's hurting me. All right, he can't die, but he can get disabled and you have to to use a Stimpack on him. Kevin asked if the dog can die, but he can't. Dogmeat seems to be okay. Let's see this guy has on him. I don't even know where he was getting that from because he doesn't have a flamethrower on him. There's something here, crap, and see if we can grab it. Stimpack and a blood pack. We'll use that. There's a Cap Stash here, 3 caps. Very nice. We don't want to go down there. Oh, is there something in here useful? No. Okay, so it looks like this is this elevator is",
            "start": 1061.96
        },
        {
            "text": "pack and a blood pack. We'll use that. There's a Cap Stash here, 3 caps. Very nice. We don't want to go down there. Oh, is there something in here useful? No. Okay, so it looks like this is this elevator is beckoning us. I have a bad feeling about this. Let's make sure we're all healed up. The dog will meet us there, I promise. See, he's right there. Hello, friend. He's named Dogmeat. Dogmeat is the name of the dog in in Fallout. So we're going up. This is a tall building. I'm nervous. Are you nervous, Kevin? I don't like it one bit, to be honest with you. So when you're in your mhm, I'm Stu. When you're using the thing on your arm, yeah, it does. But when you're in V.A.T.S., which is the thing where the that doesn't stop time, it slows it down. Let's explore, see what we can find. I hear someone. Oh, there's a lot of guys up there. So I'm seeing at least seven dots. Not good. This going to be overwhelming. This might be the death of me. Dogmeat's going right in. He didn't go a ****. I want to see if I have I like using this pistol, but",
            "start": 1124.92
        },
        {
            "text": "I'm seeing at least seven dots. Not good. This going to be overwhelming. This might be the death of me. Dogmeat's going right in. He didn't go a ****. I want to see if I have I like using this pistol, but I'm kind of running low on ammo, so I'm wondering what else I have here that I could use. My Minigun, I'm out of 5mm ammo. Righteous Authority, I do have 108 cell. I have a lot of shells for the shotgun. Let's use the V.A.T.S. Enhanced Submachine Gun. See what happens. He has one bottle cap on him. Great, thanks. Are you hurt? You're hurt. I'm going to use a Stimpack on him. Uh oh, where did that come from? Where is that coming from? Oh, across the way. Okay. All right, so I'm going to go back in. We got to be got to be careful here. I have a bunch of Mutfruit, so I'll just use it. The radiating the **** out of myself, but **** he's done. He has some more stuff for me, which is nice. He has a femur on him, that's interesting. All right, so okay, so he's done. How many more are we working with? At least four more enemies. All",
            "start": 1209.68
        },
        {
            "text": "**** he's done. He has some more stuff for me, which is nice. He has a femur on him, that's interesting. All right, so okay, so he's done. How many more are we working with? At least four more enemies. All Above Me. Marksman's Hardened Automatic Pipe Rifle. I'm going to let you keep that. That sounds like too complicated for me. All right, down. I don't know if I want to go down, but I'm going to anyway. Where is this? Is there anything in here of interest? Oh, okay, this is where I was. I see. Okay. All right, so we keep on keeping on. Oh, there he is. Okay, he's dead. Three more. There he is. Oh, this guy's melee, so he's going to be oops, he's going to be a walking nightmare here. All right. Oh man, I missed all of them. That did **** his head though, which is good. There we go. So when you see the enemy, when you aim for the enemy's head for instance, and you see him stagger in V.A.T.S., it means that you've broken his head basically, like he won't be able to aim as well. Um so you can shoot his right arm for instance and he won't be",
            "start": 1282.96
        },
        {
            "text": "head for instance and you see him stagger and V.A.T.S. it means that you've broken his head basically like he won't be able to aim as well um so you can shoot his right arm for instance and he won't be able to use his right arm you can shoot his gun out of his hand he won't be able to shoot his you know if you can get the gun out of his hand he won't have a weapon anymore but it's all an opportunity cost you want to aim for the head to make them not a to make them be able to aim well and to do as much damage as possible obviously you're going to be most likely to be able to hit their torso that's the highest percentage shot but that's not always the most useful shot to take anything go on here nope anything going on here another Cap Stash we'll take that another First Aid Kit we'll loot that careful not to fall through here so there's two more as far as I can tell two more enemies and they are above us they're up here there's one he's clipping through the wall as you can see there oh oh",
            "start": 1380.32
        },
        {
            "text": "careful not to fall through here so there's two more as far as I can tell two more enemies and they are above us they're up here there's one he's clipping through the wall as you can see there oh oh my God oh no no no no no no no he has a Minigun So You Know The Enemy like you know you're dealing with like a real enemy when he has a name so I'm shooting this guy's legs and this might actually **** his ability to move so let's take care of this guy and just get him out of the way okay so he that now we have to we have to think pretty strategically here first of all I'm going to go use uh Stimpack oh my God he's following us all right so oh **** all right all right I got to go jump there we go oh I killed myself with the Fall, Fist I don't know if I he might be too powerful me to take well I'm going to have to go through these enemies again throw a Grenade I could throw a Grenade at them I could also use a Mine I have Fragmentation Grenades, mine is smart come down that ramp mhm so I",
            "start": 1424.0
        },
        {
            "text": "well I'm going to have to go through these enemies again throw a Grenade I could throw a Grenade at them I could also use a Mine I have Fragmentation Grenades, mine is smart come down that ramp mhm so I might be able to set up a Mine but it's hard to predict them the Brilliance is of this is hopefully when I came through that elevator door it saved it did I think so I think I can go back up the elevator again I only should only have to go through like those last 10 enemies or so again so it shouldn't be a huge problem let's see the games are pretty the game's pretty generous with its save points typically as as Fallout 3, New Vegas were as well where if you go into a new er territory it'll save the game for you if you're go into a new door it has to load basically um it's going to save your game so let's see if we can get through this and and deal with Fist a little more effectively this time because he's not **** around as you can tell right I already have his Minigun but he might have a",
            "start": 1491.08
        },
        {
            "text": "so let's see if we can get through this and and deal with Fist a little more effectively this time because he's not **** around as you can tell right I already have his Minigun but he might have a Minigun I don't have any ammo for it but he might have a better Minigun so we'll see how it statistically matches up I'm going to jump on my dog see if I can jump on them this is like a Mass Effect elevator come here taking forever to load like it dogs getting restless all right here we go you they know I'm here as I'm in Danger let's see there's no sneaking around oh God I missed those first two shots that sucks got him right in this **** Gill though you're dead let's take cover again let's go into Aid and just see what's here let's eat let them come to me does he have anything I can use stuck here on this there we go okay nope no no no no no so I staggered him he has a Molotov Cocktail which will be useful he also has right arm bones don't know why he has those there's another guy anything",
            "start": 1535.4
        },
        {
            "text": "on this there we go okay nope no no no no no so I staggered him he has a Molotov Cocktail which will be useful he also has right arm bones don't know why he has those there's another guy anything here for me two Stimpacks there's a guy right up there see uh-oh all right so we're doing a little oh this guy's coming he's going to be a little more aggressive so let's go and use some Stimpacks to heal up a little bit little bit he's done I made I put him out like a **** basically Kevin in case you didn't notice thank you and he's done all right so we we have just three more left so one of them is Fist they got to put us out of our misery before we got got to be careful with him and we have to play this just a little bit more strategically I think if I die again we'll just abandon this Quest and we'll go do something else oh he's behind me **** **** I'm in trouble let's see let's do a couple Stimpacks I think I let me make sure that I have my Grenade I do have attached all right",
            "start": 1634.96
        },
        {
            "text": "and we'll go do something else oh he's behind me **** **** I'm in trouble let's see let's do a couple Stimpacks I think I let me make sure that I have my Grenade I do have attached all right so you're dead I threw a Grenade at him let's see if it does any damage to him I did quite a bit of damage to him see if we can do it again oh I think I all right so getting shot from multiple angles here but see if we can get rid of that should do them I missed him **** all right so I'm out of Grenades but he's been there's enough damage done where I'm I'm confident that if I just have the right weapon so let's go back to weapons and go to the V.A.T.S. enhanced um Submachine Gun see what happens here man he's taking a lot of damage all right let see let's two more Stimpacks Mercy we just go into V.A.T.S. and hit him in his torso there done so he's dead so his two friends shouldn't be remaining friends shouldn't be too much of a challenge for us you're going to have to struggle on I don't want to use",
            "start": 1715.92
        },
        {
            "text": "and hit him in his torso there done so he's dead so his two friends shouldn't be remaining friends shouldn't be too much of a challenge for us you're going to have to struggle on I don't want to use anymore he has Minigun Plus so we should grab that it's probably going to be statistically stronger than what I'm using and then let's get our way up there if we can where these clowns are yeah we went we did go down here before right oh yeah this is just full circle for us I think yeah right okay look at all the look at he wasn't **** around that guy he's dead there's just one more guy and he's taking pot shots at me from up here go I think that's all the enemies all right so let's go see what's going on up here it's telling me to go up all right some some stuff here our weapons work all right so Trinity Tower Cell Key, Bottle Caps, Lightweight Metal Left Leg, and Muffled all right so that may be new armor for me to use and here Super Mutant Heavy Armor we'll go through all this in a",
            "start": 1800.12
        },
        {
            "text": "right so Trinity Tower Cell Key, Bottle Caps, Lightweight Metal Left Leg, and Muffled all right so that may be new armor for me to use and here Super Mutant Heavy Armor we'll go through all this in a little while I think I shouldn't be encumbered yet no I still have I can still carry I can still carry 5 pounds or so so there's nothing over here is there anything over here before I go into the cell by the way that all actually exists you can go all those ways in case you're curious you can get a better look at the other side here so all that's there okay so let's go into here now oh there's a gentleman in here this wait are you going to fight me or do you want to get out who are you are you my friend you're just going to run away excuse me sir no let them do whatever it is they're doing I want this I came all the way up here I'm getting all the oh a Bobblehead sweet yes permanently gain 5% critical damage with melee weapons so that's pretty big a Macbeth Script so this is a special item",
            "start": 1890.64
        },
        {
            "text": "this I came all the way up here I'm getting all the oh a Bobblehead sweet yes permanently gain 5% critical damage with melee weapons so that's pretty big a Macbeth Script so this is a special item for me let going grab some Bobby Pins I'll leave the rest of that there someone's attacking by my dog oh my God these guys are up here now all right who who the **** is that well you have the gun you got to go I'm going to overcompensate and just use one more Stimpack oh I trapped here no I'm not oh God they're throwing Grenades and **** and now I'm on fire and my friend's over here **** cowering in the corner I don't even know who this is why am I even up in this building oh my god get away from me oh he's going to go around the building damn it is this guy going to help me fight or what all right you're dead oh that's my friend **** okay well they all look the same racist all right he's dead can we talk who are you talk to me no are we friends all right I'm hurting here I think I",
            "start": 1956.48
        },
        {
            "text": "all right you're dead oh that's my friend **** okay well they all look the same racist all right he's dead can we talk who are you hey Strong how do you know his name where's that other guy I don't know I'm getting the **** out of here oh there he is excuse me sir Strong, Rex this is the one one of the things I do have a problem with with this game is unlike Fallout 3, New Vegas what the **** oh my God we got to fight again are you kidding me I just want to get the **** out of here let me out of here I got to use Stimpacks um the one problem well one of the problems I have with the game is that it doesn't automatically show you when you're engaging in someone in conversation like it did in Fallout 3 and Fallout New Vegas so you you would press an X and the game would zoom in and make let you know that you're in a conversation with someone as",
            "start": 2039.92
        },
        {
            "text": "in someone in conversation like it did in Fallout 3 and Fallout New Vegas so you you would press an X and the game would zoom in and make let you know that you're in a conversation with someone as opposed to just like a passing comment made to someone and that's not clear in this game which is a little annoying to me I don't know why they got rid of that I I assume the it was to make it more seamless but it still doesn't make any sense all right oh my God you got these guys no don't push me into it all right let's see those 5 they both do 5 damage let's equip this and how does this repair all right that'll do running out of 10mm ammo seems like there's just let's see three enemies down here based on the radar two left is there any more oh did he kill him already okay fair enough he has one Bottle Cap great thanks all right let's get the **** out here couldn't I have just gone down the way I came like why are we doing it this like did I just jump oh my God can you leave me the",
            "start": 2133.04
        },
        {
            "text": "has one Bottle Cap great thanks all right let's get the **** out here couldn't I have just gone down the way I came like why are we doing it this like did I just jump oh my God can you leave me the **** please excuse me friend I don't even know who you are why am I why are we in this situation who are you a real us oh my God it's a Super Mutant Brute and I'm going to have to fight him great can I go no I can't I'm stuck here it's fantastic all right we're just going to keep going I guess this is pretty brutal oh my God are they throwing Grenades at me please don't kill me I'm almost there I'm almost done are we almost to the ground we're getting really close I almost just want to jump out okay so oh okay I know where we are interesting this is the area I was exploring earlier there's my dog Magic appear he found a way down so we're trying to just get down and out of here I guess is there anyone left around here no okay keep going down I guess all right this is where we're supposed to",
            "start": 2195.04
        },
        {
            "text": "Magic appear he found a way down so we're trying to just get down and out of here I guess is there anyone left around here no okay keep going down I guess all right this is where we're supposed to be up I think it says are my friends with me where are they there what do you have to say for yourselves Rex I can't hear anything he's saying I'm going to do something real quick yeah just for this I don't like usually doing this but why are you moving around like that where are you so this guy's just an idealist fair enough Rex I think it's time you left this awful place as well what happened I don't know Kevin asked what happened to his mutant I don't know so I leveled up I'm going to hold down Circle here since I'm playing on PS4 now this is the the level up chart and this is where things get a little bit unwieldy here so and I'm not sure how I feel about it at this point so you have your usual S.P.E.C.I.A.L. Strength, Perception, Endurance, Charisma, Intelligence, Agility, and Luck and you can use",
            "start": 2275.64
        },
        {
            "text": "a little bit unwieldy here so and I'm not sure how I feel about it at this point so you have your usual S.P.E.C.I.A.L. Strength, Perception, Endurance, Charisma, Intelligence, Agility, and Luck and you can use your level up points to level these up at any time so you're not really locked into the choices you make early on that where like Bobbleheads were so useful to find because you can increase you know one of your things or whatever underneath those are like a bunch of things so since I'm level six on Charisma I can go down six levels and then start leveling things up so I can do like Local Leader this is as the ruler everyone turns to you're able to establish supply lines between your Workshop Settlements we'll get to that in a minute um Animal Friend commune with beasts with your gun aim at any animal below your level and gain a chance to pacify it Etc and so on so I've been spending a lot on Charisma because I like making choices like convincing people and bartering with people and stuff",
            "start": 2396.76
        },
        {
            "text": "animal below your level and gain a chance to pacify it Etc and so on so I've been spending a lot on Charisma because I like making choices like convincing people and bartering with people and stuff like that so that I can play nonviolent or just have different choices um but here I kind of want to see where where else I can spend you can see here it's like Lifegiver I really want this one because it says Lifegiver you instantly gain another 0 Max maximum health and slowly regenerate lost Health but I don't have I have enough Endurance but I do not have I'm not level 0 yet so I can't get it um so here I can pick Master Lock and then um if I select the next one I'm but I'm not I'm I'm not level 18 yet here um I can start hacking Expert Terminals um and so I'm actually I'm going to do that because I do like hacking so there's a lot of choices to be made now if I go back into it uh I go to the Perk Chart um you can see that you can easily get lost in here I mean there's a I mean",
            "start": 2436.04
        },
        {
            "text": "do that because I do like hacking so there's a lot of choices to be made now if I go back into it uh I go to the Perk Chart um you can see that you can easily get lost in here I mean there's a I mean there's a ton I've not even unlocked um but with no level cap apparently I don't know you know that's that's the word it you should be able to spend enough time with the game where you actually can probably do as much as you want or or a great deal what you want as opposed to making really tough choices but right now I'm just taking making some pretty tough choices so that mission's done so that's an example of a mission in the game now before I go um cuz I don't want to show you too much and spoil it for you I do want to show you two other things so one thing I want to show you is I want to show you this game's version as far as I can tell I'm still pretty early on but this game's version of Megaton which is Diamond City and what's cool about Diamond City is that it Diamond City as the",
            "start": 2476.04
        },
        {
            "text": "show you this game's version as far as I can tell I'm still pretty early on but this game's version of Megaton which is Diamond City and what's cool about Diamond City is that it Diamond City as the name of suggests is a baseball diamond it's actually Fenway Park um in Boston and people live there now and have made like a huge settlement there so we're gonna I'm gonna it's gonna take me a minute to uh to you know to fast travel there but I want to show it to you and see what you guys think of it and then I'm going to show you my settlement in a place called Sanctuary and that's one of the new kind of aspects of the game um that I think a lot of people are going to get drawn into uh where you're able to uh make a Town and fortify it and Supply it and all this kind of stuff so there's like a lot of like kind of little mini games in the game to to mess around with so this is Diamond City and you can see it's a little cloudy today it's a little overcast so it's not like the most beautiful",
            "start": 2523.84
        },
        {
            "text": "lot of like kind of little mini games in the game to to mess around with so this is Diamond City and you can see it's a little cloudy today it's a little overcast so it's not like the most beautiful day um but since we're here true I should see you know since we have let's do this now since we found something new equipment let's see what works on me and what doesn't and then we can sell the rest of it so the Lightweight Metal Left Leg compared to what what do I have equipped on now I don't even know if I have anything on the left leg do I I guess oh I have Leather Left Leg so this is two and five this is seven and three so yeah I'm going to I'm going to see I'm going to equip that instead Muffled Treated Right Arm or Left Arm rather is better than my Leather Left Arm so I'm going to put put that on Reginald's Suit I don't even know what the hell that is Super Mutant Cowl is weaker than what I have the Super Mutant Heavy Armor is weaker than what I have and the Super Mutant Leg Guards are",
            "start": 2562.24
        },
        {
            "text": "that on Reginald's Suit I don't even know what the hell that is Super Mutant Cowl is weaker than what I have the Super Mutant Heavy Armor is weaker than what I have and the Super Mutant Leg Guards are weaker than what I have and then as far as Weapons I don't think I really picked up anything new I did pick up this compensated calibrate a 10mm Pistol so I can sell both of those pistols so let's go to this woman over here this neurotic woman that I keep talking to and what do she I don't even know what she said to me can I just sell to you Ma'am, you Nut Shop so let's unload some of the stuff that I have here um if I go just to weapons I can get rid of both these pistols since I don't really need them anymore and then get rid of some of this stuff as well Reginald's I still don't even know what that is all right it's worth something it seems like it's yeah I'm just going to get rid of it **** it all right so we'll get rid of that that'll give me some Caps um and then uh we'll walk",
            "start": 2606.8
        },
        {
            "text": "what that is all right it's worth something it seems like it's yeah I'm just going to get rid of it **** it all right so we'll get rid of that that'll give me some Caps um and then uh we'll walk around I'll show you a little bit more of Diamond City you just kind of get a little taste of it again it's just kind of the Megaton as far as I can tell of Fallout 4 um so like the capital city kind of place where a lot of things are going on a lot of people to talk to Main Quests I actually don't think I've ever talked to this person Brahmin Meat big dumb got four legs and two heads I've I know Pli thanks now I guess we don't want to get too spoilerish but you know your character is quite ignorant about the world around them so talking to people in the game gives you there's a reason to do it it's valuable not only to get information and kind of expand the story in the war but obviously you can get Side Quests but you can also get um and I'll show you in a minute um we're going to say not",
            "start": 2656.84
        },
        {
            "text": "it's valuable not only to get information and kind of expand the story in the war but obviously you can get Side Quests but you can also get um and I'll show you in a minute um we're going to say not interested right now I'll show you what I'm talking about there are basically Side Quests and then there are tasks um so if you go to data you can go to Quests and so these are all my open Quests that I have but if you go down to Miscellaneous you then have like a bunch of different smaller things to do and you can only get these by really talking to people and engaging them in conversation uh so uh like give Sheffield a Nuka-Cola for instance is one of them and actually Sheffield's around here and I have the Nuka-Cola I bought it for him so let's see if I can find them um curious so Sheffield's right here if I talk to him um I should be able to give him the Nuka-Cola and we'll see what happens I don't know if he's like anything's going to happen at all so I got a little bit of experience",
            "start": 2715.44
        },
        {
            "text": "right here if I talk to him um I should be able to give him the Nuka-Cola and we'll see what happens I don't know if he's like anything's going to happen at all so I got a little bit of experience for doing it there you go Sheffield wanted a Nuka-Cola I found him one he's apparently a lazy piece of **** because he can't find his own all right so there's a little look at Diamond City I won't get too spoilery here for you the other the last thing I want to show you before we go um which is an addition I like can we get rid of the dog he's squeaking toys and annoying me I thought that's what Kevin was doing but apparently he was just betting 40 come here we'll go to Sanctuary U which is really one of the first places in the game you go to and this is kind of your settlement so you're in charge of the settlement they look to you for leadership and guidance and they also look to you for supplies and all this kind of stuff and I'm slowly working my way up to uh be able to better",
            "start": 2754.52
        },
        {
            "text": "in charge of the settlement they look to you for leadership and guidance and they also look to you for supplies and all this kind of stuff and I'm slowly working my way up to uh be able to better their situation um and it's doesn't seem like there's some it doesn't seem like there's a prerequisite to really do it at least in this very early portion of the game that I'm in um there is a Main Quest tied to doing some upgrades but not many all right so we're here and so here's my settlement and it's this is I won't get into like how you find this place or what this place is but um basically you have all these houses and you're going to be able to attract people to your settlement the more you build up and stuff like that so uh here I have like some water pumps that pump fresh water from the ground that's not radiated here I planted some crops Potato Plants, Melon Plants, Corn Etc and so on that I can have you know people look into um and the biggest thing you can do here is if I go here to the",
            "start": 2803.48
        },
        {
            "text": "not radiated here I planted some crops Potato Plants, Melon Plants, Corn Etc and so on that I can have you know people look into um and the biggest thing you can do here is if I go here to the Workshop when I hit transfer um I can basically drop all the junk that I found over here and you can see that so like as I was telling you before I found a Brazol Cleaner so it has acid antiseptic and fiberglass in it this Anti-Freeze has Cork and plastic and Screw, Asbestos has Asbestos in it which may be useful to buildings uh cement etc etc etc and so what you do with this is you go to the Workshop Bench and this opens up this menu that you can then walk around your town in and you have like different things you can do Structures you can like enhance your structures by Furniture, Decorations you can power things make Defenses so your shit's not attacked uh kind of develop Resources whether it's water or food like I showed you before um you can create Stores to give your people things to buy and you",
            "start": 2851.28
        },
        {
            "text": "things make Defenses so your shit's not attacked uh kind of develop Resources whether it's water or food like I showed you before um you can create Stores to give your people things to buy and you can Craft um and you can see on the top of the screen I only have five people in my settlement right now I have six food six water so that everyone's supplied a power of three which means that I can supply some electricity to some of the buildings my defense is very high so no one attacks me um I have five beds for those five people to sleep in comfortably um and I can build more beds to hopefully attract people in the future but what's important here right now is that the happiness um is 67 and going up so people are happy with the things the things I'm doing right now um and so I think this is actually a pretty cool addition uh to the game so right here uh I built like a small Generator that produces the power and I can theoretically attach that power to building and then start using Circuitry",
            "start": 2893.08
        },
        {
            "text": "a pretty cool addition uh to the game so right here uh I built like a small generator that produces the power and I can theoretically attach that power to building and then start using circuitry to put lights in and just and and just overall improve it um oops I didn't mean to move that so let's put this back where it was um if I go to structures for instance I can start like building wood structures metal structures doors fences miscellaneous Etc so let's see if we can increase uh and make this this structure better actually I don't even want to no there's like that's spending too much you know I'm not going to do it I'm I'm going to leave it up to you you guys to figure this out cuz I don't want to I don't want to spend too much of my too many of my supplies yet um so I mean in a nutshell that's Fallout 4 um again I'm early in the game I like it I think it's fun it's more Fallout nothing wrong with that at all um it has some problems for sure uh but it does many things right in my",
            "start": 2928.96
        },
        {
            "text": "that's Fallout 4 um again I'm early in the game I like it I think it's fun it's more Fallout nothing wrong with that at all um it has some problems for sure uh but it does many things right in my early going here I I'm very positive about I think it's a lot of fun I think you're going to enjoy it I hope this was a useful Taste of some what the game offers you know a limited taste I don't want to spoil too much of it for you um I think Greg will do his own Let's Play that's like further in the game he'll give you a little taste of like what it is like in the mid game as opposed to the early game it's up right now along with our review oh you're going to go up first I'm going up second no we're all going up at once all of our Let's Plays all three of our content's going up review your let's play my let's play all annotated and linked together at the end oh okay well there you go there you go so enjoy yeah go check out our review discussion Greg and I will discuss the game with you and",
            "start": 2972.2
        },
        {
            "text": "play my let's play all annotated and linked together at the end oh okay well there you go there you go so enjoy yeah go check out our review discussion Greg and I will discuss the game with you and or you know with each other and hopefully give you a little bit of insight into the game um to see if you want to buy it or not um and hopefully the Let's Plays kind of give you a little piece of or a little taste rather of what the game's like um so thank you for joining me for this let's play We Appreciate You uh come back for more uh youtube.com/KindaFunnyGames till next time bye and that's really the problem right is that Taylor Swift would never wear a helmet that looks that ugly you'd be like Taylor it really helps I don't think I can jump from in here but I'm going to try no okay oh there's an enemy nearby **** she'd be like I understand that it gives me plus nine defense I don't care and maybe in a role playing game as I role play as Taylor Swift I should say you know what Taylor",
            "start": 3008.36
        },
        {
            "text": "an enemy nearby **** she'd be like I understand that it gives me plus nine defense I don't care and maybe in a role playing game as I role play as Taylor Swift I should say you know what Taylor Swift Would we that but I'm I'm still hanging onto my roots here of wanting really good defense I need ptil I need it oh look who's back idolize it and worship it but have no idea what it is which I think is and this is where the storytelling that again this more passive storytelling is really **** cool in the game it's way more interesting to me than the main storyline which I think is is fine and interesting um I have I I have such obvious questions about it that I don't even want to say because I don't want to ruin the game the but there's like little things where I'm like you're looking for this thing how do you even know when you find it",
            "start": 3041.84
        }
    ]
}