{
    "id": 1313,
    "video_id": "Tjkn_lKqJHQ",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Portillo"
    ],
    "title": "Lovers In A Dangerous Spacetime - Kinda Funny Plays",
    "description": "Greg and Nick put love first to save the universe.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1446483603,
    "duration": 1028,
    "transcript_chunks": [
        {
            "text": "everybody Welcome another Let's Play here on YouTube.com/KindaFunnyGames. I'm Greg, this is Nick, and this is Lovers in a Dangerous Spacetime loading. Here's one of those things, Nick, that I've heard of this game before. Yes, you and Tim played it at a PAX. I think one of the things, uh, you've never shut up about it. I haven't seen any of the game though. I don't know what the game is. I don't know what we're jumping into, so you got to tell me what's up. Uh, what, it's two players, um, what in God's name you think you're doing? Like he wants to play. This is how excited he is about this game. He sees himself on my Xbox. What are you doing smelling all sort of things? You know, his life must just be one roller coaster after another, confusing ass day after confusing ass day. Um, I don't know a whole lot about this. All I know is it's two players co-op. Um, you play, you're these two little space people, uh, in a ship and you have to cooperatively, uh, play with each other to move the ship and fend off enemies. Luckily,",
            "start": 0.12
        },
        {
            "text": "all I know is it's two players co-op. Um, you play, you're these two little space people, uh, in a ship and you have to cooperatively, uh, play with each other to move the ship and fend off enemies. Luckily, we cooperate all the time. We do. We're really good at it. So press A. I'm going to be just at a guess, just be guess. I don't want her getting all pissed off of her chos. I would game over. Whoa, that's me. You got a super Superman. Superman. All right, cool. So we're lovers, okay, obviously, just like real life. Uh, we're on a spaceship together. Be this little fat guy. Oh yeah, it sounds good. I'll be this Lovey Moo. All right, so we're on a spaceship. We're on a spaceship together and we just have to negotiate the Sharky Waters that are space, the murky waters that are space. I like the Sharky Waters. Sharky Waters. Um, so you'll see in a second here, we're going to start. We're going to be on our spaceship and again, you know, I have a very, uh, cursory knowledge of what we're trying to achieve. Long ago, when a far",
            "start": 39.4
        },
        {
            "text": "um, so you'll see in a second here, we're going to start. We're going to be on our spaceship and again, you know, I have a very, uh, cursory knowledge of what we're trying to achieve. Long ago, when a far away future, super smart scientist built a machine to harness the most awesome force in the universe, love. You welcome. You did this. Yeah. Oh wow, that's a good job. With the power of the Ardor Reactor, explorers took to the stars, uniting all the peoples of the Galaxy. Seems like a good feature. So those are some of our peoples there. You see them. We were united in love. All were protected by the League of Very Empathetic, empath, empathetic, empathetic rescue. Lost it 'cause I got caught up saying that word out loud 'cause it sounded weird when I said it. Empathetic, empathetic. But disaster was brewing. Mhm. Of course, there's always an evil villain. I don't trust his bunny or that Frog. We got an error in the Exo-Matrix allowed the dark force of anti-love to seep into our reality. Damn it. So there's love, Greg, and",
            "start": 83.24
        },
        {
            "text": "always an evil villain. I don't trust his bunny or that Frog. We got an error in the Exo-Matrix allowed the dark force of anti-love to seep into our reality. Damn it. So there's love, Greg, and there's anti-love. I know, you know, the explosion ripped a hole in the Spacetime itself and the Ardor Reactor was blasted to pieces. How's that? Confident water. Good. More. All our little dudes, they're pissed off. Oh no, people are taking them. Oh no, he's got, it's like Dr. Robotnik. Yeah, they're getting trapped here. He's going to be left for dead. They're not going to feed them or anything. Well, that's part of what we got to go do. We got to go save. We got to rescue. Now with anti-love spreading across the Galaxy, the fate of our Spacetime seems decidedly unlovely. We're save the day. Yeah, but they don't know who they're messing with 'cause you and I, my friend, I'm Lovey Ma and your Lovey Moo. Look at this guy. Grid like this. Oh no, suffering immensely gone. But the Prototype ship in my, we get it. It has power. Yeah, know what I mean? We",
            "start": 124.72
        },
        {
            "text": "with 'cause you and I, my friend, I'm Lovey Ma and your Lovey Moo. Look at this guy. Grid like this. Oh no, suffering immensely gone. But the Prototype ship in my, we get it. It has power. Yeah, know what I mean? We, we read faster. And the bunny talks. Bunny to ship. Bunny to ship. The Prototype ship was cut off in the west ventricle. But if I can just get a signal, very, very dramatic so far. Yeah, right. He really building tension. I bet he gets the signal through. I hope so. Otherwise, we're not going to have anything to do for the next. Alert, alert! Love HQ is under attack. Here we go. There we go. So here's our little ship and now we got to go. We got to go around. Familiarize yourself with this. So part of these control the ship. Part of them control the blasters. You go up. Probably they all control the blasters, right? We don't have the little, uh, ship, uh, steering wheel, steering wheel yet. But the catches, there's only two of us. Yeah. So at any given time, one of us has to have the blasters. Oh, I got to get, get over there. Get over",
            "start": 181.0
        },
        {
            "text": "the little, uh, ship, uh, steering wheel, steering wheel yet. But the catches, there's only two of us. Yeah. So at any given time, one of us has to have the blasters. Oh, I got to get, get over there. Get over there, Greg. The ship is built by a madman. There you go. You can curve the bullets like wanted. If you, if you shoot constantly, swing. Oh, look at you. Look at the brain. We can almost get them. There's only like one very, very small that people could get through. Uh oh. Oh, Jesus. Oh, here we go. Here's our little control station. We got to shoot that bad boy. You going to get it? I'm trying. It's just I'm, I, I can't use the D-pad. This is a D-pad game for sure. You going shoot it? Shoot better. Maybe you got to shoot the little bottom one. Come on, bro. It's team effort. That's fucking team one. There we go. Boom. Now we got a shield. Okay, so we have so far. I'll monitor the, I, you got it. You got, you're on it. Okay, the shield gets a little, obviously, we can power it up. I think it gets a bit bigger. Let me get down here if you're",
            "start": 241.32
        },
        {
            "text": "shield. Okay, so we have so far. I'll monitor the, I, you got it. You got, you're on it. Okay, the shield gets a little, obviously, we can power it up. I think it gets a bit bigger. Let me get down here. If you're not hearing it, the music is freaking nasty right now. Kevin, make sure they hear. Give me some of that nasty. Oh no, how I get over there, Nick? The shield won't hold forever. Won't. There's a little, make him a move. There we go. I understand what you needed for me. All right, weird that I, weird that I can't use the trigger. What I shoot? I mean, I'm just a bitcher, little bitcher, mother. All right, now I'm going to take this out. Here we go. Oh, I the wrong thing. I'll use this thing, Nick. That's the dead. That's a dead end, Nick. That kills us. There you go. Go up. There you go, Nick. Now we're out. Now we're out, Greg. Now the adventure begins. This is just the part where we discover the shit. Now we, as small children, have to learn some life lessons. The, the, the deal here is if I'm about to bang into something, I need the",
            "start": 295.88
        },
        {
            "text": "adventure begins. This is just the part where we discover the shit. Now we, as small children, have to learn some life lessons. The, the, the deal here is if I'm about to bang into something, I need the shield over there, right? Really? Yeah, 'cause it'll fuck up the ship. Here, go over there and see if the shield works against the walls. Oh, it does. Oh, cool. Good. Smart, smart, smart. Yeah. Now I need you to, I'm going to pilot. Uh huh. What I need you to do, bro, is shield. See if we can break that, that lock. Can you jump onto the, uh, oh, oh, you got to shoot it. I thought, no, you can't. Are you sure you just don't fly your ship into it? Uh, I don't think we're supposed to fly the ship into it, but we can try. No, I believe you. You play more than me. No, I think we just got to go up. Hey, you need to shut up, Kevin. He looks like a bunny. All right, now I want you jigging on the spot with those rockets there, son. Oh, here's our first little guy. Shoot that too. Yeah, I think you got to shoot that. Come on, get me. Okay, stop. Yay, we",
            "start": 353.24
        },
        {
            "text": "a bunny. All right, now I want you jigging on the spot with those rockets there, son. Oh, here's our first little guy. Shoot that too. Yeah, I think you got to shoot that. Come on, get me. Okay, stop. Yay, we got him. Keep getting so close to that damn thing. Oh, that's my logo. Oh, look at him. Unlocked the door for us. Oh, okay. So, so the more we save, the more gates we can unlock. It makes sense. Yeah. Now you might be saying, hey, what, why can't we have the threesome that would make the game a lot easier? That's why you can't do it. But that would make the game a lot easier and that's also not lovers. That's greedy people. Threesomes are for greedy people. They really are, man. Lovers are one-on-one. They're more for your 20s and we're not their 20s anymore. As I believe it was George Michael said, sex is best when it's one-on-one. I think did he say that? Yeah, good for him. All sex is what something 'cause he's had a lot of sex life. Yeah, but not by, but he's had a lot of one-on-one sex. By the way, I want you guys to know that",
            "start": 397.44
        },
        {
            "text": "one-on-one. I think did he say that? Yeah, good for him. All sex is what something 'cause he's had a lot of sex life. Yeah, but not by, but he's had a lot of one-on-one sex. By the way, I want you guys to know that, uh, piloting the ship, not easy. You're doing awesome job. Okay, okay. I'm doing the best job anyone's ever done at it. Got this 40. God damn. Yeah, it's, it's a little less intuitive. You don't actually have to hit anything. You just kind of go up to them because we're going to get into the shit here soon. What is that? That's a power blaster. I don't like the looks of this. So if you get, oh, oh, oh God, are you working the power blaster? Who's got the power blaster? Nobody. I got Shield Man. Shield it. God, Nick, eat my blaster, you little shits. Good job, Greg. You're doing a great job. We, we got to, I, I assumed a little bit on that, that where we were going to fall together. I'm sorry. That's okay. This is, this is what power blaster is the one to use. This is a team building experience. Well, eventually, yeah, as we level that up,",
            "start": 442.12
        },
        {
            "text": "that, that where we were going to fall together. I'm sorry. That's okay. This is, this is what power blaster is the one to use. This is a team building experience. Well, eventually, yeah, as we level that up, it'll just be a gigantic stream of awesome. But right now, yeah, it's like a cannon is very powerful, but you have to time it just right. Yeah. Oh, does it? It always moves on its own. You hit it and it just goes. Does that make sense? Kind of. I think. Well, you don't, it's like a one shot. It's a one shot blaster. So, oh God, we got a bogey. I'm going to be Shield Man. You got it. You got it. You got him. You got the, you want to try the blast? Jump on the blaster, right? No, I know. I like it. I was communicating, letting you know what I'm going to do. I like that. Yeah, the blaster, you just pull it. It kind of goes, but it, it goes in an arc. So you have to make sure that if there's, you know, you're pulling it at the right time there, the right time there. Where's the escape? All we got to get some more escapes. We need five Space",
            "start": 503.24
        },
        {
            "text": "in an arc. So you have to make sure that if there's, you know, you're pulling it at the right time there, the right time there. Where's the escape? All we got to get some more escapes. We need five Space Buddies. Story of my life. Yeah, you're telling me, brother. My life. There's one. There's one. You want me to get him? Yeah, please. Make sure we don't bump into it. Uh oh. Oh gosh. Oh, go. I'm, I'm protecting the butt. You get the face up there. You can shout out if you need me to swing the shield or something. You're good. Just keep. Well, last time you got shot there. I just saw you get shoot, got shot. Well, it's not an exact science here. Okay. Want you to know that. Just let you know that I saw you get shot. Oh, oh God. Oh, oh God. Oh no. Oh no, no. Oh no. Oh no. Yes, Mr. Bunny, get off the mama leg. Okay, okay. I'm going up. You go down. Got it. Oh God. Oh God. What does this do? That now I'm not quite sure what that does. All right, good. It looks that's your map station. Use it to map. Okay, let's map it out. Let's see what happens. You're Kirk. I'm",
            "start": 540.52
        },
        {
            "text": "oh God, oh God. What does this do? That now I'm not quite sure what that does. All right, good. It looks that's your map station. Use it to map. Okay, let's map it out. Let's see what happens. You're Kirk. I'm super. I'm just all I'm doing over here is running the shield. All right, okay, gotcha. Okay, there's a little area. There's a question mark over there. The only dire we can go to. There's cloudy areas down there. Fog of War. We haven't gone there yet. The, uh, the map doesn't really do anything in. Doesn't really, uh, doesn't really do anything. Maybe they should connect to the internet there. How you like it so far? It's good. I'm enjoying myself. What are you going to say? I like, I think I was drawing to this for the art style 'cause you know, pink, fuchsia, my favorite color. Yeah. Wait, going wrong way here. Oh, oh God. Oh God. Nick, no, Nick. Want us? They don't want us go that way. No, they do. You just got to, you got to thread the needle there, Chief. You got, I got to go back to the map. Let me go back to the map station. See, oh,",
            "start": 612.72
        },
        {
            "text": "God, Nick, no, Nick. Want us? They don't want us go that way. No, they do. You just got to, you got to thread the needle there, Chief. You got, I got to go back to the map. Let me go back to the map station. See, oh, Jesus. You just got to thread the needle. They want us to go over there. Okay, let me show you how to do it. Yeah, you want to get in? Yeah, you want to switch? This is the navigation portal up here. Yeah. And how do I spin? I spin like this and I hit A to shoot it, right? Yeah. X. No. So just like my guns. See? Holy crap. First try. All right, you're driving from now on. Oh, look at that. Let's shoot that little thing. Okay. Oh no. Oh, it's locked in. It's behind. We get. How did I not see that? Oh no. Oh no. Oh no. I got him. Don't worry, little friend. Oh, you got sucked in. Battle Stations. Oh, you think you want some of this? You think you got what it takes? Nothing. You're some ugly purple beetle. We hate you, purple beetle man. I feel like they should, um, send this game to companies for team building exercises. You know what I mean?",
            "start": 658.12
        },
        {
            "text": "you got what it takes? Nothing. You're some ugly purple beetle. We hate you, purple beetle man. I feel like they should, um, send this game to companies for team building exercises. You know what I mean? Yeah, we could just go to companies and like bring this game and then they would think like, uh, like you guys made this awesome game. Well, we going to say we made it. We just have to introduce it to him. We're going to take credit for. You go to BFI. You're like, hey guys, you need to learn how to be better garbage people. There we go. Got you. I got you. Ah, some map data. Now you can pinpoint the space bunny locations. I'm, I'm going to, you got it. I'm okay. I'm go back to, I'm getting this back out. We're going south. So no surprise, the space bunny is in the, uh, other area that we're not in. But I'm glad we confirmed that. It's nice to know kind of where you're going. You know, I know how to get home, but occasionally it's nice for people to like reaffirm that. Sure. You know, it's kind of like when you're always",
            "start": 723.6
        },
        {
            "text": "that it's nice to know kind of where you're going. You know, I know how to get home, but occasionally it's nice for people to like reaffirm that. Sure. You know, it's kind of like when you're always driving to Kevin or Tim's house. No idea how to get. And you're always like, I know how to get there. And then you eventually ask me 15 minutes in the ride if I can open up map. It's now, is it south there or is it south? Is it here though? It is. It is. It is. It is. It is not six of one, half a dozen of the other. It really is not this time. Not everything, not everything can be. Wait, hold on, hold on. That security system's gone haywire, Greg. I mean, you get on this. Let me see if I can use. No, no, no, no, no, no, no. You got to use the shield. You got to get on the shield and angle it in. Look at you. I'm bringing us in straight like this. You're such a good gamer. I try. You know what I mean? Hold that. Now get ready. Get. There you go. There you go. Throw me some blocks. Be my offensive line. Throw me some blocks. Hold on. Throw me the",
            "start": 775.16
        },
        {
            "text": "like this. You're such a good gamer. I try. You know what I mean? Hold that. Now get ready. Get. There you go. There you go. Throw me some blocks. Be my offensive line. Throw me some blocks. Hold on. Throw me the south. You need the south, Nick. South blocks. Oh, fuck. Thank you. Thank you. Good job. All right, just hold on. I was I blocking? I need you to blow up that heart. I'm going to drive right into it, aren't I? Isn't that good enough? Yeah, good for you. Good for you. Good for. Keep blocking, Nick. There you go. Good for you. Now I need a block. There you go. South block and coming up. Yeah, this man, you got nothing. Oh no. Oh no. I lost for one second. Stop talking shit and block. This is going to be your hardest challenge yet. Now. Okay. Yeah. All right, good, good, good, good, good, good. Crushed it. Throw you some, some reverse thrusters there. I like this game. This is fun. It's fun, right? It gets chaos. It gets crazy. Yeah. To the point where you have to like, you upgrade your shield. Oh, we five Buddies. They unlock that. They go, oh, now we get",
            "start": 815.64
        },
        {
            "text": "I like this game. This is fun. It's fun, right? It gets chaos. It gets crazy. Yeah. To the point where you have to like, you upgrade your shield. Oh, we five Buddies. They unlock that. They go, oh, now we get to go through the, the big space heart in the sky. I'm going to take us this way and see this is the, oh God, shield me, Nick. Shield me, Nick. I got you. Oh, Nick, no, Nick. All right, I'm abandoning my, I need you on here. I'm getting up. No, there. Get on that big blaster and just and and mess with that thing. Okay, let's show the fans what they paid good money to pay. Get it. Get some. Get some. Get some. So I have no, I once I click, oh, you just click it going. All right, now I need you on the, uh, that top blaster. We get us up there. Can you hit that little button? We're going to have to. Wrong one. You got it. See, you want to do this? No, you got. Oh, I got, I got to do. Where we going? Give me the map. Map is like this. That you got to go up and then you ready? Yep. I'll go get another shield. Oh God, Nick, go. Oh, I keep hit the wrong",
            "start": 867.6
        },
        {
            "text": "to do this. No, you got. Oh, I got, I got to do. Where we going? Give me the map. Map is like this. That you got to go up and then you ready? Yep. I'll go get another shield. Oh God, Nick, go. Oh, I keep hit the wrong thing. Get in there, you little shit. All right, I'm sorry. I shouldn't talk that way. My lover. Well, you weren't talking to me. I talking to myself. But he is my lover. She's an easy lover. See what happens if we go to ramming speed. Oh God. Oh God. It's so easy to lose focus 'cause then I see what you're doing and I'm like, don't worry about what I'm doing. You worry about what you're doing. Oh no, ramming speed doesn't work. Does not work. Oh, you know, you don't, you just hold the button down. There we go. You're almost there now. Perfect. Nailed it right into the heart. We won. That's it. That's the whole game. That's the game. No, that's it. Oh wow. No, it gets a lot more crazy than that. But that gives you a little taste of Lovers in a Dangerous Spacetime. I like it. I like it a lot. Yeah, that's a lot of fun. Goofy fun little art you made.",
            "start": 922.72
        },
        {
            "text": "no, that's it. Oh wow. No, it gets a lot more crazy than that. But that gives you a little taste of Lovers in a Dangerous Spacetime. I like it. I like it a lot. Yeah, that's a lot of fun. Goofy fun little art you made. Thank goodness the universe has become unstable. Fabric of time is shifting. Yeah, we got it. Just okay. All right, cool, cool, man. Well, ladies and gentlemen, what do you think of Lovers in a Dangerous Spacetime? Let us know. And also vote for Nick and I as cutest Kinda Funny couple. Do it in the comments below. Just say Nick and Greg are the Kinda Funny cutest couple. And then Colin and Tim and Kevin will see it and they, I don't like that. And of course, subscribe to this channel so you don't miss any of our Let's Plays or PS I Love You or Kinda Funny Gamescast or unboxings or whatever stuff we put up.",
            "start": 981.64
        }
    ]
}