{
    "id": 1363,
    "video_id": "veizg_7-1Xw",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Adam Kovic"
    ],
    "title": "Fallout 4 Ugliest Character Creation with Funhaus's Adam Kovic - Kinda Funny Plays",
    "description": "Adam Kovic comes to Kinda Funny to help Tim make the ugliest Fallout 4 character ever. \n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1448038802,
    "duration": 1481,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome back to Kinda Funny Games. I'm Tim Gettys, and this is Adam Kovic of Funhaus. Kinda Funhaus continues. Very sounds very dramatic. Um, so a couple things off the bat. I'm drinking coffee out of a green cup. Yeah, we're using a green screen. I mean, oh, so that's gonna be fun for everybody. Mine's GameOverGreggy, but you can't see it because it's on my side if only in there. So what are we gonna be doing today? Well, you told me you don't like Fallout, so I said we should play Fallout, but only the character creator. Yeah, you guys mentioned an old friend of yours. We have an old friend. His name is Galvatron. You might have heard of him. One Colin Moriarty and Nick Scarpino back in the day in Bloodborne and made a certain Galvatron. I hear the Galvatron's distant cousin from the future's past. Sure, whatever. Know what the hell this happens, but yeah, I don't want Bloodborne takes place. I don't have this takes place, but somewhere in the future's past, Galvatron's distant cousin, what's his",
            "start": 0.03
        },
        {
            "text": "future's past. Sure, whatever. Know what the hell this happens, but yeah, I don't want Bloodborne takes place. I don't have this takes place, but somewhere in the future's past, Galvatron's distant cousin, what's his name again? Uh, we can just call him Calvatron. Calvatron. Yeah, yes, he's out there. So we got uh, so we're gonna make him. We're gonna make a beautiful man. Yeah, they're in do. Okay, I was like Fabio. Look, so what I like about the character creator, so you can use grab individual pieces and you select it and then you do whatever you want. So like we can scale his giant forehead or make it tiny. I don't know what a big on you for the for it. Let's go big. Go big. I like big forehead. She likes strong cheekbones. Yeah, we can also do a woman too if we really want to, but I don't know. Let's start with the man. We'll see where things go. Can you make it and then switch sexes? Mm-hmm. Okay, yeah, so he'll be standing in the background here. I always like doing the same thing. How do we want to scale these",
            "start": 41.94
        },
        {
            "text": "man. We'll see where things go. Can you make it and then switch sexes? Mm-hmm. Okay, yeah, so he'll be standing in the background here. I always like doing the same thing. How do we want to scale these eyes? Oh dear God. Oh, that's what you look like. That's Galvatron. Yeah, we can do that. We can one-up it too. He's intrigued. He is always intrigued. And let's see, yeah, you can pick the eyes. Let's get into the minds. You can pick a type to said that dude. It they don't have a lot of things. Say there we got like big eyes, prominent. Yeah, definitely prominent eyes. And I think there's a way to do scale. Yeah, that's bad. Give them little tiny eyes. Yeah, look, I'm gonna **** Avatar. ****. Oh gosh. When we can change the nose type. Let's see. I like the pug nose personally. Okay, alright. I already get in some weather. Just creepy. Here's the thing, that gorgeous mane of his, you know, it's like even though his face looks weird as ****, like he's gonna still impress some people in whatever we want though. Oh man.",
            "start": 85.02
        },
        {
            "text": "creepy. Here's the thing, that gorgeous mane of his, you know, it's like even though his face looks weird as ****, like he's gonna still impress some people in whatever we want though. Oh man. It looks like we're cycling through. Well, not anymore, but for a second, just look like they're like two years of Troy Baker's like just go and do all of his beautiful **** haircuts. I miss Troy. I I like the beatnik hair. Okay, I don't know if there is a purple hair. Oh man, it looks like a white god. I don't know that means Zeus. Zeus. I don't think you do purple on four. That's cool. Yeah, was that it? Was a dad. Alright, like jet blue. I like the white, but there was like a weird. Yes, that's kind of kind of. I liked the white better. You're like, just let's go bleached. Oh yeah, we can facial hair too. Alright, then we're getting we're getting some good places. I think if we just do like mutton chops or something about. Oh, that's that's not bad. Yeah, well, we might come back to that one. Do we do facial hair for this guy?",
            "start": 148.92
        },
        {
            "text": "getting. We're getting some good places. I think if we just do like mutton chops or something about. Oh, that's that's not bad. Yeah, well, we might come back to that one. Do we do facial hair for this guy or now? I mean, this is the distant cousin from the future with us. This looks like a future man. Yeah, okay, we're getting there. The problem is he's too beautiful. Yeah, we need to tone the beautifulness down a bit. Um, paper got bottom lip. I like it. And you could actually James just the bottom. That's really cool. Oh yeah. Oh, why is it looks like a stroke? Also, you can twist there. I was like Mario 64. Yeah, it's weird. See, let's see what I can. I know you can change the size of this too. Oh, it's chinny chin-chin needs to be a little bit bigger. I agree. I see. Wait, that's sharp. Are there we go. There we go. Wait, haha. How in can you go? Oh, that's a great question. Let's wait. Oh, what's happening? What did I do? It's not human. Oh, what's it in and and and that's not - in those like a nutsack. That's you got scrotum that",
            "start": 201.77
        },
        {
            "text": "how in can you go? Oh, that's a great question. Let's wait. Oh, what's happening? What did I do? It's not human. Oh, what's it in and and and that's not - in those like a nutsack. That's you got scrotum that going. Oh, I like that. And then I think we can think we did like he looks like a **** Moon God right now. Right here. I am the God of the Moon. He's too beautiful. You're right. He's a Moon God. What big lips or small lips? Ah, do we do one big one, one small? Yeah, I'll just gonna get stung by a big nice. Yeah, you look kind of creepy. Umm, yeah, tiny without any tiny mouth. Big bottom lip. No, I was like big mouth. Yeah, why not? Let's see. It's so hard to do that controller, mouse and keyboard. Everything with the mouse can get really in there. Mm, well, yeah, so that's the unfortunate tiny ascertain go bad. Fortunately, what about the color? You can change the color. We can. Oh, well, that this is just a skin. Want to make him look like almost like he's sick. Like you can do like skin blotches and stuff. Okay, so bronze looks",
            "start": 250.29
        },
        {
            "text": "about the color. You can change the color. We can. Oh, well, that this is just a skin. Want to make him look like almost like he's sick. Like you can do like skin blotches and stuff. Okay, so bronze looks good. That gives that nice sickly look that we want on it. Wonder if we can give them. Let's see, different eyebrows. Yeah, what's happening? It almost doesn't matter what I do. It's like different level of fur. Like Bushido. That's that's good. Looks the same. Like looks it was all just spray-painted. What happened? What the hell? Or maybe those were aged lines or something. Like I said, it's let's see. Oh, thing. I don't what is happening? I want to just mess with this brow a little bit. Oh yeah, get that real close together. Oh God, it's the worst. It's the worst thing in the world. He's so he still looks too damn cool. Yeah, I think it's the mutton chops. I never thought I'd say that. Have the mutton chops for making them look cool, but that those are what give him his Moon God powers. Yeah, Moon God. He's going vacation. Oh, oh.",
            "start": 314.16
        },
        {
            "text": "I think it's the mutton chops. I never thought I'd say that. Have the mutton chops for making them look cool, but that those are what give him his Moon God powers. Yeah, Moon God. He's going vacation. Oh, oh. Is kind of on to the game and I can see that. Yeah, we need to get freakish. Oh my, kind of mature. I am. They're looking at the bottom in triangle. Just says sex. Oh my car. Oh, it's that the nod fun sex. The beautiful thing is, so then you can put as many. I thought that was blood. Yeah, any blemishes. They all stack. Mmm. So we can just keep putting. We might as well put them all on, right? Well, if you want to make the most hideous creature. No, no, man. I mean, look, everyone's beautiful their own way according to God. Ooh, let's take off that cheek blemishes. Seven. Really? Yeah, take off seven. Take off seven. Too far. That's just too fun. Okay, yeah, hey, I don't want to offend anybody. Good, good. Oh God. Ah, ha ha. Dude, the scrotum neck's getting a little nasty. This looks like a story Nick Scarpino told me once you had to fix",
            "start": 367.17
        },
        {
            "text": "just too fun. Okay, yeah, hey, I don't want to offend anybody. Good, good. Oh God. Ah, ha ha. Dude, the scrotum neck's getting a little nasty. This looks like a story Nick Scarpino told me once you had to fix some things, but there it's all good now. There we go. And here's some sun splotches because he's since he's on the Moon, so he yeah, he just says he's on the Moon, so hoping pretty close to the Sun. Yeah, no, it's from what I hear. I don't know. We need to need to do damages on him. Yeah, that's just it's just unfair actually. Yeah, I get. Well, maybe we showed him a fat lip, black eyes, broken nose, 1 rounds. Yeah, but somebody Ramsey women. Damn. What else we got? Hey, there's getting one of those there. Yeah, he's beautiful, strong. Okay, um, let me go back to the face. So we need a I think we need to like get these and cheekbones out a little bit. Just yeah. Okay, good. Yeah, that it's horrible, sir. Yeah, now he looks like one of those thumbnail you see 'em in YouTube videos like when plastic surgery goes wrong. Wow. Too good. Oh.",
            "start": 416.47
        },
        {
            "text": "out a little bit. Just yeah. Okay, good. Yeah, that it's horrible, sir. Yeah, now he looks like one of those thumbnail you see 'em in YouTube videos like when plastic surgery goes wrong. Wow. Too good. Oh, there we go. This man. Yeah, this looks like a gorilla. Well, Moon God gorilla. He's got a girl. Obviously, that's my new. It's a new Smite character. New life goals. Let's see. Like like going out. Yeah, man, you know, I was worried when you're first making it that it wasn't gonna look enough like Calvatron, but now I'm starting to feel good. Yeah, I like the end. I like the nice little hourglass face he has going. It's like he can't really decide which way his face wants to go. I often can't decide if I want my face to go either way. His whole head. Those eyes. Although, yeah. Oh yeah, there we go. This I like up and out. Up and out. Yeah, yeah, yeah. Is it kind of a white? Looks like a ****. Damn. Kevin's just over here on the side just showing us pictures of what it looks like as we have what he would look at that knows who does",
            "start": 471.31
        },
        {
            "text": "yeah, yeah, yeah. Is it kind of a white? Looks like a ****. Damn. Kevin's just over here on the side just showing us pictures of what it looks like as we have what he would look at that knows who does some damage with that with the ladies. I was married. He's good. Mmm. He's taken balmy news. You know, get him in there. Just cuz you're married doesn't mean you're not, you know, you'll be diving. Yeah, this guy's constantly hit ****. You want to be my new life? I know I sound like a deaf person to you. Oh, he also has ears. Forget about that. Not that I don't know if we couldn't like capitalize on those. I mean, we know they're there. As long as we know this, that's really what matters. And then there's this. We can mix with Mrs. Garlic. Love that move. Get right in that scrotum. Already to the channel. Oh, oh God. Oh, I gotta grow. He's like, that means he likes you. It's like imagine her just watching all this happening. Oh my God, it's like, huh, they're so chisel. You're so chiseled. What does this dip? Oh, there we go. That's",
            "start": 536.79
        },
        {
            "text": "gotta grow. He's like, that means he likes you. It's like imagine her just watching all this happening. Oh my God, it's like, huh, they're so chisel. You're so chiseled. What does this dip? Oh, there we go. That's what we want to mean. Drinking the real skinny. Maybe I gotta say the character creation options in this game. Yeah, yeah, they might be too good at making characters actually look good. So making **** up characters isn't as crazy as other games. People have made some horrid creatures. Let me actually, I'll just I'm gonna remove the facial hair real quick just so we kind of know what we're working with. Oh, oh, you can mess with the hair. ****. What? I'm learning things every day. You can actually adjust the hair. My God. No, he's long dead. Oh my Lord. Yeah, now it looks like don't seem. Oh, wait, what is this? What do you think it can roguishly handsome? What are these options? I think it just under his face. They're somewhere in there. And I would like to get to your mutton chops, sir. Facial hair. There we go.",
            "start": 592.02
        },
        {
            "text": "What do you think it can roguishly handsome? What are these options? I think it just under his face. They're somewhere in there. And I would like to get to your mutton chops, sir. Facial hair. There we go. We'll just go to was it dude enough? Okay, I mean, this is the man beneath the beard. Yeah, so we can okay, play with these a little bit. What you want tiny ears? Like ten years? Is it come on? Oh, oh, hello handsome. He must be the most confident human being. And well, he's not even been. He has a Moon God, but he just wakes up in the morning, looks in the mirror, eat some of that moon cheese. Oh, oh, one tiny ears. Oh yeah. Oh God, I feel like you just pierced into my soul for a second. Like he doesn't made eye contact and he's just like like I guess I can't. Huh? Someone say something. Okay, those are those are beautiful. Assume you still mess of this forehead a little bit. Um, feelings going though. We wanted out. Yeah, definitely. I clean up pretty nice. Yeah, like we're running out of options here. He just looks like he was",
            "start": 656.66
        },
        {
            "text": "assume you still mess of this forehead a little bit. Um, feelings going though. We wanted out. Yeah, definitely. I clean up pretty nice. Yeah, like we're running out of options here. He just looks like he was in a car accident here. Uh, like some Attack on Titan ****. Oh, that's right. Oh God, I was looking a lien or reject. That's my that's that's my handsome guy. Cheekbones back. Elmo. Oh God, that's horrible. Oh, just it looks like it hurts. Like I can like just I just want to throw a lemon juice on it and see what happens. It's like a snail. That's salt. Oh, okay. Oh, I like down. Yeah, I think just gorgeous. Um, I don't know. I mean, are we okay with this or do is there what it? We don't have more hair and stuff. You know what? Let's go through the hair. Let's see what we got. Oh, what looks good with our boy here? Oh my God, his face looks just so depart for dead weight. We we agreed on small lips. Mmm. What happened area? I'm liking a look. This is what I remember my boy Calvatron looking like this. I think we can do",
            "start": 715.52
        },
        {
            "text": "God, his face looks just so depart for dead weight. We we agreed on small lips. Mmm. What happened area? I'm liking a look. This is what I remember my boy Calvatron looking like this. I think we can do more with this, right? Yeah, just sink it back there. Just I want I wanted to look at the skin sitting right on his scum mouth. All types gold. I mean, yeah, there we go. Yeah, one more droopy. Yeah, chin is I feel like it the chin could go. Oh, okay. Oh, there we go. We've hit it. Oh, once I sort of glitching and do itself. Oh, oh, oh, I know what it talks. How does it look like an old fish? It rotates it. Well, it's like, oh, breathing and pulsating with its own life. What is happening? That's funny. That's a strong chin. Yeah, man, I love you. It doesn't play droopy. Oh, I really. It's like a sad clown here in **** when they talk about themselves. I don't know what to do. I think I guess it's just moving at this point. Yeah, I love our son. There we go. Oh, oh ****. Ah, okay, yeah, I think now this is good. Oh, this is good.",
            "start": 779.36
        },
        {
            "text": "talk about themselves. I don't know what to do. I think I guess it's just moving at this point. Yeah, I love our son. There we go. Oh, oh ****. Ah, okay, yeah, I think now this is good. Oh, this is good. Oh no, I got this far. Like I'm impressed and I'm very different. It's like a night of drinking where you just say, okay, I don't know how I got here. Let's go through the hair now. Oh yeah, well, also I was gonna say, is he look creepy as a big guy or do we want to just make them like skinny? Yeah, yeah, now let's get on God's sake. Move, woman. Make way for beauty. Okay, hair. Where's the hair? So, oh, there's so many options. Oh, he just looks like a corpse. Yeah, that's why I want to keep me cool here. Yeah, give him that like a pompadour. The way go up a bit. The urban Ranger. Like that. And I was good. It was it way. There's nine to five. But and maybe make me look like an anime character. Okay. Oh my Lord. Haha. There we go. It's David Lynch's nightmare. Okay, and then so no facial out. There we go. Oh, now in total, it's a",
            "start": 850.07
        },
        {
            "text": "there's nine to five. But and maybe make me look like an anime character. Okay. Oh my Lord. Haha. There we go. It's David Lynch's nightmare. Okay, and then so no facial out. There we go. Oh, now in total, it's a droopy. I want something that kind of hangs like a big man shoe. Maybe. Oh, I don't know. I just don't know. The more I look at it, the scarier it becomes. The way go on to the I like that one. Yeah, he's a Hollywood. We're okay with bleach white. Yeah, okay, sounds good. Hi, this is good. Okay, leave that. Leave the wife as is. Mm-hmm. Okay, go to the body. I'm from character. So this is how do you zoom out? No, you have to do the whole stupid tutorial now. Where do you want to do the woman? Cuz I think I'm past it. Oh, so could we just change that into? Well, if you would have been in the background and then we would have no gone. I would have swore you can save a woman for another day. The same. Should we end the day or should we? I can get us. You can fast-forward through all this bullshit. Is we just have to do like the",
            "start": 928.1
        },
        {
            "text": "gone. I would have swore you can save a woman for another day. The same. Should we end the day or should we? I can get us. You can fast-forward through all this bullshit. Is we just have to do like the dumb tutorial part. Hey, hon, we should take Codsworth to be serviced soon, don't you think? Well, then what were you do? I just went you do the opening cutscene or like as I get either you see the person doing the switch. Ya go. Thanks, cuz with. So you have to wait for this guy came across the street. He'll come up and he'll be like, hey, your Vault Boy. Yeah, he's got to deal with this ****. Mom drinks so much. There we go. Grognak the Barbarian in the jungle of the bath babies. My favorite. Come on, love me. Don't be. Yes, we're in the PC version. You can zoom out in the beginning. This guy's coming over. Oh, my favorite thing is just being a dick cuz no one will call you out for just like knocking everything over. Come on. Yeah, like I won't let you just like jump on the table. You just like those. Everything's like",
            "start": 995.75
        },
        {
            "text": "favorite thing is just being a dick cuz no one will call you out for just like knocking everything over. Come on. Yeah, like I won't let you just like jump on the table. You just like those. Everything's like physics-based. Yeah, knock everything over. It's my baby. That's horrifying. Or baby the beast. Is there just a robot just like I don't know with freaking fire? You're worried about the robot. You see? Well, that's true. There is. There's always Calvatron. Come on. Vault-Tec. Here he comes. See, you take your time. Ah, the first customer of the day. He's being very calm in the morning. My face. Just look at that sky out there. You can't begin. Oh, then I'm glad you caught up with me. Come on, my face. Oh, me too. Now I know you're a busy fellow, so I won't take up much easier time, but precious commodity. I'm here today. Hmm. Yeah, I'm a little busy right now. Oh, sure, let's do it. Splendid. Weird. Usually cuts like third person. See, he's no matter. Yeah, I would eat in them. So, oh, it's Calvatron. So they'll actually say your name in the",
            "start": 1047.88
        },
        {
            "text": "a little busy right now. Oh, sure, let's do it. Splendid. Weird. Usually cuts like third person. See, he's no matter. Yeah, I would eat in them. So, oh, it's Calvatron. So they'll actually say your name in the game. Really? If you pick like they have some most like use names. So like if you call yourself like ****, uh-huh, the robot will call you ****. Like so far, that's awesome. Yeah, I was about to say if I would no matter what your name it, they **** say I'm like, damn, games are from very far. Anything would let me do Calvatron. Yeah, that's what it is. Oh, damn, forgot how beautiful we were. Thanks again. Yeah, I don't know why I thought it was right for you and Shawn. No prices. What would you do if you asked my own? I think you're going door-to-door and then that guy answered the door. This guy. Yeah, I would run and not stick around and turn this else up there. No wifey that puts the shill if I ever saw it. She's like, she killed a robot. Just kill me. I just wish the world would end. I said something dropped a",
            "start": 1129.39
        },
        {
            "text": "and not stick around and turn this else up there. No wifey that puts the shill if I ever saw it. She's like, she killed a robot. Just kill me. I just wish the world would end. I said something dropped a **** bomb on my life. My God, they just end it. Look at him. He's just so sad. Yeah, what's he's gonna have a look at his little baby. Little baby's like, don't look at me like that, Dad. Play with the stupid baby. Why? I'd love you. No baby giggles. Honey, where's the baby screaming? The ways I stick you. Please move. Just locked myself in my closet. Sand it off. Hey, you stole from the 'mobile. They're you know, happy. Yeah, I'm give you showing I'm a good father. Move. Oh my God, listen. After breakfast, are you thinking you want some of the Calvatron do what exactly? There we go. Now we can do the freakin opening. I'll just enjoy life here. Like I was playing it where she came out and she just wanting the baby with one hand. This is just like, wow, you can move the distance of the guy. Go ahead. Please leave on the way.",
            "start": 1204.58
        },
        {
            "text": "just enjoy life here. Like I was playing it where she came out and she just wanting the baby with one hand. This is just like, wow, you can move the distance of the guy. Go ahead. Please leave on the way. He runs. Y'all good. You seem fine. There's a way. Eric, would you come for me? Go with you. I'm sorry, wife. That's a luck in the future beef space. Is so dark. No matter what. No matter where the Sun is, it's not on him. He is the Moon. I need to go home to my Moon. Where's the rocket shoot? I don't want to live anymore. And you **** see me. I'm the goddamn infant adult male adult female wife can stay. Damnit. Almost there. We're gonna be okay. Okay, now that's a man I can trust. He's wearing a mask. I won't playing video games like the wrong way. No, there's no real right way. I don't know if you want to end it there. We're gonna tell me all right. Will Calvatron survive? Will he get to the Moon in the rocket ship that he just went in? I think you continue playing us Calvatron. We'll have to see. He's my new favorite.",
            "start": 1291.11
        },
        {
            "text": "gonna tell me all right. Will Calvatron survive? Will he get to the Moon in the rocket ship that he just went in? I think you continue playing us Calvatron. We'll have to see. He's my new favorite. We will have to see. Damn. Thank you so much, Adam. Hey, I'm a man. Where can we find you? You can find me over at the Funhaus. Just type it into your Google machine and it'll take you right to where you want to be. Yeah, I know what I want to be. How can we follow you on Twitter? However you want, baby. That's good. I want to follow you. The only way I do follow each other. Thank you guys so so much for watching this beautiful beautiful birth of a beautiful beautiful kid. Till next time. Love you. Love your bodies. Yeah, oh you.",
            "start": 1434.5
        }
    ]
}