{
    "id": 1370,
    "video_id": "XJKahyJazMg",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How To Decide Where To Eat - The GameOverGreggy Show Ep. 103 (Pt. 3)",
    "description": "Tim Gettys questions if there is a better way to decide where to eat.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1448438400,
    "duration": 1143,
    "transcript_chunks": [
        {
            "text": "Tim, yes, what's your topic? So you know how every day when it gets to lunchtime, Kevin comes out and goes, \"Tim, what do you want to do for lunch? Hey, do you want Thai food? Do you want burritos?\" It's like, \"I want burritos.\" \"Which burritos do you want? Do you want this burritos or that burritos?\" \"I don't know. I kind of want this burritos.\" \"No, I want the other burritos.\" \"Why?\" Uh, and it turned that fight, my topic, the whole time Kevin brought pizza. He just had pizza. The question, he had like a thing of Tupperware pizza he's had for like 10 years now over the span of four weeks. By the last time, the last that last piece of pizza was looking not good, buddy, but you you wolfed it down anyway. It's the pepperoni, it's all those salts. Where do we eat when it's lunchtime? How do you solve that problem? Where do we eat? It's one of the more complicated issues. Jesus Christ, we need contingency plans. Yeah, you know how the United States has contingency plans if China like, you know, invaded San Francisco? Well, we need a",
            "start": 2.85
        },
        {
            "text": "It's one of the more complicated issues. Jesus Christ, we need contingency plans. Yeah, you know how the United States has contingency plans if China like, you know, invaded San Francisco? Well, we need a contingency plan. Well, we have a plan for everything. Sure, we have contingency plan for alien invasions. It's it's a matter of yeah, like you need contingencies because it is a **** complicated problem and it's a problem I feel in every stage of your life and with every group. It's a different set of circumstances. Your girlfriend, yeah, exact. I mean, that's the worst because that then that there's layers of like deep-seated problems that come out there where it's like, \"I don't care.\" It's like, \"Okay, do you really not care or does that mean you want me to choose or does that mean you want me to remember a place that you wanted to go weeks ago?\" That's and I just don't, you know what I mean? I I don't even **** know, but the the biggest thing to me is the work group because you with these people",
            "start": 49.28
        },
        {
            "text": "a place that you wanted to go weeks ago. That's and I just don't, you know what I mean? I I don't even **** know, but the the biggest thing to me is the work group because you with these people every day and you have to eat every day. That's how being a **** human works, right? Yes. And recently I was by IGN and I saw all the places that like we used to frequent every day and I was like, \"Man, this was a big part of my life. Now it's not.\" Yeah. And now I walk around these streets, the streets as they're called, stre. There's some Z in the streets. Um, and it's just like it's a lot of a lot of Asian food. Yeah. And it's like a lot of them aren't really lunchy places, so it's like most of them are off the off the list. There's a Thai place that we go to all the time. There's a like a bunch of Mexican places depending on where you go. There's a Taco Bell, which I put in its own category that doesn't count as Mexican, of course. Yeah. And uh um, but then it's one of those things where it's like we just eat it",
            "start": 86.88
        },
        {
            "text": "depending on where you go. There's a Taco Bell, which I put in its own category that doesn't count as Mexican, of course. Yeah. And uh um, but then it's one of those things where it's like we just eat it. We just keep eating it, eating and it's just like, \"Do you want to go somewhere else?\" And it's just like, \"That sounds stressful.\" I don't know. I get an about lunch, I'll tell you that. And dinner, breakfast, I got unlock. It's usually just Starbucks or nothing. But yeah, uh your lunch is often Starbucks too. I come out, you guys are eating these weird ass sandwiches you got out of a Starbucks. Yeah, Chill Box. Well, the reason I like that is because then you know what you're sort of getting, right? Like I get I get weird anxiety about lunches when people like, you know, we used to go to uh was like Mergon. Yeah, and that place was great, but I'd have a salad and I was like, \"This salad was $10 and it's got to be like 1,000 to 1,500 calories in this **** thing.\" Like it was so so rich and salty and like crouton with",
            "start": 131.92
        },
        {
            "text": "that place was great, but I'd have a salad and I was like, \"This salad was $10 and it's got to be like 1,000 to 1,500 calories in this **** thing.\" Like it was so so rich and salty and like crouton with all sorts of **** that don't belong in a salad. And that's what I get weirded out about is that like when when I think about lunch is I like to know what's going into that meal and I like to know what I'm getting myself into. That's why I like Starbucks because at least they have some semblance of like the ingredients consistency and like the calories and like how much fat am I getting versus proteins versus carbohydrates. Not that I really give a **** or really calculate any of that stuff, but it's comforting, right? Like every time I'm in an airport if they have a Starbucks, I'll probably end up eating there 'cause again, it is like I know I like this uh the Bacon Gouda Ciabatta sandwich. Like I'm all set, you know what I mean? My business, I have one of those today. To be fair though, Nick, you're",
            "start": 168.08
        },
        {
            "text": "end up eating there 'cause again, it is like I know I like this uh the Bacon Gouda Ciabatta sandwich. Like I'm all set, you know what I mean? My business, I have one of those today. To be fair though, Nick, you're different. Like you you have very strict eating habits and they do not change. And when you have to change, then you just kind of adapt in your own weird Nick way. But when we were at IGN, everything I said does not apply. You did one thing every day and getting you to change was like an impossible task. You would only leave if like we had to go somewhere to sit down and like have like a business talk because all you would do is go to this damn Embarcadero market and go and it was a garbage place that was way too expensive and you'd go to the stupid ass build your own salad thing with these weird ass salad pieces that are just like chilling for way too long and I'm like, \"This is disgusting.\" Just lettuce and like, \"Well, yeah, but I don't.\" Did you even get the lettuce or boil eggs, put them in some chicken?",
            "start": 207.4
        },
        {
            "text": "pieces that are just like chilling for way too long and I'm like, \"This is disgusting.\" Just lettuce and like, \"Well, yeah, but I don't.\" Did you even get the lettuce or boil eggs, put them in some chicken breast? I was doing a I mean, I still do to some degree a pretty hardcore protein diet, but um not not so much anymore. Like now I'll have the occasional burrito because man's got to live. Colin, man's gotta live. Lie. **** that's the biggest lie. I can't remember the last time I saw you eat a burrito. We go out for burritos last week and what did you get? Nick got a burrito bowl. Thank you. That is not a burrito. You got all the components, various **** ingredients put into a styrofoam container and just minus the tortilla. I just didn't want the extra calories. The best part. It is the best part and the cheese, but sometimes you have to limit yourself. That's all the time. I can't. When when was the last time think you ate a burrito with us? With you guys? Yeah, uh the last time we went to Gordo's, I had a burrito. No, the",
            "start": 248.8
        },
        {
            "text": "you have to limit yourself. That's all the time. I can't. When when was the last time think you ate a burrito with us? With you guys? Yeah, uh the last time we went to Gordo's, I had a burrito. No, the time before that I did. Time before that. The time before that I had the time two times ago. I had a bowl. The time before that I had a burrito. That was always burrito on Friday that we used to do the show after work and we'd come home and we would go to Underdogs. You we'd all be like, \"Yeah, we want a California Burrito. California Burrito. California.\" And then I need two sides. Carnitas. You got it. Lettuce. And they're always like, \"Wait, what are you?\" Or I'm like, \"I'm building a salad.\" Sometimes you guys know how to do it. It's you're going to have to talk to a manager. I know. Go ahead. But see, this is why I have anxiety about all this stuff is because it shouldn't be that difficult to try and build something healthy for yourself at a restaurant, but it's the extreme. Like it's so far out of the **** norm for people that work",
            "start": 295.2
        },
        {
            "text": "this stuff is because it shouldn't be that difficult to try and build something healthy for yourself at a restaurant, but it's the extreme. Like it's so far out of the **** norm for people that work at these restaurants or these burrito shops or any of these places to attempt to try to get something healthy for someone that they think you're a **** whackadoo, right? Yeah, like you go to Burrito, you literally get and I'm not knocking this 'cause it sounds amazing, **** french fries in your burrito. That is a thing that you guys get on a consistent basis. Awesome. It's amazing. That is taking something that is traditionally fairly unhealthy and cramming something even more unhealthy up its ass, but it's a replacement for the rice. Six of one, half dozen of the other. They're both they're both rep of the rice. True enough, but there but there but it's a replacement. It's a starch replacement. It is. It is. It's a carb replacement. All right, so here's the thing is that with food, it's tough when I don't have I",
            "start": 336.08
        },
        {
            "text": "rice. True enough, but there but there but it's a replacement. It's a starch replacement. It is. It is. It's a carb replacement. All right, so here's the thing is that with food, it's tough when I don't have I like to cook and I'm actually think I'm a really good cook, but when I and Greg Greg's a good cook too. He's he's doing way more experimental **** now than I've seen him ever do. But Rich every day, but it's it's amazing. It's best. I have no reason I have no reason to cook really anymore, you know? So it's like I just don't and I eat the same **** five things over and over again, but I kind of like eating those five things over and over again. I buy sausages, hot pork sausages. Slow down. I buy beef and make like burgers. I usually 4 lbs. I usually wrap I usually wrap them in tortillas loaded with **** cheddar cheese, mayonnaise and ketchup. Yeah, okay. And just eat I eat those the same way. That's totally fine. So that's a great meal. Uh I'll make chicken cutlets. Mhm. Occasionally I'll make sauce",
            "start": 375.16
        },
        {
            "text": "**** cheddar cheese, mayonnaise and ketchup. Yeah, okay. And just eat I eat those the same way. That's totally fine. So that's a great meal. Uh I'll make chicken cutlets. Mhm. Occasionally I'll make sauce, although I've not made sauce in a long time. You do. Uh and then I'll buy like things like frozen pizza or then I'll just like I actually don't eat out very much um because to Tim's point, the selection in this neighborhood is **** garbage. So like, but it's almost but it's almost a blessing not only for my, you know, I have high cholesterol. The doctor told me I have high cholesterol. Not a huge surprise. If I lived somewhere like Hayes Valley or The Haight, I'd be **** seven ways from Sunday with like the amount of the amount of food that I that like that I would have available. So it's almost a like it's like if there was Five Guys or Chick-fil-A near me, it'd be over. It'd be over. Don't you understand that? So I have to so I have to so I have to just I have to it's almost I have to take advantage of",
            "start": 424.16
        },
        {
            "text": "like if there was Five Guys or Chick-fil-A near me, it'd be over. It'd be over. Don't you understand that? So I have to so I have to so I have to just I have to it's almost I have to take advantage of a blessing in disguise that there's so like if you want to eat anything that we really want to eat around here, you're walking and it's like, \"Is it worth it today?\" No. And the problem for us is it's not so much a walk. It's the fact that it's the food around here is it's a drive distance. It's walkable, but it's not walkable during a lunch break. Sure. So it's like that's the big issue 'cause like 10 blocks down there's it's a a whole bunch of food. Yeah, but the problem is then you have to deal with like the lunch rush and all that other **** on top of parking. Yeah, and that's that's a whole other **** issue. The last last like four Gordo's trips have been great. We've gotten spots no problem. We just get right in there. Knock on wood. Yeah, the problem is too is just what everybody wants differently, you know?",
            "start": 464.92
        },
        {
            "text": "the last last like four Gordo's trips have been great. We've gotten spots no problem. We just get right in there. Knock on wood. Yeah, the problem is too is just what everybody wants differently, you know what I mean? I play lunch is I have food here to cook or make or whatever, you know what I mean? But the only thing I will consistently if you say every day we're going to get a burrito, I'm out the door. I'm getting a burrito with you. But it's when it's something else that's when I can turn it down. I can go either way. I like going to Jenny's, but the problem the problem there, burger place, the problem there is that it's it's small. Like it's **** it's just it's a spin of the, you know, of the wheel. It's a roll of the dice depending on if you're going to be able to accommodate four people together. You can always sit by yourself in there, but you know, we could go to I miss the days of olden when nothing around you had to go to the car, the mall. You had to get in the car. It was it was like the whole",
            "start": 505.32
        },
        {
            "text": "can always sit by yourself in there, but you know, we could go to I miss the days of olden when nothing around you had to go to the car, the mall. You had to get in the car. It was it was like the whole rigamarole of like who's going to **** drive and then shotgun. If you didn't call shotgun, you were just that was the rest of your day right there. Boom. And then blast in metal. Oh man, in his badass Civic. Didn't he have a like a Civic Si? I don't know. You Civic Si. Uh yeah, and then you'd go. Choices were either Tamron or Monte is never an option. It is because they had the Rubio's. It was the C what Tamron. We went to BJ's all the time. That was awful. What are you talking about? BJ's Buffalo Chicken Pizza is the only thing worth a shout out. No, the Buffalo Chicken Pizza. Dude, it it is funny back when I was when I was like really poor when I first moved here and going to BJ's and and eating there like, \"Man, I ate for four bucks. Like this is **** great.\" I can't go back to those days. I can't. I won't go back to the BJ's",
            "start": 540.36
        },
        {
            "text": "like really poor when I first moved here and going to BJ's and and eating there like, \"Man, I ate for four bucks. Like this is **** great.\" I can't go back to those days. I can't. I won't go back to the BJ's lunches. No, you're **** up, man. When Nick and I went down for the Metal Gear Let's Plays, we we we went out that night. BJ's right there in the mall. **** I got my Buffalo Chicken Pizza. Happy as a pig and **** I'll tell you what sitting there. No, I don't want the celery. I don't want the onions. The barbecue sauce replaced with buffalo sauce. Yes, I know that's a lot of buffalo sauce on a pizza. Do it, ma'am. And a side of buffalo sauce, please. My God. See, this this is where I think you guys give me all this ****, but you know that I secretly eat all the **** that you guys eat, right? No, I eat it off of your plate. No. Oh, okay. That's fine. You literally were like, \"Are you going to have piece of this pizza?\" I was like, \"No.\" And you're like, \"Are you saying no and you're really going to have a piece of this",
            "start": 590.84
        },
        {
            "text": "of your plate. No. Oh, okay. That's fine. You literally were like, \"Are you going to have piece of this pizza?\" I was like, \"No.\" And you're like, \"Are you saying no and you're really going to have a piece of this pizza because I'll get the bigger one?\" I was like, \"Get the bigger one.\" I have a fantasy of of Nick where, you know, Nick and Nick and I have been many places together, but Nick and I have never been to a Del Taco together. And I have a fantasy of Nick and I going in and walking in and I just look at Nick and I'm like, \"Is it go time?\" And Nick Nick's like, \"Sure is.\" And then we walk up and we order literally $45 worth of food because it's when I go to Del Taco, like when I used to go to Insomniac, there's a Del Taco right across the street from Taco and and in in Burbank. It's like, you know, you stay in the same hotel when you go down there, whatever. And there's a lunch. I'm like, \"I'm going to **** Del Taco.\" Yep. Literally seven times in the next two days and there's nothing you can do to stop it. There's",
            "start": 630.36
        },
        {
            "text": "same hotel when you go down there, whatever. And there's a lunch. I'm like, \"I'm going to **** Del Taco.\" Yep. Literally seven times in the next two days and there's nothing you can do to stop it. There's nothing that can be done. When we were in LA, we were there for three days. How many of those nights did we go to Del Taco? Think about that again. No, it was two. It was two. We went two nights in a row. And just to balance it all out, when I got back, when we drove back on Sunday, I went to Taco Bell just so I just Taco Bell feel like, you know, like I was neglecting her. So much better than it is. Well, it's a different taste. It's a different flavor profile. But I will next E3, we've got to do it. We've got to go to Del Taco and it has to happen. The problem is Del Taco is only good at at like 1:00 in the morning when you're kind of drunk. It can't be light out. No, not I mean, I'll agree with you as far as it cannot be light out, but other than that, it's, you know, it I don't know. I I 'cause my fantasy is like",
            "start": 669.64
        },
        {
            "text": "morning when you're kind of drunk. It can't be light out. No, not I mean, I'll agree with you as far as it cannot be light out, but other than that, it's, you know, it I don't know. I I 'cause my fantasy is like having a Chick-fil-A and Five Guys nearby and all this kind of stuff, but I'm like, \"That would be you so bad. You'll die.\" No, I mean, it's not even that. Like like one, two in the neighborhood, like five blocks away. I okay. **** Do you have any idea how much I would eat at those places? I'd be finished. It would be over for me. It would be over. I would like a Chick-fil-A. Ah, Chick-fil-A around here. Like I that would be seven blocks somewhere. Our heads would explode if that suddenly happened somehow. But once that'd be a once a weeker for me. That would be a once I would have to myself because Nick judges me. I judge all of you guys not because you guys go to Chick-fil-A because Chick-fil-A actually is not that bad as far as like, you know, caloric values are concerned. They have like the grilled if you get the",
            "start": 709.88
        },
        {
            "text": "all of you guys not because you guys go to Chick-fil-A because Chick-fil-A actually is not that bad as far as like, you know, caloric values are concerned. They have like the grilled if you get the grilled chicken sandwich. Probably. Yeah, that's what I'm getting a Chick-fil-A. Get the **** out of here, Nick. But it's the fact that when we were at MomoCon in Atlanta and there was a Chick-fil-A across from my hotel, you **** went every meal. Not once a day, every meal. Colin called someone. It was like, \"I'm not even hungry.\" Someone **** brought him Chick-fil-A anyway. He called Postmates and they brought him up Chick-fil-A. And I was like, \"Colin, this is.\" He just kept it on standby. I'm like, \"You going to eat this Chick-fil-A?\" He's like, \"I don't know, maybe.\" Yeah, I would buy more sandwiches than I needed just so I could have them in the hotel room. The best is when we had it for dinner one day and when I was going to bed, I was super excited to wake up and go get their breakfast biscuit chicken",
            "start": 756.76
        },
        {
            "text": "needed just so I could have them in the hotel room. The best is when we had it for dinner one day and when I was going to bed, I was super excited to wake up and go get their breakfast biscuit chicken sandwiches 'cause we don't have it anywhere. It's like when I go to I go home to Chicago for 3 days and I eat at Portillo's five times. Like that's just 'cause it's there and I can't have it any other time. That's my Del Taco. I mean, when I go to Southern California, I'm like, \"I went down for my brother's birthday and we went to Del Taco the first night.\" And I was like, \"What are the chances we're going to go back again tonight?\" He's like, \"What? You out your **** mind? We're not going again tonight.\" And we didn't and it broke my heart. Changed. Did he was like, \"Oh my God.\" But yeah, no, I I get it. Trust me. I mean, I just I just never glommed on to Chick-fil-A like you guys do. I don't know why. I just I just don't think it tastes. I think it's 'cause the fries just don't do it for. Just stop talking. It's those weird soggy",
            "start": 799.68
        },
        {
            "text": "I just never glommed on to Chick-fil-A like you guys do. I don't know why. I just I just don't think it tastes. I think it's 'cause the fries just don't do it for. Just stop talking. It's those weird soggy cold. They're always cold when they get depending you get them. Depend. They're like limp. They're like a like, you know, they're the condiment for the mayonnaise. Come on. Come on, Nick. The the there's so many taste like anything. Tell you the Crisp Cut Fry from Carl's Jr. That that's a fry too much. That just tastes like heat and salt and grease and crisp. You can't even taste the French fry because it burns your **** mouth before it actually gets even like a millimeter. No, what the little grilled zucchinis, whatever the **** they're called. I think they're they zucchini chips or what they. Yeah, those burn the **** out of your mouth. Yeah, zucchinis. Yeah, I'd be like, you know, I'm not I'm not here for this. The the conundrum of my the conundrum of my mind is again, Chick-fil-A and Five Guys. These are these are the this",
            "start": 831.08
        },
        {
            "text": "out of your mouth. Yeah, zucchinis. Yeah, I'd be like, you know, I'm not I'm not here for this. The the conundrum of my the conundrum of my mind is again, Chick-fil-A and Five Guys. These are these are the this is the the competition for the throne in my mind. I don't know which one I would want more in the neighborhood. Chick-fil-A. It's you say that, but there are down. You know, there's no Sundays are done. Yeah, that's the one day for your body to recover, Colin. That's true. It's that's my cheat day. Yeah, my cheat days is what I eat healthy. Yeah. Um, I saw you eat a salad the other day. You were like making this artisan salad and it looks so good. And you're like, \"Yeah, I don't know. I think I'm going to make I think make a salad today.\" You made a salad today. I was so proud of you. And then I need to just eat green things because I don't. Well, like the doctor told me, \"You're fine. Give me the the whole rundown except you have high cholesterol and you basically have no vitamin D in your body at all.\" Yeah. Oh my. Well, it's",
            "start": 874.36
        },
        {
            "text": "because I don't. Well, like the doctor told me, \"You're fine. Give me the the whole rundown except you have high cholesterol and you basically have no vitamin D in your body at all.\" Yeah. Oh my. Well, it's not a huge surprise. I don't ever leave the house because I'm work in this **** place and it's any they said, you know, San Francisco, not uncommon. It's overcast all the time here and stuff like that. I'm like, \"Yeah, that's a good excuse. That's the excuse.\" Um, but like Five Guys is so dominant as well. It's hard for me to like deci like Five Guys is so **** good. It's so good. I don't **** with the Five Guys. Tamron has the Five Guys. They didn't. If they did, we would have been if they had, I would have tried it a long time. Going to Tamron now, it's like the saddest thing in the world. It's just I don't know why anyone would want to be there. That mall has always. Yeah, malls are always sad. Yeah, mall sad. I don't when Mervyn's closed down, it would got a little sad on that. When they closed down the 50B, that was",
            "start": 923.52
        },
        {
            "text": "why anyone would want to be there. That mall has always. Yeah, malls are always sad. Yeah, mall sad. I don't when Mervyn's closed down, it would got a little sad on that. When they closed down the 50B, that was that was a sad moment spot. Have the Elephant Bar though, so everything's not all is not lost. I had Elephant Bar two nights ago and Elephant Bar and BJ's are equal in my book. Uh **** you. They really are. BJ's BJ's is a cut above of Elephant Bar. Yeah, no, they literally it's the ceremony and Tamron. You go there, you get the Buffalo Chicken Pizza, all the things I said before. You get a Jeremiah Red and you **** enjoy your life. All right, I will. I've never liked anything I got at Elephant Bar ever, whereas BJ's does have the Pizookie, so give it to them. Thank you. Santee. I mean, the the wild card of Santee is is the Buffalo Wild Wings now, but that Buffalo Wild Wings is really not very good. It's a pretty bad storm. It's the only Buffalo Wild Wings in the Bay Area. It's true, but I remember going in there. I tweeted out",
            "start": 966.68
        },
        {
            "text": "Buffalo Wild Wings now, but that Buffalo Wild Wings is really not very good. It's a pretty bad storm. It's the only Buffalo Wild Wings in the Bay Area. It's true, but I remember going in there. I tweeted out pictures of it and they reached out to me, but I never even like talked to them. I was like, \"Whatever, it's too much work.\" Where I was like, \"I'm like this bathroom is it looks like a bathroom out a Fallout 4.\" I was like, \"You ****.\" And it was like 11:00 in the morning. I'm like, \"What the **** is going on here?\" Your boy Colin has take a **** and he can't he can't take a ****. You know that it won't come out if it's dirty. He just put down 10 mozzarella sticks and 20 garlic wings and like three glasses of Coke. Can the man take a ****? Yeah, the answer was no. Yeah, no. And I had to **** skedaddle out of there real quick. You threw cash on the table and left 'cause when I got to go, I got to go. I understand 'cause sometimes we like to know that I like to wait until the very last minute, but sometimes there's, you know,",
            "start": 1015.2
        },
        {
            "text": "quick you threw cash on the table and left cuz when I got to go I got to go I understand cuz sometimes we like to know that I like to wait until the very last minute but sometimes there's you know sometimes you you can't play around with that in public no no no that's that's the game is for here the game and it is a game it's a fun game in that Buffalo Wild Wings since it is where it is all it is is just a bunch of high school kids working and it's like they half of their job is is making sure that you're waited and the other half of their job is flirting with whoever else is working at the time I respect that half job I respect that hustle too and I'm I like half the fun of Buffalo Wild Wings is trying to see who's hooking up with who yeah who's who's with who and then as you go week after week you see things develop and like relationships change and like it's kind of like an open world game but it is interesting what I always observe with Buffalo Wild Wings especially that one is that",
            "start": 1057.88
        },
        {
            "text": "week you see things develop and like relationships change and like it's kind of like an open world game but it is interesting what I always observe with Buffalo Wild Wings especially that one is that I'm like there are way too many people working here how can you possibly need this many people like how can you possibly need this many there's like 17 people just behind the counter when he walk yeah there's like eight people at the merch store and you're like why is there a merch store at a Buffalo Wild Wings I went my dad this is right over there and I went I went in there to buy the garlic sauce cuz we love the garlic sauce and they only had one bottle at the are you kidding me I was ready to drop like $50 and buy like a case of this **** and like we only have one bottle do you want it I'm like yeah I guess and I took it I can't come away empty-handed all right that's how you solve the food conundrum yeah we've solved a lot of problems there in that one no doubt about it",
            "start": 1091.64
        }
    ]
}