{
    "id": 2179,
    "video_id": "3DdiV1sQd8E",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Celebrating PS3's 10th Anniversary  - Kinda Funny Gamescast Ep. 94 (Pt. 3)",
    "description": "We celebrate the PlayStation 3's 10th anniversary.\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/gamescast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1479304800,
    "duration": 1221,
    "transcript_chunks": [
        {
            "text": "This episode of the Kinda Funny Gamescast is brought to you by the Dollar Shave Club. Guys, you don't need to choose between price and quality to get an amazing and affordable shave. DollarShaveClub.com is the answer. To prove how amazing the shave really is, right now they're going to give you your first month free to join the club. DollarShaveClub.com delivers amazing razors right to your door for a third of the price of what the greedy razor corporations' charge. You need to join the club like I did. I've been looking damn good. G has been feeling up on my face and she's like, \"Damn, Tim, why are you so smooth?\" I'm like, \"Dollar Shave Club, baby!\" That's how it works. Go to Dollar Shave Club, pick a razor from their lineup of amazing blades. I've been using the Executive Blade with their Dr. Carver's Shave Butter, and man, if you've never used shave butter, I'll tell you what, you got to try it. It's fantastic. The blade just gently glides with the smoothest shave I've ever had. Here is what you need to do. See why",
            "start": 0.08
        },
        {
            "text": "and man, if you've never used shave butter, I'll tell you what, you got to try it. It's fantastic. The blade just gently glides with the smoothest shave I've ever had. Here is what you need to do. See why over 3 million members like me love the Dollar Shave Club. They're so confident in the quality of all their products, you can get your first month of the club for free. You just pay shipping, no big deal. After that, just a few bucks a month. No long-term commitment, no hidden fees. Go to DollarShaveClub.com. That's DollarShaveClub.com. Next topic: On November 11th, 2006, in Japan, and November 17th, 2006, in North America, the PlayStation 3 launched. Similar to what we did with the N64 a couple months back, I want to kind of, you know, reminisce about our memories of the PlayStation 3 and the last 10 years of it. I feel like specifically for you guys, yeah, it meant a lot. Well, sure, uh, in a very weird, interesting way, right? I mean, my PS3 memory starts with them announcing that at that E3 and me being like,",
            "start": 34.72
        },
        {
            "text": "of it. I feel like specifically for you guys, yeah, it meant a lot. Well, sure, uh, in a very weird, interesting way, right? I mean, my PS3 memory starts with them announcing that at that E3 and me being like, \"No **** way!\" I'm, I had a PS2, I loved my PS2, I was a PlayStation 2 gamer, and I was just like, \"Are you **** kidding me? That much money for this? No, there's no way I'm buying that at launch.\" And then, the, for me, unheard of happened in like, Nintendo announces their console and I'm like, \"Oh, it's SD. It doesn't really, it just uses Wi-Fi if you have it or whatever.\" Because I didn't, I didn't have Ethernet and I didn't have an HDTV back then. I was like, \"**** yeah, that sounds really cool. It's how much money? Oh, sure, it's turning, it's this new way to play games. It's all these cool things. I can play all these old NES games I never got the chance to play when I was a Sega kid. Yeah, I'm going to buy that.\" And I'll never, I went to, uh, you know, uh, the GameStop in Columbia, Missouri, camped out in line to pre-order.",
            "start": 97.2
        },
        {
            "text": "old NES games I never got the chance to play when I was a Sega kid. Yeah, I'm going to buy that. And I'll never, I went to, uh, you know, uh, the GameStop in Columbia, Missouri, camped out in line to pre-order. So, and then just, you know, I would then get to come pick it up, right? And so I did that, you know, months in advance. And then for the Columbia Daily Tribune, I came back and I covered the PlayStation 3 line at Best Buy. And then when that went up at midnight or whatever it was, I went over and bought my Wii, you know, from the GameStop across the street where there was like just people who had camped out before walking in, walking out. And I remember what threw me, and I was my first sign of like, \"Uh-oh,\" is that for PlayStation 3, right? Like, bought it at launch, camped out. It was my first major purchase. That entire line, we were all so into it. We were, you know, we were so excited to get this system. But as I'm sure you guys recall, that was for me, and maybe it'll be different for you guys, that was the first time.",
            "start": 138.84
        },
        {
            "text": "line, we were all so into it. We were, you know, we were so excited to get this system. But as I'm sure you guys recall, that was for me, and maybe it'll be different for you guys, that was the first time I remember, uh, when you bought it and you took it home and opened it up, how what a hot item it was. And then when the, the not Black Market, but the scalper market really started to take hold, right? And when we were in line for the PS3, and I was interviewing all these people, 'cause I wasn't buying one, I'm interviewing all these people outside of Best Buy. I said, I went down the line, I'm talking to all these people, and none of them were there to have a PS3. They were all there to buy the PS3 to flip it and sell it. Whereas the Nintendo line I'd been in, you know, a month prior, was all people who were excited about it. Then you jump into to pre-order the Nintendo line. Then, uh, the PS3 line here, there was one kid in there who was buying it for himself. And I was like, \"That seems like a huge **** problem.\"",
            "start": 178.28
        },
        {
            "text": "about it. Then you jump into to pre-order the Nintendo line. Then, uh, the PS3 line here, there was one kid in there who was buying it for himself. And I was like, \"That seems like a huge **** problem.\" What do you, why would that be the case? And so when it, you know, came out and then nobody liked it, it was too much money. Like, you know, I had one friend who bought it in Columbia, Missouri, that was like, \"The PS3 for the PS3.\" And I was excited about the PS3. And so for me, it went, that comes out in November. January, I get the email from Jeremy Dunham or whatever saying, \"Hey, do you want to, you know, have an interview tomorrow for the PlayStation team?\" And I was like, \"Oh, ****.\" And I called that one friend and in a blizzard or a snowstorm drove over there and my Mustang was like skidding out all over the place and play, play a whole bunch of crappy ass",
            "start": 218.56
        },
        {
            "text": "I was like, \"Oh, ****.\" And I called that one friend and in a blizzard or a snowstorm drove over there and my Mustang was like skidding out all over the place and play, play a whole bunch of crappy ass PS3 launch games with the shitty ass controller. That's the thing is, I, I, I wrote down all the launch titles. We got Call of Duty 3, Genji: Days of the Blade, Madden NFL 07, Marvel: Ultimate Alliance, Mobile Suit Gundam: Crossfire, NBA '07, NBA 2K7, uh, Resistance: Fall of Man, Ridge Racer 7, Tiger Woods PGA Tour 07, Tony Hawk's Project 8, and Untold Legends: Dark Kingdom. And that was with the Sixaxis controller. \"We don't need Rumble anymore,\" which was a disaster. Way too light. Yeah. Um, but it was a big step up from what we expected to get from the Boomerang controller, which was like, I remember that E3 seeing when they first were talking about, I'm just like, \"Sony, what the hell are you doing? Like, you got it right with the PS2 and the PS1. Like, just don't give us this ****.\" And then, then they didn't. Yeah. And then eventually it took",
            "start": 259.64
        },
        {
            "text": "talking about. I'm just like, \"Sony, what the hell are you doing? Like, you got it right with the PS2 and the PS1. Like, just don't give us this ****.\" And then, then they didn't. Yeah. And then eventually it took them a while to bring them back to DualShock 3, which the lawsuit got settled. Yeah, bring rumble back. There was a bunch of issues there. But yeah, the price point and all that stuff. Like, I remember being like, \"All right, I'm not getting this for as much as I want it.\" Yep. That was the thing. Like, you know, I, I'd been burned, of course, being a fanboy when I was a Sega fanboy. So I, I was trying not to do that. But that, that always happens, right? Of like, where I was like, \"PlayStation is so much superior to Xbox.\" You know what I mean? And then they released Xbox 360 and it was a similar thing of like, \"I don't have an HDTV and I don't have really good internet.\" So no, I'm not going, or, you know, plug internet time. And I wasn't going to buy the adapter for it. So like, no, I'm not going to do that either. I mean, that's the",
            "start": 306.28
        },
        {
            "text": "TV and I don't have really good internet. So no, I'm not going, or, you know, plug internet time. And I wasn't going to buy the adapter for it. So like, no, I'm not going to do that either. I mean, that's the other thing. The Xbox 360 had a year on this too. So it's just like, I remember that coming out and me being a clear Sony guy, I was just like, like, \"I'm not getting a 360. Like, there's no way in hell.\" Uh, I remember I borrowed Curran's 360 just to be able to play Tony Hawk's American Wasteland, 'cause I'm like, \"Well, I want to play the best version of it.\" Um, but besides that, I was like, \"Whatever. Like, I can wait. I want an HDTV to experience this, right? Like, I don't want to just like, you know, do some weird makeshift ****.\" And, uh, but I was like, \"I'm going to get a PS3 eventually.\" Then they announced the price, the controller, and all this stuff. And I was like, \"Until I have a reason, I'm not getting a PS3.\" And then that reason came and it was Final Fantasy Versus XIII. And I should be playing that game in about two weeks.",
            "start": 344.32
        },
        {
            "text": "and all this stuff. And I was like, \"Until I have a reason, I'm not getting a PS3.\" And then that reason came and it was Final Fantasy Versus XIII. And I should be playing that game in about two weeks. Hopefully on your PS3, of course, right? Yeah, on my PS3. Uh, but then, you know, I've told the story many times, but I, you know, traded in a whole bunch of **** to be able to get and like schemed real hard, uh, to get a PS4 when Metal Gear Solid 4 came out, which to me was the first like must-play title. I'm like, \"This is worth this system.\" Um, Uncharted had been out already and I played it at a GameStop and I was like, \"Okay, okay, I want this for sure.\" But I was like, \"I can wait.\" Uh, 'cause like looking at that launch lineup, like many launch lineups, it was fine. You know, it did have Resistance. It had a, a real solid, uh, game to it. But yeah, most of them are the sports titles and just the iterative, annualized stuff. But where were you at with it on launch? I was in college. I couldn't afford it. Um, the price was ridiculous. The",
            "start": 380.72
        },
        {
            "text": "to it. But yeah, most of them are the sports titles and just the iterative, annualized stuff. But where were you at with it on launch? I was in college. I couldn't afford it. Um, the price was ridiculous. The PlayStation 3 to me is a story of redemption. I, I think that, um, first of all, I've said it before, PlayStation 3 is my favorite PlayStation console. Um, and I had a PS1 since, or mid-'97. I had a PS2 the day it came out. Uh, PS4 day came out. PSP very early. Vita day came out well before it came out. Um, so I have experience with all of Sony's kind of pieces of hardware. And, uh, PS3 is my favorite. Um, and I, I feel like this is a, um, it's a, it's a harrowing kind of story that I think will has taught lessons to people in the industry about bravado, about expectations, about, um, uh, consistency, about momentum, about fickle the consumer is and the fickle, and the consumer should be fickle because it's their money and it's their time and it's their energy that they're kind of putting into this ecosystem. Um, when they",
            "start": 425.56
        },
        {
            "text": "the consumer is and the fickle, and the consumer should be fickle because it's their money and it's their time and it's their energy that they're kind of putting into this ecosystem. Um, when they announced this console, um, and they revealed the price and were saying what they're saying about it, I'm like, \"These guys are **** crazy.\" I, I remember, I remember being like, it just, what you're saying doesn't make any sense. $600 to me when I was in college was more money than I ever had in my bank account. $600 for me now is not that much money comparatively, but it's still an enormous amount of money. I wouldn't pay $600 for a **** video game console ever. And in fact, I didn't buy my own PS3 until 2009 because I was, I remember saying on Podcast Beyond, first of all, I was lucky enough to have access to PS3. I basically just had a PS3 in my house anyway. Uh, but when Slim came out and it was $300, I'm like, \"This isn't worth any more than $300 to me and I will not pay more than $300 for this console in the\"",
            "start": 477.88
        },
        {
            "text": "I basically just had a PS3 in my house anyway. Uh, but when Slim came out and it was $300, I'm like, \"This isn't worth any more than $300 to me and I will not pay more than $300 for this console.\" In the old Beyond days, we had to be, they asked us, and I mean, I mean the original cast even before Colin, right? They asked, they had to ask us, you, I put in quotes, me, to stop saying that I wouldn't buy the PS3, 'cause every episode I was like, \"I'm, I haven't bought a PS3 yet.\" I mean, this went on for a year and a half, two years. It was that MotorStorm bundle they put out or whatever where I finally bought a PS3. And it was, it was just like, the library did not justify this price in any way, shape, or form. And it was, yeah, I mean, I was taking it home for reviews, but like taking home and enjoying was like Calling All Cars. And it was like, \"This is not worth buying for Calling All Cars so me and Micah can sit around like Calling All Cars at home.\" You know what I mean? Yeah, I think that the, the specific angle that Sony took",
            "start": 516.24
        },
        {
            "text": "Cars. And it was like, \"This is not worth buying for Calling All Cars so me and Micah can sit around like Calling All Cars at home.\" You know what I mean? Yeah, I think that the, the specific angle that Sony took with this console was disastrous, which I think you saw a direct reflection how they rolled out PS4, how they priced PS4, how I think they rolled out and priced PS VR rather, which was very careful. Vita even was appropriately priced. I think that they learned those particular lessons that bravado is a killer. PS2 is the best-selling gaming hardware of all time. But whether it's console or handheld, it's never going to be passed. No one's ever going to sell that many consoles or hard piece of hardware ever again, not even close. So they had a lot to be proud of, but they also didn't look at why they sold it, sold so many units. I'm very convinced that 50, 60, 70 million of those were sold as DVD players. And I, and a lot of them were sold on the back end when they were very cheap. Remember that there",
            "start": 554.44
        },
        {
            "text": "sold it, sold so many units. I'm very convinced that 50, 60, 70 million of those were sold as DVD players. And I, and a lot of them were sold on the back end when they were very cheap. Remember that there were three iterations of the PS2. The, the, the, the, the Super Slim PS2 was very late in Emerging Markets. Brazil was buying it late, Eastern Europe was buying it late, Southeast Asia was buying it late. There was a lot of places where PS2 just kept burning. So I think that the numbers were inflated and gave them a false sense of security. And I think the PlayStation 2 is a great system. The PlayStation 2 is actually my least favorite PlayStation console. And so going into, um, going into, and I know that's crazy to a lot of people, but it's just, it, I mean, I think GameCube **** on PS2 in terms of games. But the, um, in from that particular perspective, it's, it's interesting to study the history of it, um, and figure out, well, how do they get to this point and how do they rectify? And I think what's really",
            "start": 592.08
        },
        {
            "text": "but the, um, in from that particular perspective, it's, it's interesting to study the history of it, um, and figure out, well, how do they get to this point and how do they rectify? And I think what's really impressive with Sony is that they, that Sony as a corporation started falling apart around PlayStation 3 because they had put so many eggs in that basket. The TV division was failing. They were losing money, uh, hand over fist with Vaio and all that kind of stuff. They just weren't doing, uh, a very good job. And they still managed to really burrow down and fix it to the, the point where PlayStation 3 sold at parity, if not a little bit better than Xbox 360 with one less year on the market. That's a really impressive thing. I think it netted about 80 and a half or 83 million units. That's a lot of units. For for context, NES, I think, is at 60. Um, you know, so that's also because they had the three different iterations at the right times, right? Exactly. I think that 2009 introducing, um, you know, the new one, 2010,",
            "start": 628.64
        },
        {
            "text": "for context, NES, I think, is at 60. Um, you know, so that's also because they had the three different iterations at the right times, right? Exactly. I think that 2009 introducing, um, you know, the new one, 2010, with the George Foreman Grill, like, they were, they were, um, they were smart. And I think that the way they nailed it was to kind of withdraw and add components and new interesting things to the console that I think were needed. They re-upped, they got the PlayStation Store for a browser and put it on, made it native on the console. They updated Cross Media Bar and made the, the OS quicker. Um, they also did some anti-consumer things. They removed Linux, which really bothered a lot of people. They got rid of the SD reader, they got rid of the USB ports, the backwards compatibility. They did a lot of things to stifle consumers as well. And I think that they did that, um, for component reasons. I think that like, they were probably paying licensing on Linux. I think they were probably being like, \"We can get rid of the SD",
            "start": 668.64
        },
        {
            "text": "consumers as well. And I think that they did that, um, for component reasons. I think that like, they were probably paying licensing on Linux. I think they were probably being like, \"We can get rid of the SD reader. It's like going to save us $ on every console. This is millions of dollars when you're, you know, producing consoles at scale.\" Like, so I think they did these things for a reason. By 2009, 2010, remember 2009, uh, was when we got, uh, Uncharted 2: Among Thieves. And I think that that Uncharted 2: Among Thieves, I think that's when the console became real to a lot of people. And I also think that by 2010, 2011, 2012, the momentum was all with Sony. I think that that the Xbox 360 was very front-loaded. It was a very impressive console. I remember my roommate Doug in college had got it the day it came out. I remember playing like, \"This is really, never seen anything like this. A console you can turn on and kind of interact with without playing a game and apart from just like putting a CD in it or looking at memory",
            "start": 711.44
        },
        {
            "text": "playing like, \"This is really, never seen anything like this. A console you can turn on and kind of interact with without playing a game and apart from just like putting a CD in it or looking at memory card management.\" I, I, so I saw that Sony had a lot to compete with. But by the end of it, by 2013, 2014, the PS3 was definitely the superior console. Um, and I really remain as a student of the industry, super impressed with this. This is one of the all-time comebacks of a console that really would looked like it was **** dead. Like, I remember after like, late 2006, 2007, even 2008, I'm like, \"This thing's ****. Like, I can't believe this, that this thing is actually going to...\" I, I remember for about a year or so, I was like, \"This thing's going to fail. Like, the PlayStation 3 is dead. It's just, it's just Xbox 360 just trouncing it.\" Um, and Wii, obviously, we have to remember Wii was a concurrent launch. Wii came out weeks away from PS3. Was it three days before? Yeah, something like it was like right in that window. I",
            "start": 748.72
        },
        {
            "text": "360 just trouncing it. Um, and Wii, obviously, we have to remember Wii was a concurrent launch. Wii came out weeks away from PS3. Was it three days before? Yeah, something like it was like right in that window. I mean, these were the, and Wii was all the rage. This weak little, really, this weak little piece of **** compared to the PS3. But it didn't matter because the price was right, the games were there, the interest was there. And, and they just, they turned it around. It reminds me a lot of Super Nintendo battling Genesis. It reminds me a lot of, um, you know, the Wii itself, the Blue Ocean Strategy and the idea that to to permeate, uh, and saturate the market. Well, Sony did a really good job with PS3. And those lessons were learned with PS4. And, and, um, to focus on games, to focus on exclusives, to get, you know, those kinds of things going and and operating all as they should in sync. So that's my memory of PlayStation 3. And I think that the library on PS3 is phenomenal. If a console ever surpasses, if PlayStation 4",
            "start": 791.52
        },
        {
            "text": "kinds of things going and and operating all as they should in sync. So that's my memory of PlayStation 3. And I think that the library on PS3 is phenomenal. If a console ever surpasses, if PlayStation 4 has a library half as good as PS3's, um, it's in great shape. That was the thing though, is like, and I think that's the lesson you see what Microsoft failed with the Xbox One was having a vision and sticking to it. And maybe even to the Xbox 360 to an extent, right? We talked about Greg when Greg was here, we talked about Xbox Live Arcade and then him leaving and how that's gone off and done its own thing. But that was the thing with PlayStation where the library is what it was, was, and that would define that console. And part of that definition is the hardcore fanbase that so many of our fans are a part of. And that's, you know, part and parcel with Podcast Beyond and being the people on the block who bought this machine and were invested in PlayStation. And you peeled back all the mainstream hangers-on.",
            "start": 834.52
        },
        {
            "text": "of. And that's, you know, part and parcel with Podcast Beyond and being the people on the block who bought this machine and were invested in PlayStation. And you peeled back all the mainstream hangers-on, all these people who just got it because it was successful or whatever. They went to Xbox. They went and did their thing. And you had this audience that really **** cared about video games. And so Sony was able to sit there and the, you know, seeds they had planted with first parties, with Worldwide Studios, start to pay off. And they start to build this library that is moving units, is, you know, uh, engendering this fanbase, is enabling them to care about PlayStation, wanting to be a part of it, or and go on this different tear with it and have this groundswell of support so that, you know, there can be something like Journey one day because we had Super Rub'a'Dub one day. You know what I mean? You have this thing where people are there buying these games. Uncharted comes out and we buy that. I'll never",
            "start": 875.08
        },
        {
            "text": "something like Journey one day because we had Super Rub'a'Dub one day. You know what I mean? You have this thing where people are there buying these games. Uncharted comes out and we buy that. I'll never forget seeing Uncharted the first time, being told about Uncharted the first time. And that's so weird now. And I think you look at, granted, last generation overall, but especially how Sony handled their first parties. And you see that thing we talked about where I always talk about The Last of Us. That The Last of Us was this game proving the fact that you don't need a number at the end of your game. You do, we do have consumers educated enough to understand that much like Martin Scorsese directs this film, I want to see his next film. They can understand that Naughty Dog made this game, I want to see their next game. And that was that thing of you see that groundwork and you see those studio step it up, whether it is Naughty Dog, whether it is Sucker Punch, you see these people taking that Insomniac, taking",
            "start": 916.84
        },
        {
            "text": "next game. And that was that thing of you see that groundwork and you see those studio step it up, whether it is Naughty Dog, whether it is Sucker Punch, you see these people taking that Insomniac, taking that next step into, we are going to make games that are bigger than just games. You know what I mean? This is Naughty Dog. They had made Jak and Daxter, which was awesome. But I don't think you could have asked most Jak and Daxter players at Jak 3 who had made this and what their lineage was and they would know it for heart. Whereas like, when I was on that bus with Jeremy Dunham and Jeff Haynes and Chris Roper and we were going to the Sony event and they were like, \"All right, you're going to cover the Naughty Dog.\" Like, \"Who are they?\" And they made Jak and Daxter. \"I love Jak and Daxter. What's this one? It's kind of this Indiana Jones game. It doesn't have a title yet.\" I was like, \"Oh, okay.\" And I went and played this game where the water made his jeans look wet. And I was like, \"What the **** is",
            "start": 953.84
        },
        {
            "text": "this one? It's kind of this Indiana Jones game. It doesn't have a title yet.\" I was like, \"Oh, okay.\" And I went and played this game where the water made his jeans look wet. And I was like, \"What the **** is this?\" Yeah, no, I mean, we've come so far. Like, looking back, I was watching, uh, Jeremy Parish video a couple days ago about the Super Nintendo's launch. And it's crazy that, you know, when you look at the launch window of games, like, we're at a point now where video games are so anonymous with just mainstream. Like, people play games that launch lineups are no longer two games, three games, five games, six games. It's like, even a, a not successful launch is 13 games. And, uh, it with a little bit of everything. Yeah. And for the, the console to keep going on, and it's, it's crazy because although then it to me was like not worth it, it did immediately hit a point once Metal Gear came out. I'm like, \"All right, cool, worth it.\" And by the end of it, it's like, \"Yeah, entirely worth it.\" There's experiences on this system. And I",
            "start": 991.0
        },
        {
            "text": "not worth it it did immediately hit a point once Metal Gear came out I'm like all right cool worth it and by the end of it it's like yeah entirely worth it there's experiences on this system and I feel the same way about even something like the Wii U where it's just like all right in the beginning I don't care but all it took was three experiences to make the console worth it to me but but with PlayStation 3 like that was so long of a a console run where those games spoke to me you know I like I love Journey I love Uncharted I love uh Last of Us and the the those games uh as well as all the the third party games that multi-platforms like it made it totally worth it and I've never been and will never be an online shooter guy which if I was I would have been on 360 like all my friends were you know like Alfredo and Curran they lived on that thing and they loved that thing because it gave them Halo gave them Call of Duty and that was what I'm talking about with a vision and being able to",
            "start": 1032.6
        },
        {
            "text": "know like Alfredo and Curran they lived on that thing and they loved that thing because it gave them Halo gave them Call of Duty and that was what I'm talking about with a vision and being able to Pivot right that PlayStation got their teeth kicked in and was they were able to Pivot and be like all right Microsoft's running away with these multiplayer Shooters and we're going to try here and there but we are story based games we are Indies without saying we're Indies we are these smaller games that you can get here that you can't get anywhere else and we want you to understand that especially when we are competing with Xbox Live who is putting out these arcade titles but they're putting out arcade games in a way that is a AAA strategy if that makes sense where they're making a big deal about a few of them where Sony seems like they pepper it out all these different little things like The Last Guy or whatever weird ass PSN game you want to talk about that they tossed out there that you",
            "start": 1075.12
        },
        {
            "text": "a few of them where Sony seems like they pepper it out all these different little things like The Last Guy or whatever weird ass PSN game you want to talk about that they tossed out there that you knew you're going to get something quirky at least every month if not every week yeah no man it's it's definitely it's crazy to look at the library now and I feel like an important thing to note about last gen was the amount of new IPs that came out of it like when you you talking about Uncharted LittleBigPlanet Infamous like PlayStation Home and PlayStation Home it's impressive especially when you look at PS4 now and it's just online what new franchises has it brought to the table you know and granted it's still earlyish but it's getting to the point that it's not well this is what we just talked about on PS I Love You right the identity crisis PlayStation's in in the way that it is very much it isn't here's this new thing we're not doing the PS3 model of like here's a million different",
            "start": 1112.16
        },
        {
            "text": "about on PS I Love You right the identity crisis PlayStation's in in the way that it is very much it isn't here's this new thing we're not doing the PS3 model of like here's a million different reasons like we're doing crazy cool **** here they're doing cool **** but it's not it is a new God of War okay cool we're still doing that all right great whatever you know what I mean and then it's like Naughty Dog's next game we assume is going to be Last of Us 2 and then you know where does it go what is Sucker Punch working on yeah I mean in a lot of ways it reminds me of the PS1 to PS2 where it was just kind of like here's games and here's maturing those games and then PS3 now it's here's maturing those games is this the end of the line or will there be something later who knows but it's really impressive to look back at the Boomerang controller and the Killzone 2 trailer and being like this is too good to be true and it was but to be at a point now where it's like oh no that's",
            "start": 1151.92
        },
        {
            "text": "really impressive to look back at the Boomerang controller and the Killzone 2 trailer and being like this is too good to be true and it was but to be at a point now where it's like oh no that's what we have now like with the PS4 we're finally getting the things that we were promised like with that Agent trailer remember that I remember looking at that and being like holy crap video games can do this and it's like now they can so anyway shout out to you PS3 so you did good so was very good so I liked Heavy Rain a lot oh man that was the first like great Platinum with trophies yeah I was surprised that they never did that was disappointing",
            "start": 1186.96
        }
    ]
}