{
    "id": 2196,
    "video_id": "4AexWl_WawI",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Persona 5 Delayed - Kinda Funny Gamescast Ep. 95 (Pt. 4)",
    "description": "Persona 5 is delayed until April 4th, 2017.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1479996000,
    "duration": 908,
    "transcript_chunks": [
        {
            "text": "The Kinda Funny Thanksgiving weekend shirt-stravaganza is happening this Thursday, November 4th through Monday, November 8th. You can go to KindaFunny.com/store and get a whole bunch of shirts that are only available this weekend. We're talking Vita Island, we're talking Super Py, we're talking The Year Dismissed. There's a whole bunch of Colin shirts. It's going to be a good time. You should get one, get one for you, get one your friends. It's going to be good. Anyway, Kinda Funny shirts Stravaganza, I just like saying that word. This episode of the Kinda Funny Gamescast is brought to you by MVMT Watches. We get it, holiday shopping can be tough, but thanks to MVMT Watches, all that gift-giving anxiety can disappear with the press of a button. The holiday shopping season's here, and with MVMT, you can skip the crowds and standing in crazy lines at the mall and finally find a gift that all the people you love will love at prices that beat the department stores. These watches make the",
            "start": 0.04
        },
        {
            "text": "you can skip the crowds and standing in crazy lines at the mall and finally find a gift that all the people you love will love at prices that beat the department stores. These watches make the perfect purchase for just about anyone in your life, guy, girl, don't matter. And remember, they start at only $95. You can get 15% off today with free shipping and free returns by going to MVMTWatches.com/Kinda. That's MVMTWatches.com/Kinda. Now it's time for you to step up your watch game. Go to MVMTWatches.com/Kinda. Join the MVMT today. All right, final topic of the day, as always, brought to you by you and Steven Inler. Shout out to Steven Inler. What up, Steep? John, producer forever. Uh, you can leave your questions over at KindaFunny.com/Gamescast/Topic, just like Sherry Berry. Cool, cool. Did nice. Persona 5 delayed? Exclamation mark, question mark. Yeah, looks like it, huh? April 4th. Dang, yo. But with Japanese dual audio DLC for release for free. Yeah, great for those. I know, I'm aware.",
            "start": 38.76
        },
        {
            "text": "Persona 5 delayed? Exclamation mark, question mark. Yeah, looks like it, huh? April 4th. Dang, yo. But with Japanese dual audio DLC for release for free. Yeah, great for those. I know, I'm aware. Persona care. So that's, that's good. What the, the real great news here is that it gets out of the way of Horizon. I can, you can sit there and we can commit to these games. And when both of them hit, you get to jump in there and just go deep on them balls. F*** deep on these games and just enjoy those worlds because that was the big concern. How am I going to balance and juggle Persona and Horizon at the same time? Where's Horizon at right now? The 8th, I think, February. February, I think so. There you, something like that. Cool. Um, I saw this. I wasn't super surprised. I think it's wise for them to vacate uh, areas where they are going to have any overlap with games that are of an exclusive nature on the console. People have to remember Persona is a PlayStation exclusive game. So this is basically, it's not a first-",
            "start": 102.36
        },
        {
            "text": "they are going to have any overlap with games that are of an exclusive nature on the console. People have to remember Persona is a PlayStation exclusive game. So this is basically, it's not a first-party game, but it's basically a first-party game. So to release it a couple weeks before Horizon is a mistake. Um, and I was a little bit of afraid of that. I thought it would kind of persevere and carve out its niche, and it came first, which I think is a big advantage. But to give a little bit more space, and maybe they really did need more time. It doesn't make much sense to me. I mean, the game is out in Japan. Um, so the game's done. The game is ready to go. Um, and I'm, I'm sure that the voice acting, all that's done, and the localization is probably done too. But, um, you know, it's, I, I think giving it space is fine. And uh, people are going to play it when it's time. Um, and I think that's a positive thing. You know, now we don't have to worry about Horizon uh, getting, you know, running into it. Um, because Horizon's",
            "start": 145.84
        },
        {
            "text": "and uh, people are going to play it when it's time. Um, and I think that's a positive thing. You know, now we don't have to worry about Horizon uh, getting, you know, running into it. Um, because Horizon's gonna get way more attention and sell way more copies. So, you know, to get out of that, to get out of that, out that area is, is, is wise and intelligent. There you go. Joey BK says, \"What y'all feel about that? I found a vagina in Watch Dogs. When Sony suspended me fiasco.\" F***. There hasn't been an update, has there? I, I didn't do Connor GL today. They, is the kids' account restored yet? Has that happened yet? I think there is a, I didn't read the his thing. I read the thing Ubisoft said where they were like, \"We're patching it out. We're sorry,\" and all that kind. They're going to work with the first party. It's a little outrageous. It's Catch-22, like we talked about. I mean, it's Ubisoft's fault that this happened. No, it's no one's fault. I mean, Sony responded in a way that I think was a little heavy-handed, but this is",
            "start": 186.08
        },
        {
            "text": "outrageous. It's Catch-22, like we talked about. I mean, it's Ubisoft's fault that this happened. No, it's no one's fault. I mean, Sony responded in a way that I think was a little heavy-handed, but this is Ubisoft's problem. First of all, Ubisoft's probably gonna get fined by the ESRB. Second of all, um, because they have vulgar, completely sexual, X-rated s*** in their game. Uh, whoever put that art in there is done, I would have to assume. And I'm sure they'll be able to trace that back through, through their system. Um, and uh, you know, I'm sure Sony will lift the ban on this person. I'd be shocked. I'm surprised it didn't happen yesterday at this point because that, I'm sure probably by the time we're recording, it may have already happened. Well, yeah, by the time this post, I, I would f***ing hope so. Jesus. Cause I mean, like, it's just such a f***ing thing. I'm like, yeah, like, and not to mention that I wouldn't even think that, you know what I mean? Mean, if, and if he had screencapped that and then taken it on a USB and",
            "start": 226.28
        },
        {
            "text": "like, it's just such a f***ing thing. I'm like, yeah, like, and not to mention that I wouldn't even think that, you know what I mean? Mean, if, and if he had screencapped that and then taken it on a USB and tweeted on his own, would he have been fine? Was it the fact that he did it through PlayStation 4 Share? Is that what, how? I mean, like, I mean, it must be, right? Yeah. And that's so weird. I never, ever would have thought about that. That if I'm, if I'm seeing something in a video game and I'm tweeting it out, like, why of all the decapitations and f***ing horrible ass murders, oh my God, it's a, it's a vagina. It's a cress panties. I mean, it shouldn't be in the game, right? I mean, like, I, I have no problem with sexual V vulgarity, but that having that kind of stuff in the game, you wouldn't even be able to sell Watch Dogs on a shelf. I mean, that this, this is a bigger, this is a bigger problem than I think people are letting on from a Ubisoft point of view. Uh, they really, they lied to the ESRB, whether they did it",
            "start": 262.68
        },
        {
            "text": "Dogs on a shelf. I mean, that this, this is a bigger, this is a bigger problem than I think people are letting on from a Ubisoft point of view. Uh, they really, they lied to the ESRB, whether they did it intentionally or unintentionally. I'm sure they did it unintentionally. Um, this is in the game. Some artist put it there and, and, and no one noticed it, or people noticed it and didn't think it was a big deal. And so it was out there and it took no time. The game wasn't even out yet by the time this was discovered. So I can't imagine the sheer number of vaginas that are going to be found before this patch, this patch comes out. Uh, I think Sony responded in a way that is logical. Mhm. And I think this all traces. I don't think it's right, and I think they should overturn. I think they will. But I think that that you have to point fingers at Ubisoft. They're the ones that f***ed this up. Yeah, man, it's, it's crazy though, because the game being based in San Francisco, like the video I saw was just a character running",
            "start": 300.76
        },
        {
            "text": "have to point fingers at Ubisoft. They're the ones that f***ed this up. Yeah, man, it's, it's crazy though, because the game being based in San Francisco, like the video I saw was just a character running around naked, like a dude with a dick flopping around. And it's just like, that's San Francisco. Well, that's fine, right? Or is that not fine? The dick, guys, that's fine. Oh, was, is that fine? No one's talked about it. I, I've seen there's a woman, I mean, like, you go to a nudist colony, her breasts are out. And then, yeah, I saw the, the dick dude, and that was fine. It was the fact that it was this fully textured, you know, like rendered vagina. It was, it wasn't like what I saw on NE, what I was looking through, like the video I clicked on was, it was a dude with a dick. No, the, the picture that the guy sent out was a girl passed out on the sidewalk with her legs spread, and it's just a vagina. Like, it's not even like a, I'm not trying to be vulgar, but it's not even like a slit or anything like that. It is a vagina. Like,",
            "start": 338.24
        },
        {
            "text": "passed out on the sidewalk with her legs spread, and it's just a vagina. Like, it's not even like a, I'm not trying to be vulgar, but it's not even like a slit or anything like that. It is a vagina. Like, that someone went in, zoomed in, rendered, drew, and it's on the woman's body. And yeah, I don't think it's a, I, I don't need to see that. I don't, I, the children see that. People, the children, think of the children. They're going to blow people's heads up, but don't show them any vaginas, for God's sake. F***. And I guess, is that, I mean, that would be the way to get around it. I have to go look at what the ESRB entry for Watch Dogs 2 is. But if they list that there's penises flopping around, no big deal. But if they don't list that there's a vagina there, that's when trouble. There are, there games with penises in it? Yeah. Oh, remember, uh, f***, when you fight Satan in the uh, Dante's Inferno, he's got, they had such a big deal about his dick swinging physics. Remember The Order? He got these vampire werewolf dick",
            "start": 378.64
        },
        {
            "text": "in it. Yeah. Oh, remember, uh, f***, when you fight Satan in the uh, Dante's Inferno, he's got, they had such a big deal about his dick swinging physics. Remember The Order? He got these vampire werewolf dick monsters at the end of it running around. There's gotta be a way to get away with it though, because that s*** shouldn't be allowed in the games, um, for their, for, for R-rated or M-rated games. But see, that, that's the thing though, is I, there's a difference though, between sexually explicit content and nudity, right? Like, it's the same thing on YouTube where it's like, nudity can be okay in certain, if it's educational, or if it's just, if it's art, if it's pornography, sexually charged. So like this, like in Watch Dogs, I don't know, I don't know where that would fall in. Um, and yeah, the ESRB is kind of, they're hard asses. So I mean, this is gotta be just the argument. I mean, everybody's afraid of the vagina, right? That's the thing here. Because I mean, tits have been in games before too, and it's an M-rated game, and it's",
            "start": 415.24
        },
        {
            "text": "so I mean, this is gotta be just the argument. I mean, everybody's afraid of the vagina, right? That's the thing here. Because I mean, tits have been in games before too, and it's an M-rated game, and it's fine. Dicks have been a game, it's fine. Oh, yeah, there are breasts in, in the games for sure. But, um, yeah, the ESRB, they, I don't necessarily agree with what, I don't think games should have ratings at all. But the fact of the matter is, is that, and I feel that way about movies too. I just feel like it's kind of silly. It's like, who, like, you know, we can make our own decisions. But the, the ESRB is the only thing that's keeping us from having a governmental panel that does this for us. And so they need to be hard asses, and they should fine Ubisoft significantly for this because it should discourage people from doing this. Going, someone went rogue at Ubisoft. No one in the f***ing design documents was like, \"Render, take time and render vaginas on this woman, please.\" It's like, it was just, it was just tonee and stupid and",
            "start": 458.36
        },
        {
            "text": "this going, someone went rogue at Ubisoft. No one in the f***ing design documents was like, \"Render, take time and render vaginas on this woman, please.\" It's like, it was just, it was just tonee and stupid. And, and uh, someone should be held to account for that so that we don't have the f***ing media. And I'm surprised the media hasn't picked this nonsense up and made the entire industry course. People have to think about how these, these, these things can have repercussions on all of us, you know? Um, as we're trying to fight this, it goes back to Mass Effect and all the sure, you know, it's like, \"Huh, you don't want to track these Fox News and MSNBC types.\" Nope. Div Dad says, \"Greg, hey, what's up with Lego Dimensions?\" What's not up with Lego Dimensions? It's great. And there's another wave out this week. So by the time you get that, you got the new Fantastic Beasts Story Pack. You play through the whole movie. Haven't played it yet. The content hasn't gone live as of recording because they don't want you to spoil the movie. You're",
            "start": 495.04
        },
        {
            "text": "that you got the new Fantastic Beasts Story Pack. You play through the whole movie. Haven't played it yet. The content hasn't gone live as of recording because they don't want you to spoil the movie. You're also getting big Sonic, big Sonic coming out on this one. You get the Gremlins, the big GMS, as they call him. You got Gizmo, Stripe, not Spike. I got in trouble in my last play for saying Spike. But I don't really remember that Gremlin 2. I, Gremlins, the original. I guess Gremlins 2, a movie I haven't watched as an adult, like, sat down and watched in forever. I, and as an adult, I guess never is what I'm saying. You know what I mean? Because the movies take on a different. I haven't seen in, yeah, great movie. Decades. Yeah, yeah. Uh, who else is in this uh, pack? I got him in there. Some of them E.T.s out this time around. Yeah, going home, doing some cool stuff. More, more. I'm excited for this part of year content. The initial thing was like Adventure Time and Mission: Impossible. And I was like, excited for new figs",
            "start": 533.96
        },
        {
            "text": "around. Yeah, going home, doing some cool stuff. More, more. I'm excited for this part of year content. The initial thing was like Adventure Time and Mission: Impossible. And I was like, excited for new figs and new stuff. But I was like, now Sonic's there. Play through the Ghostbusters movie. All right, you know what I mean? Like, no, the, these are actually cool things. Shawn on Twitter, he has Shawn on Twitter, S-H-A-W-N. Damn, wow. He says, \"My friend and I have been debating this for months. Is Punch-Out!! part of the Mario Universe?\" No, it's not. Just straight up no. I mean, he's the referee in it. I don't think that like, he's, he's like an Easter egg cameo character, right? I'm not, I'm always of the mind that Mario is not even the same Mario. It's like the whole theory of like, these are different Marios in different times and different places. I'm not sure that there's one, even one Mario. I don't care what anyone says. This goes back to the, to the Mushroom Kingdom and all the things we draw on whiteboards like psychotic",
            "start": 568.28
        },
        {
            "text": "and different places. I'm not sure that there's one, even one Mario. I don't care what anyone says. This goes back to the, to the Mushroom Kingdom and all the things we draw on whiteboards like psychotic people. Um, no, no, no, no. I, it's funny you say that though. I was just, just playing Punch-Out!! on the NES Classic this past. So I guess I did play other games other than Call of Duty, cause I played a lot of NES Classic actually. I played uh, through Mega Man. I played through Castlevania, Castlevania II. You know, played a little bit of Zelda and other things. So I actually, I guess played a lot of games. But um, and Mario 3. Um, played Punch-Out!!. I'm like, God damn, this game's f***ing good. This, this is just, I know that they made one, they made one on SNES, obviously wasn't nearly as good. And then they made the Wii one, which was a little weird. And people are having problems with it because of the reaction times on, on, you needed really a CRT to even play it. Uh, and I was like, so it is, it is good, but none of them recapture",
            "start": 615.84
        },
        {
            "text": "was a little weird and people are having problems with it because of the reaction times on, on, you needed really a CRT to even play it. Uh, and I was like, so it is, it is good, but none of them recapture that essence. And I was like, try again one day. I really like it to do that. They are really, really clever games when you think about when that game came out. I mean, Punch-Out!! from its perspective and what it was doing, there's nothing like it. That game is just as unique in a lot of ways as everything else they were releasing. I mean, Punch-Out!! was after that first wave of great NES games like Metroid and Kid Icarus and obviously Mario Brothers. Um, and it's so special. And I feel like it's a game that a lot of people don't talk about. It's f***ing really hard too. Um, but you can figure it out. It's easy to game that game until the very end. At Nightcrawler says, \"With Dishonored 2 out, how do all of you guys enjoy stealth games? Do you play stealth games all the way through or just kill everything?\" Man, it",
            "start": 652.64
        },
        {
            "text": "game that game until the very end. At Nightcrawler says, \"With Dishonored 2 out, how do all of you guys enjoy stealth games? Do you play stealth games all the way through or just kill everything?\" Man, it depends on the game, I think, you know what I mean? When I'm, you're talking about a Metal Gear, right? I try to do stealth. I try to go through and not f*** around. And then it gets that point inevitably where somebody spots you and it all goes to hell and you start shooting. You run. I think as you, I think Metal Gear Solid V, that was the best version of it because it was, or yeah, now that was the best version of it, cause there were so many different ways to take it on. And once you knew the map and once you knew where people would normally be positioned, that's when you really came in and started feeling like f***ing Snake. And you really felt like you had this by the balls and you could get this. Um, we talked about it, you know, on PS I Love You XOXO, and then a bit on last week's Gamescast. But like,",
            "start": 689.92
        },
        {
            "text": "like f***ing Snake. And you really felt like you had this by the balls and you could get this. Um, we talked about it, you know, on PS I Love You XOXO, and then a bit on last week's Gamescast. But like, the way I'm playing Watch Dogs 2 is I'm, you know, my Marcus is never really involved. If, if everything goes according to plan, nobody really knows what's happening. There's robots coming in and I'm scouting everything out and I'm slinking in the shadows and doing all this different stuff. I love playing it that way. And that's one of the reasons I think Watch Dogs 2 is so much fun right now. And the fact that you can tackle it how you want to tackle it. And I'm choosing to be this very techy hacker that like, that never worked for me in the original Watch Dogs. And then watching that Watch Dogs 2 demo we've talked about so many times at E3 of infiltrating that high-rise and seeing him shoot people and stuff. I'm like, this doesn't feel like what this game should be. And I'm playing the game the way I feel",
            "start": 729.16
        },
        {
            "text": "talked about so many times at E3 of infiltrating that high-rise and seeing him shoot people and stuff. I'm like, this doesn't feel like what this game should be. And I'm playing the game the way I feel it should be. And I'm having a f***ing awesome time with it. Yeah, with those type of games, specifically Metal Gear, uh, like Metal Gear Solid 4 and 5 are the more action-oriented. You before, and then you get frustrated and you go and guns blazing and the entire time is wasted. Um, I get sucked down that cycle sometimes. So there are, I like, um, Dishonored 2 appeals to me more in that respect because it's more linear, uh, and quarter based. So, uh, it doesn't get as wide open and I don't think there's many intangibles. But typically, I don't like playing those kinds of games. The, with that said, that game Sniper, that new Sniper Elite that comes out next year, I played it at E3 and uh, I was really into it. I was like, this is really fun and really cool. The games that are methodical have a place. Yeah, at Redo says,",
            "start": 766.16
        },
        {
            "text": "that new Sniper Elite that comes out next year. I played it at E3 and uh, I was really into it. I was like, this is really fun and really cool. The games that are methodical have a place. Yeah, at Redo says, \"What's up with Crash Bandicoot? And how come there hasn't been any news on the remaster?\" I assume there's not much to say. It'll be coming out probably early next year. And I'm, we're going to get the, the trailer and the date and the first gameplay footage and all that stuff. So I'm very excited for that because that's coming up soon too. Couple weeks away. PSX. Yeah. Oh man, we need to do that predictions topic for PSX. We do. We should talk about that next week. Um, and then the final question comes from Sigle. He says, \"Xbox anniversary. Share some memories. Talk about Halo and its influence on games and first-person shooters.\" Well, guess what? We're going to have a whole topic about that next week. Uh, I was going to make that a topic today, but I decided that we should get somebody that's a bit more Xbox",
            "start": 828.64
        },
        {
            "text": "first-person shooters. Well, guess what? We're going to have a whole topic about that next week. Uh, I was going to make that a topic today, but I decided that we should get somebody that's a bit more Xbox-centric uh, to, to add to the discussion. So it's not just you guys hearing the same stories you already have a million times. So Alfredo Diaz will be joining us. We're going to be talking about that. It's going to be pretty exciting. I like that Alfredo Diaz. I do like him. It's been a while. It's been a while since I've seen him. He's got muscles. I don't know. Anyways, love you all. We'll see you guys next week. Until next time, I love you. Bye.",
            "start": 873.64
        }
    ]
}