{
    "id": 2151,
    "video_id": "4cmHdiHsSxU",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "The SAG-AFTRA Voice Actor Strike - Kinda Funny Gamescast Ep. 92 (Pt. 3)",
    "description": "We discuss both sides of the SAG-AFTRA voice actor strike.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1478091600,
    "duration": 1902,
    "transcript_chunks": [
        {
            "text": "this episode of Kinda Funny Gamescast is brought to you by MVMT Watches, that's you know MVMT Watches. It was founded on the belief that Styles shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion by offering high-quality minimalist products at revolutionary prices. We got ours, they're legit. Kevin Coello says that his is sexy as hell and it fits really well. Those are paraphrased quotes, but it kind of gets the spirit across. The company started by two broke college kids that wanted to wear stylish watches but couldn't afford them, so they started their own watch company. Kind of sounds like when we left IGN to do our own thing because you know we wanted to do our own thing. I respect that. MVMT Watches starts at just $95. At a department store, you're looking at hundreds of dollars. MVMT figured out that by selling online, they're able to cut out the middleman and retail markup, providing the best possible price. We're talking classic",
            "start": 0.08
        },
        {
            "text": "store, you're looking at hundreds of dollars. MVMT figured out that by selling online, they're able to cut out the middleman and retail markup, providing the best possible price. We're talking classic designs, quality construction, style, minimalism. Over 500,000 watches have been sold in over 160 countries. Here's the deal: you can get 15% off today with free shipping and free returns by going to MVMTWatches.com/Kinda. The watch is a really clean design. Seriously, Kevin's making compliments, everybody's loving him. Now's the time to step up your watch game. Go to MVMTWatches.com/Kinda. Join the movement. That's the tagline I like a lot. Next topic, the voice acting situation. Colin, SAG-AFTRA, you got some papers, you got some notes. You asked me to do a little research for you, so I just I just printed out a few things, uh, three things in particular. We'll read through them, but the so basically what's going on is that uh voice actors that are represented by SAG-AFTRA, which is a union, Screen",
            "start": 37.4
        },
        {
            "text": "printed out a few things, uh, three things in particular. We'll read through them, but the so basically what's going on is that uh voice actors that are represented by SAG-AFTRA, which is a union, Screen Actors Guild Union, uh, have have gone on strike. This is fewer than 5% of G fewer than 5% of games are affected by this in terms of the voice actors from this being involved in those games. So I don't really know how how significant of a strike this is to be perfectly frank. Um, but on SAG-AFTRA's own website, this is this is their their call to action, right? This is what this is what they say, this is what the unions say why they're going on strike. And it and here it says, 'Why We Strike.' Very very overhead cam says SAG-AFTRA tried for more than 19 months to negotiate a new deal with employers in the video game industry. Meanwhile, performers have been governed by the more than two-decade-old contract still in place that has left voice actors without the protections necessary to work in the modern",
            "start": 95.32
        },
        {
            "text": "video game industry. Quote, 'SAG-AFTRA has gone to the negotiations table with serious concerns affecting voiceover and stunt performers. It's time for video game employers to take our concerns seriously and negotiate a modern contract based on actor safety, industry precedent, and best practices,' uh, end quote. And that's according to Chief Contracts Officer Ray Rodriguez from SAG-AFTRA. And then uh KY Farley, a voice actor, casting director, and voice director who chairs SAG-AFTRA's interactive committee said, quote, 'SAG-AFTRA doesn't want a strike, who does? But we cannot stand by and watch our members suffer serious injury and put their careers at risk in the current environment. The time is now for contracts of our members.' So first of all, they're going after a select few publishers and and developers amongst",
            "start": 139.84
        },
        {
            "text": "injury and put their careers at risk in the current environment. The time is now for contracts of our members. So first of all, they're going after a select few publishers and and developers amongst them: Activision, Disney, EA, Insomniac is one of them, which is interesting. Take-Two, WB, and some others you have never heard of. See, I think real quick for a context, I think that's why the 5% matters. The fact there's tons of voice actors, but how many voice actors are working on the AAA huge games? We're talking about Nolan North, we're talking about Troy Baker, we're talking about Travis Willingham, we're talking about people who are SAG, sure. And it says, 'What does the strike mean for you? A strike means withholding your services from employers who are not willing to agree to the terms and conditions that you and your fellow members are insisting upon. It is this ultimate show of solidarity that allows us to achieve difficult gains in your contract. You may continue to work in other non-struck areas,'",
            "start": 175.52
        },
        {
            "text": "you and your fellow members are insisting upon. It is this ultimate show of solidarity that allows us to achieve difficult gains in your contract. You may continue to work in other non-struck areas, but your membership obligates you to not render services on struck games. The success of a strike will depend not on not only on members uh honoring the strike order, but also on showing their support. So please see what you can do now, which we're not going to read about. They're they've identified, uh, do I have I think I might have their own last paper away. No, I guess not. They've identified four major issues. Talk the companies, there's Insomniac. No, talking about the issues of why they're striking. What are the issues? There are four of them. Secondary compensation: Unlike many other SAG-AFTRA contracts, there is currently not a secondary compensation structure on any video games. We're asking for a reasonable performance bonus for every 2 million copies or download sold or 2 million unique subscribers",
            "start": 212.44
        },
        {
            "text": "is currently not a secondary compensation structure on any video games. We're asking for a reasonable performance bonus for every 2 million copies or download sold or 2 million unique subscribers to online-only games with a cap at 8 million units or subscribers. That shakes out to potentially four session payments per principal performer for the most successful games: 2 million, 4 million, 6 million, 8 million copies. Producers hide important information: Transparency is lacking in the video industry. Actors need to know more about the projects that they are working on. SAG-AFTRA has proposed that the actual title of the project and the role being hired for should be made available before signing a contract. Video game employers routinely engage performers without identifying the role or even the game that the performer is being engaged to work on. Moreover, they refuse to provide basic information about the nature of the performance that will be expected of them. This deprives the performer of",
            "start": 248.88
        },
        {
            "text": "game that the performer is being engaged to work on. Moreover, they refuse to provide basic information about the nature of the performance that will be expected of them. This deprives the performer of the ability to make a meaningful decision about whether to accept a role or to negotiate appropriate compensation if they do. 'Precedent is on our side here. You wouldn't work on a TV show, commercial, or film without knowing what part you're playing and how it fits into the story.' Yeah, we are asked over and over again to do this in interactive media. 'Employers are not taking you seriously,' is number three. It says, 'The employers have said no to most of SAG-AFTRA's proposals and haven't taken these negotiations seriously. For instance, in response to our concerns about vocal safety, they offer to put more tea and water in the booths for the actors, something they already do, and this doesn't resolve the issues or protects the actors.' Um, and then they go into saying that the original SAG-AFTRA Interactive",
            "start": 279.68
        },
        {
            "text": "tea and water in the booths for the actors, something they already do, and this doesn't resolve the issues or protects the actors. Um, and then they go into saying that the original SAG-AFTRA Interactive contract was originally written in 1994 and video games have changed, right? That's what they're talking about when they're talking about secondary compensation, the number of units that are being sold. When they're talking about getting higher, you know, as you talk to any of the guys we bring in here, right? You're going out for Batman, you don't know you're going out for Batman in the Batman game until super late because you're told that you're this shadowy character, this that and the other, and you know you're working with Warner Bros. That could be a million different things, right? And of course, yeah, now they're talking about with the voice acting stuff, the fact of how crazy they make you act your voice, and then of course the stunts that are involved when you put on a mocap suit. Um, so to",
            "start": 309.4
        },
        {
            "text": "yeah, now they're talking about with the voice acting stuff, the fact of how crazy they make you act your voice, and then of course the stunts that are involved when you put on a mocap suit. Um, so to present the other side of the argument, the video game industry released uh their own information about these problems, these issues. Um, and this came out on the 24th, so this was several days after the strike began. Uh, and this information comes from uh PR Newswire, so just a newswire uh PR releases. Um, and it says, 'Video game companies today released copies of the companies and the Union's last proposals, which show that the companies matched SAG-AFTRA's request for wages, benefits, and additional compensation before the union called it strike. The documents also show that the companies and the union had reached to a collaboratively investigate vocal stress issues during the term of the next contract.' Uh, quote, 'These proposals exchanged across the table prove that companies and SAG-AFTRA have",
            "start": 342.56
        },
        {
            "text": "union had reached to a collaboratively investigate vocal stress issues during the term of the next contract. Uh, quote, 'These proposals exchanged across the table prove that companies and SAG-AFTRA have largely agreed on the significant issues before us, except for the label we have placed on the additional compensation, which would be paid above and beyond our proposed 9% pay increase. The documents also demonstrate that the companies value performers and reached agreements with the Union in the issues of vocal stress.' That's according to Scott J. Witlin of the law firm who's negotiating for the video game companies. Witlin reiterated that the companies have been impressed by the research presented by SAG-AFTRA into the issue of vocal stress. The companies attempted to address the concerns raised by SAG-AFTRA bargaining committee during negotiations by offering performers innovative working arrangements, including split sessions and multiple performer sessions.",
            "start": 381.68
        },
        {
            "text": "concerns raised by SAG-AFTRA bargaining committee during negotiations by offering performers innovative working arrangements, including split sessions and multiple performer sessions, but those proposals were rejected by SAG-AFTRA. Quote, 'Among their proposals, the companies offered to split a four-hour recording session into the two two-hour portions, with the second session to be performed within five days of the first session to ease the stress of performers. But this and other offers were rejected by SAG-AFTRA. This is an area that the parties have agreed to continue to collaboratively investigate during the term of the next contract. Exploring ways to further improve working conditions is something both sides should be committed to,' the lawyer said. So the things that and I I know this is going on, but I do want to present the other side, it's important. Um, so this is what the gaming industry said that they've done. They've offered a 9% wage hike. The companies exceeded",
            "start": 413.52
        },
        {
            "text": "I I know this is going on, but I do want to present the other side, it's important. Um, so this is what the gaming industry said that they've done. They've offered a 9% wage hike. 'The companies exceeded the Union's request for a 3% raise over each of the next three years by companies offering a 9% upfront increase, but only if a new agreement is ratified by December 1st.' Additional compensation: 'It says in the company's final proposal, the companies increase the maximum amount of additional compensation to match the amount of the Union's request for a contingent compensation buyout up to $950.' Well, the companies have held to their position that there will be no contingent compensation. So what they're saying is, well, we'll get into that. 'The the companies have proposed a schedule of additional compensation that largely matches SAG-AFTRA's last demand, including the total aggregated figure and the number of sessions necessary to earn that amount. This too must be ratified by December 1st to become'",
            "start": 444.2
        },
        {
            "text": "that largely matches SAG-AFTRA's last demand, including the total aggregated figure and the number of sessions necessary to earn that amount. This too must be ratified by December 1st to become effective. Pension and health contributions: 'The companies agreed to the Union's request for a 0.5% increase and have agreed in principle regarding which of the benefit plans the money should be directed to.' Vocal stress issues: 'After the union rejected the company's proposals concerning modifying voiceover sessions to mitigate any risk of vocal stress, the parties agreed on forming a joint cooperative committee to study vocal stress issues.' Stunt coordination, which is not something that SAG-AFTRA seems to even really give a **** about, at least in this. Well, yeah, I think this is their boilerplate, not down drill down. I have heard about stunts. 'The uh expired interactive media agreement between companies and SAG-AFTRA already provides for a stunt coordinator to be on site for sessions that include stunts.'",
            "start": 480.56
        },
        {
            "text": "drill down. I have heard about stunts. 'The uh expired interactive media agreement between companies and SAG-AFTRA already provides for a stunt coordinator to be on site for sessions that include stunts. While SAG-AFTRA made no new proposals in this area, it did seek further clarification about the use of stunt coordinators, and both sides agreed to continue to those discussions through the cooperative committee during the new term, the term of the new agreement.' And then transparency: 'It says the union proposal requested additional upfront information about when booking performers in video games to know more information: game title, uh, name, new role or reprise of a previous role. The companies enhanced their proposal to agree to provide the code name of the project and whether the performer will be asked to reprise a previous role. While SAG-AFTRA contends that the video game industry is the only industry not to require an employer to reveal the name of the projects on which a performer is'",
            "start": 513.64
        },
        {
            "text": "be asked to reprise a previous role. While SAG-AFTRA contends that the video game industry is the only industry not to require an employer to reveal the name of the projects on which a performer is working, SAG-AFTRA has no such requirement in television, Theatrical Motion Pictures, or animation agreements. So that's the other side. Mhm. Um, and what's happened since then is basically uh SAG-AFTRA has gone on strike and has um picketed EA in LA, um, EA's LA office. Um, and that's basically where we stand. So that's all the information. Thank you very much, Colin. I know that was very long-winded, but I do want to present both sides. No, very important. So I mean, what what are the immediate takeaways from this? So they are to boil this down into like English that people can really understand. Yeah, what where are they apart right now? This sounds like they're trying to get royalties for games after the release, so that from the biggest companies, from the biggest companies, so that they get paid to for doing the job,",
            "start": 545.6
        },
        {
            "text": "apart right now. This sounds like they're trying to get royalties for games after the release, so that from the biggest companies, from the biggest companies, so that they get paid to for doing the job, but then also get paid based on the you hit 2 million sales of Call of Duty, suddenly that voice actor gets more. 4 million sales, more. They're also trying to get uh better work environments, so that they're talking about about the uh the pain or whatever, the um most I don't forgot the words they're using, but the vocal the stress. Yeah, the vocal stress is just like, okay, so better work environments for that stuff. And yeah, so all that stuff sounds reasonable to to request. I think the important thing is that I think that it's good that they're trying and fighting for this stuff, 'cause you should stand up for whatever it is that you're doing and try to get the most out of it, whether or not it's going to pass and needs to pass. I think that's the the real discussion there. I mean, that's what's",
            "start": 587.44
        },
        {
            "text": "stand up for whatever it is that you're doing and try to get the most out of it, whether or not it's going to pass and needs to pass. I think that's the the real discussion there. I mean, that's what's fascinating about it. I've talked to a lot of voice actors about this off the record or you know, just not in like an interview sense, obviously. And what's always interesting is the ones who are all for it, that they feel this is the way of the future, and then the ones who aren't, the ones who are very much like the what's interesting when you talk to people about this, at least the conversations I've had with multiple voice actors, is that at some point we get down to the developer. And the people who are pro-striking right now, what I hear a lot is, 'We're doing this so that we can that the developers could follow suit and the people who are making the game for two years could also see say get get a bonus for hitting 2 million, for 4 million, for you know, basically seeing their project be'",
            "start": 623.96
        },
        {
            "text": "could follow suit and the people who are making the game for two years could also see say get get a bonus for hitting 2 million, for 4 million, for you know, basically seeing their project be successful trickle back to them, right? There's the the argument for the pro-strike people there. The people who are against the strike are saying, 'I don't see why I should be compensated like this if they're not if the developer isn't compensated the exact same way.' And that's where there's this interesting thing where in the middle are the developers to some extent, but no side has it. They're both fighting for them in different ways, if that makes sense. And that's why the whole thing's kind of cumbersome and weird. Exact. And that's what it goes back to what I was saying of like, I think that it's important that they're fighting for it, even that's not to say that they're more valid and deserve it more than the developers. The developers should be fighting for it as well. Uh, when you look over on the film",
            "start": 665.56
        },
        {
            "text": "that they're fighting for it, even that's not to say that they're more valid and deserve it more than the developers. The developers should be fighting for it as well. Uh, when you look over on the film and TV side of it thing, there is rules, there's a setup for how this all works. You know, industry that has the unions and everything have grown over the years to now it's like, this is how it is, this is the way that this things these things go. We saw with the Writers' Strike years ago, um, that how that fundamentally affected TV and made TV worse. Terrible season. Yeah, exactly. Like it it really had a true effect on the industry because there was a talent pool that required a certain amount of uh compensation in this and that, and they weren't getting it. And when they didn't have that, there was a vacuum of of nothing. Um, the question here is like, all right, if these people were to strike and not do it, is is there still room for other people? Like, is there still does this just allow others to to move up? Yeah.",
            "start": 705.08
        },
        {
            "text": "nothing. Um, the question here is like, all right, if these people were to strike and not do it, is is there still room for other people? Like, is there still does this just allow others to to move up? Yeah. Um, well, I think that's one of the things that the video game publishers are relying on, that there are, right? The fact that there are like, that's one of the arguments you see when you're I follow a lot of voice actors and they're tweeting things out and stuff and they're referencing other tweets or statements where they feel like voice actors are replaceable, right? And I think it's no coincidence that this is coming up from SAG-AFTRA as we see voice actors now rising to a celebrity status where you see like Ashley Johnson is Ellie, right? Troy Baker is all these different characters. Nolan North, you can go down this list of people that are these characters, are these names that are on in Up at Noon, that are going to a Comic-Con. Like they are out in front of this in a way that they never were before.",
            "start": 750.8
        },
        {
            "text": "go down this list of people that are these characters, are these names that are on in Up at Noon, that are going to a Comic-Con. Like they are out in front of this in a way that they never were before. Remember how weird it I remember, you know, the first time we brought um Rob Paulsen through Up at Noon and he keep, 'You guys are treating me like a celebrity!' It's like, 'Well, it's 'cause you are! You're you're **** Yakko, you kidding me right now?' Like, you are this name amongst names. And through podcasts and through Twitter and through, you know, shows on IGN or wherever, people are seeing that and they people are getting followings. Yeah, I mean, so when you speak about the the film or TV side of the whole thing and the royalties and all that, there's above the line and below the line in production where the I don't remember the exact fallout of all of it, but I mean like there's there's actors, there's directors, there's these people that are considered above the line and below the line is the production",
            "start": 789.92
        },
        {
            "text": "I don't remember the exact fallout of all of it, but I mean like there's there's actors, there's directors, there's these people that are considered above the line and below the line is the production stuff. It's the the Director of Photography, like these people that are making the thing happen. Like without them, it really does not happen, but they don't get the same type of credit. It's you don't see uh title uh this guy film for the Director of Photography, you know what I mean? You get it for the director. I think that directors, um sometimes producers and uh actors are the ones that get the credit. They're the ones that get the royalties. They're the ones that kind of grow in that way. When it comes to video games, it's like, well, what's the difference? And what are those roles? And that's not to say that any of the people below the line don't deserve the thing, but until they fight for it and get it, they're not going to have it because the money needs to go somewhere and the profits, the all these",
            "start": 828.48
        },
        {
            "text": "that any of the people below the line don't deserve the thing, but until they fight for it and get it, they're not going to have it because the money needs to go somewhere and the profits, the all these people are making this thing to make money, right? And if all the money is then being made and going right back to the people making it, you're not making money. You know, there's somebody that's higher up that's expecting uh a split and a huge revenue stream coming in that it's not all just the thing to make sure people have jobs, you know what I mean? That's what the unions are for, and that's why I think that this type of thing is very important, but it there needs to be some type of uh distinguishing factor between where is the line? Where is the line? You know, what roles need to be deserved like deserved to get uh royalty-style revenue for if the game does better? Call of Duty does super well, what does that mean? And I think that as we we grow, like there's this this thing of voice actors and what",
            "start": 868.04
        },
        {
            "text": "to get uh royalty-style revenue for if the game does better? Call of Duty does super well, what does that mean? And I think that as we we grow, like there's this this thing of voice actors and what you're talking about about them being celebrities and stuff. There years ago, if you were to talk about who are the people, the names known in video games, there's Cliff Bleszinski and Miyamoto and Kojima, and that's pretty much it back then, right? A couple other ones, but whatever. Then as the years went on, then you start thinking about Dan Ryckert, Jeff Gerstmann, Greg Miller, Colin Moriarty, right? Like those names start getting into the fold too. I think the step after that became Troy Baker, Nolan North, where these are now people that have followings based on who they are and what they do in the the industry. And then then there's the thing of people look at them as not just voice actors, but as actors, and they they really stress that they were actors. And now in video games, they're not just voice actors, they're not",
            "start": 911.16
        },
        {
            "text": "then there's the thing of people look at them as not just voice actors but as actors and they they really stress that they were actors and now in video games they're not just voice actors they're not just going in and doing a 4-hour uh whatever session then another 4-hour session then another 4-hour session and then they're done these are people you did the panel for Call of Duty: Infinite Warfare San Diego Comic-Con with the entire voice cast of the game and they're talking about how they spent a year working together in the motion suits doing scenes together it's like making a movie and I think that's the big thing of what one of the interesting things we haven't touched on is the fact that you know we're mentioning Rob Paulsen we're mentioning Troy Baker we're mentioning all these actors who do video games but also are on syndicated cartoons they understand how that works how how if they can get a show on TV and they can be a voice there the money they are making versus what",
            "start": 958.44
        },
        {
            "text": "actors who do video games but also are on syndicated cartoons they understand how that works how how if they can get a show on TV and they can be a voice there the money they are making versus what they're making in a video game and like wait a second why am I being treated so much better on this side of the entertainment industry than I am here and that's part of the balancing act too I think you're seeing where people are like hip to the game of what it's like to be well on if I'm in a show and it it gets syndicated and it's everywhere I get you know checks the rest of my life granted maybe not for thousands of millions of dollars or whatever but it's out there you're getting money it's just a one time payment and that's the thing is like with video games it's like I don't know how it all shakes down you know I'm not in the the weeds with that but it's like all right Uncharted sells X amount what does that mean for Neil Druckmann yeah right like if he writes directs this and that like",
            "start": 995.2
        },
        {
            "text": "shakes down you know I'm not in the the weeds with that but it's like all right Uncharted sells X amount what does that mean for Neil Druckmann yeah right like if he writes directs this and that like how does that affect him versus you know uh random level designer or this or that and it's like I feel like there's an obvious disparity there like yeah he should get more but it's like what is the difference there what about Nolan North in that equation right like where why does he deserve equal less more whatever like I don't know but I feel like that's where the all the unions come in and all the that stuff and the fact that there is a precedent in TV and in movies and stuff that it is kind of a their their point about they want to do this so that the other people can then be able to see how it works there's something to that but I also think that that is it's a little uh disingenuous just in the sense that like that's not how things work you know like I feel like it's if that was the",
            "start": 1033.12
        },
        {
            "text": "it works there's something to that but I also think that that is it's a little uh disingenuous just in the sense that like that's not how things work you know like I feel like it's if that was the real goal it I feel like it'd be important to focus on unionizing them as well and doing it as a united front to kind of make video games more like TV and movies if that's the goal if that's what they're trying to do I think it needs to be overall because that's what TV and movies are there are there are rules There are rules that are designed a certain way and for better or worse they've been they've existed for decades yeah I I don't know I mean I I see like I tweeted out about it talk to people about I see both sides of the argument um voice actors what voice actors do is incredibly hard and I think important um part of me feels like um uh it's as important or more important than they say and part of me feels like it's not as important as as as some voice actors make it out to be and I",
            "start": 1072.56
        },
        {
            "text": "I think important um part of me feels like um uh it's as important or more important than they say and part of me feels like it's not as important as as as some voice actors make it out to be and I say that with all due respect because I have plenty of voice actors that are friends of mine I also have plenty of developers that are friends of mine and so I I see the particular argument where it comes I don't remember who it was some pretty prolific Canadian developer I remember last year tweeting out when this was kind of being talked about for the first time I guess when negotiations began saying something like the the gaming industry is wildly broken if um people that work on the game for literally weeks um are getting these backend payments when we work on the game for years you know and get nothing from voice actors not just developers yeah and I think that that's a completely fair thing and the example I use to that point where I think I fall more on the side of like how this is a",
            "start": 1114.96
        },
        {
            "text": "get nothing from voice actors not just developers yeah and I think that that's a completely fair thing and the example I use to that point where I think I fall more on the side of like how this is a little ridiculous is um a sports uh union like the NFLPA right the kicker and the backup lineman and the uh backup center are in the same union that the star quarterbacks in they all benefit that entire unit benefits from the union gains whether it's the minimum salary whether it's arbitration all those kinds of things the voice actors are on the periphery of the game development thing and they'll get all of the the financial backend gains even though this entire team of people actually allowed this to happen you know allowed this game to be created and there's a there's a there's an interesting argument to be made there that to what you were saying which is that like the entire unit needs to be unified and unionized for this to work and uh I don't think it's going to because I don't think",
            "start": 1150.68
        },
        {
            "text": "argument to be made there that to what you were saying which is that like the entire unit needs to be unified and unionized for this to work and uh I don't think it's going to because I don't think that I don't think I think people vastly overestimate the economics of video games and how this is going to crumble um if the gains are too big if suddenly everyone involved in the game is getting unionized and everyone involved in the game is now getting paid on the back end and getting paid residuals not for nothing TV and movies really expensive to make in part because of unions right like the the the rules the rules with acting and the rules with the Teamsters putting up all the sets and all the it's it's outrageous I mean absolutely and just for us knowing that personally Kinda Funny: The Animated Series has we've had multiple issues where we can't work with people because their union fees make it just simply like even though they want to help us out we can't work with them because",
            "start": 1198.44
        },
        {
            "text": "Animated Series has we've had multiple issues where we can't work with people because their union fees make it just simply like even though they want to help us out we can't work with them because it's just prohibitively expensive to protect them but I mean that just means we're not going to work proga TOS can't do that exactly and and so so you know sometimes when a strike happens the product suffers so in 198 in 1986 or 1987 the NFL had a strike and scabs played right and especially in '86 and they were terrible it was terrible like like notoriously bad some people crossed the pickup lines but like some players did but the product was so bad the NFL basically was like we like need to figure this out there's a movie documentary called The Replacements about this starring Keanu Reeves but on that note if and I really feel this way and I I hate to say it if the voice actors if those voice actors never came back that 25% of games in which they're involved in never came back I'm not so sure",
            "start": 1236.32
        },
        {
            "text": "that note if and I really feel this way and I I hate to say it if the voice actors if those voice actors never came back that 25% of games in which they're involved in never came back I'm not so sure that games would suffer like maybe maybe in terms of like and I'm not saying that as a slight against their talent I know these people these people are my friends I'm just speaking from a person like from the heart saying like it's not like the NFL strike where like everyone was unionized the same way so you didn't have so your special teams wasn't unionized but your defense was you know what I mean like everyone was gone and that's not the case here the developers are still making the games and there are 75% of the games being made in which these people have nothing to do with at all so my my whole point is that I I do not think that SAG-AFTRA has the leverage necessary in traditional union strikes to gain labor leverage over their employers I don't think they do and even with that said",
            "start": 1275.16
        },
        {
            "text": "whole point is that I I do not think that SAG-AFTRA has the leverage necessary in traditional union strikes to gain labor leverage over their employers I don't think they do and even with that said it seems like and you can take it with a grain of salt but I don't know why the business was a lie in fact it would be illegal for them I think to do that during the course of union negotiations they basically said like we did meet all these things like we did they wanted 3% a year over three years we just gave them 9% off off the top like we did we did say like uh we would have this and this and I was reading things where they were saying like part of the problem is that the union wants to call the pay like the new payments one thing and the and and the publishers want to call it another thing because they're leaving the door open for their residual payments that they want so basically they just come back to the table later and I think the way I interpret that is that the businesses are",
            "start": 1315.08
        },
        {
            "text": "because they're leaving the door open for their residual payments that they want so basically they just come back to the table later and I think the way I interpret that is that the businesses are saying basically like we need to solve this now yeah because we're not we're not doing this again so I'm not I'm not belittling that the the talent of the the voice actors I wouldn't be able to do that in a million years you know except Shocker I could do Shocker and I can play myself in the in anime series but the the thing is is that I just don't think they have the leverage and I don't think that because the entire team's not involved per my NFLPA example it just doesn't really affect the traction of the of the game's development there are I am positive and I and and unlike with the NFLPA in which the the entire pool of of talented football players was involved in that there are definitely talented video game voice actors that are not in SAG-AFTRA and that and that's going to",
            "start": 1357.0
        },
        {
            "text": "NFLPA in which the the entire pool of of talented football players was involved in that there are definitely talented video game voice actors that are not in SAG-AFTRA and that and that's going to cause a problem and this might be an opening for them you know so so it's do it's dangerous to play to go the brink with this because I don't know if the voice actors win to what and another to piggyback off what you're saying right the quality of a football game hinges completely on what's happening there and how this is working out right every game depends on that talent not every video game depends on voice actor talent right yeah I think Uncharted would be not nearly as good without those actors killing the roles and doing what they're doing right but no let's and let's for argument's sake Nolan North is the best voice actor of all time right and he makes Nathan Drake Nathan Drake and he makes Uncharted something really special right Nolan North couldn't save Dark Void Dark Void is a",
            "start": 1392.08
        },
        {
            "text": "Nolan North is the best voice actor of all time right and he makes Nathan Drake Nathan Drake and he makes Uncharted something really special right Nolan North couldn't save Dark Void Dark Void is a bad game it is not it it was Nolan's in this that's cool and he's it sounds a little bit like Drake but he didn't make that right the writing was terrible the gameplay was bad it wasn't fun to play through and in the same vein right now I love Matt Mercer right he came to he played Critical Role with us right he's in Titanfall 2 he's sounds fine he's good he's a Persona 5 yeah he's he was in Dancing All Night Too he's he's great right he's Matt he's great but like Titanfall 2 his character isn't like jumping off the screen at me that I'm playing as in first person in the story right like I hear him talk a little bit I'm like oh that's yeah that's fun that's you but it's not like man this is making it it could have been any voice actor I feel there whether they're SAG or not and it",
            "start": 1433.16
        },
        {
            "text": "I hear him talk a little bit I'm like oh that's yeah that's fun that's you but it's not like man this is making it it could have been any voice actor I feel there whether they're SAG or not and it would have been the same thing like oh this guy's fine this is fine whatever I mean I I agree with you guys that strikes work when it is it's going to fundamentally screw whatever that they're they're trying to do we were talking about that's the whole idea exactly and we were talking about before like when BART which is our like travel system in the Bay when they straight up just like screw this we're not doing this it totally screwed everything up people couldn't get to work if you lived in the East Bay how you going to if you don't have a car there's like you need to find someone to carpool with or else you're screwed and you can't get to work that screwed things up then things actually happen yeah having said that I don't think that they were in a position because there is so many people",
            "start": 1473.84
        },
        {
            "text": "or else you're screwed and you can't get to work that screwed things up then things actually happen yeah having said that I don't think that they were in a position because there is so many people that want these jobs and all this I do think that's very important what they're doing I don't think that the strike's necessarily uh a failure if it doesn't get everything that they want I think that the conversation's happening are what's really important I think that uh having people even think about the developers deserving uh residuals or whatever is important and the fact that the industry is moving in a way where these are things that are happening there are strikes that are occurring and there it's happening outside of EA which forces EA to at least acknowledge it and the fact that they are talking about like all right we're going to give you the 9% upfront like there are steps being made and I think that that that's the takeaway that's important for all of this yeah I think that you",
            "start": 1508.12
        },
        {
            "text": "talking about like all right we're going to give you the 9% upfront like there are steps being made and I think that that that's the takeaway that's important for all of this yeah I think that you know I have a massive problem with public unions that are that are unionized out outside of the realm of putting your life in danger so I think police and cops have every right to have a union because they're actually putting their life on the lines but the guy sitting at the IRS that's unionized I think that's freaking absurd anything that has to do with taxpayer money I think shouldn't be unionized because it's really kind of predatory on the taxpayer that's one segment of unionization then there's this whole swath of private unionization and this is what we're talking about now and I have no problem with any private union existing because the market will either dictate that they need them or not and that's what we were talking about the animation union where we don't we just don't want to",
            "start": 1544.2
        },
        {
            "text": "with any private union existing because the market will either dictate that they need them or not and that's what we were talking about the animation union where we don't we just don't want to work with them so we don't now we're not going to get certain talent but we have plenty of talent that's not unionized that we are working with so so there's so looking at it through that lens there's a there's often a everything has a blowback and unintended consequences always note that the Japanese car companies when the economy crashed didn't need a bailout the American car companies that were unionized needed a bailout right the UAW was partially responsible uh even though they were being paid less than the Japanese car companies making cars in Georgia or Tennessee uh they need they the Chrysler and for well Ford didn't take it but Chrysler and GM needed bailout money because they weren't healthy in part not totally because their cars also suck or sucks they're way better now but in part",
            "start": 1576.56
        },
        {
            "text": "and for well Ford didn't take it but Chrysler and GM needed bailout money because they weren't healthy in part not totally because their cars also suck or sucks they're way better now but in part because their the unionization made things really complicated for them to be able to pay their employees a reasonable wage meanwhile um it showed in more southern states with Japanese car manufacturing that those unions might not necessarily been necessary and so there was blowback right there was unintended consequences to the unionization even though the unionization is done to to to make the working in middle class vibrant workers especially vibrant and able to pay for their house and pay for their families the blowback on this if it goes to where you're talking is going to be fewer games less risk averse games more sequels and uh basically exactly what you see now shooter X shooter Y sports games A B and C uh maybe a bold new open world role play game that they'll shove down your throat",
            "start": 1613.68
        },
        {
            "text": "risk averse games more sequels and uh basically exactly what you see now shooter X shooter Y sports games A B and C uh maybe a bold new open world role play game that they'll shove down your throat uh big open world game like Grand Theft Auto or something like that and then very little in the middle and very little at the bottom why because if they have to unionize the entire developer the the entire development of the game from uh creative director all the way down to the QA testers and everyone in between which would mean that would get the entire team on board and screw a game if they if they went on strike then they're just going to be risk averse that's it I mean that's that's it like the I'm not saying that Activision can't afford to pay residuals to voice actors and maybe everyone that makes the Call of Duty game and there are hundreds of people that work on every Call of Duty game across multiple studios Raven, Sledgehammer, IW, Treyarch they can probably afford it that's one",
            "start": 1653.48
        },
        {
            "text": "that makes the Call of Duty game and there are hundreds of people that work on every Call of Duty game across multiple studios Raven, Sledgehammer, IW, Treyarch they can probably afford it that's one example you know but if you go down to Titanfall which Titanfall 2 will sell modestly Titanfall 2 will probably sell I don't know a few million copies now everyone at Respawn is going to get uh a residual check and then suddenly EA looks at and like we're not making another Titanfall game we could have afforded to make a Titanfall 3 for those few million people that like it but we're not going to do that anymore because our profits are now minimal because we had to give all this backend support to all these people so the point I'm trying to make is if they get to where you're talking about it could have blowback it could have unintended consequences on the games we get at the AAA level and so you have to be very careful about what you wish for with this kind of stuff to me I think it's not",
            "start": 1694.88
        },
        {
            "text": "have blowback it could have unintended consequences on the games we get at the AAA level and so you have to be very careful about what you wish for with this kind of stuff to me I think it's not necessarily unreasonable for voice actors to ask for this and therefore not unreasonable for the developers to ask for it as well but you are going to have some sort of gradual creep in terms of budget meeting money's made and it's not going to be very good for the publisher and they're not again they're not in this for any other reason than to make money and if they're not and these companies are so big that it's not good enough say say Titanfall 2 cost $100 million and EA looks at their bank and made $10 million be like we're not doing that again we just spent all that time all that effort all that money years of time for $10 million in profit I don't think so and that's where the got to be careful comes into right the line comes in where all right cool it's going to be the director and the",
            "start": 1730.0
        },
        {
            "text": "all that money years of time for $10 million in profit I don't think so and that's where the got to be careful comes into right the line comes in where all right cool it's going to be the director and the writer and whatever the producers that get this and nobody else everybody else is paid that then it's like whatever is now jocking trying to get out of those positions talent is hemorrhaging out of studios because which it already does to an extent but you're going to lose a team quicker because all right cool I was an associate producer which meant I was below the line in this game but I see a chance to go to EA or Activision or whoever jump over there and get it like I I know enough people that have worked in TV and movies and and all those kinds of things I think we all do to hear the horror stories of the way productions are run and how people have to work around these like with what golden time and all that kind of stuff or whatever they call it and all this where like the the unions",
            "start": 1768.24
        },
        {
            "text": "stories of the way productions are run and how people have to work around these like with what golden time and all that kind of stuff or whatever they call it and all this where like the the unions have are so onerous on the way movies and television shows are made that like it's incredibly freaking daunting to deal with all these things and my suspicion is that you can't expect the trickle down to go all the way to the consumer although maybe it would but a movie is cheaper to make then there's a lower threshold for the movie to make its money back then maybe cooler movies are made or more bold movies are made and maybe tickets might even become cheaper and things might become more competitive now I don't know if we trickle all the way down in that respect some people would dispute that I would even dispute that but it just opens your mind to the repercussions of having it and the repercussions of not having it and there's two very different scenarios in which you know if a TV show is",
            "start": 1801.48
        },
        {
            "text": "would even dispute that but it just opens your mind to the repercussions of having it and the repercussions of not having it and there's two very different scenarios in which you know if a TV show is 25% cheaper to make then that would mean 25 and the same monies were being made and 25% more profits being made then they'd be like well let's freaking invest in a bunch of new stuff you know but if they're going to but so that's what I fear is a is a chilling effect on games uh based on this and I don't think we're going to have to about that there's no way the developers are going to unionize I don't think that's possibly going to happen it's too complicated to make that happen you know like there are hundreds of studios in the world and if you include indies and just people working out of their houses thousands I mean how do you unionize those people like across country lines I mean it's like you know if and then it's like you know if you have American talent you're in this union you just get",
            "start": 1833.12
        },
        {
            "text": "houses thousands I mean how do you unionize those people like across country lines I mean it's like you know if and then it's like you know if you have American talent you're in this union you just get Canadian and then you just send your game to Canada you just send your game to Eastern Europe you're just like if I was if I was a publisher if I was EA right and they were like and now American developers unionized I'm like we're shutting all our American studios down and we're making all of our games in Europe that's that you know like so you got to be careful with like with like pushing the ball to you don't you might not want to see it roll down the hill you know that's all I'm saying",
            "start": 1868.52
        }
    ]
}