{
    "id": 2205,
    "video_id": "bGaBU8fR_CU",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Failing As A Fan - The GameOverGreggy Show Ep. 156 (Pt. 3)",
    "description": "How have we failed as fans?\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1480492801,
    "duration": 1162,
    "transcript_chunks": [
        {
            "text": "what's up everybody it's me Greg Miller and today's GameOverGreggy Show is brought to you by Movement Watches. Kevin, hit it. I'm going to a wedding this weekend. I'm wearing my Movement Watch there. Look at that. That's a good zoom, Kev. Good job. Let me tell you about Movement Watches, ladies and gentlemen. First off, they're a great holiday gift. Don't be silly. Movement Watches started just $95. At a department store, you're looking at 400 to 500 bucks. Movement figured out that by getting rid of all the middlemen and selling online and getting rid of that retailer markup, they can get you the best possible price. They have classic design, quality construction, and stylized minimalism. There's over 500,000 watches sold in more than 160 countries. You can get $15 off today with free shipping and free returns by going to movementwatches.com/gregy. This watch has a really clean design. Honestly, I get talked about all the time at the wedding. I think the bride might leave her man and come home with me. I'm just",
            "start": 0.12
        },
        {
            "text": "going to movementwatches.com/gregy. This watch has a really clean design. Honestly, I get talked about all the time at the wedding. I think the bride might leave her man and come home with me. I'm just kidding, Jen, that won't happen. Anyways, go to movementwatches.com/gregy. That's mvmtwatches.com/gregy. Join the movement. Like a laser. Can you make a laser come out of it? Kev, next topic. Boy, my topic. Yeah, boy. I want to talk about failing as a fan. Interesting. Failing as a fan, ladies and gentlemen. Uh, it comes fan ain't failing. No, it's not on the fan is failing. It's not on Nick turned it off. Uh, no, failing is a fan of something obviously that you want, you know, or that you like, you know what I mean? Not fan as in a fan, floor fan here, but if you have stories about oscillating fans failing, you please let me know. Um, no, I've thought about this the other day of like, you know, it's weird for us to have an audience and all these different things and how hard it is to communicate what happens on our side",
            "start": 38.44
        },
        {
            "text": "let me know. Um, no, I've thought about this the other day of like, you know, it's weird for us to have an audience and all these different things and how hard it is to communicate what happens on our side of the screen versus what's happening on theirs. And it made me think back to everything I've been a fan of and all the things. And there's there's there's a story I regret very very much. Uh, now now being an adult and now understanding things. Is it the one where you pooped in the bushes in front of the small Asian kid? No, that was with I pooped in front of Colin and yeah, the little boy was there too. He was like 15. But I don't regret that. No, that was great content for this. This whole channel is built on me pooping in that bush and the rec and the records. Yes, that's a big part too. No, um, I this is funny too because I was I was I looked at my topic list on things I should talk about on the show eventually and this one's there and it's a Weezer story. And I didn't I was wearing my Weezer shirt",
            "start": 100.12
        },
        {
            "text": "is funny too because I was I was I looked at my topic list on things I should talk about on the show eventually and this one's there and it's a Weezer story. And I didn't I was wearing my Weezer shirt today. Bo, just happened. Just happens. Um, I was a huge Weezer fan back in the day. Still am, obviously. But since '94, along along for the ride with the Blue Album, right? And when I got the Blue Album on the back, it had a thing about joining the Weezer fan club. And I wrote in, join the Weezer fan club, right? And you get a little laminated card, which I got rid of years and years and years ago, and I regret to this day that I did. But then the best thing was you got this thing called the Weezer Zine. When zines were still a thing, right? And it was uh, it came out, I want to say quarterly or whatever. And it had fan letters in there and art from the fans and then like, you know, photos of like Pat Wilson or whatever at a birthday party and like little updates about what's happening with Weezer and stuff. But it was",
            "start": 137.32
        },
        {
            "text": "letters in there and art from the fans and then like, you know, photos of like Pat Wilson or whatever at a birthday party and like little updates about what's happening with Weezer and stuff. But it was mainly fan stuff. And then of course, like, you know, there was such a drought between uh, like Weezer albums and stuff. You you know, Pinkerton happens and then it's just off the rails of like, is there ever going to be anything else along the lines? But even the lead up to Pinkerton, I remember being hard that there wasn't as much stuff as you wanted. And this before the internet was really all over the place. It was hard to keep up. They were, you know, the rentals had come along too. They were I'm getting off track. I remember at one point, and I forget how, um, it's '94, so right? I'm 11 then. Sure. And that we'll say I'm between 11 and 13 when this happens or whatever. But I'm getting the Weezer Zine. I like them all much. And I remember drawing some I I was drawing comics as you know, we've talked about my stuff",
            "start": 177.04
        },
        {
            "text": "say I'm between 11 and 13 when this happens or whatever. But I'm getting the Weezer Zine. I like them all much. And I remember drawing some I I was drawing comics as you know, we've talked about my stuff here. Froggy, my hustle. Yeah, the Froggy Comics or whatever. And I had a character in there. And again, in one of these things, maybe it was just doodles, but I, you know, Weezer Man, something totally lame. But yeah, exactly. Weezer Man and Froggy out there having adventures. Yeah, exactly. Uh, but I drew an image of Weezer Man and sent it in to the Weezer fan club. And I left and I sent like a super passive aggressive note of just like, hey, submitting this. And this is like paraphrasing, obviously. Would love to see it in the magazine. And I think I deserve it because I've been a Weezer fan for a long time now. And it's been hard because there's no new music and what's happening. And and really like a whole like, hey, like, I'm owed this. You know what I mean? I'm **** owed this. You stan them, huh? Stan, you're a stan. Yeah, exactly. I didn't threaten to like murder people or whatever. But I was like, you know, I'm I I in in my head, I'm writing into Geffen Records. Some some, you know, whatever intern's getting this, seeing it, putting together this Weezer magazine. Why wouldn't they just put this in there? Whatever. Maybe I had done it multiple times and this is like my final straw thing. I don't recall anymore. But I remember this very specific one that sounds very possible. Exactly. Right. And so, because I'm a dumb kid, obviously, you don't know how the world works. And you send it in, think all this stuff, psyche. And it wouldn't be till uh, so then to be not bury the lead here. I think I'm writing into a corporation. All these things. Somebody at, you know, Weezer's this huge band, right? Like clearly they have hundreds of",
            "start": 216.8
        },
        {
            "text": "long time now and it's been hard because there's no new music and what's happening and and really like a whole like hey like I'm owed this you know what I mean I'm **** owed this you stan them huh? Stan, you're a stan. Yeah, exactly. I didn't threaten to like murder people or whatever but I was like you know I'm I I in in my head I'm writing into Geffen Records some some you know whatever interns getting this seeing it putting together this Weezer magazine why wouldn't they just put this in there whatever maybe I had done it multiple times and this is like my final straw thing I don't recall anymore but I remember this very specific one that sounds very possible exactly right and so cuz I'm a dumb kid obviously you don't know how the world works and you send it in think all this stuff psyche and it wouldn't be till uh so then to be not bury the lead here I think I'm writing into a corporation all these things somebody at you know Weezer's this huge band right like clearly they have hundreds of",
            "start": 259.08
        },
        {
            "text": "it wouldn't be till uh so then to be not bury the lead here I think I'm writing into a corporation all these things somebody at you know Weezer's this huge band right like clearly they have hundreds of people working on these staffs or whatever when in reality the Weezer fan club was run by two sisters, Mykl and Carly, who like signed off all of their uh, you know, they had letters in the beginning of the Zine like what's happening in the Zine. They Mykl, yeah, Mykl and Carly, they spelled M-Y-K-L. Yeah, never never heard. Um, but they sign off here, you me or whatever, and put it out and done this whole thing. And it didn't dawn on me at the time that it wasn't a corporation running this. It was these two women that were fans of Weezer that had befriended them. And it turned out, you know, dozens of other local LA bands that they would help whenever they came through stuff like when they were little before not before they huge things or whatever. And that this was a passion project for them. And",
            "start": 299.28
        },
        {
            "text": "other local LA bands that they would help whenever they came through stuff like when they were little before not before they huge things or whatever and that this was a passion project for them and that when I got my fan club that looked like it was written in Sharpie, it was written in Sharpie by these people and when I got my, you know, packet that was written in Sharpie on it, it was written by one of these two sisters who was stuffing envelopes and sending the **** out and doing all these different things, right? And like it was just two women who were doing all this. And I don't find out about this until they die. And they die trying driving to their the next Weezer show. And like, you know, it's still murky as to what exactly happened. But the the theory commonly held is that they finished one of their Weezer shows, were driving to the next one and fell asleep at the wheel and crashed the car in that unfortunate. And so like when that happens, it, you know, then I remember this is the first",
            "start": 347.56
        },
        {
            "text": "of their Weezer shows were driving to the next one and fell asleep at the wheel and crashed the car in that unfortunate. And so like when that happens, it, you know, then I remember this is the first time I remember Weezer had been quiet forever. It felt like again, I'm a kid, so I don't have any sense of time or whatever. But I remember when MTV News reported on it and showed like a clip from like the benefit concert or whatever. And like Rivers had like really long hair. And I was like, that's I not what I thought he looked like. I haven't seen him in so long or whatever. And then they explained like that how this all happened. And so like it's this weird regret I have especially now knowing for us like there's five of us, right? And like when people are like, why doesn't this work and why doesn't that happen? It's like, we're trying. We're trying as hard as we can. And this is not trying to guilt anybody out there. All your criticisms are well warranted and we understand them in 2017. But like for me,",
            "start": 384.6
        },
        {
            "text": "happen it's like we're trying we're trying as hard as we can and this is not trying to guilt anybody out there all your criticisms are well warranted and we understand them in 2017 but like for me that's that weird thing of being on both sides of it now but even back then having said that and imagining them opening this thing with this **** stupid ass drawing and then this letter from this 11-year-old who petulant child being like blah blah blah blah blah and I'm sure they weren't I'm sure they're like this kid's dumb whatever move on to the hundreds of other letters and poems and art and things like praising this band and thanking us for the our work but I never thanked them and I never had the chance to because I didn't understand the situation or how the world works at the time and that **** sucks so like that's me failing as a fan that's a fan regret I have you know what I mean the fact of not taking the time to understand and thank them for what they did and instead coming",
            "start": 425.64
        },
        {
            "text": "that **** sucks so like that's me failing as a fan that's a fan regret I have you know what I mean the fact of not taking the time to understand and thank them for what they did and instead coming off like this douche that again I'm sure they lost no sleep over that they did not worry about it wasn't like we're not going to do it but I've had those days here right where it's been a **** God this day's been bad I was you know I always talk about like it's like I've fallen out of a tree and I'm hitting my head on every branch everything that could go wrong and you're bouncing around you can't even answer these emails and you get to the bottom it's like all right fine I'm going to go home open up Twitter and wow this is broken why are you guys so stupid why didn't you hire somebody all right you know what I mean it's like well I want to **** scream and cry all at once now and so I've done that to somebody and have no way to be like I'm sorry for it sucks yeah I think I mean in",
            "start": 465.48
        },
        {
            "text": "right you know what I mean it's like well I want to **** scream and cry all at once now and so I've done that to somebody and have no way to be like I'm sorry for it sucks yeah I think I mean in regards to that though I'm sure those those sisters probably had a lot of good stuff come through as well no no they were beloved I know but despite that I feel like there's there's no amount of good that can combat the bad at that moment right the moment you get past that moment and you realize all the good everything goes away but there's just something about you can get 100 compliments but that one one insult yeah is the one that you go what **** you know what I mean and that what **** response is more visceral than anything else sure and I don't know it's harder to take compliments I guess is the I don't know see I I don't think I've ever been in that position where I've cared enough to like to to render that sort of a criticism against something and I think that's when you talk",
            "start": 504.88
        },
        {
            "text": "guess is the I don't know see I I don't think I've ever been in that position where I've cared enough to like to to render that sort of a criticism against something and I think that's when you talk about failure as a fan I think that is my biggest failure is that I'm not that big of a fan of anything and it sucks. Joe Rogan, I do love Joe Rogan. But I mean, you know, it's it's hard to Joe Rogan. I mean, well, it's easy to knock Joe Rogan depending on depending on what what you like to listen to or not. But you know, he he he's unabashedly who he is. And so if you don't like his what he puts out or that podcast, you're not you're not you're not coming back for a second a second listen. Um, but you know, I don't I don't you know, I don't I look at all the support we get from the people that that that consume our content and and and help us out over the years. And I just feel like I don't I don't have something like that that I'm passionate about. So I think that's my failure as both a creator and as a fan is",
            "start": 550.0
        },
        {
            "text": "content and and and help us out over the years and I just feel like I don't I don't have something like that that I'm passionate about so I think that's my failure as both a Creator and as a fan is that I'm not I'm not I'm not able to throw myself wholeheartedly into something like that like you say that's bad but I bet I I I can paint another you say the letter that you wrote was bad I can paint another picture of those two sisters reading it clearly it's a kid's letter and they're getting a huge kick out of how much this kid cares about Weezer right and like they look at like wow this kid's got some balls on him um when I get a letter like that on a bad day and I'm not like ha I'm like rage the idea you jumped off the couch that feeling of like that you deserve something for being a fan of somebody and I think that that that's the hard thing to grapple with and like I I do have that like I um obviously Q5, Tonee, all that stuff I've been such a fan of them from the beginning to an",
            "start": 589.36
        },
        {
            "text": "fan of somebody and I think that that that's the hard thing to grapple with and like I I do have that like I um obviously Q5, Tonee, all that stuff I've been such a fan of them from the beginning to an extent that I feel like it is partly mine. It's not it's what I need to remember. It's not like it's a part of me and I'm a huge part of it and it you know it's definitely like there's a relationship there but the end of the day it's not my thing so it's like they can make their decisions and I can agree or disagree with them but I feel like there's like a a level of respect you need to show um and be it's fine to be critical but it's always it's the way that you kind of give that message to somebody um because tell them hey you're doing this wrong you should be doing this even though you clearly think that not the best way to handle it necessarily and I think that there's so much that goes on that you don't know you know you only get one side of it I think for me uh a perfect example of",
            "start": 635.4
        },
        {
            "text": "think that not the best way to handle it necessarily and I think that there's so much that goes on that you don't know you know you only get one side of it I think for me uh a perfect example of this is Eminem. Huge fan of Eminem. And I think it gets hard because when you're a fan of something, you are the most critical of it because you like it that much. You're protective of it. Eminem, one of my favorite rappers, one of my favorite artists of all time. I can tell you so many facts about details of songs and like lines and everything. And when you get from his first album, second album, third album, we can have a multi-hour long discussion about why I like this aspect more than that aspect of these albums or whatever. Then you start going on past that and it starts to be like, oh, well, it's not as good as the first three. And it's like, then it just starts to become this like kind of negative conversation. Even if I enjoyed things about them, you just you're talking about the negatives or this isn't as",
            "start": 680.28
        },
        {
            "text": "as the first three and it's like then it just starts to become this like kind of negative conversation even if I enjoyed things about them you just you're talking about the negatives or this isn't as good as that and I've never spoken to Eminem so I've never had to deal with that but I have thought about this of if I were to talk to Eminem what would I talk to him about and I feel like the thing I want to talk about is hey what happened or why did you do Relapse why did you do that album like what what through your head that was like I'm going to use an accent for the entire thing and it's like instead of focusing on all the good I immediately jumped to like all the things I didn't like about somebody that I love and that's a problem and I had that moment uh with Burnie Burns at Rooster Teeth. Red vs. Blue, such an important thing in my development in my my career, my life. And the first time I was hanging out with him or one of the first times I was hanging out with him like we were",
            "start": 720.44
        },
        {
            "text": "Teeth, Red vs. Blue, such an important thing in my development in my my career, my life. And the first time I was hanging out with him or one of the first times I was hanging out with him like we were really talking about stuff and I found myself like one of the first things I started doing was being and like like man like the CG stuff's really good once you started going there why are you still like doing the the same like stupid dick jokes and stuff like we want the story like it feels like such a waste and then it wasn't until I went home afterwards I'm like man he took that really well but I shouldn't have done that yeah like I should have just and it's not just about focusing on the good it's just don't focus on the bad you can bring up the bad you can say things like oh man I loved season 9 because this is and this didn't totally like this because of this reason but whatever but instead it inevitably turns into this thing of you almost are trying to prove to the person that you",
            "start": 761.64
        },
        {
            "text": "season 9 because this is and this didn't totally like this because of this reason but whatever but instead it inevitably turns into this thing of you almost are trying to prove to the person that you look up to that you know their work so well and it's like well obviously they know I like them so I'm going to show point out all the things that I noticed that no one else noticed you know and that's the big thing I think you know with even me I've told that you know the story about uh uh hate online and being trying to be better online in terms of giving out positive feedback rather than negative and how like when I was you know going to tweet at the office how bad it was and and like include and **** and it was like man people do that to me and I know they follow me I know they're fans but they're only they're it it's the same thing with Yelp what I always talk about right where it's like I I noticed one day all my Yelp reviews were negative cuz I'm not motivated when I have a good",
            "start": 802.4
        },
        {
            "text": "but they're only they're it it's the same thing with Yelp what I always talk about right where it's like I I noticed one day all my Yelp reviews were negative cuz I'm not motivated when I have a good experience to go say man what a great experience this was it's when somebody pisses me off that I want to go tell them and usually it's somewhere I you know if it's on Twitter or something it's I have 140 characters to tell this Creator or this talk about this creation and I just want to get through my most salient thought and my most salient thought is this boss battle sucks this episode's no good why is this and I'm not saying that I love it I'm I'm letting you try to read between the lines and most people would get that but when you don't have the full context it just does come off as people being dicks to be dicks yeah and the the being a dick thing it's hard to not do because you feel this sense of entitlement over things that you you enjoy especially if you pay for and especially like",
            "start": 842.92
        },
        {
            "text": "being dicks to be dicks yeah and the the being a dick thing it's hard to not do because you feel this sense of entitlement over things that you you enjoy especially if you pay for and especially like all that stuff I I remember one of the very first Tonee concerts I ever went to uh it was me and there was like a group of people that I didn't personally know but I knew from the internet cuz we were friends in this community and we were at this show and Tonee was at the merch table selling shirts I went up and I saw him and he looked at me and he saw my face and he's like oh you're the dude in the yellow shirt in the on your your profile picture and I was like oh **** yeah and it was like a great moment where I was like holy **** he knows who I am I hate yellow shirts you know he's like this is great it was such such a moment for me and uh then the guy the guy behind me um went up to him and he was like oh hey do you recognize me like I'm the guy in the and like he started talking",
            "start": 880.12
        },
        {
            "text": "this is great it was such such a moment for me and uh then the guy the guy behind me um went up to him and he was like oh hey do you recognize me like I'm the guy in the and like he started talking about his profile picture and you could see Tonee kind of like struggled with it it was just like like he didn't he just didn't know who this guy was and the dude got kind of like upset was like oh man like like damn you know and I forgot what he said it wasn't even bad it wasn't bad but it was enough that I was just like oh it's enough to take the wind out of the sails cuz as a Creator and like as a public personality like I feel bad when when I'm like it happens to me all the time at a meet and greet I'll shake your hand I'm usually really good with faces but I've seen so many faces now that I'll shake your hand and be like great to meet you I'm like actually at Comic-Con like 4 years ago and I go oh my God I'm so sorry and nine times out of 10 it's oh don't worry about it no no you meet too many people",
            "start": 915.84
        },
        {
            "text": "hand and be like great to meet you I'm like actually at Comic-Con like 4 years ago and I go oh my God I'm so sorry and nine times out of 10 it's oh don't worry about it no no you meet too many people I get it but I still feel awful exactly I want to remember everyone I want to have a conversation with everybody I look over at the Kinda Funny Games somebody made I want to remember who made that and I can't yeah and that's my thing is like for me it's happened where I'm like oh I've seen you it was at uh PAX East he's like RTX I'm like sorry but I'm trying here but but with the with this Tonee situation I remember very vividly because uh I remember thinking I was like man that guy like really like didn't handle that well yeah you know like like why'd he do that but I remember going home and thinking like well what if it was the other way around like what if this guy was in front of me and he had recognized him and not me like I definitely would have felt entitled like you should know who",
            "start": 956.92
        },
        {
            "text": "the **** I am and I remember thinking like how would I have handled that and it probably wouldn't have been too much different I totally could have been the guy being like well I'm also that guy and it's just like I think that is the part that's hard to struggle with this being a bad fan because when you were such a fan I think by default you need to then actively try to not be bad in terms of what we're talking about yeah well I mean I think there's a line distinction that needs to be made between critical feedback and negative feedback right and this is always something I say like when whenever I jump in comments on things and people have critical feedback for me I thank them for that cuz I'm like I really do appreciate that you love this thing so much that we're doing that you want you know",
            "start": 994.76
        },
        {
            "text": "I jump in comments on things and people have critical feedback for me I thank them for that cause I'm like I really do appreciate that you love this thing so much that we're doing that you want you know you have a couple pieces of feedback that you'd like to see happen that's for that to me is super positive and I think it it really is just all how frame it with people and how you frame it with creators that you love because you do love their stuff right and there is a there is an aspect of it that is very intimate especially when you're talking about a product like a podcast where people spend hours like I spend hours and hours and hours listening to certain people that do podcasts like I know more about Joe Rogan than I probably do about my wife and that's and I I I you know I pry a lot into my wife like I I kind of you know I kind of like stalk her a little bit um I'm getting off on a tangent but the the point is like you know so so so when you like something that much and want to",
            "start": 1030.48
        },
        {
            "text": "into my wife like I I kind of you know I kind of like stalk her a little bit um I'm getting off on a tangent but the the point is like you know so so so when you like something that much and want to give that feedback it then becomes how do you do it right how do you do it without sounding like that kid that was in line right who's serious who who's hurt and I think to to uh to the credit of a lot of people that support us again nine out of 10 times it's hey I really like this like I see it all the time with the animated show where people go hey I love this I don't you know whether or not you care if it's on time or whenever it dropped great I would love it if this were longer right and that's a that's a that's a positive thing for me to hear because I'm like great you like this so much you want more of it that's cool I wish I could make it longer we can't economics can't get into that in the comments but so I like that and I always I always respect that because it is a two-way street",
            "start": 1066.16
        },
        {
            "text": "want more of it that's cool I wish I could make it longer we can't economics can't get into that in the comments but so I like that and I always I always respect that because it is a two-way street right you don't want people to just love you unconditionally right because then you can't grow as an artist you can't grow as a Creator you need that feedback we have to have each other this is how this relationship Works um and so to that degree like you know I and I and I kind of disagree with you a little bit and that I feel like people who do uh uh consume the content do have a level of ownership over it now granted you know they're not they're not here working on it every day but it is because of them that that it is a two-way street in that regard right one can't exist without the other um so there is an importance to be placed on that but you do have to stay positive all the time you have to you have to be able to render both criticisms and and uh praise in a positive light if you",
            "start": 1103.4
        },
        {
            "text": "um so there is an importance to be placed on that but you do have to stay positive all the time you have to you have to be able to render both criticisms and and uh praise in a positive light if you want to exist in that environment yourself that's all I'm saying does that make sense made sense to me yeah makes sense to me",
            "start": 1142.6
        }
    ]
}