{
    "id": 2191,
    "video_id": "FoK99H5j6do",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "The Game Awards 2016 Winner Predictions - Kinda Funny Gamescast Ep. 95 (Pt. 2)",
    "description": "We predict the winners of The Game Awards 2016.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1479823201,
    "duration": 2303,
    "transcript_chunks": [
        {
            "text": "This episode of the Kinda Funny Gamescast is brought to you by MVMT Watches. We get it, holiday shopping can be tough, but thanks to MVMT Watches, all that gift-giving anxiety can disappear with the press of a button. The holiday shopping season is here, and with MVMT, you can skip the crowds and standing crazy lines at the mall and finally find a gift that all the people you love will love at prices to beat the department stores. These watches to be the perfect purchase for just about anyone in your life, guy, girl, don't matter. And remember, they start at only $95. You can get fifteen percent off today with free shipping and free returns by going to MVMTWatches.com/kinda. That's MVMTWatches.com/kinda. Now it's time for you to step up your watch game. Go to MVMTWatches.com/kinda. Join the movement today. Topic is The Game Awards 2016. Two weeks away, two weeks away. Nominations got announced way or earlier last year, doesn't it? I thought so too. Yeah, I was trying to",
            "start": 0.0
        },
        {
            "text": "com/kinda. Join the movement today. Topic is The Game Awards 2016. Two weeks away, two weeks away. Nominations got announced way or earlier last year, doesn't it? I thought so too. Yeah, I was trying to do a little research uh last on last year's Gamescast of when we did this topic, the predictions, and it seemed like it was about two weeks away as well. So I think I might have been us though, just us being lazy. We're gonna be any closer to the show. But anyway, doesn't matter. Live show coming up happening December 1st, the Microsoft Theater in Los Angeles. The event will be live streamed in a wide variety of platforms. You can expect where to find them pretty much everywhere. Said to begin at 8:30 PM for the pre-show with the event itself at 9 PM. We can expect to see some world premieres. This is not world premieres, more to be in a way. They'll probably some musical segments of some sort. A panel of judges from 9 international publications selected the nominees for The Game Awards.",
            "start": 43.2
        },
        {
            "text": "This is not world premieres, more to be in a way. They'll probably some musical segments of some sort. A panel of judges from 9 international publications selected the nominees for The Game Awards, including us. So that was really cool. Shout out to Geoff Keighley. Thanks, Geoff Keighley, for recognizing Kinda Funny as one. I was looking through the list, I'm like, huh, it's cool we made it. Yeah, there's a lot of other people that are like way bigger than us and way more motel. Anybody's Hiva people think we're a bigger deal in ER. So I don't think so. Really cool. Then they also had eight esports focused outlets assist in the selection of winners for those things, which is a good call because we've already been like, oh no, friggin' gift a team Infinity, whoever the hell they are. Um, then games had to be released commercially on or before November 4, 2016 in order to be eligible. So that means no Final Fantasy XV, Dead Rising 4, or The Last Guardian. So I want to do go through the nominees and kind of give our",
            "start": 99.31
        },
        {
            "text": "commercially on or before November 4, 2016 in order to be eligible. So that means no Final Fantasy XV, Dead Rising 4, or The Last Guardian. So I want to do go through the nominees and kind of give our predictions, what we think are gonna win The Game Awards. Sure. So this is necessarily what we want to win, some predictions for what will win. Okay. Do we want to decide what we want to win? We can do that too. Okay, because I think we have to vote on these eventually, right? We nominated them, that's the pool. Oh yeah, and now we actually vote. I won't read it. That's and I don't think it's some kind of secret ballot initiative where we go, I'm not, you know, Geoff hasn't said, hey, you got to go into this booth here and punch the ticket. I guess you're right, we should probably do that now. I'm gonna be okay. Cool. Yeah, so for you guys that are interested, the nomination process was pretty simple. Each category, we got to nominate five different games or people or whatever, and we made a spreadsheet. Colin, Greg,",
            "start": 141.52
        },
        {
            "text": "cool. Yeah, so for you guys that are interested, the nomination process was pretty simple. Each category, we got to nominate five different games or people or whatever, and we made a spreadsheet. Colin, Greg, and I each put down what we thought was there and or what we thought deserved to be there with our name next to it and whatever. All three of us had would be ranked one pick, two of us are going to pick, one of us would be next and go from there. There wasn't too much things that were in question. We agreed, I think, on most stuff. There was a couple, couple scenarios where we had maybe seven nominations for some categories, but we figured that stuff out pretty easily. Let's start with the big one, Game of the Year, for a game that delivers the absolute best experience across all creative and technical fields. Doom from id Software and Bethesda Softworks, Inside from Playdead, Overwatch from Blizzard Entertainment, Titanfall 2 from Respawn Entertainment. LoL, come on. And Uncharted 4. I would vote Uncharted 4.",
            "start": 185.08
        },
        {
            "text": "Doom from id Software and Bethesda Softworks, Inside from Playdead, Overwatch from Blizzard Entertainment, Titanfall 2 from Respawn Entertainment. LoL, come on. And Uncharted 4. I would vote Uncharted 4 because it's the one I enjoyed the most on there. I would predict, I can easily see Uncharted doing it, but I would predict Inside, really. I think Inside's that kind of that indie darling. I think Inside caught a lot of people off guard. I think in a, you know, it's one of those where I know I didn't, I, I was mad at the ending, right? That's my only complaint with it. When we did that review, it was totally just like, it's awesome and this is great and the way it's time that is amazing and the art style is great. I loved how, do you know what I mean? Like there's something super special about that. And I could see that catching enough judges off guard, if you will, that that would take it, 'cause everyone expects the same problem with every sequel to an amazing thing. Everybody expects Uncharted 4 to be awesome. So Uncharted 4",
            "start": 237.76
        },
        {
            "text": "enough judges off guard, if you will, that that would take it, 'cause everyone expects the same problem with every sequel to an amazing thing. Everybody expects Uncharted 4 to be awesome. So Uncharted 4 was awesome. I granted Inside's not, you know, their first go round, of course it's Playdead. I but I think it was a step up enough that I think that could be a possible thing. Hmm, hmm. That's interesting. I mean, Inside's definitely in my in my top three games of the year. I don't think I voted for number one again. I'm not voting him. Yeah, vote it. But even predict. Yeah, I mean, that's I can see that, that makes sense because a lot of the the publications did love that game. I think my my vote would be Overwatch. I think Overwatch is the is the Game of the Year. By that's a really good point too in terms of those people voting for it. I don't know. I think it's I think it's between Overwatch and Inside, but I think Overwatch gets the nod on that. I don't think Uncharted gets it. So you're predicting Overwatch? Yes.",
            "start": 293.08
        },
        {
            "text": "people voting for it. I don't know. I think it's I think it's between Overwatch and Inside, but I think Overwatch gets the nod on that. I don't think Uncharted gets it. So you're predicting Overwatch? Yes. Colin, I think Overwatch will win. I think that Inside is the best Game of the Year out of that list. So I would personally vote Inside, but I would I would assume that Overwatch will win. Yeah. Okay. I mean, this I'm sure we'll have many Game of the Year conversations later towards the end of the year, but for me, Overwatch is the the Game of the Year overall. Like when you really think about it, like 2016, that game is the gift that keeps on giving. And it, well, Uncharted 4, great. Overwatch is something new. Even if that's something new is just, oh, it's another shooting game. Sure. But it's not just another shooting game. Like the cast of characters, the fan base, and the the gameplay of it, it's that's going to be any people are playing for years to come. Doesn't say the community, I think, is a huge part of that.",
            "start": 335.49
        },
        {
            "text": "game. Like the cast of characters, the fan base, and the the gameplay of it, it's that's going to be any people are playing for years to come. Doesn't say the community, I think, is a huge part of that and why the game is something special and different. And it was designed around having having that, having community, having cosplayers, and having like a story to it, like a world that is ever evolving. And for a multiplayer only game, I think that it's really successful in having a story. Mm-hmm. So I'd give it to Overwatch. But yeah, I mean, all these games are great. Um, what else we go out there? I put voting, but we don't have to decide about it for all split already. Oh, we can keep talking. Yeah, we can keep talking. Let's just do predictions. Yes, let's do predictions. So right now then for Game of the Year, Game Awards, I predict Inside. You both Inside. You both predict Overwatch. Yes. And I think that's a pretty safe pick at all. Best Game Direction, recognizing a game studio for outstanding creative vision, game",
            "start": 387.99
        },
        {
            "text": "Awards. I predict Inside. You both Inside. You both predict Overwatch. Yes. And I think that's a pretty safe pick at all. Best Game Direction, recognizing a game studio for outstanding creative vision, game direction and design. Incredibly redundant category, by the way, since it's the same five studios that made these five games. Isn't Blizzard Entertainment for Overwatch, EA DICE for Battlefield 1. Okay, so that's different. id Software for Doom, Naughty Dog for Uncharted 4, Respawn Entertainment for Titanfall 2. So who's who's missing always? I didn't put blatantly. What was our definition of Game Direction? Recognizing a game studio for outstanding creative vision, game direction and design. See, it's hard again. I'd give this to Overwatch for everything I just said. It's hard though, because with I think that Uncharted and Naughty Dog, it's they're so amazing that it's kind of easy to look at them as the Waldo. Those are good, you know. Yeah, in the same way that I'd say that about things like Battlefield or",
            "start": 431.25
        },
        {
            "text": "Uncharted and Naughty Dog, it's they're so amazing that it's kind of easy to look at them as the Waldo. Those are good, you know. Yeah, in the same way that I'd say that about things like Battlefield or Titanfall where it's just like we expect it from it. So it's less I think impressive. My thing is I think Uncharted wins this one and I think the voting populace, the answer is because they don't give a Game of the Year. Yeah, but they can give it this over. They tied together the whole series. They tied together how great it was. They played on your emotions from what happened in 1-3 and a little bit of Golden Abyss. They tied up so nicely. What an amazing ending. I think that's the way they get in. Obviously the game plays, the game played Uncharted is amazing. Yeah, yeah, it's hmm. Uncharted has the most nominations by far out of any other game. Yeah, but it's really gonna haven't cleaned up when you get lower into the thing, right? We talk about performances. Yes. Colin, what is your prediction for",
            "start": 482.31
        },
        {
            "text": "Game Direction? I say Naughty Dog. I think probably I would vote for Playdead if they were nominated, but that's not. I mean, I think Playdead, I'm really surprised by that specifically because I think Inside is leaps and bounds in design ahead of everything I played this year. And that's not an insult on them, other great design games I played this year. But I was so astonished by how good Inside was that um, you know, it resonated me with a lot more than another Uncharted game. And I'm not insulting them at all, but I didn't see anything in Uncharted 4 really where on a personal level where I'm like, this is leaps and bounds ahead of what they did with the trilogy. I don't think that there's anything there that that's the case. But I do think that it will win. And that's again, this is the",
            "start": 521.82
        },
        {
            "text": "I'm like, this is leaps and bounds ahead of what they did with the trilogy. I don't think that there's anything there that that's the case. But I do think that it will win. And that's again, this is the confusing thing is I don't think they deserved win either state where this is our pretty boy. We're actually out of that group. It would be between Blizzard and Naughty Dog. For me, clearly Blizzard has the special sauce with whatever they're doing. Mm-hmm. Right, yeah. You you are Blizz Overwatch, were Uncharted. Yes. I know. Surprise, surprise. Best Narrative for outstanding storytelling, a narrative development in a game. Firewatch from Campo Santo, Inside from Playdead, Mafia III from Hangar 13 / 2K Games, Oxenfree from Night School Studio, and Uncharted 4 from Naughty Dog. I would say Inside tells an amazing story with no words, no text, and it leaves it open to interpretation, which I think is really cool too. I think it should win. I think it will win. So that's my pick. Okay, this one's tough because you",
            "start": 564.78
        },
        {
            "text": "story with no words, no text, and it leaves it open to interpretation, which I think is really cool too. I think it should win. I think it will win. So that's my pick. Okay, this one's tough because you got to be a betting man here. Hmm. Well, that's a prediction to work. You don't put your money on the line here. And so I think I want to go against my own personal beliefs and I think Oxenfree has a shot here because I think again, it's a game people are going to want to reward, but maybe not a mean. Obviously, I think I'm not so far in the other categories, but here it pops up and it is this story that it's a game that, you know, for I thought missed on certain levels. You want to replay again. You want to go back and make the other choices. You want to see how all of the threads come together in different ways and see the different endings and what happens if they end up together and what happens if they don't. What happens if I say this in the dream state, ghost world or whatever? I think that's something",
            "start": 613.14
        },
        {
            "text": "and see the different endings and what happens if they end up together and what happens if they don't. What happens if I say this in the dream state, ghost world or whatever? I think that's something that a lot of critics really fell in love with. Colin spoke to life. I have to I wanted to say here, I mean, we're kind of down the rabbit hole too far to go back now, but what is the value in predicting who's gonna win as opposed to they're saying who you want to win? You know that this is a gimme. This is gonna the second's gonna confuse people. I'm just throwing that out there right now. Well, I feel like we're saying both of our answers as we go, right? Yeah, I guess just that um, yeah. Okay, Tim, what's your prediction? I loved Firewatch. I loved its story, but it's not the best. Um, between Inside and Uncharted, for me, Uncharted, I'd say is my favorite of it, but I'm gonna give it to Inside. Oh God, I think it's deserved as well. That's you to vote for as well. Yeah, that story, I mean, narrative is like a freaking a",
            "start": 664.71
        },
        {
            "text": "for me, Uncharted, I'd say is my favorite of it, but I'm gonna give it to Inside. Oh God, I think it's deserved as well. That's you to vote for as well. Yeah, that story, I mean, narrative is like a freaking a narrative. I would vote for Uncharted 4, personally. Cool. Best Art Direction for outstanding creative and technical achievement in artistic design and animation. Abzû from Giant Squid and 505 Games, Firewatch from Campo Santo, Inside from Playdead, Overwatch from Blizzard, and Uncharted 4 from Naughty Dog. This one for me is really hard because I wouldn't give it to Uncharted 4. Wouldn't give it to Abzû. Firewatch was one of those ones where it's like, if you were to tell me or like late last year that I wouldn't be voting for Firewatch for Best Art Direction this year, I'd say you're crazy. Yeah, is that game all we knew about it was that its art was amazing. And even playing through it, like it definitely all that stuff they **** nail. But Inside, man, Inside and Overwatch. But again, like with Overwatch, all I",
            "start": 703.71
        },
        {
            "text": "we knew about it was that its art was amazing. And even playing through it, like it definitely all that stuff they **** nail. But Inside, man, Inside and Overwatch. But again, like with Overwatch, all I feel like they win the other ones more than this. But and I gave it to Inside. I think Inside wins. I think it comes down Inside versus Firewatch. I think it's another situation of your some people going to be voting so much for Inside in other categories, they'd get here and go Firewatch, right? One. Hmm. Yeah, yeah. I think it's between Inside and Uncharted. So we talked about Art Direction and and all that is why. I mean, Uncharted is a masterpiece in terms of the way it looks. Um, but I would I think Inside is clearly the winner in that respect. I mean, it's just so unique, so interesting. The animation, the thought into the way all the ways you die, all the ways you can interact with the world. There's nothing just animated as I said when we were reviewing it or talking about it a lot when I came out. I just",
            "start": 768.29
        },
        {
            "text": "into the way all the ways you die, all the ways you can interact with the world. There's nothing just animated as I said when we were reviewing it or talking about it a lot when I came out. I just don't feel like anything there exists just to exist. And I think that's really cool. And a lot of that goes to the Art Direction. I think Inside's clearly the winner. I think that a piggy back half what you said, the fact that animation is mentioned in this, I think is going to boost Inside a lot because the animation that game is so next level. Don't get me wrong. Again, I'm predicting Firewatch. My pick, if I was voting, would be Inside. Cool. And your what are you already predicting? Come on, Inside. You're praising and that's where you come down personally anyway. Yes, both. That's a unanimous win then in terms of our votes for Art Direction. Cool. Best Music / Sound Design. Listen, it's an interesting category for outstanding audio inclusive of score, original song, licensed soundtrack, and sound design. Weird because",
            "start": 812.15
        },
        {
            "text": "votes for Art Direction. Cool. Best Music / Sound Design. Listen, it's an interesting category for outstanding audio inclusive of score, original song, licensed soundtrack, and sound design. Weird because it's like those are two totally different teams of people working. Shift up. But it's I get like maybe not worth the its own category otherwise. Battlefield 1 from DICE, Doom from id, Inside from Playdead, Rez Infinite from Enhance Games with Thumper from Drool. Mmm, Thumper was the one that I left off and I forgot about when we did our nominations. I would have definitely put that in there. Whoo, man, it's hard. Inside was was very well sound design, but I don't give it to it here. I feel like Rez here. I feel like Rez and Thumper are the games out that the shout sound to me. But then I also feel like did enough people play them to feel comfortable in it? Battlefield of course has the entire but you know, Battlefield 1 has of course the there's tank noises, VO, and explosions in this and bullets whizzing",
            "start": 856.37
        },
        {
            "text": "enough people play them to feel comfortable in it. Battlefield of course has the entire but you know, Battlefield 1 has of course the there's tank noises, VO, and explosions in this and bullets whizzing past your head going over as well. But I think that I into when people think about this, they don't think about those things. Sure. You know, it's like when you're thinking about the winners of this, it's the it's in similar to your argument for Firewatch. And people are gonna think Firewatch because when you think Art Design, you don't think Uncharted, you think Firewatch. When you think Sound Design, you think Rez. My my thing is Thumper would win if more people played it. I don't know if enough people played it to get it. Doom is also I think an easy and easy answer. True. 'Cause it does have that sound aesthetic to it. Right, right. ****, I was a Thumper. Probably heard that's your prediction. Yeah, I'm gonna go Rez. Tim, Thumper's my vote. I'm gonna go I'm gonna go Doom. Okay, next category, Best Performance.",
            "start": 914.63
        },
        {
            "text": "to it. Right, right. ****, I was a Thumper. Probably heard that's your prediction. Yeah, I'm gonna go Rez. Tim, Thumper's my vote. I'm gonna go I'm gonna go Doom. Okay, next category, Best Performance. Awarded to an individual for voice over acting, motion and / or performance capture. Alex Hernandez as Lincoln Clay in Mafia III, Cissy Jones as Delilah in Firewatch, Emily Rose as Elena in Uncharted 4, Nolan North as Nathan Drake in Uncharted 4, Rich Sommer as Henry in Firewatch, or Troy Baker as Sam in Uncharted 4. I think you give it to Nolan this year. Final Nathan Drake go around. It's the culmination of the entire Drake franchise. That means a lot. You I don't know if it should necessarily in terms of performances. All these performances were great from I saw. I think the ones you listed, I think a Lincoln Clay's or Lincoln Clay is the one I know the least from Mafia, but heard nothing but good things about it. Yeah, I think you do. I think Nolan does get a run for his money from the Firewatch",
            "start": 956.0
        },
        {
            "text": "a Lincoln Clay's or Lincoln Clay is the one I know the least from Mafia, but heard nothing but good things about it. Yeah, I think you do. I think Nolan does get a run for his money from the Firewatch cast. Yeah, yeah, yeah. That's the only thing going into this. I can see people voting for the Firewatch people because the other the Uncharted guys and Lady have gotten talked about for insurers. But I'm trying to think back if Nolan North's ever won a performance game award before. Not that this is like the Oscars where there's like somebody doing detailed stats on this or whatever. Like he's there's a Leonardo DiCaprio. How are you weighing down on this one? I think Drake wins. Nolan North, I think you should and I think you will. That's kind of where I stand. Tim. Hmm. The nation turns its eyes to you. I I'm down with that. That's solid to me. So, Nathan Drake for Nolan. Yeah, granted, I think all these people did amazing on a percent except hundred percent familiar with Mafia III besides",
            "start": 1017.46
        },
        {
            "text": "you. I I'm down with that. That's solid to me. So, Nathan Drake for Nolan. Yeah, granted, I think all these people did amazing on a percent except hundred percent familiar with Mafia III besides that all these are great choices. Next category. What are you, Tim? Oh yeah, no, I'm sorry. I let I led with that. Nolan winning it. Right. Games for Impact. Honoring exemplary games that take on real-world issues and advocate for social change. 1979 Revolution: Black Friday from iNK Stories, Block'hood from Plethora Project / Devolver Digital, Orwell from Osmotic Studios / Surprise Attack, Sea Hero Quest from Glitchers, and That Dragon, Cancer from Numinous Games. No idea. I don't know any of those. I here's the thing is that before we vote, I want to make sure we go and I mean, not here before we vote really. If and I'm pretty sure we have to vote. So I want to go back as yeah, the only one I've played is That Dragon, Cancer. However, it would it's my prediction pick. I'm not gonna make a vote. Obviously, it's my",
            "start": 1070.47
        },
        {
            "text": "if and I'm pretty sure we have to vote. So I want to go back as yeah, the only one I've played is That Dragon, Cancer. However, it would it's my prediction pick. I'm not gonna make a vote. Obviously, it's my prediction to win as well based on the same thing that everyone knows about That. Yeah, I did not knows about it. Like maybe you know everything about it, but you should have heard about it when we did a let's play. I mean, it's of the Impact games here. It sound it seems like the one the biggest profile. There's a dot, you know, the documentary about it or whatever. And it was on NPR, not This American Life, but one of those podcasts, not The Moth that I forget. But they like there's been coverage about this. You understand that it's about this, you know, father's journey through his son's cancer and how that all work together. I think there's enough of that resonating that that's going to look cool. Yeah, sounds I'm bye-bye that. Two. Best Independent Game for outstanding achievement in a game made outside",
            "start": 1129.45
        },
        {
            "text": "all work together. I think there's enough of that resonating that that's going to look cool. Yeah, sounds I'm bye-bye that. Two. Best Independent Game for outstanding achievement in a game made outside the traditional publisher system. Firewatch by Campo Santo, Hyper Light Drifter from Heart Machine, Inside from Playdead, Stardew Valley from ConcernedApe, The Witness by Thekla, Inc. What is the thing again in Best Independent Game? Ain't I category? Yeah. Um, I mean, Inside. Inside, I think for both the window game. I will win in the game that should one. Mm-hmm. I think my vote would be Inside. I worry about Stardew Valley. Colin's for The Witness or The Witness. That is a good point too. Both of those could win it, but I still give it to Inside. Unless Inside wins the other ones though, it's not gonna matter because no one's gonna know how the vote went. It's not like you're waiting for the answer to the first question before you answer the second lecture. You figure if you're if you're voting, you get to",
            "start": 1166.32
        },
        {
            "text": "because no one's gonna know how the vote went it's not like you're waiting for the answer to the first question before you answer the second lecture you figure if you're if you're voting you get to this one and this is Stardew Valley's only time out there you know how important that game was this year do you give it its one not here I hope not I hate what if people don't like that's stupid you know it's like one or two games sweep everything Stardew were the best games of the you know I'm with you don't get me wrong I'm but this is the fun this is you're asking why are we predicting I think this is the fun part I'm trying to get ahead of how it's going to go I'm gonna say Inside as well but alright Best Mobile / Handheld Game for the best game playable on mobile phones and dedicated gaming handhelds. Can you believe we got to this point cause those are together? Clash Royale from Supercell, Fire Emblem Fates by Intelligent Systems, Monster Hunter Generations by Capcom, Pokémon Go by Niantic Labs and Severed by DrinkBox Studios. I will say I did not know nominate Pokémon Sun and Moon because I hadn't played it yet I think that that game got **** because of the timing of when it came out it's too close to the yeah the cutoff date and so yeah it's not even their personal pickier Severed I just want to get that out there in front I I think Severed is an amazing game it would be that's gonna be I think when we get to our Game of the Year stuff it'll come up a little bit more than it comes up here but it's sad that I don't think enough people play it's ever to sit there like yeah I know that was something cool that was something special when's the last time you played a first-person dungeon crawler right that was really really really fun and enjoyable and as beautiful as this art was",
            "start": 1221.19
        },
        {
            "text": "handhelds can you believe we got to this point cause those are together? Clash Royale from Supercell, Fire Emblem Fates by Intelligent Systems, Monster Hunter Generations by Capcom, Pokémon Go by Niantic Labs and Severed by DrinkBox Studios. I will say I did not know nominate Pokémon Sun and Moon because I hadn't played it yet I think that that game got **** because of the timing of when it came out it's too close to the yeah the cutoff date and so yeah it's not even their personal pickier Severed I just want to get that out there in front I I think Severed is an amazing game it would be that's gonna be I think when we get to our Game of the Year stuff it'll come up a little bit more than it comes up here but it's sad that I don't think enough people play it's ever to sit there like yeah I know that was something cool that was something special when's the last time you played a first-person dungeon crawler right that was really really really fun and enjoyable and as beautiful as this art was",
            "start": 1257.07
        },
        {
            "text": "was something cool that was something special when's the last time you played a first-person dungeon crawler right that was really really really fun and enjoyable and as beautiful as this art was and just a different experience I don't know um this is the big question right like what do you do with Pokémon Go? Yeah it was it was it was an experience a movement it was everywhere normal people were don't play games are out there talking about him playing in the middle of the night wandering around doing gym battles interacting with strangers like there were these things does that overcome the fact that it was as popular as it was a time that popular it was a flash in the pan and that it was broken as ****? Yeah I mean I still give it to it I give both the my vote and I think it wins to Pokémon Go. Fire Emblem Fates is definitely one my favorite games the year for sure but despite that I mean Pokémon Go did something so different and it did it well even though it was broken despite it being",
            "start": 1303.87
        },
        {
            "text": "Pokémon Go. Fire Emblem Fates is definitely one my favorite games the year for sure but despite that I mean Pokémon Go did something so different and it did it well even though it was broken despite it being broken people still enjoyed it so much and I think that that it's the amount of people that enjoyed it the amount that they did is a testament to the quality of the experience less the game but the game was just a means to the end sorry I gave its Pokémon Go. Colin, I think Severed should win but I think that Pokémon Go will win and perhaps deserves to win. Yeah, I'm Pokémon Go there too. Best VR Game. For the best game experience playable in virtual reality. Batman: Arkham VR from Rocksteady Studios and Warner Bros. Interactive, EVE: Valkyrie from CCP Games, Job Simulator from Owlchemy Labs, Rez Infinite from Enhance Games and Thumper by Drool. Batman will win. I think that out of the games I've met I mean I like Batman I think Job Simulator is awesome I would I would give it the Job Simulator but",
            "start": 1346.47
        },
        {
            "text": "from Enhance Games and Thumper by Drool. Batman will win. I think that out of the games I've met I mean I like Batman I think Job Simulator is awesome I would I would give it the Job Simulator but I think that uh that Batman is clearly gonna win out of these a lot like Thumper's my favorite but I think that my vote and what I think will win is Batman: Arkham VR because in terms of best experience that's the one I want to show people yeah I'm like that's the thing that I'm like this is gonna blow you away it's one of them and that's the thing you know Rez has that power too and that's also like not to disparage anything a real game like right where you're putting it on your playing and doing your movement all that stuff and it's also call back to what it was but yeah Batman has been my one from the get-go I would think yeah that probably wants it and again I think that's one little yeah that's what I would vote for Rez was underwhelming to me yeah Thumper was amazing like I really love",
            "start": 1404.01
        },
        {
            "text": "from the get-go I would think yeah that probably wants it and again I think that's one little yeah that's what I would vote for Rez was underwhelming to me yeah Thumper was amazing like I really love Thumper but I don't think it it wins out over Batman. Best Action Game for the best game experience focused around first or third person combat. Battlefield 1, Doom, Gears of War 4, Overwatch, Titanfall 2. Um I would pick Battlefield. I think Doom will win which is totally reasonable to me as well. I was I yeah for me it would be Doom is going to win. Um I don't know if I have enough thoughts on these games so they're not ones that spoke to me and I'm not as we've talked about in this show him any time I'm not the shooter expert so I don't if I have a strong vote opinion either way I'd vote Overwatch but Doom wins. I think Best Action Adventure Game for the best game experience that combines combat with traversal and puzzle-solving. Dishonored 2, Hitman, Hyper Light Drifter, Ratchet & Clank",
            "start": 1454.46
        },
        {
            "text": "but Doom wins. I think Best Action Adventure Game for the best game experience that combines combat with traversal and puzzle-solving. Dishonored 2, Hitman, Hyper Light Drifter, Ratchet & Clank, Uncharted 4. Hmm, what are the can you name again? Dishonored 2, yeah, Hitman, Hyper Light Drifter, Ratchet & Clank, Uncharted 4. Uncharted will win. I think Ratchet probably should win since we're talking about the action portion of the game. I just don't if we're emphasizing the action. I mean action adventure I know but I hate that term it doesn't mean anything like um every game is an adventure. I mean an adventure game is something specific I just I don't I don't like that term in terms of actions and that they're you know I think Ratchet & Clank is mechanically the better game and it's not really playing Uncharted 4 for its action well so with that like the last topic was Best Action Game which is for the best game experience focused around first or third person combat which Ratchet kind of falls",
            "start": 1510.59
        },
        {
            "text": "Uncharted 4 for its action well so with that like the last topic was Best Action Game which is for the best game experience focused around first or third person combat which Ratchet kind of falls into and the Best Action Adventure for the best game experience that combines combat with traversal and puzzle-solving. Yeah, okay I guess maybe Uncharted then would have to win that one. I would say Uncharted will win and then should win based on that that nomenclature. Yeah, I'm Uncharted 4. Uncharted 4 for me too. Okay, goddamn I love Ratchet though. Ratchet, well it gets nominated game coming up it's getting another nod. Hell out of here. Okay, cool. Best RPG, the best game designed for rich player character customization and progression both offline and online including massively multiplayer. Dark Souls III, Deus Ex: Mankind Divided, The Witcher 3: Wild Hunt – Blood and Wine, World of Warcraft: Legion, Xenoblade Chronicles X. Play any of these so I can't speak up. Yeah, I can't. Well give me I'm sorry what was that",
            "start": 1568.35
        },
        {
            "text": "Mankind Divided, The Witcher 3: Wild Hunt – Blood and Wine, World of Warcraft: Legion, Xenoblade Chronicles X. Play any of these so I can't speak up. Yeah, I can't. Well give me I'm sorry what was that first two again? Dark Souls III, yeah, Deus Ex: Mankind Divided. Gotcha. Oh yeah I mean I'm just guessing who's gonna win obviously since I didn't get into the weeds on here. Nick's played a lot of Deus Ex. I think Dark Souls, I think Dark Souls III of a shame you gotta go Dark Souls. Something yeah I think Dark Souls will win. I don't have a don't know excited play to them. Interesting to see The Witcher match on there. Cool. Not not against it. Yeah it was definitely media. No. Best Fighting Game for a game designed primarily around head-to-head combat. Killer Instinct: Season 3, The King of Fighters XIV, Pokkén Tournament, Street Fighter V. Don't got much dad. Yeah, no I would vote Pokkén. Enjoyed it a lot so he thinks gonna win in terms of who wins. **** I don't even know. Yeah there was kind of a yeah if there's an a",
            "start": 1611.28
        },
        {
            "text": "Street Fighter V. Don't got much dad. Yeah, no I would vote Pokkén. Enjoyed it a lot so he thinks gonna win in terms of who wins. **** I don't even know. Yeah there was kind of a yeah if there's an a fighting game dorks on there. Oh okay don't get mad. I mean it can't be Street Fighter V. It seems like Killer Instinct would be the one that went on that list. King of Fighters I don't think people are really that warm about. I've ever been saying that looks like every other game people like um I'm gonna vote Pokkén. You're saying Pokkén? Yeah, why not? Okay, what do you say? Go. I think Killer Instinct wins. Okay, that's the only game on that list that I has pretty much universal praise as far as I'm concerned so and that people actually play. Yeah, Milan only reason I'd vote for Pokkén is I think that that is a game that even people that aren't fighting game fans did play like to review and to talk about so maybe I get some sort of nod. Best Strategy Game, best game focused on real time or turn-based strategy.",
            "start": 1659.16
        },
        {
            "text": "game that even people that aren't fighting game fans did play like to review and to talk about so maybe I get some sort of nod. Best Strategy Game, best game focused on real time or turn-based strategy. Civ VI, Fire Emblem Fates, The Banner Saga 2, Total War: Warhammer, or XCOM 2. Mm, I didn't play enough of them. I'll just vote Civ VI. That's know when I played that'll of Civilization. I think XCOM will win um cuz there's so many nerds that love XCOM out there. Goddamn. Yeah, I think don't go wrong those the two that I see actually going head-to-head with. I was I'm going to say Civ VI and I think that based on what I've no friend me I like to XCOM 2 a lot and what I did for the background research for Civ when I did that that interview series for Kinda Funny. I would vote for that. Civ seems like they put a lot into that in a Civ. Mm-hmm. I would vote for Fire Emblem. Okay, it's cuz I loved it but I think that XCOM 2 wins. Okay. Best Family Game, best game for family play including toys life rhythm / music / dance",
            "start": 1711.68
        },
        {
            "text": "into that in a Civ. Mm-hmm. I would vote for Fire Emblem. Okay, it's cuz I loved it but I think that XCOM 2 wins. Okay. Best Family Game, best game for family play including toys life rhythm / music / dance and other genres. Dragon Quest Builders, Lego Star Wars: The Force Awakens, Pokémon Go, Ratchet & Clank, Skylanders Imaginators. This is where I think you give it to Ratchet. That's my vote. My vote would be Pokémon Go but I I think you have to Ratchet as well. I think Pokémon Go will win but I think that Ratchet should should win. Hang in there. Yeah. Best Sports/Racing Game for traditional and non-traditional sports and racing games. FIFA 17, Forza Horizon 3, MLB The Show 16, or NBA 2K17, or Pro Evolution Soccer. NBA 2K will will win and should win just based on how I know people feel that all those games. I know some of the people have FIFA and all these games but NBA 2K is considered a pretty immaculate mm-hmm sports franchise. Agreed with that too. Best Multiplayer for outstanding online multiplayer",
            "start": 1757.85
        },
        {
            "text": "I know some of the people have FIFA and all these games but NBA 2K is considered a pretty immaculate mm-hmm sports franchise. Agreed with that too. Best Multiplayer for outstanding online multiplayer gameplay and design including co-op and massively multiplayer experiences. Battlefield 1, Gears of War 4, Overcooked, Overwatch, Titanfall 2, Tom Clancy's Rainbow Six Siege. Um can't give to you one more time. Sorry I was full of age. Battlefield 1, Gears of War 4, Overcooked, Overwatch, Titanfall 2, Rainbow Six Siege. I think it's a Overwatch and I think I would I would vote for Overcooked. Yeah, yeah, I'm the same. Me too. Most Anticipated Game, an upcoming game that has shown significant ambition and promised in moving the gaming medium forward. God of War, Horizon Zero Dawn, Mass Effect: Andromeda, Red Dead Redemption 2, The Legend of Zelda: Breath of the Wild. I think Red Dead Redemption 2 wins this. I'd be disappointed if some of these games like Mass Effect and Red Dead one consider we haven't seen a **** goddamn thing for",
            "start": 1817.82
        },
        {
            "text": "The Legend of Zelda: Breath of the Wild. I think Red Dead Redemption 2 wins this. I'd be disappointed if some of these games like Mass Effect and Red Dead one consider we haven't seen a **** goddamn thing for them. Remember last year you know No Man's Sky won? Yeah, which is absurd. Um I would give it to Horizon and I think Horizon should win. Will it win? I don't know. People probably would Red Dead. I don't know. You voting for that? I like based on like two seconds of footage but yeah I would give it to Horizon and we've seen the most of that game. Yeah, no don't we're on. I think that's my personal vote and I think I think Horizon actually has a really good shot at it but I think it is the sticker shock of Red Dead. I go Zelda for both. Know Trending Gamer for a notable influencer online stream or media personality in 2016. Angry Joe, Boogie2988, Danny O'Dwyer, Jacksepticeye, or Lirik. A personal vote is Danny and I love Boogie and I enjoy Joe's content. I'm Jack and Jacksepticeye also an awesome human being yet I",
            "start": 1871.25
        },
        {
            "text": "in 2016. Angry Joe, Boogie2988, Danny O'Dwyer, Jacksepticeye, or Lirik. A personal vote is Danny and I love Boogie and I enjoy Joe's content. I'm Jack and Jacksepticeye also an awesome human being yet I think Danny I my vote is Danny my prediction is Danny but it needs to be it needs to be like it was for me where none of no one else motivates their audience that's the big thing whereas I don't know we were in a special place last year Kinda Funny where we just broke down around we had all these headlines it was so when I did it it was still for our audience this thing of like we're on the ground floor were a win for Greg and Kinda Funny to win for us and I think what's interesting about this one is Danny's in a similar spot I don't think he has the community like we have in terms of like the Best Friends or speaking all these people but I do think that everyone looks at him as I holy **** you left and you're not just kind of doing what you were doing before I mean he is but he's doing",
            "start": 1921.63
        },
        {
            "text": "Best Friends or speaking all these people but I do think that everyone looks at him as I holy **** you left and you're not just kind of doing what you were doing before I mean he is but he's doing something super special and unique in these documentaries even its Patreon super unique ride of like the money you're giving me is immediately going back into these projects when we're going out we're buying airplane tickets and we're this is not we're not using advertisers we're not doing that message resonates in terms of the trend in what's different and who's made an impact yes but I do think that if Jack wants to say oh hey everybody vote for me it's **** over because it South by Southwest like that last year when I was up for that other award this year that was the first time I met Jack and really saw his his audience where you know I was always funny where I Game Awards last year I think people even my friends that I was meeting they're like oh boy are you covering I'm like no I'm",
            "start": 1968.97
        },
        {
            "text": "and really saw his his audience where you know I was always funny where I Game Awards last year I think people even my friends that I was meeting they're like oh boy are you covering I'm like no I'm nominated like oh who are you gasps oh my god PewDiePie not like oh well it's cool to be nominated they didn't think I could win it and then when I did win it I was like oh that was awesome the crowd actually cheered for me like it what I thought nobody would clap for me you know they'd all be sorry for the other guys and then we got to South by Southwest when the pre-show was out there they're like I know you're all just here to see Jacksepticeye and the place went **** crazy and I was like oh these aren't these aren't our people these are not my people and sure enough I it was what I thought Game Awards are gonna be where they went through nominees and when I got to Greg Miller was like who I was like all right cool and then I got up there whenever like what the **** like if Jack wants",
            "start": 2003.5
        },
        {
            "text": "Game Awards are gonna be where they went through nominees and when I got to Greg Miller was like who I was like all right cool and then I got up there whenever like what the **** like if Jack wants to he could win. Yeah, and I totally agree with you. I think that Danny. Danny's my votes um and like you said I love Boogie as well but I think that for Danny to win Danny needs all of you guys to go vote for him and to be motivated to do that. I think Danny has a really good thing going for him that he has our audience and Giant Bomb's audience and uniting both of those fronts to vote for him. I feel like we got a really good shot at that. I love Boogie but I feel like we need we need to make a choice and we need to support one person and I mean and again to be clear on what we're talking about here I think you know I love Boogie too. We've been one of our biggest supporters period. Yeah, great dude but Boogie's been is doing the same thing away right? Like you don't I mean like and that's the",
            "start": 2039.53
        },
        {
            "text": "here I think you know I love Boogie too. We've been one of our biggest supporters period. Yeah, great dude but Boogie's been is doing the same thing away right? Like you don't I mean like and that's the thing is like I was seeing a lot of feedback on on the end of day I was like well I don't even know who Danny is he's not trending or whatever. It's like it's not about that though. It's like he's doing something that should be he is setting the trend. It's not trending in terms of like how popular yeah it's you are changing the trend of how gaming media is. Yeah, so our vote is definitely there. I hope you guys is as well and that the thing here you know you were going up against Markiplier and PewDiePie rich those are like top dog dudes. Yeah, and that that was always scary but they never motivated their audience. Yeah, Jacksepticeye little worried about it. The type of guy that motivates his Jack has an audience and talks to them. Yes, and that's a big thing. Yeah, I think you that you're predicting",
            "start": 2079.25
        },
        {
            "text": "their audience yeah Jacksepticeye little worried about it the type of guy that motivates his Jack has an audience and talks to them. Yes, and that's a big thing. Yeah, I think you that you're predicting Jack. Who's your prediction? I love a good underdog story that's why I got names. Yeah, I'm voting for Danny. I predict Jack cuz I do think that he will motivate them but I I I hope that that motivates you guys to prove me wrong cuz Mr. Moriarty um I think Boogie should win um I like him I I like Danny too and I've heard good thing about your I don't know what the **** I other two people are and I'm sure that they're way bigger than us stuff but so I'm not insulting anyone. I like Boogie. I think he's friendly on the portraits but a lot of positivity out there. I think he's got a unique gentleman and I think he's paid his dues and I think that Boogie should win and I know personally has had my back before and I appreciate that as well but uh who do I predict you'll win? I can't imagine Danny",
            "start": 2118.64
        },
        {
            "text": "and I think he's paid his dues and I think that Boogie should win and I know personally has had my back before and I appreciate that as well but uh who do I predict you'll win? I can't imagine Danny winning simply because I just know and cursorily kind of looking up these two last names Lirik and Jacksepticeye that they're huge people like so again it's just like the reason and we make fun of you but it's true the reason that you won over those other two people that bigger people because they were just go place and didn't care. Yeah, and so the second that one of these people care is over you know because Danny doesn't have your pole and uh you know so who do I I don't know I would defer to Tim on this and he says Jacksepticeye when I would assume Jack will win too but I just can't imagine that it's gonna be Danny even though I saw Danny win him he's a friend of ours I would be totally hyped for it. I wouldn't encourage people to vote for Boogie. He's just said he just like we do that in",
            "start": 2160.58
        },
        {
            "text": "that it's gonna be Danny even though I saw Danny win him he's a friend of ours I would be totally hyped for it. I wouldn't encourage people to vote for Boogie. He's just said he just like we do that in sports. Nice guy. I know it. So now yeah we're gonna just to run through don't think we need to even really talk about these. Best Fan Creation. Yeah, it's like Project AM2R, Pokémon Uranium, Brutal Doom 64, or Enderal: The Shards of Order. Great people really like them. Esports Player, a whole bunch of people although I do want to give a shout to Hungrybox who play Smash Bros. He's **** awesome. Best Esports Team, no idea. Best Esports Game, Counter-Strike: Global Offensive, League of Legends, Overwatch, Street Fighter V. Clearly I think it's Overwatch. Drop a nuclear bomb on that list of games. Whoa. Just get there. We go. That's The Game Awards December 1st. Cool. We will be doing an E3-style thing where we pre-show, live reaction, post-show. Yeah, yeah, yeah. And uh that should be fun. It should be excited to",
            "start": 2201.25
        },
        {
            "text": "get there we go that's The Game Awards December 1st. Cool. We will be doing an E3-style thing where we pre-show, live reaction, post-show. Yeah, yeah, yeah. And uh that should be fun. It should be excited to see what trailers are there. Ya know ever since it's weird this year usually we kind of have an idea of what could be shown there. Well this will be the debut of Mass Effect gameplay. They said that already and I say debut loosely because they should discovered it already but I'll be a world premiere gameplay there. Uh it seems like with that a the Telltale is it is it not The Walking Dead? People were predicting that would be there but I don't know if the games affected by the strike and that's how it leaked is that something they want to promote yet or they want to figure that out? I don't know that intercept and that's the other thing to you haven't heard anything about The Walking Dead: Season 3 by then. I'd imagine that would be the one you come out because you'll have you debut the trailer, and it's",
            "start": 2246.58
        },
        {
            "text": "and that's the other thing to you haven't heard anything about The Walking Dead: Season 3 by then. I'd imagine that would be the one you come out because you'll have you debut the trailer, and it's available Tuesday or mm-hmm",
            "start": 2289.97
        }
    ]
}