{
  "id": 2188,
  "video_id": "HPQbYUmogJE",
  "show_name": "Gamescast",
  "hosts": [],
  "title": "Pokemon Sun & Moon Review - Kinda Funny Gamescast Ep. 95 (Pt. 1)",
  "description": "Tim gives his review of Pokemon Moon.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
  "published_at": 1479736801,
  "duration": 1682,
  "transcript_chunks": [
    {
      "text": "This episode of the Kinda Funny Gamescast is brought to you by MVMT Watches. We get it, holiday shopping can be tough, but thanks to MVMT Watches, all that gift-giving anxiety can disappear with the press of a button. The holiday shopping season's here, and with MVMT, you can skip the crowds and standing in crazy lines at the mall and finally find a gift that all the people you love will love at prices that beat the department stores. These watches be the perfect purchase for just about anyone in your life, guy, girl, don't matter. And remember, they start at only $95. You can get 15% sign off today with free shipping and free returns by going to MVMTwatches.com/kinda. That's MVMTwatches.com/kinda. Now it's time for you to step up your watch game. Go to MVMTwatches.com/kinda. Join the movement today. What's up, guys? Welcome to the first ever Episode 95 of the Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty, looking",
      "start": 0.08
    },
    {
      "text": "the movement today. What's up, guys? Welcome to the first ever Episode 95 of the Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty, looking extra tall, I like it. And Greg Miller, let's cut through the **** and I thought you were going to beat me to it and I was going to be very, very upset with you. Colin looks fantastic. This shirt is making him look like an Adonis. Not right now because now he looks like he's all small and slouchy, but like, why, why Kevin, why right here? Look at the definition he's getting in here. He's getting that come back up a sec, come back up just a sec, then you can go back down. Look at the definition he's getting in here. This belly, he's looking real good, real good. I like the colors of the shirt. It's Gamescast colors. It's a severed shirt. Yeah, looking good game. Thank you. It is a great game. Cool dudes, one of the great games of the year. Looking damn good at it too. You look good too, Greg. Thank you. Want to spread",
      "start": 42.96
    },
    {
      "text": "it's a severed shirt. Yeah, looking good game. Thank you. It is a great game. Cool dudes, one of the great games of the year. Looking damn good at it too. You look good too, Greg. Thank you. Want to spread the love. It's fine. You and I are just in our normal way. This is, this is good look for Colin Moriarty right now. He's looking good. This is my hair from yesterday. I apologize involved. It's been rough life. Yeah, gets in the way. Sure. Uh, get in the way of show. We're got in the way. Yeah. What do you got? What we got in the way? The shower? Your schedule just get out of whack? No, like, like just like sad stuff. Okay, we won't talk about it then. We talk about it's all good. Anyways, I hope all of you are well listening and watching this. Uh, if you didn't know, this is the Kinda Funny Gamescast. Every week we get together to talk about video games, all things we love about them. You can get it on Patreon.com/KindaFunnyGames early or you can get it later on YouTube.com/KindaFunnyGames. Either way, we appreciate",
      "start": 99.64
    },
    {
      "text": "to talk about video games, all things we love about them. You can get it on Patreon.com/KindaFunnyGames early or you can get it later on YouTube.com/KindaFunnyGames. Either way, we appreciate and love you very much. Um, that's pretty much all for the rigmarole. What you guys been playing recently? Watch Dogs 2. Still, I'm addicted and it's getting worse. It's all I want to do. Tim, so you're playing yesterday, I saw and I was, I was asking you how the single player going and you're saying you're just doing who the **** knows how the single player's going. I run around doing all the side stuff. I'm just collecting non-stop because it's just one of those things that I'm doing so well at getting the research points and unlocking the new things on my trees. Why even bother playing the game until I've done all of that? Until I've gotten every paint job, until I've gotten every piece of clothing, until I've gotten every research point. Why? I mean, how can they expect me to focus on anything in",
      "start": 141.64
    },
    {
      "text": "I've done all of that until I've gotten every paint job, until I've gotten every piece of clothing, until I've gotten every research point. Why? I mean, how can they expect me to focus on anything in this game until I've gotten all the Scout missions done where I've taken my selfie in front of everything? Point also to this whole Scout selfie game taking where the **** is the Bushman? I'll tell you right now, 4 o'clock any **** day you go down to, you go down there to Pier 39, he's going to be there. But I get there and I get the little message, come back later, like the zombies, come back later, like the people getting married, come back later. And I'm like, I appreciate this to an extent, but I don't appreciate the fact that I've come back multiple times to these locations and they're timed. Yeah, I need and I don't want to, I don't want to do thing where I look online. I'm also thinking maybe it's as I progress, maybe as I progress through this story, they will start popping up. But the, the way I see it,",
      "start": 178.64
    },
    {
      "text": "and I don't want to, I don't want to do thing where I look online. I'm also thinking maybe it's as I progress, maybe as I progress through this story, they will start popping up. But the, the way I see it, and this will be a time capsule for them, the way I see it, Jen leaves late Saturday night, like basically 1:01 Sunday morning, kick her to the curb, wake up Sunday and just play nonstop. And then I'll actually do some of these goddamn story missions. Get in there, see what DedSec's up to. Cause the ones when I do stumble in one, when I want to shake it up, as they say, and I go in there and do a little bit, cause you know, they have, they have a nice little progression bar. You of when you're going to your little DedSec app, you can see every mission you have available to you, how far you've gone in them, because they're like narrative based or whatever, which I really like. And so sometimes I'll be driving, I say, oh, there's that thing I was supposed to hack from forever ago for this thing. Go over there, hack it,",
      "start": 213.68
    },
    {
      "text": "they're like narrative based or whatever, which I really like. And so sometimes I'll be driving, I say, oh, there's that thing I was supposed to hack from forever ago for this thing. Go over there, hack it, report back to the DedSec crew. And then they're like, all right, the next objective is over there. I'm like, great, still looking for The Donut Man to go get that trophy and take my photo with him. You know what I mean? Like, I got things to do before I get on to hacking the planet with you. And, and then I drive by, I haven't been in that store in a while and have a lot more money. What outfit do I need? Well, I haven't seen the store before. What I do there? I went to Alcatraz yesterday. Get to Alcatraz. I've never been to Alcatraz. That's what really, yeah, I guess that's one of the weird things about living in a city with the tourist attraction, right? I've never been up in the Sears Tower, now the Willis Tower, but always be the Sears Tower. I mean, right? Did they change the name of that tower? Yeah, yeah, some",
      "start": 251.36
    },
    {
      "text": "in a city with the tourist attraction, right? I've never been up in the Sears Tower, now the Willis Tower, but always be the Sears Tower. I mean, right? Did they change the name of that tower? Yeah, yeah, some **** and well, Sears and Roebuck not having a great four decades. But yeah, it's the thing. I go over to Alcatraz. I get there for some reason, the gangs had like, there was a gang set up on Alcatraz that was protecting a, a bag of money. I knocked all these **** out and got their money and got out of there. But then I was just going, I was like, oh, there's Marin. Why not go over there? Ended up in Oakland at one point. I'm just bumming around and just seeing what's happened in the Bay Area. I don't know why you'd ever want to go to Marin. Well, cause there's, there's collectibles there. There's research points there. You know what I mean? Originally, I bought my first set of clothes over in Marin when the game started. Got some biker gear. Okay. And then I saw that, you know, one of the research points was hidden",
      "start": 282.08
    },
    {
      "text": "there. You know what I mean? Originally, I bought my first set of clothes over in Marin when the game started. Got some biker gear. Okay. And then I saw that, you know, one of the research points was hidden. I knew eventually I would have the ability to come back and get it. I have the ability to come back and get it. Cause now, Colin, I can control the little things that lift construction workers up. Not cranes. I can't control those. Two forklifts. Forklift the buckets as, no, not even that. It's, it's, it's similar to the forklift concept, but it's just imagine a, it's just a scaffolding that moves up and down on its own. But Cherry Pickers. Cherry Pickers have buckets, don't they? Doesn't matter. I'm contr, what are those things that, that Bernie has at Roost your teeth that segue actually go up? They use an immersion. You guys never, I don't know. He's an ****. I think that's what you're talking about. It creates all the X's going up. Yep, that's the one. Yeah, yeah, I forgot what the thing's called. I don't remember.",
      "start": 317.16
    },
    {
      "text": "you guys never, I don't know. He's an ****. I think that's what you're talking about. It creates all the X's going up. Yep, that's the one. Yeah, yeah, I forgot what the thing's called. I don't remember either. But I knew I one day I can control it. Now I can. So I've been running around doing that stuff. I've seen way more in San Francisco with murals and all these different things, landmarks. I've never, like you're saying, I've never actually gone to Lombard Street and **** around Lombard Street. I know it's there. I see it sometimes when I drive by it, but it's really curvy. Here I am now taking photos, jumping cars, doing crazy **** with it. I got my nitrous. I'm nitrousin' all over the **** city. Doing, having a great time. I like that. I appreciate that. Seems like a lot of people like the game. There's a bit of a disconnect with the whole online mode not working. Yeah, and that, that's what's interesting is I was, when I was playing it, uh, I was talking to Colin after the Gamescast last week. I started",
      "start": 359.32
    },
    {
      "text": "a bit of a disconnect with the whole online mode not working. Yeah, and that, that's what's interesting is I was, when I was playing it, uh, I was talking to Colin after the Gamescast last week. I started getting where it was running it like two frames a second and having all these issues. And I wasn't, I, I, it finally dawned on me a few days later, oh, it's probably because I'm connected online. And then they put out the statement about seamless multiplayer, like, wait, we've disconnected this. It'll be back one day. Yeah, it's been interesting. I, because that was the thing though, of I was going to be interested to see how it reviewed and what happened. And it sucks that they have this thumbprint on it. It sounds like, I mean, but it's also a catastrophic event or catastrophic event in the same way. It's not at all, right? Because like I always say about my games, like Colin always says about his, I don't need multiplayer in this. Yeah, but I, I, I think it's catastrophic not in terms of the",
      "start": 392.68
    },
    {
      "text": "the same way it's not at all, right? Because like I always say about my games, like Colin always says about his, I don't need multiplayer in this. Yeah, but I, I, I think it's catastrophic not in terms of the individual's actual experience with it. I think more in terms of that the game's perception where that game needed everything it, it could get to succeed. And like any hit, every, any hit it gets is going to really be detrimental to it, especially right now. Like them getting, I forgot what I got from IGN, but it was some like a 6.5, five was in progress review. I don't know if they've updated it. A 65 in progress review is not good. You know, for a game that needed an eight to be relevant to, to those people. Obviously, the people that want are going to play it anyways. For the game to like chart well, I don't know. I'm interested to see how it sells because already it had a lot going against it. And this type of stuff could be really bad because it seems like the people that are playing it really like, like it. Yeah.",
      "start": 429.28
    },
    {
      "text": "interested to see how it sells because already it had a lot going against it and this type of stuff could be really bad because it seems like the people that are playing it really like, like it. Yeah. So I, but that's what's been interesting is the fact that, you know, we talking about what a reviews matter anymore, right? We had the whole Bethesda review discussion and how their new policy was going to affect games and da da da. And how we were talking about, you know, the different micro communities, like this one listening, people on Twitter and Twitch more. It seems like, yeah, the IGN review I saw day one and I haven't heard or thought about it since. Cause since then it's been, well, the whole thing with the vagina getting posted and that guy getting in trouble. But on top of that, then just people putting up their screenshots. And right before this, I tweeted that I just want to go play Watch Dogs. And the responses I'm getting from people are, yes, only a few more work hours, this, that and the other. They're",
      "start": 468.32
    },
    {
      "text": "their screenshots. And right before this, I tweeted that I just want to go play Watch Dogs. And the responses I'm getting from people are, yes, only a few more work hours, this, that and the other. They're all talking about it too. Carbon's tweeting about it. Like people are out there enjoying it. What about you, Colin? Not much, Dy. Uh, last week is I've been busy with other things. So just Call of Duty, uh, which we talked about last week. So nothing else in addition to that. Cool. Other things getting in the way. Big things, big things. Lola, Lola, tiny. She small, 16, 17 pounds. I mean, she's small. But, uh, no, just the election. I've just been reading and writing and doing other things. I didn't really feel like playing games last week. So I played Call of Duty a little bit, but I'm just not really been in the mood. So nothing new to, nothing new to report this week. See, this is where I'm at with Watch Dogs is I feel like I got to dedicate time to this. I got to nip this in the butt. I got to get it tackled to the ground. I'm",
      "start": 503.4
    },
    {
      "text": "new to, nothing new to report this week. See, this is where I'm at with Watch Dogs is I feel like I got to dedicate time to this. I got to nip this in the butt. I got to get it tackled to the ground. I'm enjoying myself. I'm having a ball. Exactly. And I'm, you know, right after that's Persona. There's some, what? No, ****. Uh, no, yeah, there's, there are other things to play, especially like, you know, Dead Rising's on the horizon. I'm looking forward to that still too. I'll play your Final Fantasy, Last Guardian. But I right now, I have a time to focus on this. I want to try Dishonored. Everybody seems like Dishonored is great. I mean, I granted Dishonored 1 wasn't for me, but I want to do Dishonored 2. Mhm. Mhm. I've been playing a little game called Pokemon Moon. Did you catch them all? Didn't catch them all. Caught a lot more than I would have ever expected myself to. Uh, played the game. Say right. Got to catch a lot more than you ever expected to. Pokemon. That's the new 2016 model for. Got. Yeah, for some reason,",
      "start": 539.48
    },
    {
      "text": "caught a lot more than I would have ever expected myself to. Uh, played the game. Say right. Got to catch a lot more than you ever expected to. Pokemon. That's the new 2016 model for. Got. Yeah, for some reason, it's not doing as all. Uh, I, I beat the game. I have about 30 hours clocked on, on my file. You're a weird one. I feel like you played this game under the radar the entire time. I never knew you were. You didn't come in talk about it. You didn't say anything to me. I mean, it was over the course of three days. Like, damn, pretty quickly. I think it was the weekend. So, yeah. Makes that probably why Tim doesn't call. I've been trying to wait and, you know, talk about it here. Uh, it was one that I wanted to get done quickly because I, I know that at any moment we're going to get Final Fantasy. And I'm just like, I got to be ready for that. Um, Pokemon Sun and Moon, we've talked about it many times on this show. It's a game that I was not really looking forward to. And it wasn't until like, like the last couple days before we got it,",
      "start": 578.96
    },
    {
      "text": "for that. Um, Pokemon Sun and Moon, we've talked about it many times on this show. It's a game that I was not really looking forward to. And it wasn't until like, like the last couple days before we got it that I was like, huh, I started reading a lot of threads about it because things were leaking and stuff. I'm like, man, am I interested in this? Like, cause now I'm getting excited now that like, it's a real thing. Because going into it, it's like the, the hype train of Pokemon games. I've been out of that for so long. Like, and everybody, a lot of people talk a lot of **** about me because I'm like a Gen 1 when it comes to it. And it's like, I love Red, Blue, Gold, Silver are my favorites. Ruby and Sapphire, great. Diamond, Pearl, pretty good. Black and White, I kind of fell out of. Black and White 2 were great. But it's like, they none of them have the, the meanings that, uh, Red, Blue, Gold, and Silver did for me. So I am that type of fan. But I played the, the rest of them, X and Y included. Uh, so for me, getting to this level,",
      "start": 620.96
    },
    {
      "text": "none of them have the, the meanings that, uh, Red, Blue, Gold, and Silver did for me. So I am that type of fan. But I played the, the rest of them, X and Y included. Uh, so for me, getting to this level, I don't play competitively. I don't do any of that IV/EV training, any of that stuff. Like, that's way too deep for me. I just enjoy playing through the game, maybe playing with my friends once, like a little bit and call it a day. So for this to be coming out, I was like, I don't know that I need another Pokemon right now. Like, X and Y years ago at this point. Uh, I played and I thought that that was the right time for me to get back into Pokemon. And it was, it was a great time. And then they announced the, uh, Ruby and Sapphire remakes. And I was like, oh, that's cool. I liked the Hoenn region back in the day. But like, wasn't motivated to play them again. And they came out at a time where I'm like, I don't need more Pokemon right now. And when Sun and Moon were announced, I was disappointed. And I, I said this on",
      "start": 660.48
    },
    {
      "text": "like, wasn't motivated to play them again. And they came out at a time where I'm like, I don't need more Pokemon right now. And when Sun and Moon were announced, I was disappointed. And I, I said this on the shows where I'm like, I don't think 3DS needs another generation of Pokemon. And this is when the, the Switch was still in its rumor phase. Still out there. We still called it an NX. Never forget. Exactly. And for me, I'm like, all right, cool. There's all this news about Nintendo kind of having a fresh restart and going forward on that. So it felt like a weird back step for them to have another full generation of Pokemon on the 3DS. But then now that we kind of know everything, I think it makes a little more sense. Uh, because it's the 3DS. Nintendo needed something this holiday. And they had the NES Classic. But obviously, they really misplanned that. So I think Pokemon is the, the thing that they needed to be able to make it through the, the holiday season. And I think that it is good enough to do that. Oh, really?",
      "start": 701.88
    },
    {
      "text": "they really misplanned that. So I think Pokemon is the, the thing that they needed to be able to make it through the, the holiday season. And I think that it is good enough to do that. Oh, really? Um, so despite my lack of anticipation for the game, playing through it, I was like, man, all the **** that I've been talking about Pokemon in the last couple generations, like, I, I really need to eat my words on them a bit because, uh, Nintendo has been listening. And Sun and Moon is kind of the culmination of a lot of this type of fans' problems with the game. Uh, things like HMs taking up move spots for, for Pokemon and just kind of getting in the way and requiring you to, to have Pokemon that are just there in your party for HMs and nothing else. They got rid of that because now there's this Pokemon Ride feature where you essentially have this pager and you can just, uh, call a Charizard. It's not your Charizard, but it's like Uber. Kind of Charizard comes in, picks you up, takes you where you need to go, calls it",
      "start": 740.96
    },
    {
      "text": "where you essentially have this pager and you can just, uh, call a Charizard. It's not your Charizard, but it's like Uber. Kind of Charizard comes in, picks you up, takes you where you need to go, calls it a day. Or, uh, you get on the, the Stoutland Pokemon, like the big ass one. You can like run around and look for other items. So you don't need to use the Poke scul. Is surge pricing for these guys? Uh, there's no surge pricing. It's unlimited use. You, it's, and you get them pretty early on too, which is, which is great because it, it just feels like this game respects the fact that they know that most people playing it have played Pokemon before. Cut the **** and get you right into it. It's cutting a lot of the **** and it, it really kind of, there's a lot of features that keep things fresh but familiar. Yeah. Um, sometimes too familiar. And I don't think this is the best Pokemon game, but it was just different enough that I'm like, man, I didn't expect I'd like it as much as I did. And it, I had a great time. I want",
      "start": 786.2
    },
    {
      "text": "sometimes too familiar. And I don't think this is the best Pokemon game, but it was just different enough that I'm like, man, I didn't expect I'd like it as much as I did. And it, I had a great time. I want to keep playing it. Uh, the post game is lacking a little bit. Uh, but has some, some cool features. And story-wise, they did some things that I thought were, uh, really fresh. And there's no gyms in the game. And a lot of this stuff has been out there for a long time, but I haven't been reading about it. Like, I'm calling a Greg. Live will like top level look at a headline and make fun of stupid designs or whatever. But all the tropical guys, all they didn't, they do a lot of tropical guys this one. Yes, like forms. Exactly. Here's a Charizard and a pineapple and they **** and now we got this thing. Exactly. And that to me was one of those things as it was happening in my eyes is totally just pandering to the, you know, old school players. And it is. But I think that that was a smart call. Uh, because in addition",
      "start": 828.04
    },
    {
      "text": "that to me was one of those things as it was happening in my eyes is totally just pandering to the, you know, old school players. And it is. But I think that that was a smart call. Uh, because in addition to bringing back a lot of fan favorites and new forms that gave the game a feeling of freshness and familiarity at the same time that I think is really necessary for a big problem with a lot of the other generations of Pokemon is when you get in, everybody wants to see the ones that they know. Everybody wants to catch the Pikachu and whatever. So then the generations that are just all new ones, like Ruby and Sapphire were, or like, um, X and Y were, or Black and White were, rather. You go in and there's just a whole bunch of new Pokemon that there's a bunch of grumpy people like, great, it's another bird that's not a Pidgey. It's another rat that's not a Rattata. Like that, it gets kind of annoying. Job, job. Yeah. And but they're just clones of the things that aren't quite as good. Whereas this game, I think",
      "start": 868.04
    },
    {
      "text": "that's not a Pidgey. It's another rat that's not a Rattata. Like that, it gets kind of annoying. Job, job. Yeah. And but they're just clones of the things that aren't quite as good. Whereas this game, I think does a really good job of giving you the ones you know, but they're different. So the Alola forms, uh, it's, you're still getting Vulpix, but now it's ice type instead of fire or whatever. So it's like those type of things are nice. But in addition to that, the game even from early on switches up what you'd expect. So everybody that's played Pokemon knows that you get the Pidgeys and Rattatas early on. In this game, you can catch ghost types. You can catch water types, fire types in the second area of the game. And I'm like, holy ****, they're really opening this up to be a different type of experience. Um, while still giving us the, the old, a nice mix of new and old. So that it never felt overwhelming with new like clones, but it also didn't feel like, great, it's just the same thing over and over that we're",
      "start": 913.92
    },
    {
      "text": "still giving us the, the old, a nice mix of new and old. So that it never felt overwhelming with new like clones, but it also didn't feel like, great, it's just the same thing over and over that we're used to. Uh, then the, the biggest change is that there's no gyms. And instead of gyms, there's a thing called the, the Island Trial Challenge or whatever. So that there's four different islands in the game with a couple little like side islands that don't count as full ones. And instead of it being eight badges you go out and get and then go to the Elite Four and all that. In this game, each island has a what's called a Kahuna. So they're like kind of the leader of the, the island. The, the big, this all be do a Big Kahuna or they all is, they're all the Big Kahuna. They're all, they're all each the, the Big Kahuna of the island. And from them, they have a bunch of other people on their, their kind of squad. They're like Island Squad. And you go to, to each of the, the, the squad members and each one of them represents a",
      "start": 958.04
    },
    {
      "text": "the island and from them they have a bunch of other people on their their kind of squad they're like Island Squad and you go to to each of the the the squad members and each one of them represents a type so with gym members there's always been like they have their type and their gym is this is the Rock Gym or whatever for this it's like in the island it'll be the Fire Trial or the Water Trial or the Ice Trial or whatever and instead of just being a typical thing where you go and battle and whatever it's always different so in one you're like collecting ingredients to help make a soup or some shit in another one you're like doing this like rhythm game style thing for the the Fire Challenge or whatever and it's all different stuff that end in a fight um but once you get beat the the the fight instead of getting a badge you get a Z-Crystal and the Z-Crystals allow you to use the the new Z-Moves that they have which are essentially Final Smashes so in Smash Brothers there's the you get",
      "start": 1000.88
    },
    {
      "text": "instead of getting a badge you get a Z-Crystal and the Z-Crystals allow you to use the the new Z-Moves that they have which are essentially Final Smashes so in Smash Brothers there's the you get the Smash Ball and you can unleash a super move in this it when you use the Z-Move you can use it once per battle and once you get it from the the the trial challenges you can use all the Fire-type Z-Powers or all the Normal-type Z-Powers and you kind of go that way and it it's another new addition where it's like totally unnecessary makes the game kind of easy because whenever you you're having a a troublesome battle you can always pull out your your Z-Move and it does a lot of damage um um but it it was fun to use and it kind of mixes like Power Ranger elements uh into Pokémon in a way that I really enjoy I'm sure you do I'm sure you do there's a lot of weird shit you know hand motions and shit is Pidgey doing no it's you doing it that'd be awesome if yeah no no Pidgey Pidgey's a bird of",
      "start": 1040.32
    },
    {
      "text": "really enjoy I'm sure you do I'm sure you do there's a lot of weird shit you know hand motions and shit is Pidgey doing no it's you doing it that'd be awesome if yeah no no Pidgey Pidgey's a bird of course looks like a little pigeon yeah Pidgey ain't doing that um but I liked it because again familiar but different it's the same thing you're still going and fighting people of different types and getting something from them but the fact that it's not gyms and the fact that you are getting something that's directly affecting your gameplay uh felt fun and different and added to the world and I think that's the the biggest compliment I can give the game is that I haven't been as enamored with the the world that they built ever um nostalgia aside like this game going into it I was like I don't really care for the Hawaii kind of theme that it's going with but it's like it really did feel like like every piece of dialogue whatever lend lend itself to building uh an an atmosphere to this that",
      "start": 1083.76
    },
    {
      "text": "really care for the Hawaii kind of theme that it's going with but it's like it really did feel like like every piece of dialogue whatever lend lend itself to building uh an an atmosphere to this that wasn't the typical like we all love Pokémon and we all like there's trainers and they they fight and all this stuff but it was more like here's how these Pokémon are like live together and you know do different things within the the Alolan like landscape like because we live here we do things different like it's a vacation spawn like even your main character is vacationing from Kanto which is uh the place from Red and Blue so it's like it every single decision they made is very much geared towards hey like we get that we've done the same thing a million times we're going to try to make it different enough to keep it enjoyable and they did the entire way through the story was predictable but different so that's good the there is a Team Rocket-esque thing but their Team Skull and it's a",
      "start": 1129.96
    },
    {
      "text": "enough to keep it enjoyable and they did the entire way through the story was predictable but different so that's good the there is a Team Rocket-esque thing but their Team Skull and it's a total parody of itself like they are never seen as a threat like they're just there and every time they come up like you'll two characters will be having a conversation they come to like steal shit and the two characters like literally don't even pay attention to them because like they're just that much of a joke and I liked that because it kind of just gives people a bit more the credit that they deserve to be playing these games um that they get it they know having said that it doesn't go quite far enough to like totally win me over and like this is an adult Pokémon game cuz it's it is still a kids game so that is great for the kids you know but it's not big beautiful kids MH here's what I want to know missed opportunities if these aren't touched on that you Nintendo usually good with their",
      "start": 1176.68
    },
    {
      "text": "kids game so that is great for the kids you know but it's not big beautiful kids MH here's what I want to know missed opportunities if these aren't touched on that you Nintendo usually good with their you know localization putting in here and have some Kinda Funny thing in there right are there any references to a cursed Tiki Idol from The Brady Bunch of course I mean there is cursed Tiki Idols yes perfect thank you and then number two is there any reference in any way I don't know how they would do this but to Dwayne \"The Rock\" Johnson the most famous Hawaiian man ever Johnny Tsunami is the most famous Hawaiian man pretty sure Barack Obama is actually the most famous Hawaiian man ever uh Dwayne Johnson was just voted Sexiest Man Alive and is a multiple WWE Champion Barack Obama's matter for eight years and ain't going to matter much longer first black president and elected into two landslide victories and but The Rock People's Champ the People's Champion remember when he was the Corporate",
      "start": 1217.08
    },
    {
      "text": "eight years and ain't going to matter much longer first black president and elected into two landslide victories and but The Rock People's Champ the People's Champion remember when he was the Corporate Champion too oh man did he stab us in the back but then he came back around eventually remember that Hulk Hogan match he had WrestleMania X7 I believe that was a shit maybe it was 0 actually X9 was it X9 okay 19 that was a hell of a match the only downside of course to this match Colin is the fact that it was Hollywood Hulk Hogan and then came back in the red and yellow later on the handshake though yeah oh yeah great match then he got invited to the the family barbecue at the end of five exactly yeah he's in Fast and Furious too if you didn't know that too he's got a new animated film coming out too that's got some kind of Samoan vibe to thank you you're uh anyways the game's great uh the another issue I have with it is that it is unfortunately trapped on the 3DS and it I haven't",
      "start": 1260.08
    },
    {
      "text": "coming out too that's got some kind of Samoan vibe to thank you you're uh anyways the game's great uh the another issue I have with it is that it is unfortunately trapped on the 3DS and it I haven't had too many issues with 3DS games not being able to to keep up with stuff sure this game man so they got rid of uh triple battles they had in X and Y and they also got rid of like the horde things where a bunch of random wild Pokémon would fight you at once which I liked because you can get a lot of experience from that quickly this game anytime there's more than two Pokémon on screen holy hell I have not seen slowdown like this just it's so chuggy and it's just so shitty and it's just that I know I know they're they're planning some shit with the Switch uh but there so there's a a Battle Royale mode is what it's called where there is four trainers each throwing out a Pokémon and all four of them fight together and it's kind of like more of a mini game than an actual core piece of the game",
      "start": 1298.28
    },
    {
      "text": "mode is what it's called where there is four trainers each throwing out a Pokémon and all four of them fight together and it's kind of like more of a mini game than an actual core piece of the game and it's cool and it's a fun idea but it's unplayable because of how uh chuggy it is and this game made the decision to have the trainers on screen at all time so before we would just see the two Pokémon now it's always the trainers with their Pokémon so there's always four characters even in a one-on-one match which I guess aesthetically looks cool but like man it causes a lot of slow yeah and the good news is the chugging doesn't affect the gameplay uh because your your screen text and stuff still coming up at the same rate it's just kind of annoying to see like camera moves and stuff and like them just like moving super slow doing moves it just looks kind of shitty yeah um and also being on the 3DS like the the art style of the game is really good and Pokémon's always had a real nice",
      "start": 1345.96
    },
    {
      "text": "like them just like moving super slow doing moves it just looks kind of shitty yeah um and also being on the 3DS like the the art style of the game is really good and Pokémon's always had a real nice aesthetic and seeing in 3D it's really impressive and the the areas are very well thought out but man it just looks so smudged everything looks so smudged on the on the 3DS and it's just like looking at it I'm like man this is going to look great in HD when it eventually comes to the Switch we'd hope um and but that's another thing is like I don't know if this is quite Switch caliber uh then this to me is a great final hurrah for the 3DS yeah uh I had a great time with it I definitely recommend it I especially recommend it to people that think that they don't need a Pokémon right now I think you will be surprised I think it's you're going to have a a good time with it um the Elite Four is handled in a very clever way I like what they did with that trying to look at my notes here",
      "start": 1388.0
    },
    {
      "text": "you will be surprised I think it's you're going to have a a good time with it um the Elite Four is handled in a very clever way I like what they did with that trying to look at my notes here um you'll catch more than you expected to catch other big issues with uh the game is that the your main character is always smiling like even when bad things are happening they didn't like think about it all the other characters are reacting or whatever but like some horrible shit's going on he's just fucking smiling on my he's the punches man and it's weird though because it's like there's so much little things that were thought of that that it's like how did you miss that cuz on multiple I was like this is really out of place and it takes me out of it um then the Z-Moves are cool and again going back to the little things that they changed that I thought were good the the HMs being gone is freaking fantastic TMs being able to be used by all Pokémon was introduced a couple gens ago I'm",
      "start": 1430.8
    },
    {
      "text": "going back to the little things that they changed that I thought were good the the HMs being gone is freaking fantastic TMs being able to be used by all Pokémon was introduced a couple gens ago I'm happy they kept that and the there's a new thing where now after you face the Pokémon at least once uh next time you face them the that species on your move list it'll tell you what's effective and not effective which is like it's a little too easy cuz that's the type of stuff you should know but uh when when you're dealing with the new Alola Forms of the classic ones it was kind of nice to be reminded or like to know for the first time oh okay that's what they it sounds like all the changes they made or to get you to the fun faster and get you you know what I mean like that information's at your fingertips I assume without it right you have to jump into menus and go dig for it which would be annoying as hell yeah and and Pokémon has always kind of had an issue where they'll add cool",
      "start": 1476.28
    },
    {
      "text": "at your fingertips I assume without it right you have to jump into menus and go dig for it which would be annoying as hell yeah and and Pokémon has always kind of had an issue where they'll add cool features and then take them out the next gen and they'll be some things that never came back um so I'm interested to see next time what they keep and what they get rid of but it's this is the most refined Pokémon experience ever um and I don't think that that's always the case I don't think that each new gen always um is but this this does feel very much like the Gold and Silver did to Red and Blue If X and Y was the Red and Blue like it's definitely the the much better version it also reminded me of the anime uh in a way that the games never really did even Yellow Version tried to or whatever but this one because it's on the island remind me the Orange Islands stuff that happened um a long time ago in the in the show and uh the other thing that I I I want to give a shout out to that was",
      "start": 1516.28
    },
    {
      "text": "but this one because it's on the island remind me the Orange Islands stuff that happened um a long time ago in the in the show and uh the other thing that I I I want to give a shout out to that was really cool in the beginning and then just got extremely annoying at the end is instead of Horde Mode where like those hordes of the wild ones fighting you at once there's a new thing where they where wild Pokémon can call in backup and it's hilarious giant because you you'll be fighting one and then like they just call their boys to come fuck jump you essentially and uh it you know it was kind of neat in the beginning but it gets to a point where there's certain parts in the game where you're fighting like a like a Caterpie like something that doesn't fuck matter and you go to kill it he calls in reinforcements and another Caterpie comes and instead of it being a bunch at once it's one at a time so you can kill one but then the other one can call in back up you can get stuck in loops",
      "start": 1555.48
    },
    {
      "text": "calls in reinforcements and another Caterpie comes and instead of it being a bunch at once it's one at a time so you can kill one but then the other one can call in back up you can get stuck in loops that last like an hour of you just fighting these goddamn Caterpies and there's certain times where it's like if you try to run you can't like it's like oh you can't run for whatever reason they surrounded you Caterpies are inside of you Nintendo didn't think it through like that that was the thing where again a cool function and feature but then they just really really poorly managed it especially because you can't throw a Poké Ball at one if there's two out there so you need to kill one to be able to to get the other and it gets frustrating when you're trying to catch one they keep calling backup so you have to keep killing this shit um weird things that I I hope they aren't out next time but uh I love love the game overall love the difference and the little change ups from the gym",
      "start": 1595.68
    },
    {
      "text": "backup so you have to keep killing this shit um weird things that I I hope they aren't out next time but uh I love love the game overall love the difference and the little change ups from the gym leaders and stuff there's like boss Pokémon now like there sometimes you have to fight the Alolan Forms of at the end of the the trial challenges and it's that's unique because it felt more like a this game reminded me of Final Fantasy more than any Pokémon game ever did so I think that's cool that they're changing things up to make it a bit more RPG-esque but there's a long way till it gets quite there um hopefully the Switch will bring it to us don't say I don't like Switch Switch you can say it while you do it no no no no can we just keep saying X no that's top for topic one",
      "start": 1634.36
    }
  ]
}
