{
    "id": 2172,
    "video_id": "Jr46qEMEolc",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Jamie Kennedy"
    ],
    "title": "Unboxing Fantastic Beasts LEGO Dimensions Story Pack - Kinda Funny Plays",
    "description": "Fantastic Beasts doesn't come out until next week, but Greg and his mom have the latest LEGO Dimensions Story Pack right now! NO SPOILERS!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFULL DISCLOSURE\nWB SENT US THESE PACKS TO UNBOX. CHILL, FTC.\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1479144067,
    "duration": 3138,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to a Kinda Funny Reacts Unboxing here on youtube.com/KindaFunnyGames. I'm one of your hosts, Greg Miller, and this is my mom, Jamie Kennedy. Hi Greg. Hey Mom, how are you? Good. And you? Good. You excited? Extremely. I don't know what we're doing here. I know you love LEGO Dimensions. Oh yes, I always enjoyed picking up those little pieces. Now that's the thing, Mom, what if I told you they took the LEGOs I grew up playing with, yes, and combined them into a video game, and then they found out that they could take the LEGOs back out of the video game but keep the video game going? What would you say? How exactly? The power of technology in the PlayStation 4 and Xbox One and I think Wii U, maybe not PC, I don't think, right? Kev, give me a reality check over there on PC. All right, thanks. Thank you, buddy. Um, yeah, they do it with these little things you put on. Are you familiar with the toys-to-life video game genre? No. Okay, well, have you heard of Skylanders? No. Have you heard of",
            "start": 0.12
        },
        {
            "text": "thanks. Thank you, buddy. Um, yeah, they do it with these little things you put on. Are you familiar with the toys-to-life video game genre? No. Okay, well, have you heard of Skylanders? No. Have you heard of Disney Infinity? Rest in peace. No. Okay, well, here we go. This is LEGO Dimensions. As we go, I'll explain. We'll start. I understand LEGO. This, well then you're halfway there. All right, so this is the portal. This would plug into my console. Then you, we, we build things, we put them on there, they go into the world and we go. Now you at home, yeah, you at home might be saying, why aren't isn't this a Let's Play? Well, our friends at Warner Bros. Interactive Entertainment sent us this to unbox, to do things with. This is part of Wave Seven. And I remember FTC, I said it, so there you go. Don't worry. I hate this FTC rule that we got to tell you they sent it to us. Oh, what? I mean, like, what? It's not like it fell off the back of a truck, am I right, Kevin? No, yeah, that's right. Uh, out on the 18th, we have them early, but since",
            "start": 38.56
        },
        {
            "text": "that we got to tell you they sent it to us. Oh, what? I mean, like, what? It's not like it fell off the back of a truck, am I right, Kevin? No, yeah, that's right. Uh, out on the 18th, we have them early, but since we have the Fantastic Beasts Story Pack here, which goes through the entire movie that isn't out yet, you don't want to spoil that. You can't play the game and spoil the movie and do all these different things. Of course not. All right, so I want to start with what's near and dear to my heart, Mom. Gremlins. You remember Gremlins? Oh God, yes. This is Giz. This is Gizmo. You remember Gizmo? Yes, I remember Gizmo. I remember Gizmo, your cat. Exactly. I named my cat Gizmo after Gizmo the Mogwai in here. So I'm going to show you a little bit of what happens here in LEGO Dimensions. All right, it nicely you to rip it, Mom. Don't be like one of the commenters. All right, the commenters, the commenters, not the commoners. I'm not up here in my Ivory Tower with my Gremlins toys. No, no, no. Yeah, the com, the commenters always get mad",
            "start": 79.36
        },
        {
            "text": "be like one of the commenters. All right, the commenters, the commenters, not the commoners. I'm not up here in my Ivory Tower with my Gremlins toys. No, no, no. Yeah, the com, the commenters always get mad at how I open up boxes. Oh, all right, so you see this is where it all starts. So do we have to sort it all out? What did you just say to me? It's not on PC. It's not on PC. Thank you. Is it's on Wii U though, right? Or is it just, is it just I only play on PlayStation 4, of course. Oh, so we don't put his head together? That's good. No, yeah. Oh, he's easy. Well, see, that's where they want you to think it's easy. And and for the most part, it would be, right? So you go through it should be, well, yeah, I mean, you know, well, this is what's his name? Don't, don't what? Oh, never mind. Do we have Sky Cam? Yeah. Oh, perfect. Sky Cam will be helpful here as well. There you go. So see, no, you see, Mom, what you do is right, we want to build the Gizmo, right? So we go there. Sky Cam again, Mom, you put Gizmo's head on there. All right, okay. And then his",
            "start": 120.16
        },
        {
            "text": "be helpful here as well. There you go. So see, no, you see, Mom, what you do is right, we want to build the Gizmo, right? So we go there. Sky Cam again, Mom, you put Gizmo's head on there. All right, okay. And then his two legs, his two supposed to be done with it. Well, yeah, but you, I mean, don't get ahead of yourself here. You got his legs. No, I thought you said, I thought you would find him. No, I think there's, is that, that's it? Yeah, that's right. That's right. He got white legs. He want of them white legs. Put him in like that. There you go. Right. And there he's done. But exactly. But what you do, Mom, is you take his little base. Oh, and you put him there. That's real tough to find and do. It's not. Don't get, don't be all sarcastic here as we play one of the best games of both 2015. Going to be difficult to build them is I, no, I'm not. I said it starts easy here. Now we're giving him this little cookie. Well, okay, did he eat a lot of cookies, Kev? I don't remember Gizmo being a cookie guy. I remember him eating a cookie at",
            "start": 168.68
        },
        {
            "text": "I no, I'm not. I said it starts easy here. Now we're giving him this little cookie. Well, okay, did he eat a lot of cookies, Kev? I don't remember Gizmo being a cookie guy. I remember him eating a cookie at one point. He did. I just remember he couldn't eat after midnight. Yeah, that's that's the whole problem with him. And don't get him wet. Exactly. Wasn't there a scene where he's eating a cookie like this and his eyes go like all wild? I don't know. No, wasn't that, that's in Gremlins? I think with the the knockoff Gizmo. Remember the Dopey Gizmo they had? That guy. That's who we're talking about. So anyways, you build the Mom and you take him and you put him on your portal and he appears in the video game and you get to then play. We're not playing the game. You don't have to look at the TV. I apologize. But that's how it would work if we could play these. But right now we're just building 'cause the game not out yet. And what's his name? That's Spike. Remember Spike? Yeah, now I do. Yeah, sure. Does he have to face",
            "start": 207.48
        },
        {
            "text": "that's how it would work if we could play these. But right now we're just building 'cause the game not out yet. And what's his name? That's Spike. Remember Spike? Yeah, now I do. Yeah, sure. Does he have to face? He's got a faces. You got, yeah, now that's the whole thing. Remember, I'm I I I stick very careful to the details here, Mother. I'm very aware. We cannot like, I I will, as anyone will tell you, I'm a stickler for continuity. I want it to look just like it looks on the the box. Mom, have I always been this way? Always. What's the what's the worst story you can think of about me doing this? The Ghostbusters. What? What was it called? Not the Firehouse. Yes, I put one sticker in the wrong place. How long did you stay up putting together the Ghostbusters Firehouse? Up 3:00 in the morning. Up till 3:00 in the morning putting it together for Christmas. I came out, saw it there. You unwrapped it. You were excited. And you went, oh, the sticker's in the wrong place. And I had to go get the box and prove to you. No, you went, got the box",
            "start": 243.52
        },
        {
            "text": "together for Christmas. I came out, saw it there. You unwrapped it. You were excited. And you went, oh, the sticker's in the wrong place. And I had to go get the box and prove to you. No, you went, got the box to prove to me that I was wrong and the sticker belonged here. And then I had to go get the instructions and bring it to you to approved you that's where they told me to put it. I understand, but I just think, well, now, sure. Well, no, I'm not even going that far. I'm just saying for as a mother, yes, and as a Ghostbusters fan, maybe you should have had a bit more eye for detail on exactly what the Firehouse needed from you. You know what I mean? Like, I don't wrong. I understand the instructions said it, but if the instruction, I mean, like if the instructions were like, put Spike's head on Gizmo's body, I'd be like, hold up, let's look, let's let's consult a few things. Okay, one sticker is big difference than the wrong head on the body. I agree with you. A solid point. Kevin, who side in? Yeah, and she's going to leave",
            "start": 285.84
        },
        {
            "text": "like, hold up, let's look, let's let's consult a few things. Okay, one sticker is big difference than the wrong head on the body. I agree with you. A solid point. Kevin, who side in? Yeah, and she's going to leave eventually. I'm of hers. All right, great. Thank you very much. Thank you, Kevin. So you do this, you put them on there, right? When you put them in the game, Mom, what happens is they pop up and then like, oh, you have to make their vehicle or whatever else. They come with these are the vehicles spread throughout here right now. See, this is the clever part. This is my favorite part about LEGO Dimensions and one of the reasons I like it 'cause you are aware I live in a very small apartment. Yes, I don't like having a lot of clutter. I have plenty of clutter, but not a lot. Had way more at home. Correct. Oh, yeah, growing up. All right, thank you very much. 'Cause there space, you put stuff in space. So I always saw the cool LEGOs coming out. Yeah, wouldn't get into them. But then Dimensions came along and I was like, all right, I",
            "start": 327.48
        },
        {
            "text": "up. All right, thank you very much. 'Cause there space, you put stuff in space. So I always saw the cool LEGOs coming out. Yeah, wouldn't get into them. But then Dimensions came along and I was like, all right, I like the other LEGO games. I'm going to try LEGO Dimensions. When you put them down, you want to build the car, you want to build the Polaroid camera. Yeah, it pops up on screen with this. You got to then play the, you're playing the game, you're turning the pages in the game, but you're doing it down here in real life. Brilliant idea. Okay, you would understand. No, I don't. I guess I'd have to see the game to understand. Well, you know, it's not like I've put up a million Let's Plays here on youtube.com/KindaFunnyGames. Did you put that one up already? Yeah. Oh, well, I guess, uh, Kevin, do you remember the one we played together where we were both dressed as Ghostbusters? You don't even like Kevin now, huh? I love Kevin. All right, uh, I want to build the Fantastic. We're not going to build the car right now, right?",
            "start": 362.68
        },
        {
            "text": "played together where we were both dressed as Ghostbusters. You don't even like Kevin now, huh? I love Kevin. All right, uh, I want to build the Fantastic. We're not going to build the car right now, right? Yes, I have classified documents that show me how to build a car without the game 'cause they understood, they understood the dilemma I was in. Kevin, our friends at WB, Kevin, go back to this shot. Do you have the Ghostbusters guys? Yeah, friends of WB, who again, FTC sent us this to unbox it. We didn't steal it. They sent it to us for an unboxing thing that we're doing. No money. Yeah, exactly. Uh, before I get to Fantastic Beasts though, I'm going to put away all these pieces. And what I want to do is settle, is it that hot in here? Mhm. I'm sorry. I want to settle a long running internet question of where I store my guys because again, I don't want the clutter. What I do is I buy toolboxes like this. Now, Amazon, thank you, Kevin, for turning that that the fan on my mom. That helped a lot. Now, this toolbox meant for tools,",
            "start": 400.48
        },
        {
            "text": "guys because again, I don't want the clutter. What I do is I buy toolboxes like this. Now, Amazon, thank you, Kevin, for turning that that the fan on my mom. That helped a lot. Now, this toolbox meant for tools, but it fits all of my toys quite well. And I have, this is now how many you think I got at home of these, Mom? Oh, I don't even want. This is my fourth, fourth, fourth adult toolbox that I am filling with LEGO Dimensions figures. Oh, you want how many LEGO Dimensions I have? That's where I thought you were going. Yeah, no, this is only Wave Seven. We got a lot more to go. Don't worry. They got E.T. coming, Mom. Oh, no, you know, they got the E.T. They got The Goonies coming. They got the Sloth. It's what everybody's waiting for. Who's the Sloth? Sloth from Goonies. Hey, you guys. He's got a Superman shirt. Goonies, Goonies. You know what I'm talking about here, woman. I know what you're talking about. I don't remember it, but okay. Data. I can't even do a Data impression 'cause it's 2016 and that movie is kind of racist. Anyways, I got",
            "start": 444.24
        },
        {
            "text": "what I'm talking about here, woman. I know what you're talking about. I don't remember it, but okay. Data. I can't even do a Data impression 'cause it's 2016 and that movie is kind of racist. Anyways, I got all these. You put them in there. You get them off Amazon. My favorite story about the toolbox, there you go, Mom. We're throw throwing up some Sloth images here. Oh, thank you. Remember now? Okay, now I remember them. Yeah. All right, cool. My favorite story about this toolbox is that I started buying them off Amazon and filling them with toys that they're not meant for. And then I went home, uh, to Chicago where you live. Went over to visit Dad. Yes, I went into his garage. He has these same toolboxes filled with tools and screws. Yeah, and very adult, manly things. And I was like, I have those. He's like, oh, he was like kind of proud. Use those for the horses too. What do you put in there for horses? Oh, you can put bits in there. You can put, uh, part parts of the bridle and stuff in there. Yeah, I still feel, I still feel",
            "start": 491.24
        },
        {
            "text": "kind of proud. Use those for the horses too. What do you put in there for horses? Oh, you can put bits in there. You can put, uh, part parts of the bridle and stuff in there. Yeah, I still feel, I still feel like that's more of the real use scenario than what I'm doing, you know? Oh, okay. I don't want to lose anything here. Yeah, I don't blow it. So when you get these guys built, like, will they go in the little boxes too? Yeah. Oh, yeah. Oh, okay. Now, did these guys already come built or did you have to build them and put them over there? Um, those guys came, I mean, for the as broke down as these guys. So like, okay, I this, no, please do, Mom. Please. You're Kinda Funny. You do whatever you want. So this idea is simple here. So the portal, Kevin, can I get a portal shot him? I know we're moving it around and stuff. You get me that QVC. You always wanted to be on QVC. Look at you now. Oh, yeah, lucky me. So the portal comes with LEGO Dimensions, right? You build it as part of the game. You put these things on as you go, part of the",
            "start": 534.48
        },
        {
            "text": "that QVC. You always wanted to be on QVC. Look at you now. Oh, yeah, lucky me. So the portal comes with LEGO Dimensions, right? You build it as part of the game. You put these things on as you go, part of the game. Then if you're a super dork like me, you want to customize your portal. And so what I did is I bought the Batman v Superman: Fight for Gotham pack. Threw away a majority of it, but took the Bat-Signal, put Batman and Superman on there. How many super, how many Superman guys have you gone through in my life? Isn't the, is he can't talk? Is he? Did you build those keychains that you have? Oh, no, the keychains, I, you become preassembled. Yeah, yeah, I have a lot of those. I have backups for those so that when one breaks, okay, I'll be ready to go. You know what? Me, that's what I meant to bring you was your Ghostbusters watch. Oh, the Peter Venkman purple one. Oh, wow. Still on the wrapper. Wow. You want to talk about, uh, as everybody knows now, Cool Greg, Greg Gettys, Tim's brother, who showed up on our actual live stream.",
            "start": 578.8
        },
        {
            "text": "watch. Oh, the Peter Venkman purple one. Oh, wow. Still on the wrapper. Wow. You want to talk about, uh, as everybody knows now, Cool Greg, Greg Gettys, Tim's brother, who showed up on our actual live stream. He likes, he has a Simpsons watch. He has that is old as hell. He won't even understand what this real Ghostbusters watch is. I remember again, we had duplicates of that. Yeah, I remember the first one got wet at a drinking fountain and I cried. Yeah, cried my eyes out at school 'cause if Peter Venkman wasn't going to work, you want to watch since it's true, that was the end of it. I was done with that. Um, so anyways, these guys I bought for my portal based on Batman v Superman. Kevin, give me the portal shot. Batman v Superman there. Then this is all Killian. I'm sure you remember him. Oh, yeah, he's the Marvel villain I play in LEGO Marvel, LEGO Marvel Avengers, available now. I was going to say they didn't pay me to say that. FTC. Anyways, and then this is, I believe this, yeah, this is a Clark Kent that Chris Roper got me from China. It",
            "start": 622.64
        },
        {
            "text": "LEGO Marvel Avengers available now. I was going to say they didn't pay me to say that. FTC. Anyways, and then this is, I believe this, yeah, this is a Clark Kent that Chris Roper got me from China. It was like one of those knockoff ones or whatever, but he looks really good. So I use, put him right there. Very cool. All right, so we're going to jump into Fantastic Beasts. If you're one of the people who came here 'cause I'm promoting this as a Fantastic Beasts thing, and you're not really a Kinda Funny fan, you just want to know about Fantastic Beasts. Sorry, man. Picked the wrong channel to try to get real information from. All right, so see now what this one does, Mom, this is what they've introduced here in the new wave, Dad, with because this is Year Two now of LEGO Dimensions, right? Okay, so you built this. That was your portal for the base game. Okay, now there's all these new things coming out. They want you to keep playing. We're playing the Level Pack for Fantastic Beasts here, which is the entire movie. It runs",
            "start": 662.72
        },
        {
            "text": "your portal for the base game. Okay, now there's all these new things coming out. They want you to keep playing. We're playing the Level Pack for Fantastic Beasts here, which is the entire movie. It runs you through it. So what they have you do is build a brand new portal 'cause what you can do then is like, boop, you want to pop that guy off, you build this one up, boop, you'll put it on there. Well, the, you'll put on there correctly. And then, yeah, you'd have it ready to go. Now lay it on me. This when your portal things up here. Yeah. Oh, if you put them there, does that when they shoot through the portal into the game, right? You can put them out here. Any all three of these are active portals. So you put them in there and then the game does this interesting cool thing where it's like, it'll be playing and, uh, you'll need to move people. This will glow blue, this glow red, this will go green. And it'll be like a puzzle up there where you have to go, oh, he has to go to green and he has to go to blue. You see here, Kevin,",
            "start": 704.72
        },
        {
            "text": "need to move people. This will glow blue, this glow red, this will go green. And it'll be like a puzzle up there where you have to go, oh, he has to go to green and he has to go to blue. You see here, Kevin, showing you when we were, uh, dressed as Ghostbusters. Oh, cool. This of course, youtube.com/KindaFunnyGames. You can go see it yourself. Uh, but so I feel we should build. What did I do on that Ghostbusters uniform? On the Ghostbusters I'm wearing right there. You sewed on the Miller tag and the No Ghost tag. Oh, okay. You see the new Proton Pack I got? Yes, it was pretty, pretty, if we can say. All right, so we're so are we building the new portal? Yeah, we're going to build a new portal along with this guy from Fantastic Beasts. You didn't open the box, right? Uh, I I had a smile on my face. Yeah, well, you're supposed to go, that's what you're supposed to do. That's how you do it. Feel free to give it. We're supposed to do that too. All this stuff out. Now, Kevin, how are you up on Fantastic Beasts? Uh, yeah, I think",
            "start": 744.4
        },
        {
            "text": "to go, that's what you're supposed to do. That's how you do it. Feel free to give it. We're supposed to do that too. All this stuff out. Now, Kevin, how are you up on Fantastic Beasts? Uh, yeah, I think so. What's the dude's name? Hold on. I know it. Damn it. I mean, and I don't feel like bad about this 'cause you know, I haven't seen the movie yet. I'm going to see the movie. We got to open tickets. There'll be a react on KindaFunny.com. When is that? Oh, I think it is the, it's the 18th. I'm sorry. I got to think. I think it's the 18th 'cause that's the same day this comes out. Okay. And they don't want you ruin in the movie beforehand, right? Yeah, man, it's going to settle in for the long haul. You know, I'm gu, first I got to build the man. You already see, you already. Scamander is his last name. Scamander. So we're getting closer. Can you give me a first name for Mr. Scamander? Now I'm going to look it up. All right, thank you very much, Kevin. Oh, wait, that was from memory. Yeah. Oh, I'm sorry. I take it back. I thought you were just",
            "start": 789.96
        },
        {
            "text": "can you give me a first name for Mr. Scamander? Now I'm going to look it up. All right, thank you very much, Kevin. Oh, wait, that was from memory. Yeah. Oh, I'm sorry. I take it back. I thought you were just like giving me really bad information all of a sudden. Newt Scamander. Newt Scamander, ladies and gents. Man, I'm stoked for the movie. Now he and now close. Yeah, okay, we're looking for his legs. Yeah, that's what I was looking for there. Lot of stuff. Look like there's a lot of brown things on the, stuff things on. They're right there, right underneath your hand. Ah, good job. Good eye, Kev. Thanks, Sky Cam. Thanks, Sky Cam. Remember, FTC, we didn't steal these. Put it on there, but we didn't pay for them either. Why? You know, the point I think is just so like they, we couldn't lie and then act like we bought them. But I would have bought these. This is the opposite of a PlayStation 4 Pro. Oh, ah, uh, now don't get ahead of yourself, woman. I'm looking. We need to find the wand. There it is. I like that they give us a bunch of backup",
            "start": 842.4
        },
        {
            "text": "bought these. This is the opposite of a PlayStation 4 Pro. Oh, ah, uh, now don't get ahead of yourself, woman. I'm looking. We need to find the wand. There it is. I like that they give us a bunch of backup wands. I have a bunch of backup wands at home. Can you show Sky Cam the wand? Expecto Patronum. Is this a one? Yeah, it's one of the backups. Oh, 15 points for and all right, there's Newt assembled. Now we move on to this thing. Okay, I I pop Newt off by accident. Determine the page. All right, we put Newt on there. All right, Newt's on there. Calm down. I didn't say anything. I'm not mad at you. I'm saying them who then we'd have to build that guy. I forgot his name. Niffler, is that right, Kev? Niffler. We would build Niffler, which is his vehicle. He carries own. We're not going to build Niffler though. You'll, hey, Kev, come on, man. Kevin, you want us to build Niffler? I don't think it'll take that long. No, it, that's what they want you to think. I'm more worried about how long this bad boy is going to take. Yeah, that's going to take a while.",
            "start": 891.6
        },
        {
            "text": "you want us to build Niffler? I don't think it'll take that long. No, it, that's what they want you to think. I'm more worried about how long this bad boy is going to take. Yeah, that's going to take a while. We're exactly. So we got to get cracking here. All right, so bring over here. We need these guys. I'm this guy. They go over here and over there. Don't get ahead of yourself here. See, you did, you already did 'cause look, they got to hang off. We need the gray things too. You know what, Mom, cut corners. That's what you do, Johnny, cut corners. Now it's stuck. So God damn it, Mom. Didn't come with it. Didn't come with a pry tool. You're right, it didn't come with a pry tool. They were doing that with the first. You got, come on, you got, you you got crazy lady nails. Let me have a chance. Well, you know what I mean? Newt, get out of the way. It's 'cause I have a crazy lady. That's where I get it. All right, so then we're going to do this. We're going to do this. Need another. No, you need the gray ones. Look, look, look. I got it. I'm on top.",
            "start": 953.32
        },
        {
            "text": "of the way. It's 'cause I have a crazy lady. That's where I get it. All right, so then we're going to do this. We're going to do this. Need another. No, you need the gray ones. Look, look, look. I got it. I'm on top. But don't worry about it. All right, you just lay. All you have to do is tell stories about me. Tell tell some tell the kids. I have lots of good stories, but I have a bad memory, so I don't remember them all. Um, okay, I hope all the parts are here 'cause you'll go in meltdown if they aren't. That's one that that is always one of my concerns when I get a LEGO pack. But I have on LEGO Dimensions, I have not been screwed yet. I have not been given a pack that doesn't have. Oh, that's a kiss of death that just said that. But I mean, they're good about giving you giving you extras. And I feel like I got a lot of, I didn't bring everything. I didn't, you know, Kev, I'm sorry. I didn't bring everything today. I, you know, I know you've seen it all, Kev. You've been a big part of it. You are my most supportive LEGO fan as I",
            "start": 993.28
        },
        {
            "text": "like to call you. Do the other guys build LEGOs? They are all a bunch of cowards. Why? They afraid they can't get it right? Yeah, pretty much. Nick Scarpino just doesn't like fun. I think that's a big thing. Kevin, am I wrong about that? Nick doesn't like fun. Nick does not like fun. Everybody. Is that what his wife says? His, I mean, I don't think you actually his wife actually say that. I was going to say, right? 'Cause like she has to like convince him to go everywhere and do everything. All right, so take these crazy corners here. Got one of these done. Oh, I thought that was all one piece. No, that'd be too easy. Part fun things got to go in the middle. Yeah, we we need those red things. We need a little brown thingers. Another brown brown thingers. Not as important. That's for the thingy. See, Greg was never this calm.",
            "start": 1032.76
        },
        {
            "text": "part fun things got to go in the middle yeah we we need those red things we need a little brown thingies another brown brown thingies not as important that's for the thingy see Greg was never this calm as a child to put these together no sure I give your red thing it can't work it well we need another one just hold on to it never mind hold no no no it's right there Mom I can't do it forget it you can do it do it work on that part all right what part this little thing yeah wow oh this is your first Lego Dimensions let's build whatever the hell this is I don't think the FTC approved you and here you are yelling at me I'm not yelling yet don't hurt your mother's feelings how do I know if it's this thing or that thing oh that's a blank there you go this is there we go I got him I got him there one there's one good job now put them in there where right you put him right next to that guy I was looking at the brown ones I need a do you put the brown one in no you need a brown one all right you",
            "start": 1076.64
        },
        {
            "text": "there's one good job now put them in there where right you put him right next to that guy I was looking at the brown ones I need a do you put the brown one in no you need a brown one all right you know you know work on your part and then I can get my you were the one I can't find this so you I thought you were about to cry I needed to jump in and help you right away you're going to make me cry I noticed you're putting them in with your middle finger pointed at me that's huh I'm very subtle mhm like a brick house so did you like having me as a kid I loved having you as a kid if I knew I could have had another kid that would have been just like you you'd have a brother yeah but you worried about what them coming out like Kevin well yeah the second kids never come out right it's true they're always trouble all right you were a very easy child to raise yeah mhm you were um unlike now you were respectful you know yes I love you I love you very much I love you Greg, um but I here's the thing I",
            "start": 1130.16
        },
        {
            "text": "always trouble all right you were a very easy child to raise yeah mhm you were um unlike now you were respectful you know yes I love you I love you very much I love you Greg, um but I here's the thing I I think about cuz I got friends with kids now yeah I know you know that you've met these kids these Punk kids with their Paw Patrol um what how did you did you were did you ever just like what am I going to do with this thing oh God it's like hours and hours and hours when I brought you home from the hospital your dad went to get food he never came back and in the short time that he went to get food I completely got myself into a meltdown because I realized I was going to have you for 21 years yeah or 18 at least and what the hell do I do with you yeah yep cuz for me it just seems like you wake up you because like we wake you know Po wakes up and it's like all right Jack's got to eat he's got to do this we got to take this he wants to do this he wants to watch that and it's just like it's",
            "start": 1184.2
        },
        {
            "text": "up you because like we wake you know Po wakes up and it's like all right Jack's got to eat he's got to do this we got to take this he wants to do this he wants to watch that and it's just like it's all I'm visiting I need be all cool and get out of there but it's like to actually be there with this thing and be like oh my god what the hell are you going to do for you know what I mean like I got so many there's only so many hours in the day well see but Jack's to a nice point and that's the kind of the point of kids that I like I don't like when they're babies you know there's so many women oh it's a baby I love babies that me yeah because they can't tell you what they want MH it's like tell me what you want and then see now I'd have to turn the instructions that way so I could do it right okay like in if you say so so that goes there yeah yeah there's another one there but you uh like this you occupy yourself you occupied yourself as a kid too which was nice I didn't have to worry",
            "start": 1247.32
        },
        {
            "text": "okay like in if you say so so that goes there yeah yeah there's another one there but you uh like this you occupy yourself you occupied yourself as a kid too which was nice I didn't have to worry just like when you did homework all the parents are always oh they have this big assignment blah blah blah blah blah and I'm thinking I never heard about it Greg just did it with which I really appreciated I'm sure and the fact that you would come home and just get your stuff done and I wouldn't have to worry about it and I don't know if that got instilled in you in grammar school or if that got instilled prior to that that you knew you just came home and got your stuff done and you could do whatever you wanted to do yeah I got to play video games yeah what the heck is that that I think that's Niffler's foot it's Niffler's yeah hand hand it's going to be Niffler's hand there's the other one we get home we I actually I don't think the content's live I'll send you videos of me making",
            "start": 1286.8
        },
        {
            "text": "Niffler's foot it's Niffler's yeah hand hand it's going to be Niffler's hand there's the other one we get home we I actually I don't think the content's live I'll send you videos of me making Niffler for you okay you'll know what's happening but yeah you know as a kid you occupied yourself but I think that's because you were an only child but you're not and do you remember me telling you that I you knew you were spoiled we both did yeah but I told you you couldn't become spoiled rotten yeah that sounds right and the difference between spoiled and spoiled rotten was I don't remember that part you don't remember that part you're spoiled because you got most of what you wanted sure spoiled rotten when you demanded that you got what you wanted and the first time you ever did that I said you wouldn't be getting anything gotcha and I laugh for example let's go into lunch today yeah and you using your debit card do you remember the first time I used a debit or credit card tell tell the",
            "start": 1341.08
        },
        {
            "text": "you wouldn't be getting anything gotcha and I laugh for example let's go into lunch today yeah and you using your debit card do you remember the first time I used a debit or credit card tell tell the kids about it oh my God it was Christmas time we went Christmas shopping I think yeah we Toys R Us Toys R Us yeah so I don't know if it was Christmas or what I think it was just I think it was just I you want a toy or whatever I I you know and we went to Toys R Us to get it and for the first time in front of him I used a credit card and he burst in the tears convinced that we were broke and he didn't want me I don't need you I don't need it that bad and well that was always you're worried though with your dad's business sure because Dad your dad uh you know was seasonal you know Dad Greg Miller construction worker you've seen his uh uh operator yeah heavy equipment operator over on YouTube no I'm sorry Patreon.com Kinda Funny she has an exclusive episode he has an exclusive episode dad the",
            "start": 1385.88
        },
        {
            "text": "construction worker you've seen his uh uh operator yeah heavy equipment operator over on YouTube no I'm sorry Patreon.com Kinda Funny she has an exclusive episode he has an exclusive episode dad the crane operator in a union so he'd go on a job he'd finish the job and then he'd go home till the union called him and send him another job which is really hard to wrap your head around as a kid and like in Winter he was usually home in the winter time until the snow fell so he could plow snow and so a lot of times during that period of when it was too cold to dig the ground because the frost and prior to the snow Christmas usually came in that's that area MH so you were convinced that Dad wasn't working therefore we were we were going broke yeah we were on Pottery Barn we're on Pottery Barn going to Pottery Barn we're going to Pottery Barn it's really rough right now we can only afford Pottery Barn so you always freaked out when Dad wasn't working you were convinced we were you know I",
            "start": 1431.84
        },
        {
            "text": "going to Pottery Barn we're going to Pottery Barn it's really rough right now we can only afford Pottery Barn so you always freaked out when Dad wasn't working you were convinced we were you know I wasn't contributing to the family you know what I mean I didn't I didn't like eating up all the money but you never did I know you were a good kid you still are a good kid thank you I'll keep you around Kevin's not solely says what Kevin's not solely when when you said I'm a good kid oh he's the best now he says I'm the best but he's only saying that because cuz I here yeah close call someone just came and I was looking at a Christmas present for them oh Tim no it's not Tim I don't give Nick no Greg what Cool Greg's here yeah Cool Greg get in here yo I'm building the Fantastic Beasts Play Set son oh that's pretty sick look at him you come on in come on in don't be afraid this is my mom oh sorry Jamie on the show oh perfect okay crouch down brother right yeah yeah look at that guy man yeah you",
            "start": 1476.6
        },
        {
            "text": "oh that's pretty sick look at him you come on in come on in don't be afraid this is my mom oh sorry Jamie on the show oh perfect okay crouch down brother right yeah yeah look at that guy man yeah you Juiced yeah so you put this there and then they show up on the screen yeah he Po in the game yeah are you going to play it no it's not it's embargoed we can't play it I don't think the content's live yet they don't well this is we're building his the whatever the magic is cast thing you got you got Niffler guy, Niffler yeah the weird MACUSA these words mean anything you know what this is yet oh that I don't know that one okay MACUSA is the Magical Congress of the United States I'm looking forward to this movie me too okay just making sure we're on the same page the Lego Dimensions movie is no no no no the uh Fantastic Beasts movie it's a new Harry Potter flick oh you know Harry Potter yeah I've never seen any of them Jesus Christ oh I can get them no I don't want to watch them why don't you want to",
            "start": 1531.12
        },
        {
            "text": "the uh Fantastic Beasts movie it's a new Harry Potter flick oh you know Harry Potter yeah I've never seen any of them Jesus Christ oh I can get them no I don't want to watch them why don't you want to watch them because it's just not my genre how is it not your genre you don't even know anything about them they're like awesome Christmas movies the first three of them yeah it's amazing they're really long aren't they they're not that bad like 3 hours or something no that's Lord of the Rings yeah Lord of the Rings Lord of the Rings sucks that's nerd yeah Lord of the Rings is for nerds I agree with that 100% that's a dope shirt okay can I say this on the air you say whatever you want go Greg looks like a homeless person drinking out of his bag Cool Greg's drinking a 40 out of a bag for there mom's not approving the beer choice oh I don't care about the beer it just looks weird that you're drinking out of bag it's okay you're 21 we're all adults you can drink without the bag yeah you don't",
            "start": 1577.68
        },
        {
            "text": "not approving the beer choice oh I don't care about the beer it just looks weird that you're drinking out of bag it's okay you're 21 we're all adults you can drink without the bag yeah you don't apologize Cool Greg this is my cool mom you don't have to worry about that right oh two these up here okay I see what you're doing here Lego I think you should have Harry Potter a sheen all right all right God forbid I like something Kev you know what Mom say show is Big Bang Theory it's a good show no not a great show entertaining do you know what my horse's show name is Bazinga thank you Sheldon remember how hard it was to find DC Comics stuff back in the day how like quaint it was to find Superman things and like buy them for me yeah now it's everyone yeah I know and I always want to buy stuff and like forget it he got a long time ago's I probably unboxed it on a video long before you knew about it exactly you are my son you just take over well jump in and do something and I don't",
            "start": 1626.56
        },
        {
            "text": "stuff and like forget it he got a long time ago's I probably unboxed it on a video long before you knew about it exactly you are my son you just take over well jump in and do something and I don't build them slow Kevin you build real slow what I no I build with care I this is the part of the game I enjoy the most you're in here like you don't care about it you don't understand the craft of Legos you're a piece of garbage Kevin are you agree with me I don't know just agree with me Greg see I'm too old I can't tell what that piece is it's these guys I'm putting on top here there's here's the other one I need to get my cheaters to know what we're looking at there your cheaters yeah your glasses yeah my magnifiers oh okay you call them cheaters yeah I didn't know that I don't know if it's cheating it's just yeah trying to see yeah oh look he's got three hands I'm telling you man they give you extra stuff sometimes they're good about it Lego knows what's up well Lego knows that kids do this",
            "start": 1686.72
        },
        {
            "text": "it's just yeah trying to see yeah oh look he's got three hands I'm telling you man they give you extra stuff sometimes they're good about it Lego knows what's up well Lego knows that kids do this now what age do you have to be to play put this together and play with it so they don't choke on the small part 7 to 14 wow all of them yeah I think it yeah 7 14 but I I think it's more because the game's complicated too Legos are I think younger than that I'm not correct somebody let me know um cuz I remember I almost bought Po's kid who's three is getting close he's not there but he's close but I think it's the game but I think they're bigger pieces too well there's certain ones that are so it's not a choking hazard here we go this thing starting to take shape now yeah it is crowning glory is coming up look I can tell the big pieces I can see thank you very much is it go in the back or the front that one's back row back back row with one on each side it looks like oh crap did you screw it",
            "start": 1754.4
        },
        {
            "text": "coming up look I can tell the big pieces I can see thank you very much is it go in the back or the front that one's back row back back row with one on each side it looks like oh crap did you screw it up already yeah I made this F leave the building up to you I knock that off her that's no problem sorry no it's fine did you break it yeah no she didn't break it he made me feel bad Kevin Kevin turn off the cameras Oh God here's the other part thank you trying to help you're doing great yeah I'm doing great Turn the Page yes sir I'm trying to make her feel empowered that she's contributing Kevin my barking orders at her thank you Kevin's my feeling all right everybody jeez Jeez Louise oh that's what I sometimes I thought that's what I was starting with and no okay I'm just filling this twice gotcha take this guy yes take you need a gray piece you got the gray piece I don't have a great piece yet no isn't that well that's black that's black oh that's yeah they sometimes it's no it's not",
            "start": 1801.96
        },
        {
            "text": "gotcha take this guy yes take you need a gray piece you got the gray piece I don't have a great piece yet no isn't that well that's black that's black oh that's yeah they sometimes it's no it's not you that's not you we've had that discussion before oh here's the other one okay hold that for me or start building your own if you like be careful though Kevin will yell at you for saying it's not fast enough even though you're doing it quite that's quite perfectly not the right one two and two not four oh oh yeah you're right good call good call oops spot on spot on you leave spike out of this there we go four and two okay got it God does this take me back yeah you miss it no but you know what this is a good primer for what's that putting together IKEA furniture yeah no true and I like doing that I like together yeah I don't even understand how that's possible there you go thank you no problem I'll give you your pieces there you go there there so these four go up here then no how does it",
            "start": 1875.4
        },
        {
            "text": "that I like together yeah I don't even understand how that's possible there you go thank you no problem I'll give you your pieces there you go there there so these four go up here then no how does it work you uh are putting it like that oh okay you you like IKEA furniture building well I like building furniture I won't say IKEA in particular but I do like putting furniture like when I worked at um well remember when you worked that summer with me we put all that furniture through at the office oh yeah it was a nightmare yeah not fun but you enjoy it huh yeah man I keep okay how can I how come I putting that on a m don't look like that you're just going one low I'm doing what just one you you were just one off so you do this you do this then grab these guys oh okay you got to make it look like that I didn't realize that I thought that's what it's supposed to look like and then this Y and then this I bet do people really enjoy watching us do this yeah they do huh they're here for the",
            "start": 1934.2
        },
        {
            "text": "like that I didn't realize that I thought that's what it's supposed to look like and then this Y and then this I bet do people really enjoy watching us do this yeah they do huh they're here for the the company and the personality you know I mean the personality hi if they just wanted to see how the thing looked they would just look at shots online but here we are talking about embarrassing stories about me we're making fun of Kevin every so often Greg Gines just showed up Cool Greg I mean this is a star set of let's play people weren't expecting this when they signed up for it because this is Greg is like the biggest Harry Potter fan I know oh really yeah Nick's up there but Greg's really a big fan so the fact that he's here pretty crazy send Dippy some wait this yeah it's peeking out from behind okay there's a whoops Happ the next one we're getting there Kev see even Kevin's bored watching us do Kevin doesn't but it's cuz Kevin's not a consumer of the content no I'm excited cuz",
            "start": 1989.92
        },
        {
            "text": "from behind okay there's a whoops Happ the next one we're getting there Kev see even Kevin's bored watching us do Kevin doesn't but it's cuz Kevin's not a consumer of the content no I'm excited cuz Greg's here yeah Cool Greg Cool Greg oh oh dude what they got the emblem there oh yeah the emblem's coming up we're almost there guys what are we looking for these guys or this guy just this one guy then this guy yep oh we're making the emblem right now Kev give me sky cam grab away we got a sky cam incoming sky cam on thank you so you got that we're going to put that in there in a second though hold on you put place the sticker right better this is where I can get my revenge right if you AR that's the thing with Legos you can't screw it up unless you lose a piece then you're kind of screwed no it's not CES I never saw the uh the flat the emblem here it is it's cuz I've been faced down the whole time hiding out for this one moment in time you ready there you go that's a cool symbol",
            "start": 2044.8
        },
        {
            "text": "it's not CES I never saw the uh the flat the emblem here it is it's cuz I've been faced down the whole time hiding out for this one moment in time you ready there you go that's a cool symbol you know what I mean Greg yeah I'm happy with it nice this is what do they call them it's not the American Ministry of Magic right what is it called Congress, Congress of Magic the MACUSA, Focus Pocus yeah okay like got points out to put it there like we got it we got that part covered don't worry about it you know okay so now I need this guy and this weird looking thing no that's what it reminded me of Niffler though too right these guys yep thank you thank you light put him in from the bottom what was that s about I've been leaning on my diaphragm I need an air okay gotcha gotcha gotcha I'll out it you can breathe thank you you're welcome that's what I like about you Greg you're so kind I'm a benevolent leader this thing all right then we need this guy other way around all right making",
            "start": 2112.68
        },
        {
            "text": "out it you can breathe thank you you're welcome that's what I like about you Greg you're so kind I'm a benevolent leader this thing all right then we need this guy other way around all right making this crazy arms oh my goodness oh dear it goes like this where does it go oh I see it here down there down here yeah yeah okay do you have to make more than one yeah no I mean we're going to I don't think it's telling us to yet but we're going to definitely not supposed to be right yeah it looks like it looks right yeah that's how that's how it's laying there for sure okay what is it I don't know we'll know when we're done it's part of the it's part of the well yeah we won't be able to identify exactly what it is but this guy goes in there like this oh okay this twice just saw the piece lot stuff going on in the back here that I don't think you know what I mean we're probably to work in this thing over here I just saw it it was right there it is oh you got it there something go on top no",
            "start": 2194.52
        },
        {
            "text": "going on in the back here that I don't think you know what I mean we're probably to work in this thing over here I just saw it it was right there it is oh you got it there something go on top no goes right here no on this one where you don't see it oh it's going to be the doors there's doors on this thing ain't there got it yeah That's what these guys are gotcha caught it up now I'm caught up everybody okay now you've assembled some of the doors or you have the doors laid out I have the doors just assembled okay okay so take this take this take this that perfect perfect take this just the one there you go bada bing bada boom right that's that's that one done take this guy take this is it done or do you have to put another thing on top of it yeah that's what we're building right now oh okay I was we're sandwiching it up Kevin give me sky cam sandwiched it up thanks Kevin take it time I'm enjoying you misunderstood I was just saying how no you're you're you're not I had them together wrong",
            "start": 2265.88
        },
        {
            "text": "was we're sandwiching it up Kevin give me sky cam sandwiched it up thanks Kevin take it time I'm enjoying you misunderstood I was just saying how no you're you're you're not I had them together wrong they go side by side not up and down it's fine don't worry don't worry all right that's I need to hey I brought that book you gave me the Encyclopedia Sign today oh yeah MVP who we Cody Rhodes that co-op you're getting them all you're knocking them out all right what you do with the box uh Cool Greg can we have that box thank you so I can see what we're building that kind of helps me sure cuz I don't know I kind of like the mystery of it all though you know at the end it's just like pow holy crap that's what it was cuz we're about to make this is turning into a door yeah yep yep yep yep all right do this gotcha all right that's on there now we got a door on this old thing Holy Beano MH mhm hey just looking at stuff take whatever you want come on in here give me a hug come here",
            "start": 2327.88
        },
        {
            "text": "right do this gotcha all right that's on there now we got a door on this old thing Holy Beano MH mhm hey just looking at stuff take whatever you want come on in here give me a hug come here Big Kev a clean this up all right thanks bud you get mad at me making a mess it's fine having fun all right thanks bud building a door right now Big Kev you build it they will come sure not missing pieces for what this well what do you think we're missing two more of these just grab this guy right here try where you going with the box oh I'm going to put the box on the other side do you want to look at it yeah sorry she's trying to get ahead of herself here building some stuff I don't know what I'm building unless I look at it sorry no it's okay that regular lightsaber size I screw this up somewhere along I screw this up I think I doubt it I doubt it I doubt it son you would not screw anything up I'm just I'm trying to figure out this count this there you I see what talking",
            "start": 2412.12
        },
        {
            "text": "up somewhere along I screw this up I think I doubt it I doubt it I doubt it son you would not screw anything up I'm just I'm trying to figure out this count this there you I see what talking about the wands versus lightsabers yeah I hear I hear you I'm pretty sure it's the same stick it would make sense right it just seems a little shorter when I'm looking at it now you've gotten bigger though no I played with them very recently I also like Legos this made out of Legos in my room yeah yeah and a Holo-sign symbol that's cool you can't open these doors when you build them huh no apparently not those wings are so cool on them I know that's it's you know pumping circumstances working out they don't slide or nothing they just no you you can wiggle them a little bit but not like open them open them it's not like the Ghostbusters one where you could do all that crazy stuff you ever think about your dad fighting World War II so we could have this freedom thinking about my dad a lot but",
            "start": 2498.4
        },
        {
            "text": "open them it's not like the Ghostbusters one where you could do all that crazy stuff you ever think about your dad fighting World War II so we could have this Freedom thinking about my dad a lot but not that he fought not that he was a real man who went out and fought for our country so his Grand we don't have those put upside down what the doors yeah yeah I'm pretty sure cuz cuz I'm thinking if we had these hinges that are up here down here you would be able to open and close it I think no I guess you wouldn't that would still hit there never mind never mind never mind and these guys do go this way nailed it that's a cool looking door indeed doors are assembled we're almost there all right so now two of these guys that did you ever worry you'd run out of money with me when you were a kid when I was a kid not cuz I was going to spend all the money no I was afraid was going to run out of money for you go to college that was my big worry that's where those student loans came in",
            "start": 2571.68
        },
        {
            "text": "a kid when I was a kid not cuz I was going to spend all the money no I was afraid was going to run out of money for you go to college that was my big worry that's where those student loans came in handy God for fasta is that what it was yeah it was right sounds perverted when you say it but yeah come on Mom I used to like when we used to go in the on the weekends before you drove mhm and I think it was Saturday mornings we'd go to the mall yep looking for DC Comics action figures Total Justice was always the one we were hunting down at KB Toys we would stop and have lunch oh you did you go ahead a little bit ahead nice where' we stop for lunch wherever you wanted to usually P if I put that into early to have Mom you can't get ahead of the program sorry okay I'll take these two out so are you as Blown Away by the fact like I am cuz I'm Blown Away by the fact of like all the things I loved as a kid that I not that were hard to find or whatever are now like a phenomenon right like like",
            "start": 2669.52
        },
        {
            "text": "you as Blown Away by the fact like I am cuz I'm Blown Away by the fact of like all the things I loved as a kid that I not that were hard to find or whatever are now like a phenomenon right like like books and it I just often look at it and think you were way ahead of your time yeah and I'm so glad so many times that I did what's the word I'm looking for where I let you do the stuff you wanted to do yeah whether it be the DC Comics or build you know Lego stuff um do backyard wrestling mhh you know all that good stuff they were a lot of fun for you kids and it I think it's helped you out I mean oh sure you know that you got to meet Dan Arro you got to meet um Hulk Hogan you know there's been a lot of very famous people that did you ever get to talk to um uh Egan I can't think yeah har RIS yeah on the phone during when I was a kid him when you were when he was on WGN didn't you uh Fox in the Morning oh Fox in the Morning Bob Mar and mercy I don't know what ever happened on them",
            "start": 2743.64
        },
        {
            "text": "yeah on the phone during when I was a kid him when you were when he was on WGN didn't you uh Fox in the Morning oh Fox in the Morning Bob Mar and mercy I don't know what ever happened on them they're still going where uh they're doing their own thing now on like Facebook all the time oh yeah yeah cuz they done a radio show for a while and then popped over to do their own thing I I had tweeted Bob Sarat uh from a bar I was waiting for something to happen some I was waiting for someone to do something and I was I went to a bar and I was playing Mario and they played a a song that I don't even know the real name of but that they used to play during the traffic drive time when they just put up the stats and I I tweeted about like this reminds me of your show you know and he responded oh that's cool and and I was like oh that's awesome and then you're like oh wait well I guess in Twitter I'm I'm a bigger deal than Bob Sarat which is weird but almost got ahead of myself so yeah you",
            "start": 2810.04
        },
        {
            "text": "oh that's cool and and I was like oh that's awesome and then you're like oh wait well I guess in Twitter I'm I'm a bigger deal than Bob Sarat which is weird but almost got ahead of myself so yeah you know what they say Kevin measure twice cut once did they ever say that to you Kevin yep lots of has it served you well no I never do you just jump right in yeah that was the worst going to happen oh you have more doors I was like I was like wait what's happening actually see I couldn't figure out what pieces those were mm Brown and the flatted thing I think we have to take this out before we can put that in maybe Mom I know I got I told you not to get ahead of yourself don't yell at me for this very reason go wait in the car don't yell at me thank you can I turn the page you sure can thank you you slide it over H that's cool so you got to take the tops off I yet period okay okay this when we got to take the tap off in the world is but okay MH M all right then the second one goes",
            "start": 2846.96
        },
        {
            "text": "you slide it over H that's cool so you got to take the tops off I yet period okay okay this when we got to take the tap off in the world is but okay MH M all right then the second one goes in there good call good co ah there you go the Toppers he made okay one of these is backwards cuz this one's got the ledge yeah yours is backwards nope nope stop this the whole thing this guy's see how his like mouth's got to go out oh Kay give me sky cam hold on yeah see we got to get that guy's mouth out the other way so that's a mouth well no but I'm just calling it a mouth oh okay so why do you have to take all that apart cuz I got to slide them all the way up oh can you reassemble that I broke it yeah no problem I broke it all my hard work there we go okay now world is such when good thing is we can rewind this video and see that Greg put that on backwards that mean no we can that you took it and put it into the wrong spot all you you just you did that not me yeah see that's the fun part",
            "start": 2930.44
        },
        {
            "text": "we can rewind this video and see that Greg put that on backwards that mean no we can that you took it and put it into the wrong spot all you you just you did that not me yeah see that's the fun part about getting old you don't remember that **** oh my gosh Kevin look at this look at this I don't know why we do this but it's got to be something from the movie Greg I'm ruining the movie for you this happens in the movie keep doing it now watch this Kev Pro maneuver he broke the one on the left your left camera right bless you how's it broken doesn't look broken okay I mean it might be I'm asking for legits well cuz it wasn't sliding down yeah this one didn't slide down well you didn't grease it think give any grease there you go that's it so there you go that is what Mordor is what they call it makusa makusa from the Fantastic Beasts and Where to Find Them Story pack from Lego Dimensions Wave 7 remember Sonic is also in there remember also that the Gremlins are in there there's Spike",
            "start": 3016.12
        },
        {
            "text": "it makusa makusa from the Fantastic Beasts and Where to Find Them Story pack from Lego Dimensions Wave 7 remember Sonic is also in there remember also that the Gremlins are in there there's Spike know there's Gizmo they also have other people there's other folks happening in this wave but this is what they sent us this is new remember nud is in there and of course remember FTC we didn't steal these they sent them to I know Mom ladies and gentlemen this is the Fantastic Beasts and Where to Find Them Story pack from Lego Dimensions Wave 7 and some of the other guys what do you think of it let us know in the comments below share this with your friends maybe we'll do a Let's Play of it we'll see if you like this because some of the Let's Plays you're like I don't well not some of the let's well I guess some of the Let's Plays in general but so I don't know am I wearing you out with the Legos content let me know until next time it's been our pleasure to serve you",
            "start": 3079.12
        }
    ]
}