{
    "id": 2155,
    "video_id": "pw3iXVLrmDI",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What Do Video Games Mean To Us? - Kinda Funny Gamescast Ep. 92 (Pt. 4)",
    "description": "What do video games mean to us?\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1478178007,
    "duration": 1346,
    "transcript_chunks": [
        {
            "text": "This episode of Kinda Funny Gamescast is brought to you by MVMT Watches. That's, you know, MVMT Watches. It was founded on the belief that styles shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion, buffering high quality minimalist products at revolutionary prices. We got ours, they're legit. One Kevin Coello says that his is sexy as hell and it fits really well. Those are paraphrased quotes, but it kind of gets the spirit across. The company started by two broke college kids that wanted to wear stylish watches but couldn't afford them, so they started their own watch company. Kind of sounds like when we left IGN to do our own thing because, you know, we wanted to do our own thing. I respect that. MVMT Watches starts at just $95. At a department store, you're looking at hundreds of dollars. MVMT figured out that by selling online, they're able to cut out the middleman and retail markup, providing the best possible price. We're talking classic",
            "start": 0.08
        },
        {
            "text": "store, you're looking at hundreds of dollars. MVMT figured out that by selling online, they're able to cut out the middleman and retail markup, providing the best possible price. We're talking classic designs, quality construction, style, minimalism. Over 500,000 watches have been sold in over 160 countries. Here's the deal: you can get 15% off today with free shipping and free returns by going to MVMTWatches.com/Kinda. The watch is a really clean design. Seriously, Kevin's making compliments, everybody's loving him. Now's the time to step up your watch game. Go to MVMTWatches.com/Kinda. Join the movement. That's a tagline I like a lot. Ladies and gentlemen, as always, this topic's brought to you by you. You can go to KindaFunny.com/GamescastTopic, leave your questions. We'll get to them one day, just like our boy Be Somebody's Blues. Be Somebody's Blues. So this is an extremely long passage, if you will, uh, and I'm going to read it because I think that there's, there's something interesting here and I",
            "start": 37.44
        },
        {
            "text": "like our boy Be Somebody's Blues. Be Somebody's Blues. So this is an extremely long passage, if you will, uh, and I'm going to read it because I think that there's, there's something interesting here and I wanted to specifically get to this. I would even say it's a question because it's not a question. Uh, I just wanted to read it because he starts off with, \"Hey, I'm a new listener. Sup.\" And I, I was like, \"I want to, I want to show you some love here. We love you, Be Somebody's Blues. Be Somebody's Blues.\" \"Hey guys, I'm a new listener and I just wanted to say how great you guys are. Binge listening to past shows is the only thing that gets me through my workday. I'm writing because I find myself in a bit of a predicament. A couple days ago, I went in to have surgery done on my wrist to remove a cyst that seems to constantly grow between my wrist joints, causing me some pain. This occurrence is quite troublesome as I now have to wear a cast on my dominant hand, can't lift anything heavier than a gallon of milk,",
            "start": 96.36
        },
        {
            "text": "constantly grow between my wrist joints, causing me some pain. This occurrence is quite troublesome as I now have to wear a cast on my dominant hand, can't lift anything heavier than a gallon of milk, and most importantly, I can't play video games. However, the problem seems to stretch farther than just a couple weeks of commission or out of commission. Now, my mother and I have been in constant arguments about what is causing the problem in my wrist, masturbation. Uh, while we both agree it's from excessive video gaming, we both have different opinions when it comes to solving the problem. While on the way back from the hospital, my mother was telling me all the things the doctor had told her about the surgery and how everything went. And then she jokingly said that the doctor told her to take my PS4 out of the room because constant video gaming was causing the cyst to grow, a fact not actually noted by my doctor, by the way. And this is when I realized something: my mother views video games as some",
            "start": 134.4
        },
        {
            "text": "out of the room because constant video gaming was causing the cyst to grow, a fact not actually noted by my doctor, by the way. And this is when I realized something: my mother views video games as some childish, meaningless habit or addiction, as she likes to call it now, that has no purpose other than mindless entertainment. Of course, I'm embellishing, my mother didn't actually say those things. I therefore tried to persuade her to see that video games were more than that and had more meaning to me, but that they're my passion and an art form that needs due respect. Being a Cinema Studies major with the hopes of pursuing screenwriting in my future, I understand the meaning of storytelling on all platforms. But how do you describe the importance and meaning of video games to someone or even farther, a society that views video games and gamers as a wasted opportunity, growing less important, staring at a TV screen, as the same can be said about binge watchers and those seamlessly connected to their",
            "start": 172.0
        },
        {
            "text": "a society that views video games and gamers as a wasted opportunity, growing less important, staring at a TV screen, as the same can be said about binge watchers and those seamlessly connected to their smartphones. Society constantly views gamers and the nerd society as a whole, uh, from a perspective of the 40-year-old man wasting his life away in his mother's basement in the same Cheeto-stained sweatpants he's been wearing for the past 15 years. To this extent, I'm not exactly sure what I'm trying to get at. I'm sure there's some deeper conversation hiding away in here somewhere. All this just sprung to mind during driving back from the hospital as the anesthesia was wearing off and I was trying to convince my mother that no matter how much pain I'm in, no matter how many times little bastard girls back, I will play video games until my wrist falls off. Sorry for the long ass rant, hopefully you can make some meaning out of it. Sincerely, One-Handed Gamer. Thought it was interesting. No, it is. I mean,",
            "start": 204.04
        },
        {
            "text": "back, I will play video games until my wrist falls off. Sorry for the long ass rant, hopefully you can make some meaning out of it. Sincerely, One-Handed Gamer. Thought it was interesting. No, it is. I mean, it's what are video games? What do they mean to us? Well, it's what we always talk, or what I always talk about, right? I always use the thing, I usually talk about it with violence in video games, right? And like, the fact of the matter is, we're aging, no offense to your mom, everybody, out of this population where eventually you're going to get to this Tipping Point where people have grown up with games. And that's what we talk about with like the term gamer, right? Like it's such a weird thing. There aren't movie watchers, there aren't television watchers. I'm a binge watcher. That's not how you describe yourself. Binge watching and movies and all that is just part of everybody's life, right? And it's more, it's more strange when you meet somebody, he's like, \"Oh, I don't, I don't have a TV. I don't go to the movies. I\"",
            "start": 238.08
        },
        {
            "text": "binge watching and movies and all that is just part of everybody's life, right? And it's more, it's more strange when you meet somebody, he's like, \"Oh, I don't, I don't have a TV. I don't go to the movies. I don't do anything.\" \"What, really?\" Like, and I'm, it's one of, that's what has happened with gaming where the people who get bent out of shape when there's somebody in Congress and he's like, \"Oh my God, we need to ban video games. We need to do all this different stuff. Video games are too violent.\" Right? He's saying that because somebody told him in GTA you get to kill a hooker and take the money back after she services you. And for him, he's thinking of the last time he saw a video game was when his daughter was five and she was playing NES and she was playing Mario. And then the daughter found another interest and never played video games again. And that's where his entertainment, his knowledge of video games ended. And so when he hears, \"You're killing a hooker, you're taking the money back,\" he's thinking of a",
            "start": 271.16
        },
        {
            "text": "and never played video games again. And that's where his entertainment, his knowledge of video games ended. And so when he hears, \"You're killing a hooker, you're taking the money back,\" he's thinking of a seven-year-old playing that on a, on a TV screen, not the 30-year-old man who's coming home from his accounting job and wanting, wanting to get a form of entertainment out, right? Yeah. And that's the thing is where I think our generation is the, we're obviously advancing the ball down the field in terms of like, okay, this is an art and this is how we feel about it. And we, we crave great performances and games can make us cry and they can make us laugh and they can do all these different things. I think that's what's going to happen where eventually this fades away trying to, we get this question all the time of like, \"My mom isn't a gamer,\" or, \"My girlfriend isn't a gamer. What's the one game I can show them to change the opinion?\" There is no one game. Of course, you know your mom, you know your girlfriend,",
            "start": 304.56
        },
        {
            "text": "time of like, \"My mom isn't a gamer,\" or, \"My girlfriend isn't a gamer. What's the one game I can show them to change the opinion?\" There is no one game. Of course, you know your mom, you know your girlfriend, you know whoever you're talking to. And obviously this could be boyfriend, father as well. I'm not trying to put it in a gender thing on it. You know what would speak to them on that level to make them understand or make them see, whether it is playing Uncharted and they like, \"Oh, it's just like a movie,\" or whether it is making them experience PSVR or VR in, you know what I mean? Like there's so many different things. But you also can't force, you can't lead the horse to water and make it drink. Like they have to find it on their own or they never will. And that's totally fine as well. Yeah, I mean, I, I, I, your story kind of really inspires me in a lot of ways just because like, just reading it, it just, it reminded me something I already knew, but it reminded me just how important games are to me and like how",
            "start": 338.68
        },
        {
            "text": "story kind of really inspires me in a lot of ways just because like, just reading it, it just, it reminded me something I already knew, but it reminded me just how important games are to me and like how, how important game culture is to me. And it's not even so much just about playing it, but it's about living it. And it's about thinking back on all the memories of my life. And in no small way, I am who I am because of video games. Like my career, my job, all that, obviously. But when I stop and think back on my life and I think back about the friendships that I made and the relationships that I have, so many of them are birthed in video games in some way, whether it's the hours of co-op we played together, or just waiting in line for the new Halo game to come out in front of a store, or just talking to your friends about what could Mario 5 look like, you know what I mean? Like just making things up in your head. It's just like, it's a form of creative expression that goes so far beyond just experiencing it",
            "start": 375.28
        },
        {
            "text": "friends about what could Mario 5 look like, you know what I mean? Like just making things up in your head. It's just like, it's a form of creative expression that goes so far beyond just experiencing it and interacting with it as it's happening. But it's, it's, it is kind of all-encompassing and it is a lifestyle, you know? And in the same way, I think movies are too and TV has been forever. But yeah, I mean, you know, uh, piggybacking off your point, like this is the wave of the future. And it's not so much even the future anymore, it's the now. This is happening, this is how things are. And I think that it won't be long till video games are just something people just do. Except, yeah, and it's funny, 'cause yeah, I, I hadn't heard, and I know it's still out there, of course, but like in our day-to-day life and even talking to our, uh, fans and the best friends, right? I haven't heard the whole like, Mother's basement Cheetos thing in so long, other than when I make the joke about it, Dr. Pepper or something. But like, you",
            "start": 418.6
        },
        {
            "text": "to our, uh, fans and the best friends, right? I haven't heard the whole like, Mother's basement Cheetos thing in so long, other than when I make the joke about it, Dr. Pepper or something. But like, you know, to the what we're talking about, you know, I've talked about to you off camera about it, of the fact, you know, I went to Missouri, right? And I'm there with my friend who's an actuary, who's about to have his first kid with his wife. And then one of my, you know, best friends in the world who's a mother of three, right? And both of them wanted to talk about the Nintendo Switch. They just heard about this. They read about it in the paper. They had seen like something on the news. And like that's where it's at, is that people who aren't in games, aren't connected to gaming, but grew up with gaming and have taken time off and don't have PlayStation 4s and our play, don't have an Xbox Live account and don't, you know, have that, \"I have no **** idea what VR is.\" They hear about something that's interesting in games,",
            "start": 461.44
        },
        {
            "text": "time off and don't have PlayStation 4s and our play, don't have an Xbox Live account and don't, you know, have that, \"I have no **** idea what VR is.\" They hear about something that's interesting in games, they want to know about it because they're interested in getting it. Well, I mean, I think, you know, so mobile gaming gets so much, but I think that something that, that should be said about it is that so many people that are not gamers, would never see their gamers, games have not affected their lives at all, have been addicted to Candy Crush. They've been addicted to Bejeweled or Jetpack Joyride or whatever it is. And they play those things. They wouldn't call them video games, but they are video games. And I think that that is what people are just going to start growing up with, whether you're playing on your PlayStation 4 or, uh, the Nintendo Switch or on your phone. People are playing games. And whether or not they know that they're games, we're now growing up in a, in a place where, uh, my girlfriend that's",
            "start": 494.4
        },
        {
            "text": "PlayStation 4 or, uh, the Nintendo Switch or on your phone. People are playing games. And whether or not they know that they're games, we're now growing up in a, in a place where, uh, my girlfriend that's not into video games, handing her a controller and saying, \"Play,\" is a lot easier now than it would have been seven years ago because inherently she's played games on her phone. She can wrap her head around how games work, you know, like the, the structure of all that stuff and using controls, even if it's touch or not. I think the touch thing, uh, across DS and across, uh, just video games in general now, touch is just a thing in a way that we interface with tech. People grow up using iPhones, so the crossover to video games is just, it's natural, it's way more natural than it used to be. Before, you had to try to play games. Now, you just play games. And I mean, in terms of what you're talking about, and you know, kudos is something that maybe doesn't speak to us, but spoke to so many, the Wii, right? I'll never, ever, ever",
            "start": 532.16
        },
        {
            "text": "games. Now, you just play games. And I mean, in terms of what you're talking about, and you know, kudos is something that maybe doesn't speak to us, but spoke to so many, the Wii, right? I'll never, ever, ever forget when my mom came over and played the Wii of Thanksgiving. And that said, she wanted a Wii. And I was like, \"What, really?\" And I stood in line and got her one for Christmas. And then like nine months later, when she was like, \"Oh yeah, and I bought a DS. I'm playing a horse game.\" I'm like, \"What? Who the hell are you?\" You've never been, I, you've, she, both parents would play video games with me and not know what was going on and be done with it, right? But here they are playing the contemporary systems I am. And granted, completely different experiences, but it was the one that was then into nursing homes. And it was the one where my, you know, my mom and her husband had a Wii and they played it at, you know, a barbecue here and there. And it was this party thing for them. And it did break down that wall to an extent",
            "start": 578.68
        },
        {
            "text": "the one where my, you know, my mom and her husband had a Wii and they played it at, you know, a barbecue here and there. And it was this party thing for them. And it did break down that wall to an extent of what video games are and introduce people to this thing that is different. Yeah, I don't know. I, I just feel like I used to make this argument that, you know, even, you know, not too long ago, a few years ago, where games are art. It's important for people to recognize that video games are art and they're important. Then I kind of came to the realization that like, I don't really care, you know? Like it's, I played games almost every day of my life, virtually every day of my life for pretty much 30 years. And um, they're a part of the fabric who I am. And, and certainly as you said, are part of why I am the way I am and who I am. And um, I think we waste a lot of time and a lot of energy making people believe. And I just don't care anymore if they believe or not. It's obvious that they are. Like it takes, it takes",
            "start": 613.2
        },
        {
            "text": "am and who I am. And um, I think we waste a lot of time and a lot of energy making people believe. And I just don't care anymore if they believe or not. It's obvious that they are. Like it takes, it takes a, a, a ridiculously stupid person to sit down, watch you play Uncharted for an hour and not understand what video games are. That, that you have to be intentionally obtuse or just absolutely insane to not understand that a video game is special if you show them something like Uncharted 4. But whether or not that person gets Uncharted 4 or not, it gets that like video games are not just a waste of time per se. And by the way, they are a massive waste of time. There's nothing wrong with that. Uh, I've said that before, almost everything we do is a waste of time. Um, I watch sport, I watch football for one and a half hours every Sunday. It's a **** massive waste of time, but I like it. And that's what's most important. So I feel like, you know, we, we have to talk about like movies being made in or games being made in",
            "start": 651.48
        },
        {
            "text": "one and a half hours every Sunday. It's a **** massive waste of time, but I like it. And that's what's most important. So I feel like, you know, we, we have to talk about like movies being made in or games being made in the movies. We, Uncharted, The Last of Us. And how that like, well, uh, I think a lot of the reason that people want those to be good is to say like, look, video games can do something worthwhile like a movie can do. And to me, I'm like, I don't care. I don't even want these things to be movies. It's not important that, that we get, you know, with all the respect, his mom's acceptance of video games. It doesn't matter. Like, to Greg's point, like these people are going to be gone one day. Like the people like us that grew up with a PlayStation in our house or a Dreamcast or a GameCube or whatever it is, they that understand games, they will grow up and we won't. We will get to the point where you are in a gamer, but that's just something that you probably just do passively, whether you're doing it on a phone or",
            "start": 698.76
        },
        {
            "text": "understand games, they will grow up and we won't. We will get to the point where you are in a gamer, but that's just something that you probably just do passively, whether you're doing it on a phone or whether you're doing on a tablet or whether you're doing on a television. Um, I think that the value of something like Wii or DS or these mainstream devices are dubious at best because they were ephemeral. They were on one like that. And now we're back to a baseline again of hardcore gamers, which is a different type of person than a person that plays a game on the phone. And I don't think that one's better than the other, but it is worth saying that the games we're necessarily talking about are not games that you play on your phone. Um, and so I just feel like people have to kind of keep that in mind. It's not, who cares, you know? Like that, that's the big thing. Like, and that's really the way I feel where I'm like, I just don't care anymore. I don't, I'm 30 years old. I love video games. I'll play them for",
            "start": 731.32
        },
        {
            "text": "not, who cares, you know? Like that, that's the big thing. Like, and that's really the way I feel where I'm like, I just don't care anymore. I don't, I'm 30 years old. I love video games. I'll play them for the rest of my life. They're part of the fabric of who I am, what I do, how I grew up, how I live as an adult, the way I make my money. Um, and it's not important to me what other people think about it. And if they think it's a waste of time in a, in a, in a, in a bad way, if they think that they're stupid, if they think they're childish, well, **** them. I don't care, you know? Like, matter, it's a young man's game in terms of that, right? Where it was, I, the counter example of this, right, is the fact I was showing General Mizzou the other day and we came to Speaker Circle. And Speaker Circle at the University of Missouri is this place where you can go and say whatever you want. Like people go there and give speeches and people gather. And like in my day, in everybody's day, you know, even when I was not going to school",
            "start": 763.64
        },
        {
            "text": "is this place where you can go and say whatever you want. Like people go there and give speeches and people gather. And like in my day, in everybody's day, you know, even when I was not going to school there, there was like Brother Jed who would come through and sit there and preach the gospel. But he would, he was one of those guys who would tell you why you're going to hell and yell at the girls walking by for having premarital sex or wearing their shorts or, you know, yell at the guys. And like when you're a student and that's happening, man, like he, he gets a crowd 'cause people sit there and want to argue with him and try to make their point and tell him he's wrong and all these different things. And then like by senior year, you just blow by. You don't **** care what Brother Jed's saying. It doesn't matter. You're not going to change his mind. Does it matter? And it's the same thing here when like, when Roger Ebert originally brought up his whole thing of like, \"Games aren't art,\" and like people wanted to",
            "start": 803.8
        },
        {
            "text": "matter. You're not going to change his mind. Does it matter? And it's the same thing here when like, when Roger Ebert originally brought up his whole thing of like, \"Games aren't art,\" and like people wanted to go fight him on Twitter and do all these different things. Well, and it's like, granted, he died too, but then proving my point. But the more and more he says it, like, why the ****, why, why would you engage? Yikes. It's literally what we're talking about. We're aging out the people that don't care that like, why waste your time? Yeah, it's just like, I, you know, I've talked about in the past how, you know, when my parents, especially my dad, finally was like, when I was adult, being like, \"I looked at this as a dubious sort of thing that you do. And it's very impressive that you made this into a career.\" And his son, of course, is an animator, so we both do cool things for a living and stuff. And that was, that was, it was, uh, it was, it validated me in a way, but that was a very personal thing. Like when I look at it in",
            "start": 837.44
        },
        {
            "text": "of course, is an animator, so we both do cool things for a living and stuff. And that was, that was, it was, uh, it was, it validated me in a way, but that was a very personal thing. Like when I look at it in terms of, because I argued the like that, not necessarily that you should take game seriously, but that I'm going to do something with him and I will prove you wrong. And so I did. Um, but it just, I just don't care what other people think about really. Like it goes back to like, you know, there seems to be especially in gaming, but it happens in sports, it happens in music, it happens in really anything with fandom where everyone, you know, people like try to hurt you by saying that's something you like sucks, right? People tweet me all the time like, \"The Jets suck.\" I'm like, \"You're really shocking. I didn't know that. I'm going to lose a lot of sleep over the fact that the Jets suck. I didn't know. I watch, watch every Jets game for years and years and years, but I had no idea they were bad.\" You know, or when",
            "start": 873.12
        },
        {
            "text": "know that I'm going to lose a lot of sleep over the fact that the Jets suck. I didn't know. I watch, watch every Jets game for years and years and years, but I had no idea they were bad. You know, or when someone's like, \"311 sucks,\" or whatever. I'm like, \"Oh, I'm going to lose a lot of sleep. You don't like a band that I like? Oh, no.\" You know, like, who gives a ****? It's the same thing with, it's the same thing with video games. It's just like, enjoy what you enjoy. If you enjoy them, then shout them from the rooftops. People will understand or they don't. And it doesn't matter. Move on with your life. Enjoy your ****. And, and people will come around or they don't. Also understand that there's a diversification of opinions and your opinion is not necessarily right. Video games might be totally ridiculous and, and but and useless and all these kinds of things, but they're not to me. So that's all that really matters at the end of the day. Amen. Next question comes from Witchard Champ. \"Hey guys, Rockstar did an incredible\"",
            "start": 909.92
        },
        {
            "text": "useless and all these kinds of things but they're not to me so that's all that really matters at the end of the day amen next question comes from Witchard Champ hey guys Rockstar did an incredible job on giving a first-person experience to Grand Theft Auto on the PlayStation 4 and it's kind of surprising the Resident Evil 7 will be in first person as well my question is this what games would you like to be remade or have a sequel with a different perspective I'm not just talking about going from third to first person or vice versa side scroller isometric and top down can also be considered I'd be interested in having a Metroidvania style side-scrolling Uncharted keep it the good work you're fan from South Africa Witchard Champ let's be clear that almost anything in Metroidvania style would be better than the way that it is right now because that's the best way to play a game uh I said before uh third person open world Mega Man game I think would be cool the the idea of spinning things",
            "start": 943.92
        },
        {
            "text": "be better than the way that it is right now because that's the best way to play a game uh I said before uh third person open world Mega Man game I think would be cool the the idea of spinning things on its head sometimes works and sometimes does and I I always go back to Mega Man Legends or Mega Man 64 which people like love for some reason and I'm like why like so like just just because sometimes people want to change um so but it also goes back to what we talked about with Final Fantasy so-called Final Fantasy disease and all these kinds of things where we have expectations what game should be um while I like to see games kind of molded or morphed into different things like Resident Evil 7 being in first person is strange but that makes sense actually like when when we saw it and heard about it I didn't even realize that it was in first person that's how much like sense it made where I'm like you know where I'm like I was reading about it and like that just totally glossed over that and",
            "start": 985.56
        },
        {
            "text": "it I didn't even realize that it was in first person that's how much like sense it made where I'm like you know where I'm like I was reading about it and like that just totally glossed over that and the footage or the screens whatever or whatever it was where I'm like I don't like I probably could have literally played Resident Evil 7 having played every other Resident Evil game in the course years except for six and uh not even realized that it was any different because that's just where we're going you know so that's kind of where I stand I'd like to see what the developers want to do with certain things I think side-scrolling Uncharted would be awesome be careful what you asked for though we had side-scrolling Assassin's Creed games and if Assassin's Creed wasn't bad enough you really should play those games which I lasted all five minutes before I'm like how can you make a side scroller feel like this uh threw it out for me you know I think uh when they put out the Ghostbusters",
            "start": 1023.12
        },
        {
            "text": "should play those games which I lasted all five minutes before I'm like how can you make a side scroller feel like this uh threw it out for me you know I think uh when they put out the Ghostbusters game right the Ghostbusters a video game on PS3 Xbox 360 that was what I'd always envisioned a Ghostbusters game to be right third person here we go I'm playing as this character that's great and then I've heard nothing but good things about the Ghostbusters VR arcade game that's out in New York and a couple different places like that where I would have never said yeah I want a first-person Ghostbusters game because I think that look stupid with the Neutrona Wand bouncing back and forth but being in a VR experience feeling like I'm a Ghostbuster sounds awesome and from what I've seen on Reddit because God knows I wouldn't **** buy it but the Ghostbusters movie the 2016 version comes with an insert that's that promotes that the Ghostbusters VR thing is coming to PlayStation VR oh really which",
            "start": 1054.56
        },
        {
            "text": "God knows I wouldn't **** buy it but the Ghostbusters movie the 2016 version comes with an insert that's that promotes that the Ghostbusters VR thing is coming to PlayStation VR oh really which would be totally **** do yeah that's really cool uh I mean this isn't so much answering your questions as much as providing example of something that did this and it worked with uh Tomb Raider I I forget the name of it but Guardian of Light Guardian of Light I feel like that was more of an isometric thing and I feel like it really kind of uh went to the heart of what Tomb Raider meant to you playing it growing up like Tomb Raider I I honestly feel doesn't hold up when you go back and play Tomb Raider 1 through 3 nowadays even though back then it was so amazing um but this game kind of like made it feel like I remember Tomb Raider I feel like Lara Croft Go also did that so with Hitman Go that was great but it really was kind of like very different than the",
            "start": 1090.36
        },
        {
            "text": "this game kind of like made it feel like I remember Tomb Raider I feel like Lara Croft Go also did that so with Hitman Go that was great but it really was kind of like very different than the Hitman games 100 but with Lara Croft Go it's like the it it felt like what Tomb Raider would feel like if Tomb Raider kept happening you know way simpler way dumb down but the idea of just like the puzzle solving and all that it felt very true to what Tomb Raider is and I think the perspective change and um gameplay change as well really kind of helps with that so next question General Moses do Publishers ruin games example EA and Battlefront Battlefield 4 Activision with Call of Duty Tony Hawk and Destiny Publishers fund the games there would be no none of those games without the Publishers money so no I can't I can't uh agree with you there uh do they bite off more than they can shoot do they ask for too much overzealous are they yeah are they a little crazy yeah shoving down your throat",
            "start": 1132.44
        },
        {
            "text": "so no I can't I can't uh agree with you there uh do they bite off more than they can shoot do they ask for too much overzealous are they yeah are they a little crazy yeah shoving down your throat sometimes but the the anti-publisher **** is outrageous you know like without you can hate Electronic Arts all you want but you wouldn't have gotten **** any of the like any of the games from Visceral any of the games from any you know uh like really any of their studios Redwood whatever you know like I mean this all goes back to the great Ubisoft Assassin's Creed thing right we'll keep putting on Assassin's Creed every year until you stop buying it you can turn around and say that EA is the most evil company in the world because of X Y and Z but they're giving you a Madden every **** year because you buy Madden every **** year and I'm not complaining about that as somebody who plays the Maddens or like somebody who **** bought every WWF game on N64 right like I or I should say THQ",
            "start": 1178.08
        },
        {
            "text": "because you buy Madden every **** year and I'm not complaining about that as somebody who plays the Maddens or like somebody who **** bought every WWF game on N64 right like I or I should say THQ game cuz obviously there was WCW but you know what I'm saying like I want that every **** year so yeah I'm going to buy it and then I'm not going to turn around there be like oh another one of these it just goes further than that too NPD last month for September of 2016 with combined digital and retail sales the four top selling games in the United States were all annualized sports games two three and four were Electronic Arts sports games so people out there like high on their horse thinking they're speaking for everyone you're **** not you know like clearly you're not NHL 17 NHL 17 the fourth of the big four Sports by a mile in the United States right like in terms of popularity outsold Destiny: The Collection you know BioShock: The Collection Grand Theft Auto V Minecraft you know so",
            "start": 1214.52
        },
        {
            "text": "fourth of the big four Sports by a mile in the United States right like in terms of popularity outsold Destiny: The Collection you know BioShock: The Collection Grand Theft Auto V Minecraft you know so like just like everyone needs to relax with like the the demonization of Publishers I don't agree with the annualization thing either I think Ubisoft is smart to get rid of Assassin's Creed for a little while to take more time with Watch Dogs Sequel and all those kinds of things but this high horse **** about like people like those kinds of games too I think it's I think there could be I think the person that gets in the publisher that gets in first with these annual sports games for instance makes them a platform makes the game even free charges for roster updates and patches and all those kinds of things that's where the money's going to be made in a few years but until we get to that Tipping Point often we see data suggesting that what I'm suggesting is either not tenable or just way",
            "start": 1250.84
        },
        {
            "text": "kinds of things that's where the money's going to be made in a few years but until we get to that Tipping Point often we see data suggesting that what I'm suggesting is either not tenable or just way ahead of the curve um and we're going to see that when the show comes out and you're going to see that for the next 1 **** months because NBA 2K17 will be on that list every month without without fail so um you know the demonization not that I was just asking necessarily but no Publishers don't ruin games they fund them you know like I just I just the the the people have gone over it's too broad a brush did Activision mishandle the Spider-Man franchise yes should they have tried to you know give Beenox like nine months at a time to make Spider-Man games no they shouldn't have but like they didn't they aren't ruining games ladies and gentlemen this has been the Kinda Funny Gamescast a particularly good one I think it was worth the dollar worth the mother **** dollar until next time",
            "start": 1290.88
        },
        {
            "text": "didn't they aren't ruining games ladies and gentlemen this has been the Kinda Funny Gamescast a particularly good one I think it was worth the dollar worth the mother **** dollar until next time I love you",
            "start": 1331.4
        }
    ]
}