{
    "id": 2185,
    "video_id": "QSX-ZKyeTZc",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller"
    ],
    "title": "The PlayStation Games You Need To Play In 2016",
    "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1479747602,
    "duration": 240,
    "transcript_chunks": [
        {
            "text": "Buongiorno Kinda Funny fan, it's me Greg Miller and I'm in front of a GameStop, not for real but kind of in the screen thing. Uh, we had a cool opportunity. Tim somehow talked to GameStop and they said, \"Hey, would you like to put videos in GameStops and do like content and make little videos for us?\" And we were like, \"Sure, is there any money?\" And they're like, \"No, this is you just want to do some cool content.\" We're like, \"Oh, okay, yeah, we like cool content.\" So we made these videos for GameStop to run in GameStop stores, which is kind of a big deal for Five Guys working out of a really cool studio in San Francisco. So rather than just put him there and have you never see them, we thought we'd put them here, but I need to put a bump in front of it 'cause I say a lot of stuff about GameStop in there, but if you're just on YouTube, you're like, \"I don't, I don't care about that.\" So you're about to watch a video that airs in GameStop. If you ever see it in a GameStop, you need to take a selfie of yourself with it playing",
            "start": 0.28
        },
        {
            "text": "on YouTube, you're like, \"I don't, I don't care about that.\" So you're about to watch a video that airs in GameStop. If you ever see it in a GameStop, you need to take a selfie of yourself with it playing behind you and then enjoy it. What's up, everybody? I'm Greg Miller from KindaFunny.com and I just so happen to co-host the world's most popular PlayStation podcast called PS I Love You XOXO. It posts every Tuesday morning, so why not click over to youtube.com/KindaFunnyGames and subscribe? Anyway, GameStop asked me to talk about games, so I figured I'd toss out the games you have got to play on PlayStation in 2016. Now, these aren't my favorite games of the year, these are just ones you have to play if you want to be respected by Shuhei Yoshida, and don't we all? Let's start with The Last Guardian. Yep, it's not even out as I'm recording this, so I have no idea if it's good or bad, but come on, it's The Last Guardian. After a decade, it's finally coming out of Japan and we're going to know if it's even",
            "start": 34.96
        },
        {
            "text": "it's not even out as I'm recording this, so I have no idea if it's good or bad, but come on, it's The Last Guardian. After a decade, it's finally coming out of Japan and we're going to know if it's even coming close to the pedestal Ico and Shadow of the Colossus are on. Will this tortured game about a bird dog cat thing and its boy tug at our heartstrings or be a gigantic waste of our time and PlayStation's money? Find out on December 6th, or now if you're watching it after December 6th. I hate when you see videos like this and they're talking about release dates and the release dates already passed. They said coming soon, so if you're in the future, hello future, how did the election turn out? Next up is Overcooked. Yep, I'm putting a goofy little game from the PlayStation Network on here, so grab yourself a PSN card before you leave the store. You see, for a long time, old Gamers like me have been complaining about the death of couch Co-op, you know, playing next to a friend sitting on the same couch as you",
            "start": 79.88
        },
        {
            "text": "PSN card before you leave the store. You see, for a long time, old Gamers like me have been complaining about the death of couch Co-op, you know, playing next to a friend sitting on the same couch as you right there besides doing local kind of multiplayer stuff. Well, Overcooked brings that back by challenging you and a pal to chop veggies, cook burgers, and be the fastest short order Cooks around. On top of that, Overcooked gives you some really strict time restraints that'll have you screaming at your bestie in no time, but this is a good thing, I swear. Now, here's where I cheat and say Batman. You say, \"Which Batman game?\" And I say, \"All of them.\" Seriously, 2016 has been a great year for the Dark Knight. You can get your combo meter as high as possible in The Amazing Batman: Arkham Asylum and Arkham City via Batman: Return to Arkham. You can make choices that drastically changed the Bruce Wayne Mythos in Batman: The Telltale Series, or you can become the Bat in Batman: Arkham VR, whether it's action, story, or",
            "start": 119.16
        },
        {
            "text": "Batman: Return to Arkham. You can make choices that drastically changed the Bruce Wayne Mythos in Batman: The Telltale Series, or you can become the Bat in Batman: Arkham VR, whether it's action, story, or immersion, Batman's got you covered. Now, let's toss in an odd little mash-up here. Okay, let's talk about Dragon Quest Builders here. Square Enix is taking the beloved RPG world of Dragon Quest and mashing it up with the mechanics of Minecraft. What we get here is an adorable Builder that isn't super challenging but is super endearing. You create towns, take quests, and even double back for challenges when your adventure takes you to a brand new space. And how could I, Greg Miller, talk about PlayStation in 2016 and not mention Uncharted 4: A Thief's End? Simply put, developer Naughty Dog has delivered another classic here. We end Nathan Drake's story in an epic adventure that sees Sully, Nate, and even a long lost brother chase a pirate treasure and their past. The game's beautiful, the action is fierce, and",
            "start": 159.52
        },
        {
            "text": "classic here. We end Nathan Drake's story in an epic adventure that sees Sully, Nate, and even a long lost brother chase a pirate treasure and their past. The game's beautiful, the action is fierce, and the story, as always, is magnificent. If you've never played an Uncharted before, grab that Nathan Drake Collection, Uncharted 4, and prepare for one of the best franchises in gaming. So those are some of my favorite PlayStation games in 2016, but what are yours? Subscribe to youtube.com/KindaFunnyGames and tell me in the comments of the next PS I Love You XOXO. Until then, it's been my pleasure to serve you. And Uncharted 3 is better than Uncharted 2. Deal with it.",
            "start": 202.32
        }
    ]
}