{
    "id": 2170,
    "video_id": "vBThd44TFcE",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Unboxing The Astro A50 Wireless Gaming Headset - Kinda Funny Games Reacts",
    "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1478883604,
    "duration": 568,
    "transcript_chunks": [
        {
            "text": "Oh there. You want to leave this one? Yes. I've used it a bunch. Okay. What's up guys? I'm Tim Gettys. This is GameOverGreggy himself Greg Miller. Greg. Yeah. Today what are we unboxing? We're going to unbox the A50 wireless headphones from Astro. Now here's A50s as they're known on the streets. They're just called the A50s. I don't think where it doesn't matter where you put the Astro in front of it everybody knows it's going to be Astro. Yeah but I've never heard anyone call them just A50s or I call them A50. I call them I when I was using the A30s I was calling them A30s all the time. You You're alone. So what happened Tim is that we did a little let's play here on YouTube.com/KindaFunnyGames. And what we did was we played that their Battlefield 1 and we we teamed up and went we teamed up with Funhaus and went after the Achievement Hunter guys and did all these different things but it was PC gaming which we are not well versed in and so we sat down with",
            "start": 0.08
        },
        {
            "text": "up and went we teamed up with Funhaus and went after the Achievement Hunter guys and did all these different things but it was PC gaming which we are not well versed in and so we sat down with all these PCs and realized we didn't really have headsets for all of them. Yeah. So Astro would hit us up the A50s and do you want to unbox them? I was like \"Well yeah but can we also get a whole bunch and then just use that?\" And they were like \"Yeah.\" So I've been using the A50s at my desk with my PS4 cuz of course I'm one of the cool kids not one of these PC dorks. And let me tell you it's a really good headset. Well more importantly so there's a whole bunch of different uh options in terms of colors and stuff. You got the Xbox and the PlayStation. PlayStation Kinda Funny blue right? I'm into it. You can see the green ones for the Xbox if that's your thing. Cool. See it's all blue in there. Oh man. So we have PS4/PC headphones that work now with what we want them to",
            "start": 44.08
        },
        {
            "text": "right? I'm into it. You can see the green ones for the Xbox if that's your thing. Cool. See it's all blue in there. Oh man. So we have PS4/PC headphones that work now with what we want them to work with. So when we do another when these Funhaus guys hit us up like \"Hey do you want to come play solitaire or whatever other PC game they play a lot?\" We'll be able to hop right in there and do whatever we need to do. Yeah. Yeah. Based in San Francisco. Didn't know that. Really? Right there. No you can. Yeah. I was going to It's not that I'm I It's not that I'm surprised by that. That's like I thought it was common knowledge. Astro has been really good to me forever. I've always been a big Astro fan. They gave you a hat and a headset. They gave me a hat and a headset. But also no for real like I use that Astro backpack all the time. That's my favorite backpack my travel backpack. I do like for real a long for a long time I used the uh A30s then I moved over to A40s at one",
            "start": 78.56
        },
        {
            "text": "for real like I use that Astro backpack all the time. That's my favorite backpack my travel backpack. I do like for real a long for a long time I used the uh A30s then I moved over to A40s at one point. Really good headsets. Uh what is awesome about these is they're wireless with the MixAmp built in which is a big So start unboxing it. What's wrong? Oh we got Sky Cam. It's a little hard to see. Yeah. Well you open it it won't be as hard. I want to show them. There's cool designs. Oh do do like this. Do it like that. You can kind of see it. You can kind of see it. Okay. Okay. Good. That's right. There you go. Boom. Now top. Hold on. Yeah. In unboxing history I don't know if there's ever been a thing as clean as this. Go back Kev. Yes that was clean. I loved it. So here you go. The wireless A50s. Uh again obnoxious. This is Tim Blue if I ever saw it. It's the blue of your car. Yeah. Go. Not only is it my blue but it's shiny and metallic right? Oh fantastic. Okay so I",
            "start": 113.36
        },
        {
            "text": "The wireless A50s. Uh again obnoxious. This is Tim Blue if I ever saw it. It's the blue of your car. Yeah. Go. Not only is it my blue but it's shiny and metallic right? Oh fantastic. Okay so I have the little stat sheet here. Before I even get to what I want to say is I've been playing Titanfall with them on my PlayStation 4. Obviously I'm using the PlayStation 4 not the PlayStation 4 Slim. You need the optical out for these boys. You plug in the optical out there. The optical outs right there. That's the optical out. You know what an optical out looks like? Great. Good. We're set. Then what you do is you put the optical out into this base station here. Kevin show them. That's where the opticals go. They go bloop into that thing. Then you pull this guy out and you plug that into the PlayStation. It automatically reads it. It goes It goes Kevin now show me. It goes ah Astro great done. Sets all the things up the way you want it. You can jump in set with the surround",
            "start": 154.48
        },
        {
            "text": "into the PlayStation. It automatically reads it. It goes It goes Kevin now show me. It goes ah Astro great done. Sets all the things up the way you want it. You can jump in set with the surround sound. Do all that stuff. But you put that there. You charge them. You pop these guys off. You put them in there. You never have to do anything. They got 15 hours of battery life. You set them right there. Look at me again. What I like about these and something that when I was playing a lot of DC Universe Online with my previous Astro headset that it wasn't a pain in the ass but it was something to worry about. You do this it's muted. You do this the mic's live. Really? Yeah. That's all you got to do right there. Over here you have a clickie for your game a clickie for your voice. You get to balance them off that way. Where are the clickies? Right there. Are these the two clickies? Well yeah. You click one to do one. You know what I mean? What does this do? That one's game. That one's",
            "start": 192.64
        },
        {
            "text": "balance them off that way. Where are the clickies? Right there. Are these the two clickies? Well yeah. You click one to do one. You know what I mean? What does this do? That one's game. That one's voice. So then you mess with your settings over there and stuff. Okay. So now I'm going to go into the actual nuts and bolts of this thing. $300. astrogaming.com. Again if you Astro's been around for a while with gaming the MixAmp built into them. You remember the MixAmps? You have that thing the dial on your thing. Fine but cumbersome. Lots of wires. I like that there's not that many wires going on here. Um we're going to get into this nerd stuff. You might know more about this. 5 GHz wireless transmitter that provides clear low latency voice communication while making headset pairing and charging simple. Do you know about that? Yeah I mean that's just the wireless network. 15 hours of battery life. I'm a fan of that. That's good. Dolby Headphone 7.1 Surround Sound. Perfect.",
            "start": 227.36
        },
        {
            "text": "and charging simple. Do you know about that? Yeah I mean that's just the wireless network. 15 hours of battery life. I'm a fan of that. That's good. Dolby Headphone 7.1 Surround Sound. Perfect. Built-in MixAmp technology I've covered. What was that? Surprised by being seven. Well I mean it's a headset. So you're surprised by it being seven. Why? But now it's it's Well I mean time's passed and now it's got to be seven. Screw down. Just letting you know time. So what's the volume on this thing? Uh there's a wheel right here. Little clicks. Uh the mic I was talking about earlier they call it the Precision Boom Mic. It's a noise cancelling boom mic. I don't talk to anybody online but I know about flipping it up to mute it. Um the new auto on/off conserves battery life when not in use and awakes from sleep mode once the unit is picked up. Also impressive. Cool. Uh this is for you PC dorks. There's powerful Astro Command Center software. You can adjust the noise gate side tone",
            "start": 260.96
        },
        {
            "text": "and awakes from sleep mode once the unit is picked up. Also impressive. Cool. Uh this is for you PC dorks. There's powerful Astro Command Center software. You can adjust the noise gate side tone and mic levels for crystal clear communication. Aftergame volume chat audio mic and aux channels individually to generate custom audio mixes for streaming output. Future A50 headset and base station firmware updates will also uh be accessible via the Astro Command Center. That doesn't happen on my PlayStation 4 so I don't care about it. What's going on? Okay. Well I'm just trying to trying to figure this out here. So you you plug this in USB to Yeah. the wall or to anything? Your PlayStation 4 is what I do. You could do your PC. Got it. Got it. Okay. Okay. So then it charges it. Break out your optical thing. Yeah. It's got a special thing for a mic. It's like what I like to do with it. Have you Did you feel it when you bring it in there? You do that. Yeah. Has a little magnetic ****",
            "start": 301.76
        },
        {
            "text": "your optical thing. Yeah. It's got a special thing for a mic. It's like what I like to do with it. Have you Did you feel it when you bring it in there? You do that. Yeah. Has a little magnetic **** Brings it right like go Sky Cam. It goes **** like that. Locks it right in. You know what I mean? This show is a disaster. What show is this? Reacts. That's not a show. It's a video we do. It's a video series we do. It's not a show. What What time What time and what day to Reacts air on? I don't know. Not a show. Usually 9:00 a.m. Well fair. We have no consistency with anything we do. Uh Colin & Greg Live. Fairly consistent. Yeah. Peace. I love you. It's fairly consistent. You're an You're being mean now. I don't know why you're trying to down Kinda Funny Reacts. I'm just saying it's a video series we do. debatably our most successful video series. No 11 Sex Stuff. Well I mean that's also debatable. So you do that. See? Okay. You got a charging in there. Mhm. This guy goes No I",
            "start": 345.52
        },
        {
            "text": "video series we do. debatably our most successful video series. No 11 Sex Stuff. Well I mean that's also debatable. So you do that. See? Okay. You got a charging in there. Mhm. This guy goes No I did actually I did a backwards section. Hold on. This guy you plug in here. This guy goes into your PlayStation. Then you put that guy into your optical in. He goes into your PlayStation and then out that way. And the PlayStation reads it all and goes \"Oh I see what I have to do. All right cool. You're using this thing. Great. You got to jump in occasionally do some other stuff but it's super simple. Yeah. Two cords there. You Yeah. You're bringing up this charger thing here. You're bringing up this thing. You got an aux out. Sky Cam. Kev. So you can see here there's the where it charges and then it's a switch. But I don't know what that charge does. It charges the headphones. That's what I was saying earlier. They make contact. Uh no. But this needs power to then charge this. Time",
            "start": 393.84
        },
        {
            "text": "and then it's a switch. But I don't know what that charge does. It charges the headphones. That's what I was saying earlier. They make contact. Uh no. But this needs power to then charge this. Time out. No you're all wrong. And I figured it out. Calm down. So this plugs in. Right now how I have it set at my desk these things go to my PlayStation and this one powers it right? Yeah. But if I wanted to wear these while they charged I could plug a separate USB into the charge there and put it into there. Does that have a micro USB? Yep. All right. Oh really cool. Remember that Space Channel 5 girl when she wore headphones? Ulala? Yeah. Hold on. What does it plug into? That guy. There you go. So if you needed to wire it up. Okay. Okay. You think that also gives you an extra USB for your PS4? It says charge. It's pretty labeled. It's clearly a charge. It says USB and yeah USB play and charge port. So I think it's just there to help you play and charge. We try it out. Okay.",
            "start": 438.32
        },
        {
            "text": "for your PS4? It says charge. It's pretty labeled. It's clearly a charge. It says USB and yeah USB play and charge port. So I think it's just there to help you play and charge. We try it out. Okay. Yeah that's just a lot man. Cool. So that's all that. You got the power switch we talked about. You got equalizer switch. You know about equalizing? You like music and stuff. I explain it to me. I don't know what it is. Equalizing is just kind There's three settings. There's three settings. One two three is what it says. Well that's not enough information to really understand what it's doing. But equalizing is usually it's when you play with all the knobs and stuff in terms of like add more treble add more bass add you know the the highs or the mids or the lows all that stuff. Yeah. Uh so I guess three there's just three different settings for it that will in my experience that adds more base. Setting three is the most Okay. So there you go. Well ladies and gentlemen these",
            "start": 488.56
        },
        {
            "text": "Uh so I guess three there's just three different settings for it that will in my experience that adds more base. Setting three is the most Okay. So there you go. Well ladies and gentlemen these are the Astro A50 wireless headphones PlayStation 4/PC Edition. We use them or I use them right now to play Titanfall in the other room. Eventually we'll you'll all use them to make let's plays with other games and stuff where we have to talk to each other. So it won't be like the Battlefield thing where nobody could hear what the hell Bruce Green was saying and we just didn't care. We just did whatever we want. Crash planes into things. Until next time it's been a pleasure to serve",
            "start": 530.64
        }
    ]
}