{
    "id": 2200,
    "video_id": "x7A7Q6KQxGc",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Celebrating Xbox's 15th Anniversary - Kinda Funny Gamescast Ep. 96 (Pt. 1)",
    "description": "We celebrate Xbox's 15th anniversary.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1480341603,
    "duration": 1835,
    "transcript_chunks": [
        {
            "text": "this episode of Games Cast is brought to you by Tipsy Elves. Tipsy Elves, obviously ugly Christmas sweaters, you know what's up. I'm wearing one right now. You can see this. He's half Santa, half horse, all fun. You need to show up to your Christmas what? He's a Sand Tour. I like that. I like that a lot. You can go to tipsy elves com check out all the different Christmas sweater designs like nothing you've seen before. Obviously you got Santa right here. Yeah, I that's the best thing I've ever heard in my life. Kevin, thank you. There's sweaters all about fun, the serious on quality construction. I'm super warm right now. I don't know if you can see it, but I am. I'm feeling toasty when you shopping for ugly sweater check out the other holiday and collegiate attire yourself or as a gift. There's a bunch of adult onesies you can get all your friends. There's also interactive sweaters like beer-pong sweaters and cornhole sweaters. How does that work? Check out the website and find out you can go to Tipsy Elves",
            "start": 0.0
        },
        {
            "text": "onesies you can get all your friends. There's also interactive sweaters like beer-pong sweaters and cornhole sweaters. How does that work? Check out the website and find out you can go to Tipsy Elves comm and enter code teeth check out to get your 0% site wide discount. Again, Tipsy Elves comm using promo code teeth. I can't take credit for Santoor that is just the best name the sweater okay that's it. And now let me tell you about Omaha Steaks. Are you looking for the perfect gift? Let me tell you what for only 49.99 you can get a family gift pack when you go to Omaha Steaks calm and enter code games in the search bar that's seventy seven percent off. But why Omaha Steaks over five hundred gourmet gift ideas and the highest quality cuts and ingredients one-of-a-kind flavor convenient quick shot quick shopping for those in your list age 21 days to unlock the full flavors of the cuts they sent us these steaks Greg Miller cooked him we had a fantastic time Kevin what did you think about our meal",
            "start": 40.86
        },
        {
            "text": "shopping for those in your list age 21 days to unlock the full flavors of the cuts they sent us these steaks Greg Miller cooked him we had a fantastic time Kevin what did you think about our meal that night oh my god there was steaks there's me it was a meet-up Louisa do you remember the pork chop my god the pork chop was amazing so good I love the sauce Instagramming and tweeting about it was such a good time for everybody but right now all my steaks is giving an exclusive savings just for you guys listen to everything that you'll get for less than $50 to filet mignons to top sirloins to boneless pork chops for boneless chicken breast for kielbasa sausages that's how you say that for burgers 10 ounce package all beef meatballs for potatoes all gratin for caramel apple tartlets one Omaha Steaks seasoning packet plus get for additional kielbasa sausage free go to Omaha Steaks com enter code games in the search bar add the family gift pack to your car to get a 77 percent savings it's",
            "start": 87.6
        },
        {
            "text": "Steaks seasoning packet plus get for additional kielbasa sausage free go to Omaha Steaks com enter code games in the search bar add the family gift pack to your car to get a 77 percent savings it's the gift guaranteed to be a hit and man that meal was good I will never forget it Tim now you were too full to try the dessert aha the Apple Apple turnover yeah oh good it was good you guys should try it let me know tweeted me what's up guys welcome to the first ever episode 96 of the Kinda Funny Games Cast as always I'm Tim Gettys joined by the coolest dudes in video games Alfredo Diaz know the other half Colin Moriarty Moriarty out there living line living the life he's at the place right now that's on the back of the nickel he's in real America the back of the nickel yeah there's a little **** house on there's the house oh my god huh I can't even rule out some obscene it's it's a musical idiot too busy making them dollars know what I mean Fredo Diaz Alfredo plays himself joining us",
            "start": 134.96
        },
        {
            "text": "**** house on there's the house oh my god huh I can't even rule out some obscene it's it's a musical idiot too busy making them dollars know what I mean Fredo Diaz Alfredo plays himself joining us once again it's been a long time since you've been on the Games Cast I guess yeah but I popped over and did some trimming on you guys's channel you done the extra life you did you did the Titanfall review for us I did Titanfall coverage for us thank you very much for the homespun and how you been what's been going on ah good I mean this is my season right now all these FPS games are out you intervene all that all the DLC for the games that I've been I've been playing so I just been doing a Patreon and then I've also been doing just the streaming it's been great good yeah well that's exactly why we had you on this episode and also for the sex appeal show the gun show the gun I love the show ladies and gentleman this is the kind of 40 Games Cast each every I hope to talk about video games",
            "start": 197.53
        },
        {
            "text": "why we had you on this episode and also for the sex appeal show the gun show the gun I love the show ladies and gentleman this is the kind of 40 Games Cast each every I hope to talk about video games Nick we show Nicola guns bring in the feelings ice cream scoops we do Sid play games now it's the Flitz gone what was what was there was no look at that there's nothing on it doesn't move show him your Python do the Python why is it Bruce okay you just see that's how you know you've been put into work hashtag gains Wow God's lot going on you go okay thank you thank you Kevin bye dose which you today Kevin is on a secret mission mmm what's heat man first off shout out to Stephen in slur our Patreon producer 10000 months in a row right you are a fantastic human being and we appreciate you a lot I want to give a shout out to Super Smash Bros Melee 15 years ago ok game came out why baby Jesus a game that I wish I was decent at but man do I suck at that game yeah did you play Bailey got in",
            "start": 258.01
        },
        {
            "text": "lot I want to give a shout out to Super Smash Bros Melee 15 years ago ok game came out why baby Jesus a game that I wish I was decent at but man do I suck at that game yeah did you play Bailey got in the brawl and I was terrible but I like that's when like you know we all gathered at Current's house for Thanksgiving and like land partied and then I would like be on the high pedestal with Halo and then Brawl we play Brawl and I would just be terrible and was like man I want to be like yeah you know there was something was bad when I would beat you at a video game yeah made no sense that's not ok because you said you 15 years ago for mailing I was like all right Yammer playing in high school Mike oh no that was Smash Bros 64 Smash Bros I'm old oh man yeah the original Smash Bros I was elementary school Melee it was like that ripe just getting into middle school sure get that tight ass yeah puberty things were hair was grown in weird places yeah it was nuts anyway yeah so shout to Smash Bros",
            "start": 326.62
        },
        {
            "text": "school Melee it was like that ripe just getting into middle school sure get that tight ass yeah puberty things were hair was grown in weird places yeah it was nuts anyway yeah so shout to Smash Bros I also want to give an anti shout out to the fact that I still haven't played Final Fantasy 15 early as of recording this November 22nd we are days away from this game being released we check my emails dill don't believe these people have come to their senses yet no but I'm just really sad because all I want is to play this game you're probably you're probably gonna get it any day now uh-huh and when that happens G is gonna get to watch with you yeah it'll be great that's a game I just wanna eyes on the sit back relax and watch and watch when you play I watch you play Mario Galaxy yeah it was awesome way before Twitch was a thing before Let's Plays were really that big I just said what even a thing that yeah yeah it's at back to Washington Playboy freighter da zone if you know it's about",
            "start": 376.96
        },
        {
            "text": "awesome way before Twitch was a thing before Let's Plays were really that big I just said what even a thing that yeah yeah it's at back to Washington Playboy freighter da zone if you know it's about him can't jump in games you can do a lot of things once there's platforming it's terrible you should have friends like any platform part like got a war a toad friends do it no wonder you don't like the Titanfall single-player campaign alright so going right into it the first topic of the day is the 15th anniversary of the Xbox so last week it is when it actually happened it's also the 15th anniversary of the GameCube but you know we need Colin to talk about that like I feel like it's on me right but I wanted to get you on this show so that we could talk about the Xbox because you you're Mr. Xbox I was afraid or does my life that was my heritage mm-hmm I like I it was weird I grew up like all my friends and I mean like you you guys were on the Nintendo the GameCube he had PlayStation I had",
            "start": 421.65
        },
        {
            "text": "I was afraid or does my life that was my heritage mm-hmm I like I it was weird I grew up like all my friends and I mean like you you guys were on the Nintendo the GameCube he had PlayStation I had this weird path in video games I had a game gear yeah it's like a satyr yeah the Dreamcast what a bad time to jump on Wow and then I have the Xbox and I always felt like the odd kid out right you know what I mean but boy was the Xbox good eye eye eye like Xbox was ahead of its time in so many regards they did so many interesting things that do controller though but the breakaway cable up towards Wireless yeah exactly it was horrible and ugly but then I mean like it did have awesome stuff I mean they obvious I don't know for for me back during that time you know when it came to like playing games with your friends those are split-screen or you're on PC like at a cyber cafe playing CS you know I mean and there's one of the things I wasn't PC gamer back then you know I was all about consoles",
            "start": 467.91
        },
        {
            "text": "with your friends those are split-screen or you're on PC like at a cyber cafe playing CS you know I mean and there's one of the things I wasn't PC gamer back then you know I was all about consoles and handhelds you so you were smart back yeah kid but like you know then come the comes the Xbox I was like oh I could just plug these two together and all sudden like I don't have to put this cardboard between me and my brother so that way he doesn't screen peek me sure sure you know and blood goats it was it was game Jay King to me yeah I mean what's crazy about the Xbox I mean now you think about it as an Xbox just part of gaming but like when that came out it was they were the new dogs go games giving interviews to Time magazine stuff like what the **** why whatever I mean that's the thing though is it's like it was the first time that we saw I mean now this is kind of revisionist history but like a successful American game console developer right like we we've had a Nintendo we've had",
            "start": 520.02
        },
        {
            "text": "though is it's like it was the first time that we saw I mean now this is kind of revisionist history but like a successful American game console developer right like we we've had a Nintendo we've had PlayStation and then Sega and then Seca kind of fell out but the new third was Xbox which is this American thing taking a very very American stance with very American games and it was going up against the PS2 which at that point was PlayStation which meant JRPGs and third-person action games in the Nintendo which meant Nintendo games right right and then on the Xbox it was just like that was really the ushering in of what the modern shooter is on a console like we've of course there's the kind of strikes and the quakes and the Unreal tournaments and stuff on I mean Goldeneye right now yeah but it was the Xbox that really kind of brought in that dual stick 100% when you talk about Halo you're talking about I mean countless a lot of PC ports happened on the Xbox obviously because of",
            "start": 566.67
        },
        {
            "text": "yeah but it was the Xbox that really kind of brought in that dual stick 100% when you talk about Halo you're talking about I mean countless a lot of PC ports happened on the Xbox obviously because of Microsoft and stuff but we saw the Counter Strike I played contract art which I almost lost our French because of Counter Strike say whatever you like yo you want to hang out after you know high school like what hang out like nah man I got clan matches yeah you tell it was that a good time it was just like it was a whole new experience you know I mean like I had my shoes of course like there was the times where I stepped away and I played nachos like blinks or like Crimson Skies like the only flying game I actually like love and cherish is Crimson Skies and then I try Shenmue that was weird for the back to your table you have lying shooters also to Shenmue I'm like what is this what are looking at but um look it's I just I just remember the man that killed my father I just remember",
            "start": 615.49
        },
        {
            "text": "for the back to your table you have lying shooters also to Shenmue I'm like what is this what are looking at but um look it's I just I just remember the man that killed my father I just remember watching like you know picking up my copy of OXM and then you know being excited for my demo disc and all sudden there's all these like ad campaigns for you remember like that Dark Master ad were just like teaching how to set up Xbox Live and it was really cheesy and kind of really bad but there was that whole like commercials and all that kind of stuff and I remember setting up Xbox Live and I was playing like Mecca saw and I was like oh my god I was really shocked because I was a squeaker back then you know I mean I was like voice yeah hi boys balls haven't dropped yet and I remember I remember using because it was a common thing back then the voice mess changer for Xbox Live because I didn't want people to know that I was a squeaker and then I'm over here playing this mech saw game being",
            "start": 661.66
        },
        {
            "text": "using because it was a common thing back then the voice mess changer for Xbox Live because I didn't want people to know that I was a squeaker and then I'm over here playing this mech saw game being super nervous talking to other kids while playing and I had no idea who they were and then all sudden you just you just don't care because I don't try to talk about your mom or something yeah man it's it's such a funny time though because again not only was it just such a weird thing that Xbox was now all of us into console but even as it was happening all the other gamers are like get the **** out of here yeah box like half what we need we are saying yeah let's see how this plays out exactly like killing it like that but once the PS2 came out it's like Sony was a force you know like we're totally in the thing like they have their own neck of the woods to play with so with Xbox it was like you're looking at this launch lineup and it's alright cool you had Halo and that was awesome but I",
            "start": 703.18
        },
        {
            "text": "in the thing like they have their own neck of the woods to play with so with Xbox it was like you're looking at this launch lineup and it's alright cool you had Halo and that was awesome but I feel like if you weren't a hardcore Xbox gamer everyone just kind of looked at and it's like Xbox only has Halo and KOTOR and Splinter Cell and that's up zombie eventually yeah I mean there's a bunch of **** there's the blinks there's the stubs there's the odd world games Jada Empire but then it's like man I was looking back at just what games came out and sparks in like men it actually it had a lot of exclusives that ranged in glam but what's on the Jet Set Radio future I never really got into it there was something about it that it I mean I wanted Tony Hawk and it wasn't Tony Hawk yeah which is the me problem not an M problem but Chronicles of Riddick I was like **** that was a good that game was awesome perfectly amazing back there in that time too and that was the other thing about the",
            "start": 747.22
        },
        {
            "text": "the me problem not an M problem but Chronicles of Riddick I was like **** that was a good that game was awesome perfectly amazing back there in that time too and that was the other thing about the Xbox is that it looked better than the other city yes so it was like that was one of my very few arguments and it was there was multiple third-party games that I would like multi-platform games that I would play on Xbox just because it looked better like Prince of Persia played the entire trilogy because it was a shooting game like she games just felt at home on the Xbox even though that controller was terrible I mean that's the thing like the the Duke was **** horrible the ass controller that first one was a just it was so bad Hema the whole system itself too was just so bulky and now I'm with it when it came out it was a joke you know I mean I never adopted it and I didn't and I it would took a while it wasn't till what my sophomore year of college which would be in 2001 and 2002 mm no",
            "start": 792.38
        },
        {
            "text": "with it when it came out it was a joke you know I mean I never adopted it and I didn't and I it would took a while it wasn't till what my sophomore year of college which would be in 2001 and 2002 mm no 2002 in a 2003 that I had a friend who had an Xbox and like people who were coming on they were freshmen so like they were you know the year below us that for some reason I was clicking with but I remember what how big it was like the form factor didn't look good it didn't seem sexy it didn't seem like they knew what they were doing which wasn't made when you're looking at photos of it was then knock ahead of time that was the thing of like how do you understand how awesome Halo is unless you sit down and play Halo and I mean I think that to me was the the definite moment it was it was Halo and I was late to the Xbox game but I remember like I had a GameCube I had a PS2 and I was totally invested in both of those and it was Current's now brother-in-law at the time just sister's boyfriend",
            "start": 841.52
        },
        {
            "text": "and I was late to the Xbox game but I remember like I had a GameCube I had a PS2 and I was totally invested in both of those and it was Current's now brother-in-law at the time just sister's boyfriend who was just like you guys need to play Halo like you're gonna love this game it's like crazy and it's a whole new like genre for you really like this multiplayer competitive arena deathmatch shooting game yeah where you can play with the multiple Xboxes and we're like 11 and I don't know that this sounds like the cyber cafe that we walk by all the time like we don't do that and eventually I Current got an Xbox I was like man this is this Halo game is really cool and then I got one and we were able to hook them together and like this is video games involving like you always talk about Metal Gear Solid as being a moment where you're like holy **** games can be so much more than I thought yeah and that for us was again it wasn't like there's so many people that had their eyes opened years",
            "start": 879.02
        },
        {
            "text": "Solid as being a moment where you're like holy **** games can be so much more than I thought yeah and that for us was again it wasn't like there's so many people that had their eyes opened years before this but for us it was Halo of just like multiplayer gaming can be so much more than Mario Party and or even more than Goldeneye like there was something to it like the team based things I like being able to play with not just two players 16 players being at Current's house and having split-screen but you're playing capture the flag across some rooms and it's just like there's something about that that was like **** there's something here and that was we talk about you know our age differences and stuff and I feel like for me that was the hurdle and a bridge too far of reading about in that in EGM and seeing it in pictures or whatever but then being like in Illinois and then even into my you know freshman year or whatever I'm the only I'm the hardest hardcore gamer I know I'm I don't",
            "start": 926.72
        },
        {
            "text": "in EGM and seeing it in pictures or whatever but then being like in Illinois and then even into my you know freshman year or whatever I'm the only I'm the hardest hardcore gamer I know I'm I don't pose not gonna buy an Xbox and then are we gonna get everybody together even if we did we're gonna drag TVs together and do this could that could you're a dumb kid you like if the power work with the power to blow a fuse or whatever and uh and you don't I mean I you know I sell a story about one PO and I were playing in C Doble on PS2 when he brought his PS2 over not brought TV downstairs it's not hard it wasn't hard but like for some reason that was the hurdle of like yeah that's fine but I'm fine playing split-screen Goldeneye what my friends want to play something multiplayer yeah it's so funny and you're right it is just like we were just that right age like us being but 11 to 13 it was just like the idea of hey here's this giant the biggest console that's ever existed you're gonna lug",
            "start": 969.11
        },
        {
            "text": "and you're right it is just like we were just that right age like us being but 11 to 13 it was just like the idea of hey here's this giant the biggest console that's ever existed you're gonna lug that thing across cities to go to your friend's house so that all is in one place and we did that **** though you know like it was worth it because it shot us to Hawaii at the time I knew something was different outside of just EGM or I didn't even then I guess an IGN oh you know a GameSpot or whatever when I'm reading stuff online was we're having an antler party sophomore year and a house party nobody's getting drunk and hanging out and being and having a good time and somebody finally like the new kids the new class were like blah blah and then in a blink of eye they were all gone and I was like where did all these guys go and they're like oh I think Kyle Perry's doing a LAN party or whatever like what now they're all playing Halo over there they've got like what how did I not know they",
            "start": 1008.62
        },
        {
            "text": "like where did all these guys go and they're like oh I think Kyle Perry's doing a LAN party or whatever like what now they're all playing Halo over there they've got like what how did I not know they were into this because they weren't into let's play Wind Waker and talk about this and cuz they know me and me and my friends are playing and the other guys are playing you know game keep stuff together multiplayer that way or me slinking off to go play Prince of Persia or something like that they weren't into those games but they were into a first-person shooting let's all go you know do catch a flight to the end of the night yeah man and then then there was that next kind of level where after the initial launch titles and the Halo thing they got into the Xbox Live yeah it was Dreamcast had the online but I think Xbox Live was really the beginning of oh yeah it was a great time like going even back before that though just from my like experiences with a Halo it's way different from yours",
            "start": 1050.83
        },
        {
            "text": "online but I think Xbox Live was really the beginning of oh yeah it was a great time like going even back before that though just from my like experiences with a Halo it's way different from yours because I remember I wasn't my uncle and we went this is like the mission of San Francisco so it's kind of ghetto but this was back when the mission was like a scary place now yeah hipster place yeah that's right hip ster Napa I remember going there and going to his friend's house and like his friends were like the guys that stood on the stoop and hung out all day now I went in everyone's drinking and stuff I'm like oh god this is weird and then they're all playing Halo and I sat down I started like it just connected with me and I loved it and then I remember playing that and that was my experience with like Halo and multiplayer right and then you connect it to the land I remember just seeing everyone's name pop up right like you know you'd have unique rock Akash yeah yeah we'd make our own",
            "start": 1088.52
        },
        {
            "text": "with like Halo and multiplayer right and then you connect it to the land I remember just seeing everyone's name pop up right like you know you'd have unique rock Akash yeah yeah we'd make our own names and our armor would be pn x and like i was like wow this is amazing seeing everyone pile into the lobby and then came like Xbox Live and being able to take that to a whole new level and that's when I discovered clans and competitive gaming and I remember because I was doing Counter-Strike and then on Xbox on Xbox because I wasn't added like some really crappy computer back then although I did try Wolfenstein and it failed eventually I did try CS on that exact same computer I took my grandma's credit card and charged it without telling her any Lou braid out and the CS it even working like a few CS didn't work it did not yeah as back during that during that day but I remember played conflict on the Xbox now as was pretty good and this guy's like yo man do you want like join our team and",
            "start": 1131.99
        },
        {
            "text": "few CS didn't work it did not yeah as back during that during that day but I remember played Conflict on the Xbox now as was pretty good and this guy's like yo man do you want like join our team and like playing at other teams and then I was nervous I was a battle game battle game battles da I think it was yeah it might have been something like a different side but may might have been like super early game battles but I remember send that up and back during that time if you wanted to like talk with other players I remember you had to like or even read a message you have to exit out of the game to look at the message or you all have to pile into the Xbox dashboard and close the game out for everyone to be in there talking to each other and that's where we set up the rules and the regulations and like all right what map who's picking what first and that's where all the fights happened to and yeah I was a good times I'm a blessing like Taillow to matchmaking that's just such a thing that",
            "start": 1177.41
        },
        {
            "text": "and like all right what map who's picking what first and that's where all the fights happened to and yeah I was a good times I'm a blessing like Taillow to matchmaking that's just such a thing that we take for granted now just like oh yeah the matchmaking is a thing but like back then it was like oh there's like a system to make sure that you're linked with other players to play shoddy shoddy snipers snipers like that sounds like damn man that **** was so next level it was it was amazing cuz I played Halo with you guys right and it's one of the things that Kurt and I were we like the best Halo players and you step into this realm or you're playing kids from all over the place right and it just it changed the game like I there was so many different play styles and angles that I didn't know about before I didn't play shoddy snipers until really late until that time and then here came this revolution like ranking system that they brought oh yeah the level 50 **** yeah and that was us",
            "start": 1220.55
        },
        {
            "text": "about before I didn't play shoddy snipers until really late until that time and then here came this revolution like ranking system that they brought oh yeah the level 50 **** yeah and that was us like whoa like this is I'm over here like this is a video game but now I'm sweating like this is awesome yeah so so going off the Halo though so Fable Mecca so and Fable Ninja Gaiden like Ninja Gaiden was one of those games where it was just like it was beautiful and I played it but it was so difficult but that was like one of the Xbox touch tones of like they were trying to not just be the Michael Bay a video game trying to I here's a franchise you know let's bring it back and like the Xbox is here to stay yeah you know I'm Dead or Alive three like Dead or Alive obviously had been around before but I really associate their live with Xbox because of that game and it and obviously beach volley oh-ho-ho that's a ball I spent couple hundred hours of beach volleyball I got really invested into",
            "start": 1261.14
        },
        {
            "text": "but I really associate their live with Xbox because of that game and it and obviously beach volley oh-ho-ho that's a ball I spent couple hundred hours of beach volleyball I got really invested into the outfits oh yeah you would sure that's a Alfredo a smooth Panzer Dragoon Orta not as good as Saga but it was fantastic Steel Battalion that **** thing the controller yeah god there's a hole just that was expensive too that was way too expensive for for me back in that time I'm the best thing is I remember reading about like that was one of those like the magazine things where you would always look at the updates of it you're just like I can't believe that's a real surreal thing that's happening yeah alright and I you yeah it's weird to meet the people who did have that that randomly had stood yeah Wow well you're **** insane and now we have VR it's just like such a next-level Brute Force I play the hell out of that game but that game is terrible yeah I wanted to be so good though",
            "start": 1307.79
        },
        {
            "text": "stood yeah Wow well you're **** insane and now we have VR it's just like such a next-level Brute Force I play the hell out of that game but that game is terrible yeah I wanted to be so good though because back then I was always looking for a reason to be like ha we've got this game on Xbox and I wanted that to be one of those games it was supposed to be I mean that's the problem his Brute Force is one of the the best stories of over heights you know like there's really **** up everything because that game was supposed to be the Xbox **** you to everyone else yep and it just wasn't good I remember when the demo came out and that was when everyone's like oh yeah this it was it was really bad even before then though I was like I bought into the hype I was like oh my god this like drag dead tree of characters and once kind of an alligator and then like oh my goodness there's so much personality looking at that time for like characters because you guys had like you know it's like",
            "start": 1359.87
        },
        {
            "text": "dead tree of characters and once kind of an alligator and then like oh my goodness there's so much personality looking at that time for like characters because you guys had like you know it's like specially with like Nintendo so many iconic you wanted a mascot Tony yeah why didn't someone more than the chief that was the thing man of like when sig and when Dreamcast drops off and Playstations rising in Nintendo's like muddling Wallander it was that thing of there was no clear here's the new console arms race here's who it's going to be this is who it is because Mario Sonic is the iconic one and then from there on out it got weird when they were finally was a winner it was very much like well what happens next and is it and then it chief obviously you know Rosen yeah I mean it's funny cuz like looking at this list it kind of I mean going on there's obviously Blinx the Time Sweeper zombie there was a lot just exclusive Conker Live and Reloaded eventually came out which was a",
            "start": 1404.81
        },
        {
            "text": "cuz like looking at this list it kind of I mean going on there's obviously Blinx the Time Sweeper zombie there was a lot just exclusive Conker Live and Reloaded eventually came out which was a really weird thing Project Gotham Racing the only racing game that I played the hell out of it was great because it was like I don't know it was realistic but kind of rkt at the same time so I was like the perfect balance mm-hm cuz I'm not like neat forever members playing Need for Speed Underground music and everything and I was like I this is fun and then I go to like Gran Turismo I'm like no to much to real to real project Gotham was like that that nice little middle ground yeah and that's kind of what I was saying like there was a lot of multi-platform games that I just kind of went overnight and I think it's just because we happen to have that version so like like I associate Fight Night with Xbox yeah and I don't know why it's probably I think it was available on everything was like",
            "start": 1450.5
        },
        {
            "text": "and I think it's just because we happen to have that version so like like I associate Fight Night with Xbox yeah and I don't know why it's probably I think it was available on everything was like but Fight Night was such an Xbox game to that game look good it did and finite finite it's one of those things that like alright here's a sports game that is gonna have mainstream appeal oh yeah it mainstream to people that aren't sports guys like mainstream game rare appeal which I just didn't exist night it's a whole thing but like fight I did you play Fight Night at all yeah not an Xbox but yeah I play it by name but that's how that was the reach of Fight Night where I was like here's a really great boxing game like I don't walk boxing I'm never giving a **** about you know this is cool yeah yeah and that was the other thing too that as a game that holy **** it was books fan yeah it was a good party game too because it you just say alright the IRA Halo and you get exhausted on that or",
            "start": 1493.19
        },
        {
            "text": "yeah and that was the other thing too that as a game that holy **** it was books fan yeah it was a good party game too because it you just say alright the IRA Halo and you get exhausted on that or you know and then also you bring in like Fight Night and you just have your friends just in the corner of 1v1 yeah and that was the thing right there there was there was a fun factor to that of being was drop in and it wasn't the Xbox version but I remember at IGN when one of the final Fight Nights or the one final the finites that mattered came around where we do like a giant office tournament that wasn't for like a video series it was **** forever cuz everyone had fun man and then Rainbow Six three hmm Rainbow Six that was I want to talk more about the current state of Rainbow like alikum like that I come like later but now Rainbow Six is great and it like it was one of those games where it was a hardcore tactical shooter right so but it wasn't to the point where I was calm he was",
            "start": 1530.54
        },
        {
            "text": "like that I come like later but now Rainbow Six is great and it like it was one of those games where it was a hardcore tactical shooter right so but it wasn't to the point where I was calm he was easily accept like accessible for console players as opposed to like CS which was just I was a very very difficult sure especially on a controller and then he had Halo which was kind of you know just fun and and then came Rainbow which is like in-between it was great because that I remember for me like even though I did clan matches Rainbow was when I was very tactical with my friends you know and it was like we have we have these intense strats over attacking multiplayer in a specific way and I felt like an operative it was cool well the I think the real source for that for me understanding how crazy you are when it comes to these strategies and like working with people with Splinter Cell yeah Spiner self for me I always I love spiracles multiplayer so much and I feel like it's so underrated",
            "start": 1570.92
        },
        {
            "text": "you are when it comes to these strategies and like working with people with Splinter Cell yeah Spiner self for me I always I love spiracles multiplayer so much and I feel like it's so underrated in terms of like just what it is but I also think it's because so difficult just because like here's a game that does really well and that is like I just remember being really competitive and pretty far balanced in terms of like having a first person versus third person and they made that work and you really felt like because when it came in like shooters sure you had like your power-ups and stuff like that but here you had two different characters with different abilities and to me it blew my mind that like you had your spies or they could be anywhere then you all sudden you have like your Merc who had you know motion sensor stuff anything move you can see but then they had gadgets where if you were Merc right and I came sorry yeah I know yeah if you're a merc and you came and smack me as a",
            "start": 1615.85
        },
        {
            "text": "who had you know motion sensor stuff anything move you can see but then they had gadgets where if you were Merc right and I came sorry yeah I know yeah if you're a merc and you came and smack me as a spy you could like talk to me while I'm on the ground passed out or if I had a spy camera and I shot it next to you and you're a merc I could listen in on everything you were saying to your teammate and I was like that was that's a cool idea so yeah the top this one ourselves I remember being on the outside that was the first game I remember being like I wish that had come over I wish we had that I think it's cuz I mean I didn't maybe didn't give a coat or too much time of day because that beat Emma doesn't remember Kotor before Splinter Cell or so but feel like you must have been before I think it was I thought so too yeah but I mean I the reason that Splinter show was appealing to you is because I'm a yeah better than metal yeah exactly new Metal Gear and it's just like that was that",
            "start": 1664.34
        },
        {
            "text": "think it was I thought so too yeah but I mean I the reason that Splinter show was appealing to you is because I'm a yeah better than metal yeah exactly new Metal Gear and it's just like that was that like huh this is interesting and the game was great and then the second one I had in multiplayer right yes the second one there was Splinter Cell and then pet or tomorrow tomorrow added spiders yes yeah that was it again I lost you two like you were just so deep down in that multiplayer that was during the days or like leaderboards were a super big relevant yeah super relevant and that's there like I was like oh top like seven elite over for Counter-Strike yeah top I was number one spy on that one I was just I was gone yeah I'm just gonna keep going at it kind of camera nowhere else opposed it so I just had that but what I really enjoy about this topic is looking back on Xbox I'm like huh I actually think way more fondly of that console than I thought that I did and it's the same thing",
            "start": 1707.81
        },
        {
            "text": "it so I just had that but what I really enjoy about this topic is looking back on Xbox I'm like huh I actually think way more fondly of that console than I thought that I did and it's the same thing like looking back on PlayStation like it's like now the PlayStations existed for 20 years it's like damn they've really had a lot of hits they have characters they have what Nintendo has and you would have never thought about it until you stop and think about it sure and it's like with Xbox I feel like now thanks to 360 and Xbox One that we're gonna look in a couple years look back and be like oh man no Xbox has a lineage like there is already there's a history like it might not be characters but they have Xbox Live you know they have all these like the land party and like they changed things in a way that we're gonna remember that forever yeah yeah same thing like we'll look back with oh yeah that's the thing right is that these new platforms come around and it's so hard to enter a space",
            "start": 1752.22
        },
        {
            "text": "in a way that we're gonna remember that forever yeah yeah same thing like we'll look back with oh yeah that's the thing right is that these new platforms come around and it's so hard to enter a space that's so established and we did it with PlayStation where I was like I'm not gonna give PlayStation the time of day until years it's like alright they're committed to it it's a real thing there's great games and Xbox is the same way of like yeah you know eventually my roommate Parker moved into the Engler house and he had it and I go over and sit in front of his and play G at Empire and then like if I said it went and bought my own and I caught up on Star Wars and I bought caught up on this and I got stubs dissolve it which was amazing see I was a young kid so I just went with whatever my parents gave me so I felt the heartbreak of falling in love with Dreamcast yeah and then just I mean that guy died in front of me yeah suppressing",
            "start": 1791.16
        }
    ]
}