{
  "id": 2189,
  "video_id": "Z8dMQdQBrYU",
  "show_name": "PS I Love You XOXO",
  "hosts": ["Greg Miller", "Danny O'Dwyer"],
  "title": "Rocket League's Success and the Power of Communities - PS I Love You XOXO Ep. 62",
  "description": "No Clip's Danny O'Dwyer fills in for Colin to chat with Greg about the power \"small\" communities have in the current video game climate. Plus, man, there are some BAD PSN game descriptions out there. (Released 11.22.16)\n\nThanks to our sponsor CrunchyRoll! Get a free trial of CrunchyRoll at http://www.crunchyroll.com/kindafunny\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://www.youtube.com/watch?v=QJ6qoZfjJ_I\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\n\nGreg - http://www.twitter.com/GameOverGreggy\n\nColin - http://www.twitter.com/NoTaxation\n\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
  "published_at": 1479833945,
  "duration": 9000,
  "transcript_chunks": [
    {
      "text": "Tim Gettys, what are you doing here? It isn't the PSX panel. No, it's not. I'm here to talk about our sponsor, Crunchyroll. So there's the thing, I thought it would make sense for me to be here because I'm the anime guy, Greg. Yeah, me and Nick, we've been using it. We've been doing some watch-alongs. You can find those on youtube.com/KindaFunny. We watched the first episode of Yuri on Ice. We watched the first episode of Kill la Kill. Fantastic, really into this. So here's the deal, Crunchyroll. Yeah, you asking me questions, Greg? You're like, what is this Crunchy? What is Crunchy? It's anime. It's a place you can get a whole bunch of super cool anime, and some of it released four hours after it airs in Japan. I beat you to the bullet point about it, Greg. Crunchyroll.com/KindaFunny gets you a free 30-day trial of Crunchyroll Premium. What does Crunchyroll Premium get you? It gets you all the newest episodes as soon as one hour after they air in Japan via simulcast, all episodes ad-free in 1080p HD, and",
      "start": 0.04
    },
    {
      "text": "trial of Crunchyroll Premium. What does Crunchyroll Premium get you? It gets you all the newest episodes as soon as one hour after they air in Japan via simulcast, all episodes ad-free in 1080p HD, and you can enjoy it across all the devices: your PlayStations, your iOS, your Roku, all that stuff. Um, if you haven't seen School Days, I recommend it. That's it's quite a head trip, as the kids say. Yuri on Ice, it's going places. Damn sure. I want to hear what you have to say about it. Let us know in the comments of this video, 'cause I want, I, I'll go through one by one, look through the comments, comments, find the comments. Now for the head trip on the first one, is that similar to like The Magic School Bus? No, it's very different than that, especially and very different. Anyways, Crunchyroll.com/KindaFunny, get your free trial. We're going to be doing more live watch-alongs where we watch with you guys, so please let us know what you want to watch. And yeah, until next time, that's all I have for you, Greg. All right.",
      "start": 35.4
    },
    {
      "text": "free trial. We're going to be doing more live watch-alongs where we watch with you guys, so please let us know what you want to watch. And yeah, until next time, that's all I have for you, Greg. All right, let's do a show. What's up, everybody? Welcome to PS I Love You XOXO, Episode 62. I'm one of your hosts, Greg Miller, alongside Trending Gamer of the Year nominee 2016, Danny O'Dwyer, Senpai. Thank, let me tell you, you gotta start begging for votes. You're not begging enough. I know, I'm not. In fact, you're doing more of it for me, so thank you so much to all the Kinda Funny Community for for really rallying behind this. I'm still shell-shocked. Yeah, I was not like, look at the names that are on that thing, right? I know, right? Boogie, Jacksepticeye. Two of the five are Irish. Yeah, yeah, bet that. It's it's about time you guys had some. I know, we're not here to take part, we're here to take over. Yeah. Oh, I I did not take that. That's that's Conor McGregor thing. I'm aware. I know, I know you didn't come up. Come on now, the",
      "start": 78.56
    },
    {
      "text": "guys had some. I know, we're not here to take part, we're here to take over. Yeah. Oh, I I did not take that. That's that's Conor McGregor thing. I'm aware. I know, I know you didn't come up. Come on now, TheGameAwards.com. You can go vote for Danny. What's the hashtag? Because you can just hashtag it on Twitter, right? You can. It's yeah, they had it broken for the first four hours, so if I don't win, it's on you, Geoff Keighley, you son of a bitch. It's uh, I should know this. It's I think it's TGA O'Dwyer. Think about it. Okay, okay, okay, okay. Pin tweet, pin tweet there. Or you just go, yeah, GameAwards.com for Danny. How are you? It's so good to see you. Thank you for coming by. Thank you for having me. Please, it's a pleasure. Uh, of course, it's great to be here. I've been in an editing hole for the past couple of weeks. You're working on Doom right now. Yes. Okay, to bring everybody up to speed, if somehow they miss this, you are Danny O'Dwyer, formerly of GameSpot, VideoGames.com, actually NeoGAF, Giant Bomb. So I know. Hi Danny.",
      "start": 141.4
    },
    {
      "text": "Doom right now. Yes. Okay, to bring everybody up to speed, if somehow they miss this, you are Danny O'Dwyer, formerly of GameSpot, VideoGames.com, actually NeoGAF, Giant Bomb. So I know. Hi Danny. Although appropriate, really. Um, uh, I used to work for GameSpot.com. That is correct. And then I saw, uh, largely informed by what you're doing, I'm just, I'm like a couple years behind on you, the trending gamer thing. Next, I'll be, I'll be getting my pet surgery. Yeah, I was going to say, be careful, don't let don't let your Corgi dogs jump off the back of your couch. Um, yeah, I worked there and then I I I left like two months ago now. It feels like a lifetime. Um, to start Noclip, which is a basically a crowdfunding, uh, video game documentary production house. So we make, uh, not paid for by publishers, we go to publishers, advertisers, no advertisers. We go talk to them. We we make sort of long-form type, uh, uh, documentary, document shorts, let's call them, about games. And then we we like stick everything else up on that channel,",
      "start": 178.48
    },
    {
      "text": "advertisers, no advertisers. We go talk to them. We we make sort of long-form type, uh, uh, documentary, document shorts, let's call them, about games. And then we we like stick everything else up on that channel, like extended cuts of the interviews. And then patrons get like behind-the-scenes stuff. And it's great. We we put up the last of the Extended Cut interviews yesterday. So the Rocket League documentaries, there's two of those. There's three of these like basically two-hour extra long interviews. And people are really liking it. Is Doom, the Rocket League documentary is awesome. You haven't gone to youtube.com/Noclip, get over there, go see it. Uh, so so good. /Noclip video. Oh, sorry, my apologies. Yeah, I just, I, you can you can just search Noclip and it comes up. Yeah, it's like GameOverGreggy. Yeah, it's like you, it all gets the same way. Channel names and shit pipes. It all gets shout at Alexa and it'll come off. Alexa, like, why are people screaming? I left this industry for a reason. I'm not even on your",
      "start": 224.52
    },
    {
      "text": "you, it all gets the same way. Channel names and shit pipes. It all gets shout at Alexa and it'll come off. Alexa, like, why are people screaming? I left this industry for a reason. I'm not even on your side anymore. Let's talk about Crunchyroll. Yeah, we actually, funny story, we just did that. That was the ad that opened the show. Awesome. It's all It's a small industry circle. Exactly, exactly. No, your Rocket League one was fantastic. And it was a great one to come out with, I think, to start with too. Kind of worked. It was like similar kind of like, I don't know, like what they were trying to do was trying to like create this weird type of game for like 10 years and like a sort of a rags to riches kind of success thing, which in a way kind of mirrored what I think we're doing with Noclip, which is like this is the type of stuff I've always wanted to make. And and people really, the community grabbed on to it, passion. Um, yeah, that's the one thing we I think we always share, you know what I mean? For you and I being on",
      "start": 264.16
    },
    {
      "text": "type of stuff I've always wanted to make. And and people really, the community grabbed on to it, passion. Um, yeah, that's the one thing we I think we always share, you know what I mean? For you and I being on this side of the industry, right? Where we're talking about what happens in video games, that's always the common ground when you talk to a developer, right? You know what I mean? They have a passion for what they do. One of our friends was asking me the other day of like, uh, he's getting ready, it looks like maybe to jump out of video game journalism, the whole thing, go to like, why didn't you ever do that? And I'm just like, my passion isn't making games, my passion is talking about playing games. And I was always scared that eventually, because you know what the the through line is, is that you end up working in, and plenty of our friends work in PR or they work in now Community Management. Yeah, some end up being producers, like Greg Caven, GameSpot, ended up, you know, making some wonderful games, programmer as well.",
      "start": 305.36
    },
    {
      "text": "plenty of our friends work in PR or they work in now Community Management. Yeah, some end up being producers, like Greg Caven, GameSpot, ended up, you know, making some wonderful games, programmer as well. Uh, and like I'd come from the world of programming. That's what I that's what I taught, and like web programming and stuff. And I knew it wasn't for me already. I was like, all right, I gotta figure out a way of like doing this that's like not just sustainable for me personally, but also like that like I wanted I wanted to I struggled so hard to get, you know what it's like, struggle so hard to break into the industry, that the one thing I wanted to do at least was that by the time I have to get out of here, to leave it in like somewhat of a better position than when I first came in. Sure. And that's what I felt like nobody was doing this sort of stuff. And it's like, if I could have somebody basically be like the sort of explorer of these stories and go out and tell them, like the Doom is why I'm so",
      "start": 341.56
    },
    {
      "text": "I felt like nobody was doing this sort of stuff. And it's like, if I could have somebody basically be like the sort of explorer of these stories and go out and tell them, like the Doom is why I'm so excited about, because people have been wondering what the fuck happened with Doom for like years, right? And like we're going to be like showing stuff that no, we're, you know, we're not showing everything, but like we're going to be like telling the story from the developers' perspective that would never have been told otherwise, because developers are terrified of interviewers, of course. But like in this like setting, the game is out. They know they've seen the Rocket League one. They know we're not like scalpers for for like, um, sexy headlines. They know we're there to like tell the story the way, not the way they want to tell, that is a final, the way it happened. Yeah, the way it happened authentically. Yeah, right. Without no press spin. And I think, uh, the Doom one is a really good example of like, no,",
      "start": 379.6
    },
    {
      "text": "the way they want to tell, that is a final, the way it happened. Yeah, the way it happened authentically. Yeah, right. Without no press spin. And I think, uh, the Doom one is a really good example of like, no, there would be no situation in which, at least on video, the story would be told otherwise. I feel like written word in games coverage has been great for years, but I do feel like that's been disappearing, right? Like that's the thing, you know what I mean? That's, you know, Colin, you know, he did the, he did the history of whoever, these giant pieces. And then the mandate, not in a bad way, would be though, hey, cool, what's the most interesting things that happened? All right, put out an article before that with that headline linking back. You know, you try to, 'cause the audience doesn't necessarily want to come in. And that's what's interesting about what you're doing is the fact that you got a taste of that at GameSpot, right? You got to do some of these things. You did a whole bunch of great video content there and long-form",
      "start": 418.8
    },
    {
      "text": "interesting about what you're doing is the fact that you got a taste of that at GameSpot, right? You got to do some of these things. You did a whole bunch of great video content there and long-form stuff like this, but not nearly as in-depth as this, at least so from what I've seen so far, you know, better than me. And the fact that whereas you couldn't probably do this giant Rocket League documentary thing at GameSpot and have that make sense for them financially, because they are a business. Yeah, when you break away and we all start going off to make our content piecemeal, the audience gets to vote and decide. And they get to sit there on Patreon, be like, no, here's the money. We would give you. GameSpot would want to put that into some other project, some other piece. Yeah. And then they'd let me know like how how, 'cause then that's like a really malleable thing. Like that Rocket League thing could be twice as long and take twice as long to make, or could be half as long. And and I get to have that like",
      "start": 457.16
    },
    {
      "text": "like how how, 'cause then that's like a really malleable thing. Like that Rocket League thing could be twice as long and take twice as long to make, or could be half as long. And and I get to have that like one-on-one feedback with the audience in a way that's so much more authentic. Like creatively, this is the most exciting time I've ever had in my entire life. Sure. Like it's also like the the hardest working, the least amount of sleep, and probably the most stressful. But it's it's like the best. It's like it's everything you told me it would be like nine months ago. Uh, it what's funny is here you say it's been two months, but it feels like, I mean, that's the thing. I remember this time last year being here, not here, obviously, we're in the spare bedroom, but I mean, being Kinda Funny and talking about blah blah and like Game of the Year. Like, oh God, this time last year we worked at IGN, you know what I mean? Like this two years ago right now, we are working at IGN. And that feels like an alien world, you",
      "start": 491.0
    },
    {
      "text": "blah blah and like Game of the Year. Like, oh God, this time last year we worked at IGN, you know what I mean? Like this two years ago right now, we are working at IGN. And that feels like an alien world, you know what I mean? Like such a different reality that that's so close close, but it feels so far. And I'm looking forward to being that year in more than anything, because so much about what what Noclip is doing is like a promise that there's going to be this vault of like kind of oddly evergreeny, 'cause we're not making that much stuff, but we're making hopefully stuff that's like, and shout out to Jeremy Jayne. I say we because Jeremy Jayne, my producer, is incredible. Jeremy Jayne, absolutely. You sent me the color grade about 30 minutes ago of the Doom stuff. Looking great. Um, I'm looking forward to like, 'cause we have all these like deal, not deals, but we have all these like plans and trips proposed for the next like six months. And they are so exciting. But I, you know, don't want to talk about these things till they're",
      "start": 526.6
    },
    {
      "text": "these like deal, not deals, but we have all these like plans and trips proposed for the next like six months. And they are so exciting. But I, you know, don't want to talk about these things till they're done. So a year from now, I'm looking at like what The Hit List is and being like, oh my fun, if we have all if we actually get all this done, right? That is awesome. So yeah, it's always it's exciting to to get them out. So I'm looking forward to getting the Doom one out. Rocket League and Doom, two hot games available on a PlayStation console. Exactly. See what you did there, Greggy, with PS I Love You XOXO. But so for real though, with all the work you're doing on this, because it is just you, you, I mean, is you got two guys and then you have contractors? Do you have people that are helping you out? Or is it just you two? It's just the two of us. How are you playing games? We have like other people to do like Motion Graphics. That's all like one-off stuff in a while. Do you have time to play games? Are you I have more",
      "start": 566.24
    },
    {
      "text": "two. It's just the two of us. How are you playing games? We have like other people to do like Motion Graphics. That's all like one-off stuff in a while. Do you have time to play games? Are you I have more time to play games now than I ever had a game, really. Because like efficient, I can like be way more efficient with my time now. Yeah. Uh, like one example, my wife works like an odd week. She doesn't work a nine to five, Monday to Friday. Um, so before like I would have to like she would be, you know, the day off during the week that she was not working. I can now take off and now I can work on the weekends where she's away instead of just sort of being on my todd and not being not knowing what I'm doing. And then when it comes to the work stuff at GameSpot, it was like, all right, you going like Mondays are the perfect example. I would go in. Nobody goes into the office, 'cause it's San Francisco, until like fuck 10:00, 10:30, right? Uh, and then, you know, we have a meeting and then it's 11:00 and it's half 11 and it's",
      "start": 602.56
    },
    {
      "text": "example, I would go in. Nobody goes into the office, 'cause it's San Francisco, until like fuck 10:00, 10:30, right? Uh, and then, you know, we have a meeting and then it's 11:00 and it's half 11 and it's 1:00. It's lunchtime. And like now on a Monday, I've gotten up at like half eight and I wander to my office like 20 yards away. Yeah. And by 11:00, I have like done every email I needed to do. I've like started like on the rushes. I've like exported the latest live stream to my own YouTube, because I'm doing my own little YouTube stuff as well. Sure. Um, uh, for fun. Uh, and so like I've have so much more my so much more efficient in my work that I have so much more time to play games. And I'm playing games. I'm playing new games. I'm playing loads of games on my my PS4 at the moment. I'm playing, uh, games on my PC a lot. Uh, I got an N64. I never owned an N64 in my life. I saw you. I saw you when you announced that in had. I was like, holy fuck, that's crazy. It was so much. I'm playing through Ocarina of Time at the",
      "start": 644.56
    },
    {
      "text": "a lot. Uh, I got an N64. I never owned an N64 in my life. I saw you. I saw you when you announced that in had. I was like, holy fuck, that's crazy. It was so much. I'm playing through Ocarina of Time at the moment, uh, on a live stream. And it's like I never have time to do that. And it's great. And it's like informative to me. And it's fun. And it's it's uh, it's like what it feels like I'm in college in a weird way. And it's weird 'cause I'm pulling like 50-hour work weeks, but like I still have all this extra time I didn't have before. Uh, yeah, so I love it. Like it's strange whenever like I would go on someone else's podcast and talk talk about games. If I came came out here or went on Gom and stuff, I'd always have this like two days before I'd be like, oh, I gotta make sure I like play something, play something, have something hot. Whereas like I yesterday I was like, oh yeah, like Titanfall, Watch Dogs, you know, fuck Steep. We played like me and my wife have played more Spelunky the past month probably than",
      "start": 688.64
    },
    {
      "text": "we have any game in the past 12 months. Very nice. Uh, yeah, so it's it's wonderful. Did you find that at all when you left? Or no, but I think, uh, that's been the difficult thing for us. And what I what I like so much about you, like, 'cause it's always grass is greener situation, right? Where I look at you and it's like, man, it'd be awesome to be able to commit to one project, you know what I mean? That is the problem of just like for us, it's back to back to back to back. And there's no gaps in there, you know what I mean? I've been trying to have this thread conversation on our forums with our kids. And it's one of those where I I keep, it's like I'm getting cryogenically frozen where I'm in there and I'm active and I'm talking to you. And then I'm gone for three days. And then I come back in and it's like, okay, I'm",
      "start": 724.6
    },
    {
      "text": "of those where I I keep, it's like I'm getting cryogenically frozen where I'm in there and I'm active and I'm talking to you. And then I'm gone for three days. And then I come back in and it's like, okay, I'm responding. And it's because, you know, like before today was like the not the worst, but it was like our morning meeting that we do every Monday, right? Of like, all right, what's happening? Everybody's little neck of the woods. All right, that's what's happening. Great. I need to book PSX flights, but Colin's gone. I need to get the stories for Colin & Greg Live. All right, we did Colin & Greg Live. All right, now Danny's coming. All right, Colin's not here to get the news for PS I Love You XOXO or the trophies or the thing. So I'm doing all of that on top of. And it's just like I and like today people have been asking me like, hey, what about this or what about that? Like Kevin and Nick. And I'm like, cool, great idea. Can you just email me and put it in the subject line, 'cause I'm not going to remember this conversation.",
      "start": 765.92
    },
    {
      "text": "me like, hey, what about this or what about that? Like Kevin and Nick. And I'm like, cool, great idea. Can you just email me and put it in the subject line, 'cause I'm not going to remember this conversation. But when I get to my desk at 5:00 tonight, I'll totally remember it. Be able to talk to you. I totally see that. Like there's a domino effect that you guys have that doesn't exist with mine, because I basically end up being like a control freak of the whole thing. Um, but then on the flip side, I don't have anyone to offset any work. And and that's the thing. And that's like the checks and the balances of it, right? Because there's more of us, we can do more. And but there's not an endless team, you know what I mean? So like as we look forward to 2017, we keep talking about like we think we have a good plan in place to make fix some of our pain points, to get us not back on track, like we're off track, but bring it in where it's not as crazy, 'cause there's been a few days, uh, in the past month where I have played a game",
      "start": 800.8
    },
    {
      "text": "make fix some of our pain points, to get us not back on track, like we're off track, but bring it in where it's not as crazy, 'cause there's been a few days, uh, in the past month where I have played a game at my desk. And it's, ooh, that's never happened in Kinda Funny. But here we are where you start etching out, 'cause and it's what you're talking about, I think, to an extent of like, I'm a control freak too. And I take, you know, Kinda Funny as a, uh, not my cross to bear, but I mean, we all live and die for the company. And I am very much of the guy like, you got the team on your back. When I know something's wrong, when I when I know that we need to address something, I can't not address it. I need to jump in there. And then that becomes a different another thing to worry about and do all this different stuff. And that's that is easier, I think, when you're on your own, because you know that, oh, it's on me and I'll do it later. It's not like it's there's all this other stuff happening and I I don't have time for",
      "start": 836.08
    },
    {
      "text": "that's that is easier, I think, when you're on your own, because you know that, oh, it's on me and I'll do it later. It's not like it's there's all this other stuff happening and I I don't have time for it. Like for instance, like now I look up my my my um Patreon page and it it it doesn't reflect where we are now at all, because the the like I and I was here the morning of um when we we we launched it. Um, and like it it went past the the top tier that I was expecting. And what that does is it's like, oh my God, that's amazing. But also so it's like, oh, I can change the business plan. Like we can go for things we were going to go for before. So like now we've planned like we've trips to Japan that are already like on on the very near horizon that like were never going to be possible unless without like without like six months of it and being able to put money aside and whatnot. Um, so like that's one of the things I look at. I go, ah, it looks like I'm I'm doing one thing, but I'm pitching another. And I, you",
      "start": 871.72
    },
    {
      "text": "like six months of it and being able to put money aside and whatnot. Um, so like that's one of the things I look at. I go, ah, it looks like I'm I'm doing one thing, but I'm pitching another. And I, you know, hope people know that like we're actually using this funding and it's X, Y. Sure. And that's the biggest thing. I mean, for us, that I think our audience is great about, you know what I mean? The Best Friends is the fact that like, you know, we have the best intentions and they get away from us so quickly. And like our Patreon page, right? Like, uh, in January 5th, our anniversary, we tried to make that my birthday. Hey, great. Both of us born the same day. I know my anniversary too. We tried to make that Kinda Funny Day. And like last year when we did that, we it was very much like, hey, cool. And me personally being like, I'm going to be better about being on Patreon. And I have not been. I've been a little bit better. And I've I've got great people out there helping me like Amy and and her and her friend or whatever.",
      "start": 912.88
    },
    {
      "text": "Amy Gills, what up? Another Irish one there. Um, and so it's like, it's there and people understand what's happening. And like they give us a lot of rope. And but then when they do feel we've neglected something, they're quick to tell us. And that's what I want. I want because I want that's what we always talked about is like Patreon is your feet to the fire. You know what I mean? If you don't like something, you have a very clear mechanism to tell us and vote with your wallet. And try we have to try to fix that. Yeah, reading all that has been like very, you know, interesting and and and it's scary, right? Because like I still have like every YouTube comment, every every every edited, deleted, new pledge, every single one gets a little notification. And I should like I should probably turn it off, but I'd rather have my",
      "start": 947.96
    },
    {
      "text": "like I still have like every YouTube comment every every every edited deleted new pledge every single one gets little notification and I should like I should probably turn it off but I'd rather know then not know and be able to react to it um and you're right it's it's it's I it's funny right because I whatever I think I feel like especially when when I was in the press and we talk about things like Kickstarters and things and you think about people um stretching uh Goodwill as as much as they could and I do feel like that with the amount of Goodwill that exists on that I can very easily see how people would do that um and us being people who like would never in a million years even think about stretching at the tiniest amount um it is super important to sort of have that uh that honest one-on-one communication it's it's one of the few one of because I'm terrible about emails and stuff like that the Patreon message thing is like because I'm lucky right we",
      "start": 983.4
    },
    {
      "text": "of have that uh that honest one-on-one communication it's it's one of the few one of because I'm terrible about emails and stuff like that the Patreon message thing is like because I'm lucky right we don't have a I don't have a separate Forum I've got a Discord chat and we we talk in there and stuff but there's not that many points of contact you guys have a lot more um uh on your Twitch stuff as well and everything else uh that is the that I have like okay if I don't respond to these and like it used to be in like 5 hours now it's like 48 cuz there's like so many come in but like that's the one that I don't neglect more than anything because if somebody's got something they really need to complain about that's where they are and that's been the thing with us is the fact that our community is awesome but it is fractured where it is like the Facebook kids are the Facebook kids and the Reddit kids of the Reddit kids and the Forum kids are the Forum kids and it's like they're all doing",
      "start": 1026.52
    },
    {
      "text": "is awesome but it is fractured where it is like the Facebook kids are the Facebook kids and the Reddit kids of the Reddit kids and the Forum kids are the Forum kids and it's like they're all doing awesome stuff together but the problem is that you know when somebody's mad about something in Facebook it doesn't necessarily get transferred to my Twitter and so by the time somebody's like hey by the way this is happening like what oh you get over there like oh **** like no we weren't knowing I'm sorry it's just this that and the other and and we keep having to the 2017 like we have plans just give us a little bit more just a not time you know what I mean because it's not we're stretching the Goodwill it's just trying to make everyone understand that every hour of the day is accounted for not to mention that it is something like you made a joke about it of like you know I'm there and I'm talking to you on Thursday and I'm having this really detailed Forum thread and then I pick up Portillo's on",
      "start": 1063.92
    },
    {
      "text": "that it is something like you made a joke about it of like you know I'm there and I'm talking to you on Thursday and I'm having this really detailed Forum thread and then I pick up Portillo's on Friday and my day is done I'm shutting down to worry about this right now and try to take care of this and the fact that like it's just real life intruding on your professional life which is your my professional life is my personal life my personal life is my professional life and it's we talk about so much more than video games here and it's just never ending Everlasting go content you and and I think that's where I'm lucky with NoClip away although I do all the streaming stuff but it's no it's nowhere near as as as sort of um uh 360 uh as your guys and stuff uh but like at the end of the day we're making like very I'm making like very I don't know it's about one game and it's one thing whereas you guys are talking about politics and your home life and all this sort of stuff and it's it",
      "start": 1098.04
    },
    {
      "text": "we're making like very I'm making like very I don't know it's about one game and it's one thing whereas you guys are talking about politics and your home life and all this sort of stuff and it's it must be harder to thing of just like you know what I mean of like and I'm not at all complaining I love this job and I love this company but yeah like of like you know last night I was like H I'm going to go to bed well I should watch Westworld I want to be able to keep talking to people I want to engage with the Best Friends about Westworld because they're talking about that and then it's like I'm feeling guilty cuz I'm playing so much Watch Dogs 2 right Danny, I **** love Watch Dogs 2 but it is that thing of like I I turn out my PS4 and I'm like there's that Time Machine VR game on the cross media bar and I still haven't touch Robinson: The Journey it's like oh man and Dishonored sitting here in it steelbook and I'm like yeah I'll get to those eventually like I have to be like same thing with",
      "start": 1135.4
    },
    {
      "text": "cross media bar and I still haven't touch Robinson: The Journey it's like oh man and Dishonored sitting here in it steelbook and I'm like yeah I'll get to those eventually like I have to be like same thing with the content right we can only make the content we're passionate about I can only play what I'm passionate about in that second that's what it's got to be and that's and I think that both of us probably had that exact same responsibility feeling in our previous jobs but it was to the company not to the fans or at least that's what it felt like to me was that like now now it feels like it's at least in a good place like I mean like I'm yeah I understand what you're saying there for me it was yeah I wanted to be able to help anybody I could help and I wanted to be able to if we were going to be if we're working at IGN which is this source of information and this knowledge base like I want to try to it was impossible then it's impossible now but if something comes to PSN I want to know",
      "start": 1170.72
    },
    {
      "text": "to be if we're working at IGN which is this source of information and this knowledge base like I want to try to it was impossible then it's impossible now but if something comes to PSN I want to know something about it whereas like now there's so many games on PSN and also that's we you know this is something that happened with PlayStation 4 Pro launch right it's not really our job to review everything anymore or do it or have like we have opinions about it and I'm basing my opinions on facts and friends and articles and reviews and like do I need to go out and play every PSN game every PlayStation 4 Pro to be like n you know what I mean not for me right now kind of thing who knows it was really weird we had a uh like the Patreon hangout on Sunday uh it was super fun just like two and a half hours of shooting the ship basically and somebody asked me what my um thoughts were on the uh EA sponsorship like Watermark thing that they're doing do you know about this I haven't heard about",
      "start": 1206.48
    },
    {
      "text": "half hours of shooting the ship basically and somebody asked me what my um thoughts were on the uh EA sponsorship like Watermark thing that they're doing do you know about this I haven't heard about this exactly so I was like I don't what are you talking about could tell me what it is and I'll let you know what it is and like before that was like right in my wheelhouse of like games coverage and ethics and and you know all that sort of stuff uh and the fact that like I was like I felt kind of bad was like but it's also liberating right like it is that thing of like I'll say something on Conor GG live and the Twitch chat will correct me and I'm like oh right well again it's this weird thing of like we're not even we're not breaking the news we're telling you right like we're here to commentate with you and take our years of expertise and our personalities and apply that all to it but what you deem that job and I'm talking about from like what I I mean I'm an internet personality when",
      "start": 1245.2
    },
    {
      "text": "with you and take our years of expertise and our personalities and apply that all to it but what you deem that job and I'm talking about from like what I I mean I'm an internet personality when somebody asks what I do right it's like that's a weird thing to say but I'm known for video games and I like video games and people like my opinions on video games but I don't play every video game anymore and people aren't coming to me like Hey where's the Dishonored review you know what I mean they're they're more coming to me as friends and me like you're going to like this game you should play this game why are you playing this game I'm like I'll get to it I get till I get to it it's a weird life now the world of games coverage has totally changed I think this this podcast is a really good embodiment of that or there is there is no ubiquitous like this is what a gamer is anymore and that kind of was before and the only division you would kind of have was between oh did you buy Sega or",
      "start": 1285.28
    },
    {
      "text": "embodiment of that or there is there is no ubiquitous like this is what a gamer is anymore and that kind of was before and the only division you would kind of have was between oh did you buy Sega or Nintendo right or you're one of those weirdos at an Amstrad um or an Amiga uh but like it was now it's just so broad that like to expect people to have that like you you know that cross-platform I remember those days at IGN man when you when you did know everything and you did play everything and you had an opinion about every big and then when it just all exploded where it's like you know like when Game Awards came out and it was uh uh time for us to nominate who should be on the nominations cuz Kinda Funny it was nice enough to be a judge or what or asked to be a judge this time around and like there was like categories when we got to like the game of like a game for social change or whatever and we're like we had like maybe two submissions out of the five and then you get it back none",
      "start": 1317.04
    },
    {
      "text": "like there was like categories when we got to like the game of like a game for social change or whatever and we're like we had like maybe two submissions out of the five and then you get it back none of our submissions made it we're like **** I need to play these games I haven't even heard of these games like where are these games hiding cuz you know you go to PAX and you see these things and you okay this and they're doing that and it's like all right I think I a window but even the window is such a small Keyhole you miss so much that's happening out there and the same is true of coverage where like you know you you've got a really healthy audience like loads of people on all these different platforms I have a like an audience that I'm it's only me and I feel like oh my God that's so many people and it's awesome that they that they care but then you know I was with Rooster Teeth a couple of weeks ago I was I was down in Austin and like they've got their own thing going on and GameSpot",
      "start": 1360.6
    },
    {
      "text": "many people and it's awesome that they that they care but then you know I was with Rooster Teeth a couple of weeks ago I was I was down in Austin and like they've got their own thing going on and GameSpot **** like all over the place and like I think even breaking away has like has allowed me to see how many people on so many different platforms are like engaging with different folks oh totally right I mean I remember the first time I met Rooster Teeth right and it was that thing of Tim like do you know who these guys are I'm like I've heard of them I've heard of Red vs. Blue and then you like you pull back that curtain and see how huge they are like holy **** how did I and then it was the same thing of like yeah like oh Boogie I knew the Francis character and you meet Boogie as an amazing person you look at his reach like oh **** and then like even this year for Trending Gamer it was like okay sure Angry Joe you Lirik I'm like who is oh Lirik is huge okay my bad sorry I didn't",
      "start": 1393.76
    },
    {
      "text": "an amazing person you look at his reach like oh **** and then like even this year for Trending Gamer it was like okay sure Angry Joe you Lirik I'm like who is oh Lirik is huge okay my bad sorry I didn't know that you know what I mean cuz that's how it gets to work and it's the same way whenever I meet someone outside of our industry and they're like well what are you doing I'm like I'm an internet personality like oh you're like PewDiePie I'm like not even remotely close I'm like to a very small group of people very small group of people I'm a big deal to everyone else I'm I'm **** nobody and you know I mean the fact that I've been around it'll be hey you're Trending Gamer 2015 that $ and get your cup of coffee all right but that's the whole thing of like you know you if you know if you're in that not even if you're in that world of gaming if you're in my very specific PlayStation wheelhouse you might know me and you either love or hate me probably whereas like if you're outside of that",
      "start": 1428.76
    },
    {
      "text": "that not even if you're in that world of gaming if you're in my very specific PlayStation wheelhouse you might know me and you either love or hate me probably whereas like if you're outside of that like PC Gamers have like that was one of my favorite things about like life on the outside right and you know it too uh from now going to do NoClip but before that of like I remember when I would go to a Naughty Dog or to a Sony Santa Monica or to any of these places and inevitably developers would come up be like man I listen to your podcast while I work it's so cool I'm like oh man that's awesome that's crazy your games inspire me and here we are you know able to get you through your days and when I went and did the Civ 6 coverage right I walked in there and blank **** faces all these PC guys were like who are you and I'm like oh I did this I'm like I do Kinda Funny and they're like What's that I'm like uh I used to work for IGN like oh we we kind of know you know Steve Butts I'm",
      "start": 1467.12
    },
    {
      "text": "PC guys were like who are you and I'm like oh I did this I'm like I do Kinda Funny and they're like What's that I'm like uh I used to work for IGN like oh we we kind of know you know Steve Butts I'm like yeah I know Steve Butts that's a weird one sure like Steve Butts is the and then it was their testers two of their QA people came over like oh my God we're here testing the game we know you I'm like oh thank you it's Fu it was weird to be here on a PC game strange like weird wheelhouses these micro communities now that but they're the communities that are so awesome and passionate that they can support us and make this happen support you and make your thing happen and that's the other thing that's been crazy for us getting to Patreon early you know before a lot of people did is like it was always that in the beginning it was that thing of like oh it's awesome that uh Easy Allies is going to go do this and you're going to I remember those early days when somebody would go and we'd be",
      "start": 1506.84
    },
    {
      "text": "always that in the beginning it was that thing of like oh it's awesome that uh Easy Allies is going to go do this and you're going to I remember those early days when somebody would go and we'd be like all right watch the numbers here we're going to drop here we're going to drop and it never happened inevitably the numbers seem to go up cuz it's like you're bringing in new people and then they're like those you'll see our kids who are supporting you be like oh Kinda Funny's awesome they'll go for and then vice versa and every you guys were like a huge gateway drug for me into Patreon like I support like I think eight or nine different uh creators on there before I started my own one and yeah it was like of course cuz you're once you're in the ecosystem it's like get it yeah exactly that that's the that was the biggest hurdle for us when we first started is that nobody knew what this thing was oh yeah what am I signing my credit card up for and what's going to happen and how's it going",
      "start": 1543.8
    },
    {
      "text": "the that was the biggest hurdle for us when we first started is that nobody knew what this thing was oh yeah what am I signing my credit card up for and what's going to happen and how's it going to work and yeah it's really weird well Danny we talk about PlayStation might as well this is no we were talking about video games it's all in the same thing if you didn't know ladies and gentlemen this is PS I Love You XOXO it is KindaFunny.com PlayStation podcast it is the number one PlayStation podcast on the internet and it posts every Tuesday at 9:00 a.m. Pacific Time rain or shine is one big MP3 and a YouTube video on youtube.com/KindaFunnyGames or KindaFunny.com for short housekeeping go vote for Danny thegameawards.com he needs you to become this year's Trending Gamer of the Year you **** me on that speech last year I know right **** everyone no no that'll be fine if Boogie gets up there he'll fck knock it out the love you're going to get up there everybody's going be like",
      "start": 1578.16
    },
    {
      "text": "**** me on that speech last year I know right **** everyone no no that'll be fine if Boogie gets up there he'll fck knock it out the love you're going to get up there everybody's going be like what's he saying I can't understand accent what's he oh yeah that happens no matter what that was that was like the funny thing about winning the Trending Gamer thing is like I won it I came off stage then the emotion set in I'm like holy **** this actually happened and I check my phone like 64 messages from friends across like this is awesome and then yeah You' I go to Twitter and like obviously it was overwhelming supportive but then there were so many people saying like like just went on I was like sorry you're getting so much hate and I'm like what are you talking about and you searched it and it was so many thousands of tweets of who is Greg Miller or who the **** is Greg Miller just like not adding me they legitimately like who is this guy why didn't PewDiePie win what is going on I'm a",
      "start": 1617.72
    },
    {
      "text": "was so many thousands of tweets of who is Greg Miller or who the **** is Greg Miller just like not adding me they legitimately like who is this guy why didn't PewDiePie win what is going on I'm a Miller fan it's amazing also remember that PSX is happening it is happening the weekend that first weekend there of December we have a live panel for PSX so Saturday they'll do their PSX press conference we're going to stay behind here in Kinda Funny HQ give you your pre-show your live reaction show and then a post show breaking it all down that'll go up on the PS I Love You XOXO uh threads and forums and YouTubes and MP3 Services uh that'll all be live on Twitch.tv/KindaFunnyGames they post show archive for you then Sunday we're all flying down to PSX we're doing a panel at noon it'll be there PS I Love You XOXO live with me Tim Colin David Jaffe and a bevy of PlayStation faces you will want to be around to see then directly after that we're doing a meet and greet 1 p.m. on site at",
      "start": 1652.28
    },
    {
      "text": "there PS I Love You XOXO live with me Tim Colin David Jaffe and a bevy of PlayStation faces you will want to be around to see then directly after that we're doing a meet and greet 1 p.m. on site at PSX Sony at the time of this recording hasn't confirmed the exact place but obviously we'll be there we'll tell you I think they're going to lead us right over so you can just follow us uh and we can all take photos together outside the BevMo outside the BevMo please we go to Portillo's Portillo's right there Danny you got to go you got to get some hot uh Drawn to Death Scoops yeah Mr. Jaffe I bet I bet it's going to come out during PSX think I think I think that's are they that close I guess they are they in like they've gone quiet they were doing that **** we bitched about it a lot in the show they did that then they went quiet for a long time which is probably going to be good then they came out got the bad news out in front that hey we're charging for it now I guess they're going to be a real",
      "start": 1700.32
    },
    {
      "text": "did that then they went quiet for a long time which is probably going to be good then they came out got the bad news out in front that hey we're charging for it now I guess they're going to be a real game and then they went quiet and I think it's going to be that they're going to come out and be like all right cool we charging for it here's everything you're getting and it's live right now do you think they're going to announce the what what else do you think they're going to announce PSX do you think the uh changing your username is going to be there I mean well I mean like we make that prediction literally every PSX or E3 that it's time it's got to be now did you see the the leak from the Epic or from the Unreal Engine thing yeah yeah yeah and we had actually we've talked about this in passing uh a few months ago now uh an Insider who we can't confirm it or whatever sent us a PDF of a presentation that looked really really real and it was like yeah this is on track and we're announce it at PSX",
      "start": 1743.24
    },
    {
      "text": "a few months ago now uh an Insider who we can't confirm it or whatever sent us a PDF of a presentation that looked really really real and it was like yeah this is on track and we're announce it at PSX but like cool again we're not news guys and it was like we've heard this once or twice we've always thought that but yeah I think that'll be it uh I think you'll see Drawn to Death um I think they'll announce Uncharted DLC there like the the single player DLC but we'll have PSX predictions next week don't worry about that for now let's begin the show with what is and forever will be Roper's Report you got to go I can't it's not my thing it's not my thing time for some singular possessive news Danny hold on hold on this isn't usually your gig no not at all I just I'm just a funny man you get to be the funny man Danny there are eight items on Roper's now say you got to say scream Baker's Dozen! Baker's Dozen! there you go nailed it you're going to be hit with these kids I know number one Danny",
      "start": 1775.32
    },
    {
      "text": "to be the funny man Danny there are eight items on Roper's now say you got to say scream Baker's Dozen! Baker's Dozen! there you go nailed it you're going to be hit with these kids I know number one Danny Uncharted 4 is getting a co-op mode called Survival you can play it co-op or solo it's got challenges a build you build your own Arsenal it's got 50 waves and then from the PlayStation Blog where Naughty Dog wrote every 10 waves culminates in an intense boss battle including our all-new pirate Warlords there's 10 Maps it will be playable at PSX so it's Horde mode it's Horde co-op mode makes it sound like yo you got to play single player you can be no no no it's definitely a Horde mode let me give you the longer explanation okay Survival is a wave based mode where you and up to two additional friends can take on swarms of increasingly powerful enemies and unique objectives one one to three okay you can play solo or you can play with a total of three people okay uh you're going to uh we built upon what",
      "start": 1827.48
    },
    {
      "text": "on swarms of increasingly powerful enemies and unique objectives one one to three okay you can play solo or you can play with a total of three people okay uh you're going to uh we built upon what they did in Uncharted 2 and Uncharted 3 and evolve the gameplay experience with an entirely new level of depth Challenge and variety from new enemy types and Powerful new bosses to a dedicated progression system an expansive upgradable Arsenal Survival is all about strategy camaraderie and skill camaraderie yeah uh Marty uh over at IGN had the exclusive preview as of this uh recording oh cool yeah he says that the way they're breaking it up into the you know it's 50 waves or whatever 10 uh at a time though it feels like there's good like checkpoints in terms of like you're not just doing this forever and ever and ever uh from what I saw in the trailer they put out the pirates look cool it's the Libertalia guys you know has like skull dudes running so it's like one map it's like this is the",
      "start": 1873.24
    },
    {
      "text": "and ever and ever uh from what I saw in the trailer they put out the pirates look cool it's the Libertalia guys you know has like skull dudes running so it's like one map it's like this is the there's 10 Maps oh right yeah no it's fine don't worry it's all it's all just getting delivered to you you're very tired you've been editing nonstop yeah I don't it's not enough to draw me back in I'm not stoked about it I like Tim and I were talking on Colin & Greg Live about doing a let's play of it of course but I'm not a big multiplayer guy and so even Horde mode I en I've enjoyed my Horde mode here or there with the Gears but I'm not in the mood to start a new one and do anything no and it's difficult like Uncharted 4 multiplayer I thought was fun but it's like any multiplayer thing unless you have a group of people who you're playing with on the rag it's kind of difficult to to keep doing it sure for me Horde mode is the same kind of thing where like I really like playing Horde mode on launch because",
      "start": 1914.4
    },
    {
      "text": "a group of people who you're playing with on the rag it's kind of difficult to to keep doing it sure for me Horde Mode is the same kind of thing where like I really like playing Horde Mode on launch because at least you've got enough people who are kind of in that ecosystem already and this to me I I haven't seen how it plays yet but like I would actually be more interested in doing a sort of a Horde Mode equivalent in Uncharted than I would be going back to play more multiplayer but I'd also I I need to find now two people to do it with and if I don't you play by yourself nonstop Horde Mode I think is one of those modes that like cuz I enjoyed the Gears for Horde Mode stuff um I thought the way they sort of like mixed that up with the you know having the the whatever it's called the toolkit crater thing and like banking all the guns and stuff I thought like that was that was a cool evolution of a concept that we've kind of has become a little bit trite like Gears 1 we kind we know what a Horde Mode",
      "start": 1951.8
    },
    {
      "text": "and like banking all the guns and stuff I thought like that was that was a cool evolution of a concept that we've kind of has become a little bit trite like Gears 1 we kind we know what a Horde Mode is now you got to mix it up a little bit and I felt like I feel like okay if they're doing that that's cool but you know I I don't know I'll put a tweet out and see if anyone wants to play with me and if they don't that I want to play with you yeah no the thing about I mean what I'm what I've read you know in passing for Marty's thing and I'm clicking it open here to see is that it sounds like saying Horde Mode is selling it short in the way that there are b a single player it's like more I think it's there's more to it than what Horde Mode would suggest of just wave after wave where there are the bosses there are the upgrades there are building out your ARS actually getting better equipment there is a reason to play it over and over and over again whereas you know not even just that you're",
      "start": 1987.08
    },
    {
      "text": "bosses there are the upgrades there are building out your ARS actually getting better equipment there is a reason to play it over and over and over again whereas you know not even just that you're on the same thing right like not on the same map on nonstop or whatever but yeah you see what he's saying this is Marty over at IGN I really appreciate that Uncharted 4 50 waves of co-op broken up into 10 separate five wave chunks this alleviates the feeling that you have to devote a giant chunk of time and you know experience the whole thing and allows you a bit more progress if you have brief window of playing a time I think you can save and leave is what he makes it sound like that's cool cuz cuz like for instance the Gears 1 is also you know there is a boss after every 10 waves so it kind of feels like they're truncated that way but you can't leave and come back so yeah if you play it solo you have AI companions so you're not like on your getting screwed okay I'm back in now",
      "start": 2027.92
    },
    {
      "text": "it kind of feels like they're truncated that way but you can't leave and come back so yeah if you play it solo you have AI companions so you're not like on your getting screwed okay I'm back in now cuz I'm definitely that loser who like I I like playing with friends like Rocket League is a good example of a game I like to play with friends a lot but like most of the time I'll play a game on my own like I'll happily play Fallout for like 500 hours oh my God no that that was yesterday like it was my f you know uh my mom had been in town yeah Jen had been in town everybody was gone so it was just me and this broken dog and I sat there and played Watch Dogs all day long and it was that thing of I was so much fun and then at one point I got hit up to join just a party of other friends who were playing but not play the game they were all we were all playing Watch Dogs but not playing together and then at the end of the day I hopped on with Scott Lowe and actually did like two hours of co-op",
      "start": 2060.44
    },
    {
      "text": "playing but not play the game they were all we were all playing Watch Dogs but not playing together and then at the end of the day I hopped on with Scott Lowe and actually did like two hours of co-op missions and it was fun but even then I'm like I want to get back to progressing my story and doing all these different things cuz that's where I feel like the most yeah commit can we talk about Watch Dogs 2 little bit oh how about this then okay here we go how about a seamless transition do it second item now because of this question on the Roster Report B doesn't what thank you very much Watch Dogs 2 is going to be video game yes the sales the launch sales are lower than they were last time around than Watch Dogs 1 yeah okay no surprise there but here uh again IGN.com they hit up Ubisoft asked for a statement they got one here we're incred they walked four four streets walk they up they knocked on Stone's window we're incredibly happy with critics and players very positive reception to",
      "start": 2098.96
    },
    {
      "text": "for a statement they got one here we're incred they walked four four streets walk they up they knocked on Stone's window we're incredibly happy with critics and players very positive reception to Watch Dogs 2 which should bolster support for the long-term success of a game the game God I'm screwing everything up it is true that the first day and first week sales for a number of big games including Watch Dogs 2 and titles from our competitors are comparatively lower than previous versions in previous years however we expect both week two and week three sales to be above traditional sales patterns there's a Trends there is a trend toward games especially high quality games having stronger and longer tails is favorable reviews in Word of Mouth spread Watch Dogs 2 is already considered a tremendous addition to the open world action adventure series and we're confident that millions of players are going to love it this is something I've heard from like I don't know",
      "start": 2137.28
    },
    {
      "text": "considered a tremendous addition to the open world action adventure series and we're confident that millions of players are going to love it this is something I've heard from like I don't know if this is a trend that like PR people are talking about or if it's actually accurate but especially from like going off and doing these interviews and and emailing people and stuff this is a trend that I've heard from like easily half a dozen different uh games companies over the past that least do it's starting to matter less and less that the longer tail so like for instance last week you guys you know we do the rundown where you say like oh this is how many games got sold and Rocket League came up and you're like oh that's amazing Rocket League's in there right so like Rocket League has sold more in the past six months than it did the first 6 months which is like you're like what like how does and that's not just like in terms of like the money they I'm sure from the crates and all that",
      "start": 2179.72
    },
    {
      "text": "more in the past six months than it did the first 6 months which is like you're like what like how does and that's not just like in terms of like the money they I'm sure from the crates and all that like just sales they've sold more so and the the week one stuff I've been hearing a lot about this and a lot of people have been saying okay it could have something to do with the fact that you know embargo reviews there's sometimes less of them on some titles or that people are now listening to YouTubers and Twitch streamers more or that sometimes it takes even the YouTubers an extra two weeks to get their eyes on something that's really resonating like they listen to Trends then they like signal boost those Trends and then people are like oh that's that's that's really cool I mean look at the look at how popular things like Early Access are in it like people aren't the the week one launch thing isn't as big as it used to be and I think especially in Q4 when there's so many games out like",
      "start": 2214.6
    },
    {
      "text": "look at how popular things like Early Access are in it like people aren't the the week one launch thing isn't as big as it used to be and I think especially in Q4 when there's so many games out like when did the first what First Watch Dogs I don't think came out during this period might delay right cuz it was going to be a launch title for next-gen and they got pushed back was it a February or something or in my head that's that's no cuz yeah you're right cuz it was going to be remember they had the PlayStation 4 bundle cuz it was going to be there cuz it was a first next-gen game and then yeah no it got pushed and then the same thing happened with Titanfall which was like again Titanfall came out in this like beautiful Easter period or whatever it was March or something where there was nothing either side of it yeah end May 27th, 2014, Watch Dogs did yeah yeah so like what okay pre pre E3 like there's usually a little bit of a one or two games in there right right exactly so and Titanfall",
      "start": 2255.32
    },
    {
      "text": "either side of it yeah end May 27th, 2014, Watch Dogs did yeah yeah so like what okay pre pre E3 like there's usually a little bit of a one or two games in there right right exactly so and Titanfall same thing and Titanfall 2 this year comes out on top of Call of Duty right after it and then yeah it's or sorry two equally good FPS games yeah um so yeah I I you know okay number one PR companies always going to say face you ask them for a quote they're going to give you one that spins it right so take it with a pinch of salt but also yeah that's I've I've been hearing the same thing I it's one of those I don't think we're there yet where you can be like it doesn't matter but I do think that we're moving towards it and I think uh what you see with Bethesda's review policy right that was very much the same thing and I think Bethesda's wording made it seem a bit more like thumbing their knows at traditional IGN and GameSpot right and I think that they're putting they mention reviews in here",
      "start": 2291.28
    },
    {
      "text": "the same thing and I think Bethesda's wording made it seem a bit more like thumbing their knows at traditional IGN and GameSpot right and I think that they're putting they mention reviews in here but in reality I think what they're talking about is the Twitch streamer is the YouTube person especially for a game like Watch Dogs 2 where yeah here hold on I got it in here hold on because I want to I want to bring up something else so here's something else you another Ubisoft story that I have on you this is number six but we're just going to toss it in right now okay this from GamesIndustry.biz oh yeah Brendan Sinclair get done Ubisoft moving away from scripted narrative now I'm just going to read this this real quick article but go give him the click so you have the whole thing uh Ubisoft is changing its approach to story in games in an interview with French newspaper Le Monde published published this week Ubisoft Chief creative officer Serge Hascoët I don't know okay how do you spell it H.A.S.C.O.E.T.",
      "start": 2330.36
    },
    {
      "text": "its approach to story in games in an interview with French newspaper Le Monde published published this week Ubisoft Chief creative officer Serge Hascoët I don't know okay how do you spell it H.A.S.C.O.E.T. I don't know Hascoët you can't you I got I know these French words a lot I know you don't say the last the last letter like the last con so we're going to say soft Hasco Hasco yogging yeah uh said the company will use less narration in its coming games the first hints of the shift are visible in games already on shelves Hascoët has said one of the driving ideas behind the new Ubisoft approach is that each game should be in quote unquote anecdote factory no anecdote factory that an anecdote factory no not not not not antidote anecdote anecdote factory I'm powering through that word but he put that was in quotes I was very I was very concerned about hitting the air quotes not so much the word uh that phrasing was used by Far Cry 4 developers to talk about the game back in 2014 and and also has been",
      "start": 2371.64
    },
    {
      "text": "in quotes I was very I was very concerned about hitting the air quotes not so much the word uh that phrasing was used by Far Cry 4 developers to talk about the game back in 2014 and and also has been used to describe the just released Watch Dogs 2 while both games have larger scripted narratives they provide players with the freedom to engage in that story or go off on their own and the worlds are designed to allow for unexpected things to happen to and around the player Hascoët said initially the worlds in Ubisoft game should be interesting to players even if they just want to inhabit them as tourists for Watch Dogs 2 that meant of San Francisco packed with activities and interesting people Hascoët said the goal is to give players ways to express themselves that will be interesting enough to to justify sharing them with friends while some of the elements of the new approach are visible in current releases Hascoët said the first game to embody the New Direction fully will be the next",
      "start": 2417.72
    },
    {
      "text": "to to justify sharing them with friends while some of the elements of the new approach are visible in current releases Hascoët said the first game to embody the New Direction fully will be the next Assassin's Creed quote for the next Assassin's Creed the designers have created a system in which what I do not only has meaning just now but also longterm my actions will change the world that is very interesting and this is one of those things when you talk about Minecraft when you talk about Rocket League when you talk about the games that have the staying power that week one doesn't matter this is why because I'm playing Watch Dogs at home and it's the first game in Forever that I'm like **** I should probably stream this like I when I'm playing a narrative game I don't understand the point I want I'm in it for the story but when I spend literally 5 hours **** around getting research points and key data and like trying to figure out how to get up places why wouldn't I have that open",
      "start": 2456.56
    },
    {
      "text": "I want I'm in it for the story but when I spend literally 5 hours **** around getting research points and key data and like trying to figure out how to get up places why wouldn't I have that open and talk to people let alone when me and Scott Lowe are playing cuz like I play Watch Dogs very specifically where I'm not killing people I'm hacking I'm using my brain and my computers and my you know my drone and my RC car and then Scott and I start playing and it's like immediately pandemonium cuz you don't know exactly what the other person's going to do we're not so I'm running out the shotgun just blowing people away he's hitting me with a car like all you know what I mean like it's just it is the thing of you know I'm going to come here and give you my anecdote there you go and talk to you about you know the crazy thing we did last night or how we couldn't believe that you know getting up there to hack this computer that I had to choke all these guys out and like then Scott ran me",
      "start": 2494.56
    },
    {
      "text": "you about you know the crazy thing we did last night or how we couldn't believe that you know getting up there to hack this computer that I had to choke all these guys out and like then Scott ran me over with the the car we were stealing like that is what what does the developers always say those water cooler moment exactly water cooler moments in tee but that that is something that I don't think we're there yet but if you look if Trends were to continue and God only knows cuz they changed so quickly I think the fact of yeah like it's PewDiePie or us talking to our community or somebody else doing it that matters more than what happened on day one cuz I do think I was talking to people last night in that group and we are all of the same thing saying holy **** this game's great and does it it has no business being this good especially because it's like it kind of quietly came out when I was talking about what what I was most excited for you know in this second half of the year I was",
      "start": 2529.72
    },
    {
      "text": "it it has no business being this good especially because it's like it kind of quietly came out when I was talking about what what I was most excited for you know in this second half of the year I was like well the shooters will be fun whatever but I'm really looking forward to South Park: The Fractured But Whole ah **** it's like well after Call of Duty what is there after Titanfall for me what was there and people would be like Watch Dogs all right like I'm interested but I don't know if this game's going to pan out it's going to also ran it felt like around exactly yeah it's like what you were talking about with Westworld right where it's like oh I better bet on Westworld because everyone's talking about Westworld right now right and that's what a lot of those like narrative Focus games are like Uncharted 4 right like you want to play Uncharted 4 the first two weeks that games out because everyone's talking about it you don't want to get the story spoiled and if you don't then you go into like",
      "start": 2564.84
    },
    {
      "text": "4 right like you want to play Uncharted 4 the first two weeks that games out because everyone's talking about it you don't want to get the story spoiled and if you don't then you go into like hibernation mode on it and you're like oh I'll play it eventually but but you know I got to wait until I've got like this like one week period where I can fit it in there and cram it in and do all that and story games are amazing and I think what happened with Ubisoft was that with the Assassin's Creed franchise I know you're not too hot on AC right like you guys AC I loved Colin hated Assassin's Creed period I loved the Ezio games with the exception of the last one I was like all and totally love so 2 Brotherhood and then Revelations was right just too much and it was more too much the same that makes sense and I think those were very narrative driven I mean the first one incredibly narrative driven it's it's almost a fake open world game because it's not really open for most of it and then and then",
      "start": 2596.48
    },
    {
      "text": "and I think those were very narrative driven I mean the first one incredibly narrative driven it's it's almost a fake open world game because it's not really open for most of it and then and then when you even doing the missions you're you're doing it the way you're supposed to be doing it it's almost like a Hitman game um but AC and and and Brotherhood were really well-written games with good stories you care about that guy you care totally and everything that's going on there Revelations wasn't 3 wasn't, 4 is when we start to see the open world piratey nature is what people liked about it the story Kenway it wasn't nobody really cared that much right no and that's the thing of I think that when we we talk a lot in all the **** shows we do cuz we just do they all run together about this is a great Ubisoft game and it's not that we're putting them we're saying but I mean they're almost when you say it's a Ubisoft game it's a Far Cry it is an Assassin's Creed it is now a",
      "start": 2631.6
    },
    {
      "text": "about this is a great Ubisoft game and it's not that we're putting them we're saying but I mean they're almost when you say it's a Ubisoft game it's a Far Cry it is an Assassin's Creed it is now a Watch Dogs where it is you're going to get this huge **** world with a million boxes to go through and check oh did I get all did I get the key data have I upgraded this tree have I done that and that is awesome like you know what I mean for Assassin's Creed I like too starting on I liked Ezio a lot but Assassin's Creed 2 I was so into the gameplay of running through and unlocking the Wolf's Den or whatever they were call and beating those and going on to the next one and then when you get Far Cry I remember being that way too and now with Watch Dogs that's the same thing where yeah like this we were talking about this in the chat right of like the story of Watch Dogs 2 is like makes fine Sense on paper we're DedSec and we want to you know take down the man or whatever but it's like what like",
      "start": 2673.84
    },
    {
      "text": "talking about this in the chat right of like the story of Watch Dogs 2 is like makes fine Sense on paper we're DedSec and we want to you know take down the man or whatever but it's like what like what's The Last Story Mission you did I'm like ah you tell me the end of it right now like you know somebody in the comments uh over on because all the questions come from KindaFunny.com/psq spoiled the end of uh the new Call of Duty for me I wasn't there yet and I was like oh I kind of didn't want to know that cuz I do like this for the story I do like what's happening in Infinite Warfare and I'm eventually going to get back to when I finish Watch Dogs but like you can come in and be like oh yeah at the End of Watch Dogs everything gets deleted they go back to the Stone Age I'm like no big deal I'm more interested in getting everything and you know the game hooks the game hooks me not necessarily the story and I think so I think a narrative can like can hamper your enjoyment of a game if a",
      "start": 2711.68
    },
    {
      "text": "I'm more interested in getting everything and you know the game hooks the game hooks me not necessarily the story and I think so I think a narrative can like can hamper your enjoyment of a game if a game is good but I think if you've got something like for instance like the First Watch Dogs was a game that was trying to do a lot and you know it felt like the first version of any game like it felt like the first version of Assassin's Creed some people loved that I love the for AC a lot of people don't like it right but like when I feel like I don't know when a game is that like that and it's frustrating you and also the story has this like total ass like I Aiden Pearce one of the least likeable protagonist ever that was the thing and I think that's what you latch on to and then if The Narrative of talking about that game with other people is this kind of like Downer moment whereas if they when they have these games that are like the open world fun like Far Cry 3 right like Far Cry",
      "start": 2748.2
    },
    {
      "text": "Narrative of talking about that game with other people is this kind of like Downer moment whereas if they when they have these games that are like the open world fun like Far Cry 3 right like Far Cry Primal like Blood Dragon like all these things are just like I couldn't the Far Cry 3 protagonist was some dude who's partying with his friends and then then he starts **** this chick all the time yeah the dude with the Mohawk kills his and but like that's not what the game about the game was about going around like skinning lions and throw Molotovs at people and **** right Alana and I did a let's play for Far Cry we did a series of them whatever and like 5 minutes into the first one We Came Upon a cave and there was a tiger in it and I threw a grenade and he's like that was a stupid idea cuz the Tiger's already rushing me and as the tiger clears the Cave the grenade goes off and he tumbles at us and cartwheels over our shoulder and like the video is Us in just pure joy like what the",
      "start": 2788.0
    },
    {
      "text": "cuz the Tiger's already rushing me and as the tiger clears the Cave the grenade goes off and he tumbles at us and cartwheels over our shoulder and like the video is Us in just pure joy like what the **** and it was like that's all you have to show somebody like why is Far Cry fun here you go it's it's going to be as many hours as you want as just random ass **** like this happening and which and I kind of hate this in a way because it's basically game design as game marketing is what they're talking about but then like that's not to say you can't make a game that will you know like Uncharted for instance which is like the pushing factor for me was was the story like it was like I wanted to know what happened I wanted and you're rewarded at the end with an amazing story finale like it it delivers the story to you at the end and that's the thing nail what you're going for right like the reason you you do you really I think encapsulate what the problem with the original Watch Dogs",
      "start": 2829.16
    },
    {
      "text": "it delivers the story to you at the end and that's the thing nail what you're going for right like the reason you you do you really I think encapsulate what the problem with the original Watch Dogs was is the fact that I don't even know if I ever gave the gameplay a really great chance cuz it was like a this guy sucks like what's he doing BL and I mean I played for like four hours but all I remember from that four hours is him being terrible right whereas Watch Dogs 2 what I remember is yeah the story is bubble gum nonsense but it's fun bubble every everyone in the world is having fun doing what they're doing right we're this group of hackers who have colorful outfits and get to be and I I literally every time I play go to a new store and buy new clothes deck yourself out and like I'm having fun and they're having fun in the St and so then it just I want to go have more fun and spray paint more Billboards and take down more you know do all the different **** I want to live in that",
      "start": 2867.12
    },
    {
      "text": "fun and they're having fun in the St and so then it just I want to go have more fun and spray paint more Billboards and take down more you know do all the different **** I want to live in that world as long as possible and I think a game that sort of encapsulates the I guess the opposite of what they're going for that's out at the moment is Dishonored which is a game which has perhaps I mean it's a Harvey Smith game the guy who designer of like Deus Ex right like the the king of emergent gameplay and all of this amazing like you know player agency and all this stuff but it is wrapped up in a sequel where you play as a character you played before and the daughter of of you know another character so there's there's like there's Nar there's a narrative like mountain to climb to get into the fun part of that game and a lot of that fun part of that game is also front loaded with narrative and explaining and the normal tutorials you get with that sort of system compare that to",
      "start": 2905.2
    },
    {
      "text": "into the fun part of that game and a lot of that fun part of that game is also front loaded with narrative and explaining and the normal tutorials you get with that sort of system compare that to Deus Ex which is a game where you start off JC Denton his brother comes up to him outside the Statue of Liberty says yo you want a **** sniper rifle or do you want this taser you going to kill people or you going to tase them and then you're there yeah and I think like as much as like theor 's I I can't wait to play more of it it looks like a great game I think they're kind of on to something in that within with The Narrative of a game you can kind of I don't know hamper people's ability to at least latch onto in the first place right right and that yeah that's the thing of like you know I when I you know I always call myself a story horror I play video games usually because I love a story and I want to go what on in Watch Dogs I enjoy the characters I'm not really in it to progress right I",
      "start": 2946.4
    },
    {
      "text": "I you know I always call myself a story horror I play video games usually because I love a story and I want to go what on in Watch Dogs I enjoy the characters I'm not really in it to progress right I mean because I want to see what fun joke they have or the Ubisoft you know like the Ubisoft Mission or the the Google Mission they have like they have a lot of funny missions that are cool things but yeah when I started that game and it's like all right cool we drop in I'm into DedSec I this is all like the first seven seconds of the game you know I'm in dead I'm at a party I pass out I have a one night stand I wake up and it's just like what and it's like oh like and then like the first mission I took was like hey man this new trailer dropped we got to come over and watch it I was like oh so it's like hanging out with Tim but we have cool hacker Powers yeah totally this is awesome like that sounds like fun I wanted to talk to you about this cuz I feel like we are uniquely like I feel",
      "start": 2987.64
    },
    {
      "text": "so it's like hanging out with Tim but we have cool hacker Powers yeah totally this is awesome like that sounds like fun I wanted to talk to you about this cuz I feel like we are uniquely like I feel like Watch Dogs 2 is like broken for me because or my experience of it is broken because I'm playing this like you know when you're like you know when you're having like a really boring day at work and you just like you go on Google Maps for some reason and then suddenly it's two hours later and you've looked up every house you've ever lived in your like your primary school the place you went on holidays when you were like 15 like that's what I feel like Watch Dogs do is where I played maybe like 10 hours of this game and I've done like three missions oh sure yeah all I keep doing is like oh my God it's like I'm walking around cuz I live East Bay right so I'm walking around Lake Merritt which I like run around a couple of times a week and like it's like this is like terrifyingly accurate",
      "start": 3022.88
    },
    {
      "text": "my God it's like I'm walking around cuz I live East Bay right so I'm walking around Lake Merritt which I like run around a couple of times a week and like it's like this is like terrifyingly accurate why is it this accurate there's a when you come I was my wife was sitting beside me and I was like I have to show you this this is maybe the weirdest thing I've ever showed my wife in video games we came when you come off the freeway coming into SF from the East Bay you take the exit that the bus usually takes the like it loops around and it goes back underneath the freeway underneath that freeway when I used to work at GameSpot I'd be stuck there in traffic every day so like I've seen the underside of this freeway very it's the most nondescript underside of a freeway you've ever seen there's like a fence and there's a fence here and sometimes there's some homeless people that are intense there and then there's like this other building and it's you come in it's it's identical and I'm like",
      "start": 3061.68
    },
    {
      "text": "like a fence and there's a fence here and sometimes there's some homeless people that are intense there and then there's like this other building and it's you come in it's it's identical and I'm like why yeah why did this happen that's the thing is like so many people get caught up in it where like you know J oh went to see your house and it wasn't there blah blah blah but and like I saw some of our I you know my San Francisco Friends that aren't in our industry you know they like video games and they were like making fun of the map and stuff but like the stuff they get right they have so many touchstones in there just like holy **** I know exactly where I am and this is exactly what this turnoff feels like what the Ocean Beach sign looks like totally or the Cliff House yeah I know I ran a mission there yesterday I was like damn that's weird I was like I got hit by a truck there on my bike like as I was coming down I got to be careful yeah like one to one yeah like I got remember",
      "start": 3099.96
    },
    {
      "text": "ran a mission there yesterday I was like damn that's weird I was like I got hit by a truck there on my bike like as I was coming down I got to be careful yeah like one to one yeah like I got remember how to do that it's it maybe like I would go as far and I've done like I love this aspect of gaming and I've done a bunch of videos about like how much like Liberty City is like GTA and when I moved to California as a big like GTA V fan I was like oh my God is the exact same I think Watch Dogs might be the most accurate representation of a video game City ever nonstop and there are Parts like it is dumb that you're in Japan to the sudden you're at the golden and the the Richmond doesn't exist doesn't exist there one giant Golden Gate Park it goes the opposite direction uh but like aart the parts they've gotten right like I I lived uh down right in front of the Ferry Building really and so like go when I I the other day I was driving and I turned there and coming down Market towards",
      "start": 3139.2
    },
    {
      "text": "the parts they've gotten right like I I lived uh down right in front of the Ferry Building really and so like go when I I the other day I was driving and I turned there and coming down Market towards it and you look over to where like the Noah's Bagels for me used to be I think it's something else now and it's and you got out and I walked across and I walked through the farmers market thing they like the bazaar they have set up before you get it's like this is really well done like this is scar even when you're like AT&T Park and there's the there's a baseball thing right outside Willie Mays yeah the statue is right there and that was one of the things you know being from Chicago when I played the last Watch Dogs that was the one that was kind of jarring for me where I'd go to like Wrigleyville like this doesn't this isn't exactly how this should be you know what I mean not that I have even an inkling of what I'm a suburb kid like what downtown's like but like the touchstones I was",
      "start": 3174.52
    },
    {
      "text": "like this doesn't this isn't exactly how this should be you know what I mean not that I have even an inkling of what I'm a suburb kid like what downtown's like but like the touchstones I was looking for weren't there and that that also was like jarring of like it's not close enough whereas this one feels so good and so you're enjoying Watch Dogs I'm loving it but I feel like I'm loving it in this weirdly like digital vois like house hunting kind of way well but the gameplay is fun as well and I'm the exact same as you I've not killed any well you shotgun those people but I I've uh Co that doesn't count right I I've tried not to do it and I think that's yeah it's it's good fun it's a it's a well-made game Gus Rocket disagrees with us Gus Rocket wrote in to KindaFunny.com/psq just like you can it says I'm a big fan of your work and this week I feel obliged to send you a message I waited with great expectation for the release of Watch Dogs 2 from Ubisoft and after more than 0 hours",
      "start": 3212.44
    },
    {
      "text": "you can it says I'm a big fan of your work and this week I feel obliged to send you a message I waited with great expectation for the release of Watch Dogs 2 from Ubisoft and after more than 0 hours into the game I must say that I am again disappointed with the franchise Watch Dogs was one of the reasons I bought my PS4 in on day one and you all know the result of that game now Ubisoft worked for at least a couple of years on the sequel of the game ended the annual cycle annual cycle of Assassin's Creed to focus on Watch Dogs and again I feel like the game could have been much more than it is I'm having a lot of fun playing it the visuals are amazing and San Francisco is Faithfully reproduced but I'm seeing so many problems and bugs during my gameplay that I keep questioning myself if the game was released before it was 100% ready cars that disappear problems in movement problems in getting in and out of boats problems with sound effects and much more especially in",
      "start": 3253.36
    },
    {
      "text": "myself if the game was released before it was 100% ready cars that disappear problems in movement problems in getting in and out of boats problems with sound effects and much more especially in co-op mode are definitely influencing my experience Watch Dogs 2 could easily be a nine but at this point I can only give it a seven so my question is why is this still happening in the video game industry we see me more and more games being delayed and we usually complain when this happens however there are games with a lot of potential being released with problems is it so hard for a company like Ubisoft to produce a game with the same quality as Rockstar Games does thanks again for your amazing work PS I Love You XOXO Gus Rocket from São Paulo, Brazil all the way in South America awesome so yeah I I think the word expectation is the is the key one on that email I I came in to Watch Dogs 2 with fairly low expectations it sounds like you you weren't really thinking of it as a big Q4 game I was",
      "start": 3293.96
    },
    {
      "text": "I think the word expectation is the is the key one on that email I I came in to Watch Dogs 2 with fairly low expectations it sounds like you you weren't really thinking of it as a big Q4 game I was I was ready for it to be a game that burned me if that makes sense I think Colin and I were both like oh Mafia we loved Mafia III Mafia III is going to be great worried about it Watch Dogs was I didn't like Watch Dogs 1 and I feel like I should have seen more of Watch Dogs 2 already what's going on and then like we did a let's play of it and even then it was like we played for like 45 minutes an hour and just all we did was **** around in San Francisco and I was like this seems fun but I'm still not convinced like the story isn't going to be garbage and make me hate it like it did in Watch Dogs 1 and so it was the opposite where Mafia III were like oh no and Watch Dogs 2 like yeah this is great it's weird expectations a great way it's and I think this is kind of the season of low expectation",
      "start": 3333.56
    },
    {
      "text": "one and so it was the opposite where Mafia III were like oh no and Watch Dogs 2 like yeah this is great it's weird expectations a great way it's and I think this is kind of the season of low expectation I'm not sure if it's because like there was a made of what happened with No Man's Sky and I think that was a big lesson for a lot of people in expectation uh like delivery or not not just from from their perspective I think in terms of I think a lot of the ownership of what happened with that game comes from us as consumers as well is that we do sort of sometimes get I don't know like we too excited about games when when we we should be a bit more tempered with them and I feel like like I think Gus's example is great here right of I bought a PS4 for that game bought for you know never having played Watch Dogs and only having three E3s of demos that always look dramatically different so it's that that's a tough one right and I feel like with with I feel like a lot of people love like I I",
      "start": 3375.64
    },
    {
      "text": "played Watch Dogs and only having three E3s of demos that always look dramatically different so it's that that's a tough one right and I feel like with with I feel like a lot of people love like I I have really enjoyed uh Titanfall 2 I think my expectation of Titanfall 2 were were pretty low and I think that's why I enjoyed this campaign I thought the campaign was was tremendous I've not played Call of Duty much yet s similar kind of thing I think a lot of people are like really hot on Infinite Warfare because to be honest their expectations were pretty low coming off so the past like two Call of Duty campaign-wise Mafia maybe fell on the other side of but I feel like Watch Dogs is another example of they didn't overhyped this game they knew what the **** they did wrong on Watch Dogs 1 uh they got touted out in front of uh E3 audiences too many times really fancy looking demos H I think The Division did the exact same thing for them as well where they they said it was one game and",
      "start": 3415.8
    },
    {
      "text": "uh they got touted out in front of uh E3 audiences too many times really fancy looking demos H I think The Division did the exact same thing for them as well where they they said it was one game and ended up being another game I think at Watch Dogs 2 they were a little bit more conservative this probably says a lot about their week one sale thing as well that like they weren't trying to push this game as to be all end all it come out the AI in this game is **** all over the place I don't care it feels to me like when I play a game like Infamous Second Son where I'm like oh it's it's a playground World we're here to have fun I'm not worried about the fact that if I electrocute this person the person sing 15 yards to the left of them doesn't really recognize it or the card flip something that's janky stuff is I'm I'm okay with that as a consumer but that's based on my expectation that's not based on this sort of uh I don't know what do you want to call it this like objective appraisal",
      "start": 3456.2
    },
    {
      "text": "janky stuff is I'm I'm okay with that as a consumer but that's based on my expectation that's not based on this sort of uh I don't know what do you want to call it this like objective appraisal of what games should be so if that was happening Uncharted 4 right it would have been like what the **** cuz that's breaking the immersion of the game whereas this one the immersion is smash you know I was talking to I think Kevin about it where you talking to Kevin I know it sucks sometimes he's the only one here but we were talking about the Fast Travel System right and I'm like and he's like oh how's it working I'm like you you just hit Square on any building you want to go to he's like oh do they does he get in a car I'm like no they know it's a video game you just warp there you're just there and it's like all right great you know what I mean like you never have to drive but driving is fun so you do and it's the same thing yeah of like the playground when I was running from the cops",
      "start": 3492.64
    },
    {
      "text": "there and it's like all right great you know what I mean like you never have to drive but driving is fun so you do and it's the same thing yeah of like the playground when I was running from the cops and I was hiding this one thing put on like the hacker Vision you know what I mean and people started investigating and I I'm just watching this one guy walk towards me and then justop and just right right in like into the core of the earth I'm like all right I don't know he just went right he's gone forever whatever no big deal I'm I'm I succeeded in the mission I'm fine if that happen in GTA V you'd be like a come on exactly exactly exactly it's whatever you want out of that world so it's weird now it's funny he mentions though that we get mad about delays number three on Roper's Report Persona 5 has been delayed again April 4th 2017 the Silver Lining here that fans are going to get dual audio on PS4 and PS3 so you get your Japanese voice track it will be free DLC I told it was like",
      "start": 3527.48
    },
    {
      "text": "Persona 5 has been delayed again April 4th 2017 the Silver Lining here that fans are going to get dual audio on PS4 and PS3 so you get your Japanese voice track it will be free DLC I told it was like it's coming it in stereo we're not going to go mono you can actually you know this is why we're delaying it to make sure this happens no you get the Japanese voice track it'll be free DLC uh that will be out day and date I think it's just the way the game's already probably been put on disc already that they can't just put it on there and you get a playable demo at PSX which is news which because nobody's been playing uh that one when was it supposed to we were pretty close right cuz I know people who would like orders in right no no that was the thing I had a huge P.O.W. Wing bet with Alexa Ray Corriea last year that is that right because it was last year at Extra Life she brought all those wings right oh she made good on it then so yeah it was one of those things that they've been dodgy",
      "start": 3560.88
    },
    {
      "text": "Ray Corriea last year that is that right because it was last year at Extra Life she brought all those wings right oh she made good on it then so yeah it was one of those things that they've been dodgy about this release state for a while right and so but it did seem like they were finally committed it's going to be Valentine's Day everything's going to be great that's what it was yeah and like and then yeah no and and it sucks cuz it's already out in Japan so it's like oh man we got to wait even longer but the thing I'd like to argue with Gus is he says you know we get these games come out they're not perfect then delays happen and we get mad about them I don't think it's people getting mad about delays as much as it is people getting disappointed it's like I just want to play Persona as soon as possible and so I'm not mad at them for delaying I'm assuming they're delaying because there's something wrong they something isn't isn't on track I'd rather them take the time to not have",
      "start": 3598.88
    },
    {
      "text": "as soon as possible and so I'm not mad at them for delaying I'm assuming they're delaying because there's something wrong they something isn't isn't on track I'd rather them take the time to not have people fall through the Earth cuz Persona is a game for me that is immersive story I'm having these relationships with people I don't want there to be some game breaking bug when I go to the Velvet Room that then locks me out of this relationship right and Gus talked about why can't everyone make games like Rockstar talk about Studios delaying games Rockstar have delayed I I can't I can't think of a game they haven't delayed in the past number of years and I think like Red Dead 2 is a perfect example of they say it's coming out Christmas next year will it will it when it comes out it'll probably be pretty solid technically and hopefully it'll be as good as uh their their previous couple of games um and we'll have another Classic on our hands but like if it's not then they'll probably",
      "start": 3643.72
    },
    {
      "text": "be pretty solid technically and hopefully it'll be as good as uh their their previous couple of games um and we'll have another Classic on our hands but like if it's not then they'll probably delay it and then you know hopefully it'll it'll it'll be quality-wise up to scratch and I mean the big part of it too is I think maybe people just pulling the trigger too early on putting dates on everything because dates push pre-orders which pushes Revenue which does this which makes you look better to the board and investment and da da and it's like I mean you look at Persona and I'm not I'm sure I've fooled you I don't have a good business Acumen so I don't know if maybe like putting the Persona date on where I thought was originally in a Target but then with the whole Sega thing was going on they wanted to look better and more approachable and healthier investment they've pushed it into the into the earlyer so you can be in Q1 now as well a money exactly exactly there's all these different",
      "start": 3680.44
    },
    {
      "text": "wanted to look better and more approachable and healthier investment they've pushed it into the into the earlyer so you can be in Q1 now as well a money exactly exactly there's all these different reasons why games get moved around because there's the business side of it but yeah maybe the Silver Lining perhaps Silver Lining but another positive aspect of what Ubisoft is saying in terms of like if day one sales aren't that important then maybe pre-orders aren't that important cuz that's literally the only reason for that stuff is to get make sure that you know with the rise of digital sales it's always going to ease that because so much of the pre-order stuff has got to do with the relationship between the Distributors the the Publishers and and who they Distributing physical copies of the games to getting copies of the games in getting pre-orders means they can like try and sell more boxes to the stores so they'll have more store space they'll have more of a marketing push like",
      "start": 3718.32
    },
    {
      "text": "of the games to getting copies of the games in getting pre-orders means they can like try and sell more boxes to the stores so they'll have more store space they'll have more of a marketing push like there's all these other things that happen which don't matter to most of us right and if we're now talking about digital sales being like 30% or something of the honey pot when like a couple years ago it was like five right if that's happening then hopefully there's less and that sort of scummy nonsense going on um at least that's what I kind of hope cuz I'm not super much of a fan of pre-order pre-ordering games I think that that contributes to this whole problem of expectation management and uh and and slippage and all that yeah and it's that weird thing of like uh there was a question back here that I think I actually asked as we were going I think yeah I think it was Dave here hash Squid Dog his Kinda Funny Forums thing but he he was talking about the fact of like yeah you",
      "start": 3753.4
    },
    {
      "text": "know that games sell Colin always says games sell most the best within the first 2 to 3 weeks but that's not a great system you know and he says here so what can be done to change this culture and I think the thing is continuing to buy games you know wait not pre-ordering games waiting till you get your reviews or a trusted personality you agree with or your friends say they played it and they like it and this is why you should buy it and go out and do that and and and part of this on the developer side is the fact that they are like we're talking you know Uncharted have added in their sort of survival survival mode right uh a really good example of this is Grand Theft Auto Online which has made them a shedload of money and you think about that that game came out 3 years ago years ago like you're",
      "start": 3792.88
    },
    {
      "text": "survival mode right uh a really good example of this is Grand Theft Auto Online which has made them a shedload of money and you think about that that game came out 3 years ago years ago like you're talking about those charts it's consistently on those charts and this is what we're talking about is if you can have something going where every day a new gamer looks at a YouTube video of of the Achievement Hunter guys playing Grand Theft Auto Online like you **** it I'm going to jump in I'm gonna buy Grand Theft Auto just to play that and and there's something about I don't know what it is but there's something about the Evergreen nature of those games like Minecraft right nobody looks at Minecraft and says oh that's that game that came out six years ago right but you look at like I don't know take a pick like the first Tomb Raider game like no one's going back to play the first Tomb Raider game because it feels like an old game because so much maybe it's to do with the marketing around it",
      "start": 3829.96
    },
    {
      "text": "take a pick like the first Tomb Raider game like no one's going back to play the first Tomb Raider game because it feels like an old game because so much maybe it's to do with the marketing around it and it feels like it's a 2013 2014 game oh you're talking about the Remake okay yeah Rise of the Tomb Raider sorry not not not old old school PS1 you're talking about just Tomb Raider period Rise of the Tomb Raider is the new one oh sorry yeah why the Tomb Raider what was the other one called Tomb Raider oh was it just called Tomb Raider yeah the one the like the yeah the the reboot and the ponytail and yeah exactly Camilla Luddington Tomb Raider um the Luddington universe we call and that comes out like the Lu that comes that came out like years after those types of games and like Rocket League is another example right like I don't look at Rocket League now and think oh that's such a 2015 ass game they've added so much to it and it's it's kind of there's no face to it and there's no",
      "start": 3868.96
    },
    {
      "text": "Rocket League is another example right like I don't look at Rocket League now and think oh that's such a 2015 ass game they've added so much to it and it's it's kind of there's no face to it and there's no marketing spin to it that it feels like I don't know it's it there's more evergreeny and watch like that too we're always talking about games as platforms right right and that's the thing is like yeah like you know I always used to talk about at IGN like if I didn't have to review and cover everything back then I would have been like primarily playing DC Universe Online and then AAA stuff right cuz I loved that Universe in that game and it's the same thing yeah when you meet a Rocket League player there's a rocket that's a Rocket League player that's whether in Minecraft is the same way WoW is the same way and yeah certain games like and Grand Theft Auto Online is the same way will Watch Dogs be that we'll see I don't I don't know you know especially cuz multiplayer is still broken which",
      "start": 3909.56
    },
    {
      "text": "the same way and yeah certain games like and Grand Theft Auto Online is the same way will Watch Dogs be that we'll see I don't I don't know you know especially cuz multiplayer is still broken which it's funny that we we don't even mention that game so much fun I'm having all this time oh yeah seamless multiplayer still completely broken how many games I had to play multiplayer any but it's that thing of like I don't know people who are really looking for that like I'm going to do it for the trophy I want to you know I think I'm going to I'm trying to Platinum Watch Dogs I always say I'm going to platinum a game and then get pulled away and never get back to it but like stop topping that mayonnaise jar I did that already that's done please I got that taken care of please I did that twice I got on PS4 and Vita oh yeah I'm a horrible on Vita as well oh yeah Cross buy 99 Cents you get two Platinum trophies out of it that's that's that's money stop it stop upselling that's don't worry there's another",
      "start": 3948.24
    },
    {
      "text": "I got on PS4 and Vita oh yeah I'm a horrible on Vita as well oh yeah Cross buy 99 Cents you get two Platinum trophies out of it that's that's that's money stop it stop upselling that's don't worry there's another terrible game somebody wrote in about but yeah like you know that's the thing is if you can get people on that thing and how do you change the culture don't pre-order and then reward developers you think are doing right like we always bring up Colin and I on the show that you know we're lucky we get all these games for free right when I get a game for free whether it be The Witcher or whether it be Watch Dogs and I get into that game and really really **** dig it I buy the season pass right and it's one of those things of like I maybe like I I wanted the American bundle and like the American all the **** he had right and so like it wasn't even included in the season pass turns out cuz it was convoluted but I bought that again too it's one of those I don't know if I'll ever played the",
      "start": 3978.6
    },
    {
      "text": "all the **** he had right and so like it wasn't even included in the season pass turns out cuz it was convoluted but I bought that again too it's one of those I don't know if I'll ever played the season pass stuff but I was enjoying it enough that I wanted to do that I did that for that I did it for uh The Witcher and I did it for The Division now my obviously experience and why I'm doing that is different than yours right those developers didn't get any money from me when I from the game maybe they you know maybe you guys hear it and go and buy the the game I'm talking about but that for me in my head is like man you guys are doing it right yeah here you go like I've put in so many hours into this and I really dig it will I get to that content probably not like The Witcher I never even finished the **** real Witcher campaign let alone Blood and Wine and all that stuff but it was like **** yeah here's the money I believe in what you're doing and it's so funny when I talked to Marcin Iwiński",
      "start": 4016.24
    },
    {
      "text": "**** real Witcher campaign let alone Blood and Wine and all that stuff but it was like **** yeah here's the money I believe in what you're doing and it's so funny when I talked to Marcin Iwiński and those guys over at CD Projekt a couple of years back like the idea that they were releasing all this stuff for free the 16 free pieces of DLC they said was this alien concept he talked to them about it and they're like you know they grew up like Distributing games behind the bloody wall you know in Poland like back in the late the mid mid to late 80s and like they're like of course you want to like you want to add added value it's no skin off our back to like make this stuff and give it available to people and it's like the difference you have between that and what the and this has nothing to do with the developer Turtle Rock but like the way that was marketed that Goodwill goes a long way and like back then it seemed okay for Evolve to do it what it did and it seemed crazy for for CD Projekt",
      "start": 4050.6
    },
    {
      "text": "do with the developer Turtle Rock but like the way that was marketed that Goodwill goes a long way and like back then it seemed okay for Evolve to do it what it did and it seemed crazy for for CD Projekt to do it did with The Witcher and now we live in a world we know that's it's changing and it's changing because people who play games got vocal about it and stopped buying into that nonsense and hopefully we're going to have a a much more sort of gamer friendly uh marketing to for games uh in the future as a result of that and you can look at those communities right and see the same thing we were talking about with our communities right where The Witcher community is The Witcher community and it's like you may have played that game and been like all right great and moved on and there people I still I'm on the rich sub to The Witcher Reddit right so every day there's new cosplay and new this and new theories and new comic strips and it's like people are **** all about that it's part",
      "start": 4085.76
    },
    {
      "text": "I still I'm on the rich sub to The Witcher Reddit right so every day there's new cosplay and new this and new theories and new comic strips and it's like people are **** all about that it's part of that is the fact that it's the same way they feel like they're in the ground floor with us that we're good people giving them good content CD Projekt Red puts a thank you note in their **** game to people you know what I mean like that goes a long way with people and in a weird way I'm sorry I'm trying not to make everything talk about NoClip but in a weird way that's what what we're doing TheGameAwards.com Trending Gamer 2016 it that's what makes like us doing crazy retrospectives so much more palatable as well is that like the Rocket League community went crazy when we did this stuff it's like that's so cool because it's not like we're just posting a like for instance a GameSpot we'd like post gameplay clips and whatever it's they're not going to care about gameplay clips they",
      "start": 4125.68
    },
    {
      "text": "it's like that's so cool because it's not like we're just posting a like for instance a GameSpot we'd like post gameplay clips and whatever it's they're not going to care about gameplay clips they they've got way better game clips that them playing but like this sort of like curated thing um now we have this world where there are communities like that for individual games that are longlasting you know look at The Division you know what I mean like look at all the like Dye look at Alfredo like look at look at what's happening here with like people who are like just so into one game um and before you could have one of those and it was called World of Warcraft and now there's like dozens and dozens of them yeah and it's awesome but then you get those micro communities but yeah like especially for you when you can go do a documentary about them those people are going to come out out of woodwork to support it you know we did a for the new Sonic game right we did an exclusive U let's play",
      "start": 4164.96
    },
    {
      "text": "for you when you can go do a documentary about them those people are going to come out out of woodwork to support it you know we did a for the new Sonic game right we did an exclusive U let's play or whatever we really some characters and then let's play went through the roof because all the Sonic people came out and they're like oh yeah totally thanks for showing us new content you know it's awesome and there are probably Community that's used to like getting dumped on sure yeah ex by Colin number four on Roper's Report this is a quick one okay Time says PlayStation VR is one of the best inventions of 2016 the quote reads in order to access the most Cutting Edge virtual reality people typically have to Shell out thousands of dollars not just for the headset like the the $800 HTC Vive but for a computer that's powerful enough to support it Sony's PlayStation VR by contrast is designed to work with a console that millions of people already own the PlayStation 4 yeah what's your",
      "start": 4198.88
    },
    {
      "text": "but for a computer that's powerful enough to support it Sony's PlayStation VR by contrast is designed to work with a console that millions of people already own the PlayStation 4 yeah what's your thoughts on PlayStation VR we talked about it I have not used much of it I don't own one yet I own a Vive but to that point I had a friend or this is happens all the time right is like you know when you have people over don't play games and then okay when the Wii came out right every person that came over to your home you got to try this let's play tennis right it's your grandmother whoever right so the the thing is happening now whenever we have somebody over we have to clear out all our bloody furniture and then stick them in the sweaty headset and and give them a go usually doing the archery in like the the Steam Lab thing um and we one of our our friends over and uh her uh she played this thing she was like oh my God this is like within 10 minutes she was like this has gone from like",
      "start": 4239.72
    },
    {
      "text": "in like the the Steam Lab thing um and we one of our our friends over and uh her uh she played this thing she was like oh my God this is like within 10 minutes she was like this has gone from like this is will be a weird thing to I need to buy this for my family and she was like how much is it and I was like basically including like postage you're talking and tax It's a grand right um and she's like whoa okay that's a lot and I said yeah and you also kind of need to have a PC that runs it and her son um when I built my PC earlier I guess almost a year ago now um I cobbled together all the parts of my old PC and I gave it to her son and it's not like it'll play like you know Skyrim and Fallout it's not like a beefy machine or and she's like oh could it would it play on his machine like sorry it barely it barely works on mine I just actually got a 1070 a couple of days ago and now it actually does work properly um so yeah it's a huge huge barrier to entry but one of the things I said to where is",
      "start": 4274.96
    },
    {
      "text": "barely it barely works on mine I just actually got a 1070 a couple of days ago and now it actually does work properly um so yeah it's a huge huge barrier to entry but one of the things I said to where is they don't actually own a PlayStation but I said if you own a PlayStation you'd be within $400 of an experience which is not as good as the Vive but is like not bad it's it's like a third of the way there some people are saying it's like half as good but I feel like you actually get quite a lot out of it I I mean I agree we're big PlayStation VR fans here and my mom just came to visit and we did a let's play here that'll be up on Wednesday Kevin I'm oh well yeah but we're not gonna put it live in the middle of the night right why not no rules yeah but I well because then it's just the eyes on it you know what I mean people expect our content at 9:00 a.m. but this this show sucks up all the the oxygen on Tuesday oh really so then you got to I well yeah you don't want my I don't want to",
      "start": 4319.52
    },
    {
      "text": "on it you know what I mean people expect our content at 9:00 a.m. but this this show sucks up all the the oxygen on Tuesday oh really so then you got to I well yeah you don't want my I don't want to compete on program yourself exactly exactly anyways it'll be up Wednesday on KindaFunny.com and uh no that was the thing of her thinking it was going to be goofy or dumb or whatever and then putting on and being like this was actually really cool like you can see her turn like it's the same thing like I think we all do where she's like oh my hands and she's like oh the floor and like all the little things before she even gets into the game to be a part of it right it's pretty cool um a couple weeks ago we asked what are you doing are you still using your PlayStation VR because people had kind of stopped talking about it uh we got a response here from Junior Jackson who says hi Colin and Greg hey you call for this one there you go what's up hey what's up Colin Moriarty that's not his that's",
      "start": 4361.76
    },
    {
      "text": "kind of stopped talking about it uh we got a response here from Junior Jackson who says hi Colin and Greg hey you call for this one there you go what's up hey what's up Colin Moriarty that's not his that's not Dave Lang accent hey what's up boy it's Godlike last week's episode you asked us to ride in if we were still playing PSVR so I wanted to give my take on it I've been playing PSVR since day one and I jump in as much as possible I spend at least an hour on it every day trying new games or playing ones I already purchased one thing that my family and I have found very entertaining is playing The Playroom VR together I hope some PlayStation VR users and PS I Love You XOXO listeners check out this game to play with their families love from Colorado Junior Jackson I mean it's like I feel like if you haven't used any of the other it's like anything else it's like it's it's like if you come and your first Tony Hawk game was Tony Hawk's Underground yeah you're going to love it and it doesn't",
      "start": 4396.88
    },
    {
      "text": "if you haven't used any of the other it's like anything else it's like it's it's like if you come and your first Tony Hawk game was Tony Hawk's Underground yeah you're going to love it and it doesn't matter that there are other versions out there that other people think are better or whatever they were wrong THUG was the best we it's like and I'm not so sorry I'm not I'm not trying to like dump on the PlayStation you be like it's funny you're having fun with your like again Dave Lang for some reason you're like you're you're shitty version of the your experience cuz it's not it's not it's it's actually like it's for I think the reason Time are like rewarding it is for the money that you're spending while you're getting at of that thing I think the value proposition on PSVR is better than it is on the Vive and that's I mean you know I play it up obviously on the internet and on the show and everything else but like I legitimately don't like PC gaming because it's too complicated like my",
      "start": 4439.76
    },
    {
      "text": "is on the Vive and that's I mean you know I play it up obviously on the internet and on the show and everything else but like I legitimately don't like PC gaming because it's too complicated like my life is so busy and there's so much **** going on the last thing I need to do is I'm finally going to sit down and play this PC game and be like wait what's wrong and but and every's like just leave it on and updates and I'm like it doesn't though and I understand this works for you for some reason God hates me did you playing PC games no well I mean a little bit here and there but like you know I was always pretty much always a console guy and then it just got away from me and then now where we are it's just like yeah I you know machines can't do this can't do that but the fact that yeah like I want it to Plug and Play and like don't get me wrong my PlayStation VR has been sitting over on the side of the the on the coffee table for a while because I'm just like before Watch Dogs I I",
      "start": 4477.84
    },
    {
      "text": "like I want it to Plug and Play and like don't get me wrong my PlayStation VR has been sitting over on the side of the the on the coffee table for a while because I'm just like before Watch Dogs I I look at be like I don't have enough time to justify the setup to move to move the table to do to only sit there and play it for 10 minutes that's not enough and why I kept putting off putting it off and so now I have this stack of VR games and I'm like all right holiday break know Thanksgiving before I go to Kevin's I'm going to sit there and do this if I Platinum Watch Dogs if I haven't started Dishonored and da da and I think that's where they're probably going to like people are going to like you said there's a lot people wait until January to play certain games and they wait until Christmas to play certain games the holidays or whatever um and I think what's going to be interesting with PlayStation VR is I wonder how they're going to sell when when people have Thanksgiving and suddenly",
      "start": 4510.88
    },
    {
      "text": "to play certain games the holidays or whatever um and I think what's going to be interesting with PlayStation VR is I wonder how they're going to sell when when people have Thanksgiving and suddenly there's that whole shared you know room thing that happens at Thanksgiving where you're hanging out with your parents and hanging out with your cousins and you're showing everything uh and this is going to be the perfect uh I guess upsell like Christmas purchase for a lot of people who already own PlayStation 4s um and there's loads of games on it I mean again the games on it are are more expensive that's just a you know sad byproduct of there being a smaller install base for for that type of stuff um but if you own the place if you got a PS4 at launch right and you got a couple of games then the beautiful thing is like in the next month or so you're going to have you know maybe a bit more cash cuz you've just worked a couple more months or maybe I used to get a lot of I used to get like",
      "start": 4547.88
    },
    {
      "text": "the beautiful thing is like in the next month or so you're going to have you know maybe a bit more cash cuz you've just worked a couple more months or maybe I used to get a lot of I used to get like money at Christmas a lot from like uncles and aunts and stuff like and then you get to you'll have more fun experiences with with the games you haven't had a chance to pick up yet you know what I mean no that's the thing we always talk about again where it was like we stopped talking about PSVR in ter like in a really in-depth Hands-On way because oh right we had all the games you know what I mean now new games are coming but like it again people bought this $400 headset in two games so like yeah you've played Batman and Job Simulator maybe you haven't played Rez maybe you haven't played uh the other ones I don't know the other ones you know I was got hung up I was like did I say Job Simulator but you know there's things to get into and do different things with and that's the thing is yeah",
      "start": 4583.96
    },
    {
      "text": "other ones I don't know the other ones you know I was got hung up I was like did I say Job Simulator but you know there's things to get into and do different things with and that's the thing is yeah is it spreads out more it'll be interesting though yeah how much effect Thanksgiving has because for me that's the one I always talk about with Wii when I brought my Wii when my mom came over for Thanksgiving and I had the Wii that was the first time she did she's like oh I want one of these I was like you do that's you've never and we you know that was her Christmas gift and that was happened that's awesome all over the world that Year by the way she also like tweeted out for me to win the award which I thought was the sweetest thing I've ever seen in my entire life big old Jamie K. got back she's incredible mom's pretty cool Wednesday KindaFunny.com uh number five on possibly the longest Roper's Report of all time nice Resident Evil 7 Collector's Edition is coming $180 GameStop",
      "start": 4620.2
    },
    {
      "text": "got back she's incredible mom's pretty cool Wednesday KindaFunny.com uh number five on possibly the longest Roper's Report of all time nice Resident Evil 7 Collector's Edition is coming $180 GameStop exclusive you get an 8 in Baker Mansion house you get a house you get a house replica that serves as a music box and has LED effects and plays a sample of Aunt Rhody do you know what this is what's Aunt Rhody I don't know we were Tim and I were asking this today too we we didn't it must be a song yeah it's like a creepy children's probably yeah something we should know you get an exclusive metal case a lithograph of the Baker family a creepy note from a resident of the mansion and a VHS tape box to hold a USB that looks like a finger oh really severed finger that you to plug I wonder I was in the VHS tape that's what it is it's a finger now severed finger what was it called Aunt what Aunt Rhody R H O D Y R H O D Y R H O D Y Aunt Rhody it's a song although it's funny the first thing that comes up is Aunt",
      "start": 4654.6
    },
    {
      "text": "tape that's what it is it's a finger now severed finger what was it called Aunt what Aunt Rhody R H O D Y R H O D Y R H O D Y Aunt Rhody it's a song although it's funny the first thing that comes up is Aunt Rhody Resident Evil when you yeah it's uh I don't know all you get is links to the Resident Evil so it like immediately American folk song okay yeah so there you go you're excited about this creepy I think I am a i a fan of having your special edition collector's edition be as ridiculous as possible I I think I think you should I hate when they softball them and they end up being like kind of janky and broken and rubbish like sure if if there's somebody out there who's such a Resident Evil fan that they cannot wait to spend $180 on on something so make it worthwhile so I think that a house is a good house is perfect it's it's like I hate I hated when Call of Duty did the like we're giving you drone doesn't work night vision it's like no give me something that I can put on my shelf that lets",
      "start": 4698.04
    },
    {
      "text": "good house is perfect it's it's like I hate I hated when Call of Duty did the like we're giving you drone doesn't work night vision it's like no give me something that I can put on my shelf that lets everyone know that I'm an idiot who shouldn't be allowed to have money like my house is full of that sort of sure so I think that's a good one the good ones I can think of like you know Uncharted 4 Hunter's Edition that came with the Dagger of Shambhala or whatever that had a little thing and we could put it on that granted it was super limited but it was like that was really cool I think honestly I know I'm too biased I think probably you're Tobias you're never new exactly I just blew myself um I think one of the most useful special editions of all time was the Infamous Second Son one or no I'm sorry Infamous 2 one because if you remember it came with Cole's messenger bag oh did whether I'm at a PSX a PAX or whatever I see **** thousands of those things and I use mine too we use we",
      "start": 4745.16
    },
    {
      "text": "use it for gear and electrical cords when we go to events cuz it's a really good messenger bag that you can I was like all right cool like if you can put something in usable I'm a fan of that oh I'm I'm so bad at the usable stuff it's always I I have to have like just like I've got like those plushies of the Hatoful Boyfriend plushies which was an unofficial thing it was like a Kickstarter thing like what the **** do I need pigeon plushies for they just sit there on the wall I have the Doom Revenant you know the you know they did the Doom Revenant with the it had like you put a battery in and it lasted for like 30 minutes and it you spun and had lights on it so like why do I need this that's we were talking about on Colin & Greg with Tim of just like I don't mind like so many people are like",
      "start": 4790.32
    },
    {
      "text": "lasted for like 30 minutes and it you spun and had lights on it so like why do I need this that's we were talking about on Colin Greg with Tim of just like I don't mind like so many people are like super anti- against it if you want to spend your money on it go spend your money on it but I feel like everyone I've ever bought with the rare exception like Infamous or whatever I get and I'm like oh this is cool and it's just like well what I'm why why did I do like I bought Fallout 4 collector's edition and oh yeah I got boy that's inside the case the case sits on top of my thing and I have other crap on top of it now it's like okay and then I always forget about it until we have again somebody over here who is like maybe a developer or somebody who's just not maybe as Hands-On with the day-to-day of other video games and you we can't see it here when the walls blocking it but we have a Luigi award back there that has the Gal Gun panties on it and they're like whose panties are these and",
      "start": 4827.68
    },
    {
      "text": "of other video games and you we can't see it here when the walls blocking it but we have a Luigi award back there that has the Gal Gun panties on it and they're like whose panties are these and I'm like oh there is this game Gal Gun and they're like nothing and I'm like you shoot girls to give them or you know what it do doesn't matter it's a collector's edition it's p it's a screen wipe for a collector's edition of a Japanese game you smell it comes out comes out of a vending machine ex I it's it's that thing where like whenever there's a game that you love so much that you will like that I'm such a huge Fallout fan that when they announced that I was on Amazon straight away and I bought the colle Half-Life I got i' so much Half-Life swag it's coming out of my ears like but I love that game there are people there are plenty of people who are massive Resident Evil fans who will be delighted that that exists so go for it as long as they don't exploit people who just want the base",
      "start": 4867.68
    },
    {
      "text": "game there are people there are plenty of people who are massive Resident Evil fans who will be delighted that that exists so go for it as long as they don't exploit people who just want the base game and they don't rip stuff out I hate all that stuff like that was the Evolve situation I think I think if that's totally fun yeah I know Colin always gets you know oh why is all this crap and toys and stuff you know what I mean and he's of course as with everything a hypocrite cuz he's got like the Mega Man and stuff and he admits this he admits this right but it is that thing of just like I think it's also part of us where you know we go to E3 and I remember those original E3s of going there and trying to get everything give me you got bags and t-shirts and this that and now people come to demos like you want a shirt and like I'm like no please do not give me anything you forget that like for a person whose life isn't traveling to events and being behind the scenes it's a huge deal to get",
      "start": 4906.0
    },
    {
      "text": "like you want a shirt and like I'm like no please do not give me anything you forget that like for a person whose life isn't traveling to events and being behind the scenes it's a huge deal to get a cool statue and get a thumb drop like a you know the finger thumb drive that's like awesome when I go home and I uncork this thing and it's just all thumb drives of like random video game shag my my most prized possession for years and years and years was the um uh Headcrab Lamar like plushy thing that like cuz I had that ordered from Seattle like when I was in Ireland like I loved that thing if like my house burned down what you're getting exactly yeah um yeah so it's uh yeah like all pair to it and I think this is a pretty good example of one of those I mean 180 is pretty pricey but whatever you know if you're going to spend it you're going to spend it right number seven on Roper's Report that should have been number seven that was Resident Evil 7 you missed that all right you know what this is",
      "start": 4939.96
    },
    {
      "text": "you know if you're going to spend it you're going to spend it right number seven on Roper's Report that should have been number seven that was Resident Evil 7 you missed that all right you know what this is why you're doing more more success on Patreon than Dishonored 2 is getting a new game plus mode and a new custom difficulty setting in a free update next month cool yeah that's exciting right is this the hudless version I've heard people talk about no I don't think so I think cuz they're they're they're going to talk about this next month or more or whatever they're not actually they don't have the hardcore details from what I said damn it I think this is one of going to be one of those games I'm hoping I'm not sure what the week one sales of but it came out in a very busy time uh came out with way too many other FPSs coming out even if it is like totally different I'm hoping this is a game that like kind of has that Twitch effect yeah exactly this is like a real January game the thing will",
      "start": 4982.96
    },
    {
      "text": "way too many other FPSs coming out even if it is like totally different I'm hoping this is a game that like kind of has that Twitch effect yeah exactly this is like a real January game the thing will be interesting though cuz you I I wanted to talk about it because you said you played a little bit of Dishonored 2 I've watched people play Dishonored 2 I haven't and that's the thing about it where it's just just like I don't it might have that tale but this seems like a game that this is one of those communities where you know it's funny there was a PlayStation 4 Pro right and I kept making the comment you know when people were talking to me about it when the whole Reddit thing and everything else happened right and I was just like well our audience isn't asking for us to talk about PlayStation Pro they're not I'm not getting tweets going hey why aren't you reviewing PlayStation 4 Pro there's a million reviews out there and we talk about what we think about it and so on and so forth",
      "start": 5017.88
    },
    {
      "text": "Pro they're not I'm not getting tweets going hey why aren't you reviewing PlayStation 4 Pro there's a million reviews out there and we talk about what we think about it and so on and so forth Dishonored 2 is the thing where I get comments and emails and tweets and why aren't you playing this you need to play this like there is a Dishonored 2 community that is super fired up about it and like wants everybody to play it so I don't know how that's going to work in terms of the long tale if it is because I don't think it's a game I would Twitch stream or watch but I know people think I should play it I should talk about it it's I feel like the game that sort of that fixed or maybe not fixed this but cracked this nut right where you've got a game like Dishonored 2 which is so deep but still has that sort of like time and place problem that like a lot of games have when I kind of like badly trying to explain earlier on right like I think the game that fixed that was Hitman because Hitman was a game",
      "start": 5053.44
    },
    {
      "text": "of like time and place problem that like a lot of games have when I kind of like badly trying to explain earlier on right like I think the game that fixed that was Hitman because Hitman was a game that if it came out as one big game would have been that like super deep rich experience that not a lot of people would have explored right but because they did this whole season thing and they kept dropping it over months and months and months and months you meant they got that media burst every time I mean they got all of that community got reinvigorated every single time they released a pack it meant that they were able to improve the game based on feedback while they were doing it so now you're looking at Hitman and like Hitman to me is a game that I I sort of look at um what happened with Giant Bomb in relation to that because they didn't really talk about it all that much when it came out but then as it happens one of them played it and was like oh let's do a video about like I'll",
      "start": 5086.72
    },
    {
      "text": "with Giant Bomb in relation to that because they didn't really talk about it all that much when it came out but then as it happens one of them played it and was like oh let's do a video about like I'll show you what it's like and then like Ryckert started to like it and then someone else start to like it and we're now at the point where you've got Jeff who would probably never played it playing it at the moment and enjoying it and now it might be a late contender for their game of the year and I kept hearing about Hitman and I like I have yet to play Hitman and I wouldn't have gotten it I'm a huge Hitman fan but like now I can't wait for a a dead time in January or December to play all of that game and I think Dishonored 2 is another game of it's like it's got that depth to it and it's got that community and you can replay those levels over and over and over again in the same sort of way but the problem it has is that like that's why they're releasing stuff right is because like we need to keep the",
      "start": 5127.0
    },
    {
      "text": "and you can replay those levels over and over and over again in the same sort of way but the problem it has is that like that's why they're releasing stuff right is because like we need to keep the conversation going right yeah cuz it's for me thinking back to the you know original Dishonored I just wasn't a fan of the setting and I felt like the it was it's a true stealth game whereas like I'm playing Watch Dogs in a stealthy way but when shit goes to pear-shaped it doesn't matter I just run off I you know do whatever I have to do and it's not that I don't feel like I'm really screwing it up whereas like when I'm not stealthy and Dishonored I don't feel like oh no big deal my character is this fun hacker dude I feel like oh I screwed this up I'm supposed to be a master stealth guy or whatever go on that way Y video G patience I had questions here about Dishonored I'm seeing if any of them makes sense cuz you know we've been having a really good show here I don't I screw it up no",
      "start": 5164.4
    },
    {
      "text": "or whatever go on that way Y video G patience I had questions here about Dishonored I'm seeing if any of them makes sense cuz you know we've been having a really good show here I don't I screw it up no ask questions about Dishonored to the people who haven't played yeah well no they don't trust me I would to picked those kind of questions we got off the thing what do I do in level four I'm stuck at this wall what do I do all right final part of The Roper's Report okay the Roundup this is just updates and stuff like that when you come to things like uh release dates and whatnots all right Pinball FX2 is coming to PlayStation VR 11 9 with The Walking Dead Pinball available day and date now this is interesting cuz a guy came back earlier and was asking us in one of the other topics about VR if we had thought this could bring back the arcade over at KindaFunny.com/psq Celestial Pulse said hello Colin and Greg hey what's up I simply want to know could slash should VR breath a little life back",
      "start": 5198.68
    },
    {
      "text": "we had thought this could bring back the arcade over at KindaFunny.com/psq Celestial Pulse said hello Colin and Greg hey what's up I simply want to know could slash should VR breath a little life back into the arcade now he then goes off to say you go to the arcade and put on VR oh I say that's not a good thing pink eye and everything else instead go the opposite direction with it and why like bring the arcade to you I there's so many people who talk about that of putting it on and like now you're H the way Pinball FX2 looks is with the table out there it would strike me that as they continue to add tables you're going to have this room full of tables in front of you and you get to walk up and that point yeah why I you have to hope Atari and uh Namco are are all sitting down and being like well okay let's work on this where you walk up to cabinets and there is a Pac-Man and there is a Galaga and there is this is there any um uh cuz I I haven't played the the what was it the Playroom VR the",
      "start": 5246.48
    },
    {
      "text": "well okay let's work on this where you walk up to cabinets and there is a Pac-Man and there is a Galaga and there is this is there any um uh cuz I I haven't played the the what was it the Playroom VR the VR version of Playroom VR um does is there any multiplayer components to that at all are you able oh I didn't play I don't know Playroom VR is a baby's game Battlezone has multiplayer like there is VR multiplayer okay is there multiplayer and that you were in you you both there talking to each other like in a so there's this game called Rec Room on the Vive which is basically like you have an avatar and you're playing with other people and you're like playing with like you can tell it's a child because it's feet smaller than you right it's like it's that weird sort there is that bargain that is pool and darts and that you're playing with other people something like that but I don't think it's a height based thing at all I think it's just like there's avatars there that are doing their thing so",
      "start": 5296.24
    },
    {
      "text": "and darts and that you're playing with other people something like that but I don't think it's a height based thing at all I think it's just like there's avatars there that are doing their thing so that whole thing is like super interesting and that like going to play because like this is a place where like you can play paintball you can play all these different things and there's another one I have which could easily be on PlayStation um VR as well um that was basically a like you you you have your own arcade yeah but and the best thing about it is you can do anything you want because there's no lines so if I was playing that in multiplayer be pissed off sure because everyone's going to be at the Skee-Ball it's like when they when they brought out in PlayStation Home and they added those kind of things yeah people would queue up trying to get to certain things why am I queuing up this is The Division did that too where you got you all had to go check in at someplace there was this",
      "start": 5334.72
    },
    {
      "text": "kind of things yeah people would queue up trying to get to certain things why am I queuing up this is The Division did that too where you got you all had to go check in at someplace there was this giant queue of people trying to get their mission from this the Quest Giver all right I can see it happening I mean I feel like PlayStation Home should definitely come out come back into a VR component they should not call it that but yes they should no and they should also be a bit weirder about some of the dodgy stuff that was happening on there as well there's no dodgy stuff talking about you got bubble machines some Ghostbusters stuff you could put on could buy a house PlayStation Home is one of those things you think about now and you're like what the fuck was going on God that and that you want talk about a micro community oh yeah the people who were in PlayStation Home fucking loved PlayStation Home for sure everybody else was like what what is that no I'm good I'm going to Folding@home",
      "start": 5369.36
    },
    {
      "text": "uh DriveDriveDrive comes to PlayStation 4 on December 13th the Vita version has been quote unquote indefinitely postponed and they go back and forth with one commenter who's like so cancel he's like not cancel then they start putting the dictionary definition to cancel in it's like it's canceled uh RIGS is going to get more RIGS and an arena in December and then Mages of Mystralia out in Spring 2017 on PS4 and at PSX how was RIGS uh I still it's one of those ones that uh I played a not a lot but I played at events and I was like cool kind of makes me sick I'm not going to jump I'm not going to I'm not super stoked to get into it I'll give it a shot and I haven't gotten a chance to give it a shot again right and so but it's this is where I was coming from with the question a couple weeks",
      "start": 5400.8
    },
    {
      "text": "to I'm not super stoked to get into it I'll give it a shot and I haven't gotten a chance to give it a shot again right and so but it's this is where I was coming from with the question a couple weeks ago like are you still using VR is that my concern with PlayStation VR was going to be it comes out we there's been the preview cycle where we've all been really positive on it it comes out kids get it they have expectations It Go underperforms and everybody's like why did I spend all this money on it this is a waste of my time and then they look at it week after week and think like they're wasting time and money and uh instead what happened is everybody was really positive at release and then everybody kind of stopped talking about it and that's what's cued spurred the question to get stuff so I don't know are there still RIGS players out there are you playing competitively are you going back and forth that's one of those it's like the Titanfall 1 problem right you get that drop off",
      "start": 5444.88
    },
    {
      "text": "so I don't know are there still RIGS players out there are you playing competitively are you going back and forth that's one of those it's like the Titanfall 1 problem right you get that drop off and exactly people were talking about at the time and everything was great best thing Evolve ever did well not the best thing they did that game is fun I don't like shit on it I think I think it was it was a pretty pretty great idea um but like when they went free to play it was like boom we're back and like actually one of the craziest ones is uh Rainbow Six oh yeah the community for Siege something happened over I guess they made that like $1 version or something and it has just exploded that same thing like you you get streamers who are playing this and are going to like you know cuz not every game's for every person I don't do I have something I can really add the desire in our conversation probably not but like an Alfredo can play Siege and be like oh hey this you guys like X so",
      "start": 5477.68
    },
    {
      "text": "every game's for every person I don't do I have something I can really add the desire in our conversation probably not but like an Alfredo can play Siege and be like oh hey this you guys like X so you'd like this and here's how it all comes together and works out yeah that's I got do it now Danny yes I am of course am excited for PlayStation VR Pinball FX2 and to see this Walking Dead table I'm terrible at it I'll probably only play it for seconds but it's still so far away if I wanted to know what was coming to the digital mom and pop shops and retail stores around the world where would I go you tell me you just can say whatever say here you you you go to the upcoming list you go to you go to the upcoming list of PlayStation software do I have to do like should I do an accent for this should I be Colin should I be you sure should I yeah do whatever you say something as Colin Colin Trump was always going to win Jesus it's the list of upcoming software by the PlayStation fan I've got",
      "start": 5516.76
    },
    {
      "text": "I be Colin should I be you sure should I yeah do whatever you say something as Colin Colin Trump was always going to win Jesus it's the list of upcoming software by the PlayStation fan I've got imposter syndrome I can't I yeah it's a big week for that PlayStation Vita is it Danny I'm not kidding there's some stuff coming up here now I'm going to start with Alchemic Jousts, not Alchemists, Alchemic Jousts. This is PlayStation 4 digital release that's the name of the game yeah right Alchemic Jousts they need to oh God is a d action strategy game where you discover new skills by combining the ones you already know command so like running and jumping I guess command your Elementals and support them with a wide variety of skills like what control the arena and crush your opponents in one to one encounters okay that's it that's what we know about Alchemic Jousts that is the vague explanation welcome to the PlayStation Blog descriptions at least they're they kind of before they were",
      "start": 5560.04
    },
    {
      "text": "to one encounters okay that's it that's what we know about Alchemic Jousts that is the vague explanation welcome to the PlayStation Blog descriptions at least they're they kind of before they were just fragments of sentences just space together uh Amnesia Collection comes to PlayStation 4 digital experience the horror that kickstarted the Let's Play Revolution be immersed in three living nightmares that will chill you to the core Jes The Collection contains three Amnesia titles The Dark Descent, A Machine for Pigs, and Justine. Is that Justine? Yeah, it's Justine. Yeah, it's weird that they're saying that's part of the is that part of it I guess it might I I didn't think they called I it's so lame that they're referring to themselves as the Let's Play Revolution like shut up like you kind of are but shut up nobody wants you to say that though God exactly it's cool it's not cool if you admit it they should bring knows there for PlayStation VR yeah that'd be dope",
      "start": 5611.84
    },
    {
      "text": "shut up like you kind of are but shut up nobody wants you to say that though God exactly it's cool it's not cool if you admit it they should bring knows there for PlayStation VR yeah that'd be dope horror games man that's that's that VR cutting edge those games are great Dark Descent's great, it's Machine for Pigs. Yeah, Dark Descent's a bit old to play now but all right good stuff Darksiders Warmastered Edition comes to PlayStation 4 digital and retail deceived by the forces of evil into prematurely bringing about the end of the world War, the first Horseman of the Apocalypse stands accused of breaking the sacred law by inciting a war between Heaven and Hell in the slaughter that ensued the Demonic forces defeated the Heavenly hosts and laid claim to the Earth it's like a back in Catholic school this is great I know right like no description of what the game actually is now granted Darksiders is like I feel like a bad",
      "start": 5655.16
    },
    {
      "text": "hosts and laid claim to the Earth it's like a back in Catholic school this is great I know right like no description of what the game actually is now granted Darksiders is like I feel like a bad Penny you think you get rid of it it just keeps coming back to you like God damn it all right what is this though Darksiders is the last one I saw is this this is the remastered of the first one yeah okay yeah here you go PlayStation 4 is that all is is two in there too or when was Darksiders that could that could be a game that came out 8 years ago or three years ago y exactly thank God it's not like there's a new company betting their entire existence on let's see what Amazon says Amazon here Darksiders well that's not even the same thing Warmastered PlayStation 4 edition is that just coming at in PS4 yeah no well no it's got to be well but it's not coming in Vita oh God no it's Vita that'd be perfect can you imagine if it was on Vita oh the power we'd have yeah it looks like it's just",
      "start": 5701.28
    },
    {
      "text": "one cuz PlayStation 4 Darksiders was our thing THQ Nordic oh God go get him Gary the Gull comes to PlayStation VR digital are you familiar with Gary the Gull? No, what is Gary the Gull? I play this at the PlayStation 4 GDC event okay say hello to Gary hey Gary Gary the Gull is an interactive VR short film where Gary talks to you and you can talk back your path through the story depends on how you answer Gary's questions using voice recognition and head gestures enjoy your day at the beach okay now can I say fuck you Gary? Yeah, he won't respond to that and he doesn't say like that's rude no I wish that that's the thing played Gary the Gull at that PlayStation 4 event and I was like all right this is a great tech demo they're like oh no it's a full-fledged thing I was like oh no oh God no cuz like I",
      "start": 5745.24
    },
    {
      "text": "that's the thing played Gary the Gull at that PlayStation 4 event and I was like all right this is a great tech demo they're like oh no it's a full-fledged thing I was like oh no oh God no cuz like I did the short film like it's like it must have been like 6 minutes or whatever and it was like it was doing the thing too and granted maybe it was early this is just my preview impressions whatever but you know it's he's like hey look over there you know what I mean you look away and then he tries to steal your picnic basket or your cooler I think it is right but it's like the thing even if you didn't move your head he still he just went and did it and I'm just like well what are you like wait you're not interacting with me at all actually Gary you're just kind of doing your own shit thing here Gary's the latest in the long line of of like seemingly impossible pieces of software to do this which were actually impossible like for in like Milo which was total smoke and mirrors or like Seaman",
      "start": 5793.0
    },
    {
      "text": "here Garry's the latest in the long line of of like seemingly impossible pieces of software to do this which were actually impossible like for in like Milo which was tot smoking mirrors or like Seaman which like barely worked at all Garry the Gull Garry the here he is he thought this is some of the things you're going get it's again this could be a cool idea a few years from now somebody's worked on it and done something but who see why a gull uh who doesn't like a good seagull everyone irritating it in the world they're hit they're a big hit because of the movie remember now Minions Minions everyone because of that **** oh God like Minions Garry the Minion would be better Hollowball comes to PlayStation VR Digital that sounds like that is the most PS PlayStation Digital name I've ever heard in my life right it's got a really cool aesthetic too from Hollowball there too there you go worth pointing out of course this was made by friend of Kinda Funny Mike from Filthy Casual so oh cool uh",
      "start": 5826.76
    },
    {
      "text": "my life right it's got a really cool aesthetic too from Hollowball there too there you go worth pointing out of course this was made by friend of Kinda Funny Mike from Filthy Casual so oh cool uh Hollowball plunges players into an action Sports arcade Arena inspired by one of the most iconic games of all time use your paddles to hit Smash and curve the Hollowball past your opponent to score learn and master skill shots to outmatch your increasingly difficult opponents so did they say that it's based on one of the most iconic games but refer the game they will not say what the game is is the game Breakout or something Pong, a Pong is it use your paddles smash or curve the Hollowball past your opponent sure oh yeah that makes sense right uh then another I mean like I if this is one we got to retire this this kind of this name iZOMBIE it's not the TV show it's not the work of fiction it's just iZOMBIE all right PS4 Digital quite a different zombie game this time you are the",
      "start": 5870.64
    },
    {
      "text": "we got to retire this this kind of this name iZOMBIE it's not the TV show it's not the work of fiction it's just iZOMBIE all right PS4 Digital quite a different zombie game this time you are the zombie command your infected comrades fight your way to freedom and let zombie kind dominate the world so just like Stubbs the Zombie or Zombie Tycoon or Zombie Tycoon or many other zombie games that are exactly Left 4 Dead coming to PlayStation Vita Digital Iron Sea Defenders defend your fort from impending enemy attacks by saving money stockpiling secret Weaponry building cannons and driving the enemy to despair embrace your Tactical and strategic prowess and victory will be yours in Iron Sea Defenders work to defense was not mentioned once exactly marketing good we got they'll come up in Trophy Time I want to see a little bit more about them so you'll see them here in a second Laser Disco Defenders comes to PlayStation 4 Digital that's a strong name I agree yeah shoot and Dodge lasers",
      "start": 5912.28
    },
    {
      "text": "time I want to see a little bit more about them so you'll see them here in a second Laser Disco Defenders comes to PlayStation 4 Digital that's a strong name I agree yeah shoot and Dodge lasers and Laser Disco Defenders a self-inflicted bullet hell that combines retro sci-fi with the sounds and sights of the Disco era oh my God explore randomly generated levels complete missions to unlock new clothing and customize your character to gain new abilities right that sounds right like got flares and like and a dump Fedora and yeah like a like a shirt with the first four buttons open then yeah and also play bullet hell why not sold perfect now continuing this is a PlayStation VR Digital game But continuing with we're making a VR game what what names you got from me okay Proton Pulse oh God Proton Pulse no I'm oh they they have a mtitle here at least you can pronounce this one Proton Pulse Plus is a fast-paced classic arcade action oh is fast-paced classic arcade action from a whole new",
      "start": 5965.16
    },
    {
      "text": "Proton Pulse no I'm oh they they have a mtitle here at least you can pronounce this one Proton Pulse Plus is a fast-paced classic arcade action oh is fast-paced classic arcade action from a whole new perspective spanning over 50 levels with an original soundtrack by Jake Kaufman and Danimal oh we know Danimal Proton Pulse Plus will take you on a heart pounding mission to save the universe another one of like what the **** is that game yeah is a fast-paced classic arcade action from a home what does that mean the Predator soundtrack they got 50 levels the name is a is a is a car crash but if the game's good enough you can get over that I don't know what I'm doing in it though am I just walk is it hacking slash there's a lot of anyways Samurai Shodown VI do you think that like all of these are like the descriptors that they put under YouTube videos because they're seeming to like almost intentionally not refer to anything that you would get visually from the game I imagine this is like the I",
      "start": 6003.24
    },
    {
      "text": "the descriptors that they put under YouTube videos because they're seeming to like almost intentionally not refer to anything that you would get visually from the game I imagine this is like the I the way I imagine it cuz we've we've ragged on this for a long time cuz again literally it was just broken English before like nobody was reading these things and putting live they've gotten better but I have to imagine that when you submit a game to PlayStation there must be all these like fill out this form and put in the description and like people must just like not wholly understand where the information's going like yeah Samurai Shodown uh six the age 10 me the venue the world the prize Glory great the curtain now Rises on the samurai world's greatest spectacle let the games begin like I understand it's the sixth game in the series like you know what this is and you care you don't give a **** but I love games that are set in the world it's a good thing I was Googling that the prize",
      "start": 6052.84
    },
    {
      "text": "understand it's the sixth game in the series like you know what this is and you care you don't give a **** but I love games that are set in the world it's a good thing I was Googling that the prize Glory Slain: Back from Hell Comes to PlayStation Vita Digital Slain: Back from Hell a heavy metal inspired arcade combat game with stunning pixel art visuals challenging old school gameplay and gore galore plus that's good combination plus the most metal soundtrack you've ever heard told me what the game is what I can expect from it and if I like that the metal there I am all right Stranded: A Mars Adventure comes to PlayStation Vita Digital flying to Mars is a piece of cake but returning back to Earth that's where things get tricky help the stranded astronaut to find a way back home in this delightful side-scrolling skill to find a way back home did he say I help the stranded astronaut to find a way back home in this delightful side-scrolling skill game Cool interesting I'm I'm interested in that",
      "start": 6101.44
    },
    {
      "text": "side-scrolling skill to find a way back home did he say I help the stranded astronaut to find a way back home in this delightful side-scrolling skill game Cool interesting I'm I'm interested in that VirZOOM Arcade comes to PlayStation VR Digital VirZOOM Arcade is an ever expanding collection of virtual reality exercise games powered by you pedal faster to chase down Bandits turn your head to aim your Tank's Cannon and lean to swoop and dive on the back of a Pegasus say goodbye to your boring workout full games require the VirZOOM exercise bike controller available from local and online retailers what the flying **** I think I might have played this one oh my God on the bike yeah you get like an exercise bike like a straight up like like put it in your house buy it at Christmas never use it again like exercise bike there it is is did they sell actual ones can you oh yeah here it is on Amazon here it is on Amazon you want to take a guess how much do you think the VirZOOM Virtual",
      "start": 6146.52
    },
    {
      "text": "use it again like exercise bike there it is is did they sell actual ones can you oh yeah here it is on Amazon here it is on Amazon you want to take a guess how much do you think the VirZOOM Virtual Reality Exercise Bike and Games hold onam hold on let me let me see what you got here about the product VirZOOM Folding VR Bike Controller and VirZOOM Arcade games included what games 69.99 I want to give you hold on I want to I'm trying to give you exactly what games are here all right you're get okay here you go VirZOOM Arcade is a free to free to play yep VirZOOM Arcade is free to play with the VirZOOM Gaming System it includes five VR exercise games okay so you get five games in this **** bike for VR so you get like you get one game that's got five games in it yeah sounds like five game yeah they're trying to upsell it so I don't I to me I feel like 50 for the bike and then they'll put it a little bit higher for the software you can get it all for the low low price was it $399 and also look",
      "start": 6199.48
    },
    {
      "text": "trying to upsell it so I don't I to me I feel like 50 for the bike and then they'll put it a little bit higher for the software you can get it all for the low low price was it $399 and also look at this guy I I don't know what I'm going to title this episode but I really want to use this as the thumbnail just no explanation just this guy in this VR bike good **** Lord yeah all right now if you're here's oh no well I was going to say for kids at home who are thinking about dropping their $400 on this what I'm seeing here is a free postage at least is it Amazon Prime it's it is Prime it is Prime than Christ imag EXT don't see and I could just let me enhance the image here enhance cuz I'm not seeing controllers it doesn't look like there's move light bars on them like for like the Nubs for that right which would make me think if you have an exercise bike you might just be able to ride the exercise bike but I can't prove that I think I might have played this one and I think it gets it",
      "start": 6242.84
    },
    {
      "text": "that right which would make me think if you have an exercise bike you might just be able to ride the exercise bike but I can't prove that I think I might have played this one and I think it gets it off of the the pedal oh so so like I I I think I did this one and it's like when it says Bandits is they're like pictures of cowboys cuz I definitely did yes I have used that one before yeah and it it works but it's like it's not that great you spend $400 on it oh here we go it's on Today Show it's on Today Show yeah so there's a bit where on a Pegasus and then when you pedal it's like flying and it's really cool and you're like whoa but it's based on like how much how fast you're pedaling and I think I think you lean as well so there's no controller so I don't think you could you could use it with some okay well here we're getting it you power it on you crank on your tension put on the headset that's not a PlayStation VR headset you do this you spin that thing if it was a PlayStation 4",
      "start": 6291.96
    },
    {
      "text": "it with some okay well here we're getting it you power it on you crank on your tension put on the headset that's not a PlayStation VR headset you do this you spin that thing if it was a PlayStation 4 exclusive that would be maybe the worst business decision you could do I don't man I don't know this dog is driving a car oh yeah it's a it's an F1 driving game and when you look in the mirror you realize you're a dog which is pretty cool huh all right yeah I did this one as well it's like a it actually looks better graphic than did when I played it before well this is probably running on the Vive so there you or did you use on the Vive I don't know I think I used on Oculus actually all it was a while ago it was like a year ago well VirZOOM Arcade is out there now ladies and gentlemen got to be with this all uh We Sing comes to PlayStation 4 Digital We Sing returns bigger and better than ever before featuring the hottest hits from the world's biggest artists from across five decades including",
      "start": 6334.24
    },
    {
      "text": "this all uh We Sing comes to PlayStation 4 Digital We Sing returns bigger and better than ever before featuring the hottest hits from the world's biggest artists from across five decades including original recordings from artists including ABBA David Bowie Sia Sia that's it yeah that's what I thought too Shawn Mendes and Wiz Khalifa along with their official HD music videos David Bowie yeah worth buying it for that I agree we we do love David Bowie play some Omikron: The Nomad Soul and a big shout out of course similar what we're talking about too about like continuing to release content Hitman wise Batman uh the The Telltale Series Episode 4 comes out Tuesday as well not listed of course because it's digital and they considered add-ons they were like the first people to do that and then package it all at the end cuz I was definitely part of the once you package it all album that's a real game yeah or I just have no discipline I can't watch this is why I'm struggling with Westworld",
      "start": 6369.84
    },
    {
      "text": "then package it all at the end cuz I was definitely part of the once you package it all album that's a real game yeah or I just have no discipline I can't watch this is why I'm struggling with Westworld because I just like to binge I like to do it I wait until it's over and then watch the whole thing in one although I'm watching Westworld yeah well you got to that's and that's the thing with Telltale where it's like I just got to go I I want to play it as soon as I can but that it also it's a weird thing because then it does become appointment viewing where it's like no matter how far I get in Watch Dogs tonight tomorrow I'm coming home and playing four cuz I want to know what's happening they do such a great job with the Cliffhangers and have you have you played any of Batman h no not a Batman they do a really good job of twe **** with the fiction cool to where it's not what not necessarily what you think's going to happen is what's going to happen so it's like actually really",
      "start": 6413.64
    },
    {
      "text": "a Batman they do a really good job of twe **** with the fiction cool to where it's not what not necessarily what you think's going to happen is what's going to happen so it's like actually really interesting to make choices it's probably important for Batman fans considering how much like knowledge of the those narratives you already ex exactly well it's just nice to see DC let somebody off the leash like all right go do something goofy you know or not goofy but really intense and different have they confirmed that Guardians of the Galaxy thing or no it's still just off the voice actor strike uh list thing I think I don't think I've seen anything official from them um this is where we usually do Topic of the Show but we been going for an hour and 46 minutes I think we've had like four worthy topics of the show yeah so that's fine don't worry about that probably uh trophies though Trophy Time yeah Trophy Time's still here uh I pulled up We Sing Neon Chrome is what I listed but that",
      "start": 6446.8
    },
    {
      "text": "worthy topics of the show yeah so that's fine don't worry about that probably uh trophies though Trophy Time yeah Trophy Time's still here uh I pulled up We Sing Neon Chrome is what I listed but that doesn't even sound like a real thing no Neon Chrome is what I listed is that a template is that a PlayStation 4 another one that sounds like it right yeah it looks like another VR thing Neon Chrome has yeah no uh I don't know why I pulled up Neon Chrome we're not going to talk about Neon Chrome I don't what the hell I was thinking We Sing I pulled up of course cuz I'm a big singing fan I thought maybe it'll be easy Platinum it's a it looks like it's a mind dumbing Platinum oh is it like five star every song or eventually but they have a ton of bronzes that are play this song at least 10 times oh what and they have Hit Me Baby One More Time uh you sing Chandelier at least 10 times See You Again Wake Me Up worth it love me I mean like it's all and there's tons of these **** for bronzes yeah well I",
      "start": 6480.52
    },
    {
      "text": "they have Hit Me Baby One More Time uh you sing Chandelier at least 10 times See You Again Wake Me Up worth it love me I mean like it's all and there's tons of these **** for bronzes yeah well I mean we'll get to that in a second save that save that one there for a second but yeah then yeah sing 0 songs on hard okay whatever score over 90,000 it's whatever but I'm not going to sit sitting there and playing now maybe you could just hit it and leave it there I don't know get around it that way this is how I get to thinking about trophies that I'm just going to g e mod can ever cancel you and exactly exactly put it with the song you like get your CD player and you you you've done this before you've done this before sir uh NBA 2K VR Experience has trophies up 13 no bronze I'm sorry no Platinum uh looks like one gold three Silvers uh I didn't hear much about this did you do you have you seen anything talk about I don't know I can imagine what it is almost immediately yeah complete",
      "start": 6515.28
    },
    {
      "text": "Platinum uh looks like one gold three Silvers uh I didn't hear much about this did you do you have you seen anything talk about I don't know I can imagine what it is almost immediately yeah complete a three-point game or yeah three-point game on any difficult in Solo mode complete a Time Attack game they should have like a half court shot mini game in there or something reach Challenge 10 and sync the basket successfully on buzzer beater in Solo mode uh yeah going complete the Time Attack game without missing a single shot that sounds like a son of a **** I don't want to do that Iron Sea that uh tower defense game coming to PlayStation Vita this week 1 trophies no Platinum uh kill 1,000 enemies kill 500 enemies with the secret weapon uh those are all bronzes you got four silver four Silvers one gold complete all levels with three stars for the one gold sell 500 towers stuff that standard stuff what you'd expect from I think a tower defense game with the that their",
      "start": 6562.72
    },
    {
      "text": "silver four Silvers one gold complete all levels with three stars for the one gold sell 500 towers stuff that standard stuff what you'd expect from I think a tower defense game with the that their trophies refreshing R to see if I miss anything cool no nothing's broken that's cool no on Exophase there you go we do have questions though about it now we talked earlier actually I'm going to skip that one we'll come back to it instead we're going to jump to this one where you this is Grand.Miller.Raccoon wrote in to KindaFunny.com/psq and says hello Greg and Colin hey what's up my question is real simple do you or anyone else for that matter give a flying **** about bronze silver and gold trophies I don't mean the actual trophies but the fact that some are gold some are silver and some are bronze for me every small trophy is a step closer to the Platinum (parentheses) the only for that matters so categorizing them and putting developers through all the trouble seems a bit absurd what",
      "start": 6604.2
    },
    {
      "text": "are bronze for me every small trophy is a step closer to the Platinum (parentheses) the only for that matters so categorizing them and putting developers through all the trouble seems a bit absurd what are your thoughts on the matter anyway thanks for the years of entertainment Cornelius this goes back to what you were talking about yeah I'm yeah I don't know I'm sorry this is the wrong audience for this I enjoy the Simplicity of the Gamerscore just the thing it's just yeah it's whenever when when they originally launched the the the three trophies or the four sorry I was I was kind of like uh you're kind of like over egging this pudding a little bit the pudding is all Egg and I don't really know the importance of any of it yeah so to me the Platinum was always like it was like the the the top of the mountain like like that's to get but it's also kind of too far for me that the goals have become the more like so I'm interested in the goals sure I don't really care about the bronze and",
      "start": 6647.12
    },
    {
      "text": "top of the mountain like like that's to get but it's also kind of too far for me that the goals have become the more like so I'm interested in the goals sure I don't really care about the bronze and and silver kind of part of it all that much like they pop up and I'm like oh you're just in the way of my game and I turn off notifications yeah yeah yeah the thing about it is yeah we've gotten hung up on that before where you know when we are talking about it and I think it'll come up and Colin or me will be like oh yeah you know it's get 50 kills and you only get a bronze for it right it's annoying in the sense that for me if I want the Platinum it yeah it doesn't matter who the who the **** cares I don't care like Watch Dogs I want the Platinum so it's cool to when I finish these missions I'm getting Silvers for them I'm like that seems way too much but I'll take it awesome you know what I mean great better than a bunch of bronzes but when it is then just when you're playing to play",
      "start": 6690.68
    },
    {
      "text": "I'm getting Silvers for them I'm like that seems way too much but I'll take it awesome you know what I mean great better than a bunch of bronzes but when it is then just when you're playing to play the game and you're popping a bronze or whatever then it is just like whatever and if it is a bronze for for something that's really out there then I'm never going to go get it why would I bother getting the 50 kills if I'm not getting a reward out of it but if I'm going for the Platinum then it doesn't really matter is this weird balancing issue yeah I feel like on the developer side it is a weird it does put them in a weird position where they have to make they almost by definition of having all of these tiers they have to make the bronze ones like either boring or just like so like things that you're going to do in the run of the game regardless there's nothing really you're going to get excited about like I'll kill like 0 people it's like well that's going to happen no what I do anyway",
      "start": 6729.04
    },
    {
      "text": "you're going to do in the run of the game regardless there's nothing really you're going to get excited about like I'll kill like 0 people it's like well that's going to happen no what I do anyway or like completing levels and so I don't know I feel like if you're going for the you're right if you're going for the Platinum then that stuff feels cool because it's like you're chipping away at it and that's something that the Microsoft system never had is that you might have that like one 00 you know uh 00 Point thing for completing the game on the hardest difficulty or whatever right uh whereas on this one at least you feel like you're chipping away at a piece by piece that's the thing where I think I feel like a Platinum and this is of course I'm in this ecosystem and everything else I feel like a Platinum is more rewarding to me than the thousand points if that makes sense oh totally cuz with the points it is like yeah okay that's that is a that point total is worth me doing that",
      "start": 6761.8
    },
    {
      "text": "I feel like a Platinum is more rewarding to me than the thousand points if that makes sense oh totally cuz with the points it is like yeah okay that's that is a that point total is worth me doing that whereas like the bronze trophy isn't worth me doing that so I'll leave and it like I don't care my achievements have all these holes in them and then you look at your trophy completion percentage like **** sucks yeah I think the Platinum ones are harder to get and the Microsoft system is probably better for people who just like for rewarding people for just doing anything yeah uh yeah so I agree I I yeah it it seemed weird that they had such a complex system out the gate I always felt like oh it's something you could have like expounded on in in any way but they could kind of pigeon hold themselves in a weird way yeah I think they were just trying to copy it without copying and they just got in this weird thing where these have values but they don't have values but they do to the",
      "start": 6798.88
    },
    {
      "text": "themselves in a weird way yeah I think they were just trying to copy it without copying and they just got in this weird thing where these have values but they don't have values but they do to the developers and and then you've got games of Don Platinums then you've got the My Name is Mayo thing **** godamn speaking of the My Name is Mayo thing my dog Nick what up Nick96 writes in it says hello Greg and guest thank you he knew I'm not Gio Corsi but I'm good enough he listened he listened to Colin Moriarty last week and figured out last time on PS I Love You XOXO best friend Zigger1337 brought up My Name is Mayo yep referring to how poor the quality assurance on the PlayStation Store is I originally wrote up a question about a certain title on PSN that seemed awful after a bit of research I understand it a bit better but I still don't think it fits on the PlayStation Network that title is Inner Kung Fu Game in Inner Inner like inside i n n e r Kung Fu Game it's $3 it was stealth released onto",
      "start": 6835.56
    },
    {
      "text": "it a bit better but I still don't think it fits on the PlayStation Network that title is Inner Kung Fu Game in Inner Inner like inside Inner Kung Fu Game it's $3 it was stealth released onto the system parenthesis not mentioned on the drop that week came out and all descriptions Sony provides don't properly explain the game he puts game and quotes in my opinion here is a description from the PlayStation Store you may read this out loud if you like well thank you for your permission my dog Nick PlayStation Store wrote after scoring a trophy by pointing your awareness correctly 15 time you enter an exercise routine which has many modes intention mode Tai Chi mode orbit mode stretching mode muscle mode organ Health mode three Energy Center mode seven Energy Center mode hand and finger posture mode lying mode sitting mode standing mode and walking mode you can learn learn more about these modes at http://kungfugame.com/modes.html this is still the official PlayStation Store",
      "start": 6873.88
    },
    {
      "text": "posture mode lying mode sitting mode standing mode and walking mode you can learn learn more about these modes at http://kungfugame.com/modes.html this is still the official PlayStation Store description uh the exercise sequence can be done in calming order or exciting order to increase or decrease your energy levels as you go you can do the entire exercise routine or select any exercise mode to work on this version of the Inner Kung Fu Game has more audio file descriptions so it is easier to use wow Grace my dog Nick 96 continues I looked into this further and discovered it's more of a yoga app but it shouldn't be advertised as a game also the trophies for this just seem as bad as My Name is Mayo except no Platinum I guess this isn't a question as much as an observation but I'd love to hear your thoughts on titles like these and where they belong as always thanks for all you do and keep up the amazing work God holy Jesus I want to do extreme speed organ Health mode right now",
      "start": 6926.4
    },
    {
      "text": "to hear your thoughts on titles like these and where they belong as always thanks for all you do and keep up the amazing work God holy Jesus I want to do extreme speed organ Health mode right now my organ Health feels pretty bad what a weird ass thing to put in there I want to try to find it though it feels like um I think was one of the recent episodes you guys were talking about how a lot of this stuff is just kind of copy pasted from the iOS world right and like I feel like a lot of the descriptions are kind of the same thing and then when it comes to Trophies it's like each one of these different stores has their own like version of these things right like even Apple has its game room thing whatever the hell Game Center thing or whatever it's called Uh yeah and I just think there's like hardly any curation or care done in a lot of these are like managed by you know companies that are doing like 50 of these a month on all these different platforms and they just there's no quality",
      "start": 6974.24
    },
    {
      "text": "hardly any curation or care done in a lot of these are like managed by you know companies that are doing like 50 of these a month on all these different platforms and they just there's no quality control they don't care there doesn't seem you any translation control on this no nobody's paying attention uh the Inner Kung Fu Game trophies I'm looking at there's 1 total oh hit me with them uh there's a bronze here first 15 points correctly Point your attention in the proper direction this is on PlayStation 4 okay okay A Move game 15 points correctly Point your attention in the proper direction what 17th 15 points this is the trophy title 17th 15 points correctly Point your attention in the proper it's that over and over again he point your attention in the proper direction now he's included uh he put in so does it just like like did do you get them all in one go when you just when you 15 well you're putting the move I don't know if it's move related hold on now let me see if Jericho",
      "start": 7016.52
    },
    {
      "text": "uh he put in so does it just like like did do you get them all in one go when you just when you 15 well you're putting the move I don't know if it's move related hold on now let me see if Jericho hasn't cleared these out so let me oh of course shout out to Jericho over on the Kinda Funny forums who over at kindafunny.com/psq goes through and finds everything keeps it all set up here we go he sent over screenshots oh God it's as horrible as I fear it's just it strikes me as you just play it and it must do it right because it can't oh is that no that's I can't tell what's happening in this game trying to break into a DOI hedron it seems like is I just is it a PlayStation Camera game I don't know let's see we're going to YouTube now we're going there's a 3D model of a of a human a humanoid and what seems to be a a sort of a geometric shape in front of it we're going to YouTube Alexander Phil has a video up called what the **** is this in a Kung Fu Game PS4 gameplay sitting through",
      "start": 7062.28
    },
    {
      "text": "and what seems to be a a sort of a geometric shape in front of it we're going to YouTube Alexander Phil has a video up called what the **** is this in a Kung Fu Game PS4 gameplay sitting through the ad here I'm skipping the ad now okay oh you use the D-pad for the pointing what and then a triangle Button as well so you just working at your finger that's not an organ I want organ health I don't know man I don't know sometimes but this is exactly what we're talking about that no someone isare someone is saying that this is fine this thing that is just a bubble in front of this guy's thing that's going on I don't know now there's a lot of it it's not just PSN any have you play that Attacking Zanaga on that that's that's like that's like like week when the floodgates opened on the bad PSN games that was like one of the first ones out oh it's a real real piece of garbage cool uh Mr. Yams now has a followup to this thread that we've talked about that there's too much crap on the store yes",
      "start": 7110.56
    },
    {
      "text": "that was like one of the first ones out oh it's a real real piece of garbage cool uh Mr. Yams now has a followup to this thread that we've talked about that there's too much crap on the store yes hey guys hey I like that fague I like it that was good he said say say hi Colin but you did it you you you filled the RO good for the last few weeks there has been a consistent topic that has been featured on the show and and it has me at two minds the oversaturation of games on the PS on one hand I do agree that there are a lot there's a lot of crap in the store however I hoarded myself out and played My Name is Mayo and got the trophies for PS4 and Vita after thinking about it I hope the developers make a good amount of money on this because I think they were smart to do this from a sales standpoint having said that don't game developers deserve the chance to make money as as crappy as the game may be to be able to make something even better in the future every developer comes from somewhere",
      "start": 7164.4
    },
    {
      "text": "having said that don't game developers deserve the chance to make money as as crappy as the game may be to be able to make something even better in the future every developer comes from somewhere and no matter how shitty the games they worked on in the past may be without those that we wouldn't have the games we love now without Joe Danger we wouldn't have the ambition of No Man's Sky regardless of how you feel about it we wouldn't have these Telltale games without them making that awful Jurassic Park game first Dice made Shrek and Treyarch made the bad Minority Report game not for nothing but there are bad games that are released physically that were made by veteran developers like Haze he's talking about the game Haze and let's not forget about that Whiplash let's not forget Whiplash was made by Crystal Dynamics in the end there are great developers out there but shouldn't they have the chance to put out content to have a chance at something greater besides when it's all said and",
      "start": 7205.16
    },
    {
      "text": "was made by Crystal Dynamics in the end there are great developers out there but shouldn't they have the chance to put out content to have a chance at something greater besides when it's all said and done isn't really up to the consumer to vote with their wallet uh peace I love you only when my wife isn't around thanks for all you do Mr. Yams Brian if you're nasty he says I yes and yes you are correct that that is a real thing however looking at the games of Haze and Shrek and Jurassic Park right people were trying on that you know what I mean and like now I can't speak to what the **** is Inner Kung Fu it doesn't look like somebody was trying super hard on it maybe they were maybe I'm being offensive maybe this is a great exercise yoga game that I'm just not understanding at a glance and how to use a controller with it but there's a line there My Name is Mayo yeah is Goofy and stupid but again like the argument yesterday you know Colin or last week I should say Colin was you know",
      "start": 7242.88
    },
    {
      "text": "and how to use a controller with it but there's a line there My Name is Mayo yeah is Goofy and stupid but again like the argument yesterday you know Colin or last week I should say Colin was you know very up in arms that like they were taking advantage of people and I my argument was they're not cuz I knew what I was buying people are buying this game knowing what they're buying it's an easy Platinum trophy and if there's a market for that and clearly there is the consumers are speaking and it's going to be hilarious when game charts and this game inevitably charts cuz Who the hell's buying Vita games unless there's some giant sale there is an audience for that they weren't lying about it I don't I like there was the art is good in it right like it's a Mayo jar but it's not like it's not this it is not the what the **** is this My Name is Mayo or of uh oh there you go 15 first 15 points just popped on this thing it is not this thing is this guy the bubble just expands around this man and",
      "start": 7285.8
    },
    {
      "text": "is not the what the **** is this My Name is Mayo or of uh oh there you go 15 first 15 points just popped on this thing it is not this thing is this guy the bubble just expands around this man and nobody knows what the hell's going on and but again maybe I'm selling the short maybe there's something actually happening here I don't know yes developers need to the argument Colin's making is and me to an extent too I guess isn't that you shouldn't your game isn't great enough actually that is Colin's thing that there needs to be somebody who plays the games I'm saying that you're allowed to make bad games and put them out there but I think there are people who are just shelling out shovelware garbage games that they know are terrible and they're not learning something from it they're not taking something away from it they're trying to make a quick Buck yeah totally like I like I think you can have a I think both are true I think it is it is true that you should the market you know the",
      "start": 7323.96
    },
    {
      "text": "something away from it they're trying to make a quick Buck yeah totally like I like I think you can have a I think both are true I think it is it is true that you should the market you know the market gets what it get it gets What It Wants right the market decides what what works and what doesn't and the Mayo one is like it's a Goofy idea and it's Kinda Funny and it's clearly self-aware there you go it's clearly self-aware and it's you know they know what the hell is going on and at least they're not trying to like to your point they're not trying to obfuscate what the game is they're pretty pretty upfront about what the goddamn is right um and you're right like you know maybe we shouldn't have a situation we we're dumping on games because people are are trying to make a living out of us regardless of what they do in the future I think the biggest missed opportunity of what's happening now and like what's happening now with PSN Store and what happened previously with Steam and what's",
      "start": 7363.2
    },
    {
      "text": "regardless of what they do in the future I think the biggest missed opportunity of what's happening now and like what's happening now with PSN Store and what happened previously with Steam and what's happened basically kind of iOS every the lack of curation is that eventually it's a business decision like eventually it became too much of a problem for the the the whatever the door men of of of gatekeepers sorry of of to to vet everything that went through it became too expensive so they created a marketplace where the market decides and the relevant stuff pops up to the top yeah what I miss is what we had prior which is when digital games came out on PS3 and uh late PS3 and early PS4 which was that whenever those games came out they were curated for the system and we knew that they were good and they were relevant and they kind of had the same thing over on Microsoft with the Xbox Live the the summer stuff like that I missed that because that was cool because that was basically",
      "start": 7405.0
    },
    {
      "text": "were good and they were relevant and they kind of had the same thing over on Microsoft with the Xbox Live the the summer stuff like that I missed that because that was cool because that was basically the the gatekeeper saying here are some games that you probably would have ignored in this shovelware world but we're actually kind of we're kind of backing them we're we're vetting them we're saying these are pretty cool so I think that's the one thing that we've lost in this other than that I think it's kind of hilarious that you're able to have all this like shovelware crap in there I mean like Sony will do Spring Fever and all that jazz and like buy this one get this percentage off of that like Salt and Sanctuary was that lineup right I would love it to see and I know this would never happen at Sony and even at Microsoft probably not cuz worry about alienating people right uh and relationships and business things not you know personal feelings but if you could if PlayStation could",
      "start": 7451.24
    },
    {
      "text": "happen at Sony and even at Microsoft probably not cuz worry about alienating people right uh and relationships and business things not you know personal feelings but if you could if PlayStation could exist and they could have they could totally invest in Sid's team Justin and Ryan right of like you guys can have very vocal opinions we're not going to hate that and maybe it's a different team but a personality driven team where it could be you go to the store and it is every week There's an update and it's like Ryan's pick Sid's pick Justin's pick or picks of like all right cool hey if you have this this is what you should get this week and like otherwise it is you have to listen to IGN or us or whoever your respected peers that you care about in the industry and see what they want and find it all your own but that doesn't help the consumer who jumps into the new releases on PlayStation is just and it's all shitty and it's like all these DLC costumes in front to get to the new game",
      "start": 7488.48
    },
    {
      "text": "find it all your own but that doesn't help the consumer who jumps into the new releases on PlayStation is just and it's all shitty and it's like all these DLC costumes in front to get to the new game that is over here it's like what the hell is that and I think in a weird way what's taken over that place has been PlayStation Plus cuz that is kind of the free games on there cuz that is them saying like these are the games that we're kind of championing right even though there's like business deals behind it and it's not NE I mean there was business deal based on every one of these promotional things ever done right but like it feels a little bit less pure it feels like more of a okay we're kind of in on this as well with with them so maybe them also having a separate thing where they're highlighting good games ends up running counter to that in terms of messaging I don't know sure um but yeah like my my I just hope it doesn't get worse cuz right now it's there's a lot of crap there I",
      "start": 7528.36
    },
    {
      "text": "good games ends up running counter to that in terms of messaging I don't know sure um but yeah like my my I just hope it doesn't get worse cuz right now it's there's a lot of crap there I think it's going to I think it's going to get more and more especially as more and more people are not I I don't see it as negatively as Colin does because I do think there are plenty of developers out there who are trying and the game isn't great sure but why why shouldn't they have the shot to do that but it is I think there's going to as more and more people not run do it in terms of uh hey let's there's money to be made here if we make a crappy game put a Platinum more people going like all right cool I'm going to try I the tools are getting cheaper they're getting easier to use it's going to be easier for me to get stuff in I think you'll see more and more stuff but then it just does become there needs to be a solution but then you find things like you know the Vita Lounge or IGN or whoever",
      "start": 7564.8
    },
    {
      "text": "easier for me to get stuff in I think you'll see more and more stuff but then it just does become there needs to be a solution but then you find things like you know the Vita Lounge or IGN or whoever reviewing games or just word of mouth or streamers or however it's might be I want to check on the readers Danny all right now it's funny because you mentioned that they're PlayStation Plus yes I have a a question here about PlayStation Plus that I think you're going to enjoy again remember if you want to be part of the show kindafunny.com/psq to get your question read on the air this one comes from Rob Man and Baton Baton what's up everybody if you didn't know ah Christ I don't know how you guys do that every day a big friendly ass hello from Ireland I wanted to run something by you guys about PlayStation Plus so let me lay it on you like your boy Colin M. lays Mayo on an unsuspecting culinary delight so I'm a fairly Casual Gamer who likes to follow the goings of the industries I play a",
      "start": 7602.92
    },
    {
      "text": "PlayStation Plus so let me lay it on you like your boy Colin M. lays Mayo on an unsuspecting culinary delight so I'm a fairly Casual Gamer who likes to follow the goings of the industries I play a handful of games every year and try to pick a mix of AAA and smaller titles so I can be part of the discussion when I got my PlayStation 4 I signed up to PlayStation Plus and availed of a few free games which was great is he using is that what does availed mean that way availed yeah I an availed of a veiled I I took advantage of oh okay I'm not familiar with that no no is that an Irish thing now I don't know Kevin have you ever heard of veiled Ed that way sh your head now now Kevin and I are stupid though so easily I don't know I get tripped up on that stuff all the time I realized that I've been saying something that nobody knows put slang yeah uh I've now got quite a backlog of games to play so I decided to not pay for my PlayStation Plus subscription this year sits down to play some sweet",
      "start": 7644.16
    },
    {
      "text": "saying something that nobody knows put slang yeah uh I've now got quite a backlog of games to play so I decided to not pay for my PlayStation Plus subscription this year sits down to play some sweet ass Rocket League what in the name of all that is sacred what is the **** is this I've now been locked out of the game I received through PlayStation Plus such as Rocket League and Super Meat Boy which were my go-to games for wasting half an hour here or there I know PlayStation Plus is a sweet deal but do you guys think it's fair that by opting out I lose access to these games thanks for the most resonant gaming conversation on the worldwide web love always Rob Man and Baton then he puts in parenthesis Batman and Robin but switch Bat for Rob because that's how much time we have on our hands with the shitty internet connections in rural Islands wait does he say where he's fromal Island just Rural Island just rural Ireland the rural juror everywhere the rural juror uh I watched 30 Rock for",
      "start": 7685.08
    },
    {
      "text": "with the shitty internet connections in rural Islands wait does he say where he's fromal Island just Rural Island just rural Ireland the rural juror everywhere the rural juror uh I watched 30 Rock for the first time this year actually oh wow main the whole thing oh wow it was great uh everywhere in Ireland's Ro AR just you know except for Dublin okay great so he could bewhere I mean I I wish I could help you here and I'm going call you Rob Man Rob Man I wish I could help you but no that's been the thing from the beginning and like that's that's the subscription service part of it now the good news is that you could you know plunk down if you figure that out you plunk down for one month play whatever you need to play off your thing and then keep coming the games you've redeemed are still redeemed to your account you can go back and get them but I feel for you it was mainly that you're Ireland and he's Irish I want to get something in here yeah I I just I remember what it was like having",
      "start": 7725.12
    },
    {
      "text": "to your account you can go back and get them but I feel for you it was mainly that you're Ireland and he's Irish I want to get something in here yeah I I just I remember what it was like having to really be very very very very picky about the games that I bought because like you know like especially when I was in college for instance like not having any sort of income to do it and also not having your parents sort of be able to help you out as much as I used to um but like yeah I think I think that probably shock him because he didn't realized it was going to happen but when you sort of look at it in terms of like any other streaming service like if you had Amazon Video or Spotify and you listen to you know you didn't buy the latest you know Deftones album because you wanted this literally happened to be you wanted to listen to it on Spotify and then you stop your subscription and then or like for me like it was like I had to buy the Taylor Swift one right because that was the only",
      "start": 7762.32
    },
    {
      "text": "happened to be you wanted to listen to it on Spotify and then you stop your subscription and then or like for me like it was like I had to buy the Taylor Swift one right because that was the only way to get it was on iTunes on on the music um so I think it's like yeah you got to you got to remember that that's that's you were having it's a really good deal when you got it and then when you don't I guess if those are games that you want to go back and play you got to remember they're not part of your catalog but then is anything ever going to be part of our catalog like the PS3 PS4 transition you know there was stuff Lost In the Mix there lot stuff so yeah the idea of like those libraries being there forever is a is a sort of fading slowly you know you know we always talk about the digital future here and how we think that's the thing but it does bring up a good thing of ownership of like you know like PT like right if that gets removed like okay cool it can live on your system forever",
      "start": 7804.24
    },
    {
      "text": "future here and how we think that's the thing but it does bring up a good thing of ownership of like you know like PT like right if that gets removed like okay cool it can live on your system forever but if your system dies and you get a new system and that was the big thing when people were getting their PlayStation 4 Pros of like would the transfer actually bring it over and it does but that's a scary thing in terms of like what does that all mean and how does that all happen yeah I was looking at like um PlayStations on uh eBay and there were people selling ones with PT on it for higher than the other on making a huge deal crazy yeah I've got I've got PT on my one as well and I'm terrified to do anything with it Danny I got two ones for you do it and this yeah here we go Troy J. Troy what what will PlayStation do from a marketing point of view when Scorpio is released I don't think they're going to do much of anything I don't think they're going to drop the price of the Pro I don't",
      "start": 7842.8
    },
    {
      "text": "what will PlayStation do from a marketing point of view when Scorpio is released I don't think they're going to do much of anything I don't think they're going to drop the price of the Pro I don't think they I mean they'll continue to do commercials like they do now Greatness Awaits and all that jazz but I don't think they're going to I don't think they're going to make it I think if anything when Scorpio's release next year if that's what actually ends up happening we'll see if they actually stick to it it'll be more of a how did they do it wait and see what's happening where are we there's too many things up in the air the price is a big one um the power is obviously the other one in a way I feel like if this is if if if what we're hearing about the the proposed sort of teraflops of of it is true then then it is it's going to be so far ahead of the PlayStation Pro that they almost don't have to worry about it like it's not like they're necessarily competing against it so if",
      "start": 7878.68
    },
    {
      "text": "of it is true then then it is it's going to be so far ahead of the PlayStation Pro that they almost don't have to worry about it like it's not like they're necessarily competing against it so if that's the case then it becomes a price war right then they're like oh yeah sure you can play that and get all those games that that you know it runs that much better but like probably only the first ones are going to really take advantage of it the rest of the stuff is already looking really good on our systems and it'll cost you $150 or $00 less so I don't know like I I I think in a way if they don't compete with them then they don't make it a narrative of the two things competing unless they can get an in which will be the price if they can get a foothold right yeah like this is why we're the better option sure but I think I mean for me the big thing is like what about PlayStation Pro right now like play like where's the marketing for it right now like you don't know that system's out",
      "start": 7919.04
    },
    {
      "text": "the better option sure but I think I mean for me the big thing is like what about PlayStation Pro right now like play like where's the marketing for it right now like you don't know that system's out if you're not that person if you're not and you look at the bundles they're putting on TV the ones I'm seeing correct me if I'm wrong I'm seeing Slims I'm not seeing yeah that when I see like you know again but I guess I'm not seeing him in general I'm thinking the last time I caught during The Walking Dead I saw that greatness of waste commercial there wasn't one there but I could have sworn I saw a bundle but I actually take that back I don't know I'm not seeing any PlayStation on there so why why how would anyone know about them work what I want to do is go into a into a GameStop and see what happens when you talk to like a point of sale person right because like to me what it's weird to me what I think is happening is that the PlayStation Pro is coming out and we're kind of looking at",
      "start": 7961.2
    },
    {
      "text": "happens when you talk to like a point of sale person right because like to me what it's weird to me what I think is happening is that the PlayStation Pro is coming out and we're kind of looking at it as an upsell thing because you know this is a PlayStation podcast and like working the games world the games coverage and we own all these consoles and blah blah blah blah I think the reality of what that system is is that it's an upsell to people who haven't bought a PlayStation yet who are like you're not buying this piece of Hardware that's now two and a half years old it doesn't feel as special anymore you're spending probably what we would have spent you've already saved the money not spending it in the past two years and here it's an even better one it's actually better than everyone else's like it's the iPhone 5S to iPhone 5 of consoles and I think that's the right way to do it and I'm not sure if that's also what Microsoft are doing cuz what they're doing they're making it sound",
      "start": 7993.64
    },
    {
      "text": "like it's the iPhone 5S to iPhone 5 of consoles and I think that's the right way to do it and I'm not sure if that's also what Microsoft are doing cuz what they're doing they're making it sound like it's a new thing they're making a it it looks like the because obviously the Xbox One is well underperforming in comparison to the PlayStation 4 and it does look more like a sizable jump and I think the messaging on that is messy because it it that is the one that makes me feel like my Xbox One is going to be worth dirt yeah uh whereas the PlayStation Pro I'm more than happy for that to exist and I'm I'm kind of fine with my current at the moment um and I think them releasing it before Christmas with PlayStation make sense if they're going to do it around the sort of Q q1 Q kind of spot where they're kind of they're are slaming for like March April isn't that oh no no we're going to hear for the Scorpio no no Scorpio we're supposed to hear More E3 I thought and then it comes out next fall",
      "start": 8026.24
    },
    {
      "text": "they're kind of they're are slaming for like March April isn't that oh no no we're going to hear for the Scorpio no no Scorpio we're supposed to hear More E3 I thought and then it comes out next fall okay okay well then that makes sense I think as well that it is sort of an upset thing you're going to get that Switch hotness in March oh yeah sorry that's coming in March yeah yeah so uh yeah I'm looking forward to that yeah me too the rumors out of that seem like the price point will be good as well yeah just make the battery good that's all I want yeah so but I yeah I don't know I I feel like yeah will it'll it'll be the specificities of the the cost and the power are going to lead Sony will lead on that yeah yeah final reader mail comes from Angel Fire he says hi Colin and Greg hey what's up I appreciate everything you guys do to make my mornings that much more awesome after listening to you guys for many years I've noticed how Colin has recently started saying things like quote I don't",
      "start": 8063.4
    },
    {
      "text": "I appreciate everything you guys do to make my mornings that much more awesome after listening to you guys for many years I've noticed how Colin has recently started saying things like quote I don't care I don't own stock and insert game company here andot I do I do say that a lot yeah why not is Colin not interested in investing this future or is there some moral quandry that prevents Colin from investing specifically in gaming exposed companies well Angel Fire I mean the answer is kind of simple there right it's the fact of how would you believe anything we ever said again if we owned stock in Play If I own a stock in PlayStation right and I was on this thing and I was constantly that's a weird example I guess because I do I always talk about PlayStation but you know what I mean like if I if there's if I owned Activision stock and I was like Call of Duty is so much better than Battlefield how could you believe me cuz clearly I have a personal interest a vested",
      "start": 8101.68
    },
    {
      "text": "what I mean like if I if there's if I owned Activision stock and I was like Call of Duty is so much better than Battlefield how could you believe me cuz clearly I have a personal interest a vested interest in that right now as it stands yeah we like trophies we like the Vita that's our investment in PlayStation so why you should listen to us I love what this question always comes up and I always I don't even like how do you buy stock in the like I know you can buy like small amounts of stock on like publicly traded companies but like even if you wanted to it's like you throw in a grand and it C you save up all this money and you put it in and then in like a year it's worth like extra $70 it's like I don't know I hate the the world of of Sony stock Sony what you want to buy Sony stock no I had Sony stock you had Sony stock I have still Sony stock I bought it right after all that bad stuff happened with Sony he's not the PSN outage yeah gotcha and uh I bought it at like $11 and I sold",
      "start": 8144.36
    },
    {
      "text": "I had Sony stock you had Sony stock I have still Sony stock I bought it right after all that bad stuff happened with Sony he's not the PSN outage yeah gotcha and uh I bought it at like $11 and I sold it at like 3 really it's how I bought myit yeah really yeah I take it back I mean that's how stocks work clear buy do that you know I mean granted I own Virgin America stock I'm always talking about how great Virgin America is everybody knew that though beforehand I bought the stock long before no no I've been talking about Virgin America long before I bought the stock and again that's a bit different I don't know if I'm influencing the air airline industry but on a game like we made my well no no we made Taco Master chart right so if I somehow own stock in Taco Master and then I was telling you about and it's the same thing with that Call of Duty betting **** you know what I mean right Kevin I guess can own whatever the **** he wants cuz nobody listens to Kevin he doesn't talk about",
      "start": 8187.52
    },
    {
      "text": "you about and it's the same thing with that Call of Duty betting **** you know what I mean right Kevin I guess can own whatever the **** he wants cuz nobody listens to Kevin he doesn't talk about games what about port you any stock wish God can you imagine Jesus cash it in for meat Danny are you ready to meet your best friend of the week sure let's do it this is a segment we call PS I Love This Best Friend XOXO it's where one of you goes to KindaFunny.com forums submits your PSN name and then why you need friends and they send you new friend requests and they send you nice messages and everything the best friends are all best friends is what happens this one comes from King Franchise it's not for himself oh but I I like it all the same and I think we actually already answered the question but stick with me cuzz I'm going to have it's buried in here okay but it's a fun little story as I write this I'm watching my 64 sorry my watching my 64-year-old dad play PS4 for the first time",
      "start": 8232.32
    },
    {
      "text": "but stick with me cuzz I'm going to have it's buried in here okay but it's a fun little story as I write this I'm watching my 64 sorry my watching my 64-year-old dad play PS4 for the first time and not just any PS4 it's his own personal console he's seen me play for years now but never really had any interest in picking up a controller himself until the PSVR came to town I secured myself a VR on launch day and have been enjoying greatly my Dad decided he wanted to give it a shout has been hooked ever since he put on the headset he's been through the entire PSVR world's disc and dabbled in Batman VR I plan on buying him his own VR for Christmas but for now he's decid he's dedicated no decided to test the waters on a few of my games I wasn't too sure which game to start them off on but based on everything I have and how challenging it is I decided to start him off with Ratchet and Clank okay it's fun has great graphics isn't too punishing and it's probably the simplest game I own this",
      "start": 8271.52
    },
    {
      "text": "on everything I have and how challenging it is I decided to start him off with Ratchet and Clank okay it's fun has great graphics isn't too punishing and it's probably the simplest game I own this leads me to my questions he says but it's like do you think PSVR has the the potential of bridge Gamers and non-Gamers we kind of touched on that with the moms and Thanksgiving and I'll be coming around and then all the stuff and then what what do we think of his game selection I think that's a great game selection yeah that's a great show but to the heart of PS I Love This Best Friend XOXO he says and one more thing his PSN name is Old Man Walking that's O L E M A N W A L K I N strong name he puts in parentheses not bad right he came up with his on no help he came up with it on his own no help from me thanks for everything and keep up the tremendous work and Andrew Francis I think we should all go be friends yeah with Old Man Walking that's great that's awesome a 644 year old man playing",
      "start": 8316.88
    },
    {
      "text": "from me thanks for everything and keep up the tremendous work and Andrew Francis I think we should all go be friends yeah with Old Man Walking that's great that's awesome a 644 year old man playing Ratchet and Clank somewhere Ted Price very excited about this announcement very excited about all this stuff that's happening Old Man Walking you think yeah that's how he says every time he turns it on like Dad just play the game shut up uh this week's forgotten PlayStation game comes from Riley Delete Riley Delete wrote in and said hey there guys I'm a big fan and you guys keep on getting better your quality is so awesome I decided to become a patron thank you very much don't forget about NoClip anyway I'd like to submit my personal pick for what I thinks to be deserves to be the Forgotten PlayStation game of the week it's a Charming platform Puzzler on the PS3 named PID (P.I.D.) or Planet in Distress follows the adventures of a young boy named Kurt after he falls asleep on an Interstellar bus",
      "start": 8356.68
    },
    {
      "text": "game of the week it's a Charming platform Puzzler on the PS3 named PID (P.I.D.) or Planet in Distress follows the adventures of a young boy named Kurt after he falls asleep on an Interstellar bus and becomes stranded on a strange World it quickly appears that something is wrong on this planet and Kurt embarks on a journey to find a way to get home in brief the game is fantastic having a unique platforming aspect based on gravity manipulation as well as a surprisingly good story add on what is perhaps one of the best soundtracks I've ever heard courtesy of the band called Retro Family and you have a great package for a good price there's even an unlockable hard mode difficult Collectibles and trials to keep you coming back I know Colin reviewed this game and his review is the reason I bought it years later with the game on all of with a game on all my consoles I can safely say #c was right thanks guys keep being funny and awesome Riley great show that game was great I believe it was a PS3",
      "start": 8397.36
    },
    {
      "text": "years later with the game on all of with a game on all my consoles I can safely say #c was right thanks guys keep being funny and awesome Riley great show that game was great I believe it was a PS3 to begin with yeah I think but then he throws me with on all his consoles so I don't know where it's probably come out in Steam baby game that's a great game it had like gorgeous like environmental like lighting effects and it was was almost looked like it was watercolor I watched a trailer of it and I think I either remember playing it when Colin was doing stuff or just watching and talking to him about it but yeah some people didn't like it cuz it had had the like floaty LittleBigPlanet kind of stuff but I was into it yeah good it was cool there you go I'm glad I got your Ste great shout yeah the good one good uh PSN's Worst Name of the Week of course ladies and gentlemen this is another segment where you go to.com fors submit a bad PSN name we maybe read it here then you get to put in",
      "start": 8438.24
    },
    {
      "text": "the good one good uh PSN's Worst Name of the Week of course ladies and gentlemen this is another segment where you go to.com fors submit a bad PSN name we maybe read it here then you get to put in this weird Battle Royale voting system they do turns out can I tell you a about one actually yeah sure um I feel like I'm throwing under the bus I'm so sorry Mary and Mary Kish when she she she wants the PS the PlayStation like update name thing more than anyone we always beg Shuhei hey please let us change her names and I think it was cuz she didn't have the a PSN account when she joined GameSpot so she made one really quickly one day and it was like almost autogenerated and I I don't even know what it is but it's basically like MK and then like like a string of eight numbers it's like almost their social security something it's just like MK 84171 so whenever you're like trying to like yeah exactly so you never trying to add her she like doesn't remember what it is and you have to go find out",
      "start": 8478.56
    },
    {
      "text": "social security something it's just like MK 84171 so whenever you're like trying to like yeah exactly so you never trying to add her she like doesn't remember what it is and you have to go find out what the **** thing is send you a text yeah it sucks well this one comes from a man named DW we say man I don't know I have to guess sometimes D DW writes in and says hello Colin and Greg hey first time long time back in October 000 I was eagerly awaiting the release of the PS2 around the same time I was really into the band Presidents of the United States of America as you may know their song Lump is a little diddy but once you hear it you have a hard time getting it out of your head one day Lump was stuck in my head and I started rambling off words that rhyme with lump I stumbled onto the madeup word Quum that's with a Q and I was immediately drawn to it weeks later when I picked up my reserved PS2 I booted up TimeSplitters and decided to name my character Mr. Quum I have since used Mr.",
      "start": 8518.64
    },
    {
      "text": "word Quum that's with a Q I was immediately drawn to it weeks later when I picked up my reserved PS2 I booted up TimeSplitters and decided to name my character Mr. Quum I have since used Mr. Quum for all of my gaming needs including my 9-year-old PSN account now this isn't bad so far okay because we've had really bad ones right you know I mean like stupid kids being racist over the years I've grown accustomed to people taking liberties with my name most notably Mr. Dump which I now wear as a badge of honor however since the election my Overwatch crew has taken a calling me Mr. Trump knowing it irks me endlessly I fundamentally disagree with Mr. Trump and almost every issue and I just dislike him so being compared SL reference to him does not bring any enjoyment whatsoever the next four years were already going to be rough for me and now my favorite form of escapism is now tainted I know I should just be a bigger person and not let it bother me but I don't see that happening anytime",
      "start": 8561.72
    },
    {
      "text": "years were already going to be rough for me and now my favorite form of escapism is now tainted I know I should just be a bigger person and not let it bother me but I don't see that happening anytime soon please Shuhei let us change our names thanks DW/ Dump Dud for all the all the Democrats out there the world of video games they've all been D all the Republicans Trump yeah yeah that sucks that's that's a bad one that is a bad one did you have any like that that sounds to me like when you were in primary school or what are you guys Elementary School yeah um and your surname did you have any like Miller like taking a piss out of you because you were like like oh I'm more like Greg Spiller oh sure I'm sure like that I had a mole behind my ear and they call me Mole like Moly Moly Moly Moly no just Mole was that hard when that what was the movie The no cuz that was long gone by then that's like that's like a childhood thing and then eventually called Mole yeah **** but it's like the the",
      "start": 8605.76
    },
    {
      "text": "just Mole was that hard when that what was the movie The no cuz that was long gone by then that's like that's like a childhood thing and then eventually called Mole yeah **** but it's like the the great above you or whatever just yeah exactly exactly kind of **** and then I had a friend I've told this story before in summer camp who called me Spud but it was a term of endearment and I did like that one cuz what do you SPL like qualities may I mean look at me yeah I got plenty of split like qualities Danny if you didn't know ladies and gentlemen this has been PS I Love You XOXO it is KindaFunny.com PlayStation podcast so go there subscribe to the other YouTube channels watch the other podcast enjoy the content it is the number one PlayStation podcast on the internet and it posts every Tuesday at 9:00 a.m. Pacific Time on podcast services around the globe along with youtube.com/KindaFunnyGames remember Danny O'Dwyer is from NoClip I am when I'm not being Colin Moriarty thank you very",
      "start": 8649.6
    },
    {
      "text": "Tuesday at 9:00 a.m. Pacific Time on podcast services around the globe along with youtube.com/KindaFunnyGames remember Danny is from NoClip I am when I'm not being Colin Moriarty thank you very much for taking on this tremendous opportunity of being Colin Moriarty appreciate it no problem anytime everybody go subscribe to NoClip YouTube channels back them on Patreon go to the GameAwards.com vote for Danny for Trending Gamer of the Year 2016 and we just keep we'll keep see keep we'll never let this award go so much so much Ang thanks so much to everyone who has already I can't can't thank you enough it means a lot remember uh this week Thanksgiving if you're hearing the Thursday of Thanksgiving through Monday we have a new we have a T-Shirt sale going on or not a T-Shirt sale but a T-Shirt event going on at KindaFunny.com store you can go there and get all the exclusive uh Whata call them T-Shirt Tuesday things from before you got them from last year you got some of the ones",
      "start": 8689.68
    },
    {
      "text": "T-Shirt event going on at KindaFunny.com store you can go there and get all the exclusive uh Whata call them T-Shirt Tuesday things from before you got them from last year you got some of the ones from this year there's cool stuff happening over there remember PSX is happening Sunday uh 1 4 is our panel at noon Saturday before at 1:3 we'll be doing pre-show postshow reaction stuff here on twitch.tv/KindaFunnyGames and that Sunday after the noon panel for PS I Love You XOXO there's a meet and greet right at 1 pm and then you can take a break then yeah then it just totally chills out except for the fact that we're taking two weeks off at the end of the month so it's like two days for podcast oh yeah totally no big deal I'm sure the content won't suffer real same this week right Thanksgiving week yeah no no tomorrow's gogging gamescast back to back got Alfredo Diaz coming in here hey guys I look really cool I'm a really nice guy my girlfriend's hoty I have a great life everything's amazing",
      "start": 8735.8
    },
    {
      "text": "yeah no no tomorrow's gogging gamescast back to back got Alfredo Diaz coming in here hey guys I look really cool I'm a really nice guy my girlfriend's hoty I have a great life everything's amazing I'm super nice to everybody no afraid of good at games too I'm really good at games this **** guy yeah every episode of PS I Love You XOXO ends in a song in a segment we call Singing is Shuhei this is where one of you marvelous **** goes to KindaFunny.com/PSM leaves a song for me you made this song I need an MP3 download link to put at the end of our MP3 and I need your YouTube video to annotate from our YouTube video today's comes from someone returning this is the legendary Zoltan oh my God Zoltan the Zoltan the Legendary Zoltan is back and he writes hello Colin and Greg hey actually says Greg and Colin oh I screwed it up it's all right it's okay I'll take it thanks so much for playing my Final Fantasy Tactics death metal song I ask you yet again wouldn't you rather hear songs that have so",
      "start": 8774.0
    },
    {
      "text": "and Colin oh I screwed it up it's all right it's okay I'll take it thanks so much for playing my Final Fantasy Tactics death metal song I ask you yet again wouldn't you rather hear songs that have so something to do with PlayStation on your PlayStation podcast of course you would of course everyone would I got a whole bunch of comments parentheses like 10 of them saying that they always skip Singing in Shuhei but not this time because they were dying to listen to some mother destroying Final Fantasy Tactics death metal and you'll be interested to know that they all said that they were not disappointed I'm telling you guys PlayStation players need PlayStation metal so I offer a service to this community post somewhere I don't know where maybe in the comments of the SoundCloud file or on the YouTube video of today's song a PlayStation game you'd like to hear metalize and I'll make whatever it is I'll make whatever is the most popular for you guys that ought to tie you over until the",
      "start": 8827.92
    },
    {
      "text": "the YouTube video of today's song a PlayStation game you'd like to hear metalize and I'll make whatever it is I'll make whatever is the most popular for you guys that ought to tie you over until the Valkyrie Profile death metal album comes out oh my God music and lyrics are done now I search for the recruitable musicians to record it so look forward to that today I bring you Armored Core death metal it's freaking amazing enjoy I will see you all again love the legendary Zoltan it's good fit he's a he Nails it he writes in with character last time he was like usually I'm like oh nobody gave me the you know I make fun of people for not giving me a website to promote and last time he's like just search the legendary Zoltan and you'll find it like damn legendary Zoltan you lay people out I like that a lot ladies and gentlemen one more time thank you to Danny O'Dwyer for being a human being that I love very much and being good to us thanks for having me thank you legendary Zoltan for this s here it is",
      "start": 8874.12
    },
    {
      "text": "a lot ladies and gentlemen one more time thank you to Danny O'Dwyer for being a human being that I love very much and being good to us thanks for having me thank you legendary Zoltan for this s here it is Armored Core death metal hold on to your ass when you get the blues come on and get a rhythm when you get the blues is that Creedence n Johnny Cash oh yall say what was last week what were we singing last week me no Colin was singing something last week oh in between questions yeah yeah yeah vibrations Good Vibrations it's been it's been tearing the community apart if he was on if he was on Rhythm or not no he was too slow at the start thank you thank you very much that's what I said but but when you started singing it I literally was thinking are you are you singing a different song yeah cuz it did sound like it was you Danny here you go you all set you all set over there clamping around ah getting your foot rest up like where your head's at",
      "start": 8922.16
    }
  ]
}
