{
    "id": 165,
    "video_id": "1z7ynRw6N6k",
    "show_name": "Gregway",
    "hosts": [
        "Greg Miller",
        "Portillo"
    ],
    "title": "Oreo Oration Returns, Announcing the New Show - Gregway",
    "description": "Listen, it's time we talked about where this GameOverGreggy channel is going. So, come listen to Greg lay out the battle plan for December. New content! A new show! New shirts!\n\nSUBSCRIBE/LIKE/SHARE\n\nLeave your questions for Greg in the comments and check back every Wednesday and Friday to see what he's saying.\n\nSubscribe to Greg's channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nOur Merch Store is live: http://www.districtlines.com/gameovergreggy\n\nThe Vlog playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVv1g9oZi6O95CwRHQd0ulT6\n\nSubscribe: http://www.youtube.com/user/GameOverGreggy\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy",
    "published_at": 1385128804,
    "duration": 328,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to Gregway all right congratulations to the one person who noticed I didn't put an episode number on this one just my face that's the new thing episode numbers are stupid we're moving away from that but that's what I'm here to talk to you about not answering a question usually Gregway they pop up every Wednesday and Friday you guys ask a question or girls I answer the question for you we all have a big enjoyable time but here's the thing there's a lot of housekeeping notes about GameOverGreggy.com youtube.com/GameOverGreggy uh some stuff's coming up here we want to make sure everything is in order hey we hit 50,000 subscribers thank you I want to thank you all thank you all so much for supporting us while we make these dumb videos and have fun with you and horse around and talk in the comments for an hour every morning big fan of that so here's what we're going to do to celebrate 50,000 subscribers we're not publishing a video at all",
            "start": 0.08
        },
        {
            "text": "fun with you and horse around and talk in the comments for an hour every morning big fan of that so here's what we're going to do to celebrate 50,000 subscribers we're not publishing a video at all next week not see if you're not in if you're not in the country you're not here in America you're over there in the Brit oh it's me McDonald what Thanksgiving I don't remember that one oh when we let you go that was foolish of us uh no thank thanksgiving's next week it's a it's a holiday we're not going to have any time to make videos so next week we're taking a week off I'm just going to promote cool content we've done in the year and a half we've been doing the channel that's great that's fun so you might be asking then how are you going to come back Greg what are you going to do to come back huge in December and what day would that be hold on I got my little iPad here product placement if you want to throw me a few bones Apple you know what am I going to do when we return the week of December",
            "start": 40.12
        },
        {
            "text": "in December and what day would that be hold on I got my little iPad here product placement if you want to throw me a few bones Apple you know what am I going to do when we return the week of December 2nd well ladies and gentlemen you know what that sound means yes Oreo Oration will return for limited engagement five episodes Monday through Friday Oreo Oration just for you there'll be some holiday Oreos tossed in there there will be regular Oreos tossed in there this is for you guys a lot of you have been very vocal about wanting more Oreo Oration I am happy to bring it back in a limited run and hopefully we finish them off and then we just have to pick up the banana split one here there whatever no big deal oration for you but then we're going to get back to business the week of December 9th right so December 9th it'll be everything you expect a conversation with Colin Greg W Tuesday through Friday you know the shows pretty well but here's the big one ladies and gentlemen we are",
            "start": 72.76
        },
        {
            "text": "9th right, so December 9th, it'll be everything you expect - a conversation with Colin Greg W. Tuesday through Friday, you know the shows pretty well, but here's the big one, ladies and gentlemen, we are debuting a new show every Monday. What's that show called? It's the Game Over Greggy Show. We're gonna use mics like this. What is the Game Over Greggy Show? The Game Over Greggy Show looks like this - start with me, start with him, probably the least prepared of all of us I bet no 100% prepared. Disney Princess list - wow, you got R, you got right out of the gate with that. Well, everybody, it's been a fun run of the Game Over show. Encouragable aren't they? No, what it is, is it's four best friends getting together each one of them brings a topic to the table and every Monday we discuss each one of those topics. It goes for a long time - it's like an hour and a half. We're giving you this awesome video podcast every Monday now. We will literally have nerdy conversations every day on GameOverGreggyDay.com, and what's",
            "start": 114.4
        },
        {
            "text": "\"Go for a long time, it's like an hour and a half. We're giving you this awesome video podcast every Monday now. We will literally have nerdy conversations every day on GameOverGreggy Daycom, and what's really cool about the Game Over Greggy show if you ask me - and you are because you're still watching - is that you get the free show on YouTube right? You come here, you watch us all clown around at this table in this very setting with these very mics. Or if you want, you can go to our Bandcamp page and for 99 cents get a high-quality MP3 you can listen to wherever you go. Because guess what - I'm not going to go through an hour and a half and put B-roll over Jack; not a thing that's happening. So instead, you go there, you get the MP3, you listen, you come to YouTube, get it for free, you have a good time either way. We thank you for your support, and how else do we thank you for your support? Let me tell you. All right, I know these holidays are right around the corner - oh man, that Graham's what are you going to\"",
            "start": 157.64
        },
        {
            "text": "Way we thank you for your support and how else do we thank you for your support? Let me tell you. All right, I know these holidays are right around the corner. Oh man, that's what Greg Miller is going to get his wife, Graham, maybe you want to get her some MP3s of our show, but that's hard to stuff in a stocking unless you get an iPod, but God, who has the money these days with iPods going for upwards of a grand? So you know what you do? You go to the brand new GameOverGreggy store. That's right, we finally have a merch store, and what are we selling? Well, ladies and gentlemen, two T-shirts: number one, the GameOverGreggy shirt; you've probably seen it on my body, there it is. You can go buy this now almost not now in December when we launch the show. You can go buy it there, and what else can you get? Finally, a shirt for the man who should be president in all of our hearts, Colin Moriarty. Look at it; it's blue, got some blue text on it too. Huh, looks like a certain Rockman.",
            "start": 196.48
        },
        {
            "text": "and what else can you get finally a shirt for the man who should be president in all of our hearts Colin Morard look at it, it's blue got some blue text on it too huh looks like a certain Rockman I know that's Mega Man's name in Japan I did not know that till today so there you have it ladies and gentlemen lots of awesome stuff coming up to youtube.com/gameovergreggy so let's recap thank you for your support 50,000 Subs that's awesome keep telling your friends keep sharing the videos we do this have a conversation with you a nerdy conversation with you every day then Thanksgiving no new episodes week after Thanksgiving December 2nd we are back with five new Oreo orations just for you please enjoy them share them and stop asking me every time you see me at PAX then December 9th the big one we're back big time with a new show the Game Over Greggy show four friends just chatting it up drinking a few brews about all sorts of manner of just horrible things and then finally the merch",
            "start": 239.96
        },
        {
            "text": "one we're back big time with a new show the GameOverGreggy show four friends just chatting it up drinking a few beers about all sorts of manner of just horrible things and then finally the merch store launches in December you can buy your own t-shirts that have our stuff on them and if you buy enough of the initial run we will make more and then one day maybe pogs but I'm not don't quote me on it maybe so as always ladies and gentlemen thank you so much for your support thank you for telling people to subscribe to youtube.com/ gameovergreggy and thank you for just being so goddamn beautiful",
            "start": 283.64
        }
    ]
}