{
  "id": 1098,
  "video_id": "11fj2g3vTs8",
  "show_name": "Oreo Oration",
  "hosts": ["Greg Miller"],
  "title": "Brownie Batter Oreo Review - Oreo Oration",
  "description": "Two desserts collide on August 10th, and Kinda Funny has your first look at Brownie Batter Oreo Cookies!\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
  "published_at": 1438876508,
  "duration": 661,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Welcome to Oreo Oration. I'm Greg, and while you're out living your life getting ready for that Metal Gear Solid 5: The Phantom Pain, the fine people at Oreo are making endless variations to Milk's Favorite Cookie. So every time there's a crazy new flavor, I tear up in a new package and give you a tasty review without any calories. If you like that, like this video, subscribe to our channel, and keep on coming back for more. Today we are reviewing Brownie Batter Oreo cookies. Now ladies and gentlemen, first off, I know what you're thinking. I've never heard of this Oreo before. Where did it come from? Yes, our little Oreo Oration show is debuting in Oreo. I remember when I thought Oreo would never even acknowledge our existence. Here we are debuting him, and I know the other thing you're thinking, what the hell is wrong with Oreo now? The answer is the world's gone mad and just Oreo isn't happy anymore just being a cookie place. They need to take other desserts that you might one day want",
      "start": 0.55
    },
    {
      "text": "what the hell is wrong with Oreo now? The answer is the world's gone mad and just Oreo isn't happy anymore just being a cookie place. They need to take other desserts that you might one day want and shove it into cookie form so that you never need to buy anything else. It's like Bachelor Chow. It's like they want to be the one dessert item you think of. They want you to throw Oreo parties. They want you to buy Oreo swag, and I don't know what kind of person would do that. All right, so let's get in here. Of course, every oration begins with the patent first look. We get to see, obviously, I don't know if you punch in on that, Nick, that's brownie batter. See, that would go into to make brownie. Now an interesting thing they did here with this, if you notice there's no there's no imagery for a brownie. They don't want you thinking about the brownie. They just want you tasting the brownie, which is how I like to taste my brownies too. All right, so here we go. First look, let's see how we go. Wow, that's like",
      "start": 40.32
    },
    {
      "text": "don't want you thinking about the brownie. They just want you tasting the brownie, which is how I like to taste my brownies too. All right, so here we go. First look, let's see how we go. Wow, that's like looking into a black hole. It's just so dark, it's so black, and it's it's it's a it's very it's got the it's got a strong aroma. Let me get in for the bouquet. You're getting a lot of chocolate, a lot of hints of chocolate from the chocolate cookie and the chocolate filling and the brownie filling. It's interesting. It's interesting. It's one of those where we've lost the smell of the Oreo. You see, we've done what, Nick, how many episodes we done? 80 episodes oration? 17. 170. Usually I can still smell the cookie here though with these black beauties, there's just no way. First off, you're looking right into the black hole in the center of the universe. No light can escape the cookie, no smell other than the brownie batter can escape the cookie, but it's good. Seems like we got shorted a bit here, Mr. Nabisco. I'll",
      "start": 77.96
    },
    {
      "text": "black hole in the center of the universe. No light can escape the cookie, no smell other than the brownie batter can escape the cookie, but it's good. Seems like we got shorted a bit here, Mr. Nabisco. I'll expect a check looks like about 15 cents off the package if you ask me. And now if we go in here, we see they're in good shape, not broken, what I like, and they they are they're fat. I'll tell you what, like usually you get to this thing, look at look at this guy. We're still on the first look here and like you can see first off that I'm not going to go we've done this before the argument of what is single stuff now double stuff so on and so forth doing the math right here. There's a definitive swirl. There's a definitive line there where clearly two bits of brownie batter were put on this thing. See what I mean, Nick? You see the line again, they're super dark. Can you make the line out or does it just look like I'm holding up? No, you're right. Does it look like there's a tear in the space time continue",
      "start": 127.84
    },
    {
      "text": "I mean, Nick, you see the line again, they're super dark. Can you make the line out or does it just look like I'm holding up? No, you're right. Does it look like there's a tear in the space time continue? That's exactly what I imagine that looks like. Yes, correct. So very interested by the smells though. Smells good though. That's what I know. All right, so here we go. First look, they're black, black like a soul, my soul. They'll never find the body. Um, they're dark, they're very dark cookies. They have a very strong smell and now time to move on to taste. I'm on a wild ride. I know I've said it before, but I don't know how the scientists that Oreo do it. This is definitely one of those occations I bit into it and I thought cream's a bit dry. I'm not getting any hints of who and there it went. You saw my eyes go wide cuz then it just comes a brownie God damn right. Now what I'm doing is a patented oration move where you take your tongue and you rub it all over the top of your mouth and your teeth to try to clear",
      "start": 170.84
    },
    {
      "text": "cuz then it just comes a brownie God damn right. Now what I'm doing is a patented oration move where you take your tongue and you rub it all over the top of your mouth and your teeth to try to clear out the taste so you can have that experience again. I do this thing we we did topic recently on the GameOverGreggy show what experience do you wish could relive? I wish I could go back 30 seconds eat this Oreo for the first time. Hold on every time just out of nowhere it's a brownie. It's like imagine it like this. It's akin to having an Oreo with a thing of plastic in there and you put it in your mouth and then that plastic thing explodes into a giant raft like you know like a raft when you go camping you throw it out and it's like that but in flavor country. It's a flavor country raft. I don't know how they do it. I'm amazing stupified ladies and Gentlemen let's move on to the milk pairing. Of course every Oreo needs to pair well with milk otherwise it ain't worth nothing and you throw it out in",
      "start": 235.84
    },
    {
      "text": "how they do it. I'm amazing stupified ladies and Gentlemen let's move on to the milk pairing. Of course every Oreo needs to pair well with milk otherwise it ain't worth nothing and you throw it out in the streets and you say get a job. 1, 2, 3. This one the milk is muting the explosion of brownie INF flatable raft in my mouth. One, two, I believe it was Voler who said how many times can an Oreo change the way it tastes? I've already seen it what it was it tasted one way when I ate it the first time then it exploded in my mouth became another thing the first bite of you dip it in the milk for the milk test you take a bite of it the cookie of course tastes awesome that's what Oreos do the chocolate cookie then the chocolate itself the brownie batter in the center tastes a bit muted it's it's like a fine wine with muted undertones this it this is this is the singularity this is the black hole this is we're just looking into the abyss of what when you're into nothingness it becomes",
      "start": 315.08
    },
    {
      "text": "it's like a fine wine with muted undertones this it this is this is the singularity this is the black hole this is we're just looking into the abyss of what when you're into nothingness it becomes everythingness and this Oreo is becoming everything do the twist test oh well look at this there this should have come up on the first look we got one broken apart not broken apart but it's it's hats off to you what's up I'm R brownie batter Oreo you'll get that one halfway to your card tonight here we go so best two out of three a perfect break best two out of three a perfect break there you go there two now this thing I won't lie to you this is terrifying Nick I will come in nice and close to you happy now look at that it's I've never seen a cookie cream on an Oreo be the same color as a cookie these things are as black like these are like these things are black like gorilla paws you ever seen like you ever seen a gorilla movie Nick you ever seen a gorilla movie Gorillas in the Mist yeah",
      "start": 388.84
    },
    {
      "text": "these things are as black like these are like these things are black like gorilla paws you ever seen like you ever seen a gorilla movie Nick you ever seen a gorilla movie Gorillas in the Mist yeah and you just look at their you look at their hot dog fingers and they are just like black take a bite out it's like a delayed explosion cuz you bite into you're like oh okay chocolate the cookie it's Oreo and then all of a sudden it's browny quick side note I never understood in school the difference between the Girl Scouts and the brownies let me know in the comments if you understand the difference I mean here's what Oreo has once again nailed ladies and gentlemen they are saying this is the brownie batter Oreo it's going to taste like brownie batter it tastes like brownie batter and this is the kind of brownie batter that you can eat and there probably isn't raw eggs in it so you won't get worms which is what your mind mom was always so worried about when I'd eat the brownie",
      "start": 443.44
    },
    {
      "text": "and this is the kind of brownie batter that you can eat and there probably isn't raw eggs in it so you won't get worms which is what your mind mom was always so worried about when I'd eat the brownie batter or more importantly just make the brownie batter in high school and then just eat the brownie batter she's like you're going to get worms it's like get out of my face mom I'll do what I want in my bedroom it tastes like brownie batter is what I'm driving at here it's scary it's it's dark to the point of being scary like again it's just the nothingness of space when you look at it you can just imagine everything that ever was and everything that will be are the same molecules that are inside of this black cookie that looks back into your soul but is it delicious yes it's delicious do you I mean that's the question do you like brownie batter I think is the question you got to ask yourself Nick do you like brownies I love brownies you like the batter I love all batter that's a",
      "start": 502.88
    },
    {
      "text": "do you I mean that's the question do you like brownie batter I think is the question you got to ask yourself Nick do you like brownies I love brownies you like the batter I love all batter that's a weird thing to say good at the twist test good taste delayed effects mildly Lucien I'm gonna go nine but I'll let you know I'd been thinking about going 85 but then I'm like why why am I going 85 I have no reason twists well taste as advertising here's the thing guess what you and Susie are walking through the aisles you just had a good old date down at the sock hop and she's like I want some Oreos and you go I love brownie batter we should get these and she goes I don't like brownie batter she will not like this cookie cookie tastes like brownie batter Susie don't be a I understand don't let don't get it to like satisfy him then come home eat the goddamn cookie and say no I didn't like it well you knew what you were getting into you didn't like brownie batter you didn't speak up at the",
      "start": 541.6
    },
    {
      "text": "don't get it to like satisfy him then come home eat the goddamn cookie and say no I didn't like it well you knew what you were getting into you didn't like brownie batter you didn't speak up at the time did you? You should have gone for an Oreo birthday cake. You should have gone for an Oreo thin. You had your chance when he asked you what kind of Oreo it's 9.0. That's the way the cookie crumbles for brownie batter Oreo cookies. But what do you think? Let me know your own review down there in the comments then make sure you share us with your friend subscribe to our channel and keep coming back here for more Kinda Funny videos until next time keep on dunking and don't if you don't like brownie batter Susie don't ask oh",
      "start": 603.96
    }
  ]
}
