{
  "id": 1090,
  "video_id": "5eilh86eWq0",
  "show_name": "Community",
  "hosts": ["Greg Miller", "Tim Gettys", "Nick Scarpino", "Kevin Coello"],
  "title": "Thank You, Stephanie Sawler!",
  "description": "Stephanie received this video due to her support on Patreon. To support the Kinda Funny crew go to: http://www.patreon.com/kindafunny or http://www.patreon.com/kindafunnygames \n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1438809216,
  "duration": 223,
  "transcript_chunks": [
    {
      "text": "thank you Stephanie Sauer. Now we assume this is the Stephanie Sauer we know, cuz can there be two of them? I mean, I've never heard of two human beings having the exact same name before. Of course, the problem of course, Stephanie, is that you don't put any kind of information into the Patreon page. No image, no Twitter, no linkage at all. She's never the Stephanie we know never mentioned that she supports us, right? You ever heard that? No. Yeah, she has. She said where the **** my thank you video cuz it's really, really late. No. Yeah, cuz video really, really she mentioned she supports us on Patreon. I think so. I could be wrong. Stephanie, it's you. You need to say that. No, no, it's yeah, it's definitely Stephanie. Yeah, she mentioned that the last time we talked to her. Oh, okay, for sure. She's like, I'm I'm a support. She also also mentions that she said that I was the best looking out of all three of. I don't think that does sound like something she would have said. That sounds like",
      "start": 0.16
    },
    {
      "text": "she's like, I'm I'm a support. She also also mentions that she said that I was the best looking out of all three of. I don't think that does sound like something she would have said. That sounds like something she would say. You now I believe you about the Patreon. So what makes it believable is that I'm the best Le she actually she she mentioned something about my beard being what really tipped it off. Yeah, everything else she was like, I like Greg for his height. I like Tim for his baby blues, but Nick, the fact that you're a compact hands the wheel like man, you're with a big beautiful beard. Yeah, she goes that's what every man should be. That's what she said for these thank you videos. Do you just want to keep referring to Kevin as Colin? Yeah, no, I want to refer to Kevin as Kevin and shame him for all he does. How's that Lunchable looking? You said you weren't going to mock me for. I said I'm not making fun of it. I said how is it looking? It's looking good. It see see the fact that you even said don't",
      "start": 41.04
    },
    {
      "text": "he does. How's that Lunchable looking? You said you weren't going to mock me for. I said I'm not making fun of it. I said how is it looking? It's looking good. It see see the fact that you even said don't mock me for it should tip you off that maybe you shouldn't have eaten a Lunchable out of a gas station. Can you feed me a lunch bow while I'm driving? Can you make me a full lunch? You wanted one and then feed it to me like I was disgusting. That's cuz lunch balls are disgusting. They're for children. They're actually I think to make children dumber even. It's other people's children can like thrive. Beering one my favorite things for my childhood. You got to get over this truck pass yet. That truck can pass whever the truck wants. It has the Raptor package on pass in the wrong lane. Do you see the Raptor package that's got on it? Got a raptor package? Yeah, look at it. I I'll try to speed up. I can't cuz the Lunchables in the back is weighing me down. Damn it, Kevin. Thank you Stephan anyway. St thank you so",
      "start": 81.8
    },
    {
      "text": "package that's got on it? Got a raptor package? Yeah, look at it. I I'll try to speed up. I can't cuz the Lunchables in the back is weighing me down. Damn it, Kevin. Thank you Stephan anyway. St thank you so much. We'll talk soon. Well she we have to do another thank you video for her in this run anyway. So if we get through all the other ones to catch up to where we need to be, we're going to say hi to Stephanie. That sounds all right. Well, Stephanie, thank you so much for your support. I can smell that pizza Lunchable up here, Kev. You're still eating Lunchables. I thought you already ate them. Give me a lunch bow in my mouth now. He's making his first one. He hasn't even made one period. Put it in my mouth. Oh God, this is how we died. Oh my God, why is that so big? What do you think it was? It's all over your pants. Thought you're wearing the mint pants and now there's stuff on them. There's no stuff. He thought it was little crackers, but it was the pizza. Why is it it's like uncooked pizza. That's what the ****",
      "start": 126.08
    },
    {
      "text": "thought you're wearing the mint pants and now there's stuff on them. There's no stuff. He thought it was little crackers, but it was the pizza. Why is it it's like uncooked pizza. That's what the **** do you think a Lunchable is? A Lunchable is a cracker with a slice of cheese and a slice of ham. No, that's the ham Lunchables. That's be original Lunchable. That's why. Yeah, you didn't say you got an original Lunchable. I got these are really good and also I said I can smell that pizza Lunchable from up here and then you said put it in my mouth. I thought that perhaps you that was a weird word to put in there. Yeah, yeah, this is still the same thank you video. Yeah, we're not we haven't cut yet. This is all for Stephanie and obviously everybody else on YouTube. Remember Stephanie gets this cuz she's supporting us on patreon.com Kinda Funny games. You can go support us on Kinda Funny as well too patreon.com then you get this video every 3 months. Hers is really late. We're trying to be better about it",
      "start": 166.12
    }
  ]
}
