{
    "id": 1093,
    "video_id": "FcTjJSHInbg",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello"
    ],
    "title": "Thank You, Stephanie Sawler! (Again!)",
    "description": "Stephanie received this video due to her support on Patreon. To support the Kinda Funny crew go to: http://www.patreon.com/kindafunny or http://www.patreon.com/kindafunnygames \n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1438809253,
    "duration": 254,
    "transcript_chunks": [
        {
            "text": "what's up Stephanie Soler Stephanie Soler we're thanking you again that's how bad we are at these thank you videos really that we let it stack up twice so she supported us for 6 months without ever getting a video I'm so sorry about that we're getting better now we're getting we're clearing up the cache right now clear all thank you Stephanie for all your support again uh let's let's recap what's happened on the ride since we last talked to you all the Lunchables have been eaten Kevin ate all the Lunchables except for one which I'm sad to say I ate we're passing we're passing a Buffalo Wild Wings right now stop I if I would have known I would have said no I would no get Buffalo Wild Wings we get back in the set fine I just want to go home I do too I want to be home I want to take my shoes off shoes off I want my bare feet to hit my rug and I want there to be uh the Chinese food that my wife has ordered for us I thought you said you might pick up Taco Bell instead I want the option I",
            "start": 0.16
        },
        {
            "text": "off shoes off I want my bare feet to hit my rug and I want there to be uh the Chinese food that my wife has ordered for us I thought you said you might pick up Taco Bell instead I want the option I want the option I don't know what I'm going to do for dinner do I want a pizza do I want a burrito I think you want a pizza actually and here's why I think you want a pizza because Kevin God bless his little soul does a lot of things right for us yeah but last night he misunderstood you yeah and didn't order the second pizza how did he mess that up so bad I don't even stop being an **** I was going back for Nick which we told you not to do did that that was a direct a direct he literally was like I don't know where you guys are at and that's Nick's own fault should have kept up we were leaving a party last night Stephanie and another and another guy with a beard started talking to Nick but I think Nick might have initiated the conversation I did not I really didn't no I didn't he was just",
            "start": 37.64
        },
        {
            "text": "a party last night Stephanie and another and another guy with a beard started talking to Nick but I think Nick might have initiated the conversation I did not I really didn't no I didn't he was just thought you said something to him thinking he was another guy remember I did not why did you come out of the meeting I was walking with you guys and he cut me off and hugged me and he was a big man Nick you met him earlier he had something to do with the Miley the what's theing video no the the dude that made that M was like this guy had something to do with it and you guys hugged for like 10 minutes was he was hugging everyone I don't remember that anyway he's a lovely hugger great beard tall man very drunk and so when we were talking last night was having a great time I lost track of time we I was stuck in his arms and his eyes and then you guys being the great business partners and friends that you are left me to die yeah you left me to die and only Kevin came back for me so when I want",
            "start": 80.32
        },
        {
            "text": "I was stuck in his arms and his eyes and then you guys being the great business partners and friends that you are left me to die yeah you left me to die and only Kevin came back for me so when I want you to know how much we stress to Kevin do not go back for him no I was on the phone with him I'm talking to Kevin on the phone and I hear you in the background saying don't go back for him hang the phone up he's dead to us order us the god you hear me saying buffalo chicken pizza I didn't hear the Buffalo CH Pizza anyway so Kevin didn't order that pizza last night so I saw the look on your face the pizza was good by the way it was really good uh but I saw that you wanted more of it well yeah we didn't need more you and I talked about this we were satiated we needed more I was nowhere near satiated very drunk I could had three or four of those more slices though yeah easy but the thing I always forget with you is you always order the Buffalo P the buffalo chicken pizza which is always",
            "start": 126.2
        },
        {
            "text": "satiated very drunk I could had three or four of those more slices though yeah easy but the thing I always forget with you is you always order the Buffalo P the buffalo chicken pizza which is always unique for me yeah I don't I mean it's such a rarity that's still a pizza that isn't on everyone's menu which piss well every time I eat it it's because you ordered it okay and I love it every time okay except for there was one time I think you ordered it where they actually used buffalo sauce as the sauce uhhuh is that usually what they do yeah yeah it was amazing yeah it was really good but it was a little too much cuz it's all sodium yeah it's really good sodium peroxide no that would be really dangerous sodium hydrogen peroxide that kills you don't do it Steph don't drink hydrogen peroxide and also Stephanie get one of those detectors that detects what not carbon dioxide carbon",
            "start": 172.8
        },
        {
            "text": "and also Stephanie get one of those detectors that detects what not carbon dioxide carbon oxide is that the one yeah the one it's yeah okay yeah I was trying to say monoxide in the beginning you're right carbon dioxide I had that at home we had a garage yeah but then like now we don't really worry about it I don't think we've beaten carbon dioxide no carbon monoxide is still out there still number one killer people get killed by carbon monoxide yeah I know it's really it's really scary um and you should just know that any around any corner you might run into carbon monoxide damn it Stephanie thank you for all your support in putting up with these videos being a little bit late we love you a lot talk to you soon by St",
            "start": 214.6
        }
    ]
}