{
    "id": 1084,
    "video_id": "l3pVYV3WlFQ",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello"
    ],
    "title": "Thank You, Chris Gearing!",
    "description": "Chris received this video due to his support on Patreon. To support the Kinda Funny crew go to: http://www.patreon.com/kindafunny or http://www.patreon.com/kindafunnygames \n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1438809760,
    "duration": 91,
    "transcript_chunks": [
        {
            "text": "thank you Chris Gearing do that one more time what is your **** problem no we don't do them again this is the video now you nothing's changed this is what you set up maybe if you weren't stuffing your Feast with pizza Lunchables Lev that you're going you start talking and I have to raise a little bit uhhuh and then you **** shout as loud as you can in this tiny car well he does that over and over yeah every video starts with the same pump and Circ Kevin I think the problem is you're turning the pepperoni instead of the dial for the audio back there with your pizza Lunchables so thanks Chris scaring yeah this is your video of us the Kinda Funny guys thanking you for your support on patreon.com ofun Games been a long time you're the man the myth and the legend been a long time since Chris gave us money he keeps on giving us money cuz he likes our videos Lo videos and time we go to VidCon we drive back and make thank you videos while Kevin **** stuff up in the back that loud",
            "start": 0.36
        },
        {
            "text": "Chris gave us money he keeps on giving us money cuz he likes our videos Lo videos and time we go to VidCon we drive back and make thank you videos while Kevin **** stuff up in the back that loud enough for you how was that c it was two we love you Chris this is what we do this is how we do it sorry Chris that was great he loved it he had a great time he supports us for this kind of stuff does he's a sick man we're all sick we're all there's something wrong with everybody psychiatric therapy Big Time problems with each and every one of us all of us should get it",
            "start": 45.48
        }
    ]
}