{
    "id": 1132,
    "video_id": "SSpPJzTi-A4",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Are Video Game Weddings Cool? - Kinda Funny Gamescast Ep. 32 (Pt. 3)",
    "description": "Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1439989201,
    "duration": 563,
    "transcript_chunks": [
        {
            "text": "Topic number three comes from Patreon.com Kinda Funny Games. This is from David Ing. He supports us there enough to get his topic read automatically on the show. And David's topic is this: Oh Jesus, we got to meet Greg and Christine at San Diego Comic-Con last year and chatted with them a little bit about our video game wedding and reception. My wife manually did up amazing 8-bit art invitations. The wedding ceremony ended up relatively standard fair, just with procession music from Journey, Zelda, and Uncharted. But for our reception, we decorated the hall and desserts with video game characters. We managed to get Mark Meer to do our introductions as Commander Shepard, got a bunch of old school arcade machines and iCades, and had two massive Mario Kart and Street Fighter Grand tournaments. Winners won a single 5lb gummy bear and instant diabetes. We were so happy to see everybody young and old having such a great time playing video games. My question is this: Would you guys have any video",
            "start": 0.31
        },
        {
            "text": "winners won a single 5lb gummy bear and instant diabetes. We were so happy to see everybody young and old having such a great time playing video games. My question is this: Would you guys have any video games at your wedding? What do you think about such themed weddings? Video game themed weddings? Video game themed weddings? Uh, I mean, this this reminds me a lot of the name topic that we did about video game names, right? Oh yeah, yeah, yeah, where you're like, don't name your kid just just and by the way, uh, Harper Lee's book, this the sequel to To Kill a Mockingbird, yeah, is a ****. No, I haven't read it. Great example, you know, just throwing that out there. It's totally unrelated. Now Boo Radley comes back and he's horrible. Yeah, and he's Satan. Um, you kid Boo Radley, but uh, Boo Radley, is that from it's Boo Radley, right? Not Bradley. Boo Radley, Bradley, I think. Yeah, but I what you're saying reminds me of um, Mr. Deeds as well with the how come back to it always comes back to Mr. because when he goes back to the town like there's",
            "start": 54.16
        },
        {
            "text": "Boo Radley, Bradley, I think. Yeah, but I what you're saying reminds me of um, Mr. Deeds as well with the how come back to it always comes back to Mr. because when he goes back to the town like there's a she says that the guy's name I think is I don't know uh Dr. Pepper and all that kind of anyway. Um, what a what an awful movie. So distracting to me right now. Uh, this is a thing where it's like, it's not for me, but if that's what you want to do, then more power to you. I I I personally wouldn't do something like that, but um, it's not to disparage game music or games at all. I mean, we we love and live and breathe games. It's just like, I think that the for me, not that I I don't I assume I might not ever get married, but it should be more about the um, the couple and more about the family and the celebration and a sort of but if they're both G if they're both Gamers, but I feel like it isolates people that aren't G **** them, but that could be like almost everyone at your wedding. I mean, even think about",
            "start": 109.76
        },
        {
            "text": "and a sort of but if they're both G if they're both Gamers, but I feel like it isolates people that aren't G **** them, but that could be like almost everyone at your wedding. I mean, even think about even think about you got married one day, right? And assume the woman you got married is a gamer, right? But still think about all the people that would come to your wedding that weren't Gamers and that if you and assuming that if you had wedding themed on, you know, whatever **** nerdy **** you like at right right right. Here's and here's what's interesting about it is I think it's interesting to see him and both you as you talk about it trying to merge video games with the traditional wedding, whereas I think if you're going to go balls out enough that you're going to have this video game reception and music and it's got to why do you do you really want the normal wedding like to try to merge in the dresses and the tuxes and that **** to then fit into having a shine behind you and like",
            "start": 160.04
        },
        {
            "text": "and music and it's got to why do you do you really want the normal wedding like to try to merge in the dresses and the tuxes and that **** to then fit into having a shine behind you and like Master Chief. So you you say like you would just go full board. Well, I mean, my whole thing is like do whatever you want, you know what I mean? Like don't get me wrong. I think a reception with arcade cabinet sounds awesome, you know what I mean? I think yeah, having that option is cool. I'm just saying like, you know, I don't need to, you know, come down the aisle as Link or something like that. Sure, sure, sure, sure. Yeah, I think and like a green tunic. The thing the weddings that, you know, stand out to me are the ones that are specific to the person that they're doing something cool that is them, you know what I mean? And like it can totally be something that doesn't speak to me in terms of what they are, but you go to a wedding and it is just another wedding in a church reception at the hotel or whatever, you know,",
            "start": 198.84
        },
        {
            "text": "and like it can totally be something that doesn't speak to me in terms of what they are, but you go to a wedding and it is just another wedding in a church reception at the hotel or whatever, you know what I mean? Like and the DJ is playing **** YMCA and all that **** you're doing the Electric Slide. It's like, well, this is like every other weird ass wedding you've ever been to. I like going to the weddings that have the unique pieces too. Sure, but and I I I mean, I don't disagree with you. Like my whole thing with with this gentleman's question is do whatever you want. Oh yeah, yeah, 100%. Like if that's what makes you happy, that's fun. That's I'm not judging you. I mean, do it do what you do what makes you happy. What I'm just thinking about is like, what is, you know, weddings are almost more about and I hate to say it, but it's true. It just seems like it's more about everyone else, you know, like the ceremony is about the the wedding, but when you go to the when you go to the reception, which is really",
            "start": 234.6
        },
        {
            "text": "I hate to say it, but it's true. It just seems like it's more about everyone else, you know, like the ceremony is about the the wedding, but when you go to the when you go to the reception, which is really the wedding, yeah, uh, to a lot of people. I mean, that's what you're really going to. Yeah, uh, it's about like everyone's enjoyment. You don't want to have like food that's too weird or you don't want to have like I was think about Nate Ahearn's wedding, you know, we went we went to that um in outside of Philadelphia, which was unique and had, you know, specific moments. I was like, oh, this is a cool way. Well, what was so cool about it? There was M there was a lot that was cool about it. It was outside. It was very um a fusion of kind of like, you know, Nate's kind of a, you know, a white guy and his and his wife's an Indian girl and so they they fuse those those two kind of he's not kind of a white guy. Nate is the most white guy. He is actually he is the white guy. Um, but they but they fuse like some Irish",
            "start": 267.96
        },
        {
            "text": "an Indian girl and so they they fuse those those two kind of he's not kind of a white guy. Nate is the most white guy. He is actually he is the white guy. Um, but they but they fuse like some Irish traditions with some Indian traditions together in a very pleasant way and a very accessible way. Then the food at the reception and the drinks were they had like food trucks with with, you know, uh, you know, Philly cheesesteaks and tacos and all that stuff. Then they had like traditional Indian food. In other words, it catered to like everybody, you know, everyone feel comfortable. My buddy Mike Pope's getting married um and I got to go back to the island for it in just a few weeks and he's having like kind of more of a woodland themed kind of like wedding because he's like really in like Lord of the Rings and all these kind he's always been into that kind of stuff. But again, it's like agnostic and I hate using that word again in the sense that it's like not Lord of the Rings. It's not, you know, The",
            "start": 302.92
        },
        {
            "text": "Rings and all these kind he's always been into that kind of stuff. But again, it's like agnostic and I hate using that word again in the sense that it's like not Lord of the Rings. It's not, you know, The Witcher. It's just like, let's wear like some **** leather armor for a little while and you know, and just and **** around as if we're in like, you know, a fantasy setting. So I like the more like, are you doing this? Did you already buy? Are you wearing the Army set? No, no, no. He's like, he's doing some I don't even want to I don't I don't even know exactly what he's doing, but like his whole thing is they like a big bonfire and they want like someone to shoot an arrow into it like light it up and like Mike Pope hit me up. I want to go. Uh, so but like to me like that's a themed wedding, but it's not in excl like you have to understand anything. If you if you've seen anything fantasy based ever, then you understand it. It's the same thing with with, you know, n like that's the thing. So I'm just saying I'm",
            "start": 342.8
        },
        {
            "text": "like you have to understand anything. If you if you've seen anything fantasy based ever, then you understand it. It's the same thing with with, you know, n like that's the thing. So I'm just saying I'm just saying that's my that's my stance. I wouldn't be opposed to attending or enjoying a wedding that was based on something that I didn't understand. I'm just saying that, you know, in terms of of practicality, pragmatism. Here's my thing is about I think you're what you're saying about like, oh, this is just the theme of it. You get it and you don't is that can be applied here, right? Like he's the music is Journey, Zelda, and Uncharted. So it's instrumental stuff. It's just awesome music. Maybe you don't know it, but who cares, you know what I mean? Now, can you was would the music played that music played at the ceremony procession music? It says the procession music. Yeah, so when so they walked down the aisle to Uncharted. When they when they put the when they put the ring on, they did the diery do like he",
            "start": 379.52
        },
        {
            "text": "the ceremony procession music. It says the procession music. Yeah, so when so they walked down the aisle to Uncharted. When they when they put the when they put the ring on, they did the diery do like he died and then Sil went that's nerdy. I like that. That's funny. And then the desserts are video game characters. May I don't know. Okay, whatever. And like Mark, so Commander Shepard does the announcements. I I doubt it was I'm Commander Shepard and these are my favorite wedding people on The Citadel, right? It's just their voice. And then they have the cabinets. I went to a wedding for uh my friend Blair and Casey, right? And they had a video game area, right? And they was like spread out all over the place and it wasn't like video game **** was all over the place wrong. It was like they had the one arcade area where it's like, oh, go hang out there and have a beer and you know, play these games and they had everything and like all these different things games that mattered to them that you played, but it",
            "start": 417.52
        },
        {
            "text": "area where it's like, oh, go hang out there and have a beer and you know, play these games and they had everything and like all these different things games that mattered to them that you played, but it wasn't like Grandma wasn't forced to go in there and see what the ****. Sure. And I I think as with most things, I'm probably way over analyzing it. I'm just trying to to to think about, you know, people's enjoyment and understanding of what's going on. It's just just it's Rel I I don't know. Maybe it's not the most boring. You're paying for the **** weddings. I mean, if you want to have a **** straight up wedding based on World 3 and Super Mario 3 or something, more power to. I'm just saying like, you know, you got to think about everyone else that you're inviting and are they going to enjoy it or they going to understand it? Are they going to be in on the joke or be on the fun? Yeah, I think those are, you know, salient points to be to have to be made, but, you know, more power to you. I mean, speak do",
            "start": 457.88
        },
        {
            "text": "they going to understand it? Are they going to be in on the joke or be on the fun? Yeah, I think those are, you know, salient points to be to have to be made, but, you know, more power to you. I mean, speak do you want, you know, how you're talking about Mario right there, World whatever. This is a convers we haven't had together and I don't know if you know it, cuz I didn't know. Have you ever seen that viral video of the at a talent show the Mario thing where they like the kids do it and he's like jump. It's like set to music and they're doing all the sound effects and stuff. Is it's the one guy is Mario walking and he's like jumps up and he's tapping the coins. Really? No, this is huge years back like huge. I remember watching this like this prob probably probably maybe at one point that's Tim. Like I I mean, I know since you don't have an real anchor to it for the kids washing that's Tim. He dropped that into conversation the other day and I was like, what? I'm like, and he's like",
            "start": 494.04
        },
        {
            "text": "I know since you don't have an real anchor to it for the kids washing that's Tim. He dropped that into conversation the other day and I was like, what? I'm like, and he's like, yeah, that's I'm like, what? How the **** do I not know this about you? Oh, so that is literally Tim. You're not and all his dumb Friends in high school and I remember watching that. It feels like a decade ago, probably a little bit less, but it was just like, what? Like, what? Like that blew my mind. Blew my mind the other day. Interesting.",
            "start": 532.08
        }
    ]
}