{
    "id": 1072,
    "video_id": "sUekx9EyznY",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Alfredo Diaz"
    ],
    "title": "Let's Play Gears of War Xbox One - Kinda Funny Plays",
    "description": "Greg and Alfredo play Gears of War: Ultimate Edition on Xbox One.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1438606803,
    "duration": 2026,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to another Let's Play here on youtube.com/KindaFunnyGames. I'm Greg Miller and this is the King of Twitch Alfredo plays. What's up Greg? Well nothing. How are you? Gears. That's what's up. Ladies and gentlemen we're at the Microsoft Xbox Lounge here in San Francisco to play Gears of War: Ultimate Edition. Now this is this is the Super HD remaster and everything's amazing. This is true. It looks really really good. We played some multiplayer. It's really good. Looks beautiful. Still has that Gears speed. I forgot how fun it was to play MP. Yeah of course. Yeah. Going in cover to cover you know what I mean? Things like Torque. It was really fun when they broke us up and Alfredo just beat me to death over and over again. Before that we were like the duo. And that's the thing. I still was hanging in on my team as being towards the top if not the top every time. I'm not knocking the other people. It was like I was you were far and away ahead of",
            "start": 0.16
        },
        {
            "text": "duo. And that's the thing. I still was hanging in on my team as being towards the top if not the top every time. I'm not knocking the other people. It was like I was you were far and away ahead of everybody. I was I was keeping it real as they say. But now we're going to play some co-op. Uh you're player one. What difficulty are we going to play on? Uh nope. Not Insane. No we're not doing Normal. So you're just going to have to drag me around dude. Uh yes of course. You going casual? I'm going to do Oh you could choose your own difficulty but you're not a casual person. I'm no casual. I'm no filthy casual. Uh so we had a lot of cool things get announced to you already. Obviously we already knew 40 bucks. We already knew August 6th. Yep. But what was really cool now is if you buy this one for $40 you get all the other Gears of War Xbox 360 games on backwards compat when they come this way. That was big. That's awesome. That's totally great. You can just play through all of",
            "start": 36.08
        },
        {
            "text": "this one for $40 you get all the other Gears of War Xbox 360 games on backwards compat when they come this way. That was big. That's awesome. That's totally great. You can just play through all of them cuz I I play through all of them except for Judgment. And now it's like I want to go back and replay cuz campaign for Gears is always great. Yeah. No totally. Playing co-op. And of course if you get the Ultimate Edition you get into the beta for Gears 4. So here we go. It's Act One. They've gone through they said all the cut scenes are redone. All the levels and maps are redone. You know what I mean? Keeping that original vibe but going through and making it Xbox One awesomeness. And it's coming to Windows 10 but it was playing on PC. The nostalgia is hitting me hard right now Greg. Yeah. Yeah. That's the thing. We were talking about this before right? Like you're Mr. Gears. I played two with Levi Buchanan and then I played three with Colin and Casey at IGN. But you've been",
            "start": 70.4
        },
        {
            "text": "Yeah. Yeah. That's the thing. We were talking about this before right? Like you're Mr. Gears. I played two with Levi Buchanan and then I played three with Colin and Casey at IGN. But you've been there since day one. You've been locked in. These guys are yoked. What the hell? That's how they were bro. That's true. All they do is they they slay and hit they hit the iron. Sure. Yeah. That's all they got time for. That they eat a lot of chicken. I follow I follow The Rock on Instagram and if it seems like a lot of chicken and qua a lot of fish a lot of chicken a lot of working out on Bertha. Oh back to the arms. The feels. You're You're throwing You're throwing. You're You're spoiling the game later. So here we go. I'm on bottom. You're on top just like you'd imagine this relationship. You can be the power bottom Greg. Thank you. I always thought of myself as the power bottom. So what I thought was cool right is like I always play these games co-op. That's a big why I play",
            "start": 106.4
        },
        {
            "text": "You can be the power bottom Greg. Thank you. I always thought of myself as the power bottom. So what I thought was cool right is like I always play these games co-op. That's a big why I play Gears right? And for a split screen on this one right we're going to combo. Oh yeah. We're going right to combat. Okay. Uh what they pull out here and I like a lot is the fact that in the new split screen right they rather than zoom in and make it all awkward they put the black bars in the side. So it is very much what you'd expect and like I like they were talking about before right? The fact that well of course it doesn't matter anymore cuz everybody's got a giant TV. Oh the tags. So tags now right? Besides just picking them up and uh being collectibles we get comic book pages right? Which is awesome. You finally get your reason to pick up those Cog Tags before you always pick them up or whatever. Just for the achievement achievement. It's fun to pick them up. You get comments.",
            "start": 150.08
        },
        {
            "text": "Which is awesome. You finally get your reason to pick up those Cog Tags before you always pick them up or whatever. Just for the achievement achievement. It's fun to pick them up. You get comments. So why did Gears of War always stand out to you? Alfredo. I don't know. It was just third person you know what I mean? Like back then I was playing like a lot of Halo or just other FPSs. It was like a nice change of pace and it was I don't know. It was just very interesting like multiplayer wise like how it's a lot of like cover based like tactical shooting. Oh bunnies. I was never like too Oh I was never too good at multiplayer though cuz a lot of it relied on the shotgun. Sure. You know what I mean? That's more your realm. Yeah. I am the shotgun. I would just try and lure someone and pump like 50 bullets into them and someone just come and shotgun me in the chest. Shotgun was always very powerful. I forgot about the active reload too. Oh yeah. I remember that. Oh yeah. Uh-oh. He's",
            "start": 189.92
        },
        {
            "text": "like 50 bullets into them and someone just come and shotgun me in the chest. Shotgun was always very powerful. I forgot about the active reload too. Oh yeah. I remember that. Oh yeah. Uh-oh. He's behind behind me. I got you. I got you back bro. Fre. I'm on bottom. I think I'm editing this. I'll I'll try to do that. Oh that's right. The grenades. The thing you uh you can just stick them right on them and then back off. I'm going to go do that right now. This is You know what I mean Greg? This is where I become a hero or I fail horribly. No I'm failing horribly. Yeah it didn't work out for me Greg. Oh you're dead. Uh I'm bleeding. I didn't really expect you to die. Well you know when you want to like relive certain things you want to just get to the glory moments. Yeah. Uh are they dead? Where are they? They are. Ah they're very much alive. They're hiding very very well. I'm just going to let you down. You're dead. No this is not where you move on. You never move on.",
            "start": 228.88
        },
        {
            "text": "they dead? Where are they? They are. Ah they're very much alive. They're hiding very very well. I'm just going to let you down. You're dead. No this is not where you move on. You never move on. Not for Marcus or Dom. Okay now we're good. Now we're good. Credit internet for saving Alfredo King of W. Can a brother get a Lancer? Yeah. Right. So what's interesting about when's the first time you learned about Gears? What was your first experience where you thought Gears was something more than just third person action? Um I don't know the campaign. Yeah. Like I was like I'm really digging Oh I mean also like when you when I first saw Gears like the graphics I was like are you kidding me? You remember that? Like what? Like the game looks amazing. Here we go. You know what I mean? Swinging around. You know what I mean? Little helicopter swing right there. Usually helicopter something else. Yeah exactly. For me like I knew Gears is beautiful. Obviously I was reading it. I wasn't in",
            "start": 281.8
        },
        {
            "text": "around. You know what I mean? Little helicopter swing right there. Usually helicopter something else. Yeah exactly. For me like I knew Gears is beautiful. Obviously I was reading it. I wasn't in the industry at that time. I was seeing you know the reports from the kids and and on the internets and their EGMs and whatnot. But uh I remember the first time I got to actually play a lot of Gears and see a lot of Gears was I I was still living in Columbia working at the Tribune and I did a story on a Marine who was shot by a sniper in Iraq right? Uh parents thought he was going to die. There was all these prayer visuals all this good but he pulls through right? Just miraculously pulls through and then he's got to relearn basically how to you know motor skills and everything else. Doctor recommended video games. And so I went over to his house to you know follow him and see what was up with him. And like one of the games he was playing was Versus. And I remember watching this",
            "start": 334.88
        },
        {
            "text": "recommended video games. And so I went over to his house to you know follow him and see what was up with him. And like one of the games he was playing was Versus. And I remember watching this like damn this game's beautiful. I mean there's so much stuff going on. This is super bloody. Exactly. But we take for granted now Snap to cover you know the way this feels and played right? But at the time this was this is I mean they they innovated they did it. You know what I mean? So it's funny now that we're doing it playing it again like oh this yeah of course I know how to do this but back then it was like wow it was all Yeah. It's brand new. No one knew. No one knew and we're smart enough we know we're getting used to. It's like all this is like oh I remember all this. You know what I mean? Oh here's a tag. I was like looking for it. I was like where is that? Like I remember this tag over. Oh I remember pressing Y. I always like that. I always respect that. It was like a small",
            "start": 373.68
        },
        {
            "text": "I mean? Oh here's a tag. I was like looking for it. I was like where is that? Like I remember this tag over. Oh I remember pressing Y. I always like that. I always respect that. It was like a small little touch but I always like the fact that it gave you the button prompt to press Y to actually look at important things. Yeah. So you're you feel like you're part of the story. It's not just some guy yelling at you like Spider-Man. I got us with that comment Greg. I'm glad. Uhoh. Sand Worm. Sand Crab Man. Like how do you just how do you fight? I mean like the Locust. They just seem like No that's the thing. I would have given up. Then this why I'm not usually not in this kind of situations in real life cuz I would I would just shoot myself at that point. They give me the Lancer. I walk out and Crab Man's there. I'm like well like you know what are we going to fight for at this point too? You know yeah we like they showed the trailer of our beautiful cities just totally",
            "start": 411.44
        },
        {
            "text": "I walk out and Crab Man's there. I'm like well like you know what are we going to fight for at this point too? You know yeah we like they showed the trailer of our beautiful cities just totally destroyed and they're all this now and we all obviously work out all the time. This is my nightmare. Monsters and working out under no circumstance amus push him out. Push him right out you know. Yeah I'm Marcus Fenix. I get out of the way. How heavy must all that gear be? That's why they're That's why they're yoked. That's why they all look like The Rock. If you throw it on me I'd instantly just fall over. Sure. No you you turtle beefing up you know and I just wouldn't be able to get up. Man's flailing. You like you deserve to wear the uniform. Oh remember this? I remember I remember the big Hammer of Dawn fight coming up. That was a scary I was actually really I was actually kind of terrified when that happened. Sure. Yeah it was too beautiful. It was",
            "start": 456.16
        },
        {
            "text": "I remember I remember the big Hammer of Dawn fight coming up. That was a scary I was actually really I was actually kind of terrified when that happened. Sure. Yeah it was too beautiful. It was It was scary being chased down. Couldn't really do anything. Sure we'll get there. Oh I know. I know it's coming. Don't worry about it. Don't Don't you worry about me. Oh what's up girl? Hey girl. Hey. She's like \"Oh I don't get giant armor cuz people are getting shot all around me.\" See that's the thing too. It's just like they're not mindless creatures. Like they seem really you know seem somewhat smart. They're accurate with a sniper rifle. At some point you can't negotiate. It's kind of like when you have like zombie movies where the zombies run really fast. Like come on. Like really they got to have every advantage. This is very unfair. They're building They have armor. They have cool guns. I think I think the first thing I'm going to do is play through the campaign. I'm",
            "start": 504.8
        },
        {
            "text": "really they got to have every advantage. This is very unfair. They're building They have armor. They have cool guns. I think I think the first thing I'm going to do is play through the campaign. I'm skipping. We're skipping. All right. We're going to shoot some stuff. I don't need I think you paused it. I I hit the hamburger button instead of the square buttons. Hamburger button. Oh I hit the wrong There we go. We're making moves. I'm going to screwed up. Cover me Greg. I got your back. Are you going to touch MP at all when this game comes out? No not at all. Sorry. Like that was the thing out there. I'm playing. I'm like \"Oh yeah okay. I can kind of hang in here.\" And then eventually I'm like \"All right well Gears is co-op for me.\" You know what I mean? Like it's it's running around. It's with your friends having polite conversation while you kill each other. Gears is like back in the day I used to be just strictly multiplayer but Gears was one of those games I was like",
            "start": 544.64
        },
        {
            "text": "around. It's with your friends having polite conversation while you kill each other. Gears is like back in the day I used to be just strictly multiplayer but Gears was one of those games I was like \"Nope I got to do the campaign. Like I got to get through this.\" And that's the thing too jumping into a franchise that's this story right? Like everybody who picks up multiplayer is going to be amazing at it. There's no there's no room for me to get in there and hang in there. But you could be a distraction Greg. Yeah I don't like you know you can you you can pull the assists. Like earlier when we were playing MP you kept down. Yeah you and I were a great team. I'm not saying that. But you also understand that. See after that first round they had to bring us up cuz that was the wombo combo. Sure. Yeah. You can't deal with that. Nobody can deal with that. It's the Kenan and Kel of Gears of War. That's you and I. Yeah. But there's too many wombo combos on the internet.",
            "start": 589.92
        },
        {
            "text": "the wombo combo. Sure. Yeah. You can't deal with that. Nobody can deal with that. It's the Kenan and Kel of Gears of War. That's you and I. Yeah. But there's too many wombo combos on the internet. They're going to cut. That's true. That's true. They'll cut us right. You are you know you have a definitive set of skills. You're great at every shooter you get dropped into. I can hang with you in Titanfall. Not compete against your team but hang in behind your team and feel like I'm getting **** done. Uh Gears of War I would not feel like I'm getting anything done. I'm sure. You know I think I'm going to do Gears with some Vs. Sean Pitts. Oh yeah. Yeah. Sean Pitts' been talking that talking that trash that he's really good. Uh he says he's good. He's like you know he says he's been uh made some appearances in the leaderboards in the past. So yeah I think uh we're some Vs. It took me a second though to really get into Gears. Like I loved it but to really really get into",
            "start": 625.28
        },
        {
            "text": "uh made some appearances in the leaderboards in the past. So yeah I think uh we're some Vs. It took me a second though to really get into Gears. Like I loved it but to really really get into it because I'm just I was used to playing like other shooters where it's like okay like three head shots you know what I mean? Or like one here is just like just bullet sponges. And it's interesting cuz I remember that being a knock when people first started playing it and then it kind of become well that's Gears. You know what I mean? Like you you play you go into any game and you have expectations I think based on what other games in the genre are doing but then when you get into the vibe and the feel of it and I like that you know when they were talking about this uh up there in The Coalition and they're talking about the fact that uh you know they kept aiming at the center of the screen rather at the end of the gun and stuff like they're trying to honor what Gears is and what Gears One",
            "start": 661.6
        },
        {
            "text": "and they're talking about the fact that uh you know they kept aiming at the center of the screen rather at the end of the gun and stuff like they're trying to honor what Gears is and what Gears One in particular was which is a great way to beat right? Mhm. That's why you're playing this chances are I want to do Oh nope. No right now. Where'd I get hit from? See I want to do Here we go. Here we go. Do you have a Lancer? You going to chainsaw this guy? Yeah that's a plan. Yes. Got it. Two views. Split screen. He was a uh meat sandwich. Where'd you pick up your Lancer? I want a Lancer. Uh well I think I just had it. Oh okay. I have my Lancer now. Or maybe I did all the time. Yeah. Okay I did. In the first level I didn't. I had a different Yeah I had Hammerburst. I believe the Lancer was there the whole time. Like back when I was young this game threw like you know how this game throws choices at you. It's like oh do you want to take the the upper route or the lower route?",
            "start": 708.56
        },
        {
            "text": "was there the whole time. Like back when I was young this game threw like you know how this game throws choices at you. It's like oh do you want to take the the upper route or the lower route? Like back then I used to stress over that like oh my god decisions. Like you put it down you Gears was hard. Like if you turn up to the campaign Yeah out there they're all recommending you you guys should play in Hardcore. I'm like I don't know. God knows should I play in Hardcore. Back when I was achievement hunting though it's like you got to put yourself through the paces. Yeah. Well that was different though. That was your second play through right? Yeah. You go through you get a feel for the game. You forgot casual like you you enjoy you enjoy the story. You know what I mean? Yeah. Come on man. Come on now. He's already dead. Yeah. But it's like you know what I mean? afraid of. They deserve open casket. The double tap. Now here's a question for you. Since they came from",
            "start": 763.52
        },
        {
            "text": "Come on man. Come on now. He's already dead. Yeah. But it's like you know what I mean? afraid of. They deserve open casket. The double tap. Now here's a question for you. Since they came from underground what do they do with their bodies? They bury them deeper. Maybe they get blimps and they raise them to the heavens. That's awesome. You know what I mean? It's the opposite. I'm going to put you 70 000 ft above us instead you know 6 feet below and then one day you just have a random Locust body drop from the sky because you know eventually popping. Not really efficient but you know what? It's okay. This is Delta. We have visuals on Alpha. Possible KIA. No sign of resonating. Sorry. Are you excited for Gears 4? Oh very. Like I like how it just looks gritty. Yeah. Yeah. Yeah. It was super dark. I I just Yeah. That on top of the fact Well like I think it was a little like uh darker than it should have been. Well sure. But I mean on the Xbox conference Oh no. No. I mean like",
            "start": 808.04
        },
        {
            "text": "super dark. I I just Yeah. That on top of the fact Well like I think it was a little like uh darker than it should have been. Well sure. But I mean on the Xbox conference Oh no. No. I mean like the like the the the demo was like super dark. I was like I can't see some things but what I could see was awesome. Oh yeah. Oh that's beautiful. So are you going to try to get all the achievements in this? Uh no. I still have achievement hunting once I hit like 50k. That was it. Yeah. I had like because I had GameFly and then it got to the point where I was playing games for like 60 hours I just really didn't like but it was just for the achievement. You know what I mean? Like you know the trophy hunting you do. Same. Yeah. Exactly. We understand. Let me know if you see ammo. Only Lancer using this pistol like a new A pistol doesn't work though. Yeah but it's not cool. It doesn't have a chainsaw on it. That's true. This is very true. Now did you know there's a little known fact that",
            "start": 858.56
        },
        {
            "text": "this pistol like a new A pistol doesn't work though. Yeah but it's not cool. It doesn't have a chainsaw on it. That's true. This is very true. Now did you know there's a little known fact that Cliff Bleszinski worked on this game? This is true. Not many people know that. Not No I mean not this remake. The original. Oh okay. Yeah. Yeah. I was going to say the original. I think Cliff since he's worked a day in his life since he put out this He's set. He's good. God that guy's got no head. That's gross. I don't even think I'd be able to lift these guns up to be honest. They look heavy. Tim is this game rated M for Mature? Oh my gosh. Thank goodness. Not E for Everyone. Confirmed. That's an exclusive. That's Kinda Funny Games exclusive right there. YouTube.com/KindaFunnyGames. So you got your gear right? Like with like you're in the world of Gears right? You got you got your whole armor suit on. Like what are you going to put on you? What are you going to wear that makes you different?",
            "start": 923.16
        },
        {
            "text": "gear right? Like with like you're in the world of Gears right? You got you got your whole armor suit on. Like what are you going to put on you? What are you going to wear that makes you different? Like stand out. You want like Yeah. You wear a drag. Everything's in pink. Everything's in pink. I want a pink. That's So you're like super standing out. Yeah sure. I'm That's the thing. You're the target on the field. The biggest target. The Locust are looking for uh where's where are those guys in there? And then like this pink. They're like well this can't be real. Some kind of new you know this is a decoy they've earned. There's mail cover. I'm throwing a grenade Greg. Never mind. Someone beat me to it. Okay thanks everybody. Is it It's hold to the chainsaw right? Mhm. Why did you have a chainsaw? Uh-oh. I'm down. I got you. I got you. There's a guy right in the I will be the wind beneath your wings. Did you ever know Alfredo is my hero? That's what I was trying to do to you sir.",
            "start": 976.16
        },
        {
            "text": "a chainsaw? Uh-oh. I'm down. I got you. I got you. There's a guy right in the I will be the wind beneath your wings. Did you ever know Alfredo is my hero? That's what I was trying to do to you sir. Now you understand. No blunt funeral for you. Alfredo was everything I would like to meet. So this was the bodyguard. Are you Whitney Houston or Kevin Costner? That was not the bodyguard. Wing wings beneath my wings was not the bodyguard. I know but I'm thinking of The Bodyguard right now. Okay that's fine. I'm clearly Whitney Houston and you're Kevin Costner. That's how this works. But you can sing very well. I'm trying to That's why I'm Whitney Houston. You know what I mean? Now if we're while we're talking about bodyguards am I Paul Simon or are you Chevy Chase? Oo you're probably Chevy Chase. Yeah probably. Yeah let's put that out there. You have talent. I don't have You got humor. Yeah. No I know. I meant like Sorry. If Chevy Chase is watching this that wasn't a knock that you don't",
            "start": 1019.92
        },
        {
            "text": "Yeah probably. Yeah let's put that out there. You have talent. I don't have You got humor. Yeah. No I know. I meant like Sorry. If Chevy Chase is watching this that wasn't a knock that you don't have talent. I just meant in the singing and like if in terms of that he'd be the Paul Simon like you know running the show. I think everyone's going to tweet this at Chevy Chase. Now I welcome. I mean I didn't mean to do that to Chevy. There's bees watching. Now we're going to have Now it's Kinda Funny. He's going to have beef style. Anyway like \"Yo you got beef. I'm happy to chew it.\" That'd be awesome if that's not Chevy Chase. We made it 0 minutes into this Gears of War Let's Play just to hear us talk crap on him. Got it. Yes. Oh I got to plug this hole. Greg you're down dude. I'm down. But I plugged the hole. There's nothing else going out of that. That's true. Like we're good. I'm not going to lie. I didn't realize those guys are bad guys when I was running up on them. So I",
            "start": 1076.72
        },
        {
            "text": "But I plugged the hole. There's nothing else going out of that. That's true. Like we're good. I'm not going to lie. I didn't realize those guys are bad guys when I was running up on them. So I got There's like a lot of There's like a lot of **** going on around you. Seal the holes Greg. That's a That's I'm just making sure. Well you know what I mean? 'Cause I did this and it was like continue search for Alpha Squad. I know but I'm coming for you bro. Oh I know. You got me. Who is shooting me now? All right. You are. You are. Mhm. See this is where you watch Greg succeed. Hey I've been succeeding this whole time. This is your clutch moment. You know what I mean? This is where you go big or you go home. I ain't going home. I ain't going home till I save my boy Alfredo. I'm out of ammo again on the gun. I like got more nades. Where's that? Oh he's right here. Got him for you. I think one of the things was always difficult for me with Gears is that you sprint with a See I'm",
            "start": 1127.2
        },
        {
            "text": "ammo again on the gun. I like got more nades. Where's that? Oh he's right here. Got him for you. I think one of the things was always difficult for me with Gears is that you sprint with a See I'm hitting the B button. What the hell? What's going on? Oh I don't have the gun out. That's a good point. All right that one's on me everybody. Cliff Bleszinski that's not on your eyeball. Can pistol whip without a pistol. Well you No I was pistol with the pistol but I thought I had Look at these tire marks. Was someone drifting here? Han lives. All right. Where are you guys at? Don't worry I got one. Oh I saw that. I got a second point of view on that one. That POV times two. What if this was set in the Fast and Furious movie? Obviously in the way future. Yeah. Like way way in the future. That's true. You're right. You're right. You're right. This all This is all making sense now. I think we finally cracked the code. Dom is Letty in in Dominic Toretto's kid. That makes perfect sense.",
            "start": 1174.96
        },
        {
            "text": "That's true. You're right. You're right. You're right. This all This is all making sense now. I think we finally cracked the code. Dom is Letty in in Dominic Toretto's kid. That makes perfect sense. That explains all the burning cars everywhere. I have no ammo. Where's the ammo? Drop you some ammo. I will not. Dude Kim could be like Han's like offspring too. This is making a lot of sense to be honest. I knew we cracked. You would have figured out some kind of goddamn advance. There's some ammo. Don't worry Fredo. Thanks for all your help. Is beard like Paul Walker's offspring man? Damn it Fredo. I was walking right up on the ammo. You advanced it. Oh this is where we have choices. It's like left or right. What do you want to do? You pick. You know what I mean? I'm more of a right person. Let's do it. You know you right brain. You're right brain. You're right-handed. left. Yes sir. You're going left. Still got six bullets. That's all I got. Got to make them count. I would be",
            "start": 1237.2
        },
        {
            "text": "person. Let's do it. You know you right brain. You're right brain. You're right-handed. left. Yes sir. You're going left. Still got six bullets. That's all I got. Got to make them count. I would be like no help whatsoever in this like post-apocalyptic world. I don't even think I'd be. You know what I mean? Like what do we even do? Like you and I or we'd be dead by now. I mean you look at these guys there's a reason they all as as you say that. Yeah. Yeah. We're dead. But I'm alive. You're alive. I was I had six bullets. I'm like I was using them liberally. I was starting to take I was starting to take loadbearing pillars 'cause I was going to bring down the building on top of the bad guys. But you know that's a big plan. That's a master plan. You know what? You make you got to make do. Sometimes life gives you six bullets. You got to make lemonade. That's what I always say. Let's go back in there. You hit it. Did I hit it? You hit it. Low last checkpoint 'cause I went down. Remember?",
            "start": 1287.68
        },
        {
            "text": "Sometimes life gives you six bullets. You got to make lemonade. That's what I always say. Let's go back in there. You hit it. Did I hit it? You hit it. Low last checkpoint 'cause I went down. Remember? Oh we split. So I can't go down 'cause you can't save me. Right. Exactly. None of us. I can't go down either. Mhm. Mhm. Even though we got We got to be efficient on our own. This is much like the Pitbull and Kesha song. Timber. That's true. We're going down. I'm yelling timber. I'm yelling timber. I'm going to switch things up. There's a turret up top. So I'm going to go left. So now I got to deal with more than six bullets this time. Uh I'd hope so. You got that crafty pistol though. Sure. And six bullets. Thanks for Greg. I'm only trying to make you succeed even harder. Even harder than you are right now. Zero in the pistol. Six. Oh it's right. There's the uh blindfire. Where's this one? It's down that hall. Okay. I'm going to use my load bearing structure. Now I do I do in fact have a",
            "start": 1335.92
        },
        {
            "text": "are right now. Zero in the pistol. Six. Oh it's right. There's the uh blindfire. Where's this one? It's down that hall. Okay. I'm going to use my load bearing structure. Now I do I do in fact have a grenade as they say. Grenade. Oh I think I'm making my way. Throw it. I'm making my way. I'm making my way. Making my way downtown. Walking fast. Faces passing my homebound. Now when do we take this act on the road? That's the question. See I got here. But I mean you're good though. drowned in your memory. Vanessa Carlton I tell you what man. What do you think she's doing right now? Making just sitting back still getting that white chick's money. All right. Every time that movie plays she makes 10 grand I bet. And God bless her. She deserves it. Such a talented artist. Hope she watches her. Chevy Chase. Different reasons of course seeing as how the whole Fast and Furious crew one day we'll watch these videos. I like to imagine that. Everybody's just sitting there on the set of",
            "start": 1390.4
        },
        {
            "text": "her. Chevy Chase. Different reasons of course seeing as how the whole Fast and Furious crew one day we'll watch these videos. I like to imagine that. Everybody's just sitting there on the set of Fast and Furious eight. Seven. Which one are they? I can never remember. Eight. And then there's like what two? At least two more coming out. Eventually. Eventually I want them in space. Yeah. You know what I mean? Like why not? They've got to go soon. they got to change it up. Or like they take they start taking plots from other movies you know what I mean? Like The Core where they have to essentially go fix the core of the earth you know? And so instead of like drifting cars they're drifting like can we pick something better than like I feel like that's not the first place I jump to and I'm like let's rip off a movie idea. And remember that's what's so great about why I keep saying they got to do that 21 Jump Street Men in Black mashup. That's just a great idea. I'm going to grab this",
            "start": 1459.8
        },
        {
            "text": "like let's rip off a movie idea. And remember that's what's so great about why I keep saying they got to do that 21 Jump Street Men in Black mashup. That's just a great idea. I'm going to grab this gun 'cause I don't have any other guns. I will back you up from the rear. That guy's dead. That guy's dead. Who's your favorite character in Gears? Cole Train. Yep. Yep. He brought a He brought levity that we needed. You know what I mean? The whole Woo Cole Train Hummer bro. He was a Thrashball player I believe. Thrashball wasn't it? Thrash. Yeah Griff. Griffball. Uh Poké Balls. Poké Ball. Pokémon's Pokémon. There's so much gear. Like gear. Get it? Metal Gear. Oh **** By the way still still zero bullets Fredo. Let you know if you want to help me out on that. I'm going to bust this. Was there really a point of busting that down like that? Yeah. You look badass. True. You alert everyone. Well I don't. So this is not a covert operation. At no point have we been going everybody be",
            "start": 1506.16
        },
        {
            "text": "Was there really a point of busting that down like that? Yeah. You look badass. True. You alert everyone. Well I don't. So this is not a covert operation. At no point have we been going everybody be real quiet. You know what I mean? I feel like we should get scientists together to make more Clorox so that way we can start scrubbing down these walls. You know what I mean? Change the whole view of everything. I think that would help scientist together. I mean well now that's you make fun of it. You say like but do you know the rest of your do you ever think about that? Do you ever think about that? I always think about this. Yeah. Imagine if yeah the world ended or or we fell asleep and then woke up a thousand years in the future and I tell them all these stories of Xboxes and this and Clorox and they're like cool can you make any of that and I'm like no I have no I'm like do you understand I can't even make you an apple pie right now and you probably have those ingredients. Can I make",
            "start": 1569.44
        },
        {
            "text": "and they're like cool can you make any of that and I'm like no I have no I'm like do you understand I can't even make you an apple pie right now and you probably have those ingredients. Can I make you a microprocessor? No I don't know the hell I'm doing. Do you have any electricity? No. What is it? I'm like it's blue lightning. Do you have a kite? I remember kites coming off. We are the most useless generation. Yeah we are. 4 out of 11. The comic book is coming together nicely. I feel like this should be our last our last push. Damn it. Pushing real good. Oh sh these turrets they just get you. Why is Why Why is all the ammo? I would never be the turret guy though. You know what I mean? That guy so vulnerable. Get in there. I'm looking for ammo back there. Got it. I'm just slaying. That's what you do bro. If you see ammo don't take it. You see Clorox. How are you not Yeah. Well if you see Clorox drink it so you never forget it. Drink it so you never forget it. I used to always",
            "start": 1609.2
        },
        {
            "text": "what you do bro. If you see ammo don't take it. You see Clorox. How are you not Yeah. Well if you see Clorox drink it so you never forget it. Drink it so you never forget it. I used to always say My mom used to always say \"If you find any Clorox under the sink Greg you drink it. Don't forget it.\" I'm like \"I got it Mom. There is ammo right here. Where? Standing right on it. Coming to you. I got a frag grenade. I don't want that. I took it wrong. Good job. Thanks Fredo. All right back in business everybody. It's going down. Y'all got the hole. Look at that. All clear. Cut this area time in half. Yo speedruns. Let's go. We're setting the world record right now. Uh the house this way. Tell me. There looks like there's things that do this way. There we go. You good? So campaign 60 FPS right? And then 30 for MP. I thought is that right? 60 for first or for I thought they're both 60. Are they? No. Online 30 for uh So it's a reverse of what you said. 30 campaign 60",
            "start": 1669.04
        },
        {
            "text": "campaign 60 FPS right? And then 30 for MP. I thought is that right? 60 for first or for I thought they're both 60. Are they? No. Online 30 for uh So it's a reverse of what you said. 30 campaign 60 multiplayer. Yes. Got it. Yeah. Reverse. Do you know how to make bleach? Don't know. See that's all right. So if I like I mean I would be like like So I would just start at the basic level. If I be on there I'd start with water. Yep. Like component at least it cleans things and it can disinfect. They're like all right cool. What? And I'm like it's a liquid and it smells funny. So I'd be like give me some water limestone. Let's get cracking. Let's see what we come up with. Water. Alcohol. Maybe like rubbing alcohol. Yeah. Well yeah. But I'm saying we don't even have that. You know what I mean? Like we're like we're So we just have water. We basically Yeah. Well I think everybody would know water and like that would be a thing. They'd be like \"I need water.\" They're like \"What's that?\"",
            "start": 1738.04
        },
        {
            "text": "Like we're like we're So we just have water. We basically Yeah. Well I think everybody would know water and like that would be a thing. They'd be like \"I need water.\" They're like \"What's that?\" And I'm like \"It's it's it falls from the sky. It might you might have seen it in giant pools. It's comes from clouds. It's wet. If you were to hit it it would go splish splash splash.\" Just the sound effects of it right? And then they're going to go \"Sometime you drink it sometimes you rub yourself in it.\" Call that the Poliwali. And I'm like \"Oh well bring.\" And they're going to say \"What's limestone?\" And I'm going to be like \"I don't know. I honestly don't have that as to what limestone is but I know it's used in things. Do you have a quarry that say what's a quarry? I'm like what's what do you call a hole? Like oh we call that the dippydoo. I'll be like all right dipped that has a bunch of jagged jagged uh Poliwalis that are frozen. It's going to be confusing is",
            "start": 1796.88
        },
        {
            "text": "what's what do you call a hole? Like oh we call that the dippydoo. I'll be like all right dipped that has a bunch of jagged jagged uh Poliwalis that are frozen. It's going to be confusing is basically what I'm saying. Man the whole team just got killed by me. Not that I'm bragging. I mean you did all the work. It's team effort. Co-op. It's true. They didn't call a single out shot. Nice. Imagine the food you'd have to eat in the post-apocalyptic world. Like wheat potatoes just straight up wheat. You know what I mean? You have to worry about farming. Like if you gave me wheat I'd be like \"This is valuable but what do I do?\" Again I know that things can be done with this. Bring me all the poly you can. You can't even Google anything. Like we're so screwed right? I know. It's a terrible world to live. Really bad. That's the whole thing again. And why I would just end up killing myself pretty much immediately 'cause imagine this. Imagine it like this. And this is how we'll end the",
            "start": 1836.96
        },
        {
            "text": "world to live. Really bad. That's the whole thing again. And why I would just end up killing myself pretty much immediately 'cause imagine this. Imagine it like this. And this is how we'll end the Let's Play. You get there you're you're just hungry right? And they bring you a pig and you're like \"Oh at least I can have some bacon some ham.\" You can't. How How is a a pig ham and pork chops and bacon? Nobody knows how to get this thing out of this thing. What part of the pig is bacon? I don't even know where to begin. Yeah I don't even You cut it open. I'm in over my head. Step one. Step one complain. Oh my goodness gracious. Ladies and gentlemen that's another Let's Play here on YouTube.com/KindaFunnyGames. Remember we put up a new one each and every day. Sometimes we get to go play unreleased cool games like this. Gears of War: Ultimate Edition. When's it out Alfredo? August 5th. How much is it? $40. Wait is it 5th or 6th? Damn he's better than me at this job. Got it. Good",
            "start": 1897.2
        },
        {
            "text": "unreleased cool games like this. Gears of War: Ultimate Edition. When's it out Alfredo? August 5th. How much is it? $40. Wait is it 5th or 6th? Damn he's better than me at this job. Got it. Good job. And I'm picking up Cole Train baby. You got Cole Train up. I did. 40 bucks. You get all the backwards compatible games when they launch this fall. Uh Xbox One Windows 10 Gears of War 4 beta included for when that comes in 2016. Killed the guy that killed Alfredo. Mhm. Can I jump down to get you? How do I revive it? No I got to walk down. It doesn't work. You just go we got the cut scene. All right. Well ladies and gentlemen thank you Alfredo. Everybody make sure you follow him on Twitter. Go on Twitch. Twitch.tv/AlfredoPlays. I'll play this. I'll stream this. You play Oh okay. Thanks for throwing them a bone. Yeah. You know what I mean? I'll do it. You know what I mean? For everything you need to know about cool video games and maybe how you make bleach keep it right",
            "start": 1943.04
        },
        {
            "text": "Thanks for throwing them a bone. Yeah. You know what I mean? I'll do it. You know what I mean? For everything you need to know about cool video games and maybe how you make bleach keep it right here on YouTube.com/KindaFunnyGames. Get you guys out of here. Hell yeah. We've been waiting for the chopper but the radios don't work for **** sir. We noticed it's the Cedars. They're jamming our transmissions. Then we have to make those Cedars our top priority sir. Agreed. We need to reestablish radio contact with control ASAP. Number 83. Damn. The one and only baby.",
            "start": 1981.04
        }
    ]
}