{
    "id": 1155,
    "video_id": "tQAt_4oNBI4",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Robert Peeler"
    ],
    "title": "Metal Gear Solid V: The Phantom Pain - Extracting a Highly Skilled Soldier - Kinda Funny Plays",
    "description": "We need talent at Mother Base, so let's go get a highly skilled soldier... and fight a bear.\n\nABOUT SPOILERS: Hey! It's me, Greg. I've played 60 hours of MGSV. Nothing in these early let's plays will spoil the story. Yes, you will now know how missions begin and story elements, but the fun in MGSV is tackling these situations how you want to. Plus, the story elements you'll see here have been in trailers. I love the Metal gear franchise, and I wouldn't ruin it for you. Also, I know you're better than I am at MGS, so don't bother saying it in the comments. ;)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nTalk about the Let's Plays here: http://kindafunnyforums.com/viewtopic.php?t=3799\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1440788401,
    "duration": 996,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to another Metal Gear Solid V: The Phantom Pain let's play on youtube.com/Kinda Funny Games. I'm Greg. This is Robert and I can touch them through the Codec if I do that. You like it? It's fun. The power of the Codec. And this is of course Metal Gear Solid V: The Phantom Pain. Uh we are still in free roam mode here. Uh we are running out and we're going to go over here and get this guy. We This is one of the Side Ops right? We're going to come over here and extract the highly skilled soldier 01 or whatever. Uh 01 which means potentially more. Now if you notice here we got some guys in a car coming. I'm out here exposed. Now what I do want to do is get a supply drop. We've been running around in the free world screwing around having some fun. Poppy's get off and get them. Suppressor's low. Yeah I see everything's everything's screwed up. So I'm going to get off here. Get low as you get get some golden crescents here. Collect all this. But now",
            "start": 1.6
        },
        {
            "text": "get off and get them. Suppressor's low. Yeah I see everything's everything's screwed up. So I'm going to get off here. Get low as you get get some golden crescents here. Collect all this. But now we're going to call on a supply drop to get all the stuff we've been uh screwing around missing. You know what I mean? You don't want to do that at all. Uh full sun. Let me just chill out a bit. Yeah. Watch out for these guys coming up. Get nice and low. They can't see me up here. No. Maybe they see my horse and they're just going to be like \"That's a pretty horse up there in battle armor but there's nobody on it so I don't need to investigate.\" Surely not an issue. No problem. I'm sure that thing isn't here to start any trouble whatsoever. It's a wild horse with very good stitching skills. Now while we're doing that the supplies got dropped. Yeah. like so they don't just show you how far you are from it but actually how far it is from you as it floats in. There it is. There it is.",
            "start": 38.64
        },
        {
            "text": "Now while we're doing that the supplies got dropped. Yeah. like so they don't just show you how far you are from it but actually how far it is from you as it floats in. There it is. There it is. And there's another one of them birds. That bird's going to get it. Get out of here bird. You'll see the suppressor. There we go. Replenished. And so the idea here is that you never have to go back to Mother Base if you don't want to. Now you need to go back to Mother Base. Obviously your soldiers are missing. Take good care of your guys and whatnot. Oh they stopped here. Interesting. Interesting. I think eventually they they start saying \"Boss is that you?\" Do they really? I haven't seen you in so long Boss. It's been years. It's been a couple weeks. Calm down. I've been out there busting my ass getting you extra guys. What are you doing? What are you doing? Getting I haven't done the We in this in our Let's Play series yet. We haven't done where we've hidden from anybody on horse.",
            "start": 80.16
        },
        {
            "text": "my ass getting you extra guys. What are you doing? What are you doing? Getting I haven't done the We in this in our Let's Play series yet. We haven't done where we've hidden from anybody on horse. You know what I mean? Yeah. I haven't been hiding very much from anybody really. Okay you know what? That was below the belt. Here we go. Got dudes over here now too. Where we go? There's one guy at least. He's not in the mountains. It's one of those it starts. You think you're looking right at him. You're not looking at anything. You know how it is. Looks like you've been here before. Really? I haven't been here before. I saw a couple guys already spotted them. Oh but that's that truck. See the truck came in in park that we I had been tracking for a while there. Okay. Okay. Glad you got a good shot of those lights. You know what? You infiltrate how you want to infiltrate. I'll infiltrate. Make sure I spot these. Don't want them to go unnoticed. I was trying to look through to the little",
            "start": 120.0
        },
        {
            "text": "good shot of those lights. You know what? You infiltrate how you want to infiltrate. I'll infiltrate. Make sure I spot these. Don't want them to go unnoticed. I was trying to look through to the little shack right there. You always got to be critiquing. Don't forget there's a poster over there. We were talking earlier about putting something on boxes. These are a way. Yeah this is the fast travel system to get around. Well that's not what I was talking about at all but you can also talking about Look up here on this uh wall. Zoom in a little closer. There you go. What's that? That that tear that down. Help him out. You put that on your box and then if someone's coming close to you you can stand up and it looks like a guy saluting yourself. I did not know that. I didn't know that. That's great. Keep on rolling. Nobody wants you guys. Good. Good. Now this guy you seem like you're going to be trouble. Going to have eyes on me here. I was going to get the dude over here. Now I'm just",
            "start": 166.56
        },
        {
            "text": "great. Keep on rolling. Nobody wants you guys. Good. Good. Now this guy you seem like you're going to be trouble. Going to have eyes on me here. I was going to get the dude over here. Now I'm just saying forget him. Now that the truck dudes have left we're going to come over here. We're get our poster. Then we'll fix our box. Then as you just like last time we tried to do one of these Side Ops totally distracted not even remotely going for what I'm supposed to be doing. Still 3 35 m away. Having fun that's what it's all about. This is actually the location of another mission. Oh. Oh dear. Yeah behind some things. That guy got tagged though. This guy's trouble. You can see pretty easily. watch for his coffin. Get distracted then. Yeah. Ah Mother of Pearl. Oh no. God damn it. This guy will turn around. Argh. Give me the poster. See you later. Perfect. But I mean hey man I was pretty clear about what I wanted. Heal up. Stick to the ground. Call the horse. I want your horse get shot.",
            "start": 207.4
        },
        {
            "text": "turn around. Argh. Give me the poster. See you later. Perfect. But I mean hey man I was pretty clear about what I wanted. Heal up. Stick to the ground. Call the horse. I want your horse get shot. The horse is going to be fine. She's got battle armor on. All right. None of that mission points. Oh no. Oh no. Shut the horse down. Oh the Oh no. I'm sorry. I didn't expect the porta-potty. I'm sorry. That's the first time I've ever seen D-Horse go down. Oh Lord Almighty. It was the porta-potty. No one expected the porta-potty to be there. They're even using mortar fire against you. You got to get low. So now my trust with the horse is probably down right? It could be. Could be. Sorry. The more you let them get injured they'll start being like I'm not sure about this guy. It was going to be fine until we turbo ran right? And that's the one thing about it. The one thing about the horse is super smart. Every time you tell you get on it and go you have such a bad camera angle. You",
            "start": 270.92
        },
        {
            "text": "to be fine until we turbo ran right? And that's the one thing about it. The one thing about the horse is super smart. Every time you tell you get on it and go you have such a bad camera angle. You get that side view you easily run into porta-potties and die. If you're running alongside it and you call it it'll run alongside you and pitch on it. And that's actually a much better way to grab hold of it and escape. All right pro tip. There you go. Learn from my mistakes ladies and gentlemen. When you play this on September 1st I think you can call your horse. It's probably better now. He forgives you. Thank you I mean things happen. The horse understands. It knows the job it signed up for. You can jump off of uh large cliff faces when you're riding the horse. Be fine. No he will get hurt. Okay. And then maybe you're That's definitely not something I want. So be careful when you're riding right? It's felt bad enough that what just happened there? Like that seems fine enough but",
            "start": 333.44
        },
        {
            "text": "hurt. Okay. And then maybe you're That's definitely not something I want. So be careful when you're riding right? It's felt bad enough that what just happened there? Like that seems fine enough but a little further and he starts to got the old hoof start animal shoot or not. He's like make those legends. Horses are incredible creatures. I don't know if you ever stopped to make that like dinosaurs man. There's not of this world but here they are sitting around eating carrots sometimes talking. Carrots aren't good for people. Really? No that is not true. I don't know. Where have you heard that? Well you know carrots are you know animal like bunnies and rabbits. They're synonymous with eating carrots right? Yeah. Not good for them either. What does that Okay what does that mean though? Not good for them. Like it's not a a healthy diet for them. It's filled with sugar. Oh okay. That's fine. Important tip. You don't I mean you'd have to feed them like non-stop carrots for",
            "start": 379.6
        },
        {
            "text": "though? Not good for them. Like it's not a a healthy diet for them. It's filled with sugar. Oh okay. That's fine. Important tip. You don't I mean you'd have to feed them like non-stop carrots for that to really hurt. Oh yeah. I'm just saying. Okay. I'm just saying that I don't sugar cubes are probably not the best either but Yeah of course. Us drinking sodas and not working out and sitting here playing video games. Not a great idea but we do it. And giving this life to our horses it's cruel. No this is a good life. Yeah you were thinking. I'm just spending the conversation. You're right. You're you're taking the horse conversation. I gave you the horse ball and you ran with it which I I mean we got 1 800 meters to go. There's lots of It's going It was going fast and then you get into this mountain range here and that's like check your iDroid. Make sure you path here. I'm making the path around it here. I'm going to take it up here and go that way. Okay. Either way it's not I",
            "start": 423.44
        },
        {
            "text": "into this mountain range here and that's like check your iDroid. Make sure you path here. I'm making the path around it here. I'm going to take it up here and go that way. Okay. Either way it's not I don't have a direct path. You know what I mean? Yeah. And that's often the case. Yeah. They want you to get out here and explore everything. See what's happening. Run into these uh patrols and outposts. You might have to infiltrate that door and get around. Look at this guy. He sees something. He's Yeah he's really fixated on probably thinking about horses and carrots. He's probably It's upset with the world. Can't believe these stereotypes. Can't believe I fed my horse carrots for years. Everything's poly. Didn't even know it was bad. Explains why they all had diabetes. Now can horses have diabetes? You think? I don't know. Nick you think horses can have diabetes? Sure. Okay. That is his most interesting reply. That's That's Nick just tuned out. He doesn't know. super interested in",
            "start": 460.24
        },
        {
            "text": "diabetes? You think? I don't know. Nick you think horses can have diabetes? Sure. Okay. That is his most interesting reply. That's That's Nick just tuned out. He doesn't know. super interested in that response. Yeah I think he's watching YouTube videos probably. Other Let's Plays more interesting ones. It's Kevin's fault. Is you? Something's happening. It's Kevin's fault. Got it. Don't kill any more sheep. I'm not I didn't kill any. Period. Okay remember I ex I extracted two. I ran one over in the horse but you said he's probably fine. Yeah. Difference there. Of course you. So now if I hadn't wanted to ride all this way I could have helicoptered. You could helicopter. It'll cost you more GMP. Sure. You could try to use uh your box and truck right? But I have Maybe there'll be some outposts that are nearby even if it's not the one you usually go to. You could later on the game use D-Walker. You could get in someone's car or truck and drive yourself. Gotcha. But you see Whoa. Ah",
            "start": 500.64
        },
        {
            "text": "that are nearby even if it's not the one you usually go to. You could later on the game use D-Walker. You could get in someone's car or truck and drive yourself. Gotcha. But you see Whoa. Ah well we ran into something else that's off the beaten path. Well do you want to deal with it or do you want to move on? I have a history with the bear right? If you remember during the preview event I do. I spent about 15 minutes trying to kill a bear which is way too long. It kept killing. You can see you now. At least getting him. But he's coming after you. Now we're just going to wait him out. We're going to play the waiting game with the bear. I think you already got him. Actually he's not the strongest of Kodiak. This one you ran into. I There was one I shot in the head about 15 times. There's a stronger one. Oh. Oh no. He did not. You tricked me again. I thought he Peeler out. Run. No. Horse. We can't do this again. D-Horse. No. Get on the Snake. What are you doing? You need to do",
            "start": 563.04
        },
        {
            "text": "There's a stronger one. Oh. Oh no. He did not. You tricked me again. I thought he Peeler out. Run. No. Horse. We can't do this again. D-Horse. No. Get on the Snake. What are you doing? You need to do those dives. That's a serious injury. God damn it. This whole Every time I see this goddamn bear you tricked me. I had a plan. I was going to strafe around and you said you got him. Where are you surrounding? You said he was down. You're the guy who's played 00 hours in the game and find out whether or not he's down. I tried. Put yourself in a vulnerable position. I can't help you. You're a real piece of junk. Want to try again? Yeah. Where is he? Down the road a little bit. Probably up this hill. Cuz it was a perfect tag and then you're like he's probably down. I think it was the suppressor went off. Nope. Nope. Nope. Nope. Go too far. Nope. Nope. Nope. Maybe it pushed you past him. Like not yet. Not ready. Not yet. You're not ready. I will. I swear to God during these Let's Plays",
            "start": 612.48
        },
        {
            "text": "went off. Nope. Nope. Nope. Nope. Go too far. Nope. Nope. Nope. Maybe it pushed you past him. Like not yet. Not ready. Not yet. You're not ready. I will. I swear to God during these Let's Plays I'm going to get this bear. That's not even the strongest bear. How do you know? There are stronger bears. There's bears that take like one tank-strength shots to the head. That bear that bear could have easily been that bear. I hit it once and you're like I think you got it and I was like \"Oh great.\" And then I took my eyes off and it was on top of me. You screwed me Peeler. Then I got f***ing cats in my ears. That's a serious injury. No I didn't like I didn't notice that. I didn't notice my arms bent the wrong way. Getting closer. Yeah we're almost there now. That expert soldier that'll change the It'll make me feel good about fighting bears down the road. just led me right to him. You said I had him. I think you have them. You said I was like \"Oh man this a lot.\" Trust anything I say.",
            "start": 667.92
        },
        {
            "text": "the It'll make me feel good about fighting bears down the road. just led me right to him. You said I had him. I think you have them. You said I was like \"Oh man this a lot.\" Trust anything I say. Really? Apparently I've been I've been you know leading you down. Been sandbagging me this whole time. primrose path this whole time. Aha. All right. Where is he? He's over this. He's down here. He's doing shenanigans in the water. He's probably taking a bath. F*** the enemy sniper. Stay low and crawl along the ground. That should enable you to sneak past enemies. Yeah a little too late on that one. Thanks Grind the rock. It spot you. If you go around it. Well yeah. I'm pinned down. Maybe you can go run to that next rock. You think run backwards. Go back up the hill. Yeah. Yeah. He can't see. His visibility is only such. But now you can collect their data. That's the target. Gotcha. So now we flank them. Precisely. There's no bear. There's a good cross point across this river right",
            "start": 726.64
        },
        {
            "text": "see. His visibility is only such. But now you can collect their data. That's the target. Gotcha. So now we flank them. Precisely. There's no bear. There's a good cross point across this river right over there. Is there a tanker truck in the water? Not that far. I'm just No I know. I'm not saying that has anything to do with it other than you don't know what's been happening in this war. There's been lots of skirmishes. I understand arrived at quite adept at taking out their Russian enemies where I should forge the river. Yeah. Back this way. You want up top? Yeah. I played this part in a really early build. Yeah. But I hadn't done this uh Side Op yet. It's kind of lingering in my queue. And uh I had done a bunch of other missions and leading up to this was the middle of the night. I wasn't expecting it. It terrified me when they started firing him. Like they really caught me off guard. It was pretty crazy. So that's still happen to you. You're still get finding new and new things.",
            "start": 808.12
        },
        {
            "text": "expecting it. It terrified me when they started firing him. Like they really caught me off guard. It was pretty crazy. So that's still happen to you. You're still get finding new and new things. Yeah. And that's what's cool about you know the different missions and what order you play them in that things can really just surprise you. And the areas are so vast it's really hard to keep track of where everything might be. Sure. Sure. Plus this is like the first enemy sniper you run into. Oh there's another guy out here too. Huh? Yeah. Damn it. Hit the rock. Did it? Yeah. There we go. It's that simple. Yeah. So you know side the long journey I took here the bear a few other things the poster some things got in the way but yeah the actual mission itself not that hard. But in general Side Ops missions can be really quick depending on how you do it. I should have we should have helicoptered in. We got cocky. We were like \"Let's we'll roll we'll ride right over there. It'll\"",
            "start": 882.64
        },
        {
            "text": "Side Ops missions can be really quick depending on how you do it. I should have we should have helicoptered in. We got cocky. We were like \"Let's we'll roll we'll ride right over there. It'll be a fun trek ac through the Afghan desert.\" Right. Didn't work out too well. But I got another trophy. That's hot. Nice. Ladies and gentlemen that's been another Metal Gear Solid V: The Phantom Pain let's play here on youtube.com/Kinda Funny Games. If you like them make sure you subscribe. We're putting up a whole bunch. I'm Greg. This is Robert. And until next time it's been our pleasure to serve you.",
            "start": 958.56
        }
    ]
}