{
    "id": 1097,
    "video_id": "w9owLj5cuvQ",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Let's Play Gang Beasts on PlayStation 4 - Kinda Funny Plays",
    "description": "The boys play Gang Beasts on PlayStation 4.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, Nick Scarpino and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1438887602,
    "duration": 760,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to another Let's Play here on youtube.com/KindaFunnyGames. I'm Greg, that's Colin, that's Nick, that's Tim, and this is Gang Beasts, of course. Okay, I'm coming, run into you. I'm coming after you, bro. Gang Beasts is crazy. No, no, no, you're not going to get me. I'm you got yourself. I've just been, I got no one, bro. I got no one. I'm holding on for a hero on this one. No, son of a bitch, if Nick wouldn't have been just attacking everybody. I'm red. Oh, I'm the ass here for being aggressive and you're yellow. All right, cool. Unbelievable. Gang Beasts is all about beating the hell at each other. It's one of those games with the wonky physics and the what now. Try to get, I like, I'm loving this four-player co-op green screen activity I have on this. How do the controls work? Because I've watched trailers from this game a million times and it's hilarious looking, but I never understood it. And as I play it now, I still don't quite understand. So it's my understanding that the controls, um, actually",
            "start": 0.16
        },
        {
            "text": "trailers from this game a million times and it's hilarious looking, but I never understood it. And as I play it now, I still don't quite understand. So it's my understanding that the controls, um, actually change every 15 seconds. Okay, that's not true. So that's part of the fun. Oh no, oh Tim, oh no, Tim. So L1 and R1 control your arms and you can kind of like grab, grab. X is Jump. Mhm. Circle is like this weird flailing thing that like you just throw yourself to the floor. Oh God, you jerk, Nick. You bitch, Nick. You didn't even know what you were doing. That a real move? Look at me, my. Oh no, oh shit, oh Lord. Did we all die? I don't know. Draw. I want, wait, it said I won and then a draw. You got to drop. Oh my God. Okay, it totally said I won for a second. It did. Then it better, then yeah, then it decided that's not how it really went. Computers can learn too, Colin. I know that's the scary part of that's how AI works. Have you seen the movie AI? I have. What is this? I love this game. Psychotic. I'm just going to stay",
            "start": 45.28
        },
        {
            "text": "how it really went. Computers can learn too, Colin. I know that's the scary part of that's how AI works. Have you seen the movie AI? I have. What is this? I love this game. Psychotic. I'm just going to stay here. Yeah, I was going to say, I'm just going to wait it all out. Goes, there goes. How are we supposed to win? I guess in the water. Oh, I see. Colin, get him, get him, Colin, get him. I just tossed you off a Ferris wheel. I don't even know where my character is anymore, guys, to be perfectly honest. Oh, I'm right there. Oh, I fell. The see, I don't like this kind of shit though, with the like the environmental hazards. You like to be, it's a game of skills, it's a game of skill and I'm dead for no reason. I don't think you're dead. It's like BattleBots on TV how they have like the little saws and show. Yeah. Oh no, I am dead. Okay, there now Tim's going to die and I'm going to win without ever having what you went through the boardwalk. We all got jacked out on that one. Happens. That's how Gang Beasts roll. Okay, all right. Oh",
            "start": 96.04
        },
        {
            "text": "Okay, there now Tim's going to die and I'm going to win without ever having what you went through the boardwalk. We all got jacked out on that one. Happens. That's how Gang Beasts roll. Okay, all right. Oh Lord, God damn it. I showed my own jump. Yes, Green wins. Fuck you got screwed just like it should be. Clear that we're playing on a very early debug PS4. We're not playing, we're not playing the uh, the PC game. We're too late. We're too busy being lost in game. Greg and Colin are not disembodied heads. They actually have bodies as well. Spoilers, spoiler, spoiler alert. I'm just going to wait. You guys are going to kill each other on this. Uh oh, uh, watch out, those planks are loose over there. Oh my God, I'm spinning around. All right, this game is funny, man. Oh, zero. Uh, sorry, Circle makes you go just dead, just dead. Had to flop down. No one can mess with me right now. You can't even see me. A knockout punch. Get up from that. So how do you punch? Is Square? No, you, it's R1. Oh, just don't hold. I get it. I can't even get over",
            "start": 143.96
        },
        {
            "text": "to flop down. No one can mess with me right now. You can't even see me. A knockout punch. Get up from that. So how do you punch? Is Square? No, you, it's R1. Oh, just don't hold. I get it. I can't even get over you guys. No, no. Oh God, Nick, Nick. Oh, like I'm going, this is a really, really clever. Someone's coming with me. This is a really, really clever. What are these? I guess they're, they're chicken. That's a tiger, right? Just sit there and let the, I think we all beat ourselves on that one. I won. You won because the rest of us were dumb. Okay, now it's getting real. Now we're starting to get the feel of it. Understand. Back to this level again. Hey, Greg, come here. I love you. Damn, just let you fall. I'm just dead. Where did I go? Oh, there's my body. I can run. Fuck. Watch, one of you is going to die just trying to get over to the other person. Yep, told you. At least I was mad enough to try. Don't do it, Tim. You could have won. Now it's going to be a draw. Tim, what is wrong with you? It's zero across the board. You guys",
            "start": 208.44
        },
        {
            "text": "over to the other person. Yep, told you. At least I was mad enough to try. Don't do it, Tim. You could have won. Now it's going to be a draw. Tim, what is wrong with you? It's zero across the board. You guys killed yourselves. I'm killing myself. The team packed. You can't be a Gang Beasts without a gang. Oh God, see, I like this level. This is like, like actual skill, just dragging him around. No, no, see, and, uh, damn it. How did you do that? Who's dragging who? I know what's going on. You hold, you hold the whichever punch button you're using and then that grabs and then Triangle lifts. Oh, I see. Got up like a real bear though. He's just punching him in the forehead. Oh my God. Oh no, Colin, this game is really funny. It's, it's ridiculous. This is like, I like that there's not more to it. That's it. Well, I'm sure there will be more. No, I hope there isn't. You think this is it? Just the game already out on PC. People can tell us in the comments, um, if there's more. I hope there, I hope there's nothing more to this in this business that",
            "start": 276.44
        },
        {
            "text": "no, I hope there isn't. You think this is it? Just the game already out on PC. People can tell us in the comments, um, if there's more. I hope there, I hope there's nothing more to this in this business that would be hilarious. Come get Colin, get him on my side. Get him, Greg. Thank you, Greg. Get him, get away. You're ruthless. Oh my, oh wow. Damn, Greg, just getting knocked out over and over. All right, and that's it. Dead chicken corpse on the side of the ring. Can you actually knock people out? No. Okay, how do you keep putting them on the ground? Yeah, I don't know how what you were doing any different than what I was. You, well, I'm just doing, you know, the old punch, jab, punch, punch. R1, R1. All right, here we go. Oh no, oh no, I'm glitching into Oblivion. That's what you get. He's in another dimension. That's what you get for trying to run away from it. It is a test build. It is important to notice that no, you can't. Okay, did you grab me and jump? No, Tim won by not even being able to get over the fuck up. Yeah, that stage is not right yet. I",
            "start": 358.24
        },
        {
            "text": "run away from it. It is a test build. It is important to notice that no, you can't. Okay, did you grab me and jump? No, Tim won by not even being able to get over the fuck up. Yeah, that stage is not right yet. I think you're supposed to. I like how you can't even tell 'cause the game's all fucked. I like how Nick, I like how Nick went into the Phantom Zone. That was amazing. Okay, I don't like this. I don't like this one. Oh God, did I take you into that or did you take me into that? No, yeah, damn it. I don't like when Greg wins. Too bad. That's every day. Yeah, well, yeah. Oh, this level, I want to grind someone's me. I'm going to grind. I no, no, no, Tim, no, no, Tim, no, Tim, get off me. No, Tim, Tim, no. What is happening? I think I'm being ground slow. Oh Jesus. All right. Oh, how'd you get out? I'm jumped, kept jumping. No, get him, Colin, get him, get him, Colin. You guys are fucked up. Oh no, chicken, Greg. That one doesn't work. You got to throw him into the other one. This fine. It's just he's not knocked out like, like you have to get him on. They",
            "start": 417.68
        },
        {
            "text": "him, get him, Colin. You guys are fucked up. Oh no, chicken, Greg. That one doesn't work. You got to throw him into the other one. This fine. It's just he's not knocked out like, like you have to get him on. They knocked out the old slow. Oh, are you boys ready for the, oh, this is, this is a chicken taking this one. Chicken gets this quick. You guys are like, this is violent, real violent. Gang Beasts isn't for the faint of heart. Oh no, Colin, oh Colin, oh God, Colin. Don't run away from him, Colin. Don't run away from him. Stand and fight. You got him. Throw him in. Yes. No, damn. That was, that was chicken wins. I still have no idea how to play this game. You guys keep telling me and I keep not focusing on it. Look at the background there. You live your life. Don't worry about it. I'm living my life. Thank you. God damn it, let go of me, Nick. Oh shit, no, Greg, no, no. Damn, you're good with that pick up and drop. No, no, no, no, no, no. Why are you punching me? I like how there's just no rivalries and no alliances. This is very, very, very funny game. I",
            "start": 491.12
        },
        {
            "text": "oh shit, no, Greg, no, no. Damn, you're good with that pick up and drop. No, no, no, no, no, no. Why are you punching me? I like how there's just no rivalries and no alliances. This is very, very, very funny game. I like it. Oh, shit, God. I'll honestly be, I'll be honest, I'm the worst player at this game. I don't, I'm not very good at either. I'm just doing the best I can over here trying to get bitch, throwing me out like yesterday's trash. All right, this is fun. Should we do one more? Yeah, we'll do one more. Do one more, of course. Yeah, already have on PC being published by Double Fine. It's part of their little helper program coming to console here on the PlayStation 4. We're playing on here we go. Let's see if we a little bit. Well, I'm gone. I'm not even here. Here over. I'll knock you the fuck out. Uh oh, damn it. How did you keep knocking me out? 'Cause there can only be one winner. Oh my God, what is this? Double double choke. Fuck no. What the hell? Awesome. I want to keep going. I want more. One more, one more. I can't, I can't, uh",
            "start": 603.04
        },
        {
            "text": "you keep knocking me out 'cause there can only be one winner. Oh my God, what is this? Double double choke. Fuck no. What the hell? Awesome. I want to keep going. I want more. One more, one more. I can't, I can't, uh, Colin figured out the master code of this thing. Okay, I'm going, went down all the way down. Yeah, I, it's probably best that way. I don't know, guys. You're on, on top of the screen. See you guys. Nick's just taking you both to die. Nick barely understands the game. The only way out is suicide. Yeah. All right, fun, ladies and gentlemen. Gang Beasts. What did you think? Let us know in the comments below. Then of course, for Let's Play each and every day, come back here youtube.com/KindaFunnyGames. How did you get me, Nick? There's something tragic about this game. It's really sad. Nick, I don't think you can get to. Nope. Like jumping is not precise in this. I'm not even going to engage in this. I'm just like a head. Look at this, look at this. Sorry, I'm done.",
            "start": 662.08
        }
    ]
}