{
    "id": 1082,
    "video_id": "WBHKZCCDG40",
    "show_name": "Community",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello"
    ],
    "title": "Thank You, Carlo Prospero!",
    "description": "Carlo received this video due to his support on Patreon. Sorry for screwing up your last name. To support the Kinda Funny crew go to: http://www.patreon.com/kindafunny or http://www.patreon.com/kindafunnygames \n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1438810216,
    "duration": 408,
    "transcript_chunks": [
        {
            "text": "Thank you, Carlo Prospero. Now here's the thing with Carlo, yeah, I, he was honestly our number two one to do today, but when I got to his name, I was like, \"Carlo looks like I made a typo. Maybe he's Carlos.\" Yeah, and I tried to get the signal here on the road. We're driving back from VidCon, which thank you videos, uh, and I couldn't get the signal, so I was like, \"We'll hold them.\" I had a signal there. I checked it. Carlo was correct, but I misspelled his name, his last name. I was so confident and I said, \"There you go. It's good, checked.\" Now it of course makes you wonder, did I fuck up every other name somewhere? I'm sure there's a mess up somewhere in there, but let's be perfectly honest, anyone who's watched our content for longer than 1 second is not expecting perfection. Yeah, well, Carlo, thank you so much for your support, 3 months on Patreon.com/KindaFunnyGames. Thank you for all your support. You let this happen. You let us drive the to Nick is intent on killing us. He's like, \"Oh, let me hold on.\" He's driving with his knees.",
            "start": 0.08
        },
        {
            "text": "3 months on Patreon.com/KindaFunnyGames. Thank you for all your support. You let this happen. You let us drive the to Nick is intent on killing us. He's like, \"Oh, let me hold on.\" He's driving with his knees digging through for fuck cables that I can easily do, texting his wife. I think I shot. He's booking Fandango movie tickets. Every you want to text my wife? Is that what you're trying to say? I will do. I, when I'm in, I feel like I have to be the assistant of the driver, so anything you want, you just tell me and I do it. I didn't know that. I respect that. That's why I keep offering, asking, \"Can I help you? Can I do things? Can I do?\" You're like, \"No, got, I got it.\" Huh? So many windmills. Well, that's how we get our power now. Didn't you know? We're out of water, so we went to wind as a power source. Look at that broke ass one that isn't moving. That one's stupid. You guys think the wind drop's going to start right now? Did you see the Kickstarter for the, the, it's for one of those things, but it doesn't have any turbines on it.",
            "start": 39.96
        },
        {
            "text": "ass one that isn't moving. That one's stupid. You guys think the wind drop's going to start right now? Did you see the Kickstarter for the, the, it's for one of those things, but it doesn't have any turbines on it 'cause they're apparently worried that it's killing birds, so all it does is it oscillates and creates energy. I could still kill a bird if the bird flies kind of knock. Look if the bird, dumb bird. Yeah, look at these spinning things. I'm going to fly right at them. Birds fuck fly into windows all the time. I never understand how birds, like, they're so good at dodging cars. Yeah, yeah, isn't it weird? Yeah, you, you think you actually run them over and then you see them like fly away. Fuck, get out. How did, did you see there was this thing on Reddit the other day of this, uh, uh, mama duck with all its baby ducks trying to pass the freeway and like it almost caused like all these accidents, but it got all the babies across alive. Like, damn right. So if I had seen that, part of my brain would have been like, \"I\"",
            "start": 76.64
        },
        {
            "text": "trying to pass the freeway and like it almost caused like all these accidents, but it got all the babies across alive. Like, damn right. So if I had seen that, part of my brain would have been like, \"I got to kill these things. Accelerate through them. This is stupid. This is a survival of the fittest if I've ever seen it before in my life.\" I would not recommend doing that, but that was my thing. My initial reaction was, \"Oh my God, don't hit the birds.\" And then I saw all the near fuck crashes where I was like, \"Damn, that's a hard decision I guess you got to make at some point.\" I had a friend once when we were driving right in high school, driving and a raccoon just came out and he hit the raccoon and I remember he was like, he freaked out of course. He, \"Oh my God.\" And my, my, the only, yeah, what? No, the guy, the guy who hit the raccoon. The raccoon didn't say anything. Raccoon was like, \"I really want to get home and wash these grapes.\" And then it was hit. Uh, he hits raccoon 'cause raccoons love grapes. What? I didn't know.",
            "start": 120.12
        },
        {
            "text": "who hit the raccoon. The raccoon didn't say anything. Raccoon was like, \"I really want to get home and wash these grapes.\" And then it was hit. Uh, he hits raccoon 'cause raccoons love grapes. What? I didn't know that. I, I guess that's just something I'm hung up on from when I worked at the wildlife preserve. Yeah, yeah, the raccoons there, we give them grapes and they walk 'cause they have the little hands. When did you work at a wildlife preserve? I was a volunteer. I was a volunteer in high school. Times. I guess that's really cool. I didn't know that. But they wash the grapes a little, but it's so cute 'cause it looks like to them they're washing like a watermelon. You know what I mean? Oh, like scale wise, spinning them around. So every time I see a raccoon, I imagine them think, \"Got grapes.\" That's like their thing to eat. There was, there was one time when me and Kevin were driving. We went to this, uh, like weird mountain thing that I found and like went there just to look at the view. Yeah, there was a really cool.",
            "start": 160.04
        },
        {
            "text": "eat. There was, there was one time when me and Kevin were driving. We went to this, uh, like weird mountain thing that I found and like went there just to look at the view. Yeah, there was a really cool view and I was like, \"We got to go look at it.\" It was like 1:00 a.m. You found a mountain? Yeah. And then, uh, we, we found it. Then we were driving back, one the first ones. And as we were driving back, we're on this little one-way street. Like, you know, not even one way. It was a, it was, it was a two-way street, but there was only one lane, so you have to do that whole thing where you like pull over to let the other guy go by. Do you guys know what I'm talking about? Big yes. Yeah. So if he's coming this way, you're going that way. You got to pull over and yeah, like the hill. There was no one on the road except for this one car blocking our way. And we're like, \"Why the fuck is this car blocking our way?\" And we go, we look, there's this possum that was just playing chicken with the car and he was not letting us pass.",
            "start": 199.04
        },
        {
            "text": "one car blocking our way. And we're like, \"Why the fuck is this car blocking our way?\" And we go, we look, there's this possum that was just playing chicken with the car and he was not letting us pass. He just had, he was planted down looking at the car and he was just like, arms out. Yeah, he had his little arms out looking like he was about to fuck beat the fuck out of this car. So did you get out of your car to look? You drive. We like, we had to just pull it around and like went some other ass way, but it was like a very, it was scary, man. Possums are really intense. No, you just turn off your lights and the possum will just go back and run away. I don't know about that. Not this dude. No, it was definitely night. It was night as fuck. He said it was 1:00 in the morning. Why are you guys going to make out point at 1:00 in the morning? What were you guys really doing there? It's okay. It's a safe place. When I, when I grew up, I had dogs in my and with this big backyard, my dogs there would always be a possum that was.",
            "start": 237.76
        },
        {
            "text": "at 1:00 in the morning. What were you guys really doing there? It's okay. It's a safe place. When I, when I grew up, I had dogs in my and with this big backyard, my dogs there would always be a possum that was sitting on top of, uh, the fence and so the dog couldn't get to it. And so dog would wake us up because the dog would start barking and like furiously like trying to rage at this thing and it would just be sitting there looking at it. So my mom inevitably in a pissed off state that is very indicative of my mom would come out with a broom and just push the possum off the fence. It's like a 1 ft fence. She just like hit the thing and it would pop off and I'm like, \"Mom, I think you just killed that possum.\" She's like, \"Well, that possum is totally alright. That possum would have been fine.\" I'd be more afraid of that possum grabbing the fuck broom and come right at you. I mean, they're not, are mean little bastards. You guys ever see A Goofy Movie? No, no, really? No. Yes, I've never seen it. It's upsetting. Scary ass possums in.",
            "start": 284.2
        },
        {
            "text": "grabbing the fuck broom and come right at you. I mean, they're not, are mean little bastards. You guys ever see A Goofy Movie? No, no, really? No. Yes, I've never seen it. It's upsetting. Scary ass possums in that fuck. Possums are scary. They use their tails. They're scary, man. I don't understand what they use their tails, baby. They use their tails to grab things. You can't kill the baby possum. That's terrifying. I know it like mostly killed it. I had to finish the job. Thank you, Carlo, for all your supported on Patreon.com/KindaFunnyGames. You all this stupid stuff to happen and hear weird stories from the wildlife preserve and the broom possum fight. Mrs. Scarpino versus the possum. How do they, they have a little fountain they wash him in like stream. Raccoons wash their food. They're cleanly animal. I didn't know that. Yeah, except when they eat trash. That's, yeah, you know, I was thinking about that, but yeah, but no, they wash the food in the wild. That's crazy. Really cute. I'll find you video when we get back to cell.",
            "start": 322.84
        },
        {
            "text": "Yeah, except when they eat trash. That's, yeah, you know, I was thinking about that, but yeah, but no, they wash the food in the wild. That's crazy. Really cute. I'll find you video when we get back to cell service. All right. I always thought of them as vicious animals, but no, they, you don't fuck with raccoon for sure. Yeah, I don't get near them. Yeah, you shouldn't. You guys should definitely YouTube raccoons. They're funny as fuck. We spent hours, we spent like hours one time watching raccoon videos. They're so cool. Did you get, did you get any of them washing things? I mean, I can, I know what you're talking about though. Okay, good. I've never seen that, but like I can imagine them with their stupid hands. Stupid hands. They're very cute hands. Thank you, Carlo.",
            "start": 370.08
        }
    ]
}