{
    "id": 697,
    "video_id": "8pQa3XzKm9M",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Taxes - A Conversation With Colin",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1426694400,
    "duration": 653,
    "transcript_chunks": [
        {
            "text": "some people don't look at their paychecks and have no idea like how much the government's just robbing them sure just robbing them what's up everybody Welcome to A Conversation With Colin I'm Greg and this is my roommate Colin now sometimes Colin says crazy stuff so for the final time thanks for your support on Patreon.com/KindaFunny I'm reaching into the random topic pile pulling one out tossing it at them talking it out for your amusement if you like that like the video subscribe to us on YouTube Share us with your friends support us on Patreon.com/KindaFunny. Colin, are you ready? Yes, today's topic of conversation is taxes. This was submitted by N. Namon Ramon, a GameOverGreggy show favorite, your friend, your best friend, my good friend. Uh, taxes are my favorite thing, Greg. I love taxes. Are your favorite thing? You hate taxes. Show your your Twitter handle is NoTaxation. There's a lot of lies going on. Uh, how do we unpack this one? I don't you I don't know. Ramon wrote in taxes. He didn't even put a",
            "start": 0.08
        },
        {
            "text": "thing you hate taxes show your your Twitter handle is NoTaxation. There's a lot of lies going on. Uh, how do we unpack this one? I don't you I don't know. Ramon wrote in taxes. He didn't even put a period on the card so it could be anything you want it to be. Uh, I hate taxes. I think that they're deplorable and and I always love when people like paying them. That's always my favorite thing when people like, we got to pay our taxes and you know, keep the roads paved. They got to got to pave the roads. All right, that's cool. I'd rather just keep my money and we'll figure something else out. You know, how would you figure out paving the roads? No, so I mean taxes are a fact of life and there has to be taxes but there are different kinds of taxes, sure. And I think that the income tax is wrong. Like we pay in the United States up to almost 40% depending on how much money you make in income taxes. That's insane. That's insane when you include payroll taxes of course and that's just absurd that like we don't just",
            "start": 47.52
        },
        {
            "text": "United States up to almost 40% depending on how much money you make in income taxes. That's insane. That's insane when you include payroll taxes of course and that's just absurd that like we don't just refuse to pay, you know, like like we're not paying like like think about look some people don't look at their paychecks and have no idea like how much the government's just robbing them, sure, just robbing them. And what's even funnier is that every like, all right, so you get your money. They they they rob you of whatever your 30%, your FICA and all this kind of stuff, right? And then you go to the store and they just charge you like, oh, another 9% tax on that. I'm like, all right, I already paid taxes but I guess I'm going to pay this too. And then you go home and you pay your property tax. And then you go to the Gas Pump and you pay your gas tax. You buy your cigarettes and you pay your cigarette tax. You buy your fast food, you pay the unhealthy tax. Exactly. You pay your bag tax. All these kinds of things",
            "start": 91.32
        },
        {
            "text": "to the Gas Pump and you pay your gas tax. You buy your cigarettes and you pay your cigarette tax. You buy your fast food, you pay the unhealthy tax. Exactly. You pay your bag tax. All these kinds of things like what is wrong with everyone? Why are we paying all these taxes? This is why you don't introduce taxes because once you introduce like the income tax when it was introduced was 1%. You know, once you in once you open the door to to any of tax then it just gets out of control and that's why you don't open the door to new taxes. I believe in in what they call ad valorem taxes which are which are um basically taxes on value of things. So I believe in property tax. I think that's fine. I think that makes sense especially for local and state governments. You should pay property tax because that's that's how you would pave your roads, right? And then I believe in a VAT, a Value Added Tax, a consumption tax which would be a sales tax, a national sales tax and everything you buy so but non-essentials so no",
            "start": 129.04
        },
        {
            "text": "how you would pave your roads, right? And then I believe in a VAT, a Value Added Tax, a consumption tax which would be a sales tax, a national sales tax and everything you buy so but non-essentials so no food, clothing or fuel taxes but everything else would be tax. So if you bought a car, you'd pay 15% tax on it but that seems really high until you realize that they didn't tax your income, right? So you have more money than you thought you or you had before then ex exactly. So it's you know, it's so weird to me that in in the United States we we say, well, how are we going to pay for this without taxes? And my whole my whole question is why are we paying for it at all? You know, um why is our military so big? Why are we like all over the world? Well, one day we're going to default on the loans from China and they're going to try to start some ****. That's why the military is so big, right? But we could still have a really strong military that no one would mess with and still shrink it considerably, right?",
            "start": 165.32
        },
        {
            "text": "they're going to try to start some ****. That's why the military is so big, right? But we could still have a really strong military that no one would mess with and still shrink it considerably, right? We pay over 50% of the income taxes collected go towards the military. That's an extraordinary amount of money. We we're a militarized society. He hasn't done anything about it either and that's really surprising to me. We're a militarized society and that's fine. We should have a strong military. We've had a strong military for a very long time but we don't need to be all over the world spending all sorts of money and being involved in everyone's business, sure. In fact, like as much as I want to shut down the Department of Education and the Department of Labor and all these things that I don't think exist should exist. I don't think these things should exist on who the hell is teaching the kids then? The states. Why is the federal government involved in in any of that at all? I think we all know",
            "start": 209.56
        },
        {
            "text": "exist should exist. I don't think these things should exist on who the hell is teaching the kids then? The states. Why is the federal government involved in in any of that at all? I think we all know Kansas can't do that on their own. Well, it's up to the people of Kansas to fix that, not the people of the federal government. Well, then we got to we have to deal with the idiots coming out of Kansas. Education is paid for on a local and state level. So there's a federal government Department that is just exists to oversee everything. It doesn't make any sense. Like there are just certain things but even if even if you just left everything else alone, you can still cut half of the military budget and save half a trillion dollars a year. The funnier thing is that we collect all this money from from FICA and income tax from all these state taxes, tariffs and all these things, right? Yeah, and we still can't pay our bills and everyone's like, well, we must raise taxes in order to you know, get out of the",
            "start": 242.88
        },
        {
            "text": "and income tax from all these state taxes, tariffs and all these things, right? Yeah, and we still can't pay our bills and everyone's like, well, we must raise taxes in order to you know, get out of the deficit. It's like, why why don't we just spend less? And every everything's like so weird about taxes in the United States. It's so strange to me that people are like so eager to pay taxes. That's so weird to it's because Americans want to make a better world. Americans want to make America better and the idea is that by giving the government the money, they're going to make things better. They're going to stop hunger. They're going to make people smarter. They're going to help get the people who are having a rough time to better places. Well, here's the here's the thing that's interesting about that to me and we were talking in another A Conversation With Colin about how you can't put me in a box. You can't put Colin in a box. He punches right through it. Can't be done. And I actually believe that the government",
            "start": 282.64
        },
        {
            "text": "we were talking in another A Conversation With Colin about how you can't put me in a box. You can't put Colin in a box. He punches right through it. Can't be done. And I actually believe that the government should be spending money on very specific things that maybe a lot of Republicans wouldn't agree with. One of the things that makes us American I think is our culture and our art. And I think that we should be funding things like NASA. I think we should be with a lot more money. I think we should be funding things like the Arts and Humanities or in our museums. I think we should pay artists to to paint murals and I think we should do all these kinds of things that make America America. America is not made America by the Department of Education and it's not made America by our military. It's made in America by the things that we do here in the United States that drive us forward every day whether it's commerce and art and all these kinds of things, entertainment. And so I think the government should",
            "start": 323.52
        },
        {
            "text": "by the things that we do here in the United States that drive us forward every day whether it's commerce and art and all these kinds of things, entertainment. And so I think the government should get involved in those kinds of things and and space exploration all these kinds of things like why aren't we already at Mars? Why don't we why don't we have bigger and better museums? Why don't we like the funny thing is that doesn't cost anything. You can give NASA space cost money, Greg. They get like $10 billion a year, $10 billion a year which is what the government spends in like half a day, you know? So give them a $100 billion a year and it's still irrelevant because you know, we're just writing the checks we can't cash. Who cares? Well, because at that like if you just that's the thing is that we could if we just cut the military budget in half and left everything else took that money back into everything else, we could pay down the debt or the deficit. We wouldn't have a debt. No, we would have we",
            "start": 359.84
        },
        {
            "text": "if we just cut the military budget in half and left everything else took that money back into everything else, we could pay down the debt or the deficit. We wouldn't have a debt. No, we would have we wouldn't have a deficit. We would have a debt. We would pay down the debt. We can give money to to to to more you know, to more people to do cooler things, whatever, and experiment and do science and research, get people excited about those things again which is very important and we won't have the bloat that we have right now. But because we spent all of our money on the military and on Social Security which is untenable. Yeah, it's not going to be there for you and I. No, absolutely not. That's the infuriating thing about FICA is that we pay like 15% taxes on FICA and we're not going to get any of it ever ever. It's never going to happen. There's no way that that's going to be solving. In fact, like I read things almost every few weeks where they're like, ah, it's probably not even going to be solid until like",
            "start": 399.92
        },
        {
            "text": "it's never going to happen. There's no way that that's going to be solving. In fact, like I read things almost every few weeks where they're like, ah, it's probably not even going to be solid until like maybe till 2050, you know, like okay, that's a long ways away from when I retire. Yeah, um it's just that we're willing to make unwilling to make hard decisions. I that's why I really respected like a lot of the people that ran for president that were kind of fringe candidates that were like, why don't we just cut the budget by half? Like why are we looking at it from a the point of view of if you want to pave you pave every road in United States, just cut the military budget in half. It all comes back to like just cutting what you already have, you know what I mean? Being smarter with the money you got and what are these departments even doing anyway? What does the EPA even do? You know, like like from what I know, they try to shut down the Ghostbusters. Yeah, that's about it. Yeah, absolutely. That's",
            "start": 440.2
        },
        {
            "text": "got and what are these departments even doing anyway? What does the EPA even do? You know, like like from what I know, they try to shut down the Ghostbusters. Yeah, that's about it. Yeah, absolutely. That's absolutely true. They also had a fun part on Newsroom. You should watch it. A good season this. Yeah, I haven't watched the new season in Newsroom. Good. Um so it's just like we we we don't often audit ourselves in our government. EPA is hearts in the right place. Yeah, but like what is it really doing? Yeah, yeah, and is it worth the money? And we have to kind of we have to have a huge government audit. That's what Congress should really be doing. They don't do anything is really just look around, be like, what what are we spending this money on? Like because if you find $500 million here and $100 million here and a billion dollars here and you just are very very scientific with a scalpel just cutting everything out, all of a sudden you have a ton of money and and instead of and you could even keep taxes at",
            "start": 471.8
        },
        {
            "text": "and a billion dollars here and you just are very very scientific with a scalpel just cutting everything out, all of a sudden you have a ton of money and and instead of and you could even keep taxes at the same level and explain to the American government or American people like we're going to start paying down our debt now because we we're almost a $20 trillion debt. But understand that right now the government spends one in every $5 that is spent in the United States. The government spends it and you know that they're not efficient. That's the thing is that they don't do anything right. They don't do anything right. I think FEMA showed us the thing or two. Oh, definitely. Oh, they showed us or two. Yeah, they they certainly did show. That was what was so funny about Jericho is like when FEMA was there and they were like doing things. Come on. No, they weren't with nuclear bombs. Like are you kidding me? So it's just the income tax is wrong. We pay taxes at all these different levels and by the time your",
            "start": 510.36
        },
        {
            "text": "and they were like doing things. Come on. No, they weren't with nuclear bombs. Like are you kidding me? So it's just the income tax is wrong. We pay taxes at all these different levels and by the time your dollar is spent, you're getting like less than half of what you make and that should infuriate people. When you're broke and you don't have any money for what you need, well, go blame the goddamn government, you know, because they're stealing all your money and you know, they need to take some of it but this is almost to the point of strong arming the money out of us in every way to shaking us down, you know, at every level, at every level. It doesn't stop. Yeah, and uh now that we own a business, we know that more than ever like they're like they're ringing they ring everything dry. They just they look under every crevice, every cushion of your couch like flap. They'll take anything that's not nailed down. They'll take it all. Yeah, and that's not going to spend stop them from spending money and it's not going to",
            "start": 544.0
        },
        {
            "text": "crevice, every cushion of your couch like flap. They'll take anything that's not nailed down. They'll take it all. Yeah, and that's not going to spend stop them from spending money and it's not going to stop them from spending too much money and spending more than we have. That's why you have to look at it from the other perspective which is say like what are we spending the money on and maybe we should just stop spending all that money and maybe we don't need all these bureaucratic departments and this huge military and maybe we can give our money to the things that actually do something and produce something. Government doesn't produce ****. And that's like and that is it's funny that we have such a bloated government in a market capitalist society because they don't do anything but take. That's it. Nothing depresses me like talking politics with Colin. Ramon, thank you so so much for writing in with your topic. Ladies and gentlemen, what do you think of taxes? Let us know in the comments then",
            "start": 587.12
        },
        {
            "text": "it nothing depresses me like talking politics with Colin. Ramon, thank you so so much for writing in with your topic. Ladies and gentlemen, what do you think of taxes? Let us know in the comments then make sure you share this video with your friends. Support us on Patreon.com/KindaFunny so we can pay the tax man when he comes for us. And then for the final season of A Conversation With Colin, keep coming back to KindaFunny.com",
            "start": 624.08
        }
    ]
}