{
  "id": 682,
  "video_id": "dEchlHJTHc4",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Sexiest Cartoon Characters - The GameOverGreggy Show Ep. 66 (Pt. 4)",
  "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1426143601,
  "duration": 533,
  "transcript_chunks": [
    {
      "text": "[ Music] Tim , yes, what's your topic? So long, long time ago, a little over a year ago, we, uh, we started the show and, uh, my, my first topic was, got it. Nick doesn't care. Yeah, Nick, Nick will just interrupt anyone. It doesn't matter. Sorry. Which Disney Princess we'd get nasty with. Now here's my thing. There's been a couple, you've grown up and you're going to apologize for it. You're going to apologize for this. I'm not apologizing. They've added new Disney Princesses since then, mainly Elsa, Anna, and they weren't around when we did this . No, when you did this. Yeah, we did it. We all partook. Thing, I'm not going to lie. No, no, no, they, they added a new Latina princess, Elena. What is she been in ? I don't know. She's not a thing yet. Okay, they announced her, they showed pictures. I'm glad. Now I will say of those added to the list, they can all get it. My question for you guys, besides Disney, which other cartoon characters would you get nasty? Uh, pro, anal, Jess Rabbit. I always had a huge thing for Jean Grey in the X-Men. See, oh yeah, I",
      "start": 2.85
    },
    {
      "text": "they can all get it. My question for you guys, besides Disney, which other cartoon characters would you get nasty? Uh, pro, anal, Jess Rabbit. I always had a huge thing for Jean Grey in the X-Men. See, oh yeah. I mean, Super, yeah, we can talk about the animated lady. Jesus Christ to me. I'll pass. Lady J would be my answer. Who's Lady J? Oh, she's one of the GI Joe. Yeah, now we're, I hate when you say get nasty. Are we going to have a nice relationship? You can get as nasty as you, no, this is specifically about getting, are we going on a date? Did, do you want, we're just making love is, I mean, that's it's your definition of nasty, man. If Love's nasty, if you're, if going on a date for any, any, any female cartoon character, any cartoon character, doesn't need to be female. That's a good point, really good point. That's a good point. Is there one that's not necessarily a female? Snarf. Snarf could get it. Snarf is that from Too Many Cooks? No, no, Snarf is from ThunderCats. Yeah, yeah, they have, they have a, they have a Thunder, Thunder",
      "start": 60.72
    },
    {
      "text": "is there one that's not necessarily a female? Snarf. Snarf could get it. Snarf is that from Too Many Cooks? No, no, Snarf is from ThunderCats. Yeah, yeah, they have, they have a, they have a Thunder, Thunder, Thunder, Thunder Cats. You missed the Thunder. I think I, I think I, you added the Thunder. Remember that blonde girl from Cool World? Yeah, yeah, I like totally got a boner back in the day. I remember like one of my first, you're like, what is this? What is happening? Yeah, I was like, I remember cool. Do you remember your first boners and you were just like, what is happening? Yeah, I was really weird. I used to think that always been part of getting the boner is what stopped you from having sex. I remember like watching shows, what the **** is wrong with you, Greg? Thing we have to look into when we go to Chicago. Got talk to his first sexual looking like belly button. Whose belly button is this going to go inside of? Whose belly button am I going to have to put this in? You were just put it in my own. You can put it",
      "start": 105.48
    },
    {
      "text": "talk to his first sexual looking like belly button. Whose belly button is this going to go inside of? Whose belly button am I going to have to put this in? You were just put it in my own. You can put it in mine later. Oh, has speaking, how's the belly button doing? How's our sweat level of the Bell? Oh, he's so moist. Oh, wow, that's looking good. Like getting Jewish, Jewish curls on the belly. Beautiful curl. Can you say Jewish on this? Yeah, okay. Well, I don't think that's a curse word. Yeah, I mean, it's live. You already said it , so too. U, so you, that's an interesting, what are you going, are you going outside of the Disney Princess? Yeah, I made a list earlier. Give us a list. I want, by the way, I want Ariel, mermaid Ariel, not, I want to be a mermaid and **** Ariel. I don't want a human Ariel to ****. I want to **** her mermaid ****. But are you okay with being human and she's mermaid? Yeah, okay, cool. Sex or yeah, that's good. I mean, obviously, I'm down. They all know I'm down for that. Us, that's good. Do you know",
      "start": 150.4
    },
    {
      "text": "her mermaid ****. But are you okay with being human and she's mermaid? Yeah, okay, cool. Sex or yeah, that's good. I mean, obviously, I'm down. They all know I'm down for that. Us, that's good. Do you know that you know how the mermaid myth came about, Colin? You probably know this. No, I don't. Maybe I know myth. Nick, are they real? Yeah, man, manatees. Yeah, women used to look horrible and so you saw man, yeah, Sailors would sail for so long and they'd see these giant things that looked like humans swimming, but they were big, the these big beasts and they didn't understand what they were because at the time no one knew what manity was. So manity seal also man do not look like a human things like that . No, but in the water on the distance CU you you don't know the depth perception of how far off they are. You think they're way, you know, oh, I never knew that. That's that's how the mermaid interesting. Very that in 20,000 Leagues Under the Sea, which is taking me a year, but I'm almost through it. I like that reading",
      "start": 199.68
    },
    {
      "text": "they're way, you know, oh, I never knew that. That's that's how the mermaid interesting. Very that in 20,000 Leagues Under the Sea , which is taking me a year, but I'm almost through it. I like that reading it. Damn that we've been in here streaming for five and a half hours and the Patreon people had to be in here for two minutes to be like, get him a fan. We didn't realize we were running a podcast sweat shop underneath the stairs. Literally, it it is getting a little ripe in here, which is great because we only have Jova Chen today. Jova Chen. Yeah, he's Indie too. He understands the struggle. Struggle's real. How you Tim, do we go throughout your whole give it to me. So I want to give a shout out to Poison Ivy from the Batman animated. Oh, sure. Yeah, Harley Quinn. She had a go Harley Quinn too, but I feel like Poison Ivy specifically Harley Quinn, you wouldn't want to like have a relationship with. That's a one night. You don't put your dick in crazy. No, you no you don't do nothing with her. No, do not put your",
      "start": 240.92
    },
    {
      "text": "Poison Ivy specifically Harley Quinn, you wouldn't want to like have a relationship with. That's a one night. You don't put your dick in crazy . No, you no you don't do nothing with her. No, do not put your dick in crazy. Put your dick in crazy. Definitely that on a t-shirt or do you have I don't think that's my quote. I don't know who said that. I think it was Thomas. Well, it would be funny. It would be funnier to quote. Yeah, Thomas Jefferson. Yeah, oh, that's great. That's great. In like a like a in like calligraphy. So we got Jubilee. Uh, Jubilee, she's like 16 years old, bro. No, but here's the thing, I want to be 16 too. Yeah, he was at the time. Yeah, but J sucked, man. And plus she, yeah, but like there's something cool about Sher knock boots with Tim Drake. She's Robin. Stay away. All right, he can have her. Um, then we got Lois Griffin. Yeah, I feel like I'learn Griffin hot all on that cuz she gets like every other episode she'll be like in a dominatrix costume. I kind of like I I got I got to pull up the Marge Simpson",
      "start": 283.12
    },
    {
      "text": "Lois Griffin. Yeah, I feel like I'learn Griffin hot all on that cuz she gets like every other episode she'll be like in a dominatrix costume. I kind of like I I got I got to pull up the Marge Simpson one. You ever see those sexy Marge picks? Yeah, I think Marge cuz like Lois like easy that's the easy one. Yeah, Mar yeah, see I don't want to work for Marge though. Mar annoying. That's true. That's going to take forever. You're going have to put so much time in when the last time you snuggled up inside a blue V. I guess you're right. I haven't never never no one I want to though. What about a fry guy from McDonald's ever ever since I uh ever since I played the Mass Effect series I always wanted to have sex with any of the blue aliens. Oh yeah, like oh oh the Asari, the Asari so tight. I also want to put Josie and the Pussycats and Gem and the Holograms. I've never seen Gem and the Holograms but now I have to pay attention because Audrey peoples from Nashville is is starring in the movie and this movie",
      "start": 326.08
    },
    {
      "text": "Josie and the Pussyc ats and Gem and the Holograms. I've never seen Gem and the Holograms but now I have to pay attention because Audrey peoples from Nashville is is starring in the movie and this movie looks terrible. I have imagine the cartoon was bad too. Well, I've never seen the cartoon but it I did on the Transformers movie, the 1986 version, there was uh trailers before my VHS and one of them was Gem and like that trailer looked awesome. I saw that 302 thing like a thousand times. Nice. So I'm all about Gem Holograms. Is that your list? That's the list. It's a good list to throw a shout out Lady J and flux. Flux is flux pronounce it never really really I don't know. I thought I that's based on care she can get it though right get a get in a long-term relationship you say tomato I say **** yeah right oh we're on the front page of Twitch man ladies and gentlemen that's another episode of The GameOverGreggy Show thank you Harley for coming by thank you all for putting up with us thank you of",
      "start": 371.28
    },
    {
      "text": "oh we're on the front page of Twitch man ladies and gentlemen that's another episode of The GameOverGreggy Show thank you Harley for coming by thank you all for putting up with us thank you of course for watching the stream if you're watching it sorry I know it's shorter than our normal giant episodes ladies and gentlemen but we have to get Jova Chen here talk about the Video Game World so thank you all for your support remember each and every week four sometimes five best friends gather on this table bring a random topic of discussion for your amusement if you like that check out patreon.com/kindafunny where you can get the episodes early on Fridays or go to youtube.com/kindafunny where you can get it episode by episode day by day topic by topic until we post the entire thing on Friday as an MP3 and of course a video everybody go to twitch.tv/harleyplays subscribe to him yeah he's serious about that he's super serious about it sometimes he streams and gets kicked out of hotels",
      "start": 421.56
    },
    {
      "text": "as an MP3 and of course a video everybody go to twitch.tv/harleyplays subscribe to him yeah he's serious about that he's super serious about it sometimes he streams and gets kicked out of hotels almost yeah you want to be there you want to get that notification when I um accidentally streaming with my penis out there you go that's going to come one day guaranteed I'm subscribing one day man until next time it's been our pleasure to serve you and that's where we cut the official [Music] video kick it you wake up in the morning and you don't want to go oh man you mixed to they yell me a lot about it conf but I just got to be me I got to do me I can't worry about other thing never worry about other people never make it on the internet that way Kevin check mik check mik check you sound perfect Nicholas oh we just done all this live it's awesome cut this is how we roll 6500 people watching this is the raw **** this is where they're like oh my God they're humans too",
      "start": 462.2
    }
  ]
}
