{
  "id": 707,
  "video_id": "Dh8VdAYFhQY",
  "show_name": "Reactions",
  "hosts": ["Greg Miller", "Colin Moriarty"],
  "title": "20th Anniversary PlayStation 4 - Kinda Funny Unboxings",
  "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1426867201,
  "duration": 400,
  "transcript_chunks": [
    {
      "text": "What's up, everybody? Welcome to another Kinda Funny unboxing. I'm Greg Miller and this is the pride of Long Island, Colin Moriarity. Thank you , Greg. Nope, nope, nope, nope, nope. Colin, yes, you and I are known on the internet for our PlayStation love. It's what we're known for, covering Beyond, so on and so forth. Uh, when we left to start Kinda Funny, everybody freaked out, are you still going to get access? Are they going to still send you stuff? I'd say they're still going to send us stuff right here, Colin. This is one of the 20th anniversary PlayStation 4 s. Uh, we did an unboxing a long time ago. Tim and I, you weren't here for it. This is your first time doing only 12,000 of these ever made. 12 ,300, right? Is that what it was? Yeah, and I remember cuz I remember cuz when Tim and I did our initial unboxing, we had no idea why that number, like why did they pick such a dumb number? And then of course, it's because it was released on 123 in the comments like, you suck, you stupid. I was like, well, I got, I'm sitting",
      "start": 0.44
    },
    {
      "text": "had no idea why that number, like why did they pick such a dumb number? And then of course, it's because it was released on 123 in the comments like, you suck, you stupid. I was like, well, I got, I'm sitting with one, so whatever. Now this is ours though, for the unit of the house. Uh, Colin, I'm very excited. Now do you want to want to rip this off? No, not at all. No, I want this is pull, get it going. Look at that, six sleeves, very nice. You can make a little bed for Portillo, right? We can ship them anywhere, ship them to Abu Dhabi. Um, we're excited about this for a number of reasons. First off, it's an awesome unit, it's awesome presentation, it's an awesome piece of history really though, you know what I mean? I like companies and you and I like the fact that PlayStation as a brand celebrates PlayStation as a brand and it's fans really, that's what it's about, right? Of course, these units were released during PlayStation Experience, not enough of them. Everyone at PlayStation Experience freaked out cuz",
      "start": 39.24
    },
    {
      "text": "as a brand and it's fans really, that's what it's about, right? Of course, these units were released during PlayStation Experience, not enough of them. Everyone at PlayStation Experience freaked out cuz they couldn't get them. And now what, how much were they sold for at the very beginning? It doesn't matter how much they were sold for the very beginning because now they're on eBay for like a gajillion dollars because that's how it works. We're going to crack our open RS here. What number you think we got two? Uh, 9,872. I'm going to say 11,545. Okay, we got 8,266. All right, whatever, I'll allow it. Cool, take her out, Greg. I'm trying to, I don't want to hurt her. Oh, what a beautiful, what a be like, I love like, it's one of those things where I'm not one to Reby a unit I already have, you know what I mean? If I have a console, a handheld, whatever, and it's working well, I'm never a big fan of buying a new one just to buy a new one, but it's so sexy. The it's got, you know, the it's got the sacred symbols they call",
      "start": 77.8
    },
    {
      "text": "have a console, a handheld, whatever, and it's working well, I'm never a big fan of buying a new one just to buy a new one, but it's so sexy. The it's got, you know, the it's got the sacred symbols they call them, you know, triangles, X, Circle, squares. Yeah, smell it. It smells like spray paint. I like it. It does straight up smells like a can of spray paint. So good. It's like gasoline. It's like, you know, you shouldn't be smelling it, but you want you want to first things first, I'm going to I'm going to first things first, Chocolate Starfish is your man, FR Access Hollywood, license to kill a redneck from Jacksonville. You trying to take that little plastic off? I think it come off this way. Here, is that easier? There you go. You get it. I got, I got her, I got her to nice and tight. There we go. I want it to look super sexy. There it is, the shine, the sheen, of course, the original. Thank you. Put it right on me, graft it to my skin so PlayStation will always be a part of me. Um, it's of course, the color system",
      "start": 125.64
    },
    {
      "text": "look super sexy. There it is, the shine, the sheen, of course, the original. Thank you. Put it right on me, graft it to my skin so PlayStation will always be a part of me. Um, it's of course, the color system of of the original PlayStation. Yep, it's awesome. They got the rainbow PlayStation logo. Everybody missed it. Brings back some cool memories. Yeah, and as you can see, as we already pointed out at the bottom, you have your little, you know, one, you know, unique number, uh, out of 12,300. Back looks pretty much the same. What's cool, yeah, is the the texture of it, really neat. Um, it has, you know, the symbols on it as you were saying, it's really, really a pretty impressive looking system, but I'm the same as you, like this is one of those rare ones that really caught my eye. Usually I don't care about that if the system, if the whole site hadn't been crashing during PlayStation Experience, I would have gladly bought and thank God it smells like it smells awesome, smells like spray paint. Yeah, you're going to sleep next",
      "start": 164.92
    },
    {
      "text": "if the whole site hadn't been crashing during PlayStation Experience, I would have gladly bought and thank God it smells like it smells awesome, smells like spray paint. Yeah, you're going to sleep next to that one the night. Yeah, I'm going to cuddle up to it. The next the next big thing about it, right, is a Dual Shock 4 that looks like a PlayStation and it has the color PlayStation exactly. It's got the whole whole color there. I'm going cop this. No, you're not. I'm going cop this. Don't do this to me, please. We were friends once. And then of course, the uh, the camera, which is awesome too, also matches. Yeah, really nice touch with this one exactly. You know what I mean? Waiting . I it's the the camera of course has a long history now with PlayStation of being super weird. The fact that they didn't make enough at the launch of PlayStation 4 cuz they didn't think it was going to be a big deal. Shu Yoshida valiantly trying to tell them streaming Twitch it would be a big deal. You got to understand, make more",
      "start": 205.44
    },
    {
      "text": "at the launch of PlayStation 4 cuz they didn't think it was going to be a big deal. Shu Yoshida valiantly trying to tell them streaming Twitch it would be a big deal. You got to understand, make more cameras didn't happen in time. They were hard to come by for a while. Now you got this one that I can't unwrap, but they're packing it in that it's got the PlayStation look on the side too, right? Well, yeah, this theor the whole thing is to make it look amazing, make it look like a special edition you'd want to have when I think it worked. Oh, as you can see by the success of everybody else got a bunch of manuals over here. Nobody ever reads that crap. Quick quick start guide. You plug it in, you jump through a few firmware updates, you recover your PlayStation Network, maybe you make a new one. You're not 100% P, maybe the PSN's up, maybe it's not, maybe it's not, maybe it's who knows what's happening. It's a little bit of, you know, you're going to roll the dice. Yeah, as long as it's not a major holiday, you're",
      "start": 241.52
    },
    {
      "text": "P, maybe the PSN's up, maybe it's not, maybe it's not, maybe it's who knows what's happening. It's a little bit of, you know, you're going to roll the dice. Yeah, as long as it's not a major holiday, you're usually fine jumping in here. AC, you got the stand. You use the stand, don't you? Yeah, I do. Never never never never seen the point. I like mine floating around there being on N out . How's this audio? Is it good, Tim? Should I keep giving out important information about the PlayStation? No. Okay, so yeah, the uh, I like this. I personally enjoy the stand. Um, I don't know how you couldn't look at it. It's beautiful. This is how I this is how my PS4 in my bedroom is. I got my cable box on one side, my slim PS3 on the other side and this bad boy stands right in the middle, Greg, but not the gray one. No, never the gray one. You never bet the fat man, no matter how sure you are. Um, what's exciting as we move forward on our new Venture here is Kinda Funny is that I feel like now that we have this one, we can have a communal",
      "start": 276.28
    },
    {
      "text": "never bet the fat man, no matter how sure you are. Um, what's exciting as we move forward on our new Venture here is Kinda Funny is that I feel like now that we have this one, we can have a communal PS4 in the living room. I've been pushing at this for a while. I don't like having to yank my power supply out, put it back in, yank it out, put it back out. I feel like that's going to push it too far. So we have a communal out there where we can all load our PSN profiles, play our games and then we have our own personal ones wherever or maybe the communal ones in here where we do some Let's Plays or whatever. I think we're sitting pretty and I'm happy to have the PlayStation 4 anniversary unit in the mix as being a real console for us. I think what's going to maybe what will happen is I'll just take this one and we'll use my launch PS4, uh, as the commun one. I don't think that's going to happen. We'll see. I'll paint the other one gray. It'll be great. Oh, okay, perfect, like spray paint too, ladies and gentlemen.",
      "start": 318.16
    },
    {
      "text": "one and we'll use my launch PS4, uh, as the commun one. I don't think that's going to happen. We'll see. I'll paint the other one gray. It'll be great. Oh, okay, perfect, like spray paint too, ladies and gentlemen. That's the 20th anniversary PlayStation 4. What do you think about it? How much would you pay for it? Did you get one? Let us know in the comments below. Then make sure you keep coming back to Kinda Funny for all your video game needs and rants from Colin about mayonnaise. You like mayonnaise a lot, don't like mustard. I don't think I'm going to bring you can I ever bring you around to mustard? You think no, never open mind my ass. You want to do like a goofy thing where we both come out from behind it? Yeah, all right, ready.",
      "start": 356.04
    }
  ]
}
