{
  "id": 700,
  "video_id": "GD-lyYIuyQk",
  "show_name": "Gameplay",
  "hosts": ["Greg Miller", "Colin Moriarty", "Portillo"],
  "title": "Let's Play Monopoly - Throwback Thursdays",
  "description": "Colin and Greg play Monopoly for the NES\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1426791601,
  "duration": 1230,
  "transcript_chunks": [
    {
      "text": "Greetings and salutations, welcome back to Kinda Funny Games. We're here to show you, well, it's a weird one, Greg, but we've talked about this in in Kinda Funny and GameOverGreggy Show. War, yeah, you and I are big mon, this particular version of Monopoly, yeah, holds a very special place with me. Why is that? I was such a nerdy, I had this game on NES and I was such a nerdy kid. Well, I'm such a nerdy adult, I guess that I would keep statistics of Monopoly games and have the computer play each other and then keep like meticulous stats, see who won and like have these fake Monopoly Seasons basically. Aw, um, and so it was this particular Parker Brothers version of the game, which I think we see, yeah, Sculptured Software did this one and uh it brings me back. So yeah, we'll select two players. Uh, player one is this human or computer? He is human. Okay, enter name. Uh, let's see, his name will be and I remember my name, I remember my, I used to play as the horse and my name was AKA horse, that was my name. Oh, that's good.",
      "start": 0.12
    },
    {
      "text": "Human or computer? He is human. Okay, enter name. Uh, let's see, his name will be and I remember my name, I remember my, I used to play as the horse and my name was AKA horse, that was my name. Oh, that's good. That's good. Does it fit? Yeah, yeah, I see what you did there. Uh, and I will be, now this is pre- Booat, I think, which is surprising. I'm going to be the shoe and then Greg, I think that I, can you control it? I don't know. So let's see if we can human. Okay, now St, if you can control it. Yeah, cool. Um, yeah, so I played a lot of, well, you and I both grew up loving Monopoly. Mhm. I played video versions. I don't, I'm trying to remember what my first video game version version Monopoly was, maybe Game Boy. Something. It was one of the portable ones. I believe Game Gear, maybe. Maybe it was Game Gear. Maybe it was my Game Gear. I did love my Game Gear to press A to play without time lims or B to play a short game. Let's play, let's play the full game. Okay, press A to start game or B to is the game editor. God, I forgot about",
      "start": 42.88
    },
    {
      "text": "Gear. I did love my Game Gear to press A to play without time lims or B to play a short game. Let's play, let's play the full game. Okay, press A to start game or B to is the game editor. God, I forgot about all this. You want chance go first? Uh, Colin, you and I of course had a best of seven Monopoly series on Black Friday. Yep, had a great time with it. You won , congratulations, but I gave you a run for your money there in the end. Uh, one of our Patreon for Kinda Funny Games is to do that again. Look for that soon. But then again, this is just a nice way to jump in. I'm rolling. Well, what's beautiful about this game is how easy it is to skip all the ****, just hit, yeah, that was one of the problems with the new one, hit bu, hit again and just skip it over. I mean, like the game, the game moves fast. Yeah, look at this, we got to battle the railroads. I got hit, I got dinged with that income tax early on. You can tell that this is an old version of of um Monopoly cuz I think they got rid of the 10% or $200 now is",
      "start": 97.04
    },
    {
      "text": "this, we got to battle the railroads. I got hit, I got dinged with that income tax early on. You can tell that this is an old version of of um Monopoly cuz I think they got rid of the 10% or $200 now is $200 regardless cuz it's hard to do percents. Yeah, we're stupid Americans. God damn it, free parking. These don't help me. This is just what was happening before I was getting the bad roles. Good, finally. Damn, you're kind of celebrating. Got **** Monopoly **** me. He's **** in your mouth again. That's a reference everybody to me. I love Monopoly. God damn it. Uh, damn, now Mr. Monopoly can **** us both. No, Mr. Monopoly [Music] no, we got to get another, this one doesn't do well. Whoa, what is it not, is it broken? That's why I switched over when I was, I did my Ghost buster let's play to that one because it's like a button wonky. I already own it. Don't Rec in back now. The hell did he say? I have no idea why gra and then he just fly out of jail like damn, the **** just happened. That was a crazy **** Mr.",
      "start": 136.08
    },
    {
      "text": "like a button wonky. I already own it. Don't Rec in back now. The hell did he say? I have no idea why gra and then he just fly out of jail like damn, the **** just happened. That was a crazy **** Mr. Monopoly. Mr. Monopoly, why you doing this to me? Damn, that's **** up doubles, man. All the all the rails are off the board. Yeah, yeah, nice. I like how 20s rain down from this guy when you pass go, like who the hell thinks, who identifies that with 20s? Pass go, collect what the **** 10 20s? What I always say. Oh, you're buying the greens. Got it. Got to buy something here. You know how roll auction it. What do I do? What do I do? Got you. You can have that garbage. We get look, get the auctioneer. He just, that's not how you auction. You don't constantly pound the gavel. They don't make them like this. So it's funny, the I just made the connection that the same studio that made this game uh made uh Super Star Wars, Super Empire and Super Jedi. I think it's the same voice actor from Blades of [Music] Steel riting",
      "start": 197.88
    },
    {
      "text": "the I just made the connection that the same studio that made this game uh made uh Super Star Wars, Super Empire and Super Jedi. I think it's the same voice actor from Blades of [Music] Steel riting people are watching us play Monopoly here it is sure seem wony right wow what's wrong with it I don't know it doesn't want me to bid anymore on board War you have it 300 that's a steal I know yeah music like intense huh kind of kind of sexist that all the people in the crowd were men saying women can't buy property it's a different time 1990 God damn it don't give a **** just let him take everything illness Avenue that what it said is yeah it can't fito on the tile [Music] I like how high the SES get higher and higher there's got be an end to it it's just like it's like only Pell can hear [Music] it so you said something sex still Greg because what what do you why do you assume that they're all all those hats he's all we they're all wearing sto top hats I know but you don't think a woman",
      "start": 293.44
    },
    {
      "text": "it so you said something sex still Greg because what what do you why do you assume that they're all all those hats he's all we they're all wearing sto top hats I know but you don't think a woman ever wore a sto stove top not when they were bidding on auction things no no no no no fair enough surprised they didn't teach you that in American history there's some things we just didn't have time to learn so all right everybody when you go to an auction bidding I want you to know women never ever coming back now what is he say the ghost of the jail **** just boots you out oh ke finally the ghost of the jail I'm one away from a monopoly in a few spots here mops mops oh sorry damn it damn it damn Pell you're just visiting you're just polite n Go rot in jail you piece of **** why is Monopoly so good I don't know it's a good [Music] question this auction is just out of control that guy that auctioner is just out of his mind he loves it he's he's an unsung hero Monopoly know we never",
      "start": 403.52
    },
    {
      "text": "so good I don't know it's a good [Music] question this auction is just out of control that guy that auctioneer is just out of his mind he loves it he's he's an unsung hero Monopoly know we never seen the Auer before like that some Auctioneer lore that's what we need they cut him out nice need that **** yeah I'm sorry I don't know what you want from me you've been making it around nice Jesus that's what's up that's what's good finally all right some good good luck for nice Monopoly monop damn damn you're some sort of common criminal Greg you're some sort of piece of **** common criminal and they won't even let you into the nice part of the board because like no no no no no what do you think I'm doing what am I getting caught I don't know it's Prof exposure they're profiling my race car incent you're right they won't even let me into the ritzy part of town bunch of jerks Pella I don't need this **** what that's the one thing I guys just not have the money what's wrong you should",
      "start": 480.08
    },
    {
      "text": "incent you're right they won't even let me into the ritzy part of town bunch of jerks Pella I don't need this **** what that's the one thing I guys just not have the money what's wrong you should anyways um I wish I had a better overview my board when I came into this you know what I mean how much is this proper bding on what what else do I have what do you have d NES has limitations I don't believe that for a second look at the animation on this Auctioneer he really is his hands moving along the I don't know what the hell he doing just talking to the crowd sir is there something you're not even the auctioneer please sit back down [Music] sir you're out I didn't know if I can morgage yeah it's not complicated enough to let you play with the real the real rules I guess I like yeah I love the arrow just bugs out now oh yeah there we go what'you do select yeah Status this is actually a pretty impressive layout for an NES game of monopo definitely I don't have $600 now they try to now",
      "start": 562.76
    },
    {
      "text": "the arrow just bugs out now oh yeah there we go what'you do select yeah Status this is actually a pretty impressive layout for an NES game of monopo definitely I don't have $600 now they try to now you know they go through and they try to make it too fancy this is what you're talking about with the that Monopoly that came to PS4 there were so many animations you couldn't skip them you couldn't do this allbody wants to do is be able to play the game Monopoly wherever they are yeah yeah yeah get that CH all they want to do is play Monopoly whoever they are yeah sir what do you say you act you you said it like you made a point you didn't make a point at all don't beend back now don't be coming back now is that what it is I think so don't be coming back that's literally 25% of the space taken on the trip yes hook me up with some of that I'm going to have to start mortgaging see is how I can't make it around the **** board I need you to start making it around the board what I need did",
      "start": 619.56
    },
    {
      "text": "on the trip yes hook me up with some of that I'm going to have to start mortgaging see is how I can't make it around the **** board I need you to start making it around the board what I need did you put yeah you didn't put any houses down right **** not yet okay I will oh hey I didn't I didn't do that that's great damn $50 sent your sent them back to jail this son of a **** okay you raise money from the menu oh okay I just really jammed down on that bad boy you must have a bad connection in your NES controller take that part just all told I kind of feel like this particular um interface is actually pretty sophisticated for an NES game yeah yeah it's cute little C oh yeah he's there it's another character you don't hear anything about in the Monopoly screw you well I think we all know Jail's really what getting us here it's like your mom I forgot about this anation that's hot so I wasn't paying 100% attention there did it ask you where you wanted to put like the first house or",
      "start": 680.84
    },
    {
      "text": "Jail's really what getting us here it's like your mom I forgot about this anation that's hot so I wasn't paying 100% attention there did it ask you where you wanted to put like the first house or whatever or is it just drop them it asks you if you it's the house you it's the place you start on that will got the you have to build evenly of course yeah yeah of course oh Jesus Christ man this you needed that yes I'm still screwed oh Jesus been in jail for 90% of the game come on hook me up here yes three hundo right into my mouth cash register fine that was good for you you don't have to wor now now you just Mo the clock I married somebody Colin good for you proud of you I did what I can I got my card I got my get out of jail free card but I don't really know if I want to use it I got $33 it's barely enough money to put in then your shitty little car it's like Ghostbusters got to pay for the gas don't come back now you're here so this is how I would spend my childhood nights in",
      "start": 751.36
    },
    {
      "text": "$33 it's barely enough money to put in then your shitty little car it's like Ghostbusters got to pay for the gas don't come back now you're here so this is how I would spend my childhood nights in my room with a binder wallpaper and just I like that you just watch keeping meticulous could you make the computer skip through stuff faster or did you have to watch them do I think you could make them skip you because that's what would break me is having to watch like the computer do it okay coming back around again yeah it looks like penis Avenue but it says depends Jesus screwed you getting that **** for 254 bucks It's All Coming Back to Me Now the the ways in which you play sold sculptured software but not on any ass that's special little windfall you got there you're just going to make me watch the entire thing I was reading it I'm still I'm still I didn't grow up with this version NES I still got to read some of the menus here right all right hold out that's way too many so so four",
      "start": 823.16
    },
    {
      "text": "watch the entire thing I was reading it I'm still I'm still I didn't grow up with this version NES I still got to read some of the menus here right all right hold out that's way too many so so four should be the number I need you reset the tie right I just wanted to see what it would say nobody cares I don't I don't think anyone cares I think you won I'm certain that no one cares you've won this game of Monopoly sir we'll see I don't we don't have to play the completion no we are we're playing this all the way through damn I want to put you away okay all out damn now I never thought about the hotels having green windows in steps this is just the this is their Vision Mr Monopoly just lets him do the do the thing Mr Monopoly doesn't care what's going on as once he gets his his cut his cut H why was that a hotel Jes what you just made money yeah I know 20 bucks is not going to help me out you never know but you got to start somewhere it's true I that one slowly making your way around the",
      "start": 896.12
    },
    {
      "text": "why was that a hotel Jes what you just made money yeah I know 20 bucks is not going to help me out you never know but you got to start somewhere it's true I that one slowly making your way around the board very slowly very deliber I'm probably just going back to jail anyway no I don't want go I don't either I'm ready to go down to blaze of glory a BL Glory I am the poor you get you'll get it back at the end of the year taxing myself here **** government Pops in look at the government eating there too government's like I don't a **** about you just like real life yeah OB damn she say stop having babies Mr Monopoly has not been able to get an erection in 15 years he's not having any 1990 he wasn't able to get that's the craziest part mortgaged here we go oh you own it I'm I'm looking to be put down here you're precariously close to my my territory **** now I'm hurting here ah damn it you knew I was going to pass that in problem well you made 14 bucks so I'll take it nice you love",
      "start": 969.56
    },
    {
      "text": "be put down here you're precariously close to my my territory **** now I'm hurting here ah damn it you knew I was going to pass that in problem well you made 14 bucks so I'll take it nice you love the Opera I I'm a huge Opera fan a lot of people don't know that about me deflator Mouse I believe your favorite I'll tell you this I'm less invested in it without the pieces in front of me you know what I mean and granted we're planning a speedrun we're making jokes at each other's expenses we're looking at Nick Scarpino being all sexy over there you're buying it you're in I gotta buy something I respect that I respect that very much thank you what youg yeah nope there I like how Mr monop when I when I'm confused he looks really confused he's like I don't know what you want what do you want to do there are all these options here we come nice you're sticking in huh you're playing it down the Bitter End yeah you you're the one who won't let doesn't want it to end early I won't let it end",
      "start": 1047.6
    },
    {
      "text": "to do there are all these options here we come nice you're sticking in huh you're playing it down the Bitter End yeah you you're the one who won't let doesn't want it to end early I won't let it end early or will it what I don't know what I'm saying yeah **** out what I oh God Mr Monopoly oh look that's awesome just like real life hey look at you you're really happy congratulations well played as always it was a good game that's a that bring back some good memories for I'm glad I'm glad Greg yeah that was Sculptured Software's 1990 edition of Monopoly on Nintendo Entertainment System nice one of the great games of all time I think Westwood Hollywood Westwood's uh old PC Monopoly was a little bit better play had online play remember that very well uh so we hope that you enjoyed that I almost threw my cap across the room there no we do it's very ecstatic about the $5,895 I roast in in this particular Monopoly game but we hope you enjoyed that remember you can actually go on",
      "start": 1122.56
    },
    {
      "text": "that I almost threw my cap across the room there no we do it's very ecstatic about the $5,895 I roast in in this particular Monopoly game but we hope you enjoyed that remember you can actually go on youtube.com/ kindafunny going into the archives and uh we played a monopoly um in a tournament a real game of Monopoly it was it was best of seven I won four to2 but you can see no I thought it was yeah I W I won the first three and then you won two oh really yeah okay yeah so it's okay it's all right GRE uh but uh you can go check that out however it lasted not as long as everyone thought it was going to last which was funny but that was well they didn't know how to they didn't know how to play Monopoly with auctions and moving and doing these different things no free parking none of that garbage and we'll be back uh for more real life Monopoly at some point soon uh so youtube.com/ kindafunny and right here youtube. com/ kindafunny games we appreciate you joining us until next time see you later",
      "start": 1179.08
    }
  ]
}
