{
    "id": 663,
    "video_id": "GXgJbS7w8FQ",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Let's Play Superman SNES - Throwback Thursdays",
    "description": "Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1425598408,
    "duration": 807,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, welcome back to Kinda Funny Games. My name is Colin Moriarty, this is the illustrious Greg Miller. Greg, we're here to play a special game, well, a game that was special to you, a game that I didn't play when I had a seminal game for Greg Miller: The Death and Return of Superman. Now we're playing on SNES, which is blasphemy, of course. I was a Sega kid. I was going to say a lot, just like many, many a game like this, and right here in the b-roll you get to see Conner Superboy, his first ever video game appearance. You wonder why I love this game, come on. I, I was just going to say, Greg, real quick before you got overly excited about that, was that like many games today and back in the day, a lot of games cross over between Genesis and Super Nintendo, especially games like this. So, uh, what I'm most interested with, with this particular port, because SNES did have better ports usually, yeah, uh, was, and that of course that's totally subjective, that's just me being a, with you though, I think I",
            "start": 0.44
        },
        {
            "text": "I'm most interested with, with this particular port, because SNES did have better ports usually, yeah, uh, was, and that of course that's totally subjective, that's just me being a, with you though, I think I, I think that's the true. But I'm curious what you think about this particular game we're playing on our, what are we playing on our Retron? Or yeah, this is Retron. Retron, I can't see the from Game Zone, there it is, Retron.com. Thank you, Brandon, thank you very much. Retron 5. So yeah, we, we're starting it up here. I'm excited about this, this machine here. This machine can play all the classic. I got to get my game back from New York. So see, come in here, get the Metropolis setting. It is Metropolis, present day, a peaceful summer evening when suddenly those periods are totally unnecessary after the, uh, Metropolis and present day. Metropolis, present day, a complete power failure. Now you'd think this is the work of Doomsday, right? It's not. They're being so, I would, I wouldn't make any assumptions. They're being so true to",
            "start": 36.2
        },
        {
            "text": "day. Metropolis, present day, a complete power failure. Now you'd think this is the work of Doomsday, right? It's not. They're being so, I would, I wouldn't make any assumptions. They're being so true to Canada that they introduce the Underworlders here. These like stupid, like you want to talk about why Superman comics were in the ****? People like the Underworlders were one of them. Lois Lane was investigating. They looked like, they looked like actual super villains though, like unlike a lot of the super villains I've seen in Superman, that's pretty cool. Like, like Lex Luthor, he's just a d. Yeah, well, you like that, you like the grinded stuff you were talking about, but only in Batman. Yeah, not for Lex Luthor. No, okay. But I like that, like this is how the real Death of Superman Returns, or Death of Superman, uh, how it all actually starts with this crappy Underworld storyline. The kid drawing the spray paint Superman 'S' on the ground, and then just a bunch of freaking goat people. No, I got to be honest, the game looks pretty",
            "start": 72.88
        },
        {
            "text": "all actually starts with this crappy Underworld storyline. The kid drawing the spray paint Superman 'S' on the ground, and then just a bunch of freaking goat people. No, I got to be honest, the game looks pretty good. Yeah, right? Like, all right, so what I didn't realize, we were talking about this before, was that Blizzard developed this game with Sunsoft. Yeah, and a lot of people out there have been following us for a long time know that I have a huge soft spot, uh, for Sunsoft. Um, and I think that honest to God, they made the best superhero game ever, which is the '89 Batman game on NES. Um, they also made Journey to Silius, which is one of the almost underrated games on NES. That was supposed to be a Terminator game and was at the last minute removed of its license, and so they made it into something else. Um, but there's still like total Terminator stuff in the game. It's awesome. But this, so this is a brawl. Surprised when you told me that this is a like a one player game, 'cause you would expect that you'd be able to play",
            "start": 110.88
        },
        {
            "text": "still like total Terminator stuff in the game. It's awesome. But this, so this is a brawl. Surprised when you told me that this is a like a one player game, 'cause you would expect that you'd be able to play with at least two players. Well, again though, the canon of the whole, hold on, hold on. I mean, this is there, this is an important storyline for Superman and for Superman fans. You can't just have a Superman Red in here and like, oh, they're both going to die when they fight Doomsday. That doesn't make a goddamn lick of sense. I don't think a lot of this makes any sense. The parallax scrolling is pretty cool in the background. We'll see it when you move on to the next screen. I just noticed that. So there's some nice little technical touches here, 16-bit technical touches. These goat Underworlders. Now you're already, look, look, you, you look a little low on energy, Greg. I know I'm not doing, I'm not, I got to be honest, I'm not super impressed with the way you're playing the game, right? It's okay. I don't mind. You're allowed",
            "start": 144.6
        },
        {
            "text": "look, look, you, you look a little low on energy, Greg. I know I'm not doing, I'm not, I got to be honest, I'm not super impressed with the way you're playing the game, right? It's okay. I don't mind. You're allowed to say that. I'm also, I'm also, here's what the, the most interesting thing to me is about this particular, this particular stage is how big those chain link fences are. The, the chain link fence, Greg, that chain, look at how big the gaps are in that chain link fence. Superman could fit his entire head through one of those things. All I'm trying to do is keep out, you know, this is a Metropolis power plant. They weren't expecting a group like the Underworlders to come in here and start crap. Oh no, you're trying to get in there to get that Superman logo. I went back, you screwed, screwed it up. I never liked how Superman's cape looked when he walked, by the way. If you look, it's way too off the shoulder. Just standing here looks dope. Look at that, look at that, how much air there is back there. That's a good point.",
            "start": 180.0
        },
        {
            "text": "Superman's cape looked when he walked, by the way. If you look, it's way too off the shoulder. Just standing here looks dope. Look at that, look at that, how much air there is back there. That's a good point. That's the sad part is that even though we're going to get you through the first level here, I imagine we're not going to get to show you the Cyborg, you know, playing as Cyborg Superman, playing as, playing as Conner Superboy, Steel, they had everybody in it. The Eradicator. Like this, like I was so, people always say there's no good Superman game and there's never been an amazing Superman game, but this is, this one is like probably the closest to, you know, it was all these nerdy comic characters that nobody, you know, you know, that weren't, it was a big deal when Superman died, of course, but like not many people jumped on the Superboy bandwagon the way Greg Miller did and fell in love with him and cheered for him the rest of his life. But it was, it was, it was a, it was a love letter to us fans of the",
            "start": 221.12
        },
        {
            "text": "people jumped on the Superboy bandwagon the way Greg Miller did and fell in love with him and cheered for him the rest of his life. But it was, it was, it was a, it was a love letter to us fans of the comic, if you will. You know what I mean? A bunch of like, granted, like these goatmen popping up over and over again, like there's only one of them in the Underworld. There's, and they all, they were super stupid, so there was no real reason for them to have this much time in a video game. You know, they should have probably just gotten right to Doomsday. But whatever. I love the conventions of a brawler too. Like there's always the elevator level, like the, the elevator part. Like, like when you walked in and got the health, I was like, I don't know if you wanted to do that, because that seems like it's there because this is going to be a long and arduous section of the stage and grab in a little bit. But seems like you're handling yourself pretty well here. And what's funny about this to me too is that this genre is",
            "start": 261.36
        },
        {
            "text": "this is going to be a long and arduous section of the stage and grab in a little bit. But seems like you're handling yourself pretty well here. And what's funny about this to me too is that this genre is dead today, and I don't understand quite why, because I feel like these kinds of games, you know, not that, you know, Double Dragon was awesome and, and um, you know, we played Simpsons on Kinda Funny Games, which is not a very good game, but Konami was making a lot of those kinds of games, X-Men. Um, and we only have gotten like a few really notable ones in the last even 10 years. Like I'd say Castle Crashers is one of them, which is a fantastic. I feel like they just, they always sound like a good idea and then they aren't. Like I remember when Scott Pilgrim was coming up and we played it in prev, like this is awesome. And then we got it and like I was like, oh yeah, I kind of remember why I don't like these. Like I don't like, like if it's annoying in this game, even you'll see me start punching and I'm like, oh,",
            "start": 295.12
        },
        {
            "text": "awesome. And then we got it and like I was like, oh yeah, I kind of remember why I don't like these. Like I don't like, like if it's annoying in this game, even you'll see me start punching and I'm like, oh, I'm not exactly on the plane this bad guy is, so I got to try to line that up. Yeah, that was the problem. It seems like there's some gravity here though, when I'm watching you play, like it seems like the enemies snap to your plane if you're near them. I just actually noticed that with the guy with the gun here that shot you, Igor, uh, that it seemed like he snapped up a little bit. Like maybe there's like some, some cheat here to make the gameplay a little more seamless. But no, that, that, that was always, that was a notorious problem regardless if you were playing the TMNT classic one, you know, beat 'em up, or you know, any of the beat 'em ups. But the beat 'em ups are definitely a relic of the late '80s and right into the mid '90s, I'd say. And we love them, but these are games that are made, and I'm not saying this",
            "start": 332.96
        },
        {
            "text": "up, or you know, any of the beat 'em ups. But the beat 'em ups are definitely a relic of the late '80s and right into the mid '90s, I'd say. And we love them, but these are games that are made, and I'm not saying this particular game, but this kind of style of game was made to play with your friends in an arcade. And I think that that's why the game, the genre has kind of died. Do you think it would come back with the advent of PSN and Xbox Live? Um, but that was the cool thing with like when they re, when they re-released Final Fight, right? That was like one of the nice additions, like, you know, that okay, you can play online with all your friends and do this. That was one of the downsides, if you remember, I think what killed Scott Pilgrim, why nobody really cared about that. Yeah, no online play. Like what, why the hell would I do this? That was weird. So what are the, what are the three, are those red orbs under your health? Those are your continues. No, no, no, the red orbs are my special power slam move. I'm saving him for",
            "start": 366.64
        },
        {
            "text": "would I do this? That was weird. So what are the, what are the three, are those red orbs under your health? Those are your continues. No, no, no, the red orbs are my special power slam move. I'm saving him for Claw. He pops up here at the end. This parallax scrolling is really nice. I'm telling you, I mean, this is a little known fact that the money they made off this is the seed money they used for a while. This game was so successful that they were like, well, now we should try this thing, World of Warcraft. Everybody's like, I don't know, there's probably a lot more Superman stories to tell. What was the date on this? Like '93? That stupid, um, that I'm not sure. It doesn't look like a late SNES game. It could be, I guess. And how does it play on SNES with that, with that wonderful controller? Good. The dog-b. I ain't, I, come on, stupid Tick. There was something ergonomic about that SNES controller. Yeah, it feels good. The triggers didn't really make any sense. I remember the triggers, like no one even used them ahead of",
            "start": 399.76
        },
        {
            "text": "a, come on, stupid Tick. There was something ergonomic about that SNES controller. Yeah, it feels good. The triggers didn't really make any sense. I remember the triggers, like no one even used them ahead of their time, man. But they were, they were really out of the, come on, Igor, stand up and die. Ah, another freaking rhino. Get out of here. I'm just looking at the controller. I spent so much time with that controller in my hand. I haven't even looked at it until the weird like purple buttons. Yeah, to differentiate it from that red. Here we go. NES. This, here we go. Claw's coming up. Then we get some awesome cut scenes. Whoa, what the damn? He just came, he just came right out and screwed you, Greg. There we go. Here we go. Now we got him. Now we got this guy by the balls. Well, it seems like you're not going to be able to do that much damage to with us. You're going to take away maybe half his health, 60% left, maybe. Oh, there you go, punching. I'm, I was punching him right in his mouth. See, yeah, you're doing way more damage just",
            "start": 437.04
        },
        {
            "text": "much damage to with us. You're going to take away maybe half his health, 60% left, maybe. Oh, there you go, punching. I'm, I was punching him right in his mouth. See, yeah, you're doing way more damage just doing that. Yeah, but it was cool to do those. Why not save him? I'm not going to, I'm not going to beat Death. He, look, look at what a baller Superman is. He was a piece, piece of ****, huh? The guy, his, his own henchmen were way hard. Yeah, the Tick. The Tick was way tougher than he was. Look at this guy, look at this guy's mullet. News flash: A being of unknown origins heading for Metropolis, destroying everything in his path. Not even the Justice League can stop it. The only mention of the crappy Justice League, by the way, because this was not when the Justice League was good. This is when it was a whole bunch of idiots. Doomsday is here. Watch this. Get ready. Look at him. He's coming for you. Pixel art's kind of nice actually in this game. I'm telling you, bro. Very '90s. Only Superman can save us now. And you think, all right, cool.",
            "start": 479.64
        },
        {
            "text": "Doomsday is here. Watch this. Get ready. Look at him. He's coming for you. Pixel art's kind of nice actually in this game. I'm telling you, bro. Very '90s. Only Superman can save us now. And you think, all right, cool. Now we just get to fight him right away. It's like, no, we got to, we got to go through more stuff. No, Super, you got to go. The end boss is only the boss 'cause he's at the end, Greg. I know, but I'd like to see him in the beginning, you know what I mean? And like, then we get, I don't want to spoil it if we, how many levels are there in this game? I forget. We don't have to go through them all. I'm just giving you the taste here. I'm not saying we do what we don't. I was just trying to get a little bit of a information, a little some information. I wasn't taking Cliff Notes when I was a little kid. All right, so now these guys are straight up Double Dragon enemies. Well, I like how Superman's just in Metropolis. He's killing these men and there's no, there's no explanation as to why these goons are like giving Superman any",
            "start": 515.32
        },
        {
            "text": "are straight up G.I. Joe villains actually. Like Zartan's guys. One was called Buzz-Saw, I think. One was, one was called Blowtorch. They look just like them. Sometimes you got to save money. Again, they used the money made on this for a while. They didn't put the wild budget into this. I'm not saying again, I'm just saying that there's some aesthetic, you know, similarities. I'm not saying that they copy. Now, if you remember what was important about this one, Colin, is that it was the first game where I could just, I could use heat vision. Well, not the first, but it was the first one I can remember where I could use heat vision at will, 'cause I can't remember that in the other Genesis Superman game. And I could also fly at will. Now, double what I",
            "start": 553.6
        },
        {
            "text": "not the first, but it was the first one I can remember where I could use heat vision at will, 'cause I can't remember that in the other Genesis Superman game. And I could also fly at will. Now, double what I like about this, Greg, by the way, look at, look at the city scape again. There's like four layers of parallax scrolling here. And what's cool is that it looks kind of nice when you jump up. Like the, the most, the most aesthetically pleasing part of the background is the part that's closest to you that's often blocked. And then the background just looks awful. Like the city back there, it's the smog. Metropolis is, Metropolis is an industrial city of tomorrow. We're in trouble here. I'm going to, I'm going to blow one of these. Here's your damn motorcycle. Molotov is a clever name, man. These guys are roughing you up, Greg. I know, man. Damn, you just threw all face. The problem here, the problem I had here is that there's no, and granted it's ahead of its time, but there's no like dodge roll when Molotov is getting",
            "start": 598.88
        },
        {
            "text": "up, Greg. I know, man. Damn, you just threw all face. The problem here, the problem I had here is that there's no, and granted it's ahead of its time, but there's no like dodge roll when Molotov is getting ready to throw something. It's like, well, that's coming. What am I going to do? You know what I mean? Like I can't, I like how he just got a lighter and he actually lights the Molotov cocktail. It's kind of cool. It's pretty, it's like there's some pretty cool pieces of this game. There you go. Boom, right in his **** fat face. Superman, he's paralyzed. Not my problem. Superman is murdering dudes. I, there's a monster of unknown origin heading towards the city. Can I please pass you? If any of you, if Molotov wants to go fight Doomsday, he's more than welcome to. But none of you were working for. That's the other thing. There's no real explanation for why these guys are starting **** right now. I guess maybe they're looting in the, you know, 'cause Doomsday's coming through. But even that doesn't make much sense. Maybe they're",
            "start": 639.52
        },
        {
            "text": "no real explanation for why these guys are starting **** right now. I guess maybe they're looting in the, you know, 'cause Doomsday's coming through. But even that doesn't make much sense. Maybe they're working for him. Doomsday, he came out of the ground. He didn't have time to hire anybody. You never know. No, I should have saved. God, I should have saved. Aggressive. Well, he's Doomsday, bro. Programmed very aggressively. Get down there, Superman. Hey, Superman, coward. Whoa, he can't get you. That's really troublesome. I'm surprised that these guys don't have aerial attacks to fight you, to fend that off. Doomsday's got no aerial, he's got no aerial game. Is that it? I'm dead. If I restart the level, I think we should probably just start it, stop it. Yeah, saw Doomsday kill me. Like eventually you battle him and if you, if you wear it down, they do like the whole comic book knockout punch at the same time. I fall now, but I'm old and I don't know how to do that anymore. I'm old. You ever get old? Yeah, I, I've been old. Atrophy. Wait, is",
            "start": 690.36
        },
        {
            "text": "it down, they do like the whole comic book knockout punch at the same time. I fall now, but I'm old and I don't know how to do that anymore. I'm old. You ever get old? Yeah, I, I've been old. Atrophy. Wait, is this where the stage starts or is this? Yeah, this is where it starts. Well, yeah, we're not doing this again. There's no way. Okay, Greg, are you done? Are you satisfied? Are you satiated? Yeah, I had fun. Oh, look, I did that move. I didn't know. Good. Yeah, it's, it's a, this is an interesting game and it's some interesting heritage here with Sunsoft and Blizzard. Two company, well, Sunsoft, you know, people that own NES especially, I think we're all very familiar with that. But you know, who, who the hell knew Blizzard was making games like this? I didn't. I had no idea. You learned something today. Uh, Greg, thank you for showing me what is The Death and Return of Superman, SNES and Genesis. Yep, not available for download anywhere, but we have the cartridge here. Yep, thanks to our Retron 5 from Game Zone Retron 5. We do appreciate",
            "start": 745.4
        },
        {
            "text": "me what is The Death and Return of Superman, SNES and Genesis. Yep, not available for download anywhere, but we have the cartridge here. Yep, thanks to our Retron 5 from Game Zone Retron 5. We do appreciate that very much. Uh, thank you so much for joining us here on Kinda Funny Games. Stay tuned for more, uh, video game Let's Plays and our podcasts. And you can find us on Colin and Greg Live on Twitch. And there's all sorts of good stuff going on. Uh, so until next time, alright.",
            "start": 780.4
        }
    ]
}