{
    "id": 714,
    "video_id": "hSqcw_zdKyQ",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "2015 Review (So Far) - Kinda Funny Gamescast Ep. 12 (Pt. 2)",
    "description": "A quarter through 2015, we review it so far.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1427202004,
    "duration": 828,
    "transcript_chunks": [
        {
            "text": "[ Music] all right, second topic. This one comes from Twitter. Can I say something before you get in your topic? Oh yeah, while we were recording this , uhuh, we have confirmation from Nick Scarpino that the contract is signed. The Kinda Funny live event is in San Francisco on May 16th. That's a Saturday. It's a 21 and over event. Follow us on Twitter. I'm sure we've been tweeting about it nonstop. Maybe at kindafunny.com. We've put up a post about it. We should stupid commercial. Yeah, 316. No, what? 316. 316. It's on 316. No, that's March. May 16. 56. 56. So that happened two days REM theage. You all missed it. You made an image. We made the image and it definitely says 316. Jesus **** Christ guys, the event was, I left you alone for two seconds. Oh man, the event was two days ago. Uh, hey, we, we had you got date wrong on Mega Man one. We, we the numbers for some reason, I don't see dates properly. Yeah, that like when there's an error, I'm just like, oh, that's right, that's good things happen. 316, that's what it is. I was",
            "start": 2.47
        },
        {
            "text": "on Mega Man one. We, we the numbers for some reason, I don't see dates properly. Yeah, that like when there's an error, I'm just like, oh, that's right, that's good things happen. 316, that's what it is. I was excited it was 36. All right, okay, so Twitter user Extra One Jr. wants to know, do a review of the first quarter of the year and if 2015 has lived up to expectations. So yeah, when I first read this, I was like, we're not a quarter of the way through the year. And I was like, holy ****, we are a quarter of the way through the **** year essentially. I mean, give or take of two weeks. Yeah, what do you guys think of it so far? Both from a game perspective, like playing the games and game announcement perspective or game news, a weird thing to say game news. Okay, I I think we, I think it's important to say what were the expectations coming in. I think PE it was that normal thing where we're in the fall and everybody's like, well, it's a **** first, it's a loaded up first half of the year with all these games",
            "start": 55.6
        },
        {
            "text": "were the expectations coming in. I think PE it was that normal thing where we're in the fall and everybody's like, well, it's a **** first, it's a loaded up first half of the year with all these games that have been pushed. And I remember being like, well yeah , Evolve and Bloodborne. I remember and all the Order, okay, and it's like those have come and gone now for the most part, right? It's just like I they my expectations weren't off the chart. Like I think when when did Witcher get delayed out of March? That would have been the the one first half first quarter part I was like, ah, and once that got out of there, I was like, wasn't that last year that they announced that though the push back when it got delayed out of March? Yeah, that's what I'm saying. It's like so like once that happened, I really had no expectations for this first quarter cuz yeah, I feel I mean, I feel like we've already gotten a couple games. We got Dying Light, we got which came out of left field. I don't think people I we had seen",
            "start": 103.44
        },
        {
            "text": "no expectations for this first quarter cuz yeah , I feel I mean, I feel like we've already gotten a couple games. We got Dying Light, we got which came out of left field. I don't think people I we had seen that at PAX and like this seems cool, but I think we thought it was going to be as cool as it was. Mhm. And then Evolve, which I know we didn't really get into. Yeah, you played it though, right? I played it and it's what I thought it was. It's an awesome game, but it's just an awesome game that would that entertained me for like three weeks . I mean, did you did you get really into Left 4 Dead? Uh, I got really into into Left 4 Dead. Evolve is awesome, but it's it has the same issue that like Splinter Cell multiplayer always has where it's awesome with a group of friends. Like you really you really have to have like you and your buddies being the Hunter, otherwise it's like it's just not fun. Mhm. Yeah, so but yeah, there's there's more to that game than I thought there was though. There was more modes and",
            "start": 138.76
        },
        {
            "text": "have like you and your buddies being the Hunter , otherwise it's like it's just not fun. Mhm. Yeah, so but yeah, there's there's more to that game than I thought there was though. There was more modes and and is that going to have like a Titanfall thing where it just like nose dives off? Uh, it's just kind of weird cuz I I judge a lot of a lot of like uh game retention with like, you know, how how many people like stream it and stuff and just no one watches Evolve. No one really like plays or streams Evolve. Interesting. So from that point of view from a like Twitch point of view, yeah, I just haven't seen much like attention for that game anymore. Yeah, Evolve is Evolve C and I said it weeks ago in col Greg La. I'm like Evolve just I haven't played it. I haven't talked to anyone about it. You can just tell it is not picked up like it is not caught on. People don't care about it. Like it's it's obvious, you know, just from we get tweets every day where someone's like, well, what where is this and why don't you guys",
            "start": 175.6
        },
        {
            "text": "not picked up like it is not caught on. People don't care about it. Like it's it's obvious, you know, just from we get tweets every day where someone's like, well, what where is this and why don't you guys twitch this and and I we we get no messages about Evolve. You look at the the game sold respectively on NPD um but it seems like there's no buzz and and this is just more anecdotal evidence if no one's twitching it then yeah, do you think there's no buzz because they just showed way too much of it? It like I feel like they had way too much to explain. I don't even know why they made that game to be honest, but um you know, I I I think there's a few problems. I don't think that people understand what the game is. I think I I mean from a most bass perspective, the box art is **** awful. So like when you see it in it is awful. It's terrible box art and when you see it in when you see it in the store, it's like all right, like",
            "start": 215.64
        },
        {
            "text": "mean from a most bass perspective, the box art is **** awful. So like when you see it in it is awful. It's terrible box art and when you see it in when you see it in the store, it's like all right, like and I've said before it's like that you know, like that is a great game but that box art sucks. He's talking about Resistance three and uh even you know, like it's like that's boring. Like I remember seeing that for the first time this is awesome if you have any idea what the Chimera are and like all that kind of stuff who's going to pick that off of the Shelf, you know, I Moss is a great artist but that's not a good look for your for your for your box art. So that was the first thing I noticed about a B like that is an awful logo and an awful way to portray the game and I do agree that they had the game is more comp like the four-on-one asymmetric thing is so weird to some people that they had to overe explain it um and there's just other games to play like I don't we out into it being really",
            "start": 251.16
        },
        {
            "text": "game is more comp like the four-on-one asymmetric thing is so weird to some people that they had to overe explain it um and there's just other games to play like I don't we out into it being really complicated, you know what I mean? And granted that works for Dota in League and I'm not you know what I mean? I'm not trying to knock games that really have a lot to do but when you're sitting there to a console audience trying to explain the differences in each one of these classes and how these weapons work and how I mean it was like it's a lot to take in and when your game isn't something fun to jump into it's then you immediately start what what Left 4 Dead always did amazingly was like you are a dude or a dudette grab a gun and **** try to survive make it to the next safe house that's it over time you're like oh I like this gun better I like this gun but there wasn't like a skill to learn and how to interact with each other it was like you could all have shotguns and be fine you",
            "start": 287.24
        },
        {
            "text": "it over time you're like oh I like this gun better I like this gun but there wasn't like a skill to learn and how to interact with each other it was like you could all have shotguns and be fine you could all have different weapons and be fine there's different things to it where this one is so so about let's all communicate perfectly yeah let's I'll do this all right you're doing that I'm going to put up the bubble Shield lock him in here you know what I mean like which which from my point of view is is is fun and it's fine because like like I could just I have my group of friends or I just you know I'll just look over at twitchchat and like guys Jump On In let's do this but like a lot of people don't have that luxury yeah and I know I know that such but I know they they wanted to take like a very like I appreciate the fact that there's like depth with like the weapons and stuff but yeah I know they just wanted to take a very like eSports approach to it and I feel like you kind of that's",
            "start": 322.52
        },
        {
            "text": "a very like I appreciate the fact that there's like depth with like the weapons and stuff but yeah I know they just wanted to take a very like eSports approach to it and I feel like you kind of that's it's a game like people are going to try to do that and someone's going to hit it and make it work but it's just like that killed more towards like the common folk. I mean yeah earlier you're saying that like Destiny kind of eased console Gamers into the MMO idea and stuff so it sounds like Evolve just didn't do a good job of easing them into the like kind of mesque it's not so much a m yeah that's a great example right of like Destiny like most MMOs right begins with you can play up what up to like level 30 you can beat the game and whatever be up to level 20 I guess is what it was right at launch uh and like be great and then it's like at the time by you get to that point you started to get like the breadcrumbs of working with other people and doing other things and then if you're into",
            "start": 360.24
        },
        {
            "text": "launch uh and like be great and then it's like at the time by you get to that point you started to get like the breadcrumbs of working with other people and doing other things and then if you're into that and you've made friends playing the game on the same level as you that's when you can start going into these bigger things with bigger people. Yeah, I just feel like they gave too much away. There was like Alpha after like Alpha then beta then beta and it's just like everyone could I mean I appreciate as a streamer like everyone could play it and stream it and stuff but I just felt like when the game came out I was like I already played this game like I experienced all there is to experience with this game already. Yeah, I think and this goes back to the point of being like this is it's a huge gamble to make a game like this because Evolve is meant to be a game like Destiny in the sense that like this is a game you play and you and you like collect people to play it and it's a persistent",
            "start": 397.76
        },
        {
            "text": "gamble to make a game like this because Evolve is meant to be a game like Destiny in the sense that like this is a game you play and you and you like collect people to play it and it's a persistent platform that you play on and when there's only there's only so many players with so much time to dedicate to so many things and when you have big guys out there like Destiny and Call of Duty and Battlefield like you can't compete. That's why I don't even understand like why like that's why Titanfall failed you know like Titanfall is going to there there's going to be a sequel but Titanfall certainly didn't mean expectations they like the guy we read that story last week where they were like one of the guys like the biggest regret was that we weren't on more platforms we couldn't be that was why Titanfall didn't take off just not enough people could play it and then there was no meat on the bone for a lot of people and stuff like that which was a problem too and I'm not Titanfall looked fun",
            "start": 429.68
        },
        {
            "text": "Titanfall didn't take off just not enough people could play it and then there was no meat on the bone for a lot of people and stuff like that which was a problem too and I'm not Titanfall looked fun and it's not was fun and it's not my game it's not my kind of game so I'm not going to you know to say one way or the other whether it's good or not I don't know but it it wasn't a game that caught on because for for lots of people really almost immediately I remember reading on Neo like even on the PC version like where people like we can't like they couldn't find games like after two weeks you know what I mean and it's like that's a huge danger when you're stepping into that space you make sure your game's really **** good and you have a marketing push and all these kinds of things which Destiny did I think Destiny again in hindsight was really brilliant the way it approached it it went silent for a long time it came back with the beta or the Alpha and the beta it got people involved",
            "start": 466.76
        },
        {
            "text": "Destiny did I think Destiny again in hindsight was really brilliant the way it approached it it went silent for a long time it came back with the beta or the Alpha and the beta it got people involved in the game people were really hard on in the beginning then they realized what the the hook was the carrot in front of the dog as it were so I I think that I don't know I think that there's there's there's much to there's much to love about that kind of game but what's the point of making another one when you can't compete with Destiny Call of Duty carrot in front of the dog the dogs ran after the carrot right donkey donkey I thought it was a horse I thought it was a horse no don't they put don't they put a oh it is a it is a horse yeah the dog would need carrot what do they put in front of the oh they put a rabbit in front of the dog at the racetrack right mix analog yeah makes metaphor you understand what I'm saying got you got to put the cow before the horse in this one anyways all",
            "start": 498.16
        },
        {
            "text": "the oh they put a rabbit in front of the dog at the racetrack right mix analog yeah makes metaphor you understand what I'm saying got you got to put the cow before the horse in this one anyways all right so going to the other games other systems that come out what what else has stood out to you guys in 2015 I think for me you know Majora's Mask coming out 3DS was a a big surprise for a lot of people that it even happened and did it all happen really quick I can't remember what's up did that like get announced in 2015 and it come out and not in 2015 no it was announced late 2014 but the fact that it even came out in 3DS like I'm pretty astonished that they actually did that what's crazy is like I think from news perspective is that uh I read a couple days ago that's the like one of the best selling Zelda handheld games already and I was at Best Buy yesterday and they were sold out of it and I was like whoa that's weird so that's cool sounds like 3DS the Order disappointed but I think",
            "start": 534.92
        },
        {
            "text": "selling Zelda handheld games already and I was at Best Buy yesterday and they were sold out of it and I was like whoa that's weird so that's cool sounds like 3DS the Order disappointed but I think the Order I think you know people watching the industry had their doubts about the Order and how that was going to pan out to begin with from the jump right so I don't know if well at least one person did I don't know how many few people were thinking it was going to come out and be a AAA 10 or something like that right like people understood that that was where it's going uh while we record this we don't know anything about Bloodborne we haven't popped that in and seen what's happening with it so who knows yeah uh but I mean it's been quiet but I expected it to be quiet you know what I mean did IDARB come out this year or did we just play IDARB came out IDARB came out this year this and that's what I was going to say is there actually quite a few good small games that came out I think um I lost a",
            "start": 574.92
        },
        {
            "text": "IDARB come out this year or did we just play IDARB came out IDARB came out this year this and that's what I was going to say is there actually quite a few good small games that came out I think um I lost a lot of time to Woah Dave which is like just a really bizarre Super Mario BR like Super Mario the original arcade game clone uh Hell Divers is awesome um doesn't eat your **** why is Hell Diver eating your **** cuz it's broken BR uh Citizens of Earth came out this year which is pretty interesting um Ironclad Tactics was interesting like there there were small yeah Starships came out there's there's smaller games and Starships I wouldn't really call a small game but there are smaller games that have come out that I think are filling in the kind of the crevices nicely but I still think Dying Light was the champion of Q1 by far and I think that um I'm trying to think to make sure I'm not like overstating it yeah H Miami 2 is out but I think Dying Light might be my game of the year so far",
            "start": 614.72
        },
        {
            "text": "Light was the champion of Q1 by far and I think that um I'm trying to think to make sure I'm not like overstating it yeah H Miami 2 is out but I think Dying Light might be my game of the year so far damn um because I just that game really grabbed me and it was such a pleasant surprise this is why I don't even read preview coverage and why I hated writing previews at IGN was because when I knew I was interested in a game I like pre pre the preview beats like my least favorite thing if I could like have never written previous I would have been totally glad to do that because when I'm interested in the game I don't like to read about it or know much about it and Dying Light was one of those games that I knew so little about that I didn't even know I would care about it and I've said before when Greg described it as Mirror's Edge which I didn't like that much to like Dead Island meets Mirror's Edge I was like that sounds **** awful you know and and uh and I played it I'm like this is great",
            "start": 653.72
        },
        {
            "text": "Greg described it as Mirror's Edge which I didn't like that much to like Dead Island meets Mirror's Edge I was like that sounds **** awful you know and and uh and I played it I'm like this is great this is great great game you know I can't recommend Dying Light enough it's awesome it's really really surprisingly good surprisingly great I would even say so I still think that that's kind of the champion of Q one but things will pick up yeah we're going to get weird games at weird times like we're getting Batman in June I mean that's a weird that's a weird game to get at a weird time gear in September yeah Metal Gear in September we're getting big games at you know at weird times Mad Max Battlefield in Mar was weird yeah Battlefield Battlefield is out yeah forgot about that so how's that going um it's like Battlefield 4 but a lot more fast pace which I appreciate I was never a battlefield guy that liked the big Conquest maps with 64 people and all the vehicles it was cool but I was more",
            "start": 686.0
        },
        {
            "text": "um it's like Battlefield 4 but a lot more fast pace which I appreciate I was never a battlefield guy that liked the big Conquest maps with 64 people and all the vehicles it was cool but I was more like I like that the gameplay mechanics of Battlefield just give me a smaller map and you know quick to engage you know uh scenarios um how many hours have you put into it a lot so far um probably like 20 plus uh multiplayer single player got it recently but super recently 20 hours already well I've been playing like the beta and stuff like that okay the BET makes and surprisingly the campaign is I mean it's decent you know it's a battlefield campaign so I don't surprising it's decent it's you know I I'm playing through it and I'm not like oh I want to turn it off in terms of campaign so cool also Kinda Funny Games launched in uh quarter 1 sure that has exceeded expectations changed the landscape of video games totally sure changed something yeah so I'm I'm pretty excited about that yeah",
            "start": 722.2
        },
        {
            "text": "Kinda Funny Games launched in uh quarter 1 sure that has exceeded expectations changed the landscape of video games totally sure changed something yeah so I'm I'm pretty excited about that yeah q1 I'll say this about q1 q1 is has been stronger than usual people are finding their niches to to release games at weird times like we said M Dying Light would have not sold how well it sold if it was released in November so it was a smart time and I'm not even sure I would have paid attention in that game if it was released one you know at in the fall period in the holiday period so I think that we're going to see stronger quarters across q1 Q2 Q3 and Q4 are all going to be stronger going forward every year because I think people are starting to realize you don't have to shoehorn your **** game into mhm November because it's AAA or whatever you can find Space to breathe and people will pay attention to your game as we've talked about in previous episodes of Gamescast if you find the right",
            "start": 768.16
        },
        {
            "text": "into mhm November because it's AAA or whatever you can find Space to breathe and people will pay attention to your game as we've talked about in previous episodes of Gamescast if you find the right place to release them so I think q1 shaped up really nicely just based on this kind of changing Paradigm. M yeah cool",
            "start": 808.88
        }
    ]
}