{
  "id": 664,
  "video_id": "NSPABcmEMS0",
  "show_name": "The GameOverGreggy Show",
  "hosts": ["Greg Miller", "Nick Scarpino", "Colin Moriarty", "Portillo"],
  "title": "Dropping Out and Aquaman - The GameOverGreggy Show Ep. 65",
  "description": "Greg Miller reacts to the Aquaman DCU reveal poster, Colin Moriarty wants to know what proof you would need to know there is a God, Nick Scarpino asks Greg about his insane wrestling history, and the boys discuss the importance of college for YouTubers. (Released 02.27.15)\n-\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1425626767,
  "duration": 7820,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up everybody Welcome to the GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer, Seducer Nick Scarpino. Hi guys. Hey, how you doing? I'm just trying to figure out why Colin's hiding uh his like I'm just putting my hand there stretching my arm out. Look at look at these **** works that art you killing machines. You've been killing it lately on machine and the lubm. Thanks over here . This is the pride Long Island K Mario course. Look at how softest skin is. Touch it. I can I touch your skin? You think like wow, I feel my hands. My hands are ****. I work at the dock. I work at the dock. You might as well you might as well be that guy from **** kickx crates on the fairy and I take them off the fairy. I do whatever I need. I got The Black Lung pop. Got The Black Lung. have one day you have your hand over you got the it's like remember in the old Adam West Batman when you put his hand on the bus then pull back and there'be the red button and hit the red button",
      "start": 2.85
    },
    {
      "text": "have one day you have your hand over you got the it's like remember in the old Adam West Batman when you put his hand on the bus then pull back and there'be the red button and hit the red button the do open and they slide down come man uh no pure one Tim Gettys today no Tim is uh Tim is down in LA visiting some friends Los Angeles we gave him a little vacation a little time off Angeles Los Angeles but he'll be back next week yeah so he thinks so he thinks yeah big things for next week did we vote on him us firing him yet no that's not the big thing okay if you're if you're listening to this and you're watching this and you're doing this thing before what did I put it on the schedule for Monday I don't know we're at GDC all next week we're doing live streams over on twitch.tv/ kindof funnygames 11 a.m. to 5:00 p.m. each and every day Monday Wednesday Friday getting the whole thing done before we go to packs while we're there what we're going to be doing this helps out the Patreon",
      "start": 52.12
    },
    {
      "text": "funnygames 11 a.m. to 5:00 p.m. each and every day Monday Wednesday Friday getting the whole thing done before we go to packs while we're there what we're going to be doing this helps out the Patreon listeners is that we will be doing the GameOverGreggy Show and the Kinda Funny Games Cast during the streams so if you've ever wondered what Anarchy leads up to the show and follows the show afterwards and what we try to bleep out but won't be available to bleep out next week you to see because we'll be doing the streams we doing interviews like Cliffy B seeing new games seeing Steve Gainer doing all these crazy things with these developers that are big deals and then in the middle of them doing our regular shows that will then break out later on as you you've come to expect if you can't catch a live stream I'm excited about this you you you told me this idea and I said no no you didn't you all just kept typing at your computers and didn't really acknowledge the idea and then I I",
      "start": 92.52
    },
    {
      "text": "catch a live stream I'm excited about this you you you told me this idea and I said no no you didn't you all just kept typing at your computers and didn't really acknowledge the idea and then I I pushed forward to it and I confirmed again today this is really happening everyone um and you know there there's a part of my my brain that's like well we should probably go look at that space make sure all the stuff that we're promising is even close to possible but then it's room it's a room you can live stream and that's all we need to know that's all we need to know it'll be fine I'm going to I'm going to I'm going to put together a little sheet that I send out to all our guests explaining where we're at get there a little bit early and also things are going to go wrong yeah but we're this is this is the new age you Embrace that and you don't worry about it it is the new you're going to come in you're going to sit down you're going to start talking to Colin I maybe Tim Nick whoever we're",
      "start": 131.08
    },
    {
      "text": "this is the new age you Embrace that and you don't worry about it it is the new you're going to come in you're going to sit down you're going to start talking to Colin I maybe Tim Nick whoever we're going to start setting up your game a few feet away and if it's not working immediately Don't Panic we're going to sit here and talk we're want to chat what we the co hey Hey Bada Bing Bada hey that was Die Hard he just quoted Die Hard I know did and you just quoted uh just being incredibly racist against my Italian Heritage um is that not right Colin did I did I hear that correctly yeah no you heard it I mean you're being Greg is a full-blown racist so I'm not going to worry about it so you guys put on your wife beaters gold chain make some sauce come at me yeah do do I'm making a sauce a sa I saw Don John Don John that was it right I know I know what happens I saw Tony Danza my favorite thing about one of my favorite things about The Sopranos one of the most understated things was when",
      "start": 165.28
    },
    {
      "text": "I saw Don John Don John that was it right I know I know what happens I saw Tony Danza my favorite thing about one of my favorite things about The Sopranos one of the most understated things was when they would go to they would be in the back room with a bing where like they had they had like they had like they had like a actually no no they would be in the this all right so at this place they would be in the back room of the deli that they they would hang out like the sandwich shop right and they had like their own kitchen and like a bed and stuff like that it would just be all be hanging out there and there was always always like one of the maid men or like one of the associates just always cooking a sausage at the stove like constantly someone was just cooking sausages all the time and now that or oh yeah I C I'm going to have sausage after this and what's what's fun on set Thursday yep I am oh no and your sausages are amazing by the way I think you get them at andronico they're",
      "start": 202.64
    },
    {
      "text": "now that or oh yeah I C I'm going to have sausage after this and what's what's fun on set Thursday yep I am oh no and your sausages are amazing by the way I think you get them at Andronico they're they're great oh they're great they're worth the they're worth the the pound of Flesh that you have to pay to **** get them because it's Andronicos Oh I thought you meant like Andronicos ish a little more expensive than Safeway and Colin acts like they are charging him teeth out literally last time we went to go there when we were still driving home uh at nights through the show col was like no no I refuse to go in there I refused to go he like sat in the car but it it happens the same way it always happens where you go in you're like oh this is too expensive and then you try to go away and then you're you're like you know what it's quality though yeah I go there I go there pretty often now now you're getting all your Meats there you want yeah I get I get my Meats there they have some good",
      "start": 235.68
    },
    {
      "text": "you're you're like you know what it's quality though yeah I go there I go there pretty often now now you're getting all your Meats there you want yeah I get I get my Meats there they have some good breads uh but when I get when I get like ban when when you get anything else like a grocery what I would consider a grocery so let's say like some uh some cookies some salsa uh granola granola like everything's more expensive like their orange juice is like six or seven are you nuts you know what I mean the meat's a good price mhm but you get like these kind of more like you need Tropicana orange juice you have to get like I don't know Campbell's baked beans or something like that like it's always like literally 50% more than it is that's the big name abing that's just the city though man everywhere I go in the city I feel like it's way too expensive everything's too expensive it is but if you walk the Safeway down like uh like norga then it's totally fine I've rediscovered my love for",
      "start": 273.72
    },
    {
      "text": "I go in the city I feel like it's way too expensive everything's too expensive it is but if you walk the Safeway down like uh like norga then it's totally fine I've rediscovered my love for Safeway lately my wife and I go to get go to safe weake when we need a specialy item they don't sell at like the real foods or like the marina Market or any these like smaller uh grocery stores that that sell just kind of the bare necessities out outrageous prices so the other day she was like I want to get for the Oscars who were watching the Academy Awards and um what's that like at your house big deal it's a pretty it's a not a big deal but you put on your you put on your we wore tuxedos both of us my wife and I she wore tuxedo as well she wore well her is more like a white dinner jacket um but no we watch we we we like to make a little bit of a big deal out of it well she's dieting this week so normally we have what she refers to as her Doritos time where she has her is that based on the what's",
      "start": 310.0
    },
    {
      "text": "watch we we we like to make a little bit of a big deal out of it well she's dieting this week so normally we have what she refers to as her Doritos time where she has her is that based on the what's funny is totally completely different but she's like I want Dor itos I want to pour a big bowl of Doritos in front of me and just and she slow plays it all day she'll just eat like one after the other after the other and we'll Whittle through like a whole family size bag sure uh but this this week she was like no I'm going on this like crazy protein diet I got to cut down a little bit the Cool Ranch we've been trying to work out we've been going back to yoga together so um I got so she ate uh a nice fillet of fish with I think some spinach for the record not a fet of fish from McDonald's no okay no not a f not a f o fish okay of fish it sounded like oh did that you hear an o in there when everyone says fet of fish you often just assume it's McDonald's fish filet otherwise no she Miller",
      "start": 347.88
    },
    {
      "text": "okay no not a f not a f o fish okay of fish it sounded like oh did that you hear an o in there when everyone says fet of fish you often just assume it's McDonald's fish filet otherwise no she Miller special that and a cup of coffee that's all my grandma would get there damn did damn I could just smell the polyester um she was eating a nice fillet of fish and some spinach and I was uh whittling my way through Taco Bell because that's what I give myself on Oscar Sunday cuz to me Oscar s is like the the nerd Super Bowl right where it's like it is the time that I get to celebrate the thing that I love and I like to super we had fun at the Super Bowl party together throw by Mr Ty and Craig Baron that was cool um but this is not like I was there too I don't know why you Colin no Colin made eye contact because Colin actually talked to me all you did was sit two sides of the room you were basically just on your phone though I'll tell you what Char new girlfriend was there in the center and",
      "start": 385.68
    },
    {
      "text": "contact because Colin actually talked to me all you did was sit two sides of the room you were basically just on your phone though I'll tell you what Char new girlfriend was there in the center and since she was in the center I never talked to her either that was the cut off didn't never meet her didn't never meet this woman I was in the room this was Greg at the Super Bowl party no it was actually this was me at the Super Bowl cuz I was I was listening to the ad Blitz halftime yeah trying to catch our commercial yeah um yeah what's funny about Charles's new girlfriend is she seems very very sweet very very uh nice and very very innocent and for some reason I know I wasn't even drunk I was saying some of the worst possible things directed like not at to her but just I was like I'm like dude that guy is GNA you remember the guy made that game-winning catch where it was like randomly in your I was like oh my God he just totally saved the game from them I was like that dude's going to go",
      "start": 429.6
    },
    {
      "text": "that guy is GNA you remember the guy made that game-winning catch where it was like randomly in your I was like oh my God he just totally saved the game from them I was like that dude's going to go out and he's going to get late tonight am I right am I right and she's like I don't know you why touching mear things yeah she knows me now um Charles just sitting there sh I just went off on a ridicul tangent oh Safeway so yeah so we go to Safeway to get these things she wanted diet coke she wanted diet cream soda so we go there and I'm just I Marvel at how cheap everything is I'm like I why do I forget about Safeway you can go and you can get normal priced items there that are a reasonable quality I feel like Trader Joe is is cheaper than Safeway it is but they don't have they don't have everything everything's Trader Joe's branded yeah that's problem sell Diet Coke for ch yeah like they don't sell Coke they don't sell like I can't get helmond I can't get Hines ketchup I can't get deli",
      "start": 467.04
    },
    {
      "text": "everything's Trader Joe's branded yeah that's problem sell Diet Coke for ch yeah like they don't sell Coke they don't sell like I can't get helmond I can't get Hines ketchup I can't get deli cheese you know Trader Joe's the fancy version of Aldi right and they're owned by the same company yeah exactly yeah because Cheryl when she was interning in Pittsburgh when she was getting her PhD loved Aldi and that's like an even cheaper Aldi yeah is super it's cheap and not like healthy food stuff no no no um so crazy Chief Buffs yeah like I I Cheryl and I typically go to Trader Joe's like once a week and then we go to Safeway for supplemental things like you're saying yeah too cuz there's just some **** at Trad that I just don't want any part of like their yogurt Situation's kind of weak oh they got the chibani I think don't they oh he hates chibani he can't gross Greg's chbani smells like **** **** I don't know if I don't know like I I just want to be straight up honest with you",
      "start": 504.8
    },
    {
      "text": "oh they got the chibani I think don't they oh he hates chibani he can't gross Greg's chbani smells like **** **** I don't know if I don't know like I I just want to be straight up honest with you there's something like you're eating some I think it might not be food like I think you might have acally be eating chemicals or something like that or just garbage straight garbage out of a landfill see this is the one you were talking today and con live about being finicky this is the new one where all of a sudden you are on you are six months pregnant level of just weird with food stuff all of a sudden you can't smell the yogurt well it's only because the yogurt's too much for me because it's like you weren't eating this until last month sot yeah I wasn't around you eating you weren't around me sure I ate it every day big bowl of yog in Brazil this is the problem and this is the problem with the yogurt situation is that he eats the yogurt and that's fine eat what you want give a fly",
      "start": 542.92
    },
    {
      "text": "me sure I ate it every day big bowl of yog in Brazil this is the problem and this is the problem with the yogurt situation is that he eats the yogurt and that's fine eat what you want give a fly **** what you eat but it's fine but then the bowl is there with covered in remnants of the yogurt which smell like **** which then goes into the sink and just sits there all day which smells like **** the cup goes into the recycling bin which smells like **** and then the aluminum foil then goes into the garbage which smells like **** so no matter where you go you open the garbage can and you got a waft of whatever the hell it is that you're eating yogurt Greek yogurt see the problem is it's the GRE terrible it's the Greek yogurt if you get a yl yogurt that's that's the thing is eat yogurt by the barrel that's his treat after he has a nice dinner he eats a thing of yl with nuts in it oh that's good yeah that's good smells like yl smells like nothing This Yogurt smells like nothing",
      "start": 580.44
    },
    {
      "text": "by the barrel that's his treat after he has a nice dinner he eats a thing of yl with nuts in it oh that's good yeah that's good smells like yl smells like nothing This Yogurt smells like nothing it's not it's not a weird wait what Kevin weigh in does the yogurt smell weird I haven't SM it okay garbage just's go smell the garbage I don't think that's an accurate representation here's what you're not saying first off of course I wash the bowl when I make my lunch later on it doesn't sit there all day like it's there sometimes for three or four days okay I'll wash out the containers then when I throw it away too I didn't know that was a problem you don't you don't express yourself it's just it's weird sometimes no I don't P it up there's just there's some problems that I have that I acknowledge are so astronomically weird no but I'm willing to make these sacrifices for you the 5 Seconds to wash out the yogurt containers for you I appreciate that no problem I don't see I don't think it's",
      "start": 618.68
    },
    {
      "text": "are so astronomically weird no but I'm willing to make these sacrifices for you the 5 Seconds to wash out the yogurt containers for you I appreciate that no problem I don't see I don't think it's weird I think the fact that it's Greek yogurt is what makes it smell weird to you when I started eating I I I went on a binge where I was like I'm going to get healthy cuz yogurt has those those good uh I guess bacteria yeah um Activia It's the Jam Lee Curtis thing that's that's when you your pants yeah Activia did it to like it's the same thing any yogurt's got the the natural cultures in it the thank you uh but the Greek yogurt does smell a little strong and by strong I mean it does smell a little like a foot yeah it smells like a little bit like **** yeah I mean let's just let's just call it like it is I mean it you know it just smells a little bit like **** and great so I mean it's not like a full-blown **** I took a fart in the bath in in the shower fart the shower took a fart now",
      "start": 656.76
    },
    {
      "text": "like it is I mean it you know it just smells a little bit like **** and great so I mean it's not like a full-blown **** I took a fart in the bath in in the shower fart the shower took a fart now this walked it in no come with me fart here took it in theer come over to my shower we've expressed the you know the wal fart and you know the mor farty some people have called it uh that's a really good name good and it's not one of those it was one of those that was like maybe there might have been I don't think so but maybe I **** myself a little bit I don't I'm not positive but it sure smells like to afid and then I'm trapped in my stall shower like get me out of here like it's too strong even for me you got the soap in your eyes you're like screaming banging on the wall oh God Christ it it it felt like warm in there like it was like you got extra warm like it's really hot already and I can still feel the temperature differential between the normal hot water and the hot water that",
      "start": 699.28
    },
    {
      "text": "it it it felt like warm in there like it was like you got extra warm like it's really hot already and I can still feel the temperature differential between the normal hot water and the hot water that just came out of my **** that's what you're were saying yeah that's exactly what I'm saying it's it's been a good show I could have just said ass if you didn't know ladies and gentlemen this is the game of show each and every week four sometimes three best friends gather around this table each bring a random topic of discussion for your amusement if you like that you can pick up the show early each and every Friday over on patreon.com kindof funny if you don't want to give us any money no big deal you can wait and go to youtube.com/ kindof funny get each and every topic broken out day by day until we post the whole thing on Friday on iTunes and of course youtube.com kindafunny.com has everything you need including we need now we need a shirt on district lines that says the mor",
      "start": 736.92
    },
    {
      "text": "by day until we post the whole thing on Friday on iTunes and of course youtube.com kindafunny.com has everything you need including we need now we need a shirt on district lines that says the mor farties what is it Mory Morearty the Mora farty can it just be a picture of a shower stall and it says morard and Al some steams coming it can be that I was thinking just the actual like translucent glass with just your butthole pressed up against it like your ass pressed up against it but then you have to have the arms pressed against the other side of you really got to get if you don't have ex suction it's like it's like opening the air lock on a spaceship you need to have an ABS vacuum tight yeah tight you know what I mean yepd talk a weird show Let's Get It On Track I'm going to start this week okay uh if you're wondering at home we have four topics of course because some many sending one to patreon.com we'll get to that later uh I want to start with something I was out of town on",
      "start": 776.44
    },
    {
      "text": "this week okay uh if you're wondering at home we have four topics of course because some many sending one to patreon.com we'll get to that later uh I want to start with something I was out of town on Friday okay had to go to Canada yeah didn't have to go wanted to go chose to go for a charity event this charity event went played there gam watch live you can still catch it at twitch.tv/ gam watch live uh raised a whole bunch of money with a whole bunch of other people for the uh British Columbia Children's Hospital no it just you it was just you just pretty much that's what they said $1 0 million you raised for just that I think it was $8,000 that's what it came up to okay um but raise L money playing Mario Kart 64 while I was in the while I was in transit on Friday though they announced what and they showed I guess announc it they showed Aquaman yeah from Batman v Superman yes everyone knows Aquaman Aquaman everyone knows I'm the biggest DC Comics fan on the internet right I say that",
      "start": 815.24
    },
    {
      "text": "and they showed I guess announc it they showed Aquaman yeah from Batman v Superman yes everyone knows Aquaman Aquaman everyone knows I'm the biggest DC Comics fan on the internet right I say that all the time don't believe me I have this and that that's Supergirl right I hate you signed by bab star and you're going to insult me that way uh no big fan of course of the DC Comics and it got me thinking first off I want to know your reaction Nick because I know you're a movies guy Colin your reaction to Aquaman Jason Mamoa here what he's going to look like and then I want to talk a little bit about the DC Cinematic Universe in general Nick you begin I haven't talked to you at all heard any well obviously I mean we've gone back we've talked about this a lot there Zack Snider's trying to do what Jos Weeden did with the with the Marvel Universe what Kevin F is doing with the Marvel Universe and I hope it works I want it to work I I mean I've said this before I like the Marvel Universe better",
      "start": 850.8
    },
    {
      "text": "Jos Weeden did with the with the Marvel Universe what Kevin F is doing with the Marvel Universe and I hope it works I want it to work I I mean I've said this before I like the Marvel Universe better I like Batman the best like Batman is my favorite superhero sure but I like the Marvel Universe better and the reason I like is because I'm a very fair weather fan they're doing better projects they're doing cool stuff and like I don't give a **** about Iron Man I never did but I like Iron Man movies because guess what they're good and they're entertaining um Robert Jun they got Robert D Jr the interesting casting choices interesting stories great great uh special effects and just over all around great popcorn flicks um so I want Justice League to be better than Avengers I I don't think it will be because you want them to keep out doing each other yes 100% like competition breeds Excellence right so like all these guy and right now you better you better know that Zack Snyder has a damn",
      "start": 892.96
    },
    {
      "text": "will be because you want them to keep out doing each other yes 100% like competition breeds Excellence right so like all these guy and right now you better you better know that Zack Snyder has a damn chip on his shoulder after Man of Steel it was a decent movie but it was so so so uh well was mixed review but everyone after that first trailer you're like this is going to be the best moov ever made sure that trailer made me cry for Christ sake so imagine my you know surprise when I got to the end of the movie and I was like huh I should have liked that more I like yeah but that I should have liked it more um so Flash Forward now to what he's trying to do with um Wonder Woman uh Aquaman I guess Martian Manhunter is that that's getting a film as well right yeah but not in this not inside of this movie or um wait is he getting his own movie I that doesn't sound right Kevin do a fact check on that getting his own movie cyborg cyborg cyg he is getting a movie I remember that from I'm pretty",
      "start": 932.08
    },
    {
      "text": "movie or um wait is he getting his own movie I that doesn't sound right Kevin do a fact check on that getting his own movie cyborg cyborg cyg he is getting a movie I remember that from I'm pretty sure he is he has to be J Jones has to be J it has to be vanan Jean Jean valan yes which is crazy because they stole the character what did you think Aquaman uh what do I think the look of him or one image not not no not Aquaman the the seven for seven or what did it say unite the seven seven planets seven rings of hell uh it's Jason Mama it looks like I think the caption I read on uh The Verge or I 9 said it looks like C Drogo yeah just underwater Trident with the Trident yeah and that's Jason Mamoa I mean the I I like the guy I think he's perfect for for a c Drogo style role I haven't seen much range come from the guy so we'll see this is his first time he we actually get to see him act I watched Conan the Barbarian the remake for about 5 minutes for I was like that's bad if you couldn't",
      "start": 970.32
    },
    {
      "text": "range come from the guy so we'll see this is his first time he we actually get to see him act I watched Conan the Barbarian the remake for about 5 minutes for I was like that's bad if you couldn't watch it I couldn't watch it I couldn't well I couldn't get through it and it wasn't bad I just I was I made the Cardinal mistake of uh watching it with my wife my wife makes takes every bad movie and makes it instantly 50% worse cuz she actually goes why are we watching this if she's out of the room and I'm watching it by myself I'm like oh I guess that was kind of cool and it just becomes better yeah like I can't watch any of my my my cheat shows with her this reminds me of **** Spring Breakers which you somehow convinced me to watch by saying it was good tricking me spring break no so I W I start this movie and Christine from the the jump is like this looks dumb I'm like no Nick says it's all right let's watch it and we get in and she's like this is terrible and I'm like M Nick says",
      "start": 1019.16
    },
    {
      "text": "W I start this movie and Christine from the the jump is like this looks dumb I'm like no Nick says it's all right let's watch it and we get in and she's like this is terrible and I'm like M Nick says it's like by the time I'm like no this is really bad I'm like let's turn it off and then she flipped it she's like no we're committed now now we're going to get that's how it becomes good no that no it did we did not come back around did you get to the part where James Fran's like look at all my **** I got all this **** and then for like 15 minutes he's like I got nunchucks I got a uzi look at my switchblade that's all he say it's like 15 minutes it's amazing uh no unlike that he looks cool I I you know I don't know how they're going to make an Aquaman cool a movie cool you see your man underwater but are is are they going to have the majority of the movie be underwater or is it going to have to be him coming to the he's going to have to come out and talk to Superman right like like",
      "start": 1059.16
    },
    {
      "text": "underwater but are is are they going to have the majority of the movie be underwater or is it going to have to be him coming to the he's going to have to come out and talk to Superman right like like at a certain point if you're if you're going unite the seven I'm assuming that's a reference to uh the Justice League right yeah or the seven se's what maybe it's his motivation but yeah okay it could also be it could easily be yeah if they start putting out more if they put out the Wonder Woman poster it says unite the seven then you're going know it's the the seven were there were seven original members of the Justice League or that yeah so that's kind of maybe it's a cool double anandra for him what did you think Colin not being a comic book movie comic book fan enjoying the occasional comic book movie most notably The Dark Knight Rises uh first of all uh Kevin what's the verdict on Martian Manhunter I I couldn't find anything saying that it has been officially announced they they",
      "start": 1101.2
    },
    {
      "text": "comic book movie most notably The Dark Knight Rises uh first of all uh Kevin what's the verdict on Martian Manhunter I I couldn't find anything saying that it has been officially announced they they didn't I could have sworn that was one of the five movies or so it may happen I'll look at the DC did you you Google the DC movie slate I could have sworn that was one of the movies in that in that slate we're on it everybody don't worry we'll look it up I I they they announced literally like 20 movies exactly that's why it's confusing it's confusing there has to be a Martian Manhunter movie at has be yeah there is not Batman versus Superman Suicide Squad Wonder Woman J J leag one The Flash Aquaman Shazam Justice League part two cyborg Green Lantern Jesus Christ how Mar man not get into that mix of he's not a very I mean save it for the save it there's two parts to this question I want to know the first part uh all right so uh Aquaman to me has always struck me I don't know a goddamn thing",
      "start": 1132.48
    },
    {
      "text": "of he's not a very I mean save it for the save it there's two parts to this question I want to know the first part uh all right so uh Aquaman to me has always struck me I don't know a goddamn thing about Aquaman but he always struck me just aesthetically as a very old superhero that is irrelevant so it's interesting that like DC has a lot of old superheroes that are irrelevant and I think that they're trying to make them Rel I don't mean that is ative really they do have a lot of old completely irrelevant they have like completely **** irrelevant superheroes so it's like with the exception of like Batman and a couple like Superman maybe like a couple others they're trying to make themselves cool like yeah uh Marvel is yeah and I agree with you oh jeez that I think Batman's my favorite too I love Batman's the only superhero I really even care about at all like where I'm like I like Batman I know something about Batman is it because of Batman or is it because that he fights aesome I",
      "start": 1174.84
    },
    {
      "text": "too I love Batman's the only superhero I really even care about at all like where I'm like I like Batman I know something about Batman is it because of Batman or is it because that he fights aesome I no I've always well Batman's villains are some of the best part but I've always liked Batman even since I was a very little kid like I never read the comics or anything but starting with 89 Batman all up I actually really even love the campy like weird ones too sure I just they have their place and I I think Batman's always been relevant to me my entire life which I thought was weird because nothing else in the superhero realm was relevant to me mostly because Superheroes Were largely irrelevant when we were growing up they were in the 80s and 90s no one gave a flying **** about superheroes so it it's like it Batman was really no and I don't mean that like I know I know exactly what you're saying I agree I agree a nerd and you were a clait nerder you just made fun of with the exception",
      "start": 1212.36
    },
    {
      "text": "so it it's like it Batman was really no and I don't mean that like I know I know exactly what you're saying I agree I agree a nerd and you were a clait nerder you just made fun of with the exception of Batman like who G who cared you know like no one so it's like that wasn't something that was was injected into me like other things from our pop culture as kids you know I'm 30 years old now so growing up in the'80s and 90s like there was just whatever GI Joe and whatever the hell we were watching so watching this adapt and watching DC and Marvel kind of go at each other and I really feel like maybe I'm wrong but I really feel like it started with like X-Men and Spider-Man um when I was in high school and then the movies X-Men started it yeah yeah and then and then DC kind of got in on the ACT and then Marvel kind of went back and then Marvel's obviously been winning this fight for a long time exception with the exception of Batman which I think are better than any of movies I've seen",
      "start": 1243.64
    },
    {
      "text": "ACT and then Marvel kind of went back and then Marvel's obviously been winning this fight for a long time exception with the exception of Batman which I think are better than any of movies I've seen by far and um I think that like I would prefer that's I understand DC has a slate of movies and therefore must concentrate on making this this slate of people relevant Again part of me wishes that they would just narrow it down to two or three people like maybe Batman Superman someone else and be like let's really work on Batman let's really work on Superman let's not like I don't even know who the hell half the people are that you just said you know what I mean like that's probably the wrong idea Aquaman falls into that camp for me because he always seemed like an antiquated superhero that said I had no idea they were releasing anything for Aquaman until you know it was when Alexa from Gamespot was on Colin and Greg live with us that was last Friday and we looked at the picture and I had",
      "start": 1280.52
    },
    {
      "text": "I had no idea they were releasing anything for Aquaman until you know it was when Alexa from Gamespot was on Colin and Greg Live with us that was last Friday and we looked at the picture and I had no idea that they were doing anything about it. I'm like this looks pretty cool not in a sense that it's a movie I want to see because I would probably not see it but because they did a nice job making Aquaman look entirely not like the Aquaman I see in my head which is with the green and the orange and the yellow with his he's a white guy with blonde hair right ex and like so now he he looks like he's like a Pacific Islander uh he's got what I really thought was cool is that his outfit was kind of seamless Al and I talking about this his outfit's kind of seamless where he has like tribal looking tattoos that are actually the outfit for the most part yeah they look they look like scales yeah it's tattoo it's cool like I was like yeah whoever they designed to make or whoever they hired to make",
      "start": 1317.76
    },
    {
      "text": "tattoos that are actually the outfit for the most part yeah they look they look like scales yeah it's tattoo it's cool like I was like yeah whoever they designed to make or whoever they hired to make that design uh pretty ingenious. I don't know if you can do any better than that for Aquaman you know um and I think that that unless you want to go in a super campy Direction which is has its place I mean that's what I that's the way I wanted G.I. Joe to when they made the G.I. Joe movies. I'm like just have it out of control like like you know when they made I remember talking to Hillary and other people when G.I. Joe came out in 2009 and everyone's like well what do you you know this was my superhero movie and I was like well what do you what do you want out of this and I was like I want them to go so all in on old G.I. Joe that the opening sequence is the Statue of Liberty fight from the G.I. Joe movie in the 80s and just recreate that with real people and if you do something like that that'd be",
      "start": 1355.76
    },
    {
      "text": "go so all in on old G.I. Joe that the opening sequence is the Statue of Liberty fight from the G.I. Joe movie in the 80s and just recreate that with real people and if you do something like that that'd be dope that would be dope like and you just have the colorful vipers and Cobra commanders in his blue Garb and Destro in there instead of like making it all real that's the direction I wanted that to go in and they've gone with Aquaman it seems like in the exact opposite direction more the direction G.I. Joe went in which is to make it grounded now here's the thing that now here's where we springboard off okay springboard with me I saw this thought it looked really cool cool started getting getting excited were you springboarding there I'm sorry spring youed there go started getting really excited right and then I remember of course it's it's similar to when they revealed Batman and when they revealed Wonder Woman and when they did the really cool Comic-Con presentation I had to watching a",
      "start": 1390.28
    },
    {
      "text": "right and then I remember of course it's it's similar to when they revealed Batman and when they revealed Wonder Woman and when they did the really cool Comic-Con presentation I had to watching a shaky iPhone because God God forbid they put this God forbid they put that up God forbid only God forbid so anyways I saw that and I remember getting super excited then but temper my expectations right and saying well remember though this is the sequel the Man of Steel for all intents and purposes this that was a movie that I didn't walk out going what an awesome movie I walked out going that wasn't what was sold to me in the trailer and like this is a different thing and blah blah blah blah but something interesting happened with the Aqu aman it gets me excited and I start to feel that way but then I I I changed my mind I I I I pivot right Aquaman for me now is the Line in the Sand if you will it's exhibit I guess D that this is the DC Universe you know what I mean I was I had I was on this",
      "start": 1428.92
    },
    {
      "text": "I I I changed my mind I I I I pivot right Aquaman for me now is the Line in the Sand if you will it's exhibit I guess D that this is the DC Universe you know what I mean I was I had I was on this podcast the Quiver podcast about the movie Arrow not qu ivering and what was quivering Olly Olie's member Theo was watching anyways uh we're having this conversation and it's the fact that I think Man of Steel misfired for me based on expectations and I think it was expectations set by the trailer this inspiring score the kid in his white shirt with the red towel the fact that we haven't seen Superman in forever and when last time we did see him he was such a dismal disappointment and then you see this trailer and you're like this is it this is redemption they get it what they're going to do get it and so you come in expecting your traditional Superman story he's going to be this inspiring guy all this different stuff and then instead you get this sci-fi movie s Al movie right you get a Sci-Fi",
      "start": 1469.84
    },
    {
      "text": "and so you come in expecting your traditional Superman story he's going to be this inspiring guy all this different stuff and then instead you get this sci-fi movie s Al movie right you get a Sci-Fi alien movie which isn't bad but again on the misfire of expectations and I went an interesting way with this Man of Steel film uh saw it at a pre-screening through Warner Brothers saw it an opening night at midnight and then stopped going to see it said I'm not going to go see this movie anymore I'm gonna I'm gonna stew on it I'm gonna think about I'm G to decide what I want to do when it came to DVD I I asked aloud to Christine do I want to buy this movie she said no you wouldn't asked that question if you wanted to I said good call I didn't buy the movie True and then I kept stewing and the reason did this is because if you remember Superman Returns I saw it opening night and then I saw it three times that weekend I saw it a million other times bought the DVDs watched them blah blah and",
      "start": 1519.72
    },
    {
      "text": "reason did this is because if you remember Superman Returns I saw it opening night and then I saw it three times that weekend I saw it a million other times bought the DVDs watched them blah blah and literally two months into owning the DVDs I'm watching the movie and I'm talking to the girlfriend at the time and I'm like oh this is like watch Kate Bosworth line delivery here she's so stilted and what is and then I was like oh whoa I don't like this movie yeah holy crap I don't I haven't given myself the second to stop and think do I like this movie at all before the Aquaman stuff comes out before I go to Canada I catch the end of Man of Steel on HBO watch it from you know pretty much the Midway point the punch harder point exactly which was resonating in my head when we've talked about why Batman resonates in Superman doesn't right and picking it up there being back to pretty much zero expectations I enjoyed myself I was like okay I still think Henry Cavill looks like an awesome",
      "start": 1556.6
    },
    {
      "text": "why Batman resonates in Superman doesn't right and picking it up there being back to pretty much zero expectations I enjoyed myself I was like okay I still think Henry Cavill looks like an awesome Superman there's still plenty of problems with the movie don't get me wrong I'm not I'm not sliding all of that but like I've never been one to fall in spoilers we're putting on this the Mana steel spoiler this is Now official Colin and I have established this if you didn't know this is for you now anytime there's going to be spoilers in one of our shows we'll tap our hat and say there's a spoiler alert and then when you see us tap our head again our hat uh you can know you can come back so we're doing the Mana steel Sports when what if you forget to tap our head for the whole episode we finally tap well I won't you might okay what if I scratch my head right now it's going to be me I have to tap my head that doesn't count that doesn't count that didn't count I have to unt ap my head that the",
      "start": 1595.32
    },
    {
      "text": "tap well I won't you might okay what if I scratch my head right now it's going to be me I have to tap my head that doesn't count that doesn't count that didn't count I have to untap my head that the you can't someone else can't untap the head the head it has to be tapped no no not sorry continue no everybody got all bent out of shape with how many people died in Metropolis and that oh Superman would never let that many people die and and I thought I thought it was an interesting choice for sure don't get me wrong yeah but what I come back to all the time and I've mentioned on this show before right is that when I started reading the comic book Invincible right there's scenes in there where Mark is fighting people and getting blown through buildings and he's saying stop stop stop we're killing all these people around us right and that was the first time I ever thought about that even though that wasn't mentioned in the Superman Doomsday fight you know what I mean that was happening",
      "start": 1634.04
    },
    {
      "text": "killing all these people around us right and that was the first time I ever thought about that even though that wasn't mentioned in the Superman Doomsday fight you know what I mean that was happening people were dying people were getting crushed and all this stuff so when we sit here and then want a grounded superhero film right what what did Batman the Batman Begins or whatever you want to call them the Nolan Batman's do so well they grounded Batman right they made it realistic that's what they're doing right now still with Man of Steel in the DC Cinematic Universe and so now having that expectation I think pulling away from it I start to get excited about Batman v Superman again and I think I'm I can legitimately be excited and not have to make excuses for it here and there in the fact that yeah this is an elor tale right like if it was Superman and his bright Reds and bright bright blues that his mom made he'd be saving everybody and nobody would die and there'd be happy endings",
      "start": 1669.8
    },
    {
      "text": "that yeah this is an elor tale right like if it was Superman and his bright Reds and bright bright blues that his mom made he'd be saving everybody and nobody would die and there'd be happy endings for everybody right but this isn't that this is supposed to be a modern interpretation of what would happen if these superheroes came to Earth and this sort of things this sort of thing started to happen yeah I mean and we've seen that story already right we've seen this yeah for the last how many years 50 60 something like that like what 80 now 8 Jesus we hit 75 a while ago so you know I think everything nothing nothing comes about in vacuum right so all every time you develop a script or you develop any of these projects you're clearly looking at what what came before and say how do we iterate how do we make it better yeah Zack Snider looked at it and said okay well Nolan started this amazing world let's let's follow suit with it but I will say that you know to his uh discredit for Nolan",
      "start": 1706.92
    },
    {
      "text": "how do we make it better yeah Zack Snider looked at it and said okay well Nolan started this amazing world let's let's follow suit with it but I will say that you know to his uh discredit for Nolan I think he went a little too far into the real realm with Batman I think there were some things that I'm like I don't need every single aspect of this explained it actually kind of takes away some of the power of Batman and that um you did you forget I'm done I'm done with my Man of Steel spoilers um it's my thought process I'll do what I want you know uh so I mean I think Zack Schneider kind of fell fell prey to that which which sucks a little bit um but I think it's also that he just gets a bad rep the you know what I was thinking about the other day Batman Begins the the the Joker or not Joker I'm sorry Scarecrow releases the toxin it's coming up through the air everyone in the Narrows is going crazy they say over the intercom that people are tearing each other apart dozens hundreds",
      "start": 1744.08
    },
    {
      "text": "joker I'm sorry Scarecrow releases the toxin it's coming up through the air everyone in the Narrows is going crazy they say over the intercom that people are tearing each other apart dozens hundreds maybe thousands thousand of people are being killed in the streets of Batman Begins but nobody gives Batman **** for it's the poor people well Batman's different though I think isn't the expectation of Batman different the expectations Batman's not going to kill anyone but Gotham is way darker than Metropolis well I'm not I wasn't arguing about Superman killing in Man of Steel I'm just talking about the number of people killed the man it's the spoiler thing is all **** up I don't think I don't think that that's a well I mean I don't think that's an issue I mean that that was a direct uh correlation to like when everyone was talking about Avengers and what happened to the end of Avengers right where a number of people would have died there too but they don't that they show that well no",
      "start": 1784.56
    },
    {
      "text": "to like when everyone was talking about Avengers and what happened to the end of Avengers right where a number of people would have died there too but they don't that they show that well no they I mean there was news reports that came out jokingly that were like Hey we're going to calculate how much Devastation was that would actually have cost the city again it's cost trillions um you understand what I'm saying though do you understand that I think the I I don't remember there being people that died I don't remember them showing people that died in in Man of Steel well I mean oh yeah dude when the when the terraformer lands and starts sucking up there's clearly people getting pulled up and slammed back oh wow okay I didn't see and that was the problem people were having with it as if in Avengers when Captain America Avengers **** evacuate a block exctly but we're Miss I think we're missing the major Point not you know I'm a bit of a laming with Superman but you grounding something",
      "start": 1820.2
    },
    {
      "text": "Avengers when Captain America Avengers **** evacuate a block exctly but we're Miss I think we're missing the major Point not you know I'm a bit of a laming with Superman but you grounding something like Superman doesn't seem to be possible and so they shouldn't do it unless you want to rewrite the rules of who Superman is you know because Superman is inherently not ground he's from another **** planet and he has an unlimited amount of superow so like how can you like Batman made sense to be grounded but with Superman you should probably go in the other direction which is say if you want to make Superman relevant again to a large audience like The Avengers is relevant whatever then you need to go in a different direction whatever that means because you can't ground this character it's impossible I think it is possible and I think that's the whole thing is we can't have it both ways we're saying they have to go in a different direction and they've done they've done the red and blue",
      "start": 1855.56
    },
    {
      "text": "impossible I think it is possible and I think that's the whole thing is we can't have it both ways we're saying they have to go in a different direction and they've done they've done the red and blue very bright so the different direction is making it grounded in in trying to build the universe where Batman and him exist yeah but how but will they re like that's the thing I have a huge problem with this Batman versus Superman thing is like you know and it's not I love Batman but it's like Batman's just a normal person yeah but it's it's not going to build off the Nolan Universe no I understand that but like and they and they I think it was a huge mistake well I think well I think it was a mistake to stop the Nolan Universe even if you needed to get someone else to do the movies and not Christoph Nolan himself like they should have kept doing those movies but and I think that that would have been awesome those movies are **** fantastic know like they are fantastic all three of those",
      "start": 1894.76
    },
    {
      "text": "Christoph Nolan himself like they should have kept doing those movies but and I think that that would have been awesome those movies are **** fantastic know like they are fantastic all three of those movies are awesome they're great but they they screwed themselves out of doing more because they set Batman up as two human as too much of a frail human being as you know we only we didn't really see him go through that heart of battle but his body is wrecked and his knees are gone except for when he puts that fancy knee brace on that kicks really hard through yeah but that's why you get Robin or Nightwing or whatever and and I thought that that's what they were doing at the end of that movie and they might still but at the same time like let's be perfectly honest Batman's Batman like there's no substitution for it I don't want to see I don't want to see J good and Lev be Batman I want to see Batman but what was the star of Batman because of the Nolan Batman's cuz to me it was not Batman",
      "start": 1927.12
    },
    {
      "text": "no substitution for it I don't want to see I don't want to see J good and Lev be Batman I want to see Batman but what was the star of Batman because of the Nolan Batman's cuz to me it was not Batman it was it was the villains in the world that to me was the was the the biggest mistake of that whole series was that it was not a those if you go back I've said this before on the show but if you go back and look at Dark Knight it's is not a Batman movie it's a Joker movie it's not about Batman it's about everyone trying to stop the psycho killer it's it's more like science of the Lambs where it's like the main character the person you're like like terrified of and fascinated by his Hannah Lector and and Buffalo Bill not not necessarily uh uh agent Starling uh it puts the Lo in the basket I remember I sent you that video I was just watching it one day and I just took a clip of that and just sent it to Nick like at like 2 in the morning texts me Random clips at 2: in the morning and it's",
      "start": 1964.12
    },
    {
      "text": "remember I sent you that video I was just watching it one day and I just took a clip of that and just sent it to Nick like at like 2 in the morning texts me Random clips at 2: in the morning and it's just like boom I'm falling falling would you have sex with me that have sex with me he doesn't say that he says the f word yeah you're not censored here say whatever you want it's fair enough um but to me that's see that's the problem with Superman like I would like for them to somehow establish I know that there's different continuities and universes whatever yeah but they need to redo this character in a in a way that makes him not the 1930 archetypical superhero that yeah like that's Godlike cuz he is and that's and that's a huge problem you know that I really think that's a huge problem for Superman and like why I think people have a hard time relating to him because like why because you have to write stories that somehow make sense like I have no idea how they're goingon to write",
      "start": 2001.24
    },
    {
      "text": "for Superman and like why I think people have a hard time relating to him because like why because you have to write stories that somehow make sense like I have no idea how they're goingon to write Batman versus Superman or whatever and make it have it make any **** sense because Superman should be able to take Batman and just snap him in half and that would be the end of it you know what I mean like that they don't they shouldn't exist in the same universe they can't but Superman Batman's useless in Superman's universe he should be right so a good job if you watch like and this is this is where I kind of uh I would hope that they do a little more research and go back and watch the original Justice League cartoon right that's a great way to show how all these characters can exist you don't necessarily have to have Superman coming in saving the day although more often than not that's exactly what happens in the series but Batman is the character ass kicked a lot actually oh I guess",
      "start": 2045.84
    },
    {
      "text": "necessarily have to have Superman coming in saving the day although more often than not that's exactly what happens in the series but Batman is the character ass kicked a lot actually oh I guess he does um Batman is the character that figures it out Batman's the character who's the master strategist and like when there's 15 things happening he's sitting up there in the uh in the Justice League uh uh Watchtower Watchtower um figuring out where to send everyone what's really going on Superman is sort of the the broadsword he's the tank that you send in first where Batman is like the general behind it and that's generally how they go Batman is Batman's just a fascinating character and he figures out like I honestly believe in the world if those two were real Batman would figure out how to beat Superman 100% of the time he just would figure it out um true hands down if you put those two up against each other he would win what what I'm more fascinated with than spoilers can I any dead okay",
      "start": 2082.48
    },
    {
      "text": "Superman 100% of the time he just would figure it out um true hands down if you put those two up against each other he would win what what I'm more fascinated with than spoilers can I any dead okay everything's dead you know when you go back and look at the Dark Knight Returns the Frank the iconic Frank Miller series that's how those two characters should exist together that is a riveting story about how Batman it's a Batman story it's called The Dark Knight Returns but it's about Superman it's about bringing Superman back into the fold and making him what he once was so that he can stop the chaos that's happening in the world and stop this like sort of like totalitarian government that the United States has become stop Ronald Reagan stop Ronald Reagan but in this in this instance Ronald Reagan is BAS basically like in this story uh Superman has become sort of a tool for the American government is going and fighting our Wars for us which is not what Superman is and Batman realizes",
      "start": 2116.4
    },
    {
      "text": "Reagan is BAS basically like in this story uh Superman has become sort of a tool for the American government is going and fighting our Wars for us which is not what Superman is and Batman realizes that and they craft Frank Miller crafts this amazing story where like you don't really know why Batman's coming back that much but he is coming back and he's making this crazy Resurgence and he's like Gathering an army behind him and it turns out that the that you know part of the reason why he's doing that is is to wake Superman up and like he goes and they have that they have and that's what was so cool about that footage that you saw from Comic-Con it was it was that exact where he's in the suit and he's looking up at him and Superman comes down and they're about ready to fight and you're like I know the reason they're fighting isn't a one to one uh to see who can win there's got to be something deeper than that Batman would not fight Superman unless there is a reason a very very profound",
      "start": 2156.84
    },
    {
      "text": "I know the reason they're fighting isn't a one to one uh to see who can win there's got to be something deeper than that Batman would not fight Superman unless there is a reason a very very profound and important reason for him to put his life in that in that specific spot and if you go back and read The Dark Knight and I already spoiled 90% of it but please read it anyway there is a great reason why and it's awesome awesome yeah um what I would hope with Aquaman is that it's like Iron Man for me whereas I did not give a **** about Iron Man there was zero expectations so me the bar was set at ground level and when I came in I'm like want blown away I want to be blown away if they play this right I think it might actually not do what Spider-Man 3 did and self **** destruct because there's too many storylines if they because you figure you're introducing Lex Batman Wonder Woman Aquaman cyborg I'm sure I'm leaving someone out but you have these five characters who are going to be",
      "start": 2191.92
    },
    {
      "text": "too many storylines if they because you figure you're introducing Lex Batman Wonder Woman Aquaman cyborg I'm sure I'm leaving someone out but you have these five characters who are going to be introduced right flash going to be in this one no at least not that we've heard of and then four of those five are getting their own movie you know what I mean so you can put these people in there a lot we we can just be on Superman's side of like who the fu what is Aquaman's deal who knows maybe he pulls in he comes in and it's just like a X-Men days of Future's Past and he's the Quicksilver yeah who's **** awesome and we didn't get a huge backstory on right we met his mom that would be probably ideal exactly drop all these characters in there that are **** rad and beating the **** out of everybody and then make us want to know more when there's solo movies don't bog it down by asking a million questions and trying to explain everything which is what they're going to do with Wonder Woman",
      "start": 2234.08
    },
    {
      "text": "and then make us want to know more when there's solo movies don't bog it down by asking a million questions and trying to explain everything which is what they're going to do with Wonder Woman I have a a fear of I have a fear that they're going to do that too and the reason the reason why uh Marvel was so smart was that they they did all the Standalone movies to build up to it and so by the time we by the time we got to the Avengers the reason that movie was so powerful is because we already know these characters we already loved these characters we've already seen these characters go back each one of them and so they come together and you can you can just have fun watching them interact like when you were a kid when you were used to play with your toys and you put uh you know the Hulk in the same room as Iron Man and Thor and like you you you would be fantasizing about how these characters would interact with each other we get to see that which is awesome now here's the interesting",
      "start": 2274.96
    },
    {
      "text": "the same room as Iron Man and Thor and like you you you would be fantasizing about how these characters would interact with each other we get to see that which is awesome now here's the interesting thing though right I don't are is are is the DC Universe Cinematic Universe supposed to be fun I don't think it is cuz when I left Avengers smiling ear to ear I had such a great time I think by going grounded by showing destruction by doing all these different things you're not going for fun necessarily you're going to try to make these interesting sci-fi movies well you know I don't I don't think they know and I think this is the I think this is why they're trying to bring Zack Snider in and have him be uh sort of a a Godfather of the series because at the end of the day you need someone you mean no one is the Godfather oh I'm sorry Nolan did I say SNY well Nolan SN Snider connection I guess it's more like Nolan I mean Snider's directed the first two films here of this universe I mean he's",
      "start": 2308.76
    },
    {
      "text": "no one is the Godfather oh I'm sorry Nolan did I say SNY well Nolan SN Snider connection I guess it's more like Nolan I mean Snider's directed the first two films here of this universe I mean he's more than a God but I guess Nolan is is sort of the one who's executive producing all and he's coming in and he's you need someone who understands like you basically need someone who can come in as sort of showrunner or executive producer that can say look I am overlooking this entire universe yeah it is really going to when I'm when I'm saying all we're developing all these stories what I'm really saying is you're developing these stories in line with my vision for what the whole universe is supposed to be that's what Marvel does so brilliantly with Kevin **** uh **** over there he's uh their lead of development and he is the one that they call in when Disney's like we're making more movies he gets final say on what's what's going on with all of them so you have to imagine his sort of",
      "start": 2350.32
    },
    {
      "text": "lead of development and he is the one that they call in when Disney's like we're making more movies he gets final say on what's what's going on with all of them so you have to imagine his sort of vibe is fun yeah you know serious at times but mostly this is a comic book movie so it should be fun and we should have characters that are quippy back and forth to each other and witty back and forth to each other and really flushed out they haven't had that opportunity yet because they're a little behind the curve I don't but I don't even think that's what they're going to go for I don't think that's at all because I mean just think about Avengers Avengers is saturated color and bright and fun and you leave excited and happy and the good guys win whereas I feel like the DC Universe is not building that it's building this ground completely opposite to where those two how those two comic books companies came up from each other like Marvel was always the one that was known for like that we're",
      "start": 2387.8
    },
    {
      "text": "that it's building this ground completely opposite to where those two how those two comic books companies came up from each other like Marvel was always the one that was known for like that we're going to deal with some pretty flawed characters and DC happy gol lucky like Batman or Robin yeah that yeah that's a good point yeah Marvel's characters were always very humanized right like different but I mean like just looking at the color palette of the Aquaman teaser image is like black and white it looks like you know and that's what I would describe when I when I think of Manny seal having watched it right not going into it but having watched it that is the color palette of it and that's what that Universe looks like it's going to be moving forward yeah they made they made a conscious choice to make it more serious and I think that was probably a contor to depart from um you know they did it with they did it with Superman Returns too if you go back and look at that even his outfit is",
      "start": 2422.24
    },
    {
      "text": "to make it more serious and I think that was probably a contor to depart from um you know they did it with they did it with Superman Returns too if you go back and look at that even his outfit is muted tones yeah right I like that you know I don't like it either um and I think they did it as a as they they were looking probably at the landscape and they were like what tonally should this movie be well should it be more like the Christopher Reeve Superman or should it be more like the thing that's some of the highest grossing movies in our catalog which was the Batman movies which were super dark and kind of **** up like you look at the Joker you look at Bane like people getting their heads snapped there in that world death is a real thing a very very real thing where Batman has to deal with it and that makes sense for him not to kill um I will say this though the um I don't remember anyone dying specifically or being like straight up murdered in any of the Marvel movies I'm sure",
      "start": 2454.76
    },
    {
      "text": "with it and that makes sense for him not to kill um I will say this though the um I don't remember anyone dying specifically or being like straight up murdered in any of the Marvel movies I'm sure people die I think Captain America kills people Coulson he was killed by a bad guy I'm talking guy I think I think Captain America shoots people but I don't really remember yeah Iron Man shoots off rockets and **** all the time I guess so um that doesn't that but again they don't dwell on it they don't make it as like a set piece of yeah wait Captain America kills people too he's a soldier he's got to be right he's killing the **** out of see I those don't those don't pop into my brain quite as vividly as uh one SC Superman yeah that last scene and I think that was just tonally they're off a little bit hopefully they can get back on track all right I think this is the tone and I'm accepting of it now interested to see where the tone good the Tone's good the characters is the problem the",
      "start": 2492.56
    },
    {
      "text": "little bit hopefully they can get back on track all right I think this is the tone and I'm accepting of it now interested to see where the tone good the Tone's good the characters is the problem the tone is not the problem that's true and I think that the the more serious and grounded tone is going to be more successful if all things were equal but they're not because they don't have characters that's that's you know mean that's that's that's the major **** problem you know like they like people really do is it the characters or is it the actors CU like I look at I I don't think it's the actors but when you say when you say Iron Man the reason Iron Man was so good was Robert Danny Jr sure but someone else could have done that Iron Man it's not it's not like it's not maybe not the C yeah John C could have done Iron Man not not in the same way necessarily it's just like you would never know because that is you're painted Now by that being Iron Man but they could have put someone",
      "start": 2530.68
    },
    {
      "text": "yeah John C could have done Iron Man not not in the same way necessarily it's just like you would never know because that is you're painted Now by that being Iron Man but they could have put someone else in Iron Man movie been totally fine it's just a matter of a matter of and it could have been bad too I really think it's the it's as someone who's kind kind of comes from the outside with comic books that is the identifiability of the characters that's true you know and they don't have like like Batman and Superman are basically it you know in terms of think Wonder Woman Counts not for this generation maybe maybe for like a different generation and an older generation I don't think Wonder like I never even I never heard I'll be honest with you growing up as a kid and I used to collect like superhero figures and stuff I was in I was in Marvel for like a little while like in the mid 90s because my brother and I used to collect like the X-Men figures and stuff I don't think I ever heard",
      "start": 2569.04
    },
    {
      "text": "superhero figures and stuff I was in I was in Marvel for like a little while like in the mid 90s because my brother and I used to collect like the X-Men figures and stuff I don't think I ever heard anyone say the words Wonder Woman until I was at IGN so so like that was in love Linda Carter yeah so like it was like I never like heard those words amongst my group of nerd friends well we talk about Superman and Batman and whatever X men and Stu like that and I think that that's so just from the outside it's like I actually think both these universes are doomed ultimately to implode upon themselves because they're just there's too much **** going on with all these movies and and they cannot possibly sustain it but I think that in terms of excitement it makes sense why people are more excited about um Marvel because of the characters because it's not very often that you find a piece of fiction where you're excited about the universe over the characters I think for some reason what came",
      "start": 2605.08
    },
    {
      "text": "about um Marvel because of the characters because it's not very often that you find a piece of fiction where you're excited about the universe over the characters I think for some reason what came to my mind the most was the road you know the McCarthy which is about the it's not really it's about the father and it's also about that **** up world you know and I actually think that with DC it's actually more about those **** up worlds and the villains you know like Batman himself is not even that interesting it's just like that un like that universe is interesting yeah he's like the master detective and stuff like that it's awesome but it's really The Joker and and all these characters that are like like the people that like are are as foils that I think are even more interesting so I hope that they're able to to focus on that more because who knows like what the relevance of Aquaman is going to be probably not very my gut tells me not very relevant I and and to your point Greg I",
      "start": 2639.16
    },
    {
      "text": "hope that they're able to to focus on that more because who knows like what the relevance of Aquaman is going to be probably not very my gut tells me not very relevant I and and to your point Greg I think I hope that they introduce him in such a way that's a little more organic and a little less we need to explain every single aspect my my my big hope is that they don't do sort of the let's go on an adventure sort of movie where it's like uhoh we're at a we're at an impass what do we do oh look it's a guy that just came out of the ocean it's Aquaman let's talk to him he helps us solve this one little bit maybe we'll recruit him to the team later um it is hard and they haven't you know with the exception of Avengers no one's really done an ensemble cast well so I don't know get out of here X-Men the f I mean I I still stand by the fact that those were Wolverine movies they were Wolverine movies and he was he was the main character and everyone else was sort of Side characters I X-Men",
      "start": 2673.72
    },
    {
      "text": "X-Men the f I mean I I still stand by the fact that those were Wolverine movies they were Wolverine movies and he was he was the main character and everyone else was sort of Side characters I X-Men Last Stand was probably the best Days of Future Past wasn't an ensemble cast per se I mean you're not seeing the X-Men come together it was him uh Beast and Professor X and they were trying to fight the three other different the future yeah um while listening to The Moody Blues record Days of Future Past exactly um you know those movies were good but those were more just cool stories told straightforward about some Comic characters character or people rather that just have to happen to have these sort of special abilities um yeah it's it's really hard and you're right there's with the DC Universe and especially these characters col there are there are less degrees of of gradation there with with the characters there's less there's less gradient to their to their sort of depth it just seems to",
      "start": 2712.12
    },
    {
      "text": "and especially these characters col there are there are less degrees of of gradation there with with the characters there's less there's less gradient to their to their sort of depth it just seems to be the nature of that Universe I mean and that's why I think going in that dark and dire and grounded direction is the only smart move to make you know like you can't if they try to be like like to see that I would too and if they try if they try to be like Marvel they will lose so like you cannot you cannot go in that direction you will lose you know I mean you will lose like easily you have they have nothing on Marvel in terms of in terms of character recogn like in terms of recognizing the characters in terms of fusing these universes together in terms of who's going first who had the idea originally to do all the **** was was marel you know so like DC is playing ketchup in all these different ways so you have to accept the status quo of these characters and either change who",
      "start": 2750.52
    },
    {
      "text": "idea originally to do all the **** was was marel you know so like DC is playing ketchup in all these different ways so you have to accept the status quo of these characters and either change who Superman is or make it so that he can you could wedge into more of a NL and Style universe is what these movies should do and that will differentiate them and then you have you give the same audience two different things because if you make this like that then they're going to compare this and that and this will lose you know what I mean because how can you out do The Avengers how can you outdo Guardians of the Galaxy all these things that people are **** nuts about you know it's not going to happen yeah I mean I think I really do and I I kind of you know looking back on it I think it was a grave misstep to try to fall fall I think it I think it was a misstep to try to fall in line with what Nolan set up I I would have liked especially since I would I would like to see a Batman movie that",
      "start": 2786.44
    },
    {
      "text": "misstep to try to fall fall I think it I think it was a misstep to try to fall in line with what Nolan set up I I would have liked especially since I would I would like to see a Batman movie that would have started this whole thing off that was a lot more Fantastical oh not me not me uh I would have loved to see not I don't mean campy I mean I want to see Batman do the things he does in the Animated Series I haven't seen that yet the Animated Series animated series is great I want to see that clay face the DC Universe should be more Fantastical it should make sense that Batman and Superman are in the same universe even though Batman's a dude he's Batman so there's something special about him we can't put our finger on it yeah he trains whatever it doesn't matter he's Batman we believe that even though he's a normal person he is really let's be honest he's **** superhero yeah like the guy has superpowers sure I want to see that I want to",
      "start": 2820.8
    },
    {
      "text": "even though he's a normal person he is really let's be honest he's **** superhero yeah like the guy has superpowers sure I want to see that I want to see him flipping around in the air I want to see him making that catch of the vial above the stadium and you know the Animated Series as he's swinging on the rope and tosses it over to Robin I want to see that sort of the high futin sort of um fantastic world and we haven't seen it yet I don't give a **** that Batman you know uh wears armor that's cool you know what's cooler to me that he never gets shot CU he's so fast he comes out of the shadows and just **** people up and goes right back into the shadows and you're like what was that was that a wraith was that the devil coming to tell me that I sinned no it was the Batman right um and so you know I'm waiting for that I would love to see like and you what's funny about that Zack Snyder directing a Batman movie would have been like that but maybe maybe that's what this will be yeah",
      "start": 2859.0
    },
    {
      "text": "and so you know I'm waiting for that I would love to see like and you what's funny about that Zack Snyder directing a Batman movie would have been like that but maybe maybe that's what this will be yeah we'll see 2016 yeah I'm I'm super interested to see I just I don't know man I just I don't agree with the sense that the ground the groundedness is what made those movies special like I said that I think that the campy stuff from the 90s with Batman was great and the Animated Series which I think was a fusion of the two which like of the 89 style and and the campy mid90 s style was was was awesome it was great but like bat I like Batman for the same reason I like Indiana Jones which is because like I wanted to be Indiana Jones you can and you and you felt like you could be Indiana Jones or could be Batman because he's just a dude with means you can't be Superman yeah see I think but see I think that real raw aspect fell apart toward the third movie it worked really well in the second movie",
      "start": 2898.8
    },
    {
      "text": "be Batman because he's just a dude with means you can't be Superman yeah see I think but see I think that real raw aspect fell apart toward the third movie it worked really well in the second movie not because it was a Batman movie because it had a great villain and a great an interesting really kind of messed up story um if you go back and watch Batman Begins he's a lot more he's a lot more sort of uh uh not Whimsical is a bad word but he's a lot less grounded in that movie than he is in Dark Knight in Dark Knight all he does is like he gets like he gets a cool new armor he's got the motorcycle want to be able to turn your head that was really it's it's spot on these days um I've been working on it workshops a lot of Morgan Freeman workshops I've been going to good yeah um but even you know when he does the airlift stuff I mean that's all very technical but it wasn't that crazy impressive um and then you it starts to fall apart when you when heo when he like does the grenade thing",
      "start": 2935.0
    },
    {
      "text": "know when he does the airlift stuff I mean that's all very technical but it wasn't that crazy impressive um and then you it starts to fall apart when you when heo when he like does the grenade thing through the window grabs the guy and air lifts out that wasn't Fant astical to you that was awesome it was it was cool that that was those were good parts it had good moments I will I will say that but it didn't it didn't have that I'm quite good the moment where he sort of looks over the Rachel do character and he's like you know he says the stupid line it's a dumb line right who you are makes you do it's what you do that makes you who you are like that's it word for like Bruce and he jumps you know he jumps off that balcony and he flies right he does the Batman sort of like cow spread flying you're like that's Batman that's so cool but then you know we brought it back so down to you know ground you know to zero as far as like you know 100% as far as realism is concerned with dark knight",
      "start": 2974.48
    },
    {
      "text": "you're like that's Batman that's so cool but then you know we brought it back so down to you know ground you know to zero as far as like you know 100% as far as realism is concerned with dark knight that when we get to a character like Bane that is so completely outrageous you're like what the **** is happening between these two characters and then it's like Bane can just do anything and it's like Batman like throw something at the dude use an explosive in your belt to blow this guy up do something I I don't I I don't well this K going forever I don't see how Batman or I don't see how Bane is any less or more grounded than scarecrow or Joker in those movies like they're all they're all just **** psychopath yeah but see the logic of the world what happened was they they kept trying to deal like logic logic logic right we're setting this character up so that he can legitimately do all these things we have to we have to abide by the logic that we're setting up and it just started to",
      "start": 3012.92
    },
    {
      "text": "deal like logic logic logic right we're setting this character up so that he can legitimately do all these things we have to we have to abide by the logic that we're setting up and it just started to just uh destroy itself as we went into the third movie nothing about that movie makes sense nothing about it is logical he breaks his back for Christ sake like he's a man that at the beginning of the movie can barely walk and then by the end of it he's up and fighting and things like that it's like yes brother there's nothing that they told me about Batman that would allow him to do that other than he's sure he's got willpower but at the same time he broke his freaking back you know yeah six months in traction in a freaking hole in the ground God knows where and he comes back and he's good to go I don't know all right Colin what's your topic that was how we feel like we've been talking for four hours we were talking for Kevin you can see it right there 52 minutes get a cup of coffee can I",
      "start": 3055.48
    },
    {
      "text": "go I don't know all right Colin what's your topic that was how we feel like we've been talking for four hours we were talking for Kevin you can see it right there 52 minutes get a cup of coffee can I get a what I love you uh my topic is uh God God and we've we've touched on religion on conversation with Colin and on the show several times um but what I want to talk about more succinctly with God God God God is God this fine what would so I've been all right so let me set up the stage for you a little bit thank you I was watching a debate between a creationist and uh an evolutionist I was listening to you watch that debate and one of the things that they brought up was what kind of proof would you need to believe in God because the evolutionary scientists not that all evolutionary scientists are are atheist but he was an atheist then there are some Catholic the Catholic church for instance accepts Evolution so it's not one doesn't necessarily preclude the other um and it got me to",
      "start": 3090.32
    },
    {
      "text": "are are atheist but he was an atheist then there are some Catholic the Catholic church for instance accepts Evolution so it's not one doesn't necessarily preclude the other um and it got me to thinking that that was always my stance was that I don't believe in God because as a man of Reason which I think we are in doubted with especially over the last few hundred years as we just understand so much more than we did we're very well owed is that we are well endowed yes no doubt about it is that we we understand and could use proof and we and we the face this thing F ham hack away sorry Colin I've been listening the whole time uh is that faith is the one thing that we take and we're like well you don't need proof and in fact if you need proof you don't have faith yep and I was like well that that never made sense to me as a kid because I was just like it's the C by as it's a it's a lose L situation well it just doesn't make any sense like We're Men of science everything around us is",
      "start": 3137.76
    },
    {
      "text": "that that never made sense to me as a kid because I was just like it's the C by as it's a it's a lose L situation well it just doesn't make any sense like We're Men of science everything around us is science this this this this microphone this camera this light like everything around here is the the embodiment of research and the embodiment of scientific understanding and the proof is in the pudding the **** microphone works the camera works the light works there it is you can see it you know the video is the proof of of it but God's one of those things where it's like well you're never going to know that God existed and they brought up a really interesting example and I never thought about this and I think you'd especially enjoy this because you went to Catholic School like I did for and I went for a little while you went the entire time which was I did too oh you I thought you went to public school I went to Catholic school till I was in fourth grade okay so you even learn ****",
      "start": 3182.48
    },
    {
      "text": "I went for a little while you went the entire time which was I did too oh you I thought you went to public school I went to Catholic school till I was in fourth grade okay so you even learn **** what did you what you get first communion get out of here first reconciliation I had to wear the world's like most cardboard uniform that and then on gym days on gym days did you have to wear like the sweatpants or the shirs days I had to wear cuz my Catholic school was cheap my mother didn't want to buy anymore I had to wear the same cardboard uniform so I just sweat through it and the thing didn't breathe so after like first your uniform to PE like you walk running around your in third grade PE was like just recess we didn't have PE in third grade okay but you'd go and you go to play kickball and by the time you were done like running one one of the bases you would just have just the sweat gross but the but the collar would still be starched it's amazing uh so one of the things that they",
      "start": 3216.04
    },
    {
      "text": "and by the time you were done like running one one of the bases you would just have just the sweat gross but the but the collar would still be starched it's amazing uh so one of the things that they said that I think we'd all appreciate and it was just interesting was that cuz everyone like God doesn't reveal himself but God did reveal himself a whole bunch of people yeah to like a lot of people and I never really thought about it in the sent it's not even not even that early I'm talking about like not even New Old Testament stuff I'm talking about New Testament stuff like people did witness go like Jesus's Miracles yeah and then the resurrection all stuff and for some reason I never thought about in the sense that like actually the whole like you know blessed are you who who believe without seeing is kind of **** because like those guys did see the guys that wrote that and said that **** did see yeah you know what I mean good point like and that was like and I I was like I was",
      "start": 3252.52
    },
    {
      "text": "seeing is kind of **** because like those guys did see the guys that wrote that and said that **** did see yeah you know what I mean good point like and that was like and I I was like I was like that was like a re like a revelation to me because I think pretty deeply about religion often and read a lot about it and I was like holy **** why did I never think about that like those guys they had are kind of Hypocrites and even even the guys that didn't see directly had signs right and and and at least primary sources for instance like the Bible wasn't written until Jesus was already dead for probably 100 years at least the New Testament and you know 200 300 AD or whatever but they had like primary sources like that they Trust like Josephus and stuff and then like people they knew or their friends were Apostle like as it got further and further out like there was no more proof anymore and that got me thinking like what nothing to show man what kind of proof would you need because",
      "start": 3290.08
    },
    {
      "text": "their friends were Apostle like as it got further and further out like there was no more proof anymore and that got me thinking like what nothing to show man what kind of proof would you need because the next time that God according to to the Bible according to Revelation stuff would appear is when the Earth's over over in trouble and and but see doesn't that that right there is like it just it all you know I used to go to Catholic school and there was there was a time fourth grade yeah there was and there was a time I was going to church every Sunday and partially the only reason I went was cuz my mom would take me to Cocos afterward and I would eat three to four of those little tiny jelly packets that they have I don't know what Cocos is Cocos is like a it's just like a restaurant chain but you know you know the little packets put your off yeah so that's how she got me out of bed uh which is why I was wildely overweight when I was a child I digress this going somewhere towards the",
      "start": 3328.0
    },
    {
      "text": "but you know you know the little packets put your off yeah so that's how she got me out of bed uh which is why I was wildely overweight when I was a child I digress this going somewhere towards the religion topic or just the Obesity it always it always just sort of occurred to me like you know when you get to make a club you get to make the rules um and to me the Catholic Church especially the Catholic Church seemed to me a a a club that was that had rules that were predicated around keeping people at Bay and keeping people uh from questioning from questioning right namely that if you don't have Blind Faith one day when he does come back and prove you wrong you get decimated this is the kill switch to religion or at least the Catholicism um is that by questioning even thinking these questions right you are in fact poking a giant hole in your own belief structure which then spirals you out of trouble and what what kills me is when you start looking into other religions like Scientology",
      "start": 3365.0
    },
    {
      "text": "right you are in fact poking a giant hole in your own belief structure which then spirals you out of trouble and what what kills me is when you start looking into other religions like Scientology um which is a religion it's more of a cult I guess but calling you find no more I don't want to go down that road no but what I'm saying is when you start looking into those I don't understand how you can look at that as a belief system and go those people are crazy and then look at Catholicism and go oh these guys are spot on no I agree no actually I 100% agree that I've said that I've said that as much before where it's like why is everyone targeting Scientology how is it any crazier than this other madeup sh yeah or you know I friends Mormons growing up and they would tell me about their religion i'like that and me being a kid he looked in a hat or whatever and read the tablets you're crazy and then you yeah when you stop and have that critical thinking about a story you read in the older",
      "start": 3410.08
    },
    {
      "text": "i'like that and me being a kid he looked in a hat or whatever and read the tablets you're crazy and then you yeah when you stop and have that critical thinking about a story you read in the older New Testament is the this guy walked on water or this guy no no you looked yeah you looked in the Hat and you figured out everything you needed for your religion but that's **** we all know you have to be on a mountain there has to be a couple tablets God has to etge them you know the Commandments into these and then you have to kind of go forth and tell your people also make sure you part a giant Red Sea while you're at it um you you know and a lot of people you need to play Advocate cuz I know there's going to be quite a few people that are listening that are like hey you're unfairly sort of not representing the size or the sides here I will say this that if I have friends that that do believe in organized religion that uh take all these stories as sort of uh allegories for how you",
      "start": 3447.16
    },
    {
      "text": "of not representing the size or the sides here I will say this that if I have friends that that do believe in organized religion that uh take all these stories as sort of uh allegories for how you should live your life and in that in in that respect yes I can I can understand that I can understand why people have faith not in an all divine power all seeing all all knowing god who is making sure that um the prisoners are not fighting in the yard because that that's really what we're talking talking about here right like God in this instance is a warden and we're all these prisoners we don't know if he's up there in that Watchtower or not so we have to be good because if he is up there and we start a fight he's going to come down and put us in solitary look whatever yeah well that's what I'm saying is like I don't I don't want to go too far off on a tangent on that but what I'm saying is that there is there is the concept of like do people have Blind Faith to be good or do they have",
      "start": 3478.92
    },
    {
      "text": "I'm saying is like I don't I don't want to go too far off on a tangent on that but what I'm saying is that there is there is the concept of like do people have Blind Faith to be good or do they have faith in God because they're afraid of him because they're afraid that of the rep there's incredible fear dude um of God but you know and at the same time like I I you look at all these stories and you also say you know if if you're going to believe them as sort of like teachings of how to be a good person I can see that I can understand why you would want to belong to an organization that does that for you right where you go to every Sunday you you around a bunch of people who are just trying to be better and are just trying to have a uniform understanding of what it means to be a good person and I get that um but having said that you know I I I listen to these scriptures and I'm just like dude none of this like there's got to be a better way to get that across than teaching than teaching",
      "start": 3517.4
    },
    {
      "text": "and I get that um but having said that you know I I I listen to these scriptures and I'm just like dude none of this like there's got to be a better way to get that across than teaching than teaching these things that don't outwardly make any logistical sense of the things that we can see in this world around us which I think kind of to your point is what what would it take for you to believe in God I would need he would need to show himself or she show himself or it to show him itself like that I don't understand like why that's such a big thing that's that's how you know in my mind that it's fake is because like I can the camera is real the light is real the planet is real the solar system is real the star is real the Moon is real the Galaxy's real the black hole at the center of the galaxyy is real somewhere amongst all of this **** is God you know and and to me like that that's so bothersome because it's like we have these great powers of observation and we should demand I'm not",
      "start": 3549.72
    },
    {
      "text": "is real somewhere amongst all of this **** is God you know and and to me like that that's so bothersome because it's like we have these great powers of observation and we should demand I'm not saying we demand anything of a de but we should demand God we should demand of ourselves a rigorous scientific method a scientific method to to to exactly to to figure out like all these things because like we we just set a different precedent for religion than anything else you know and that's the thing that really is bothersome to me because if God is real why wouldn't you want why wouldn't he want you to know it doesn't make any does sense it doesn't make any sense my question I'll rephrase your question is what does he get out of you not knowing if he's real or not I don't know compl **** what does that get he gets a some Blind Faith from a few billion people and then the other few billion people just don't give a **** yeah and so it's like like why there's just there's literally no",
      "start": 3588.04
    },
    {
      "text": "what does that get he gets a some Blind Faith from a few billion people and then the other few billion people just don't give a **** yeah and so it's like like why there's just there's literally no proof that's the thing is there's no proof yeah it's not even like there's oh there's this some people will be like oh look at the it's like the Fibonacci sequence and stuff like the the the the um patterns you see in in in the universe and it's like well it's the signs of God I'm like no maybe it's just a sign of a natural order you know like yeah like like the you know everything came from the same sort of you know thing yeah what do they say like the spiral arms of the Galaxy are like mathematically equivalent to the spirals of like on a clam or on like a or you not a clam but like a some sort of crustation in the SE and like and and it's like slow Fate on the cl to me it's like I don't it just doesn't make any sense like there are things there are there are",
      "start": 3632.6
    },
    {
      "text": "a some sort of crustation in the SE and like and like it's like and and it's like slow Fate on the cl to me it's like I don't it just doesn't make any sense like there are things there are there are Universal principles that break reality that break the universe that black holes in the event Horizon break everything we know about physics if you travel fast enough you can slow and stop time you know what I mean like there's all these weird things like you could travel forward in time we know how to do it you know what I mean like you could do it so like there's all these weird breaks in the universe and then somewhere in the and like you have to somehow understand that God is somewhere in there somehow divinely that's part of his plan is that you can break these things that you can you know travel near the speed of light come back and thousands of years have passed even though 10 minutes have passed for you you know all these weird things like none of thises sense so when people look",
      "start": 3669.04
    },
    {
      "text": "travel near the speed of light come back and thousands of years have passed even though 10 minutes have passed for you you know all these weird things like none of thises sense so when people look at like people always point to you know especially with Evolution or the missing links and all that kind of stuff the missing links are not really missing anymore and and there's plenty of proof in the geological and and and um biological record that these things exists and the same thing with the origin of the universe where everyone's like well the Big Bang where did it come from like that's a that's what Bill Nye says where he's like doesn't just because we can't answer all these questions doesn't mean that God exists you know what I mean like we have no idea what was there before the Big Bang all we know is that it happened right and we know what it happened because all you have to do is look the observ like observational science right like you can tell that everything is moving away from",
      "start": 3710.12
    },
    {
      "text": "all we know is that it happened right and we know what it happened because all you have to do is look the observ like observational science right like you can tell that everything is moving away from each everything's been everything's moving away and has been moving away at each other the entire existence of the of the Galaxy so there was everything started at one point yeah that's that's how we know that so like that's just so like okay so we know that where is your proof of God you know and it's like well everything's beautiful on Earth and look at that Sunset we're going to show you we're going to show you a book that's been Rewritten 50 times so it's not like I respect faith and I respect religion but I also want I wish that there was more of a uh I wish there was more of an emphasis even when among religious people and people that really believe in theological people to say like maybe we do need proof and like how what is the standard for proof does he have to show himself do we",
      "start": 3743.36
    },
    {
      "text": "even when among religious people and people that really believe in theological people to say like maybe we do need proof and like how what is the standard for proof does he have to show himself do we we ask him to show himself in some way or or do we really just think that like the beautiful sunset is God's proof you know what I mean that he exists because you can get a beautiful sunset on any Planet you know what I mean it's not like it's it's not unique to Earth an earth like planet is not unique to the solar system right and and as we all as anyone knows at this point life is not unique to this planet it's not possible so like there's all these different things that like don't aren't answered and sometimes I wonder if we are being held back by this notion of an ancient deity and if we aren't being held back by it then how do we prove that it exists because if you proved it to me I would believe you know you can prove mathematically any of those things that I just discussed why so",
      "start": 3780.76
    },
    {
      "text": "aren't being held back by it then how do we prove that it exists because if you proved it to me I would believe you know you can prove mathematically any of those things that I just discussed why so difficult to prove that right it's you know unless there was a you know a puff of smoke and Morgan Freeman appeared in front of me like he did for you know Bruce Almighty but I would probably just think I was going crazy and yeah I'm watching a lot of X Files and this is a perfect example of like the the sort of duality of me right which is like I'm part Mulder and part Scully where if you showed me something I'd want to believe in it but then I would just be skolly trying to say there's got to be a scientific explanation for this so like for instance if God were floating on TV like above the Empire State Building you're like oh it's God I'd be like it's fake I can do that in After Effects right I don't know what it would take for me my logical brain to be like I know exactly how they",
      "start": 3820.48
    },
    {
      "text": "the Empire State Building you're like oh it's God I'd be like it's fake I can do that in After Effects right I don't know what it would take for me my logical brain to be like I know exactly how they would do that trick or I know how they would fake a moon landing because I've seen Transformers one two three and four where they have you know people landing on the moon or doing whatever um I don't know I mean and part of me doesn't even want to believe because I because I've been so not anti-religion because again I'm not anti-religion I just I chose I had a break with the church right around the time I was you know in fourth or fifth grade and I decided I didn't want to go to Catholic school anymore because I wasn't getting anything out of it I was I was sitting through church bored out of my mind drawing pictures when I should have been paying attention and I wasn't because I purposely wasn't I was like I'm not getting anything out of these stories these don't make sense to me",
      "start": 3858.72
    },
    {
      "text": "out of my mind drawing pictures when I should have been paying attention and I wasn't because I purposely wasn't I was like I'm not getting anything out of these stories these don't make sense to me they're not even I mean if you're telling me these are fiction maybe I'll start paying attention but you're trying to tell me that these are non-fiction it doesn't it doesn't make any sense it's not vibing with me there's something off about this um it would have to be something amazing something amazing that I saw with millions of other people at the same time and we all have that shared common experience because I think if it was just me I'd be like I hallucinated that or I'm not going to tell anyone that because they're not going to believe me I don't know Greg what about you oh I believe in God you do believe I've talked at length about that yeah and you don't need God I feel yeah exactly no I mean I had not organized religion exact well that's that's my big thing with a lot of the",
      "start": 3891.16
    },
    {
      "text": "in God you do believe I've talked at length about that yeah and you don't need God I feel yeah exactly no I mean I had not organized religion exact well that's that's my big thing with a lot of the things you guys have been throwing around is like I think you're getting hung up on what religion is like versus what God is or whatever you know what I mean I'm the same way I believe in God I don't believe in the Catholic Church you know I left that based on a number of different things stance on abortion women as priests so on and so forth um but yeah I mean like you're talking about big things for me it's the little things and that's what I've talked about before on this the fact that I'm whenever I'm like and it's sounds very trivial to boil it down to stuff like this at this point but like like for me there's always this uh acknowledgement outside when I'll walk the dog or when I'm walking in any other city or when I'm doing anything else where street lights will go out and I don't",
      "start": 3926.2
    },
    {
      "text": "like for me there's always this uh acknowledgement outside when I'll walk the dog or when I'm walking in any other city or when I'm doing anything else where street lights will go out and I don't mean it in a mystical ghost sense that something's happening for me it's just a nod exactly I don't mean it something goofy like that it's just a nod of acknowledgement of like hey when I'm alone with my own thoughts and stuff like that it's back to what we always talk about too is that I and why when I was RA raised in a Catholic school Catholic Education that creationism never came up for me like you said Evolution and science this is taught as this is fact and then religion is Theology and this that and the other I still stand by the fact that I understand the science of how my eye works and I understand the science of how the microphone works but I also understand that there was this past where none of that was a thing and that there was a past before that where we were there's you know",
      "start": 3962.16
    },
    {
      "text": "I understand the science of how the microphone works but I also understand that there was this past where none of that was a thing and that there was a past before that where we were there's you know single cell organisms and all and all and all this for me to believe to get to where we are now there had to have been some nudge in the right direction and again I don't mean a literal nudge and I don't mean that I'm the Big Bang didn't happen or anything crazy you know what I mean I'm not going out to discredit science for me I just feel like there is a path and I don't know if it's just my path if this is just my universe if everyone thinks and feels the same way I do if every processes information the same way I do or not I I I'm on your side with this I think we have talked about this and I I apologize for no no it's just it's conversation with Colin mixed into other stuff and then like little quips here and there um I I've gone out and said and I will say again that I don't believe",
      "start": 3997.52
    },
    {
      "text": "I I apologize for no no it's just it's conversation with Colin mixed into other stuff and then like little quips here and there um I I've gone out and said and I will say again that I don't believe necessarily there being a God in the Catholic sense of there's a man in a white robe sitting up in the clouds we can't can't see and he's choosing the destiny and the fate of every single person on this planet first of all that's that's just a shitty job I wouldn't want that job that's that's a hard job um full of a lot of Heartache but I do believe that there's an energy or some sort of common spirit that we all share and I don't I can't put my finger on it there I have seen instances um of just great inspiration on this planet that I believe we all share something I can't put put it into words I don't think it's a God I don't think it's a mighty creat but I think that we do share a sort of spiritual energy together as humans on this planet that we could potentially more tap into and we",
      "start": 4031.84
    },
    {
      "text": "I don't think it's a God I don't think it's a mighty creat but I think that we do share a sort of spiritual energy together as humans on this planet that we could potentially more tap into and we could we could listen to a lot more um and I'll liken it to this we you know the four of us a few months ago uh decided that we were going to go on our own and do this thing right and we stayed positive and we had a common goal and we wanted it to be successful and it was and that's really when you think about it not something that was in our hands we did not we made it successful because we tried really really really really hard but at the end of the day we put something out there that resonated with thousands of other people and they gave it right back to us and that positive thought that sort of like seeing as believing we believed that it could be a thing before it was a thing we had faith in it and it became real because of that and I don't want to get into like a karmic energy talk and",
      "start": 4073.84
    },
    {
      "text": "of like seeing as believing we believed that it could be a thing before it was a thing we had faith in it and it became real because of that and I don't want to get into like a karmic energy talk and I'm not going to I don't want to start talking Eastern philosophies or any of that stuff but I do believe in the power of positive thought and I do believe in karma and I do believe that there is um there is an energy that we all share as human beings whether you want to call it the spirit or whether you want to call it you know a God or a creator that does exist that we just we can't explain there might be a scientific explanation for it um you know they always said that thing when like when the when the body dies it loses like a little bit of weight instantaneously what is that no one knows um so I I do think there are things out there that we could explain but why are we so afraid to explain God with scientific terms I don't understand that right why does it have to be blind faith why",
      "start": 4115.96
    },
    {
      "text": "um so I I do think there are things out there that we could explain but why are we so afraid to explain God with scientific terms I don't understand that right why does it have to be blind faith why can't we you see a sunset that can be God and also there's a scientific explanation behind that as well but I see again the sunset thing I feel like you're getting hung up on we read these shitty religion books like my My Religion workbook you remember these **** and there'd be like yeah this couple walking on the beach or whatever it's like all right like like you know it's just like God Beauty in that or whatever right no that is Nature's Beauty but then again where does the nature that's what I'm saying is I'm like there is an energy in the world right we are all made of the same thing like you know star dust Stakes um we're all we all come from the same thing we all do every Mo every atom in our body every molecule body is made of of the same fundamental things that the universe is",
      "start": 4150.64
    },
    {
      "text": "you know star dust Stakes um we're all we all come from the same thing we all do every Mo every atom in our body every molecule body is made of of the same fundamental things that the universe is made out of Kevin is that correct Stardust Stardust stust no it is it is and so we share some sort of commonality whether we like it or not there's got to be something deeper in that and there will I'm sure like you know I'm sure a 100 years from now we'll look back and go we understand a lot more about how the human brain works how DNA works how the how Gene structures work than we did before and there are these crazy commonalities and there there is other potential that human bodies can tap into that we don't know anymore um is that God I don't know sure I mean it is it is the potential for for for us to elevate to a higher state of being so and that really is what the promise of of a God Is Right someone watching out for us that we can eventually Elevate ourselves in his honor or or his or",
      "start": 4187.04
    },
    {
      "text": "for us to elevate to a higher state of being so and that really is what the promise of of a God Is Right someone watching out for us that we can eventually Elevate ourselves in his honor or or his or her um or its its you know image um back to the clam so I'm not going to say there's no God but I just don't think it's a God in that or the mollusk is it oh it was a clam sorry um I'm not going to say I I just I just don't like the idea of of you know God being used as a control mechanism for telling someone who they should see that's when we get to religion and that's why I have a problem a huge problem with religion you know what I mean what you're saying is all religion problems that there are there that are guiding yeah and that's and that's the thing with and I agree with Greg in the sense that you can separate theological religious study from scientific from a deity or a God or whatever because I think that religion has largely been a incredibly destructive force on this on this",
      "start": 4228.36
    },
    {
      "text": "sense that you can separate theological religious study from scientific from a deity or a God or whatever because I think that religion has largely been a incredibly destructive force on this on this world like for the last 2,000 plus years like it immediately puts you into Fanboy camps of we're right and they're wrong yeah and it's just been it's been the like Wars have been fought just countless at this point hundreds of millions of people have been killed because of religion over time you know like it's you know the greatest war of all time I guess was technically fought by you know an atheist but it it like the you know which is World War II whatever I don't think Hitler wasn't a religious man and obviously the Communists were were atheists but the um it's been a destructive force but it's also been a Force for good in the sense that there's a lot of great Charities and and you know they U my dad was always talks about you know um Catholic stand you know my dad's a very charitable",
      "start": 4268.08
    },
    {
      "text": "it's also been a Force for good in the sense that there's a lot of great Charities and and you know they U my dad was always talks about you know um Catholic stand you know my dad's a very charitable person gives a lot of money to Charities and he that's like his nature as a Catholic man is to help the poor and the the underserved and all like that so there's positivity there too and I'm not saying anyone should or shouldn't be religious like I really don't care what you what you are I mean that's your that's your freedom to believe what you want my big my big thing is like I want proof you know what I mean and I don't think it's really like and some people like are almost gased by that you want proof of God and it's like yes I want proof you know why are we running around like I was reading a lot about about Apollo 11 lately they had these like extraordinary pictures that they were taking and it's like yo these **** are on the moon yeah dog you know what I mean like they're on the",
      "start": 4308.12
    },
    {
      "text": "a lot about about Apollo 11 lately they had these like extraordinary pictures that they were taking and it's like yo these **** are on the moon yeah dog you know what I mean like they're on the moon they're not on this planet anymore and like they're just not here anymore you know and they're like being they were talking about in the sense that like they were the first people affected by the gravity of another body right and I was like religion doesn't take this into account Catholicism doesn't take this into account like this is so we're so much we are so much more inconsequential minute to this universe than we think we are and like there's almost a self-important kind of aspect to us being like well there's a reason for all this and my whole thing is like I'm not so sure there's a reason for this at all I think that like whether you believe in The Rare Earth theory you believe that we're the only planet that happens to have life which is **** impossible I think or whether do",
      "start": 4345.36
    },
    {
      "text": "reason for this at all I think that like whether you believe in The Rare Earth theory you believe that we're the only planet that happens to have life which is **** impossible I think or whether do you think life is is elsewhere there might be life elsewhere in you know not complex life but life elsewhere in the solar system in this galaxy this universe um they found bodies of water on Mars haven't they yeah there there's water on multiple moons and stuff like that I mean it's not that not not that water it precludes life but water is a build there probably going to be something in there that we find that's you know a bacteria or something we're see and that's going to be the thing that destroys the world no that's going to be back to study it and that's going to get us that's no I mean I I didn't mean in a more I mean I agree with you in a more theological way like the second scientist concludes that there's life somewhere else that is the back breaker of spirituality on this in",
      "start": 4383.0
    },
    {
      "text": "I I didn't mean in a more I mean I agree with you in a more theological way like the second scientist concludes that there's life somewhere else that is the back breaker of spirituality on this in this world and anyone and anyone who tries to tries to spin it like somehow like God or the Bible or anything I don't understand it's the difference between religion and God but that destroys earth-based religion forever because like it is all about the the uniqueness of the human religion yeah and suddenly and suddenly we find on Mars some some um fossilized remnant of a a very sing single cell organism or we go to Titan or Europa or one of these moons around Jupiter Saturn and we find life in an ocean somewhere that maybe is a fish or something like that that's it I mean like if you find it that close to home and then you look in the sky and you see all of those Stars everywhere and all the systems and all these planetary something like that it's like suddenly you realize like wow we",
      "start": 4415.0
    },
    {
      "text": "it that close to home and then you look in the sky and you see all of those Stars everywhere and all the systems and all these planetary something like that it's like suddenly you realize like wow we aren't special at all because we founded three planets over in a gas giant yeah a moon string a gas giant you know what's going on like 25 a from the Sun where there's no sunlight yeah come on you know like that and that's the kind of stuff I start thinking about where they like Greg is able to really not fuse these things together and I find it really hard not to because religion is the study of God or the belief in God or Gods if you're polytheistic and that's totally fine and no one's right or wrong um we've gotten a little away from the centralized question what the proof we need is but to me it really all spurred from the fact that like wow I never really realized as as someone who really I think understands the Bible better than normal Layman although not as well as obviously is a",
      "start": 4457.12
    },
    {
      "text": "to me it really all spurred from the fact that like wow I never really realized as as someone who really I think understands the Bible better than normal Layman although not as well as obviously is a theological scholar or a hardcore Christian because I don't where I was like wow like we really don't believe in visual proof even though the people that were all subjects in this book had visual proof and maybe that's what we need is some sort of like if God if I was on a boat with some guy named Jesus and he was like I'm going to make water and wine now I'm going to I'm going to bring fish I'm going to Stone he sounds like that comedian cast your net cast your net here where you never caught fish and you're going to get a bunch of fish I'd be like holy **** yeah yeah but see what did you do or if he walks on water something it's like so maybe they saw these things and they did believe and maybe it's hard for them in historicity to be like yo we **** really did see this you know I",
      "start": 4501.2
    },
    {
      "text": "do or if he walks on water something it's like so maybe they saw these things and they did believe and maybe it's hard for them in historicity to be like yo we **** really did see this you know I mean and you're not going to but we did but then I'm like that's not fair why can't you show every generation something wouldn't matter though CU I mean all those things you describe Chris Angel can do in Vegas you know like and that's what I get to is going to have to be something big I saw that walk up a **** side of a building maybe he's Jesus seconding Kevin fade in the clan no you're absolutely right it's so it's just a complex question I'm not even sure like like it's just an interesting topic for me because as I said before one of the things I really do respect is Faith because it really is one of those things where it's like everyone's trying to tell you you're wrong or like that there's no proof and there isn't but you have individual proof or individual Faith where you don't",
      "start": 4534.68
    },
    {
      "text": "is one of those things where it's like everyone's trying to tell you you're wrong or like that there's no proof and there isn't but you have individual proof or individual Faith where you don't need it and I do respect that you know um I know very very smart people that are very religious you know and and so I don't think it's a mark of intelligence or lack thereof I to me it's more they're very stupid atheist I know them too very um I I so you know and I know very very smart Highly Educated you know religious folks to me it was just like I often ask the question and there is no answer of like what is the proof because I can see science all around me so what and and the the fruits of science see to me you were talking about like well Humanity being you know we were talking about Humanity being here as being like proof of something or like you know some you know to me it's like was something from nothing yeah to me it's like I think that humanity is an accident that like we outsmart",
      "start": 4572.16
    },
    {
      "text": "being here as being like proof of something or like you know some you know to me it's like was something from nothing yeah to me it's like I think that humanity is an accident that like we outsmart Evolution that like we're the first ones that are self-aware you know and that that is not what nature intended and if that happens that must happen everywhere eventually because like we grew up you know as humans in South Africa and you know the diaspora we ended up all over the world because we just understood how to use tools and we understood a little bit about science before you knew it we believed in animal husbandry and Agriculture and before you knew it we had technology and iron and and and all these things now we have steel and and the internet and all these it's like we've just we're out of control mhm and I think that is why we dominate the planet it's not it's not because of and while we're space fairing why we landed men on why we will go to Mars and we will go all these",
      "start": 4610.44
    },
    {
      "text": "we're out of control mhm and I think that is why we dominate the planet it's not it's not because of and while we're space fairing why we landed men on why we will go to Mars and we will go all these places I was reading about man missions that the Soviet Union was planning to Venus which is really weird and interesting in the 60s and it's like that's an accident that's not that's not like God didn't see that's the big thing is like there's no way God thought space fairing I I don't when I say when I say there's there's something out there I don't mean something out there as a control factor I don't mean something out there where there's a God and there's an end game right and you know with with organized religion and a lot especially with Catholicism there's an end game right Judgment Day is happening at one point you better make sure that sure you know if you if you make it to that day you were you were a good Christian um with what I'm talking about is I don't believe there is some",
      "start": 4646.56
    },
    {
      "text": "is happening at one point you better make sure that sure you know if you if you make it to that day you were you were a good Christian um with what I'm talking about is I don't believe there is some sort of pre uh pre-ordained or or uh predestination predestination for for any of this I just think that there was there's a tremendous thing that happened a long time ago and we came from that um and there's something special about that and it is science it can be explained to science I don't think we'll ever fully understand what that is um but we do have to I still think that the idea of having faith in something is not necessarily a bad thing as far as that is concerned and I think you can have faith in things that you can't necessarily explain or um or or can't prove necessarily right off the bat like and and and I again I pinpoint what we did we had faith in something we we we took a leap of faith right uh and it worked and we were rewarded with that because we took a risk and",
      "start": 4685.44
    },
    {
      "text": "off the bat like and and I again I pinpoint what we did we had faith in something we we we took a leap of faith right uh and it worked and we were rewarded with that because we took a risk and because we had faith that our together uh we had something special uh it actually worked so far knock on we'll knock on Ikea wood um and I've seen instances of that you know it's funny I was talking to I was talking to Hunter the other day he believes in something similar to that where he's like you know you you have this tremendous potential you can tap into if you just believe and you just know and have faith that you can do something the world will find a way to help you do that thing you your body will find a way and he he he he wrote a book and he recommended it for me and I can't remember the title off hand the Bible no it's not the Bible it was a Deepak Chopra book but um quite the opposite of a Bible uh but but it makes sense because you do see these instances of these people doing",
      "start": 4730.64
    },
    {
      "text": "the title off hand the Bible no it's not the Bible it was a Deepak Chopra book but um quite the opposite of a Bible uh but but it makes sense because you do see these instances of these people doing these great things and you're like there is something special about that and people can do amazing things and people do achieve amazing things every day and you can't discredit that there is a power in that what is that power I don't know I don't know if it's like a I don't know if it's a magical power uh or you know given to us by a Creator or if it's just a spirit that we all share much like the force that we can tap into or like I need a little extra something right now world give it to me and every cell in your body works together and gives it to you you know what I mean um you know there is something about that I I can't put a finger on it I've never actually tried to to vocalize it before for the most part there's something there though he brought he brought up a really interesting",
      "start": 4771.64
    },
    {
      "text": "is something about that I I can't put a finger on it I've never actually tried to to vocalize it before for the most part there's something there though he brought he brought up a really interesting point where he was talking about you know when all the you know all the cells in your body can work together and to help you accomplish great things but when they stop working together and they start working against you um it starts being cancerous right and and and so there is a there is a power in sort of thinking positively about things and H and and wanting to have faith in something that I think that we I don't want to discredit and I don't I definitely want people that are listening out there to think that we are discrediting them having faith and them needing that Faith to sort of exist and and Excel in this world um but yeah to Greg's Point God and organized religion are two separate things so I'm going to stop talking now okay what's your topic oh my topic comes from the audience",
      "start": 4807.2
    },
    {
      "text": "and and Excel in this world um but yeah to Greg's Point God and organized religion are two separate things so I'm going to stop talking now okay what's your topic oh my topic comes from the audience as always as always not always we we most of the time we we we had a topic I think last week from Patreon or this week from Patreon yeah this last week from the audience from the audience there our audience my topics a lot of times come from Twitter remember guys if you want a topic on the show please tweet at Nick Scarpino uh with your topic suggestion I write them all down uh we get to them one by one when we can I've got a bunch of them but um I will get to your topic hopefully eventually uh like at MC Beardo or Mike Beardo depending on he doesn't have an e in it remember when I asked you if you could read your own handwriting no I did I just didn't write an e sure you didn't but I think it's Mike uh if you were in a video game what would your signature move be it's like a video game",
      "start": 4841.56
    },
    {
      "text": "if you could read your own handwriting no I did I just didn't write an e sure you didn't but I think it's Mike uh if you were in a video game what would your signature move be it's like a video game are is it a fighting game is it a third person game what are we doing here I'm going to go with my the one of the only games that I play that have signature moves which is Smash so if you were a character in Smash what would your move be Jesus Christ what's yours have you thought about it yeah I have thought about it it would have to be a projectile move it would have to be a a long R A Range move uh I would have to be able to sit on the side of a of a of the screen and and shoot it at you I think my move would be the shooter you stealing my moves yeah I'm stealing your move I just stole it what are you shooting just bullets at you at your head face yeah that's gross like cyborg well that's that's like that's completely different that was all what you just said I don't know what if you",
      "start": 4881.04
    },
    {
      "text": "what are you shooting just bullets at you at your head face yeah that's gross like cyborg well that's that's like that's completely different that was all what you just said I don't know what if you were a wrestler what would your move be what would I was a professional wrestler it's the Greggy Giga tetine that that's already done I I have 24 hours of backyard Wrestling tapes in that closet what is the Greggy guillotine the Greggy guillotine is actually I I stole it from o probably Wrestlemania 2000 the the when you go through you know you're unlocking on moves for your created characters and I started using in back your wrestling because I just for a long time had the stunner I just stole the Stone Cold Stunner kick you in the drop you into the stunner and then that was just that's I mean you're not even trying on that one you just straight up well guess what there's only so many moves especially for of shaped backyard wrest infinite amount of moves that you could have chosen from so",
      "start": 4920.8
    },
    {
      "text": "you're not even trying on that one you just straight up well guess what there's only so many moves especially for of shaped backyard wrest infinite amount of moves that you could have chosen from so basically the Greggy guillotine is similar right so I would you you do it on Portillo yeah I'd grab I grab him by the arm I pull him up and then I put him up in a fireman's carry like this so they're up there like this in the fireman's car I got him in the rack and then I'd kick him out into the stun ner so imagine I throw pella's butt out back towards that and then his of course these aren't your you have longer arms yeah your arms aren't draped across my CH chest like his but you kick them out and you fall into the stunner like that which and the stunner is what exactly stun he enjoyed that very much you kick him in the gut here you want to get up and I'll do oh that's when he goes like this yeah right down you have him down there I you land in you land in the a sitting position with your legs",
      "start": 4957.84
    },
    {
      "text": "you kick him in the gut here you want to get up and I'll do oh that's when he goes like this yeah right down you have him down there I you land in you land in the a sitting position with your legs extended on the the other guy lands on his knees with his basically Guillotine right over your shoulder okay I like that and he pops off and Falls so you have a little it's a little variation on them a flourish there there's a flourish there that made it not just a Stone Cold Stunner ripoff anymore and it just became this Wrestlemania 2000 video game move ripoff it must have been NWO Revenge maybe WCW NWO Revenge because it was I had it for a long time there was only a couple byw by wfs where I didn't have the Greggy guillotine and I just used the stunner instead I eventually figured that I like this though I like that my other one since it was backyard wrestling right now of course this is a com we you know byf Backyard Wrestling Federation yeah not a creative name at all we weren't creative",
      "start": 4994.8
    },
    {
      "text": "though I like that my other one since it was backyard wrestling right now of course this is a com we you know byf Backyard Wrestling Federation yeah not a creative name at all we weren't creative we didn't know it's one of those things when you start something it's a little more creative than the worldwide what is it WWE World Wrestling World Wrestling entation World Wrestling Federation whatever um since we would wrestle in the front yard for our week to we show and then our pay-per- views were in the backyard did you actually charge people for that no we never these these tapes these we didn't tell anybody about you didn't show anybody of these you're a bunch of you didn't show your girlfriend like you showed her your action figures I think I showed one girlfriend and I did I do remember she came over and she wanted to go out and I was like I'm exhausted we just did a backyard wrestling thing I show her tape and it was weird she was like all right she clapped she clapped she",
      "start": 5035.12
    },
    {
      "text": "remember she came over and she wanted to go out and I was like I'm exhausted we just did a backyard wrestling thing I show her tape and it was weird she was like all right she clapped she clapped she clapped and made out with me later so really yeah it was fine yeah good for you it's part of my thing I mean what people watch me do dumb stuff all the time on this and make out with me later um so this is again WWF Attitude errors happened at the same time you may remember uh The Rock one of his moves the people's elbow never heard the corporate elbow you remember this is he um is he still relevant today no hasn't done anything went into a really a bunch of really bad movies this car franchise just terrible he's just I don't know what he's doing with this I don't understand why they still make car movies anyways um he had this movie called The People's elow where he takes off his El pad throws in the crowd bounces off the ropes both times drops it on somebody right what I would do to",
      "start": 5070.44
    },
    {
      "text": "make car movies anyways um he had this movie called The People's elow where he takes off his El pad throws in the crowd bounces off the ropes both times drops it on somebody right what I would do to what I would do when I needed to lose matches is do the GRE the Greggy elbow side ahead of time who's going to win who's going to L how do you think we did how do you think we did anything it's not it's not chaos out there we'd go out there we'd walk through the match what we want to do have we had angles we had feuds you got to know who's going to win go back up back up back up what was the end goal with taping all of this stuff were you make matches and watch them with your friends so you showed these to people no the friends who were in The Federation how many people were in the Federation oh man uh 15 it was an alternating cast you had the core group and then you have these Hangers On who came by once in a while did something did you at any point want to actually be a professional",
      "start": 5105.28
    },
    {
      "text": "oh man uh 15 it was an alternating cast you had the core group and then you have these Hangers On who came by once in a while did something did you at any point want to actually be a professional wrestler oh yeah you always kick that idea around every so often yeah somebody you you have the physical makeup to be a could been well I know for 80s professional wrestler yes I could have easily been one of the natural disasters me earthquake typhoon out there I could have been a good manager still could be if this doesn't work out but no you watched him with the people who were in him you were putting on the show for each other to do something stupid there's onlyd like you I would think once in a while like that'd be cool you know what I mean like especially because this is during Mick Foley's you know time when he's like there showing his backyard wrestling but there's like two guys in the Federation who really really like thought they were maybe going to do it you know what I mean they",
      "start": 5141.32
    },
    {
      "text": "you know time when he's like there showing his backyard wrestling but there's like two guys in the Federation who really really like thought they were maybe going to do it you know what I mean they sh oh no no of course can ask this followup question yes please do before I get to Colin signature move um have these yes they're here in this house right now we once set them to Ahmad Rashad as well because he had he hosted he hosted real TV you remember Rashad Ahmad Rashad almost got on the air we got a call back from a producer really yeah wow that must been exciting that was it was the biggest break of Our Lives that was only that had worked out oh I forgot too this is this is actually really fun so you're asking who else saw these things you we wrestled you know blah blah blah with each other and then we'd show him to each other afterwards I'll hang out and then we play in Grand Theft Auto too um we had one of the kids went to another school and so he would he'd bootle the whatever he",
      "start": 5174.84
    },
    {
      "text": "and then we'd show him to each other afterwards I'll hang out and then we play in Grand Theft Auto too um we had one of the kids went to another school and so he would he'd bootle the whatever he did make his own copy then he'd go to school and then he'd share him with another kid there who just like wrestling and that kid then would go home and write his own like report on it like he this is before blogs were easy to get and do stuff so this kid would watch it and review match by match promo by promo and write it in like a voice like he had a voice like he was writing for the dirt sheets or whatever it was awesome you talk about having audience that one guy Paul was amazing he was killing it and Paul no one ever heard from him again went to the Air Force never heard after that okay not that I think something bad happened I just didn't fill out touch with the other friend so I want you to mle of this idea sure we have technology sure we can digitize these tapes and sell them as DVDs",
      "start": 5213.16
    },
    {
      "text": "that I think something bad happened I just didn't fill out touch with the other friend so I want you to mle of this idea sure we have technology sure we can digitize these tapes and sell them as DVDs the problem with this is the fact that I we then have to start cutting in these other wrestlers how who what's the ownership rights yeah I think you guys you give you give people the split I do not want to re I for the $10 we're going to make off these tapes I do not want to reach out to these people try to find track down Evan ging whatever happened to him I don't know well I'm sure you could find him it's the internet yeah the other thing too is like another reason we didn't show these tapes to many people is Imagine first off if you were a kid with a video camera and you could say whatever you want and then we're making angles so there was a few charact there was one character who will remain nameless whose whole shtick was that he would **** your girlfriend and that's how you'd",
      "start": 5249.96
    },
    {
      "text": "you want and then we're making angles so there was a few charact there was one character who will remain nameless whose whole shtick was that he would **** your girlfriend and that's how you'd start M that's how you he'd start new feuds with people cuz basically what would happen if somebody with a girlfriend wouldn't come over one night we'd cut a a fake promo or the guy's **** the girlfriend and then we'd bring that person in sit them down make them watch a tape so I'm going to ask this question again had a lot of time can we digitize this some of us and how old were you guys when this was happening this is through high school so this is 16 14 18 I no well yeah something like that i'probably like we probably started sophomore year and like it was Heavy through Junior and then into senior tapered off I'm going to use my copious free time that I have now that we have this job and I don't do anything anymore yeah to research this okay because I want to do I want to make this thing",
      "start": 5286.32
    },
    {
      "text": "tapered off I'm going to use my copious free time that I have now that we have this job and I don't do anything anymore yeah to research this okay because I want to do I want to make this thing how many tapes do you think you have how many hours of footage there is 24 hours of footage there's 12 tapes oh my God this is a cool and this is all of the footage that exists yeah and this is all the footage you ever did no one we did one at the very end like when we were like we're going to get back into it we did one like return to BWF jacked and it didn't work like it was fine but I never really copied it over it it was like Jason second match it was no big deal we should absolutely we got to put save these and get them in Smithsonian as soon as we got to do something with these we'll talk off line I do worry about them breaking down one day or losing they will you you should digitize thems does not the best was how many times we almost killed each other or something horrible happen I",
      "start": 5329.16
    },
    {
      "text": "off line I do worry about them breaking down one day or losing they will you you should digitize thems does not the best was how many times we almost killed each other or something horrible happen I almost broke my arm once yeah Po almost broke his ribs just laid on the ground in pain forever Nunan who's now a doctor we almost paralyzed on a coffee can on a coffee can yeah he got a belly-to-belly suplex and no notied that he was being tossed into a coffee can like you remember these old like metal folders canes not those **** ass ones now he got tossed right spine right right at the base of his spine there back break off if that thing was actually full and and not open cuz you know that you had to like break the thing off that's a pretty no it was open but still like it was like right in the edge of like the side that still had the metal part so it wasn't going to come down another guy Bob jumped off the roof of his van and dislocated his shoulder but he popped it back in oh nice",
      "start": 5363.6
    },
    {
      "text": "in the edge of like the side that still had the metal part so it wasn't going to come down another guy Bob jumped off the roof of his van and dislocated his shoulder but he popped it back in oh nice just like just like Rigs from Lethal Weapon exactly like Rigs from who who is videotaped did you have like a cinematographer we all switched off so like you're commentating while videotaping as well so you're just walking you're just walking next to the other guy talking and like you know all stuff a couple things I just off top that I would do with this one by the way call this backyard wrestling this is when we do this breakout this is going to be this yeah sorry sorry Mike beard be ardo this just became about backyard wrestling um two thoughts on it we can we can get the guys to sign off on it we put it up online because you know per video you're not making too much I'm happy to share any again the language is going to be a bit more blue than I'd like bleep them out okay we bleep it out",
      "start": 5400.2
    },
    {
      "text": "it we put it up online because you know per video you're not making too much I'm happy to share any again the language is going to be a bit more blue than I'd like bleep them out okay we bleep it out or we re-record all 24 hours of it with different oh sure you show other people tapes and have them do it yeah okay um there's lots of stuff we could do with this I'd like you just like I want you to stew on it okay I want you to do on it okay because we have Kevin now sure now I want you to of course remember the athletic prowess I have yeah and just imagine that in motion it's not like you're getting real WWE stuff here sure you're getting very slow leg drops I used to cover my mouth after I got my braces off because I was afraid somebody was going to land on my face and **** up my teeth then time time did it by itself still Keev let me let's get let's get a uh opinion from the audience here Kevin what do you think should we forget about this or is there gold here this gold this is gold",
      "start": 5441.12
    },
    {
      "text": "time time did it by itself still Keev let me let's get let's get a uh opinion from the audience here Kevin what do you think should we forget about this or is there gold here this gold this is gold gold Kevin says this is gold uh I also think that if we plan it correctly we can put it out as disc sets sure and then lead up to the reunion episode where you all get back together and you have to do a backyard wrestling and we do it **** real like real announcers we get all of our celebrity friends to come and be in the audience we get a ring girl four I was making fun of this idea my head because as as we know there's nothing more popular than DVD box sets today in 2015 tell you that right now but then that was a stroke of Genius is if we can get all of these guys back that's actually the that's the Nugget about it that's the idea do we want to use do we want to talk to All Pro Wrestling and use their ring or do we want to do it like legit out in the park we're I want to go to your",
      "start": 5479.84
    },
    {
      "text": "that's the Nugget about it that's the idea do we want to use do we want to talk to All Pro Wrestling and use their ring or do we want to do it like legit out in the park we're I want to go to your house doesn't even exist anymore we're going to your they knocked it down yeah we can go to my parents house Riverside they got a big backyard we'll F we have to figure out a way to do this as low budge and low f as possible I'm sure we can talk and this and this this can be done Nick as we've talked about in the past this can be done because we're going to need a solid probably month and a half or two months just just just in Glenn just in Glenn Allen I really want to get down to the to the source of just who Greg is and why he is the way he is and I really think that every time we talk about his childhood we get an inch closer to the answer just an inch closer about the psychoses of Greg Miller and this is just another this is another great example of it it's it goes up there with the",
      "start": 5526.76
    },
    {
      "text": "his childhood we get an inch closer to the answer just an inch closer about the psychoses of Greg Miller and this is just another this is another great example of it it's it goes up there with the peeing on the wall it goes up there with the two you know the the keeping all your toys sealed up and buying two of each of crying on in uous Disney rides asking if your girlfriend wants to play with your toys exactly that that's in there the blue hair **** in a planner which actually probably happened well in your into your 20 I was an adult when that happened here's here's a good backyard wrestling story for you again this is this would not only would this develop into an angle for us that would go on cuz you know sometimes the best angles came from the ad libs it would it would also develop into pose finishing maneuver was it like ever changing no well this is still when he was wrestling under the name of the Fabulous Gula Fabulous Gula The Fabulous Gula where did Gula come from oh my",
      "start": 5565.28
    },
    {
      "text": "into pose finishing maneuver was it like ever changing no well this is still when he was wrestling under the name of the Fabulous Gula Fabulous Gula The Fabulous Gula where did Gula come from oh my God we should save that story for when Po's here CU that's that's Po's nickname before Po that was like core guys in this it was it was me well I mean really it was Mike this guy named Micheel Bryan Jason I need wait wait wait stop I want everyone's wrestling name in addition to to their real name they're not that many they don't they don't get much crazier Michael Bryan wrestle as Michael Bryan but he was he was his angle was we found an we found a we oh he needed a shirt to wrestling on the first one and I had this horrible shirt that had been shipped to me by accident it was Gothic and it had like it it was for some heavy metal band that had like like the Grim Reaper on it and he had all this weird **** so he then had this angle that he was just a goth he was a Gothic kid cuz he wore",
      "start": 5608.44
    },
    {
      "text": "like it it was for some heavy metal band that had like like the Grim Reaper on it and he had all this weird **** so he then had this angle that he was just a goth he was a Gothic kid cuz he wore that one shirt and then when we got the new camera there was an there was a a bunch of different modes you could put on it and there was one that I forget what they call it where it makes everything look coppery and like everything else is like black around him so we only shot his Promos in that in that filter did you guys edit this stuff no I mean we didn't know how like this is like the most basic of edits you know what I mean like it was basically you're L doing the tape edit where you're like no roll it back roll it back okay started here yeah there'd be there'd be a little bit of that but mainly it was like all right we had like the run- of show of like there's this match there's this promo there's this match this match promo like that meant that we filmed this match a promo this match",
      "start": 5654.32
    },
    {
      "text": "it was like all right we had like the run- of show of like there's this match there's this promo there's this match this match promo like that meant that we filmed this match a promo this match this match this promo like there was you guys literally live to tape like it was almost a live EV yeah yeah oh yeah you rolled with the punches on whatever happened to this thing see so you got about we'll assume you got about five to six core guys in this sure that's about right so what I'm what I'm envisioning for this series is that we we do a look back we do a retrospective on each one of these guys sure right uh and we we start to seed out the actual M we don't have to put all 24 hours out I'm sure there are some matches that are oh there are some stinkers better than others right uh so I think we we make a compilation set and we build up to the road to Backyard Wrestling 2016 okay okay okay um and you guys literally I'm sure you guys would be in probably the same shape as you were back",
      "start": 5685.76
    },
    {
      "text": "we we make a compilation set and we build up to the road to Backyard Wrestling 2016 okay okay okay um and you guys literally I'm sure you guys would be in probably the same shape as you were back then yeah probably uh and I think it could be fantastic I want you to just think about it I um Colin on your note I I want to do what you're talking about I do want to go back and do a retrospective on Greg and interview those people but I'm **** terrified what I might find that's the thing is that cuz like imagine if you go back and you're like and no one will talk to you about Greg no one like he's a big internet celebrity and no one and everyone acts like they've never **** heard of him in his hometown because they're terrified of him because of the one thing it's not like a small town you're going to go to a corner shop and everyone me Smallville they're like oh Greg M never heard Mr Deeds when they go to the I can't even remember the town's name what the hell was the town's name I",
      "start": 5721.2
    },
    {
      "text": "going to go to a corner shop and everyone me Smallville they're like oh Greg M never heard Mr Deeds when they go to the I can't even remember the town's name what the hell was the town's name I can't remember anymore um what's up Deedy yeah I think I I don't know I mean that's one that's one of the things I want to do more than everything we love these video games these movies whatever but I really want to just tell the story of Greg Miller and like I think I think to be able to do that we need time we need means and we got to go to Illinois and I think that that's that's fine with me if we want to do that but it's going to take us a while we talk about **** Ken Burns documentary this thing is probably be 30 hours long I mean how deep do you really want to get in I mean how long do you really want to how deep do you want to get into this well you need to get into the Fabulous Gula and then the when he transition to just being Po because then like Po's wrestling thing was that he any",
      "start": 5765.56
    },
    {
      "text": "want to how deep do you want to get into this well you need to get into the Fabulous Gula and then the when he transition to just being Po because then like Po's wrestling thing was that he any his matches why you changing the subject it's not about Po it's about you was Po signature oh that's a different story We that's still Fabulous Gula okay but Po's shtick was that you know the song Crazy Train Azie Osborne yeah yeah that played Po was in a match he came out second and that played the entire time because that was the tempo we wanted to keep for Po matches okay and Po was crazy Po do crazy stuff all right man I I want to see some of this stuff I it's inspiring to me that you guys risk life and limb every weekend and my dad for just the 15 of you to watch yeah it was in you know have you thought of the fact that if you guys now granted this was a long time before YouTube came about but have you if you digiti these and started a backyard wrestling Channel you guys would huge yeah",
      "start": 5798.68
    },
    {
      "text": "you thought of the fact that if you guys now granted this was a long time before YouTube came about but have you if you digiti these and started a backyard wrestling Channel you guys would huge yeah remember because we thought we were so clever being you know BWF and then you Google searched or not even Google at the time whatever you searched there was a BWF thing up in Canada yeah like and they they were putting their videos online digitized and I was like blown away that this technology ex were you guys better no they were way better than well I don't know we all we all pretty bad they had better production value obviously by uploading their stuff and new stuff but the really crazy thing was is that you know again you're commentating you know on matches that you that you may have been feuding with that person so it wouldn't make sense so like sometimes we have like stage names and I don't remember I don't it was like the announcer's name yeah it wasn't like held to very strongly",
      "start": 5840.2
    },
    {
      "text": "feuding with that person so it wouldn't make sense so like sometimes we have like stage names and I don't remember I don't it was like the announcer's name yeah it wasn't like held to very strongly but like every so often you'd know that somebody had a feud or something so you couldn't talk about it and we took to calling Po Mr. Robato and there was a Mr. Robato in this BWF we found too it was really bizarre we were just not it was you just weren't creative you thought you were being really creative no I mean I go back didn't have a character that **** everybody else's girlfriend though is pretty creative though I mean for for a group of high school students to do this is pretty impressive and what were were you were you was this instilled On You by cuz I remember backyard wrestling being a movement in like the late 90s yeah with like bootle VHS's and DVDs and stuff so is that what inspired you guys to do this it I think it all started around the same it wasn't cuz ours wasn't I mean",
      "start": 5875.76
    },
    {
      "text": "a movement in like the late 90s yeah with like bootle VHS's and DVDs and stuff so is that what inspired you guys to do this it I think it all started around the same it wasn't cuz ours wasn't I mean as any good decent backyard Federation we had the occasional flaming box match or the you know some thumb tacks on the ground oh it's like you put you **** lit the ring on fire what yeah well yeah you get card boxes you light them on fire or whatever but again we were also but again again let's dial it back on the expectations on that we were not we we weren't the crazy like people jumping off trailers and literally lighting each other on fire it was like oh we're doing this flamy boxing we did it in a forest preserve when it had snow ed in Chicago and everybody's wearing like 15 layers it wasn't really like there was once Po got burned it wasn't bad it wasn't that bad but he laid in the Box too long and you can hear his opponent say Jesus get off the Box okay I want I just you know what",
      "start": 5911.72
    },
    {
      "text": "really like there was once Po got burned it wasn't bad it wasn't that bad but he laid in the Box too long and you can hear his opponent say Jesus get off the Box okay I want I just you know what I I I I I'm going to resend my previous statement I don't want to redo anything to these I think they're they're going to be they're going to exist fine on their own I don't think we need to voice them over at all no I don't think we have to do anything to the the footage I just think that we have to add this to the checklist of the documentary which I would call Ken Burns uh presents Greg Miller psychosis yeah yeah all right I just want you to know that Colin at the end of that really really really dark tunnel we're going to be changed men no absolutely and I my my most most exciting thing about uh Ken Burns presents Miller psychosis is that we're going to eventually get a letter from Ken Burns being like why is my name the title we have to do the Ken Burns like photos but it's just Greg the",
      "start": 5952.72
    },
    {
      "text": "uh Ken Burns presents Miller psychosis is that we're going to eventually get a letter from Ken Burns being like why is my name the title we have to do the Ken Burns like photos but it's just Greg the p is going like like almost animated right behind his bed gross you went too far sorry guys what was your super power or your special move in a video game we still talking about I think we're be on that oh we're done it all right that's done all right fine uh then it's time for the final topic of the show ladies and gentlemen and this one comes from our Patreon supporter his name name is John Lass Lasser and he says Lass and yes pronouncing it wrong you watching Psych huh it's a long one so settle in here it comes you ready his topic is the importance of education for Content creators when there is no barrier of entrance allow me to unpack this a little bit in your Dynamite crossover episode with Kevin Smith you talked about just go for it go out there create practice find your audience",
      "start": 5990.48
    },
    {
      "text": "is no barrier of entrance allow me to unpack this a little bit in your Dynamite crossover episode with Kevin Smith you talked about just go for it go out there create practice find your audience but as the inadvertent role models that you are what is your stand on education it requires no degree to post a video to YouTube Facebook Etc but I still believe that education is extremely important most of all I think it gives you a wider perspective on life in general and the process itself mastering a craft is an important lesson I think all of us best friends love the historical and political aspects that Colin brings to the conversation and I would think these aspects would be lost had Colin not attended Northeastern there are of course Financial aspects to the of the education in the US that I can't speak my mind on hence the name Lass I had that part I do however realize that it can be a massive burden having served in Afghanistan talking to Americans who were there quote doing their",
      "start": 6039.72
    },
    {
      "text": "I can't speak my mind on hence the name Lass I had that part I do however realize that it can be a massive burden having served in Afghanistan talking to Americans who were there quote doing their time end quote to earn a college education I would love to hear all of your opinions on the topic especially how mastering the art of Shadow Boxing propelled Nick's life to a better place after spending 5 years in the military myself I am now a third-year law student at the University of Copenhagen in in Denmark about 18.02 km from New Zealand thanks again and heart from Lass and yes you're pronouncing it wrong Lass Thompson so he's talking about the importance of Education a college degree for Content creators because we talk about just do it get out there and make content we do um I I'm 5050 on this one it's easy to go out there and just do it it's easy to do there you can do anything you want but there's a difference between doing something and doing something um and I think that in",
      "start": 6085.2
    },
    {
      "text": "on this one it's easy to go out there and just do it it's easy to do there you can do anything you want but there's a difference between doing something and doing something um and I think that in order to do something well you do have to have a base of knowledge to some degree for instance if you want to go out there and write a story if you want to do be a screenwriter it really does behoove you to uh learn screenwriting format and how people up into this point have done it now you don't have to do it exactly like them but they have the saying in screenwriting is that you need to learn the rules if you want to break them um uh and and you know they they talk about Quinton Tarantino Quint Tarantino knew how to write a screenplay he didn't just write Pulp Fiction right he had studied other movies and he didn't go to a traditional University uh guys like Kevin Smith Kevin Smith did go to film school um I think he dropped out of film School and came back and decided he's just going to",
      "start": 6133.52
    },
    {
      "text": "movies and he didn't go to a traditional University uh guys like Kevin Smith Kevin Smith did go to film school um I think he dropped out of film School and came back and decided he's just going to make his film but he got some sort of knowledge at least enough to know this isn't for me this isn't this isn't where I want to be or I'm not learning what I need to learn or I'm not being inspired the way I need to be inspired having said that do I think you need to go to a film school to create do what we're doing no I think you can probably at this point um use YouTube to get to get the equivalent to the education I got out of my film school and you could probably do that in about two months um it's different for Colin and it's different for Greg where they studied an actual you guys got a little bit more practical knowledge Craig Greg le as you did as for as far as journalism and calling for you for history you were just studying something that you were passionate about and there's",
      "start": 6174.44
    },
    {
      "text": "a little bit more practical knowledge Craig Greg le as you did as for as far as journalism and calling for you for history you were just studying something that you were passionate about and there's nothing that I think can ever replace that if you're going to go and you're in a program that you love and you're learning something and you're around like-minded people that's going to make you better at everything no matter what um if you're going to a film school and you don't feel like you're getting anything out of it no get out of there go get some practical go go get some practical experience on a set cuz at the end of the day if you want to do something Reading about it it's not going to get you there you got to go out and you got to go do it and you got to fail fail fail until you succeed um but yeah I don't know I mean I often say if I had to do over again I'd go to a trade school for two years just to learn the basics that I learned basically the nine years of IGN um and then go",
      "start": 6206.64
    },
    {
      "text": "um but yeah I don't know I mean I often say if I had to do over again I'd go to a trade school for two years just to learn the basics that I learned basically the nine years of IGN um and then go out there and do it but at the same time you do have kids coming up that are just picking up cameras and and making amazing things yeah and the important thing I think we're point to to point out when we say get out there and do it and make a podcast I'm not and I'm saying create content I'm never saying quit your job quit school make content I'm saying do it in tandem with what you're doing to get better that extra 12 hours at the end of the day that you have do something with I always talk about the fact right that like you're making stuff when you first start not to get a million views or whatever you know we're still trying to make a million views not to get a million views to learn how to do it to get better at it to grow to you know it's a muscle to train this muscle to strengthen this",
      "start": 6237.68
    },
    {
      "text": "you know we're still trying to make a million views not to get a million views to learn how to do it to get better at it to grow to you know it's a muscle to train this muscle to strengthen this muscle so that you can lay on your feet wherever you go and make the content you want to make uh the I looked at my phone there which we're trying not to do anymore because we're trying to be better except for when Nick has talked to Kevin uh I looked up the guy Roger poorne this is R former on Twitter uh a pride of Long Island like K morard this kid he I ran into him on the internet when he made a video about us leaving IGN and it was his podcast and it was him and his co-host talking at the segment about us right turned it on I want to say he's in high school sorry if I got that wrong Raj and you're watching it and it's like holy **** this guy's awesome this guy sounds like on totally on our level he could easily drop in and he's doing in high school while going to high school while going",
      "start": 6273.2
    },
    {
      "text": "watching it and it's like holy **** this guy's awesome this guy sounds like on totally on our level he could easily drop in and he's doing in high school while going to high school while going to school while looking at College maybe being in college and not giving up on that part right all he's doing right now is getting the building blocks like Colin always points it out that you know if anything going and getting a degree in college an undergraduate right or high school maybe it was just proves that you can do something it proves that you can set out and accomplish High School is not hard under college is the first thing that people a lot of people do that's that's hard hard and that like you have to really try no one like I'm not saying I'm not diminishing that high school is difficult when you're there but it's really not hard in retrospect College was actually legitimately hard so like I think that um yeah my mom always used to say my mom who's a scholar herself and a very",
      "start": 6311.8
    },
    {
      "text": "when you're there but it's really not hard in retrospect College was actually legitimately hard so like I think that um yeah my mom always used to say my mom who's a scholar herself and a very highly educated person who works at a university you say like undergrad your undergrad degree is just proof that you can do something yeah for the first time in your life like you never really did anything so like this is like this is you proving that you can stick with something for four years and leave and have something to show for it I don't know my my whole view on education is that I think it's super important but I don't think it should be prohibitive um yeah I mean like you look at I look at creators that I admire right guys like Stephen Spielberg Stephen Spielberg Dred out of college yeah he didn't finish film school but he got in there and tried it and started he understood what where Destiny was pulling where his emotions were pulling what he was going to go to and that's the thing that I",
      "start": 6351.76
    },
    {
      "text": "finish film school but he got in there and tried it and started he understood what where Destiny was pulling where his emotions were pulling what he was going to go to and that's the thing that I think I think you're right and Bill Gates dropped that at Harvard too and that's the that's but those are like but I don't want people to like be like well I'm Inon I'm like don't like for don't go to your mom right now but like Colin said to drop out of school yeah I'm not saying that but I'm saying like if you drop like you have to be pretty foolish to drop out of Harvard you know like that was that was a like real him and Paul Allen did and all those guys like that's a pretty bold move you know and like that's not going to work out 99 out of 100 times and it's not going to work out the way it worked out for Microsoft one out of a million times it will work out like that so like I'm not saying that like you should do that but there are a lot of examples of people leaving college and not",
      "start": 6386.6
    },
    {
      "text": "it worked out for Microsoft one out of a million times it will work out like that so like I'm not saying that like you should do that but there are a lot of examples of people leaving college and not needing college that said like I fully encourage people to go to college and I think that it's just that the the barrier of Entry has lowered itself um in terms of uh just producing you know I was thinking about it like it was funny in my head when you were talking I was like well the barrier of Entry has diminished for what Nick does with film MH and then I'm like the barrier diminish for what Greg does with journalism and I'm like but the barrier is this just is low for history it's like and and then I realized the barri is just low for everything like you can read and write and do whatever you want make your videos make your podcast do whatever you want for whatever field you want to do it in but I think that your chances of success at least commercially are just demonstrably higher if",
      "start": 6420.04
    },
    {
      "text": "you want make your videos make your podcast do whatever you want for whatever field you want to do it in but I think that your chances of success at least commercially are just demonstrably higher if you stay in college people as I've talked about in the past you know college isn't necessary and I think that like we have an we have an overemphasis on College I don't think there's anything wrong with a person not going to college I don't think there's anything wrong with a person going to a trade school or learning a trade in fact I know dudes back on the island that you know are air conditioner repairment or do whatever they do like they L on carpets make **** way more money than than Oliver make you know so it's not like it's not like a you know there's a practical application to those kinds of traits but I don't want people to get caught up in the fact that like well you I don't have to go because the fact of the matter is during at the the depth of the American recession",
      "start": 6455.32
    },
    {
      "text": "to those kinds of traits but I don't want people to get caught up in the fact that like well you I don't have to go because the fact of the matter is during at the the depth of the American recession in 2009 the unemployment rate was like 10 or 11% but for college graduates it was 4% and and that's and that's L on a lot of people like the college the the the unemployment rate for college educated people was really low yeah I was like and I was like and I was like okay that's interesting I don't think it ever got higher than like five maybe five and a half perc for college graduates and that's just because there is a barrier to entry in terms of maybe some more secure jobs or things of this nature again it's it's an Amorphis and kind of nebulous thing but I don't think it's necessary but I do encourage people to get an education because I think that college is important it's a it's an important social thing it's an important you were talking we talked uh to a gentleman before you were",
      "start": 6486.52
    },
    {
      "text": "do encourage people to get an education because I think that college is important it's a it's an important social thing it's an important you were talking we talked uh to a gentleman before you were talking about you know you went to UC Irvine and how it's a commuter School MH like I was happy that I went to Northeastern because like everyone lived there and like a great experience for and and that's just an important that was an important social experience for me I met all my like all my closest friends from college I lived with like Ramone and Kevin and all these guys that were going to meet as characters on this on this you know in the coming months especially Ramone like I met them because of that I didn't meet them in class you know or anything like that so it's like I want people to get that I can't imagine what I would be like if I didn't spend 17 to 22 in North Eastern I don't know like what I like what kind of person I would be even though I'm **** in debt for it and I do",
      "start": 6525.76
    },
    {
      "text": "get that I can't imagine what I would be like if I didn't spend 17 to 22 in North Eastern I don't know like what I like what kind of person I would be even though I'm **** in debt for it and I do encourage people to look and carefully consider the money you're spending don't go to a private university like Northeastern if you can't afford it your parents aren't paying for it because I you know like yeah see that and that was me I I wanted to go to USC I was like mid through my freshman year I was like I don't want to be a computer science major anymore I was trying to be a computer science major I was Undeclared and I took one lab and I was like no I can't do this I'm not smart enough I'm not passionate enough to learn this stuff I'm I don't know what I'm going to do eventually I found film and I'm like I should be honest with myself this is what I want to do for the rest of my life um but at that point I had already screwed my my GPA over so transferring to us to to like UCLA was",
      "start": 6559.92
    },
    {
      "text": "film and I'm like I should be honest with myself this is what I want to do for the rest of my life um but at that point I had already screwed my my GPA over so transferring to us to to like UCLA was impossible and then trying to get into USC's film school is really really hard unless you kind of went straight into that plus it's also like $45,000 a year at that time I think it's probably more now um and I just couldn't I couldn't rationalize that but I also did not have a defining sense of exactly what I wanted to do and I always Envy guys like Tim and I wish Tim were here because I think he could speak eloquently toward this in that he's just sort of grew up and was like I want to make videos on the internet I'm a huge fan of this I want to be a part of that Community I want to be an internet Superstar and I'm just going to do that and for me I kind of just I kind of um just screwed around a lot and didn't really like dedicate myself or devote myself into anything and I think in that",
      "start": 6593.32
    },
    {
      "text": "Superstar and I'm just going to do that and for me I kind of just I kind of um just screwed around a lot and didn't really like dedicate myself or devote myself into anything and I think in that in in that um sense college did work for me and that I came in not really passionate about what I wanted to do or knowing what I wanted to do and I found it I found myself and if I'm being honest I found myself in film and I sat in that first film class and it was it I think it was film Theory 101 um you know it was a very generic class like this is this is sort of the history of like film in the 20s and like you know um all those like the phenakistoscope and all that stuff and Edward Mybridge and all that you know all those all those old Stills that you see of the horse jumping and things like that of like you know how film originated and I was like this is **** fascinating why haven't I been studying this um if you know what you want to do and you really really know what you want to do and",
      "start": 6629.84
    },
    {
      "text": "of like you know how film originated and I was like this is **** fascinating why haven't I been studying this um if you know what you want to do and you really really know what you want to do and you're set on it even if that changes you to yourself to go explore that but I think that you can get a a pretty good base knowledge just with a little bit of Education try it I mean if it's if two years into it you're like I'm not really getting what I want out of this um you can always leave but if you want to go make movies for instance um there's you know it's a conundrum because there's no better way to do it than just going out there and doing it but how do you do it well a great way a great way to actually start is to make connections in film school that eventually you're going to be the guys that hire you later in life um case in point I went to school with with a good friend of mine named Ryan um you know he started Ryan Philippy no that'd be awesome if I went to school with Ryan",
      "start": 6668.68
    },
    {
      "text": "guys that hire you later in life um case in point I went to school with with a good friend of mine named Ryan um you know he started Ryan Philippy no that'd be awesome if I went to school with Ryan Philippy this is Ryan Cy my good friend who just had a baby Ryan Cy um but uh you know he he and I were were friends he was a computer science major we've been friends since forever and he was the one that got me the job at IGN and so like because we had that great relationship because we had kept up in college and we lived together um you know that those kind of relationships that you form especially that early on when everyone's scared and everyone's looking for an edge in life uh those can be very very very important and those can be lifelong relationships that you guys form you know I still talk to tyr tyr and I went to college together we we met because of film school and we I got him a job at IGN and now you know we get to collaborate still even though we're outside of IGN you know we",
      "start": 6706.64
    },
    {
      "text": "talk to Tyr, Tyr and I went to college together. We, we met because of film school and we, I got him a job at IGN and now, you know, we get to collaborate still even though we're outside of IGN. You know, we want to get them on the show and we still talk, we still hang out . Um, and so that that can be very, very important as far as especially if you're trying to do the traditional mainstream route as far as buried to entry for internet video goes. I mean, there's a billion people doing internet video. So I would say how do you do, do what you want to do, but try to figure out a way to have an advantage over other people. Exactly. Have a plan, the YouTube Creator Playbook. I mean, do your homework on this even, but again, don't do it and just quit and bail like, like we did. Yeah, we started this and did it for a long time before it became all we do. That's very true and we had, and you know, I don't, I don't think that like there's never a even playing field, there's never a level playing field, I should say with",
      "start": 6742.64
    },
    {
      "text": "long time before it became all we do. That's very true and we had, and you know, I don't, I don't think that like there's never a even playing field, there's never a level playing field, I should say with anything. No one starts off, like life is not fair. No one starts off without an advantage and disadvantages, right? We had arguably a pretty good advantage in that we all sort of cut our teeth at a place like IGN, yeah, where we were allowed to fail in an environment that was that was inviting and positive most of the time. And there was always some times when it wasn't wasn't so great, but that's any business. But for the most part, we were allowed to experiment, we were allowed to do stupid shows like Up At Noon that became a thing, you know, or uh April Fool's videos and things like that. I was allowed to hire crews with budgets that didn't exist because my boss was cool and was like, here's, you know, a couple thousand dollars, throw out it, go rent an Alexa, go shoot it with this thing with just a",
      "start": 6779.68
    },
    {
      "text": "to hire crews with budgets that didn't exist because my boss was cool and was like, here's, you know, a couple thousand dollars, throw out it, go rent an Alexa, go shoot it with this thing with just a cool camera. Um, but you know, that we use that as an advantage to then, you know, take our passions forward. So I would say look for those advantages in life and that advantage can be school sometimes, especially if you go to the right, right department and you meet the right people and you find collaborators who like these guys are cool enough to share this cool experience with you going this journey going forward. Um, because you can't do it by yourself. I guarantee even if you're going to do what Greg's saying where you come home every day and you want a podcast, if you're just by yourself, you're going to burn out so fast and I've said it before, like I'm fortunate to have you three and I account and now Kevin because you guys are the motivation when I'm, when I'm, I was tired on Monday and sick and I came",
      "start": 6813.64
    },
    {
      "text": "out so fast and I've said it before, like I'm fortunate to have you three and I account and now Kevin because you guys are the motivation when I'm , when I'm, I was tired on Monday and sick and I came in, you were smiling and I was like, all right, I'm back. Then I probably yelled at you a few times. You, you yell me about, but then I came in today, you were like super happy and I was like, all right, we're all happy again, it's cool. Um, mad at you. I just time I'm, that's my new, that's my February resolution. I'm not going to be as mean to you. It's okay, even in a joking way, you can be mean to me though. I think that I'm nicer to you too. You **** dick. I think that like what Nick's saying is like spot on, but I, I think that what people need to realize too is that, you know, the division of labor, I think is really important too. For instance, uh what Nick does for us in terms of the look of the videos and he doesn't cut so much anymore now we have Kevin where, but he, he's going to cut our biggest videos. I mean,",
      "start": 6846.72
    },
    {
      "text": "important too. For instance, uh what Nick does for us in terms of the look of the videos and he doesn't cut so much anymore now we have Kevin where, but he, he's going to cut our biggest videos. I mean, he cuts the ones that like really need, yeah, exactly. That's something that I'm not super convinced that you can learn on your own as effectively as it was being taught to you, but you can learn on your own and I think that that is, you know, like for instance, like I, what we do with this business, I learned nothing in school that helped me for this business, but Nick did. And so you have to like and and so like you have to kind of look at it as like what do you want to do specifically and how how best can you educate yourself or prepare yourself for the thing that you want to do because we all do different things here. Like when we were at IGN and then they gave us an and I'm thankful for that to be in front of a camera, the fact is that no one ever once came up to me and told me what to do or how to",
      "start": 6881.36
    },
    {
      "text": "things here. Like when we were at IGN and then they gave us an and I'm thankful for that to be in front of a camera , the fact is that no one ever once came up to me and told me what to do or how to do it, ever, not once. And once we never trained anyone. No, and I think that like it's, you know, like the first time I was in front of a camera, it's like do your thing and I got used to it and I kind of tried to emulate Greg and that didn't, you know, that worked out to a degree, but then I became my own person and kind of Greg's, you know, lieutenant or whatever where it was like we were just, we worked together, we weren't the same person, we were actually quite different. Um, and that came naturally, that that came through experience and so you have to just try do those things. I think I'm actually really good on camera, but I wasn't and the fact is that no one taught me anything or gave me any CRA practical knowledge to get better. Funny, it's so funny because I don't remember either of you ever",
      "start": 6919.64
    },
    {
      "text": "really good on camera, but I wasn't and the fact is that no one taught me anything or gave me any CRA practical knowledge to get better. Funny, it's so funny because I don't remember either of you ever being bad on camera. I'm sure we were at some point because you, there was no bar to set it to. There's no, there was no example of this is good and this is bad. I mean, you figure Damon had a few months lead on everybody, right? And that's always the funny thing. Everybody always gives IGN **** for and us obviously as part of that as being offsprings of I is starting videos is what's up everybody and like everyone and like that's the same thing. No one trains anybody when you bring somebody in, everybody just starts at what's up everybody and everybody's, I get, I get credit for that a lot. That's Damon. Damon was the first editor on camera and he started what's up everybody. So when you took random editors and put them on camera and they, they were like what's up, say they were like what's up every, we",
      "start": 6953.24
    },
    {
      "text": "Damon was the first editor on camera and he started what's up everybody. So when you took random editors and put them on camera and they, they were like what's up, say they were like what's up every, we were em ulating each other. That's the point is that it took time. Yeah, it took a lot of time. That's a really, really, really, really key uh aspect of all of this. Uh I heard an interesting thing the other day, I've heard it before, but it resonated with me finally the other day, uh where they were talking about, I was watching some report talking about they, they were interviewing an actress, I think it was Emma Stone or someone like that where they had said, um Lucille Ball, you know, how does it, it was definitely Lucy and Desi now they were saying what does it feel like to be an overnight success and she goes, there's no such thing as an overnight success. I've been acting for 15 years, like I've been doing going on on auditions and doing small bits. I just now became a part of the public consciousness uh",
      "start": 6986.36
    },
    {
      "text": "there's no such thing as an overnight success. I've been acting for 15 years, like I've been doing going on on auditions and doing small bits. I just now became a part of the public consciousness uh because of this role I had in in Superbad, right? Because that was thing, it might not be Emma Stone, so don't quote me directly on that, but you get the picture that if you're going to go out there and do it, know that this is a long, long, long road ahead of you. So a, you better love it and B, you better have people around you that are down for this lordship with you because if if you don't, it's it's not going to work and that's not a bad thing. Some things fail, a lot of things fail. I, I did, I me used to, I used to had a business before I came IG and totally failed. Didn't was business, it was wedding videography. I hated it. Shadow Boxing, it wasn't Shadow Boxing that you can't make money on Shadow Boxing because you can't capture Shadow Boxing in a box. Ah, box your wear out out of it. I see you box your out",
      "start": 7024.0
    },
    {
      "text": "I hated it. Shadow Boxing, it wasn't Shadow Boxing that you can't make money on Shadow Boxing because you can't capture Shadow Boxing in a box. Ah, box your wear out out of it. I see you box your out of, I see all right. Um, but yeah, just so have patience and find a group that you can collaborate with and just keep grinding and set goals for yourself. Um, and that's the other thing with with high with college is that it does teach you to be more goal head y. If you're not a person that gets up every day and goes, we're going to do this, like Tim is that guy. Tim's like let's go make a video, we're making a video this weekend and I'm like dude video this weekend. Um, if you're not that kind of person, go to college because college will at least put milestones in front of you that you have to achieve Y and that's very, very, very, very important. I was talking to my buddy and we want to do another short film, we want to try to do a short film for Horror Fest, New York Horror Fest which is happening next year.",
      "start": 7061.56
    },
    {
      "text": "that's very, very, very, very important. I was talking to my buddy and we want to do another short film, we want to try to do a short film for Horror Fest, New York Horror Fest which is happening next year. Um, Phobia 2 and totally uh Mransky special and I was talking to him and we both realized we came to the conclusion that we were like if we don't have a goal, a deadline for something for this thing, it'll never get done. So I'm like the most important thing is having those goals, those little mini milestones that you can put in front of you and college kind of helps teach you that you have, you know, uh midterms, you have what the hell do they call them at the end of the semester, final exam, final finals, right? Um, all those things help structure you and and you can take that forward with you to to help motivate you in life because let me tell you when you're a content creator, it's all self motivation. I mean, this guy is no offense to Colin, but this guy is the single most motivated human being",
      "start": 7098.32
    },
    {
      "text": "motivate you in life because let me tell you when you're a content creator, it's all self motivation. I mean, this guy is no offense to Colin, but this guy is the single most motivated human being I've ever seen. Offend at all. I would be, I would say the same thing and like, you know, sometimes I literally like the other day I wanted to pull you aside on Monday like or I think it was like Friday, I'm like dude, are you sure I know you, I know that you wanted to go to the uh uh charity event cuz it was the right thing to do, but I was like, are you sure you want to go cuz you were **** dying man, like you were tired and I could tell you were burning out. Um, but it's because you love this so much and you are that selfmotivated person whereas I think Colin and I are a little bit more like let's get the work done and compartmentalize and maybe just kind of watch X-Files at night. Yeah, I, I me I need , I mean, I need time. I mean, I've always admired, I will, I'll never be like Greg because I, I fear the",
      "start": 7135.72
    },
    {
      "text": "the work done and compartmentalize and maybe just kind of watch X-Files at night. Yeah, I, I me I need, I mean, I need time. I mean, I've always admired, I will, I'll never be like Greg because I, I fear the burnout and I've seen it from, I know Greg better than pretty much anyone on this planet. I think that like I've just seen it and you don't want to see it and it's not not that it's a bad thing, but it's just like he burns out and I don't want to get to that point where I'm like I just **** don't want to do anything, you know, like and so I work really hard as Greg knows I get a lot of my work done like at night like just randomly like late at night I'll just sit at the kitchen table and just start like doing ****. Um, but like I think that to me one of the things that we haven't touched on I think is is is essential is I I for me I think the the understanding of doing things for the right reason is important too. The example I give is um don't do internet video if that's what you want to do to",
      "start": 7167.44
    },
    {
      "text": "is is is essential is I I for me I think the the understanding of doing things for the right reason is important too. The example I give is um don't do internet video if that's what you want to do to be famous cuz I don't think that that's an effective way to go about business. You know, you become famous and I'm not saying we're famous cuz we're not, but you become famous, you become well known or you're good at what you do because the people out there like what you do and that's what's important. You know, and that's the one thing I keep in my mind every day when everyone's like oh I love you and I appreciate you and get really nice tweets and um you know you take that stuff for granted and be become easy to get a big head and every day I I diminish myself and my own abilities in my own mind to be like you're not that great and you're no Emma Stone. No, I'm not, but I have to tell I'm like you know what Colin, you're like you are lucky, yeah, you are blessed, you have a little bit of talent and",
      "start": 7203.12
    },
    {
      "text": "to be like you're not that great and you're no Emma Stone. No, I'm not, but I have to tell I'm like you know what Colin, you're like you are lucky, yeah, you are blessed, you have a little bit of talent and you had a lot of luck and you better **** never forget that, you know what I mean? And that's what I tell people all the time when they're like um man you're so you know you're so blessed you must have been a great writer at 16 or 17 or 18 to get a job at Ian as a freelancer that young or stuff like that. I'm like Hey listen, I was a good writer, but you know what it could have been any one of a hundred people in that group of people I was writing with the GameFAQs and it was me and I I know that on on a Tuesday instead of a Wednesday they'd have found someone else and it would have never happened Fame to make sure that the things that I do resonate with people as much as possible and if they're happy I'm happy and if they're not happy I'm not happy and that's basically it because I know",
      "start": 7245.4
    },
    {
      "text": "Fame to make sure that the things that I do resonate with people as much as possible and if they're happy I'm happy and if they're not happy I'm not happy and that's basically it because I know that tomorrow it can disappear and you better not get too attached to it, you know what I mean? And so like that's that's the one thing that I try to keep in mind is to do things for the right reasons. I make content not because not to make content, I make content because I really do believe that people out there want it and if there's no market for it, there will be no market for it and then you don't want to base your self worth on your own fame or your own um inflated form of ego whatever which is why like I try to be as thankful as possible, I try to be as humble as possible. Like I don't um I just want people to remember that that it's easy to get an inflated sense of selfworth because of the things you do if you do a big video or whatever, but man like I look at some of the videos we do I I told I",
      "start": 7288.8
    },
    {
      "text": "people to remember that that it's easy to get an inflated sense of selfworth because of the things you do if you do a big video or whatever, but man like I look at some of the videos we do I I told I talk all the time I'm like you know Tim has a lot more insight into this than I do because he's just a lot smarter with the stuff than I am but where I'm like I don't understand why this video didn't do well and this video did do well and if you just focus on the video that did did well and not the video that didn't do well then you learn nothing, right? You know what I mean? And like and that's and that's like what so I'm just trying like if you want to be an historian, you want to be an archaeologist, you want to be a writer, you want to be a journalist, you want to be a video creator, you want like do it because you love it and you like to do it. Don't do it because the end result yeah is 100,000 views. Don't do it because the end result is a huge book deal. Don't do it because the end result is",
      "start": 7327.52
    },
    {
      "text": "do it because you love it and you like to do it. Don't do it because the end result yeah is 100,000 views. Don't do it because the end result is a huge book deal. Don't do it because the end result is you're going to, you know, I just want I I think context is really important in keeping like kind of yourself in Che check and your own motives in check is really, really important especially don't do it, don't do what he's saying is don't do it for the money and don't do it for the money especially the ad Rev on YouTube is ter yeah. I mean that's I mean that's what we said they take 50% of everything with you know I I was saying on Colin and Greg live that you know the PAX East panel is a 100 th you know why we exchange $100,000 for 100,000 subs and I think it's a really clever clever name for the panel that Greg came up with and the fact of the matter is yeah like if we were doing this for fame or for money we wouldn't have left IGN because we were more with a bigger platform at IGN and we were",
      "start": 7355.84
    },
    {
      "text": "that Greg came up with and the fact of the matter is yeah like if we were doing this for fame or for money we wouldn't have left IGN because we were more with a bigger platform at IGN and we were making more money and like that like when everyone was like I just and I was saying like everyone's like oh they made $25,000 each I'm like no Greg was making $10 0,000 a year don't blow the panel you know what I mean? And and like that's the thing you got to find the right reasons to do things right. There can be happiness found in a little cottage on a mountain somewhere making no money like someone can find happiness there like there's no internet there it's not fun I don't know I just I just want people to keep in mind that like you're going to try to do things and you're going to fail at them sometimes and and just that we're self-aware enough and aware enough just generally it's not even self- awareness it it's just awareness",
      "start": 7392.88
    },
    {
      "text": "going to try to do things and you're going to fail at them sometimes and and just that we're self-aware enough and aware enough just generally it's not even self- awareness it it's just awareness that we are blessed and lucky because there are a lot of people a lot better than us doing **** like this that don't get the notoriety we do and it's because of a right it's because of a right place right time kind of luck thing you have to just remain grounded you know what I mean? That's really important. I always tell people that like the the reason we work is because like Nick was saying before and I think the reason we work and we're and we're maybe we're special in the space is because we really are a strong team and I often think about well teams win championships and the weak like it is a contrive Sports thing and I played you know hockey and I know because they say like the weakest link is really the biggest deficit to a team you know and um so just keep certain things in mind stay",
      "start": 7431.44
    },
    {
      "text": "a contrive Sports thing and I played you know hockey and I know because they say like the weakest link is really the biggest deficit to a team you know and um so just keep certain things in mind stay grounded like stay disciplined if you want something chase it but Chase it for the right reason Chase it for a Love of the Game you know not not for the **** the contract that you're going to get because you're good at it yeah and I think you know again to to sort of at Greg's point and we are getting long on this episode but it's good it's a good episode go ahead and reiterate the same thing I already I'm going to iterate should I reiterate yeah reiterate reiterate reate I'm going to res ay what you said uh which is that you know you can do both you can go to college and you can also create and and in most instances you should and you should do that and here's why because production is really hard and production you know when you start getting up to you know working on Commercial work",
      "start": 7468.8
    },
    {
      "text": "and and in most instances you should and you should do that and here's why because production is really hard and production you know when you start getting up to you know working on Commercial work or doing anything that that involves travel you're getting to like 12 to 18 hour day sometimes if you can't do that now while you're going to school and you can't find time to make a podcast for two hours and figure out how to get it on on YouTube you can't find that motivation in you you're this is probably not the right thing for you and that's okay and that's okay that's that's that's fine but you know we used to come over here and start this show at like 8 o'clock at night and that was hard man it's hard like I would look over at Greg and Greg would be like off in a different world I'm like it's time to wrap up Greg and I'm I'm sending you the mental like hey man wrap this segment I'm like no reiterate the same point you're like rate the same point no I I think I I I was going to be",
      "start": 7504.12
    },
    {
      "text": "it's time to wrap up Greg and I'm I'm sending you the mental like hey man wrap this segment I'm like no reiterate the same point you're like rate the same point no I I think I I I was going to be nicer to you this month I don't mean to it's a joke I'm joking love them you know no but but I'm saying like and that that's that's thing you guys have to realize that it it starts and ends with you if you if you stop listening to this right now after this episode's done and Greg's done um pitching all the stuff that he's going to pitch on at the end of it um the rigal and you you immediately do something that it it takes a positive step toward creating a video or to creating something then this is probably the right track for you if you internalize this and go huh interesting and move about your day that's okay but apply to something else know that this takes you know a huge amount of self motivation to do as just all creation and know that that has to start with no one's going to come in",
      "start": 7540.56
    },
    {
      "text": "day that's okay but apply to something else know that this takes you know a huge amount of self motivation to do as just all creation and know that that has to start with no one's going to come in and tell you what to do it's not going to and that's a great point just in the sense that I think about my own experience at NU when I was there and like how **** busy I was and like I really don't know like where I got it from or how you know how I found the motivation where like I like everyone was always I remember my friends and a lot of people in college are like I they the afternoon classes or they start 11:15 or whatever I would take 8:00 a.m . and 9:15 and 10:30 a.m classes because I'm like I need to get this **** out of the way you know what I mean? Because then I need to dedicate five or six hours to writing the strategy guide and then oh it's snowing and I need I'm going to go do snow REM to make money on the side and then I got to hang out with my girlfriend then I got to do my",
      "start": 7572.6
    },
    {
      "text": "or six hours to writing the strategy guide and then oh it's snowing and I need I'm going to go do snow REM to make money on the side and then I got to hang out with my girlfriend then I got to do my homework and all these kinds of things that was my life you know at Northeastern like I worked a lot and like if you have to find that kind of motivation to get your classes out of the way to do all those things and I still found time to party and I still found time to get **** up and I still found time to be like do all those things at college students do yeah but it was it was a matter of you have to be motivated and you and it's if you want to be a chemist you have to be motivated if you want to be a mathematician you have to be motivated if you want to be a journalist you have to be motivated you want to do this you have to be motivated I don't think it's any different it's just a matter of where you funnel and the other important thing to remember and I think this is really true is",
      "start": 7607.32
    },
    {
      "text": "you want to do this you have to be motivated I don't think it's any different it's just a matter of where you funnel and the other important thing to remember and I think this is really true is that the the the old adage is takes about 10,0 00 hours of doing something to become really good at it and and that's true and I think about how do we become so good at podcasting how do we become because I think we are I think we're really good at Greg and I are especially you know Nick's newer and Tim's newer to it and we're all good but how did Greg and IUN become so good at podcasting to the point where like Colin and Greg live needed literally no we didn't even talk about the show before it started it just was what it was and we did it well it's because we **** did it forever you know how did I become good at writing about games or how did Greg become good at writing games because we did it for forever so also be patient with your own limitations because when I go back and read some",
      "start": 7637.76
    },
    {
      "text": "did I become good at writing about games or how did Greg become good at writing games because we did it for forever so also be patient with your own limitations because when I go back and read some **** that I wrote 10 years ago it **** sucks yeah you know what I mean? Yeah and and that's just I read some stuff that I wrote when I was high school and college and it's great but I read some stuff where I'm like and so I don't want to like act like that sometimes I'm surprised when I read some stuff I wrote on game like like actually this is pretty good uh but there's some stuff where I'm like man you had no idea what you're talking about what a dumb thing to say what a dumb thing to do why did you structure it like this where's your **** Oxford comma and like why did you where's the power graph break and all this kind of stuff it's like and it's the same thing with making film or making video it's like just be be patient with your own limitations because you're going to run into",
      "start": 7667.52
    },
    {
      "text": "power graph break and all this kind of stuff it's like and it's the same thing with making film or making video it's like just be be patient with your own limitations because you're going to run into limitations but you overcome them by dedicating the time necessary to overcome them yeah part of the fun of putting things online is that it is they there forever that's why the BF tapes aren't yeah that's what's happening it's going to happen no I don't think we should do that if Greg doesn't do it if Greg doesn't do it I'm going to do it no one knows where to find them they're somewhere in this house it's not a very big house ladies and gentlemen that's the GameOverGreggy Show each and every week for sometimes three best friends gather on this this table he's bring a random topic of discussion for your amusement if you like that you can get the whole show early over at youtube. no patreon.com kindafunny you just go to kindafunny.com if you don't want to give us any money on",
      "start": 7699.28
    },
    {
      "text": "discussion for your amusement if you like that you can get the whole show early over at youtube. no patreon.com kindafunny. You just go to kindafunny.com if you don't want to give us any money on Patreon that's totally okay go to youtube.com kind afunny get the show topic by topic day by day until the entire things posts on podcast services and youtube.com/ kindafunny each and every Friday gentlemen it's been a pleasure I think we've been saying for a long you know Colin danc Ronnie said you know the weak link I think it's it was Tim yeah I mean I thought it was going to be Kevin but Kevin is holding up his head in the bargain destroying Tim over here though he's uh 10 hours into his job so he's looking good so far what's amazing because I I keep look going over to like refence because Tim and I always throw each other looks every time someone says something ridiculous and I just lock eyes with this box of chachki yeah our giveaway box for and really at the end of the day you",
      "start": 7732.68
    },
    {
      "text": "Tim and I always throw each other looks every time someone says something ridiculous and I just lock eyes with this box of chachki yeah our giveaway box for and really at the end of the day you don't even notice it no no ladies and gentlemen until next time it's been our pleasure to serve you like um I'm trying to think of an example like anything anything with a chorus yeah like just like just any song any song like where you'll sing it's like you want to nobody now you want to know by and then like Greg's already singing the next verse and I'm like Greg you have I'm like just like in your head just think about the way the song sounds and try to replicate it you're not just saying the words try to sing on beat there's no beat I me March the Beat of My Own Drum do a deed my friend",
      "start": 7771.8
    }
  ]
}
