{
    "id": 721,
    "video_id": "r60Zj7T_MTc",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "Let's Play Shaq Fu - Throwback Thursday",
    "description": "Nick and Tim finally plays Shaq Fu.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1427398200,
    "duration": 899,
    "transcript_chunks": [
        {
            "text": "What's up , guys? I'm Tim Gettys. This is Nick Scarpino. What up? Now, Nick, a long time ago, I had a dream . Okay. A dream that one day me and you would play Shaq Fu. Oh, I know. It was more of a nightmare, I'm assuming . Oh, no, no, no, no. This is a Throwback Thursday. Okay. To a game that we've never played. Never played this. So , I don't know if that's how Throwback Thursdays work, but for us it is, cuz this this game is a Do you know anything about this game? Um, yeah. Shaq is in it and he's a master of Kung Fu. Cool. And uh you know we have set he's an entity of ancient evil defeated 3,000 years old. He's 6'10. Let's jump into this Nick. Let's get out. Let's get nasty with it. So it says Oh, what what happened? Did we crash? Nope. No, we're in demo mode. Hit the hit start, Nick. I just hit start. All right, let's The controller is not as responsive as I'd like it. Okay, here back menu. So, here we got the hero of our story. Duel or story. Shaquille O'Neal himself. Let's go into",
            "start": 0.16
        },
        {
            "text": "hit start. All right, let's The controller is not as responsive as I'd like it. Okay, here back menu. So, here we got the hero of our story. Duel or story. Shaquille O'Neal himself. Let's go into story. Let's do story. I want to see how this breaks down. It's kind of weird that Duel was above story. We should note that this was given to us by some friends uh who supplied it for us. Knowing that I am the Shadow Boxer or was the Shadow Boxer, they thought this game might be fun for me to check out. It makes sense. We got a little Pepsi sponsorship going on. I already don't like it. I know . Come on, guys. Step your game up. Cocoa or nothing. All right, so they're in downtown Tokyo right now. Stumbled upon a Kung Fu dojo with an old man inside, right? Cuz you know Shaq's just walking around. Shaq just goes Tokyo. You know why he goes Tokyo ? This is the one city that no one recognizes. That's why he goes Tokyo. And this dude definitely doesn't stand out. Greetings big warrior. That's not",
            "start": 44.24
        },
        {
            "text": "Shaq just goes Tokyo. You know why he goes Tokyo? This is the one city that no one recognizes. That's why he goes Tokyo. And this dude definitely doesn't stand out. Greetings big warrior. That's not racist. You're the one from the stars. I presume. I thought you'd never lived. I thought I'd never live to see this day. Okay. I don't know the hell that means, but cool. What do you mean by big warrior? I'm an all-star if that's what you mean. You do Shaq's voice. I'll do the other voice. We have a game tonight. Would you like to come? It's going to be quite a battle even though it's for charity. Are we serious? Charity battles are. Oh no, young warrior. I'm too old to be frightened. No, to be fighting, but I wish you well. You must hurry now. This is really hard to read this text. If you were to say this little boy, Nu, that is if you really are the magic one. No, of course I'm the magic one. I'm Shaq. I know. I'm not sure what you mean talking about, old man. I'm just sightseeing before",
            "start": 80.72
        },
        {
            "text": "to say this little boy, Nu , that is if you really are the magic one. No, of course I'm the magic one. I'm Shaq. I know. I'm not sure what you mean talking about, old man. I'm just sightseeing before my game. Really Chinese? Isn't he supposed to be in Tokyo or is this in China? No, it's Shak Fu. Yeah, Kung Fu is Chinese. What the hell is he even in Tokyo? I mean, I think Shaq himself designed racist. Maybe the guy's Chinese living in Tokyo. That's Yeah, that's true. All right, let's just let's just get through this because explain. Go through this portal, find Nezu, and save it before it's too late, and you can get your charity ball. The charity ball. Yeah, magic charity ball. Shack enters the second world. The second world cuz this world is the first world. So, oh **** First world. Second world problem. Whoa. Where am I? I'm just going around. Oh my god. Should we go to the waterfall first? Shack's really big. Like, he's as big as the tree. Well, that's Sha. What are you walking?",
            "start": 123.76
        },
        {
            "text": "world problem. Whoa. Where am I? I'm just going around. Oh my god. Should we go to the waterfall first? Shack's really big. Like, he's as big as the tree. Well, that's Sha. What are you walking? Let's go into the Veabond temple. That makes sense. Going in. Uhoh. Oh my god. Be careful, Prince. You might hurt yourself with those swords. Is that Prince? That is Prince Adam. Yeah. Oh, man. There he is. You should think twice about that. So, I guess I'm fighting this dude now. You're fighting a dude with swords. Oh **** Oh **** Why is Okay, so Sha Fu is a fighting game. Okay. Well, didn't know that. For some reason, I thought it was uh sidescrolling beat him up. I I would have assumed as well, but this is a All right. Uh now, I can tell you right now that the control on this game leaves much to be desired. I probably should have read the instructional manual first trying to throw a fireball right now and it's just not happening. Yeah, there's a lot of issues going on with this game.",
            "start": 163.2
        },
        {
            "text": "much to be desired. I probably should have read the instructional manual first trying to throw a fireball right now and it's just not happening. Yeah, there's a lot of issues going on with this game. Like the But I do appreciate Shaq's still in his uh kind of baller outfit. He's ready to hit ball whenever he wants the iron. What other outfit would he wear, Nick? That That's silly. I'm taunting that button. Tauntsa. Okay. I'm still trying to get a feel of what these what the this the Oh, there you go. Oh, damn it. You're doing back flips. All right. The heads up display of this game is really weird. I don't understand it, but I pretty sure your your health's low now. Shaq's looking mighty upset up in the top . Is there a round two? I'm I'm going to assume. Yeah. Okay, that's round two. Okay, so I'm going to just try to punch this guy to death. Nope. He just kicked my ass. Oh man, this looks so clunky. It's it I don't know whether it's the because we're, you know, I don't know whether",
            "start": 209.12
        },
        {
            "text": "so I'm going to just try to punch this guy to death. Nope. He just kicked my ass. Oh man, this looks so clunky. It's it I don't know whether it's the because we're, you know, I don't know whether it's the old controller or the game the interface itself. There's some issues, but everything is on a 75 second lag. So, but this move seems to be working out okay for me. Who designed the timer in this? That just like is hideous. Why are we getting the milliseconds? We don't need that. And why is one of the seconds much smaller than the other one? This is kind of a dick. What's going on, dude? What? I guess punch punch Prince in the Look at that. Look at that. Look at this like fireball move that I have. Doesn't even go anywhere. Just kind of lights your hand on fire. Oh, we got a You got the pimp slap. Pimp slap Prince, dude. He has it coming. No, Prince. God damn it. Well, I lost. Shack. Tim, I'm going to go on a limb and say I don't want to play any more of this game. No, we got we got to",
            "start": 249.68
        },
        {
            "text": "slap. Pimp slap Prince, dude. He has it coming. No, Prince. God damn it. Well, I lost. Shack. Tim, I'm going to go on a limb and say I don't want to play any more of this game. No, we got we got to keep going. I can't beat this guy. You should retire early, buddy. That's what Prince is saying. Prince up. I'll tell you one thing about Prince. Um, let's go to somewhere else. I don't want to hurt that guy. Go to the waterfall first. Look at I want you to note though that that the old guy's shop just burst through the rock here. Yeah. So, we're in world two right now. Let's go to the waterfall first. See if there's anyone swimming naked here. Yeah. And the catwalk falls. Jesus. This is sexy already. Yeah. I'm too sexy for my shirt. Oh. Oh, Kyrie. She going to do some serious damage to your body, Nick. So, is this like a is this like Street Fighter where you instead of flying to every part of the world, you just kind of walk over to walk to the waterfall and see what happen? I guess that's",
            "start": 294.96
        },
        {
            "text": "Nick. So, is this like a is this like Street Fighter where you instead of flying to every part of the world, you just kind of walk over to walk to the waterfall and see what happen? I guess that's what this is. And this is what they're trying to be. We got the cat lady. Okay . Oh, she's fast as hell and furious. I'll tell you furious. What? I'll tell you, Shaq moves a lot like I would imagine him in a fight. Okay. Um where he's clunky and it takes about 75 seconds to get his foot around. What are your favorite Shack memories, Nick? Uh I don't have many. What? Uh there used to be um No, I don't have many Shack memories. I'm not a big basketball fan. I'm not a big Space Jam fan. Um Shaq wasn't in Space Jam. There you go. Um Damn it. As far as I remember, I might be wrong about that, but I really don't think he was. Space Jam for like a scene, wasn't he? I don't I don't think so. I remember Steel. That was his big uh That was his big cinematic tour to force. There was a a big movie that",
            "start": 336.08
        },
        {
            "text": "don't think he was. Space Jam for like a scene, wasn't he? I don't I don't think so. I remember Steel. That was his big uh That was his big cinematic tour to force. There was a a big movie that I'll never forget called Kazam. Oh, Kazam. Yeah. Important. Um I like when people make fun of him a lot. Um the guy, you know, it's it's hard to bring down a guy this size both emotionally and physically. Um Shaq obviously one of the higher paid athletes out there. Great point guard. Is that correct? I don't even know. He plays basketball. What does Shaq do? Is Shaq the point guard? Colin says go. Yeah. Colin Colin doesn't care about Shaq people. Um what are your what are your childhood memories of Shaq? Well, Kazam and uh is it Kazam? Is that what it's called? Kazam. Yeah. Well, he was like a genie that was like gave you some cool stuff. The most important one was the hit Aaron Carter song, How I Beat Shaq, where Aaron Carter dreams . No, he doesn't dream. Dude, how projectiles? Where the",
            "start": 375.04
        },
        {
            "text": "genie that was like gave you some cool stuff. The most important one was the hit Aaron Carter song, How I Beat Shaq, where Aaron Carter dreams. No, he doesn't dream. Dude, how projectiles? Where the **** hyp projectiles? He beats Shaq in a basketball game and all his friends are really impressed with him naturally, but then he wakes up and it's a dream. And then he wakes up and he's he's bankrupt. He's like, \"Shit, not yet. Not yet. Now that this is before the drugs and all that.\" Remember when Oh, I took cocaine Carter. Um, but yeah. So, Aaron Carter, he made this song. He beat Shaq in a basketball match. All his friends were super impressed. But then he woke up and it was all a dream. But then he looks over in the real world and he sees Shaq's jersey. So it wasn't a dream. Oh no. I love those. I love the old music video trope of I'm having sex with Paul Abdul or dancing whatever. Then I wake up. Oh, it's just a dream. And then Paul Abdul like panties are still there. It wasn't a",
            "start": 417.76
        },
        {
            "text": "those. I love the old music video trope of I'm having sex with Paul Abdul or dancing whatever. Then I wake up. Oh, it's just a dream. And then Paul Abdul like panties are still there. It wasn't a dream. So it's pretty much that exact same video. But did you just lose again? Tim, go after yourself. Let me let me try. You want to try? Yeah. Go for it. Man, let's see. Should I go to Cat Lady or should I go back to Prince? Uh, you they're both equally as hard. Let's see. Is there somewhere else you can go? You might be able to cross this bridge area. No, just jump under the water. The bridge area would gargo Peak. Gargo's Peak. Let's go in naturally. This dude looks hard. I also like the a second ago the apostrophe was in the wrong place for cargo oils. Yeah. Oh, cool. He just said something. He's going to whisper something in my ear. Man, things are about to get weird. See how it's going to be. All right, let's do some back. Oh my god, this guy's fighting style is absurd. If done right,",
            "start": 458.4
        },
        {
            "text": "He's going to whisper something in my ear. Man, things are about to get weird. See how it's going to be. All right, let's do some back. Oh my god, this guy's fighting style is absurd. If done right, no can't defend. Bring it. Just, you know, to hold him off. You got him. Just avoid him. You're going to win this one. I feel What the **** was that? Oh my god. Yeah. See, they all have projectiles. So really, I'm sure we do, too. We just don't know how. All right. Damn it. You're right. The lag on this is something special. It's something It's something special. I mean, let's put it this way. The game's hanky to begin with, but the additional lag is not really helping. Not that Not that I think it would matter if this thing was like Oh my god. precise. If it was pinpoint precise. Keep it just stay in the air. It seems like that's really working for you. Also, like what does this smaller mean? Yeah, there's a lot of things going on. A lot of question. Oh, god damn it. Is that a combo",
            "start": 505.28
        },
        {
            "text": "just stay in the air. It seems like that's really working for you. Also, like what does this smaller mean? Yeah, there's a lot of things going on. A lot of question. Oh, god damn it. Is that a combo meter? What? I felt like I was doing okay there. Yeah, you lost cuz you lost time and he All right. All right. Three quarters life . The problem is it doesn't work on like a Street Fighter quarter circle system, but it doesn't work on a Mortal Kombat system either. It doesn't work on the the back to to front Mortal Kombat system either. So, all right. Or the button combo Mortal Kombat I said. So, I don't know. All right. He is he's got a lot of uh vertical ability as you would expect Shaq to have. Yeah. Uh but right now the the gargoyle in the Jordans is kicking the **** out of you. I just want you to know that two things about that. A he's got excellent quads and B where did he get the golden Jordans from? I don't know if they're Jordans. I don't think Shaq would have Jordans in his in",
            "start": 559.2
        },
        {
            "text": "you to know that two things about that. A he's got excellent quads and B where did he get the golden Jordans from? I don't know if they're Jordans. I don't think Shaq would have Jordans in his in his game. What was Shack? This isn't Jordan foo. What was Shaq's shoe? Did Sha have shoes? Shack. She had Shacks that were exclusively at Pay Less. Oh my god, that sounds terrible. It's a true story. Did you have a pair? I did not. My brother did. Oh, come on. One of the verses of basically Yeah, this is it's impossible. This is, by the way, like this is like game. All right. Any of these are like blow one. So, I can't imagine how hard this game gets. I'm going to go on a limit and say I don't ever want to play this again. You know what? You try again. It's too early to say. We got to We got to put at least one more match up. One more match. Yeah. Try, Prince. Let's see. Yeah, let's go back to where it all began. Is there maybe we have to train first. Can we go in here? No, they don't they",
            "start": 603.68
        },
        {
            "text": "put at least one more match up. One more match. Yeah. Try, Prince. Let's see. Yeah, let's go back to where it all began. Is there maybe we have to train first. Can we go in here? No, they don't they are just like forget the bag of temple. Does the tree have anything? No, it's just for looks. Shack's so big. Oh, Shaq. All right, this prince. How just racist games were back then. Yeah, zero **** given. Zero **** given. Battle four. So, they're counting our battles here. Oh, great. Maybe we have to fight 17,000 for the let us win one. Yeah, that's probably what it is. We're not bad. We're just Look at that big ass hand. Give my hand. Oh my god. How am I not hitting you? There's Yeah, I don't know. I don't know. This guy maybe I just can't figure it out cuz I want to think it's like a boss battle. We have to figure out like his his move set and like figure out a strategy to beat him , but it's not. It's Street Fighter. Oh, he went into fury. He's pissed off. Get him. Get him. Get him.",
            "start": 641.12
        },
        {
            "text": "battle. We have to figure out like his his move set and like figure out a strategy to beat him, but it's not. It's Street Fighter. Oh, he went into fury. He's pissed off. Get him. Get him. Get him. He can't fight. He can't think. Get him. You got him. Tim, get him. Tim, he's in fury mode. Thanks, Nick . What the **** does that mean? What does it mean? How am I going to lose this? You're losing us. Come on, Tim. Get him. Get him. Get him. Get him. Am I hitting him? Yeah, you're you're hitting him. Think. I don't know. He's taking it in the gut like a champ. Dude, my range is like garbage. Yeah, for a man that's 6'7 like 72. Get him. Yeah. Shack wins. Look at Look at his little dance. Oh, he's doing the shack dance. He's doing He's feeling shake shack. Shake Shack. I like that. All right. Same strategy. The old jump jumping kick. Oh my god. He figured that out. He did. He's good. He is. He's can do two things. Well, he can shred on guitar and he can kick Shaq's ass. Get him. Get him.",
            "start": 692.0
        },
        {
            "text": "Same strategy. The old jump jumping kick. Oh my god. He figured that out. He did. He's good. He is. He's can do two things. Well, he can shred on guitar and he can kick Shaq's ass. Get him. Get him. Get him. Get his ass. Kick that princess ass. Well, I mean, you're not doing any damage to him when he's like in the middle. Oh, yeah, you are. You just crushed him. Hey, that that flying kick really did a lot of damage to him. I'm kicking him right in the dick, too. Yeah, just that move seems to be working for you. So, just you got 3 seconds. Just back off and fight for Christ's sake. Oh my god. You better not lose this fight. I don't know. There's two minutes left. What the What is this? Oh, wait. What? Oh god, Nick. No. That was **** The counter makes no sense. It counts down from 10 and then I don't know. All right, final round . All right, this is it. The make or break. Either way, we're not. This is the World Series. This is the World Series of Shak Fu fighting. I wonder how many",
            "start": 745.04
        },
        {
            "text": "then I don't know. All right, final round. All right, this is it. The make or break. Either way, we're not. This is the World Series. This is the World Series of Shak Fu fighting. I wonder how many people actually play this game and remember it fondly. I don't think anybody a lot of people. There was a Kickstarter recently to make a new version of Shak Fu. Yeah . I hope that failed. I don't I don't know whether it did or not. Correct me if I'm wrong, Tim, because I'm not as big of a gamer as you are. But shouldn't games be fun? Yeah, this one's just making my hand kind of cramp. Well, mostly because God, this is Oh, he had the Chunley kick. Chunley kick Prince. Oh, yeah. I would give anything for the Chunley kick right now. I mean, any sort of move that's special that could land with in Prince's face would be nice. Kick him in the dick. Yeah, dick kick. Dick kick him. Dick kick. Oh no, Tim. Resort to the dick kick. There we go. What? I was really close that time, but whatever. Whatever.",
            "start": 793.12
        },
        {
            "text": "face would be nice. Kick him in the dick. Yeah, dick kick. Dick kick him. Dick kick. Oh no, Tim. Resort to the dick kick. There we go. What? I was really close that time, but whatever. Whatever. That's shock **** everyone. Uh, in case you were wondering what the hell that looked like, that that's it. Down forward plus A or B. What? What? Down forward plus A or B to do what? The inferno kick. Should we try that? No. Game over, dude. Game over. Well, everyone, thanks for watching. That was fun. If you know how to play Shack Flu or know any of his special moves, please post them in the comments below. Uh if you thought this was fun, please subscribe to the channel. If you thought it was stupid, please subscribe to the channel. Please subscribe to the channel. Um and thanks for joining us, Tim. Thanks so much for playing Shack. That was cool . It was what it was. We got the power punch, the fast punch, fast kick, and power kick. None of it makes any sense. No. None.",
            "start": 839.6
        }
    ]
}