{
    "id": 673,
    "video_id": "rMOUdNQfJOc",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What Movie Would You Remake With Muppets - The GameOverGreggy Show Ep. 66 (Pt. 2)",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1425970800,
    "duration": 1042,
    "transcript_chunks": [
        {
            "text": "Nick , it's your topic. Okay, I got to pull it up. Okay, good. Thanks for being prepared. Well, I Everyone tells me to mess around with my phone beforehand. Stop. Why are you on your phone? Oh my god. Look how rude he is. You know, the dynamic changes when Harley comes because Colin used to always be on my side. I'm always on your side. I know. I love you for it. Uh, so I'm always I'm not I'm on everyone's in no one's side. I'm like 18th century US United States George Washington, you know. We're getting deep here. You know, so this this question stuck out to me when it was tweeted at me at Nick_Scarpino or remember if you have topic suggestions for the show, you can tweet them at me and like Psycholic. And I'm going to preface this a little bit. A little while ago, maybe two two three years ago, something came back into the mainstream consciousness that had been missing for a while. It was something from my childhood. Something that I revered, loved deeply. Pubes. No. Gross.",
            "start": 2.85
        },
        {
            "text": "three years ago, something came back into the mainstream consciousness that had been missing for a while. It was something from my childhood. Something that I revered, loved deeply. Pubes. No. Gross. That's disgusting. Shave. Those things come up. You shave them off. You shave them off if you want. Just to keep like a wet seal. Anyway, long story short is this. A while back, uh Jason Segel spearheaded a movie called The Muppets. He brought the Muppets back and I love the Muppets and I'm super glad that we live in in a world where the Muppets are relevant again. So, this question hits home close to home for me. Psycholic says, \"If you could remake any movie, but the cast of the movie would have to be with the Muppets, what would it be?\" I mean, you want a really hard question. Fast and Furious. That would be amazing. I knew you were going to say that. Oh, the entire series. That would be so awkward to remake Fast and Furious while Fast and Furious is still on with the Muppets. Like",
            "start": 50.48
        },
        {
            "text": "Furious. That would be amazing. I knew you were going to say that. Oh, the entire series. That would be so awkward to remake Fast and Furious while Fast and Furious is still on with the Muppets. Like rebooting the series while they're still like on episode 8. How awesome would that be? That See, that's a that sounds like something that they would actually Yeah, they would. That's like super Hollywood. Sounds like a Marvel cinematic thing. Yeah, exactly. So Mike, I have more questions as always when you bring these up. Yeah. Are the Muppets acting like Muppets with like Okay. Okay. 100%. Imagine Vin Diesel. We're family. Yeah. Yeah. But but the Muppets could act like people kind of like they could like the character like Kermit the Frog can be Kermit the Frog playing someone else. Treasure Island. Yes. Exactly. I mean, or Muppet Christmas Carol, like any of those movies. What was the one you said before all that? Which one? Treasure Island. Is that what he said ? Treasure Island.",
            "start": 98.32
        },
        {
            "text": "Island. Yes. Exactly. I mean, or Muppet Christmas Carol, like any of those movies. What was the one you said before all that? Which one? Treasure Island. Is that what he said? Treasure Island. Treasure Island. Did you say Dom dominatrix? Dominic Toretto. Thank you . You're hearing what you want to hear. I am hearing what I want. Miss Piggy. Is Miss Piggy Shades of Gray? Of course. Shades of Gray. 50 Shades of Gray. Muppets would be funny. Yeah. I tell you what I do, Miss Piggy. I **** Yeah, man. Yeah. Did you see this movie? What? 50 Shades of Gray. I did. Oh my god. What did you think of it? It was really bad. Yeah. Mhm. Cool. Glad we agree. I actually I actually read the book. Yeah. Because I was like, \"Well, this is what the **** is like. I should know what the **** is like. I want to carry on a conversation with these bitches.\" Yeah. And I uh I read the book and uh it was super like it was super I just I can't imagine being like uh a girl being like, \"You're going to make love",
            "start": 140.64
        },
        {
            "text": "to carry on a conversation with these bitches.\" Yeah. And I uh I read the book and uh it was super like it was super I just I can't imagine being like uh a girl being like, \"You're going to make love to me.\" And being like, \"Nah, I'm **** sign this document for me.\" Like there's no way. would never work. If you were a billionaire, it might But if you're a billionaire, what does that say about the girl where she's like, \"I'll sign your contract . Thanks for the car. Now give me that dick.\" Like blog. Yeah. Yeah. It's too much. And the movie was so like it was so like I felt like it was like whoever was writing it like and uh uh this uh room of men in suits have determined that this scene here will make 40-year-old vaginas moist. So, we're going to put that in there. I mean, Tim and I literally and Greg went and saw it the night it came out on a Thursday night, and we saw it just as a social experiment. No, I mean, we enjoyed how it was. It was an enjoyable experience only from the",
            "start": 182.72
        },
        {
            "text": "and Greg went and saw it the night it came out on a Thursday night, and we saw it just as a social experiment. No, I mean, we enjoyed how it was. It was an enjoyable experience only from the fact that there were so many women in the audience that were not taking it seriously. How many girls did we did you 15? We came with 15. It came with a row, an entire row of Asian girls. The best part was that like Nick didn't want to sit with us cuz we were up in the front row . So Nick bought a solo ticket to Fifty Shades of Gray and went and sat in the back of the auditorium next to other women. That was my favorite. That was my favorite part of the story. I had a big I had a 12-in hot dog that I was sucking on the entire time. And the worst part was I sit down and it was full. The theater was packed. So it was me. It was a couple to my left and then a single girl to my right. And so I sit down and she starts talking to me. So So she was by herself. She was by herself. She had decided to come",
            "start": 227.36
        },
        {
            "text": "So it was me. It was a couple to my left and then a single girl to my right. And so I sit down and she starts talking to me. So So she was by herself. She was by herself. She had decided to come see it. She was a little drunk. Um, and we were talking a little bit and then the two girls next to her were like, they leaned over to me and they're like, \"So, how did she get you to come into this movie? How did she drag you out?\" And I'm like, \"I don't know this person.\" And they were like, \"What the fuck?\" That was my favorite part of that story cuz Cheryl was like, \"Oh, why didn't you go why didn't you go to the guys? I don't want to **** see that movie.\" And and she was and I'm like, \"But you're going to like this part of the story.\" She's like, \"Oh, so Nick Tim and and Greg went together.\" I'm like, \"Yeah.\" She's like, \"Oh, Kabuki and all that.\" I'm like, but there's a a better part of the story. Nick and Tim are or Nick and Gregor are sitting together or I'm sorry, Tim and Greg are",
            "start": 265.12
        },
        {
            "text": "I'm like, \"Yeah.\" She's like, \"Oh, Kabuki and all that.\" I'm like, but there's a a better part of the story. Nick and Tim are or Nick and Gregor are sitting together or I'm sorry, Tim and Greg are sitting together. Nick got his own ticket and is sitting by himself somewhere in that movie theater and you **** know that that's the perfect scenario for this particular movie and that's why it was so funny and she started laughing and that was our visual of that. It was a little I felt a little creepy and I also felt a little creepy because I would have been fine in the front row. I had one bad experience with the front row. I got I came late to see the movie Gladiator when I was in like right out of college and and Gladiator by the way is filmed at like a super like a high frame rate or actually I think it's show low shutter speed so it's very framy like every time there's action you're like you're catching a lion and a **** sword and like there's a chain you're like what's happening",
            "start": 300.72
        },
        {
            "text": "I think it's show low shutter speed so it's very framy like every time there's action you're like you're catching a lion and a **** sword and like there's a chain you're like what's happening right now that's if you're sitting in the middle of the theater if you sit in the front of the theater you're getting a blur of colors the entire time with Russell Crow's great voice behind it was like what we do today at goes in eternity you're like that was amazing I don't know what the **** he is though I can't tell what's happening on the screen um and so after that point I was like vowed never to send in the front row gun. Like if I get to a theater late and there's only front row, I'm like I'm go I'm going to get You were also super stoned, I bet. No, I wasn't. I wasn't. I didn't smoke a lot of weed in college. I bet you did. Whatever. Is that you want to share with your audience? All right. No , I drank a lot. Okay. I was uh I was and I ate a lot of Del Taco. Are you familiar with this",
            "start": 335.04
        },
        {
            "text": "of weed in college. I bet you did. Whatever. Is that you want to share with your audience? All right. No, I drank a lot. Okay. I was uh I was and I ate a lot of Del Taco. Are you familiar with this fine dining establishment, Del Taco? I'm very familiar with Del Taco. And here's here's what I got to say. When I first had Del Taco, it was like 1997. I had Del Taco and I was like, \"This is better than Taco Bell.\" And I killed it. And then I came back like 15 years later, like two years ago, and I'm like, \"Dell Taco, it's better than Taco Bell.\" And I went and I had it and I was like, \"Oh, it's not.\" But I am going to make a very crazy call right now, okay? I want you to trust me on this. Okay? The Double Dell cheeseburger is just as good as an In-N-Out Burger. Get the **** out. And I want you to go and get yourself an In-N-Out Burger and get yourself a Double Dell cheeseburger and try them back to back even. Okay? That's on the real. So, a burger from Dell Taco. That sounds like a bad",
            "start": 366.88
        },
        {
            "text": "you to go and get yourself an In-N-Out Burger and get yourself a Double Dell cheeseburger and try them back to back even. Okay? That's on the real. So, a burger from Dell Taco. That sounds like a bad time. This is I know, but it's better than tacos. This is coming from a guy, by the way, though. You need to know where I'm coming from. I like Five Guys way better than In-N-Out. Hell yeah. I like Fatburger way better than In-N-Out. Yes, I agree with both of those completely. Fat Burger, maybe some Fat Burger, dude. Five Five Guys is so under Five Five Guys. There's some haters out there. It's really This guy hates it. Too much **** meat. Too much meat. He says Five Guys is too much meat. I don't understand. But like the thing with too much meat is really like cut your burger in half then and it's still better than In-N-Out. No, you don't need to eat it all. Like I'm also not the biggest proponent of In-N-Out either. I think he's saying the meat to bun ratio. Yeah, there's too much",
            "start": 408.72
        },
        {
            "text": "and it's still better than In-N-Out. No, you don't need to eat it all. Like I'm also not the biggest proponent of In-N-Out either. I think he's saying the meat to bun ratio. Yeah, there's too much meat in In-N- Out. The cheeseburger gets a little cheeseburger. The little cheeseburger gives you one patty. Sounds like some **** ass **** I don't do little. Well, you're speaking like a **** right now. That's true. I'll try. You know what? Also, this is a secret move for people that don't like too much meat at Five Guys, is ask for a grilled cheese sandwich all dressed and they put all their condiments and all their like jalapenos and onions and stuff into a burger bun and they grill cheese it and it's actually really phenomenal. Or the hot dog, you know, you like sucking on them dogs. I love them. I love them. The hot dog is really good, too. I don't know. I I don't know. I like their fries. My problem they do is they kind of trap your burger and then they dump the fries on top of it",
            "start": 447.84
        },
        {
            "text": "them. I love them. The hot dog is really good, too. I don't know. I I don't know. I like their fries. My problem they do is they kind of trap your burger and then they dump the fries on top of it to keep it hot. So you have to go reach into these burning hot fries to pull your burger out. Is that why they do it? Yeah. To keep it hot. Oh, I thought that was just their like their thing. We're like, \"Hey, just have some more **** fries.\" They're like, \"No, I'm a 14year-old making your burger. I'm just going to dump the burger.\" That's brilliant. I would have never known that ever. To keep it hot is to trap the burger in there so the cheese is all melty. Oh, interesting. I had no idea. You're right on though with with Five Guys in terms of the fixings that they put on like the different layer. Like they have I don't know what they call like everything in red or everything in yellow when you go in there. And it's like they like don't **** around with how much like if you get everything",
            "start": 486.16
        },
        {
            "text": "Like they have I don't know what they call like everything in red or everything in yellow when you go in there. And it's like they like don't **** around with how much like if you get everything on there, that burger is like literally four pounds, you know? It's just an incredible amount of **** on that burger. Yeah, I get I get the triple XXL at Fatburger also a lot. So I have my pictures up in numerous Los Angeles Fatburgers. Literally like me like like with the Triple XL challenge just hanging out of the beard. Colin, you wouldn't like Fatburger though. I think I like fat. I like fat. I thought they put mustard on the burgers. You just get it with no mustard. Okay. They're not like monsters. They'll let you change it. The big the big Colin has an aversion to mustard. I **** love with mustard . I just hate I just hate it. Makes me want to throw up. It comes from a very early scarring story when I was a child. And I we've told the story before, but I I grew up in New York. We",
            "start": 516.08
        },
        {
            "text": "with mustard. I just hate I just hate it. Makes me want to throw up. It comes from a very early scarring story when I was a child. And I we've told the story before, but I I grew up in New York. We do not put mustard on our burgers in New York. Even if you go to McDonald's or Burger King, like it's not a thing that they do. And so the first time you leave like Long I'm from Long Island. You leave the city or the tri-state area, whatever. And you I went to Connecticut, like Northern Connecticut, and they had mustard on their burgers. I was like, \"What the fuck?\" And I like almost threw up in the middle of the McDonald's. I was like seven years old. Ever since then, just can't do Mustard is super. To me, as a Canadian, mustard is very American to me. Like, if I have to think of like what's American food, I think of a hot dog with mustard on it. Why? Why? Why do I Why is that American to me? Canadian bollocks. Chicago. Plus, as Americans, we have a long history of eating the worst thing",
            "start": 552.4
        },
        {
            "text": "American food, I think of a hot dog with mustard on it. Why? Why ? Why do I Why is that American to me? Canadian bollocks. Chicago. Plus, as Americans, we have a long history of eating the worst thing possible. And there's nothing more processed or more fake hot dog. Pig button, pig face. It's like they take all the what they do is this is my understanding. Colin, you might know better than me than this. This is my understanding of how they make hot dogs. They take all the good part of the pig and they save that for the actual store. Then they take the rest of it, they grind it up and they throw it in a pig scrotum and then wrap it up at the tips. That's That sounds about right. Give it to you. The thing about hot dogs and to a much lesser extent sausages. I love sausage. Like I love love love sausage. It's just like I don't People are like, \"Oh, you know what's in that?\" I'm like, \"Do you think I give a flying **** what's in it?\" Like it's I don't This could be from another planet. I",
            "start": 583.44
        },
        {
            "text": "sausage. It's just like I don't People are like, \"Oh, you know what's in that?\" I'm like, \"Do you think I give a flying **** what's in it?\" Like it's I don't This could be from another planet. I don't care. It tastes good. Here's the thing, and I'm I'm curious about your guys thought about this, especially Harley. The upcoming battle of burger supremacy is going to be Shake Shack versus In-N-Out because Shake Shack just went public. So, you know that Shake Shack is going to be Shake Shack. Shake Shack. I I was talking to someone about this. I'm like , Shake Shack is going to inevitably come to California and In-N-Out is going to have real competition for the very first time for people that are doing burgers like they do burgers and I think they do them better. So, I really I don't think it's going to be a competition. I think uh California is 100% In-N-Out brainwashed. Yeah, they got they got the the allegiance there. They It's crazy. Like I gotta say I as like the first time I had",
            "start": 623.2
        },
        {
            "text": "it's going to be a competition. I think uh California is 100 % In-N-Out brainwashed. Yeah, they got they got the the allegiance there. They It's crazy. Like I gotta say I as like the first time I had In-N-Out, it was phenomenal. Same like Del Taco. I came back years later like 2012 had In-N-Out and I was literally like hm okay. And at that point I had had Five Guys like two years earlier on the East Coast and I was like this is **** godly burger. This is the **** right here. But a Five Guys burger is like if you want a burger and fries and a drink, it's like 10 to 12 bucks. Yeah. Like In-N-Out is like five to six. Very affordable. Same with Shake Shack. Is Shake Shack is like not in an In-N-Out price range. It's a bit above that. So that price factor is why people aren't going to be lining up the drive-thru at Shake Shack. But in my opinion, Shake Shack is **** incredible. Literally on another level, man. Shake Shack in New York. They have like a webcam above the Shake Shack so",
            "start": 660.24
        },
        {
            "text": "up the drive-thru at Shake Shack. But in my opinion, Shake Shack is **** incredible. Literally on another level, man. Shake Shack in New York. They have like a webcam above the Shake Shack so you can click and go online to see how long the lineup is to determine if you want to wait in line or not. We I was the the last time I was in New York, which is the first time I've been there in like two or three years. I was like, I have to go to Shake Shack. I don't even know why, but everyone's like, it's really good. I went, the line was a but it goes fast. It does go fast. It's actually not bad. Yeah. You just don't don't want to eat there. And I'm like, it can't possibly be this good. And it was blow me away. Like, no, it's not the best thing on the planet, but it is a damn good I would wait another 20 minutes in line maybe for a second one. Yeah, they got they got the crinkle fry which you got to give a shot. They do got Here's the thing about lines, you know. Tell me about it. I hate",
            "start": 704.96
        },
        {
            "text": "another 20 minutes in line maybe for a second one. Yeah, they got they got the crinkle fry which you got to give a shot. They do got Here's the thing about lines, you know. Tell me about it. I hate it. It's like traffic, which is why I don't know if I if I ever need to. Hell yeah, dog. Yeah, dog. Rubber tread. The rubber industry. Yeah, man. Talking about tires. Volcan uh I'm okay with lines as long as they're moving. I can stand in a line for an hour and progressively moving. Same with traffic. If I'm on the 405 or the 101 up here, I don't give a **** as long as I'm not seeing brake lights in front of me for longer than like 5 seconds. So, you're going to like **** with Disneyland cuz they got the lines that have like, you know, there's a bunch of different **** going on. Yeah, there's like **** going on. It's like it's like a whole It's like playing craps. You're like, \"What line am I supposed to be in right now? There's a fastpass thing. How does that factor in? What's my",
            "start": 739.04
        },
        {
            "text": "like **** going on. It's like it's like a whole It's like playing craps. You're like, \"What line am I supposed to be in right now ? There's a fastpass thing. How does that factor in? What's my 50-50 ratio?\" Um, you got to find that out. So, when I went to Chick-fil-A, I was like, \"No, absolutely not. We're not going to eat here.\" And the line started moving. I was like, \"All right, **** it.\" Muppeted my muppet walked my way. Speaking of Muppets, speaking of Muppets, uh, uh, uh, just to answer your original question, it's got to be a horrific war movie. And my my mind first my mind fame pride rhyme was the one in my mind first went to but then I went even darker and I'm like Apocalypse Now. Oh god. That would be the one if you replace the the cast with Muppets. That would be a really **** weird movie. That would be awesome. Yeah . I wouldn't mind seeing the Nolan Batman's redone or you know what I mean? Batman movie with the Muppets in it. That's probably on YouTube. Yeah. No, actually I",
            "start": 773.36
        },
        {
            "text": "movie. That would be awesome. Yeah. I wouldn't mind seeing the Nolan Batman's redone or you know what I mean? Batman movie with the Muppets in it. That's probably on YouTube. Yeah. No, actually I think the Muppets did that on YouTube. Yeah, I feel like that exists. There's a promo thing for the Muppet movie. So they redid the entire movie. The entire thing. The entire trilogy actually. Yeah, for sure. Like the best part was when Bane came on and it was good. Who was Who was Bane? Was it Fuzzy? Uh, they actually got Colin, which was weird. They got calling for I'm not sure where the truth ends and the lie begins anymore. It's been a two-minute video. No, but the reason the reason I love this question is because back in the day when Muppet Babies was a thing. Do you guys remember Muppet Babies? Yeah. They had better than Muppets to me. Actually, I think it was um but they had an episode that I always wanted to come on in the Star Wars. Yeah. It was a Star Wars episode when it was Kermit",
            "start": 802.64
        },
        {
            "text": "Yeah. They had better than Muppets to me. Actually, I think it was um but they had an episode that I always wanted to come on in the Star Wars. Yeah. It was a Star Wars episode when it was Kermit uh Skyhopper. Yeah. And uh Yeah. Amazing. And so I'm like, why don't they do more of that? Why don't they get licenses for the Muppets and do licensed movies where they put them into like Silence of the Lambs or something like that? That's a good one. It would make so much money though. In the basket, we should start a Muppet Patreon. Mhm. Hey guys, if we break the $10 million barrier, we'll make a Star Wars Muppet movie. That's what it would be. I would contribute to that. Legit. How far off is Disney from buying the Muppets? They own the Muppets. Thank you. Good to talk. Not far away at all. There you go. They don't even need it. There you go. Star Wars. Hey, Muppets. Why don't they do things with them? They buy Jim Hansen's bus. Yeah, it's Disney's Muppets. You You buy things to just do",
            "start": 837.76
        },
        {
            "text": "There you go. They don't even need it. There you go. Star Wars. Hey, Muppets. Why don't they do things with them? They buy Jim Hansen's bus. Yeah, it's Disney's Muppets. You You buy things to just do things with them later, Greg. You don't want to throw everything out there, right? All at once. I guess they buy them recently. There's a f There's another fascinating question. Oh, they had them for a long time. I'm sure we'll made the movies. Okay. Uh, someone else tweeted at me though, and this was that has to be a topic for another day, but something important to remember is what is Disney's what's Disney's identity now? Because they're no longer really Disney. They're they're most of their identity is based off of a lot of the properties that are being kind of contributed to them. Marvel and Star Wars. So, it's very it's pretty fascinating to watch what that company's gone through. I think Disney um is is us basically. Disney Disney grew up with us. That was like when I was a kid,",
            "start": 877.44
        },
        {
            "text": "and Star Wars. So, it's very it's pretty fascinating to watch what that company's gone through. I think Disney um is is us basically. Disney Disney grew up with us. That was like when I was a kid, Disney was always quality. Yeah. And I remember when Disney acquired Star Wars, there was like a weird And same with Marvel, there was like a weird like, oh my god. Oh. And it's like, what do you think? They're not going to **** put Wolverine in a dress and make him a Disney princess, which kind of be tight. That'd be hell. I'd be in that. Me, too. Yeah. Um, but they the dress of the movie, but they like they took something that, you know, we all liked and we all like Disney growing up. I'm assuming we're all like almost 30 or whatever. Not all and and they took that and they they grew up with us. They took control of the things that we all liked when we were younger and that now that we're older, we have, you know, different tastes. Yeah. We moved on. We're not in We like comics now, not",
            "start": 907.36
        },
        {
            "text": "us. They took control of the things that we all liked when we were younger and that now that we're older, we have, you know, different tastes. Yeah. We moved on. We're not in We like comics now, not stupid stupid princesses and stuff. Um, but anyways, I feel like Disney did the right thing. Like that's the company. Like they're just running **** Yeah, they are. They're owning **** They're going to own everything. It's going to be them and Google. They're going to own everything one day. And **** Apple. I'm down. I'm just joking. Apple. I love Apple. Aren't you excited for their car? Their iCar. The Titan. Project Titan. What do you mean? They it it started to leak that Apple's working on a self-driving Well, what they presume is a self-driving car. And they we read the story the other day. They they're starting to hire a bunch of talent from from what? There's a breeze. Feels good. They started to hire a bunch of talent from GM and Tesla and stuff and they're giving them",
            "start": 951.2
        },
        {
            "text": "the other day. They they're starting to hire a bunch of talent from from what? There's a breeze . Feels good. They started to hire a bunch of talent from GM and Tesla and stuff and they're giving them $250,000 signing bonuses to sign with with their car thing or whatever, but it's still a secret. That's what the story said. That's crazy . It's cool. Sam, stop doing that. Stop doing what? Stop reading the screen. No, that looked like there was an issue. So, I was confused at what it was. It's gone now. Okay. Cuz I I just saw in the middle of the thing you just go someone raised a good point though. He was like, \"Isn't this supposed to end at six? We're only on the second top.\" There's someone saying something about a breathing problem. I was the one that's saying we shouldn't get distracted. and I got distracted. So, okay . Yeah. Sorry. Yeah, we're ending at 4:30 to bring on Genova Chen. So, we do have to get When do I leave? Okay. Uh, well, you can leave whenever you need to. You You",
            "start": 986.32
        },
        {
            "text": "and I got distracted. So, okay. Yeah. Sorry. Yeah, we're ending at 4:30 to bring on Genova Chen. So, we do have to get When do I leave? Okay. Uh, well, you can leave whenever you need to. You You came here straight from the airport. If you can hang out another 15 minutes, great. Dude, I'd love to hang out here for another uh uh 30 five minutes. [Music]",
            "start": 1020.88
        }
    ]
}