{
    "id": 677,
    "video_id": "uf5bt0HPPvE",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Timpocalypse! - Smash Bros. Wednesdays",
    "description": "We all play as Tim's various mains.\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/Tim Gettys",
    "published_at": 1426100400,
    "duration": 1019,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to another Smash Brothers Wednesday here on youtube.com /kindafunny games. I'm Greg. That's Tim . That's Nick. That's Colin. And today we are competing the quartet of Smash Brothers let's plays. We're playing as your character of choice. Everyone has to be the same character, but you do a bunch of different characters. Yeah. So here's what happened. First week we did All Day today in honor of Colin and I won. Yeah. And then the next week we did all Link in honor of you and I won. Yeah. And then we did all Pit in honor of Nick and I won. Yeah. So let's see how this one goes. What we're going to do I don't have one my one main character in this version of Super Smash Brothers for the Wii U. All Omar. So my characters that I use are Ike, Lucina, Wendy O Koopa, and Zero Suit Samus. Okay, I'm going to go for Zero Suit. So you guys can choose and Shulk. Shirt with Shulk. I want to try shirtless with Shulk. You So you we we get to choose for me and I'll choose",
            "start": 0.56
        },
        {
            "text": "and Zero Suit Samus. Okay, I'm going to go for Zero Suit. So you guys can choose and Shulk. Shirt with Shulk. I want to try shirtless with Shulk. You So you we we get to choose for me and I'll choose wherever you guys don't choose. I'm going to go Ike. Okay. Go Shulk. I'm going to do use your suit the way you use your suit. It I thought you were Wendy Koopa. Oh, you're right. Thanks, Nick. Sorry. I I I see you use Wendy more than any of these other characters. Actually, you don't need to use Ike that much. That's fine. When's my girl? My girl. Everybody in the club. That **** drum line on that song. Where am I? All right. You remember the movie Drumline? I do with Nick Cannon. That was a hit. Oh man, this is already hard for me because I don't know which character I have. They all look like me. Jesus, Samus is quick. Too quick. Too high. So, pro tip, Colin. Your right B is a beast. B. Okay. **** Uho h. Can you just leave me alone? Let me land on the **** stage, please. That's",
            "start": 37.2
        },
        {
            "text": "look like me. Jesus, Samus is quick. Too quick. Too high. So, pro tip, Colin. Your right B is a beast. B. Okay. **** Uhoh. Can you just leave me alone? Let me land on the **** stage, please. That's how to play the game, I think. [Applause] Damn. I like how the first round whenever we do this is super silent. Then we focus. Then as we start knocking out, that's when Nick and I start talking about stupid things. Uhoh. I got to go home, son. You're too late. Your pellets are waiting for you. I just killed myself. I just was silently not even paying attention. What? What the hell was that? What? Totally confused. What just happened? Yeah, I don't even know what to say about it. Not saying anything. We got to kill Nick. Why Nick's so fun? But you're more fun when you can just comment shout cast like they do in the esports. Why do they call it shout casting? I don't understand what the hell that means. The song what? Every esport starts with shout which by Cheers for Fears. No, no, the",
            "start": 98.32
        },
        {
            "text": "cast like they do in the esports. Why do they call it shout casting? I don't understand what the hell that means. The song what? Every esport starts with shout which by Cheers for Fears. No, no, the Disturbed version. Oh, Shout 2000. God damn that stupid thing. They dream about it. Yeah, you got me, Tim. I got you. You got me. Same. These are the things that I've never used my little tongue move. That's that move is inspired by Kevin. Sorry, I just got that. Everyone late to the joke. Felicia Day episode. Nick, you think you're so No. God, Samus sucks. Actually, I suck. I killed myself. Otherwise, I would have been fine. Boom. Do you have to say boom when it explodes? Is that like a thing? Yeah. It gives it like 10% more. That was cool. He was short as **** Whoa. I'm really excited to see the Roast of Justin Bieber. No, me too. I feel like it's going to be awesome. Are you kidding me? We should do a reacts to it. It'll be good. When is it? March something or whatever. God damn, that",
            "start": 197.04
        },
        {
            "text": "the Roast of Justin Bieber. No, me too. I feel like it's going to be awesome. Are you kidding me? We should do a reacts to it. It'll be good. When is it? March something or whatever. God damn, that thing catches me every time. It's annoying as hell. No. Oh, stupid move. Uh-oh. Yeah, buddy. Uhoh. No, they're just not trying to fight. I know that technique. Well, it's like the Mortal Kombat 2 instruction manual. Told you that sometimes the best offense is to wait for them to make mistake. It's It does. Yeah, but it was a very deep cut inside the in instruction manual to take. That's awesome. Oh, that's still hit me. That looked impressive, Greg, but it wasn't. Nice dance. Very uplifting. God, you all might as well kill each other or kill just kill yourselves at this point. I usually give that advice to people, too. Oh, damn. I should have known that one. Well , no. That stupid ass move. No. Whoa. Oh **** God damn it. Great one with Shirley. Look at him. He's falling his ass. That's",
            "start": 278.96
        },
        {
            "text": "that advice to people, too. Oh, damn. I should have known that one. Well, no. That stupid ass move. No. Whoa. Oh **** God damn it. Great one with Shirley. Look at him. He's falling his ass. That's That was an absurd ending to that. Yeah. Shirley Shulk, you know what up? Look at him though. He's really feeling it. Looking dope. I'm feeling it. **** it. Turn all the lights down low. Greg's feeling it. All right. So now Colin steps out. He's got some characters if you want. No way. I'm sure the show's about to like die. Okay. I really had to sell Shulk. Do I want to go Lucina? Lucina. Whatever. Who's Lucinda? Why do I keep saying Lucinda something? I think you'll be better with Ike. I'll stick with Ike. Ike. Lucina's faster though. Yeah. And it's hard to catch up with uh All right. Then if you want to go Lucina, Lucinda's fast, just nimble. Yeah, this might have been a mistake. We'll see. Oh, man. Legit Final Destination. Yeah, we're going real Omega Final Destination. Do you want to",
            "start": 356.24
        },
        {
            "text": "you want to go Lucina, Lucinda's fast, just nimble. Yeah, this might have been a mistake. We'll see. Oh, man. Legit Final Destination. Yeah, we're going real Omega Final Destination. Do you want to go do your song? No, I'm going to wait. Okay. Why do you want me to not be here? Do I smile or something? No, you I love you here cuz we're like a team. Unfortunately, you know, I'm not saying unfortunately I don't want him to win, but just cuz it's boring to whatever it is. Oh **** Oh Jesus Christ. What the hell? Nick spotted you. God. Hike. Not Ike. Ike can only move horizontally. Horizont. I'm done. I'm **** done, guys. I'm done giving advice. We're too tired. Oh. Oh, that's giving me a little old combo daddy. What's about to come out of this guy? I'm telling Ike jokes in my head. Oh, you know jokes. Yeah. How do I get Why do I get the feeling that you're telling Ike jokes about President like Eisenhower? Oh, look at that star burning. How are you guys just alive right now? **** So",
            "start": 419.36
        },
        {
            "text": "know jokes. Yeah. How do I get Why do I get the feeling that you're telling Ike jokes about President like Eisenhower? Oh, look at that star burning. How are you guys just alive right now? **** So close. So close to the star. Damn, man. I'm not doing well at all. How's that planet not just incinerated? Greg, you're not feeling this on this one. Tim's strategy is to beat the like to keep the best players. So, if we beat him, then it's a real match. There's some problems with this just like astrophysically. Uh, this this sun is the same size as this planet, but it's a rocky planet. Rocky planets cannot be that big. Oh, did you know that Shulk likes ice cream? Favorite flavor is What's wrong with you? There's something really wrong with you. I think I mean that from the bottom of my heart. I'm like out of concern. You know what I mean? Nick, use the right B into an AA, bro. Nick, don't listen. Good. Nick's hanging in there all things considered. What do I got? Two lives. 141. Nope. Never",
            "start": 479.76
        },
        {
            "text": "like out of concern. You know what I mean? Nick, use the right B into an AA, bro. Nick, don't listen. Good. Nick's hanging in there all things considered. What do I got? Two lives. 141. Nope. Never mind. Never mind. I lied. Take off the trash. You're back in. You're back in. Greg just for some reason took just straight up murdered himself and took out and indeed he took out the trash. What the **** That was an unusual move. That's very unorthodox move. I've never seen that before. Oh my god. You guys have swords. You guys swords. Peter. Peter. Why are you so Oh god. Why are you so youthful, Peter? Peter, why you got those thighs? They speak to me, Peter. Oh god. Oh. Oh, god damn. Why does that What up timing? Peter, why do you got a dagger attached to your thigh? Peta. Peta, why do you have two daggers attached to your thigh? Oh, wait. One of them is not a bad guy at all. It's a flesh weapon. A flesh weapon. I like how you basically made Captain Hook into a [Laughter] predator. But",
            "start": 535.96
        },
        {
            "text": "have two daggers attached to your thigh? Oh, wait. One of them is not a bad guy at all. It's a flesh weapon . A flesh weapon. I like how you basically made Captain Hook into a [Laughter] predator. But why is he obsessed with them? I I'm trying to think of my original story. I think it's because they have like they're eternally kids and he's just an old **** He's an old piece of **** Got his hand eaten by an alligator with a clock in it. It's a really weird story line. That really is kind of weird. We just take it for granted at this point. Oh yeah, Peter Pan. Of course. Meanwhile, some some **** boy is flying into some girl's room at night looking for a shadow. I lost my shadow. No one's like asking any questions. The hell are you doing here? Which like if if my daughter told me that, I'd be like some **** ho kid hopped up on LSD and was like looking for a shadow and just wandered into my daughter's room at night. Greg, no. Tim's secretly nervous right now. I am. I was like",
            "start": 623.0
        },
        {
            "text": "I'd be like some **** ho kid hopped up on LSD and was like looking for a shadow and just wandered into my daughter's room at night. Greg, no. Tim's secretly nervous right now. I am. I was like **** around way too long here. No. Did you just catch what I threw at you? You You don't throw things. I just threw this guy at you. Oh, did you? Yeah, maybe I did. No. Nah, I'm out. God damn it. Oh, man. Now, now I'm feeling good. Come on. I was worried. Oh, get him. Great. Get him. Get him. Great. Get or just jump around, Greg. Jump around. Sandals give me my power. I'm Sh ulk. Hi, my name's Shulk. So, where did the Rocky Road ice cream come from? I It's something I remember reading about Shulk. Really? Yeah. See, Greg let you back into that match. I let myself back into that match. I would have won that match if I hadn't just randomly thrown myself off of the goddamn platform. But whatever. That's a good point. That's what happens with Ike. Ike is just so He's a wild card. He's so hor. Oh,",
            "start": 690.72
        },
        {
            "text": "won that match if I hadn't just randomly thrown myself off of the goddamn platform. But whatever. That's a good point. That's what happens with Ike. Ike is just so He's a wild card. He's so hor. Oh, we suck in Philadelphia reference. I remember that episode. When they're pretend when they pretend to be the oil baron. Cool. Let's go. The finals. Can you sweep is the question. That is the question. WY. Question. Dr. Wily. This stage makes you want like a remastered Mega Man 2. It would be **** awesome. Oh god, Greg, that move seems to be working. Keep doing it. Got it. Also, do your forward B for Christ's sake. It's like a badass range move. I mean, this this game's a little messed up if you think about it. You got a kid in just cut off jean shorts who looks like **** baby dinosaur fighting a baby dinosaur in a in a **** suit bowl. She's not a baby. She's a grown ass woman. So, it's okay to be attracted to Greg, we're a very liberal household. It's okay to be attracted to",
            "start": 762.24
        },
        {
            "text": "fighting a baby dinosaur in a in a **** suit bowl. She's not a baby. She's a grown ass woman. So, it's okay to be attracted to Greg, we're a very liberal household. It's okay to be attracted to either of these characters. You just can't act on one of them . The age bracket of one of them. You can't you just Okay. You can't touch one of them until he's 18. Peta, how old is fine? Peta, what are you doing? You're sees a grown ass. That dagger between your legs. It looks I am hard. Peta, you're positive. You know I'm not. Peter, I play exclusively shirtless kids. I was playing a game called Smash Brothers and they have a character that looks like you Shulk. He's shirtless. Peter, you should go shirtless every once in a while. It would be nice for your tan cuz it's sunny. Tick a talk. Peter, you got that farm tan. Peter, there's nothing sexier than a tan on a boy. That's just That's going to be the one. That's going to be the moment I run for the Senate. Like, so there's nothing sexier than a",
            "start": 838.64
        },
        {
            "text": "that farm tan. Peter, there's nothing sexier than a tan on a boy. That's just That's going to be the one. That's going to be the moment I run for the Senate. Like, so there's nothing sexier than a tan on a boy. But at least we got a lot of What the hell does that mean? It means whatever the hell you want it to mean. I'm going to lick you. Ew. What does that do? Sh. Go over that and put your bottom on it . How's the old bait and switch? I was coming to get licked. I know you were. I'm looking for you. It's funny that they had to animate like eight different Koopa kids for the same character. I heard Miyamoto did it one weekend. I heard I've heard Miyamoto's is a master animator. So that's that's I heard Miyamoto made this whole game in 3 weeks and then told him to hold it for seven years. He was like, um, hey guys, look what I made. I wonder how in the trenches he is. Like he's a he was a programmer, but I think he's a a designer primarily. I mean, he's a lead now, right? Like he just kind",
            "start": 890.04
        },
        {
            "text": "like, um, hey guys, look what I made. I wonder how in the trenches he is. Like he's a he was a programmer, but I think he's a a designer primarily. I mean, he's a lead now, right? Like he just kind of Oh, god. You got I got him, Nick. I got him, Nick. Yeah, you won, Greg. You won. Got him. It's funny. Well, from this like whenever I see him and it looks like he's he has a cowboy hat on that he just has on his back. Yeah, he looks like a shirtless net cowboy in New York. Oh **** he kind of does. Egoaptor recently put out a video that was uh just them just the these clappy scenes that cycle through every character and they added real clapp. Yeah, it's so funny cuz it's so sad looking. Ladies and gentlemen, that is another Smash Brothers let's play here on youtube.com/kindafunnygames. Thank you for watching. Of course , we put up new videos each and every day. So for all your let's play needs, keep coming back here. Also update from last week. Perilla is okay. Yeah, he is. Is that",
            "start": 951.76
        },
        {
            "text": "Thank you for watching. Of course, we put up new videos each and every day. So for all your let's play needs, keep coming back here. Also update from last week. Perilla is okay. Yeah, he is. Is that Christopher Walken on the cuff? Yeah, he didn't see this last week. a fan. Simon Cardi got this for me. That's **** awesome. One of the one of our badass best friends out there.",
            "start": 999.96
        }
    ]
}