{
    "id": 863,
    "video_id": "ukBjhmVmgp4",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Let's Play Witcher 3 - Kinda Funny Plays",
    "description": "Greg and Colin take a look at Witcher 3 on PS4.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1432234804,
    "duration": 2401,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations. Welcome to kind of funny games. We're gonna do another let's play, Greg. And this time, we're gonna do it for The Witcher 3 colon Wild Hunt. The Witcher 3 colon wild hunt. I'm Colin Warrior. This is Greg Miller. Hey, it's me, Greg Miller. We're using Greg's save on PlayStation 4. Of course, you can order or play or buy or do whatever you want with The Witcher on PlayStation 4, Xbox One or PC, but we're going to play it on PlayStation 4. Uh, and what we're going to do today is just do a kind of a series of side quests and explore this swampridden countryside as we are in one specific area of the game. The maps are kind of split up into multiple areas. This is basically the second place that you'll end up in the game. Sure. So, we're a bit into the game at this point, right? But we don't want to spoil the story for you. No, we don't want to spoil the story. And I I'm so OCD about these games that I'm just not far enough in the story to want to have it spoiled",
            "start": 0.24
        },
        {
            "text": "right? But we don't want to spoil the story for you. No, we don't want to spoil the story. And I I'm so OCD about these games that I'm just not far enough in the story to want to have it spoiled for me either. Right. So, that's really the bigger consideration. You didn't want to know this is all happening in a forest preserve. No, exact. That's exactly right. It's like uh that might Shyamalan uh never heard of it uh movie or Yeah. when they're the village. The village. Yeah, that's the one I'm thinking of. This is like a really big The village. Over many many thousands of miles. See how how high how high how liable these guys are. Oh, no. You can slave driver. Not on my watch. Oh, god damn. Wow. He took all those hits except for that last one or that first one. Right. He got tough at the end. He got Heidi. Those guys are high level. You those guys like with the skull next to their head. Oh [ __ ] Oh no. [Laughter] I'm sorry sir. I thought it was Oh god sir. I'm sorry sir. It's pretty",
            "start": 38.08
        },
        {
            "text": "end. He got Heidi. Those guys are high level. You those guys like with the skull next to their head. Oh [ __ ] Oh no. [Laughter] I'm sorry sir. I thought it was Oh god sir. I'm sorry sir. It's pretty easy to get away from enemies in this game. Yeah. Thank goodness. What do you think about the game? I love it. Have a great time. I love it too. I think it's I think it's fun. It's got some problems but I think that I really don't like slaves though. I should I feel like I should stop. All right. I know I can't I know I will die fighting that guy. Yeah. Yeah. See, like there he's blocking all of your You got to You got to kind of get in there, Greg. You got to get in there. Give me some tips. What What I need to do first of all, are you using your Are you using your arts, your your spells? I I mean, no. I should use it more. I use I use a protective shield. Yeah, I use the protective shield a lot. This one's good. Fire damage. How about a little fire shot? And then that will Yeah, that",
            "start": 74.32
        },
        {
            "text": "I I mean, no. I should use it more. I use I use a protective shield. Yeah, I use the protective shield a lot. This one's good. Fire damage. How about a little fire shot? And then that will Yeah, that will that will get them all distracted. You can get in there for a quick slice. Okay. Okay. Um only five spells though to use. I yeah, the shield one I think is really important, actually, like essential, especially if you're fighting like higher higher level enemies. Um, but I agree. I think the game is a lot of fun. Uh, there's an overwhelming amount of things to do, right? I feel like there's more to do in this game than any other western role playing game I've ever played. Um, because there are side quests, there are hunts and and Witcher missions, plus the main quest. There are collectathons to do, there's all these secret places, just a ton of secret places to find, question marks all over your map. Um, people to talk to. I think I think that guy's taunting you. He is. Yeah, he was",
            "start": 113.68
        },
        {
            "text": "to do, there's all these secret places, just a ton of secret places to find, question marks all over your map. Um, people to talk to. I think I think that guy's taunting you. He is. Yeah, he was grabbing his junk. I don't like that one bit, but I want to light him on fire. Oh, [ __ ] Oh god, Greg, you're Greg. Oh my god, what a pathetic showing, Greg. That was terrible. It was a terrible shot. By the time we knew he was there shooting us, it was too late. You got a bolt right in the chest. Yeah, well, it's cuz I was trying to cast my stupid fire. You got a bolt right in the chest. So, let's when when this loads back, by the way. Yeah, the load times are I mean, the load times are not Bloodborne level load times, but they're not ideal. They are loading a huge map. Sure. So, there are no load times once you're in the map, right? As long as you don't die, you're great, right? Um, load times obviously between territories like this, but if you're on this one map that we're on, for",
            "start": 151.2
        },
        {
            "text": "no load times once you're in the map, right? As long as you don't die, you're great, right? Um, load times obviously between territories like this, but if you're on this one map that we're on, for instance, you can go from one end to the other into any towns, buildings, talk to anyone, and it does not it's not going to load, which is pretty cool. Yeah, it's cool. Um, so we have to be patient up front. Have you been using bombs? No. Okay. I found one of those monster nests. It was like, oh, you can't even destroy this cuz you don't have a bomb. Yeah, you got to buy the You got to craft a bomb or you can buy a bomb from You can probably get even a bomb from an herbalist or maybe the smithy will have one. I don't know. Someone will have one. Someone in this game. But you don't have You've never You don't know exactly what you got. Sure. Okay, cool. Sure don't. I think that uh I think that you could probably craft it and maybe we'll look into doing that as well. Do you craft items? I",
            "start": 188.16
        },
        {
            "text": "never You don't know exactly what you got. Sure. Okay, cool. Sure don't. I think that uh I think that you could probably craft it and maybe we'll look into doing that as well. Do you craft items? I have. Have you crafted your armor? You're fine. You're fine. I'm trying to I was trying to I was getting together all the silver to make an awesome silver sword. You all out. I'm concentrating more on armor. I always concentrate on defense. Gotcha. Gotcha. Gotcha. Gotcha. Yeah. Um All right. So, uh meditate real quick. You're going to meditate? Yeah. Meditate. And and this of course will you you you can meditate for less than an hour to heal yourself by the way. I wanted to get this sunny. Oh, no. I understand that. But I thought that was interesting. You can meditate for like 15 minutes and be healed. Ah, I see what you're saying. But have you have you meditated and been interrupted yet? No. You can be interrupted by enemies. Oh, really? Yeah. No, I was wondering about that. Um I like this",
            "start": 216.72
        },
        {
            "text": "healed. Ah, I see what you're saying. But have you have you meditated and been interrupted yet? No. You can be interrupted by enemies. Oh, really? Yeah. No, I was wondering about that. Um I like this particular map, the second area in the uh in the game because um it's it's swampy and like desolate. It's not like a an ideal high fantasy setting. Like beautiful forest and beautiful castles. Like this part of the map sucks. Like look at it. It's just like not a nice place. Some [ __ ] up trees and [ __ ] It's really cool, man. You know, this made me really want to start reading The Witcher books. Really? Yeah. Interesting. But I wonder if I'd like it or not. You like reading? I do like reading. Are you in the mood? You know how to make fiction? You don't like Not so much anymore. Not so much anymore. When I was a younger, I I loved fiction, but yeah. I just I I feel like reading time is limited. So, are you going to [ __ ] these dogs up? No, you don't got time for that. Yeah, I wasn't",
            "start": 253.76
        },
        {
            "text": "anymore. When I was a younger, I I loved fiction, but yeah. I just I I feel like reading time is limited. So, are you going to [ __ ] these dogs up? No, you don't got time for that. Yeah, I wasn't really. Um, so I I try to focus on non-fiction. Gotcha. Cortilla doesn't like when I fight dogs. But a few impressive things techn technically in the game. Draw distance is pretty good. There's not too much pop in. Um, there's some problems. There's some technical problems. The game hasn't froze or hitched on me yet. But super [ __ ] But uh I have had weird things happen with Roach. Roach disappeared for a while in my game. Couldn't get him back. Like he wouldn't I couldn't whistle for him. Oh, it was weird. I had to use like a fast travel post. Wasn't that you had eaten too many crackers? No, I haven't. Nope. That had nothing to do with it. I don't think that that would have anything to do with it. Well, you want to be able to whistle. Oh, I see. You like the moisture of my mouth, right?",
            "start": 293.92
        },
        {
            "text": "I haven't. Nope. That had nothing to do with it. I don't think that that would have anything to do with it. Well, you want to be able to whistle. Oh, I see. You like the moisture of my mouth, right? Well, I can't whistle if I don't eat too many. I see what you're saying. That makes a lot of sense. Um, so Greg, we're just riding around. I want I go into your Go into your menu. Yeah. And go to quests. Yeah. Now, these are the main quests. We're not secondary. Thank you. Secondary quests. Let's see what we got. All right. So, you're too low level. Do you have any Witcher contracts that are interesting? Well, that's I was running around trying to get some stuff. You want to go after? Go to go after the woodland. See, this woodland beast, I think, is the one that kicks my ass all the time. And I don't have an answer as to why he's doing it. Let's try it. Hold on. Let's I'm down with that. I do want to [ __ ] I want to see what these dudes are up to, though. Okay. Why? Cuz I like fighting",
            "start": 330.4
        },
        {
            "text": "I don't have an answer as to why he's doing it. Let's try it. Hold on. Let's I'm down with that. I do want to [ __ ] I want to see what these dudes are up to, though. Okay. Why? Cuz I like fighting stuff. It's a new location I've discovered. It's just It's a drowner. It's a fish man from Castlevania, basically. Now, here's something we we've talked about. Okay. I don't Okay, why are you Why did you just get off your horse? I'm trying at first. Well, cuz I like every other [ __ ] game ever, I hit triangle, and of course, that's not it. which is like, \"Oh, that's how every game's ever done. Getting in or out of out of a car, getting on top of a horse. I'm going to do something different.\" Now, I have a question. Why? What do these guys even do to you? They're being bad. I just feel like they were just hanging out. Be broke. I don't We They're monsters, Colin. It literally says they're monsters. Look at Is that enough for you? They killed that guy probably. I feel like they deserve due",
            "start": 361.44
        },
        {
            "text": "were just hanging out. Be broke. I don't We They're monsters, Colin. It literally says they're monsters. Look at Is that enough for you? They killed that guy probably. I feel like they deserve due process at the very least. That's not how The Witcher rolls. I just say we're making, you know, when you treat them like this, of course they're going to fight back. You killed them both at the same time with the same swipe. You like that? And I think he cut that guy's head off. Yeah, he had it coming. He's a monster. I need his brain for stuff. Have you done the thing with the brain yet? What? What? There's a mission where you need the brain. No, I have not done the brain mission. Start saving brains here. These guys are back now. Bull cuts. Bull cuts are bull cuts are big. Bull cuts are big in uh in The Witcher. Yeah. Don't understand why they look terrible. Not right. It's not how people should cut their hair. No. But I mean, you know, these are simple people, right? They have to find",
            "start": 400.0
        },
        {
            "text": "in uh in The Witcher. Yeah. Don't understand why they look terrible. Not right. It's not how people should cut their hair. No. But I mean, you know, these are simple people, right? They have to find simple solutions to that. Simpler time, man. You got some experience points. Liberated the area, bro. A lot of time has passed. It took a long time for them to come in here and do this, but now I'm just going to loot all their [ __ ] too. I'm going to use that witcher vision, too. They're going to attack you if you steal stuff from Oh, man. They're really high level, too. Let's go, Roach. You better get the hell out of there. See you, Nerdbergs. This is beautiful here at dusk. These dogs. Just kill these dogs. Are you good at hitting things on the run with the Ruth roach? Yeah, I'm okay at it. Yeah, not at all. Do you ever attack wild animals? Yeah, of course it's fun. I'm an American. That's a good point. Look at the be like how beautiful the light is coming through the trees. Like this",
            "start": 434.48
        },
        {
            "text": "Yeah, not at all. Do you ever attack wild animals? Yeah, of course it's fun. I'm an American. That's a good point. Look at the be like how beautiful the light is coming through the trees. Like this is a really pretty game. Yeah. No, it's beautiful. It's not like the textures aren't aren't great. I mean, this is not this is not um The Last of Us or anything like that, but for an open world game with the scope of The Witcher, this is an exceptionally pretty game. And and the tech is really really well done. It runs smoothly. The lighting effects are beautiful. I don't know. Like like here at dusk it's just unbelievable looking. Yeah. No, there's plenty of times I stop and it's just like wow. What they've managed to do here is pretty [ __ ] impressive indeed. So now we're going towards the quest marker. We're about 180 m or so from it. Right now you have apple juice equipped on the on the D-pad up and then thunderbolt which will increase your strength when you're attacking on your D-pad",
            "start": 475.84
        },
        {
            "text": "marker. We're about 180 m or so from it. Right now you have apple juice equipped on the on the D-pad up and then thunderbolt which will increase your strength when you're attacking on your D-pad down. My assumption is that that has been equipped since you fought the Griffin. Yeah. Didn't need it though. I forgot I even had it. Oh, really? I But I'll tell you right now, if these are the same Yeah. No, I killed them. I just didn't Oh, I see you're saying I just didn't use the Thunderbolt. I'm going to use the Thunderbolt here cuz if these are the same woodland creatures I think they are, for some reason they [ __ ] me up every time. So, we're going to save here, too, cuz I just don't I'm not in the I'm not in the mood to [ __ ] [ __ ] up. You got to make got The saves are pretty big, too. I actually, for the first time in my PlayStation Plus account, had to go and delete old saves because I had no more room, really. These are like 13 to 15 megabytes per save. And you can overwrite your",
            "start": 514.16
        },
        {
            "text": "actually, for the first time in my PlayStation Plus account, had to go and delete old saves because I had no more room, really. These are like 13 to 15 megabytes per save. And you can overwrite your saves over and over or actually put more than one save in the because they're all counted as different in the slots. So you know how you usually put something in PlayStation Plus and it overrides it? You can actually have like a million 23 seconds. [ __ ] I thought I had more than that. All right, let's do this. You seen these guys? Yeah, they look like a bunch of chumps. I think they're Maybe I'm thinking of different guys though. No, no, I'm not. It's these mother. Why'd you put your sword away? Yeah, that happens to me sometimes, too, where he doesn't take his sword out. Oh god. See, I just don't They're [ __ ] Did you use your BC things? No. Hold on. Oh god. Oh god. Oh god. Oh Jesus. Oh god. Oh Jesus. Just get the hell out of there. You can't. You can't. You got to run. Oh god. Just",
            "start": 548.88
        },
        {
            "text": "don't They're [ __ ] Did you use your BC things? No. Hold on. Oh god. Oh god. Oh god. Oh Jesus. Oh god. Oh Jesus. Just get the hell out of there. You can't. You can't. You got to run. Oh god. Just run away. You're not ready. Now I want to read the BC about them. What are they? They're alchemists or some [ __ ] The best might have something to say about this. Greg, I I I feel like you won't have anything to say about them until you beat one. Once you see them, I thought it tells you about them, doesn't it? I don't think so, but let's go in and check. Invest. These are Yeah, you're right. Apparently, check specters just to be sure. No, he's Yeah, you have to kill one, I think, to get the uh the entry. You don't have what it takes. It's okay. No, we're going to try it again. I mean, we're just [ __ ] around here, playing games, being bros. You got the wolf sliver equipped. What's that going to do for It's it's it's bringing my bringing back my vitality. Do you have the Did you activate I",
            "start": 587.44
        },
        {
            "text": "[ __ ] around here, playing games, being bros. You got the wolf sliver equipped. What's that going to do for It's it's it's bringing my bringing back my vitality. Do you have the Did you activate I have an activated skill that automatically raises my vitality in the sunlight. Oh, no. I don't have it like that. I apologize. I thought I just gave the one that's like, you know, plus 500 or whatever. No, no. I have one that's that's Yeah. U Well, let me actually go into the menu real quick. I want to see how you're building your character. Let's go to character over to the right. Let's see what you got here. So, I got the fast attack. Mhm. I maxed that all the way out. Muscle memory for fast attack. Yep. Yep. Yep. Survival in the snakes. Increases maximum vitality by 500. Okay. And then then I got this guy over here, the Griffin. Right. I have that one. And then what's the one on the top? The yellow one on the top. That's another fast attack. Okay. Yeah. Each piece of light armor",
            "start": 637.04
        },
        {
            "text": "then I got this guy over here, the Griffin. Right. I have that one. And then what's the one on the top? The yellow one on the top. That's another fast attack. Okay. Yeah. Each piece of light armor increases critical hit damage by 25% and fast attack damage. But so there's granular. It's funny. I didn't realize at first I I kept upgrading the the short or the quick attack and not realizing I can go to all of those. Oh yeah. I'm not really the smartest. What did you What What are you talking about? Which one did you use where you're getting I think I'm doing is it a mutagen? I don't know where I got it. I I don't know. Day vitality regen additional 10%. Okay. Sun and stars. That's a good one. That's a good one. I like that. It's useful. It's useful enough. All right. So, let's It doesn't really work well during combat. I'm going to go poke the bear again if as I say, you know. I want to see cuz they put up their [ __ ] metal things. I don't Maybe I got to lay that trap down. I'm gonna",
            "start": 675.76
        },
        {
            "text": "work well during combat. I'm going to go poke the bear again if as I say, you know. I want to see cuz they put up their [ __ ] metal things. I don't Maybe I got to lay that trap down. I'm gonna try the trap this time. Throwing up my Come over here. Telekin egg. But yeah, magic trap. That's it. I still don't quite understand how the spell works. I think you have to attack him in the in the circle. Come here, you little son of a [ __ ] There you go, Greg. Get him, Steve. Dave, you tell him, Steve. Yeah, you got him. You got him. Come here. You got him. You're playing defense. Oh, there you go. Oh, yeah. Oh, yeah. Oh, yeah. All right. Now, you got to So, you want to read about them, but it's You don't even need to know. I I want to know something about these [ __ ] They've been giving me trouble. Necrofages. And a ghoul's basically a Bard's ghoul. That's great. Al ghouls differ from normal ghouls in size, strength, coloring, and most importantly, intelligence. Whereas ghouls and",
            "start": 712.24
        },
        {
            "text": "me trouble. Necrofages. And a ghoul's basically a Bard's ghoul. That's great. Al ghouls differ from normal ghouls in size, strength, coloring, and most importantly, intelligence. Whereas ghouls and graveyards are primitive creatures unfit to plan even the simplest ambush. Al ghouls in their kindred such as cemeterars are capable of forethought and are thus much more dangerous. The art's pretty cool. The axi. Axi is the one I want to answer. Axi. Okay, there you go. So, pull up that that menu. I can't even remember the names. Axi influences the mind. Oh, because they can use their minds. So, you want to influence their minds. Yes. Yes. Yes. Yes. Yes. Of course. There you go. He's all muddled. You stupid son of a [ __ ] There it is. Feels good. That feels good. We did something today. I got a lesser green mut. I should check that out after this. Come in here. Loot the bodies. The cor the corpse looting is what it's all about. Oh, I agree. feels so good. I don't even look at what I'm",
            "start": 759.84
        },
        {
            "text": "got a lesser green mut. I should check that out after this. Come in here. Loot the bodies. The cor the corpse looting is what it's all about. Oh, I agree. feels so good. I don't even look at what I'm getting. Oh, no. I don't give a fine [ __ ] Eventually, I'll remember. I'll go in there. I'm like, \"Oh, yeah. I'll just take it all.\" What do I care? Who am I trying to impress? Nobody. I'm a lone I'm a lone ranger. I'm the Witcher, Greg. Exactly. What? How are you wearing a good outfit? No, I got a great outfit. Yeah, I got a great outfit. It's similar in design to that outfit. Mine's a little shinier, I think. But I feel like I look great. Very stylish. I feel like I feel like I look on point. Um, I still have not found a new silver sword that is better than the silver sword I have already. But I've been switching out steel swords left and right as well, becoming stronger and stronger. Now, here you're using your Witcher skills, which is holding down L2. Is that right? Yep. Then I get",
            "start": 808.56
        },
        {
            "text": "But I've been switching out steel swords left and right as well, becoming stronger and stronger. Now, here you're using your Witcher skills, which is holding down L2. Is that right? Yep. Then I get to see all the stuff I need to examine. Like the red is the stuff when you see things in red, that's usually the stuff you want to examine. Yeah. Necroages fed here. And the circle here in the HUD for people watching is like basically, you know, just like anything it's within the realm of this is what you're looking for, which is helpful. Reminds you a little bit of Infamous or many other games. Yeah. Where it's like the camera is here. It's something around here. So, go and explore. There you go. Follow the tracks. A [ __ ] I got to fight more [ __ ] But I guess now I got their dumb numbers. Follow the tracks using your Witcher senses. I like these little detective missions. The side quests are a lot of fun. Yeah, I think the side quests are good. They're varied. I mean, you're doing some",
            "start": 849.84
        },
        {
            "text": "the tracks using your Witcher senses. I like these little detective missions. The side quests are a lot of fun. Yeah, I think the side quests are good. They're varied. I mean, you're doing some repetitive stuff. I One of the funnest things, and maybe after we do the side quest, we'll do it a little bit. I like looking at the map for all the question marks and just going and discovering things. You can find places called places of power that give you skill points. That's awesome. And usually they're protected by ghoul. Look at these [ __ ] idiots. Again, they're just having a barbecue. They're not here to barbecue, buddy. They're here to barbecue my balls off, if you know what I'm saying. They're just trying to hang out. Oh, Jesus Christ. There's a lot of them, huh? Yep. Oh, Greg, you better get over my head as always. You haven't saved. You better be careful. I know. That's the thing about The Witcher is, you know, video games today, Colin. Easy. The Witcher is a difficult game. And I",
            "start": 884.24
        },
        {
            "text": "get over my head as always. You haven't saved. You better be careful. I know. That's the thing about The Witcher is, you know, video games today, Colin. Easy. The Witcher is a difficult game. And I and what I'm realizing cuz I never played The Witcher one or two is that the Witcher games are known for being very hard. Yeah. Um which I think is awesome cuz a lot of games baby you. The Witcher definitely doesn't baby you. I told the story on the Games cast and I think Colin and Greg live about how I start I always play my games on hard. Yeah. And I started at very hard was like nope. Went down to hard and was like nope. And then I went down to normal cuz I'm like I could probably do it but it's not going to be fun. There's not going to be anything fun about me playing on this on this difficulty level. It's just going to frustrate the living [ __ ] out of me. Like you can't get hit at all on on the highest ability level. I've died a few times even just on um on normal. Oh yeah. Oh yeah.",
            "start": 920.48
        },
        {
            "text": "level. It's just going to frustrate the living [ __ ] out of me. Like you can't get hit at all on on the highest ability level. I've died a few times even just on um on normal. Oh yeah. Oh yeah. So there's just a different precedent I think set in this particular world. Um which is cool. That's fine. I mean that's great. It's great news. Look at this guy. He's just he does he's like I'm not here. I don't want anything to do with it. Listen buddy. I got to kill you. Nobody can tell the world the story. Oh Jesus. That was extra brutal. Somebody had to do it. These drowners ruin everybody's life. You're just picking drowner tongues, drowner brains, monster bones, and monster claws. There's all I mean, the customization in terms of like crafting in this game is deep. Oh yeah, we'll look at maybe we'll look in the menu in a little while after this quest. Yeah, let me finish off this quest. I'm going to meditate again. Meditate back to day. Yeah, go back to daytime. Let's see if you get",
            "start": 957.04
        },
        {
            "text": "maybe we'll look in the menu in a little while after this quest. Yeah, let me finish off this quest. I'm going to meditate again. Meditate back to day. Yeah, go back to daytime. Let's see if you get interrupted since you're on the coastline. Sitting in. You got through now. What is I don't know what this is. Alka. Strong alcohol was used to replenish alchemy items. I do. you have an item that keeps all your stuff fresh and does it start going bad because every once in a while, every few days like that thing pops up. Really? I've never I don't That's I think maybe the first time I've seen it. What was I doing now? Follow the tracks. There's a bush. There it is. There's the tracks. Using your Witcher sense. Very useful. I wish the cast of Hey Dude got more work. Yeah, me too. That's a good point. Some of them got out of there. The one who the one who married Ben Stiller. That's the only one who got out of there. What's Danny doing? I don't. Oh, nothing. That was the kid's name, right?",
            "start": 997.84
        },
        {
            "text": "point. Some of them got out of there. The one who the one who married Ben Stiller. That's the only one who got out of there. What's Danny doing? I don't. Oh, nothing. That was the kid's name, right? With the meds hat, I think. So, yeah. And Mr. Ernst. Oh, we're going to take this guy now. Set your weapon aside. You've killed enough humans already. I don't take [ __ ] I'm out there like a vigilante. Nick, you shut up. He's got cool face paint. Yeah. [ __ ] Hold on. Save real quick. Oh, you can't save your game during a fight, bro. You'll be fine. I'd go after that archer first, though. Where is he? Up on the hill. There he is. Oh, there's two. There you go. Wow, you [ __ ] him up. These guys really do take quite a few hits with the sword, though. Oh my god, he's screaming for mercy. And mercy, you delivered it at the edge of a blade. Jesus Christ, that was Well, that's that was You did what needed to be done. Somebody had to do it, you know. I mean, I don't like being judge jury and",
            "start": 1036.4
        },
        {
            "text": "mercy, you delivered it at the edge of a blade. Jesus Christ, that was Well, that's that was You did what needed to be done. Somebody had to do it, you know. I mean, I don't like being judge jury and witcher, but I have to. Now, how are you playing the game? Are you playing with And it doesn't really matter because it seems like it gets you to the same place, but it seems like there's definitely deviations in conversations, and I'm not sure if they ultimately result in different quests or different outcomes of quest, but are you playing the game like as a paragon or a renegade? I'm mostly paragon. Like, I let it, you know what I mean? It's one of those for sure as I go I I play it as like, you know, since there is no parag, you know, good or bad system, I just take each situation one by one. You know what I mean? Do I believe this guy who's telling me he needs the medicine for his v village? I do. You take it. All right. I'm not going to [ __ ] you up. Yeah. I I've actually refused",
            "start": 1089.76
        },
        {
            "text": "one. You know what I mean? Do I believe this guy who's telling me he needs the medicine for his v village? I do. You take it. All right. I'm not going to [ __ ] you up. Yeah. I I've actually refused payment before. Basically, I treat people the way they treat me. Exactly. Yeah. That's a great point. Um just like real life. Exactly. So, I like that there's no Paragon and Renegade system because the game still has player agency, but it's not tied to a system that makes you make arbitrary choices based on being consistent. Yep. Which I think is smart. I think that's the better way to do it. Mass Effect, for instance, or Fallout have ramifications for their choices, and that's fine. Especially Mass Effect. Yeah. And that's great, too. And there's some a place for that, but I feel like I'm very tethered to like if I'm playing Renegade in Mass Effect, I have to make all the and I don't even like playing Renegade. Like, it's uncomfortable for me. But um it's one of those where a lot of those",
            "start": 1132.88
        },
        {
            "text": "tethered to like if I'm playing Renegade in Mass Effect, I have to make all the and I don't even like playing Renegade. Like, it's uncomfortable for me. But um it's one of those where a lot of those games like Infamous or whatever in the beginning you should just say I'm going to make the good choice and then you just get the good choice played out. You know what I mean? Hey [ __ ] That's you mother. Get Wait. Leave Roach alone [ __ ] Portillo I know you hate watch that. I'm sorry I had to do it. That was Portillo's father. No. So now we're going in here. I saw the exclamation point. I got to stop. Not going to hurt you. It's kid. When did you last kid? Kid, I know this person. Yeah, me too. But I've talked to her before. This has got to be like she doesn't know you though. If you think about when you meet her, but unless they're using the same character model. Oh, I'm with you now. Pound it out. Oh, we'll pound it out, but not now. Thank you. I should have put on subtitles. The",
            "start": 1167.68
        },
        {
            "text": "about when you meet her, but unless they're using the same character model. Oh, I'm with you now. Pound it out. Oh, we'll pound it out, but not now. Thank you. I should have put on subtitles. The facial expressions in the game are really cool. The games does the game doesn't like the characters don't look great. The models don't look great. It's way better than like Fallout's like very static like looking at you the whole time like not there's expressions and fa you know facial and hand movements and stuff like that. I think that they did a nice job with some expressions though like you don't have to say anything. What are you looking at here? Trying to find language. I hate we as a as an industry we need to get on the same page of where subtitles go. Sometimes they're under audio, sometimes they're under visual display, whatever. I got the I got the dowel, so that's good. What can I loot from these dumb kids? They can't stop me. They can't say stop me. I'm the [ __ ] Witcher. All",
            "start": 1213.76
        },
        {
            "text": "they're under visual display, whatever. I got the I got the dowel, so that's good. What can I loot from these dumb kids? They can't stop me. They can't say stop me. I'm the [ __ ] Witcher. All right, they got nothing. I'm not going to put out their candles. Have you been putting out the candles? No. Why would I do that? I thought I thought maybe there's a trophy. You could look and see. Yeah, well, maybe it's a hidden trophy. I don't care. It's one of those I don't care enough to look, but I also am just like, well, I'll just [ __ ] put out all these goddamn candles as I go. You're just trying to be safe. Yeah, you don't want to start any forest fires. Maybe it's going to get to the end of the game and they're going to be like, \"Hey, now this particular landscape's very moist, so I don't think there's any danger for wildfires to take root here.\" Sure, but you could still lose a house. You could still lose a house or a couple houses. Yeah, a bunch of dumb kids in there with a bunch of",
            "start": 1256.4
        },
        {
            "text": "think there's any danger for wildfires to take root here.\" Sure, but you could still lose a house. You could still lose a house or a couple houses. Yeah, a bunch of dumb kids in there with a bunch of [ __ ] candles. I don't trust them. Now, who where is the candle maker in all this? Good question. He must be doing pretty well, man. He's cleaning up. You kidding me? Poor she. This is cool, though. This is what I'm talking about, though. It's just like it's decrepit. Like, it's there's it's not a clean fantasy world at all. I think that's pretty cool. It's not obviously unprecedented, but I think that actually like, you know, something like Game of Thrones does a great job with that, too. But you don't often see that in game. Usually, it's like very prim and proper and and it looks great because it looks pretty. But this looks pretty in its destitude, you know? Yeah. Captain of the guard. Finally, look at this [ __ ] guy. Did you get the beast? The beast were men. Just elves from the",
            "start": 1286.08
        },
        {
            "text": "because it looks pretty. But this looks pretty in its destitude, you know? Yeah. Captain of the guard. Finally, look at this [ __ ] guy. Did you get the beast? The beast were men. Just elves from the square that attacked here. The squirrel tales here. They're squirrel tales. tell you. I don't think that's what I said. Definitely. Yeah. Look at his little mitten. What was he going to say? I don't care anymore. Who [ __ ] cares? All right, so we did that. Wow. The next part is 1700 meters away. Yeah, we're not going to do that one. So, what you wanted to see? I want to see your inventory. Let's look at the inventory and just see what you got going on here. Man, you you got to sell You're Dude, you're almost encumbered. I know. I know. I know. I know. I know. I know. You can't pick like anything up. You got to sell those swords. I know. I know. I know. Or break them down. But I sell. Do you break it down or you sell them? I sell my weapons. Yeah. I have Cuz if you go back up and you go",
            "start": 1322.64
        },
        {
            "text": "up. You got to sell those swords. I know. I know. I know. Or break them down. But I sell. Do you break it down or you sell them? I sell my weapons. Yeah. I have Cuz if you go back up and you go to like components, it shows you. Yeah. But I'm saying go do that. I want to see them. Want to see what you have. Yeah. This is So the alchemy items like So go to the Yeah, the middle one. There's like just a ton of [ __ ] in this game to find. Yeah. The cool thing is that you can break down components obviously to make other components. So you don't have to you can find a lot of the stuff in the wild, a lot of the plants and and herbs and whatnot, but you don't have to do that, which is kind of cool. It seems like it's a game, another fantasy game where it's like that it's there if you want to do it, but you don't really have to. It teaches you how to do it. Some of the quest, the early quest and side quest teach you how to do it. So it's like, you know, maybe you should consider it. Why don't",
            "start": 1369.36
        },
        {
            "text": "but you don't really have to. It teaches you how to do it. Some of the quest, the early quest and side quest teach you how to do it. So it's like, you know, maybe you should consider it. Why don't you look at doing this? But I don't think you have to, especially if you're playing on normal. I imagine that if you're playing the game on hard or very hard, the need to do that kind of stuff is is heightened greatly. I can't imagine how long this game takes. Another quest. Oh, there's another quest there. Why not? I'm going the wrong way. There it is. Epic music for when you finish off your quest. No experience though for it. Shady merchant. You in a pass around here. What kind of pass are we talking about? You don't know hall pass red alens can't get through without a pass but I'm going to [ __ ] this guy shitty merchant what could dress up like rativid and buy a gilded carriage for that much what am I to do if you can't afford it die can you go any lower Greg no Hold up. Might have a",
            "start": 1404.48
        },
        {
            "text": "[ __ ] this guy shitty merchant what could dress up like rativid and buy a gilded carriage for that much what am I to do if you can't afford it die can you go any lower Greg no Hold up. Might have a little work for you. Reduce a price for a job well done. We'll see. What kind of work? What kind of work? Nearby, just to the southeast. His sister's husband's got a business. He and some lads tidy up battlefields. Problem is, there's always swarms of shite bothering them. You know, monsters drawn corpses. Give him some protection and I'll swing you one beautiful discount. Do you have delusion? Apparently not cuz it's in red, right? I would have Yeah, presumably. Yeah, I wouldn't even try because I'd be afraid. Yeah, I'll try. You want to try? No, it doesn't. Nothing happens. Oh, I guess you can't do it. Okay, I'll just buy it. I'm [ __ ] loaded. All right. It's a gold is a premium in this game. I don't even realize that. You never have that much You never have that much money, though.",
            "start": 1459.92
        },
        {
            "text": "can't do it. Okay, I'll just buy it. I'm [ __ ] loaded. All right. It's a gold is a premium in this game. I don't even realize that. You never have that much You never have that much money, though. Like I'd be interested to see how much money you actually have. Yeah. 364 crowns. Like you have no money. And I never had much more than 500. I like that though. It's there's economic scarcity in this game. It really does matter because there's games even in Fallout which I think has a very controlled enclosed economy and I think it's cleverly done. You can still really spike your amount of bottle caps. Like they do a nice job and they do the same thing in this game as they do in Fallout 3 and Fallout New Vegas where merchants don't have unlimited amounts of gold. So you can't just sell [ __ ] to the same person over and over again. Like once you like max out a person, you either have to buy [ __ ] or give it time. And I think that's a pretty neat thing to do, too. Should we do one more?",
            "start": 1523.36
        },
        {
            "text": "to the same person over and over again. Like once you like max out a person, you either have to buy [ __ ] or give it time. And I think that's a pretty neat thing to do, too. Should we do one more? You can try to. Yeah, just do one more. How far away? Well, I can I guess I can fast travel to him, too. Cuz I really want to see what you got. You know what I mean? I want to see if what kind of chops you have here in this world with Geralt. You're in right now. All right. So, I'm going to go to this guy here. Hangman's tree. That's where you start this area. And it's a pretty grizzly kind of location. True. True. True that. You think Iggy is alien is in this? Do I think Iggy is alien is in it? Yeah. No. Probably unlikely, but I mean, anything's possible. She pops up in random movies. Roach is stuck over there, by the way. Yeah. He gets stuck all the time. It's a piece of [ __ ] My favorite thing to do is when I run cuz I I don't stay on the roads. I just make a beline for the place on the",
            "start": 1557.68
        },
        {
            "text": "stuck over there, by the way. Yeah. He gets stuck all the time. It's a piece of [ __ ] My favorite thing to do is when I run cuz I I don't stay on the roads. I just make a beline for the place on the I'm supposed to be and I run in the water and you can't cross with Roach. So, I just get off a roach, swim across, and then call him and he just disappears on the other side of the river. It's pretty clever. And by clever, I mean probably somewhat broken, but convenient. Yeah, whatever. I don't need realistic horse physics. No, you know what? I mean, I just want to [ __ ] use the horse. No, it's just like crazy that they put him so far away where he's always getting stuck in geometry. Yeah. Come on, [ __ ] It's what you call a female horse, right? Yep. I'm no zoologologist, but I think that that's the correct terminology, Greg. [Music] We're slave traders in here. You think they're high level again? So, now only one way to find out. You going to save your game? Yeah, we learned our",
            "start": 1601.92
        },
        {
            "text": "that that's the correct terminology, Greg. [Music] We're slave traders in here. You think they're high level again? So, now only one way to find out. You going to save your game? Yeah, we learned our lesson, little baby boy. Yeah, smart. Don't Don't Very smart. It's very smart. It's very smart. The game doesn't auto save as much as I'd like it to. Yeah. Where are these guys? Oh, they're over there. Oh, they're on horseback. Uhoh. Jesus Christ. He just cut his arm off. Where do they get horses? These are wellto-do bandits. These bandits are stuck. Stupid schmucks. It seems like being on horseback has didn't work to their is a huge disadvantage. And this and his bludgeon is just stuck in the middle of the air here as you can see. Well, there is magic in this world. That is true. It's a very magical and arcane world. Back when Merlin was roaming the earth, this could have been happening, too. Yeah, absolutely. It's a good point. His little loot bag all the way over here. Yeah, I see",
            "start": 1635.6
        },
        {
            "text": "very magical and arcane world. Back when Merlin was roaming the earth, this could have been happening, too. Yeah, absolutely. It's a good point. His little loot bag all the way over here. Yeah, I see you're overburdened. Yeah. Yeah, I'll drop some [ __ ] What happens? No, actually don't. Don't. I want What is it? Like Fallout. Can you not run? Yeah, I can't run. You can at least move fast. Remember Fallout? It's like imp. Yeah, it's so annoying. And you probably can't even fast travel like you can in Fallout either. Yeah, you got to drop ship. Okay. Okay. Okay. Calm down, game. There we go. Yeah. Right now, I wonder if your encumbrance can increase. It probably can. That's good. You think so? You get stronger. I wouldn't stop. You can sell this stupid. You can sell it. I know. I sell it all the time. Clearly you don't. I know. I've been out on the road too long. I've seen too many things. Colin seen this man in his little ball. Oh, can you get on his horse? No. That's disappointing",
            "start": 1700.56
        },
        {
            "text": "all the time. Clearly you don't. I know. I've been out on the road too long. I've seen too many things. Colin seen this man in his little ball. Oh, can you get on his horse? No. That's disappointing cuz his horse looks cooler than yours and I thought maybe you would be up for a trade. Oh, no. There he goes. This is very particular. The game is very particular sometimes about getting things. Roaches. Roach is gonna be jealous. What the [ __ ] Hor's jealousy meter starts filling in. You're overburdened again. [ __ ] I just want to see if this last bag has a a key to that that uh little slaver thing over there. Not that I would need it. I guess that's my loot. I guess I put down all these [ __ ] maces. Yeah, I don't use them. I don't use axes or maces. I just use my schwarz. Schwarz swwords. What's funny though is that like when you think about it because like incumbrance is supposed to keep things realistic which I appreciate. Yeah. But he still has like 15 swords on him right now in",
            "start": 1741.12
        },
        {
            "text": "What's funny though is that like when you think about it because like incumbrance is supposed to keep things realistic which I appreciate. Yeah. But he still has like 15 swords on him right now in the game and like five bludgeons and two battle axes. I guess what I'm saying is it doesn't really make any sense. Yeah, but it doesn't need to. It's video games. In that case, you might as well not have an encumbrance thing at all. Right. You think so? We're going to get to a merchant here in the next town. We end up at I got a horse on horse collision there. Horse on horse crime. It's a dangerous thing. A lot of hanging bodies in this world. Well, yeah. You you hang them high. You know what I mean? Yeah. Show them what's up. True enough. Yeah. This is the tree that is pretty cool. It's creepy if you like look up at it. Yeah, so fast. That's where all the bad guys go. Or witchers who didn't make it. Hopefully the uh you know, they got their you know, they had a jury trial because Oh, I have",
            "start": 1803.92
        },
        {
            "text": "you like look up at it. Yeah, so fast. That's where all the bad guys go. Or witchers who didn't make it. Hopefully the uh you know, they got their you know, they had a jury trial because Oh, I have to imagine. So, we're going to Crow's Perch. I'll sell some stuff there for you, Call. Thank you. So, do you think you'll beat The Witcher 3? Good question. Yes. I don't think there's much else coming up. I'm I'm excited to be invested in this world. I want to keep getting better. You know what I mean? Yeah. Yeah, we're going to Momoc, which I'm excited about, but I'm disappointed. Yeah, I think that might be a good idea cuz I think we'll have some time to kill. Yeah, but who knows? Maybe we'll invite some fans back to our room to play with us and then we can also play the Wisher. N Hey, talking about my balls. You're a funny dude. Real funny. Nick, you want to beat her on my balls after this? No, thank you. I don't know what that means. I think you know exactly what it means. Yo, merchant",
            "start": 1842.64
        },
        {
            "text": "about my balls. You're a funny dude. Real funny. Nick, you want to beat her on my balls after this? No, thank you. I don't know what that means. I think you know exactly what it means. Yo, merchant dude, it means whatever you want it to mean. Now, some merchants will only buy certain things. Oh, Gwent. Do you like playing Gwent? I haven't played one because I don't want to play the card game. It's fun. Do you understand it? I I I have like literally the guy was like, \"You want to play Gwent?\" I was like, \"No, I want to go kill [ __ ] See you.\" You should play Gwent. We should stop this video. You want me to play Gwent after this? All right, cool. I'll do it. Here I go. Here I go. Here I go again. What's my weakness, man? Have you been upgrading your I mean, not upgrading, but repairing your weapons? Yeah. Yep. And your armor, all that? all these. I go in there, I click the repair all button, I go, \"There you go, buddy.\" Man, you're spending your money left and right, man. I I don't I",
            "start": 1885.68
        },
        {
            "text": "weapons? Yeah. Yep. And your armor, all that? all these. I go in there, I click the repair all button, I go, \"There you go, buddy.\" Man, you're spending your money left and right, man. I I don't I never have enough money to do that. Oh, I'm great. I'm frugal. You are great. Thank you. Selling all my mittens. Yeah. Yeah. See, the merchants's out of money. But you're now you lost. You lost whatever their unit of measurement is. 33 out of 60. I'll play Gwent and see what Let's see what we'll see if we can play five crown. That's great. All right. Cool. How about a few rounds of cards? Gwent specifically. The only card game in this world. Oh, you've never done it. So, just like So, let's see what happens here. Press X. Yeah. Okay. So, yeah. So, you're going to pick your you can add your cards. Uh you can choose to redraw cards. So, you're going to want to draw cards with high level. So, like the the woman next to that. Yeah. with the four unic card over those corner strength place. Close",
            "start": 1925.68
        },
        {
            "text": "Uh you can choose to redraw cards. So, you're going to want to draw cards with high level. So, like the the woman next to that. Yeah. with the four unic card over those corner strength place. Close combat. I see the game is way simpler than they make it out to be. Yeah. Yeah. It's definitely not a hard game to learn. There are weather cards that affect the different lines, but so you see the gems next to each player, the red gems. It's best out of three. Okay. And the idea is the cards that you have are the only cards you have for all three games. Or there can be two games if you win both. So the idea is to like you're those zeros next to each name or this total strength on each row combined. Okay? And the idea is to know when you're going to lose or win and start passing because you're going to need your cards to um to win later round. So yeah, put her there and now you're going to be up four nothing. And he's going to do a total strength thing on his as well or he can use weather to",
            "start": 1978.88
        },
        {
            "text": "to need your cards to um to win later round. So yeah, put her there and now you're going to be up four nothing. And he's going to do a total strength thing on his as well or he can use weather to negate that for instance. Um it's a really very simple card game. Okay. I think see I feel like Ghalt in this game is just like Greg in real life where he's like I don't [ __ ] care about these dumb games. He's a is a baby's game. Can I go [ __ ] stab stuff and [ __ ] that's what I want to do. So he's up one now. So you can use like another arrow there if you want or like using this guy just to make it five, right? But then it's going to be tied and that might be a waste. Like you try to I would use the I would personally use the four uh arrow guy there and see what he how he responds. Because if he's going to start using high level cards, then like that's going to help you later. It seems like he's like going all in here. So now, so you but you can like level the playing field if you want",
            "start": 2028.08
        },
        {
            "text": "if he's going to start using high level cards, then like that's going to help you later. It seems like he's like going all in here. So now, so you but you can like level the playing field if you want with any of these cards except for the ones or you can just pass and he's going to win and then your cards are thrown away. Um so I would try So it's we only play three turns. No, no. Yeah. Like this is No, there you played three games, right? But you're using the same card. So if you if you resign now and he won, then you both have eight cards left to play the next two games, okay? And so on and so forth. So the idea is to try to get them to draw out their their higher higher numbered cards and even give them a win in order to like win the next game. You have to know when to quit. I'm going with this guy. Okay. It's a it's a bold move. Cotton, let's see if it pays off. We'll see what he does. Yeah. So he's up there now with that. Now, a move you can do here is you could use the rain",
            "start": 2073.68
        },
        {
            "text": "with this guy. Okay. It's a it's a bold move. Cotton, let's see if it pays off. We'll see what he does. Yeah. So he's up there now with that. Now, a move you can do here is you could use the rain card. I Is it the rain? No, it's Is it the rain or the frost? Try the frost card. That should That should affect the sword. Um the close combat. The close combat. Yeah. So, try that. And that's going to bring him down to one. Okay. So, we're tied. But it's going to affect you as well. No, he's now down. 1411. Oh, so that guy's like knocked out of it all together. Right. Exactly. Absolutely. So now he's using another card. Well, but also you would knock out your own guys as well. So now he's back up to 17. And you can use, you know, you can stay in the battle if you want by using whatever your cards. I wouldn't use that. I Well, that's fine. I would use maybe yet another one of those. I'm going to use this guy. But you don't you didn't want to do that. That was dumb because you froze your own",
            "start": 2113.04
        },
        {
            "text": "I wouldn't use that. I Well, that's fine. I would use maybe yet another one of those. I'm going to use this guy. But you don't you didn't want to do that. That was dumb because you froze your own guy out. Yep. And now he's using his here, but he has a part that guy's like a partnership thing which increases the strength of the guy next to him. Yeah. So that was a bit of a waste of a card. And he's going all in. So now he's negating unfortunately. Oh [ __ ] All my dudes. Yeah. And his but his own as well. And now you're tied. Okay. So you guys are going all in like like I have not seen a game go this long. What happens? I don't know. Let's find out. So you're up 12 to 10. Having a guy with that cross next to him means that he increases the guy the strength of the guy next to him. He's broken or something, right? He just keeps putting people in the frost category. That doesn't make Well, he that might be the only cards he has to play. You can pass and see what happens, but when you",
            "start": 2160.0
        },
        {
            "text": "broken or something, right? He just keeps putting people in the frost category. That doesn't make Well, he that might be the only cards he has to play. You can pass and see what happens, but when you pass, you can't play again. So, like, you can't play this round again. Sure. I would You're all in at this point. I'd be interested to just see what happens. I would keep playing cards. Um, should I play old watery oil here? Well, that's going to affect your own cards, too. So, I wouldn't play that. I would just keep chipping away with one of those guys. Yeah. Well, this is the only one who can Well, no. No. Neither of these guys can do anything. Well, they're both going to be strength of one, but they don't work, right? Because they're in the Right. But the strength the arrow the guy the the archer woman. Mhm. has a strength of five, but if you put her down, she's going to have a strength of one. I see what you're saying. I see what you're saying. Will he have a strength of zero or No,",
            "start": 2199.36
        },
        {
            "text": "archer woman. Mhm. has a strength of five, but if you put her down, she's going to have a strength of one. I see what you're saying. I see what you're saying. Will he have a strength of zero or No, he should just stay at one. So, I'm going to use him. Yeah. Okay. [ __ ] this goddamn the salesman over here. He passed. So, he's admitting that he's lost. Okay. So, so you can pass as well and see what h Let's see what happens. Hold down the triangle button. Oh, sorry. So, he lost. Okay. But now he has three cards and you have two. And so it's going to be interesting to see how this all plays out. You also have like your your leader card. Sure. What do you want me to do? So you have a sun card. That sun card means that you can get rid of weather ailments. Gotcha. Could use that last time. So it's your turn. And I would just I would just play the archer and see what happens. I mean, you're kind of in a position now where you're going to have to kind of play. Yeah. Because you guys have no",
            "start": 2234.08
        },
        {
            "text": "it's your turn. And I would just I would just play the archer and see what happens. I mean, you're kind of in a position now where you're going to have to kind of play. Yeah. Because you guys have no cards left. Yeah. So he's like already up Shitz Creek. Now you can press square. No, that's no good. Okay. I don't know. I mean, here you can pass and see what happens. He might have another card to play. The problem is that you have no more cards. You like kind of have to win this round. Okay. So, I would just put something down. Yeah, that will work. So that's going to affect if he had like, you know, a ballista or whatever. He's using the same card. So he has no cards left. Okay. Um so play the sun card. Yeah, play the sun card and and it'll get rid of those effects and then let's see what he plays. Yeah, he's out of cards. Great. So So you won. Okay. So the game is Yeah, he passed and you're going to have to pass because you have no card. You have your leader card, but you don't need",
            "start": 2276.72
        },
        {
            "text": "he plays. Yeah, he's out of cards. Great. So So you won. Okay. So the game is Yeah, he passed and you're going to have to pass because you have no card. You have your leader card, but you don't need to play So, just hold down the triangle button again and you should win. So, that's it. One, best of three. Nick, we did it. Great. Don't worry, everybody. The card game. What did you think? It's a very basic card game. Apparently, it gets way harder, but that's like the basics of the game is is judging not only the cards you're playing as you're playing them, but also if like maybe losing automatically just to draw his cards out and then you win the next round. Yeah, I don't think I mean I I probably won't play it much more. I like a good game of Gwent. Greg, you want to leave it there? Sure. Okay, ladies and gentlemen, that's the Wisher 3. Uh Colin, I believe this is going up on Thursday. On Friday, you and I are going to do a deep dive discussion about what we think so far. So, we need",
            "start": 2331.28
        },
        {
            "text": "Okay, ladies and gentlemen, that's the Wisher 3. Uh Colin, I believe this is going up on Thursday. On Friday, you and I are going to do a deep dive discussion about what we think so far. So, we need to play a lot more hours. We're going to do more of that. And of course, we'll continue to have let's plays here each and every day at noon on youtube.com/confunname. It's been a pleasure serving you. Oh, I I always love it when you serve me. So, the pleasure is all mine. You're pretty. Thanks. You're pretty, too.",
            "start": 2373.44
        }
    ]
}