{
    "id": 1523,
    "video_id": "plaoPdRM5Vs",
    "show_name": "Love & Sex Stuff",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Mari Takahashi"
    ],
    "title": "Should You Always Pay On A First Date? (w/Mari Takahashi of Smosh Games) - Love & Sex Stuff",
    "description": "Watch more Mari! https://www.youtube.com/user/AtomicMari\n\nSupport this show! Get the Love & Sex Stuff Shirt here!\nhttps://www.districtlines.com/98029-Love-and-Sex-Stuff/kindafunny\n\nSubmit your questions here!:\nhttp://www.kindafunny.com/loveandsex\n\nDo you have to pay?\n\nEach and every Monday at 9AM PST Tim Gettys and Nick Scarpino answer your questions about dating and relationship advice....cause that sounds like a good idea.\n\n\nFollow us on Twitter!\nMari Takahashi - https://twitter.com/AtomicMari\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\n\n\n\nMusic by Tonedeff - http://www.QN5.com",
    "published_at": 1454346003,
    "duration": 297,
    "transcript_chunks": [
        {
            "text": "Don't worry, guys. I got dinner. No, no, no, no. It's on me. Nah, I got it, guys. Damn. [Music] Samari Nick. Yes. Today's topic comes from our good friend Jerry. Jerry's 16 and he says, \"Hey guys, I have a question concerning the early stages of dating and whether or not I should pay for her, specifically the first date. I feel like sometimes I insult my date by offering to pay for them and sometimes I feel as though they're expecting me to. Again, I understand later in the relationship circumstances change, but from a first date standpoint when we're just getting to know each other, how do we determine the guidelines? This is an interesting one. Yeah, I want to hear your opinion on this. Okay. I'm very opinionated on this and it's probably a very unpopular opinion. Okay. Um, man, why aren't girls paying? I don't understand this. I don't understand. We're It's 2015. Feminism is like blown up. All the girls are just like, I'm a lady and I'm independent and I'm a boss [ __ ] or whatever.",
            "start": 0.24
        },
        {
            "text": "girls paying? I don't understand this. I don't understand. We're It's 2015. Feminism is like blown up. All the girls are just like, I'm a lady and I'm independent and I'm a boss [ __ ] or whatever. And you know what? Why aren't we paying for dates? Espe. And why not the first one? Why not go Dutch? If you're going to go out even for like a lunch date and you're just talking business or whatever, freaking pay. Why not? I don't know. See, I thought I used to think that way, right? So, when I used to It's a little easier now cuz I'm I'm married. So, basically everything I pay for everything and so does she cuz you know what's mine is hers and hers is mine. But when I was single, it costs a lot of money if you're going on a lot of dates like I did because you know this thing. So I used to think, oh god, this, you know, it's it's exactly what you just said, right? It should be equal and all this stuff. But then as I sort of well, I met a woman that I fell in love with. I was like, you know",
            "start": 47.28
        },
        {
            "text": "oh god, this, you know, it's it's exactly what you just said, right? It should be equal and all this stuff. But then as I sort of well, I met a woman that I fell in love with. I was like, you know what, it's worth it to pay for the first date just to not even have to worry about the conversation, right? And it's not even a guy or a girl thing, but I feel like if you were the one that initiated the date, which if it sounds like you did in this situation, it's on you like you should treat. It's not even a matter of like gender equality or any of that in my brain. It's just you know what, you should want to pay for that first date because it is an ex it is it is a perfect time to get to know someone that might end up being your wife. So take out the that awkwardness. Just do the thing where like if she gets up to go to the bathroom, just pay just pay. Be like, I took care of it. Don't even worry about it. Let's get out of here. Don't even talk about it. I think that's that's that's a pro",
            "start": 90.36
        },
        {
            "text": "if she gets up to go to the bathroom, just pay just pay. Be like, I took care of it. Don't even worry about it. Let's get out of here. Don't even talk about it. I think that's that's that's a pro maneuver. My whole thing is you want to just be nice. Be nice to people, you know? Don't even so much think about it in any of these other ways. Just you should always want to pay and then try to pay. But if she stops you, and here's the thing, if she wants to pay, if she wants to go half, don't not let her. I think that's where a lot of guys get caught up is that they they feel the need like, \"No, no, no. I I insist. I'm paying for you. I'm I'm paying for you.\" There's a nice play that game. Play the no, I got it. And like kind of do a couple back and forths, but like don't insist that you have to pay cuz then you're just an [ __ ] Yeah, I completely agree with that. And I would also say this for all the women out there watching it. It's not anywhere close to necessary, but it's really cool",
            "start": 128.48
        },
        {
            "text": "to pay cuz then you're just an [ __ ] Yeah, I completely agree with that. And I would also say this for all the women out there watching it. It's not anywhere close to necessary, but it's really cool when a girl goes, \"You know what? You got this. Let me get whatever the next thing is.\" That is also I think that is that isuch such a good thing. And if she wants it, you can easily say, \"Hey, I'll get the next one.\" And it's just like then all of a sudden everyone's equal and everyone's happy. I got to say with apps like Tinder and stuff though, it's got to get expensive. Well, it does. Expect it. I mean, because that's just how it's been for years and years and years. So, the it's got to be hard for you guys where the expectancy is like the bill comes and then she's just blankly staring back at you and you're like, I got this one, too. Here's another one. But, I guess that's that's the thing is where the communication comes into play and stuff. And it's just like if if that's what",
            "start": 162.08
        },
        {
            "text": "back at you and you're like, I got this one, too. Here's another one. But, I guess that's that's the thing is where the communication comes into play and stuff. And it's just like if if that's what she's going into the Tinder date with, then it's like maybe she's not the one that you're necessarily trying to be with. I mean, that is a pretty big clear side. If someone like, and I'm not talking if someone doesn't notice that they'll came, but if they just stare at you and don't say anything, maybe that's something that you should consider. I'm not saying it's a deal breaker, but just consider that when thinking about going on another date with this person that maybe she's not really into or invested in it. Cuz that's that's my thing is if someone offers to pay and genuine offers, what that tells me is I'm investing in this too, whatever this thing is going to be. And I think that's really really important. If someone just stares at you and expect and there's the ex the unbridled",
            "start": 199.84
        },
        {
            "text": "that tells me is I'm investing in this too, whatever this thing is going to be. And I think that's really really important. If someone just stares at you and expect and there's the ex the unbridled expectation, maybe you should think about that a little bit. That's all I'm saying. Ladies and gentlemen, this has been another episode of Blood and Sex stuff every Monday 9:00 a.m. at youtube.com/kindophony. Mari, thank you very much for joining us. You can follow her on Twitter, atomic mari, and follow her all of her video adventures over at Smosgame. That's right. Is there anything else? Anything you want to say? Uh, where else can we find you? You know what? Just be nice to people. Yeah, be nice to people. That's it. Just be nice. Really good advice. So, if you want to be nice and if you have questions about stuff, you should go to kind of funny.com/lovenex, fill out the form, ask us your questions, and we'll get to you at some point in the future. But if you feel like being bad, go to",
            "start": 235.68
        },
        {
            "text": "questions about stuff, you should go to kind of funny.com/lovenex, fill out the form, ask us your questions, and we'll get to you at some point in the future. But if you feel like being bad, go to kind of funny.com/store and spend some of that hardearned loot on the Love & Sex stuff shirt. It's going to be worth it. Cia. [Music]",
            "start": 269.92
        }
    ]
}