{
    "id": 1541,
    "video_id": "Tfebn_pqVZQ",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Does the PSN Need to Get Better? - PS I Love You XOXO Ep. 22",
    "description": "Does the PSN need to step its game up? One viewer says so, but what do Greg and Colin think? Plus, Uncharted, No Man's Sky, and PS VR talk! (Released 02.09.16)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://soundcloud.com/xshawnthomas\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/kindafunnyvids\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1455037202,
    "duration": 5361,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to PSI Love You XOXO Episode 22. I'm one of your hosts, Greg Miller, alongside the pride of Long Island, Colin Moriarty. It's good to be here with you today. It's good to be here with you today. You got a dusty laptop there. Got some fingerprints on it. Got some fingerprints on it? Yeah. Still got that sweet ass dredge sticker though. I do, thank you. Has anyone from dredge commented publicly about this? No they haven't. No one's publicly commented. Dredge, get your shit together you sons of bitches. They're busy. Are they? I hope so. What have you been playing, Colin? What have I been playing? Firewatch. Played that one night last week. Beat it. Of course. I'm going to power review discussion up on YouTube.com. Such kind of funny games, but no spoilers. Yay or nay? What'd you think? It's all right. Yeah. Yeah. I think that, I mean, I was reading reviews today. Real positive. Not really. I mean, the games got like an eight on Metacritic, so I mean, that's,",
            "start": 0.0
        },
        {
            "text": "nay? What'd you think? It's all right. Yeah. Yeah. I think that, I mean, I was reading reviews today. Real positive. Not really. I mean, the games got like an eight on Metacritic, so I mean, that's, that's great, but a lot of people are getting sixes and sevens, which is more. I didn't see this this morning. I think six is probably. I saw more of the IGNs, the polygons than today. Yeah. Gamespot gave it a seven. Gotcha. I think Push Square gave it a six and something like that. So. I think that was reflected in our discussion, right? That there's like this hodgepodge of opinions of it. Kevin loves it. Absolutely. And then it's from there. It kind of goes down. Yeah. I think it's saying, I think it's a, it's a great idea for a game. I think it's worth playing. It's only $20. It's really not. $20 is really not a lot of money at all. So and it only takes a night. So it's not going to like suck up your time. Yeah. You know, three, four hours you're done with it. You never have to play it",
            "start": 60.96
        },
        {
            "text": "$20 is really not a lot of money at all. So and it only takes a night. So it's not going to like suck up your time. Yeah. You know, three, four hours you're done with it. You never have to play it again. But I think it's the story's somewhat incoherent and I think people will either understand what I mean by that or not, but I mean it's, it's, it's going to be based on how you interpret the game and stuff like that. Sure. Yeah. But people should go watch the review. Yeah, it didn't live up to my expectations is my summary. I still think people should play it. I think that, like I said in the review discussion, right, I think the best part about this is that we all have. We all took something different from it's a very personal game. I feel like when you go through and play and make these choices and that you know resonates or doesn't resonate and how you interpret the characters and what their relationship is. I like that it was like this is the first review discussion. I feel like",
            "start": 90.88
        },
        {
            "text": "choices and that you know resonates or doesn't resonate and how you interpret the characters and what their relationship is. I like that it was like this is the first review discussion. I feel like we've done where it felt like a book club where we all had something different about motivations characters. How this all works, whereas before I mean like you mean stymied fallout and it was like we enjoyed or didn't enjoy things at different extents, but it wasn't like we took something from this game or it took something from us. Sure. Yeah. Other than that, I'd. I really been playing anything I mean, what did I play? I mean, I downloaded a lost dimension on Vita, but I never really messed around with it. Yeah, I'm playing a little bit of Tetris on PS four as you do. Yeah, I was broken. Yeah, exactly. But otherwise, yeah, I mean, I think since the last episode, I mean, I really only played fire watch. Yeah, yeah, I did fire watch. I've been. I've been tinkering around with the minecraft",
            "start": 122.52
        },
        {
            "text": "exactly. But otherwise, yeah, I mean, I think since the last episode, I mean, I really only played fire watch. Yeah, yeah, I did fire watch. I've been. I've been tinkering around with the minecraft again. I like I like that on the vietnam just something to chill out with. I played a bit of the witness a little bit more. It's one of those like a game. I'll chip away at maybe I don't know very pretty. The puzzles aren't insane where I am right now. Early on, there is that sense when I figured out of accomplishment, but I don't know if I'm drawn back to it. Yeah, there's no. I have no desire to play. Yeah, exactly. I like the world beautiful peaceful. That's good. Cool. Got that going for great good. Good great grand. Did you enjoy your Super Bowl? I did. Did you? Yeah. What did you do? You didn't go to you didn't go to where'd you go? Uh, Erin and her cousin were not feeling well. So I think they got each other like sick just being in proximity. Sure. Um, so we just like kept the low",
            "start": 156.68
        },
        {
            "text": "didn't go to you didn't go to where'd you go? Uh, Erin and her cousin were not feeling well. So I think they got each other like sick just being in proximity. Sure. Um, so we just like kept the low key and went to like some small bar that was like not that crowded. It was nice. I just sat at the bar for four or five hours and just ate and drank. A game was good. Good outcome. Yeah. So I wouldn't have minded the Panthers one, but of course. Yeah. Yeah. Now Peyton's certainly, I mean they did ask him, you know, he said he has to reflect on things, but hopefully you're smart enough. He is going to drink some Budweiser and whatever the fuck he said about light and uh, yeah, he's got some things to think about, but I don't know what there is to think about. He should get out while they're going. He's good. Get out. Just like Elway. Ladies and gentlemen, before we get into PS, I love you XOXO, which of course is kind of funny. His PlayStation podcast of course is the number one PlayStation",
            "start": 197.8
        },
        {
            "text": "He's good. Get out. Just like Elway. Ladies and gentlemen, before we get into PS, I love you XOXO, which of course is kind of funny. His PlayStation podcast of course is the number one PlayStation podcast on the Internet and of course it posts every Tuesday at nine a.m. Pacific time on YouTube dot com slash kind of funny games and podcast services around the world. I have housekeeping items for you. Number one, the bakers dozen t shirt is t shirt Tuesday this week. So if you're watching this at nine a.m. Pacific time, when this episode has come out at eleven thirty a.m. Pacific time, you can head over to kind of funny dot com slash. No kind of funny dot com slash t shirt Tuesday, where you can get directed right to the link. We do these flash sales. We only sell these shirts for an hour. I warned you last week bakers dozen was coming. This is your final reminder, and if you listen to this after twelve thirty p.m. Pacific time Tuesday, you're scared. It's over. You missed it already.",
            "start": 238.2
        },
        {
            "text": "I warned you last week bakers dozen was coming. This is your final reminder, and if you listen to this after twelve thirty p.m. Pacific time Tuesday, you're scared. It's over. You missed it already. Sorry bro also go vote for me in the South by Southwest gaming wards over a kind of funny dot com slash South by Southwest, another word. We can win and show people were a big deal, even though they don't know us and then also Tim floated this to me. I guess I didn't know this. Apparently, I tunes over there something happened, some gremlin got in the system. So if you're not seeing new thing, new episodes of PS, I love you, X, X, O games, cast game over Greg popping your feed. You need to unsub and then re sub to the podcast. So if you're seeing anything or you just want to take around, make sure nothing goes off the rails, do that Colin. Let's begin the show with what is and forever will be ropers report. Time for some singular possessive news. Let's see there are twelve items on the",
            "start": 276.8
        },
        {
            "text": "sure nothing goes off the rails, do that Colin. Let's begin the show with what is and forever will be ropers report. Time for some singular possessive news. Let's see there are twelve items on the list of bakers dozen number one. Tt games is really seen yet another lego game. This one for star wars, the force awakens the aptly named lego star wars. The force awakens is coming to PS four PS three and vita as well as every other imaginable platform on june twenty eighth PS four and PS three gamers will have access to exclusive dlc in the form of the droid character pack and the phantom lin level pack. There are no further details available right now that you can watch the introductory trailer online. How did you feel about the news today that this is going to expand on the lower of the force awakens and explain the red arm of C three pio? That's well. I mean, that's fine. It's interesting choice. Yeah, but the lego is going to do that. I mean, they probably see good resonance with the",
            "start": 317.0
        },
        {
            "text": "awakens and explain the red arm of C three pio? That's well. I mean, that's fine. It's interesting choice. Yeah, but the lego is going to do that. I mean, they probably see good resonance with the with the star wars and lego since, you know, stars games are have been lego lego started. Yeah, ten, eleven years now. So what's interesting for me is I thought these days had come and gone. I thought when disney took over star wars that we would see no more of these opportunities. Disney would keep it in house or with their own things like disney infinity, which we have already seen and then which also raises the question for me is if they're doing another lego star wars game, can they now put star wars into lego dimensions? Will disney allow that since they already have their own toys of life game that features star wars characters prominently? Yeah, there's some questions. I would say no, but I would have said this was a no to who the hell knows anymore. Yeah, I don't know. I mean, we'll",
            "start": 364.6
        },
        {
            "text": "game that features star wars characters prominently? Yeah, there's some questions. I would say no, but I would have said this was a no to who the hell knows anymore. Yeah, I don't know. I mean, we'll see. We'll see. It's interesting, you know, timing for the game. I don't know why they wouldn't have had it. So this goes back to what I was saying about how they don't. They didn't have a true everybody game for star wars this holiday, which they didn't battlefront. I don't care what anyone says is not a game that sold well, but it's not a game that was for everybody. They didn't have a game that marketed itself at Children and casual gamers battlefront is not a game for a seven year old or inside a game for a person who doesn't play video games very often, but like star wars, um, even though it is a casual shooter. Um, so this would have been a good timing for this is this exact game. I thought that they would maybe try to have ready. Yeah, um, and clearly they were working out. That's",
            "start": 400.88
        },
        {
            "text": "it is a casual shooter. Um, so this would have been a good timing for this is this exact game. I thought that they would maybe try to have ready. Yeah, um, and clearly they were working out. That's why I think the most interesting thing about this because I don't think I'm going to play this one. Maybe I'll tinker with it, but I'm not going to try platinum in or anything crazy again. I like lego games, but I like lego games that are aimed at, you know, my personal interest or whatever the most exciting thing interesting about this. I think is the business dealings behind it. You know, is this disney truly being open to putting their property wherever they're wherever people are. You know, do they think that I'm most interested about dimensions does this open the door to dimensions or is there a no strict? No, we're not going to do right. It's kind of thing number two, a limited edition playstation four console bundle will launch alongside uncharted for the end on april 26th the",
            "start": 433.56
        },
        {
            "text": "is there a no strict? No, we're not going to do right. It's kind of thing number two, a limited edition playstation four console bundle will launch alongside uncharted for the end on april 26th the console will come with a 500 gigabyte hard drive and uncharted for on blu-ray. The console itself is gray blue with a gray blue controller alongside it. Sick Parvus magnum will be etched into it, which means greatness from small beginnings. That's what's on drake's ring. Drake is also seen on the side of the console along with the classic golden uncharted logo. Preordering it will net you a voucher for the uncharted drake's fortune outfit, golden weapon skin and additional points to spend in uncharted fours multiplayer mode. The console bundle will cost $399 in the us and the controller will be made available separately starting in march for 64 99. The controller is pretty sweet looking. Do you need it? But yeah, exactly. We got the thing you and I always come down on these special edition",
            "start": 463.8
        },
        {
            "text": "made available separately starting in march for 64 99. The controller is pretty sweet looking. Do you need it? But yeah, exactly. We got the thing you and I always come down on these special edition things. I don't need any of them right. Really wanted this guy. The silver one, of course, really like the controller of stuff. Yeah, I mean, I just controllers are it doesn't matter. The controller definitely is more more appealing to me. Sure. Now somebody in the comments over on kind of funny dot com slash p s q where you can submit your question, asked a question I even bother to put in the back, but he was who's his aim that he made that he was saying and I didn't put this in there because I thought was a silly question. Who's the same dad if you're if you're an uncharted fan, you were already bought a playstation four and I say not necessarily think so. Yeah, it's named it uncharted fans. I think that there's plenty of uncharted fans that did not bought the ps4 yet because they're",
            "start": 501.4
        },
        {
            "text": "already bought a playstation four and I say not necessarily think so. Yeah, it's named it uncharted fans. I think that there's plenty of uncharted fans that did not bought the ps4 yet because they're waiting for uncharted napro and this is an obvious console bundle. So it's not like you know they probably knew any any playstation fan knows that they're probably going to do something with uncharted four in the ps4 and I don't think it was a no brainer that if you're an uncharted fan, you'd want to buy the collection because there was the bundle obviously for the Nathan Drake collection, but it's like I'm if you're an if you're a casual uncharted fan, you're excited for new one charted, not playing the old ones agreed number four, no number three. Okay, skipping in number three. This is upcoming game doom, which was first announced in two thousand and eight and has gone through multiple iterations. Nury workings finally has a release date. It will launch on playstation four as well as",
            "start": 539.52
        },
        {
            "text": "game doom, which was first announced in two thousand and eight and has gone through multiple iterations. Nury workings finally has a release date. It will launch on playstation four as well as xbox one and pc on may thirteenth. The collectors edition of fallen out of spelling error of the game will come with a twelve inch revenant statue as well as a steel case for one hundred and nineteen ninety nine. Oh, I hate steel cases. You too. I want them all to look the goddamn same. Me too. The statue looks pretty cool. You get it. You're a big doom fan. No, I don't like it. I mean, I forget the game, but sure, of course you. Yeah, exciting sooner than I thought. Yeah. And then number four. Speaking of Bethesda, the developer unexpectedly announced it will be at e three again in twenty sixteen. The company held its first ever e three press conference in two thousand and fifteen to announce fallout four and show up other games including dishonored to and the aforementioned doom and it was",
            "start": 576.52
        },
        {
            "text": "The company held its first ever e three press conference in two thousand and fifteen to announce fallout four and show up other games including dishonored to and the aforementioned doom and it was widely assumed that the show was a one off based on release schedules. The conference will be held on sunday, june twelfth at seven p.m. at pacific time and nothing else is known about what the company is planning to announce or otherwise talk about snarky starkey went over to kind of funny dot com slash p s q just like you can to get your questions right and says, hey guys, since Bethesda went ahead and announced their e three press conference the day after you recorded the last episode, hashtag colin was wrong. What do you think they'll show? My guess is fallout dlc doom and then finally put in parentheses edit since it's now been announced for may release. Maybe not in dishonored to will be the highlights, probably still way too early for a team to have anything from elder scrolls vi to",
            "start": 611.52
        },
        {
            "text": "in parentheses edit since it's now been announced for may release. Maybe not in dishonored to will be the highlights, probably still way too early for a team to have anything from elder scrolls vi to show off or tease, but that would certainly be a treat. Thanks trevor ps. I love you and can't wait for kind of funny live to what's what's his what's the bethesda two point. I'm going to look like here, so I think that he's right that fallout dlc is like a shoe in a hundred percent. I can't wait. God damn you think. Do you think by then they have mods on consoles? Are they going to announce that date to its today? Yeah, it could be. I mean, I don't know. I don't know that that would be a huge splash. I think it'd be I'm not saying it's the only thing I'm just saying that's what you say that to get people excited for the moment and then you also go hey by the way, dlc coming you, but if you look at like xenomax is, you know, but that like bethesda is owned by a company called xenomax.",
            "start": 647.84
        },
        {
            "text": "to get people excited for the moment and then you also go hey by the way, dlc coming you, but if you look at like xenomax is, you know, but that like bethesda is owned by a company called xenomax. They're their development studios. They have, let's see seven of them. So bethesda game studios is doing fallout. Xenomax online is doing, you know, tamriel unlimited. So then you have id, they're doing doom and then you get start getting into like things like arcane studios with dishonored. But I think that and battlecry studios, which is doing battlecry, but I think that you are or trevor is missing two major things here and I think that there's two major games that are gonna be announced at least at least one of them. But I would say both of them is that tango, which did the evil within as their first game. We'll probably announce the evil within two, you have to assume or a new project, but the evil within sold very well and the machine games of course with wolfenstein. I think that a",
            "start": 685.96
        },
        {
            "text": "their first game. We'll probably announce the evil within two, you have to assume or a new project, but the evil within sold very well and the machine games of course with wolfenstein. I think that a new wolfenstein would make sense as well now. How that would fit alongside doom in terms of these two kind of futuristic shooters, even though, you know, wolf that takes place in the past, but it is a futuristic shooter. Sure. Got that crazy nazi technology, right? Exactly. You know, it just seems to me that there's a there's a good opportunity for them to announce their games as well or at least one of their games as well. And tango has obviously been quiet, I think a little longer than than machine games when you consider the dlc for for wolfenstein, but they can move fast. It's not like the game has to come out this year, but then again they might learn the lesson of not announcing games too soon, but they did talk about dishonor too and it's still not out yet as well. So fallout was",
            "start": 728.04
        },
        {
            "text": "game has to come out this year, but then again they might learn the lesson of not announcing games too soon, but they did talk about dishonor too and it's still not out yet as well. So fallout was really the anomaly there in terms of, you know, quick to announce quick to to release kind of situation. Here's one thing I want to throw out there and don't get me wrong. I don't think it would be the exact same thing, but do you think there could be any movement at this conference and announcement with pray? Remember pray to had got we've been shown to us years ago is when we saw fallout. No, when we saw yeah, skyrim in everybody was bonkers for it looked like a really cool idea and then it just never came before she got canceled or whatever. Do you think and I'm not so I don't think it's pray to, but do you think that maybe some they've had somebody working on that? Maybe it'll be cool to have a big splash like that, but I think that if you just have just logically thinking fallout dlc",
            "start": 770.6
        },
        {
            "text": "to, but do you think that maybe some they've had somebody working on that? Maybe it'll be cool to have a big splash like that, but I think that if you just have just logically thinking fallout dlc dishonor to release date or something or it's whatever Wolfenstein and able within that's a pretty good conference. That's a great conference. That's a really, really fucking great conference. So I mean I'm not a dishonored fan with people like that game and I would be anything at machine games is doing. I hope that they're working out Wolfenstein. I would make sense. Yeah, I'm sure they're working, but they can be working there. The studio, you know, a lot of those guys didn't come from Starbury, so their their their pedigree is shooters. So yeah, just stick with what you know and you know, you have to annualize your games, but you can stick with IP. Well, we're in IP and make them better. So, you know, Wolfenstein was so fantastic that it would be a shame for them not to go back to it. Are",
            "start": 808.08
        },
        {
            "text": "have to annualize your games, but you can stick with IP. Well, we're in IP and make them better. So, you know, Wolfenstein was so fantastic that it would be a shame for them not to go back to it. Are you still chipping away at the old blood? Yeah, I guess I did something I was playing. Yeah, I just did the challenge maps, but I'm not really like trying to get anywhere and I'm just having fun with it. Dicking around. Yeah, you ain't in dicks as they say. Yeah, Dick Yankin number five. Capcom is reportedly discussing the possibility of making a new Ani Musa game, at least according to the Daily Star online. Capcom's Yoshinori Ono told the Outlook quote, Capcom as a company know we have many brands, IPs and series that are beloved by players around the world and we always have fans asking us when it's this or that coming back. I've spoken internally with people who made Ani Musa with me originally and talked about maybe how interesting it would be to revisit that series, but fans should",
            "start": 844.2
        },
        {
            "text": "when it's this or that coming back. I've spoken internally with people who made Ani Musa with me originally and talked about maybe how interesting it would be to revisit that series, but fans should know that we're not further down that road than in the discussion phase. Right now I'm so focused on Street Fighter 5 that I'm not really in a position to start that same level of battle that I had getting Street Fighter 4 made. So yeah, obviously Yoshinori Ono worked on the original Ani Musa and one of the ironic things he says in the story later on is that when he wanted to make Street Fighter 4, the argument was that Capcom was like, well we have these series that sell like Resident Evil and Ani Musa and and then Ani Musa hasn't had a new game in ten years and obviously Resident Evil sucks now. So it's ironic how things change. Ani Musa I think can live again. It will for sure. I hope so. Ani Musa 1 and 2 and 4 I think were all great games, especially the first two, were fucking awesome",
            "start": 880.68
        },
        {
            "text": "So it's ironic how things change. Ani Musa I think can live again. It will for sure. I hope so. Ani Musa 1 and 2 and 4 I think were all great games, especially the first two, were fucking awesome games and Ani Musa, the original Ani Musa, was the very first PS2 game to sell over a million copies. So yeah, that's all there is to be seen, but anytime Ani Musa comes up, you get excited. Yeah, definitely. Number six, this is a weird one I thought. Long in development, zombie shooter H1Z1 is evolving into a new form. Basically it's being split into two separate games. This comes from attention early access players have paid to both the survival style game and the battle royale game mode, which will now be severed from one another and released separately. In a statement Daybreak Studio said quote, the more we develop this game with you, our community, the more we realize that in order to fully support both aspects of H1Z1 and their respective players, we needed to make them their own",
            "start": 920.24
        },
        {
            "text": "quote, the more we develop this game with you, our community, the more we realize that in order to fully support both aspects of H1Z1 and their respective players, we needed to make them their own standalone games supported by their own dedicated development teams. Many players in the community have been discussing splitting the game and we've heard you loud and clear. We want to make sure we give both the titles the support they need and deserve to truly flourish. End quote. The result is H1Z1 just survive a persistent open world zombie survival game like the one that they, you know, have been working on. Pretty much what is H1Z1 now. And then H1Z1 King of the Hill, which is a more fast paced shooter. King of the Hill launches on PS4 this summer. Bizarre. I mean it's not. At first glance when you hear the story it's bizarre and then when you think about no H1Z1's been out forever, how do you get somebody excited about a game that's already been out forever, get more headlines, how do",
            "start": 959.36
        },
        {
            "text": "when you hear the story it's bizarre and then when you think about no H1Z1's been out forever, how do you get somebody excited about a game that's already been out forever, get more headlines, how do you get back in there? Because I'm sure it's like every other persistent online game, right? The longer you're out, the less IJN game spot. Whoever wants to cover you, even us who want to talk about you, right? Because, okay, you're old news. People know you have your audience, so you get new audience this way. Plus they coupled this with the announcement of the Xbox One PS4 version supposedly coming out this summer, which I don't believe for a second. But yeah, it's I think it's a ploy to get back in the headlines. I don't know. I mean Alfredo Diaz is the only H1Z1 player I really know. I'm not sure how he cares how much he cares about it, but again he had stopped playing it. I haven't seen him stream that in a long time. Right. We'll see. It's an interesting move. Part of me feels like",
            "start": 991.56
        },
        {
            "text": "not sure how he cares how much he cares about it, but again he had stopped playing it. I haven't seen him stream that in a long time. Right. We'll see. It's an interesting move. Part of me feels like it's a money move, but part of me feels like it would cost more to make the game separately. So if you have two development teams, unless you're severing it, the teams, you know, that you have and yeah it just seems like a, it seems like a, it seems at the same time a focus done on a focus move depending on how you. I'm gonna call Alfredo. I don't want to know his opinion on this. Oh, I didn't bring my phone. So Alfredo, you get off light this time. Number seven. After roughly three years, PS3 exclusive free-to-play shooter Dust 514 is shutting down. Developer CCP announced the shutdown on their forums noting in part, quote, we are very proud of what we've learned and accomplished with Dust 514 on PlayStation 3 over the past three years and it is an honor to be part of such a dedicated",
            "start": 1029.8
        },
        {
            "text": "their forums noting in part, quote, we are very proud of what we've learned and accomplished with Dust 514 on PlayStation 3 over the past three years and it is an honor to be part of such a dedicated community. We consider Dust 514 one of the best free-to-play offerings on the platform, but the years have caught up with us. It is with a heavy heart that we inform you that Dust 514 will be shutting down on May 30th, 2016. We therefore will not be releasing the 1.3 update as we had planned. Players will continue to be able to play for free on our servers until then, but all further PSN packs and purchases have been removed and disabled from in-game marketplace and the PlayStation Store. Players with existing Aurum will be able to continue to purchase items from the in-game marketplace. Aurum of course, does that end in quote. Aurum of course is the in-game currency. Yeah, I don't know how it even lasted this long. This was a disaster. It's one of those, yeah, when was the last time",
            "start": 1063.12
        },
        {
            "text": "Aurum of course, does that end in quote. Aurum of course is the in-game currency. Yeah, I don't know how it even lasted this long. This was a disaster. It's one of those, yeah, when was the last time anyone talked about Dust 514? I feel like the last time people talked about Dust 514 was before it came out. Because they just teased it so long and it sounded so promising because as people might not remember, Dust 514 was kind of a technical marvel because it looked, didn't look good, but it connected with EVE Online on PC in an intimate way where the planetary battles in the game that you never saw on EVE because you were in a spaceship in space were happening on the planets below and the games interacted with each other and you can talk to each other. So it's a very cool idea. And I remember being really jazzed not to play it because I wasn't into the game itself, but about how progressive it was. And it just didn't seem to work out. Well it just took forever. Remember this is totally",
            "start": 1098.68
        },
        {
            "text": "being really jazzed not to play it because I wasn't into the game itself, but about how progressive it was. And it just didn't seem to work out. Well it just took forever. Remember this is totally a game that did it all wrong. It came out, had this great announcement, this great hook, we're gonna do this console game, it's gonna tie into EVE, everyone's gonna love it and then it took years and years and years and you saw it again and again and again. It was like, where the fuck is this game? Put it out. And then it came out in the beta release and then the full launch and you're just like, what the hell is going on? Yeah, it was very muddled. It was not well done. But they are making like a spiritual successor. I don't remember the name of it on PC. EVE Valkyrie. No. I know. Number eight, Square Enix is listening to fans who want Adventures of Mana on Vita in the West. Adventures of Mana is a remake of the Final Fantasy adventure, a Game Boy exclusive RPG, but unlike Japanese gamers",
            "start": 1140.76
        },
        {
            "text": "Square Enix is listening to fans who want Adventures of Mana on Vita in the West. Adventures of Mana is a remake of the Final Fantasy adventure, a Game Boy exclusive RPG, but unlike Japanese gamers who got it on iOS and Android as well as Vita, Western gamers only got the phone ports. Square Enix Europe tweeted out that it's looking at it's listening to fans and is looking into the possibility of a Western Vita port. Go to at Square underscore Enix underscore EU at Square underscore Enix underscore EU on Twitter and look and look for the tweets and follow the link provided to the Square Enix blog post where you can tell them you want it in the comments. I bet a lot of comments are saying they want it. They are. Number nine. You think they'll get it? Probably not. Number nine, Grand Theft Auto 5 has officially reached 60 million units sold. Or this is shipped really, including digital copies sold, making it the fourth best selling game of all time. Behind Minecraft at 72 million units,",
            "start": 1174.76
        },
        {
            "text": "5 has officially reached 60 million units sold. Or this is shipped really, including digital copies sold, making it the fourth best selling game of all time. Behind Minecraft at 72 million units, Wii Sports at 82 million units and a mobile version of Tetris, which is downloaded 425 million times. And I think that that's that's a fish numbers. Come on. Let me correct the. Super Mario Brothers at 40 million. Mario Kart Wii at 36 million and Tetris on Game Boy at 35 million sit behind it. So very impressive. So good company. Yep. Number 10, The Witness, which has been all the rage amongst numerous members of the hardcore PS4 community, as well as PC gamers, officially sold, quote, substantially and quote, more than 100000 copies in its first week on the market across both platforms. It grossed over five million dollars. The Witness made more money in a week than Jonathan Blow's last game Braid made in his first year on the market from August 2008 to September 2009. Although the game is",
            "start": 1214.24
        },
        {
            "text": "over five million dollars. The Witness made more money in a week than Jonathan Blow's last game Braid made in his first year on the market from August 2008 to September 2009. Although the game is more than twice as much as Braid. Does that surprise you that it sold that well? No, not really. It seemed like people really loved it. So I'd like to go. To a tangentially related question. OK. Over at kind of funny dot com slash p.s. Q from BP Mizzola. Hey, guys, I've been wondering something lately since we are quickly approaching the release of No Man's Sky. I started wondering how much it would cost upon release. Given that Joe Danger games have all been downloadable games priced at around ten dollars. I assume No Man's Sky would come out around 20. However, the more hype Sony builds with the game and with The Witness recently coming out at 40 dollars on top of your most likely accurate prediction of it being a piece or piece VR launch game. Will we see this game as a 60 dollar retail",
            "start": 1257.64
        },
        {
            "text": "the game and with The Witness recently coming out at 40 dollars on top of your most likely accurate prediction of it being a piece or piece VR launch game. Will we see this game as a 60 dollar retail thing? Prices don't matter, of course, but it just seems like this game is now closer to being larger. A to A, A to AAA game instead of a download only indie. Your thoughts. So it's interesting because this is what you've talked about for a long time is you want to see people explore the scale of pricing on digital downloads so that when a game like The Witness comes out at 40 dollars, people don't flip their lids, which they did, of course. Then they got the game and realized it's 80 to 90 or however long you want it to be. Maybe I shouldn't be pissed off if it's 40 dollars. Where do you think No Man's Sky shakes down in this situation? I don't know. I feel like No Man's Sky is going to be 60 dollars, but I just feel like it's because of Sony's involvement with it and the scale and scope",
            "start": 1303.16
        },
        {
            "text": "No Man's Sky shakes down in this situation? I don't know. I feel like No Man's Sky is going to be 60 dollars, but I just feel like it's because of Sony's involvement with it and the scale and scope of it as well. So I don't know. I think The Witness is a nice emblematic example of unique pricing that 40 dollars in the 60 dollar game era used to mean budget title at retail. But now it doesn't mean that. And so I think The Witness shows that it doesn't have to mean that The Witness is very well made. It was in development for a long time. So I want to continue to see the pricing explored from free to hundreds of dollars if you think your game's worth that. I just don't think that we should have this expectation that a game just because it comes in a box should cost 60 dollars. Maybe it should cost 30 or maybe it should cost 100 dollars depending on the game. I don't think there's anything wrong with that. It's like when you used to buy albums and you get a double CD sometimes and they",
            "start": 1345.48
        },
        {
            "text": "cost 30 or maybe it should cost 100 dollars depending on the game. I don't think there's anything wrong with that. It's like when you used to buy albums and you get a double CD sometimes and they call it Smashing Pumpkins Infinite Sadness was two albums and that cost more than a CD, one CD thing because there's more music. It's not really the cost to manufacture. It's that there's more music. I hear you. So I like it. I like that he was bold enough to charge 40 dollars. I'm sure he knew that it was not going to be easy to do that. I think No Man's Sky won't be 60. I think it'll be a full 60, but 40 sounds right. You know what I mean? Especially if it is, but if our prediction comes true and it is, hey, this game is going to be a PlayStation VR game as well. I think that makes sense then right because you want a game that's a hopefully I'm, you know, I'm putting it on a pedestal already, hopefully amazing and then that moves the VR units or at least gives everybody who buys the VR a",
            "start": 1392.58
        },
        {
            "text": "right because you want a game that's a hopefully I'm, you know, I'm putting it on a pedestal already, hopefully amazing and then that moves the VR units or at least gives everybody who buys the VR a reason to pick it up. And if that's the case, you're buying this headset, you want it not at some crazy price. Sure. Number 11, Titanfall 2, which unlike the original Titanfall will come to PlayStation 4, will officially have a campaign, something the original game lacked and something the original game was criticized for. Jesse Stern, the game's writer, talked to Forbes about the quote, grounded, dirty, human and real end quote world, which Titanfall 2 will take place in. While developer Respawn didn't have the resources to focus on both multiplayer and single player in the original, 10 million units sold to the original has given the studio some leeway with which to work. As far as what what the game will touch on thematically and in terms of storytelling, he told Forbes the following",
            "start": 1432.38
        },
        {
            "text": "units sold to the original has given the studio some leeway with which to work. As far as what what the game will touch on thematically and in terms of storytelling, he told Forbes the following quote, So we are doing our best to deliver a vision of global grand global colonial warfare, retelling the story of the American Revolution and the American Civil War in space. We imagine the next generation of immigrants moving out to the new frontier of an inhabitable planet rather than taking a traditional sci fi approach to that. We wanted to look at how that would happen practically, what the ships would look like and what and with machines that were designed for excavation and construction, demolition and working the land. And what happens when they are turned into instruments of war. What inspires us is the junction of technological advancement with the inevitability of conflict and war and what the next war might look like. In Titanfall 2, there will be a lot of scenes where science",
            "start": 1464.18
        },
        {
            "text": "inspires us is the junction of technological advancement with the inevitability of conflict and war and what the next war might look like. In Titanfall 2, there will be a lot of scenes where science meets magic, but keeping it grounded and dirty and human and real. Grounded dirty humans. So that's cool. Yeah. So interesting. Are you going to play? I'll play the campaign, I'm sure I am. Yeah. Then you'll get addicted and you'll come play the multiplayer game. I doubt it. And finally, number 12. Don't you want to regen with me? No, not at all. I have no interest in regening with you. I just don't even know what that means to be honest. Number 12. Rogue. This is the wrap up. Rogue like RPG. Shiren, the wanderer, the tower of fortune and the dice of fate is coming exclusively to Vita on July 26. Should I be excited? I don't know. It looks pretty cool. Yeah. The art look cool. I feel like roguelikes. I guess it's a game to keep an eye on. And who doesn't? Rhythm platformer runner two is",
            "start": 1500.18
        },
        {
            "text": "26. Should I be excited? I don't know. It looks pretty cool. Yeah. The art look cool. I feel like roguelikes. I guess it's a game to keep an eye on. And who doesn't? Rhythm platformer runner two is coming to PS4 on February 23rd. Gameboy color inspired platformer Ninja Senki DX comes to PS4 and Vita on February 23rd. That game looks rad. Strategy RPG Grand Kingdoms, or Grand Kingdom singular, comes to PS4 and Vita on June 21st. Hack and slasher Mitsurugi Kamui, Kamui Hikai. Mitsurugi Kamui Hikai. Coming to PS4, is coming to PS4 on February 16th. And finally, Mirror's Edge Catalyst will get a beta. And sign ups are now live for PS4 as well as other platforms at mirrorsedge.com slash beta. So sign up for that. And that is all for the news. Colin. Yes. I do like roguelikes. So I'm looking forward to seeing how that Vita game pans out. But it's so far away. If I want to know what came to the mom and grub shops this week, where would I go? You go to the upcoming list of PlayStation 4,",
            "start": 1538.18
        },
        {
            "text": "forward to seeing how that Vita game pans out. But it's so far away. If I want to know what came to the mom and grub shops this week, where would I go? You go to the upcoming list of PlayStation 4, PlayStation 3 and PlayStation Vita software. By the kind of funny co-founders. Arslan, the warriors of legend, comes to PS4 and PS3 digitally in a retail. Says, an exciting collaboration between the heroic legend of Arslan anime and the action infused warriors series. The exhilaration of plowing through large enemies has fused together with this charm and style of the world crafted in the anime. Experience the grand historical fantasy of Arslan. Okay. Alright. How's that treat you Colin? Pretty bad. Assassin's Creed Chronicles comes to PS4 digital and at retail. It says, follow three legendary assassins in their journey of revenge, retribution and redemption and a stunning reimagining of the Assassin's Creed universe. Slave from the shadows, master the art of parkour and take the leap of",
            "start": 1589.18
        },
        {
            "text": "assassins in their journey of revenge, retribution and redemption and a stunning reimagining of the Assassin's Creed universe. Slave from the shadows, master the art of parkour and take the leap of faith in the series of action adventure platform games presented as a collection of spectacular living paintings. And then Assassin's Creed Chronicles Russia, which is the third one that's in the collection, comes to PS4 digital only. It says, Russia 1918. Nikolai Orlov wants to leave with his family but is required to perform one last mission for the assassin order. Infiltrate the house where the Tsar's family is being held by the Bolsheviks and steal an artifact that has been fought over by assassins and Templars for centuries. Along the way, he witnesses the massacre of the Tsar's children but manages to save the princess Anastasia. He must escape the Templars while protecting the artifact and Anastasia. Okay. Were these games good? Has anyone ever talked positively about them? I don't",
            "start": 1636.18
        },
        {
            "text": "but manages to save the princess Anastasia. He must escape the Templars while protecting the artifact and Anastasia. Okay. Were these games good? Has anyone ever talked positively about them? I don't know if I've heard anyone talk about them at all. Yeah, exactly right. I forgot all about them that one time. They're like, oh, they're almost out. I was like, oh, shit. Breath of Fire 3 comes to PSP digitally. No. And it's compatible with Vita and PSTV. Says the legendary RPG series Breath of Fire returns with the tales of long forgotten worlds and trepid heroes and ancient mystical powers. A destiny awaits you. A small boy on the run. A dragon reborn in flames. The last of an extinct race with mighty powers. I'm not sure the legendary RPG series Breath of Fire returns. I bought this game on PS1 in eighth grade. But it's back now. It is back. You can relive those memories, Carl. It's a great game. Okay. Dying Light the following Enhanced Edition comes to PS4 digital and at retail. Dying",
            "start": 1669.18
        },
        {
            "text": "PS1 in eighth grade. But it's back now. It is back. You can relive those memories, Carl. It's a great game. Okay. Dying Light the following Enhanced Edition comes to PS4 digital and at retail. Dying Light Enhanced Edition takes parkour fueled zombie survival to a whole new level. Enjoy the definitive Dying Light experience with the brand new Legend system. Improve visuals, major gameplay enhancements and more. Firewatch comes to PS4 digitally. Says Firewatch is a mystery set in the Wyoming wilderness where your only emotional lifeline is the person on the other end of a handheld radio. And again, you can watch our review on YouTube.com slash Kinda Funny Games. It starts spoiler free and then we warn you and go into spoilers. Level 22 comes to PS4, PS3 and Vita. It's digital and it's out on the 11th so this is a Thursday release. Gary is an office worker who oversleeps after a drunken night out on the town. Here's where it gets tricky because this isn't the first time Gary's been late",
            "start": 1707.18
        },
        {
            "text": "the 11th so this is a Thursday release. Gary is an office worker who oversleeps after a drunken night out on the town. Here's where it gets tricky because this isn't the first time Gary's been late for work and he could be fired if he's spotted arriving at his desk after everyone else yet again. So we'll have to prove he's smart and sneaky enough to make his way up all the 22 floors to his office. That's a cool concept for a game. I like the concept for that. It'd be cool if you told me anything else about it. Show me a screenshot. It's just a logo. I could do with some more, you know? Lovers and a Dangerous Spacetime comes to PS4 digital. A Nick Scarpino approved game. Yep. If you might remember on YouTube.com slash Kinda Funny Games earlier this year we did a Let's Play when this came to Xbox One. It says explore a neon galaxy in your very own battleship in a thrilling one or two player couch co-op adventure. Take control of turrets, lasers, shields and thrusters using teamwork to",
            "start": 1747.18
        },
        {
            "text": "to Xbox One. It says explore a neon galaxy in your very own battleship in a thrilling one or two player couch co-op adventure. Take control of turrets, lasers, shields and thrusters using teamwork to triumph over the evil forces of anti-love. Fuck anti-love. Mop Operation Cleanup comes to PS4 digitally. It says you are MOP in all capitals. A curious and unique model of robot. You have been engineered using simple parts with one single objective to clean up a polluted environment. Explore five challenging worlds with 50 difficult missions full of pixel perfect platforming fun. No. Not gonna play that. I don't think so. Naruto Shippuden Ultimate Ninja Storm 4 comes to PS4 digital and retail. The latest Opus in the acclaimed Storm series is taking you on a colorful and breathtaking ride. Take advantage of the totally revamped battle system and prepare to dive into the most epic fights you've ever seen in the Naruto Shippuden universe. And I think I'm saying it right. I think you're",
            "start": 1778.18
        },
        {
            "text": "Take advantage of the totally revamped battle system and prepare to dive into the most epic fights you've ever seen in the Naruto Shippuden universe. And I think I'm saying it right. I think you're nailing it dude. A broad set of ninja skills will be yours to use against the fiercest foes you'll ever encounter. Alright. Rugby Challenge 3 comes to PS4 digital. It's out the 10th so this is a Wednesday release. Crouch Bind Set. Rugby Challenge 3 features more than 11 competitions. Be a pro mode plus more. Create custom players and teams shared online across all platforms using the all new fan hub. Sporting great licenses such as the All Blacks, Wallabies, Springboks and England. Why is that even on the PlayStation blog America? Cyralym comes to PS4 and PS Vita digitally. It's cross by and this game sounds interesting to me. Okay. Cyralym is a deep monster capture RPG where you can summon and customize hundreds of creatures to fight by your side. Okay. You can summon and customize these",
            "start": 1826.18
        },
        {
            "text": "game sounds interesting to me. Okay. Cyralym is a deep monster capture RPG where you can summon and customize hundreds of creatures to fight by your side. Okay. You can summon and customize these creatures to help you travel through randomly generated dungeons to complete randomized quests. So the game's perspective according to the screenshot appears to be most akin to a first person dungeon crawling like Shadowgate RPG. Very old school graphics. I don't know if it's going to be any good or not but it looks interesting. You like the visual so far. I do. Unravel comes to PS4 digitally. It says Unravel introduces Yarny. A new lovable and endearing character made from a single thread of yarn that slowly unravels as you move. Inspired by the unique and breathtaking environments of northern Scandinavia, Unravel is a visually stunning physics based puzzle platformer. I started playing it. What do you think? I'm not going to go back to it. Yeah? Yeah. I saw the review star posted today and",
            "start": 1869.18
        },
        {
            "text": "Unravel is a visually stunning physics based puzzle platformer. I started playing it. What do you think? I'm not going to go back to it. Yeah? Yeah. I saw the review star posted today and read some of them. I agree with them. They're all on the same page from what I'm saying. The past story glance I took at Twitter, right? Beautiful. I like Yarny a lot. I like the story that's happening. I'm interested to know what's going on exactly. But the platforming is average at best. You know what I mean? It's kind of annoying at times. It's all right, whatever. You know what I mean? Like it's not fun. The gameplay of it isn't fun, beautiful, but it just doesn't come together mechanically for me to be like, Oh yeah, I want to play more of this. I played like two levels. I'm good. Yeah, I'm not super super interested in it either. To be honest, I never really have it. I hear you. I was more interested in the kind young gentleman that introduced the game. See, and that's the problem. That's the",
            "start": 1907.18
        },
        {
            "text": "super interested in it either. To be honest, I never really have it. I hear you. I was more interested in the kind young gentleman that introduced the game. See, and that's the problem. That's the whole thing with Yarny that's got going. It's got a cute protagonist that we all adore. And then yeah, when the developer came out, like here's the thing. Yarny's a developer who I don't know off the top of my head and I don't know if it's in that thing for you to look at. It's not. Yeah, they've done a great job, EA has especially, of marketing what this is, right? He came out, he was super nervous. Coldwood Interactive. Had the little Yarny, gave the E3 presentation, shaky voice over. He was like, Aww, the game's cute and this guy's cool. We want to support his game, right? When you start Unraveled, the first screen I think you get to is just a letter from the developers. Like, thank you so much for playing this. It's been two years of our lives. We're excited to finally share it with you.",
            "start": 1951.18
        },
        {
            "text": "the first screen I think you get to is just a letter from the developers. Like, thank you so much for playing this. It's been two years of our lives. We're excited to finally share it with you. And you're like, oh, awesome as well. I can't wait. And then I'm like, I don't know. So where did it net out on Metacritic? I haven't looked. I think I read the IGN review today and maybe a little bit of Game Spots before I got swept away. It's an 81 on Metacritic. It's pretty good. Yeah. Let's see. It's not bad. Destructoid gave it 100. PlayStation Universe a 90. Games Radar, 90. EGM in 85. IGN in 83. Let's see. Sixaxis, 80. Game Informer, 78. Game Trailer, 75. Game Spots, 70. So yeah, decent to good to great. Yeah, again, it's not a bad game. But it's a puzzle platform. Yeah, the platforming in general just wasn't like, oh, this feels so good. You know what I mean? Final game is We Are Doomed comes to Vita digitally. Crossed by with PS4. It's already on PS4. And people might remember this. It",
            "start": 1990.18
        },
        {
            "text": "just wasn't like, oh, this feels so good. You know what I mean? Final game is We Are Doomed comes to Vita digitally. Crossed by with PS4. It's already on PS4. And people might remember this. It says, We Are Doomed is a twin-stick shooter where you zap polygon baddies with an absurdly overpowered laser beam. Dive headfirst into the action with reckless ambition. Charge the super beam and zap everything out of existence in an instant. And that is all for the games that come out this week. Then it's time for topic of the show. Touchstones. Touchstones. Touchstones. Touchstones. Touchstones. Today's topic of the show was submitted over at kind of funny dot com slash p s q by Matt Roy Sim. Okay, that's we're going to say at console gamer. Twenty four seven. That's his twitter handle. That's probably a better name than what you have here, even though that's your PSN name as well, but I'm going to call you console. Gamer. Twenty four seven says, can Sony keep getting away with the PSN in its",
            "start": 2044.18
        },
        {
            "text": "a better name than what you have here, even though that's your PSN name as well, but I'm going to call you console. Gamer. Twenty four seven says, can Sony keep getting away with the PSN in its current state with its poor liability and the fact you cannot change your PSN name? I really think they need to invest in this structure. Thanks Matt from the UK. Now this is something interesting since PS3. We've all been complaining about the PSN. You know what I mean? Since the debut of the PSN, we've complained about the PSN and here we are PlayStation for selling like hotcakes. More people than ever using it, but still it's down. All of a sudden there's this maintenance here. Got a manually sink your trophies unless you have it, you know, on your the timer thing to pop your stuff. Do you? What do you? Can they keep getting away with it? I think they are going to get away with it, but it's but there is something to be said that now that you know online play on PS4 is PlayStation plus",
            "start": 2092.98
        },
        {
            "text": "What do you? Can they keep getting away with it? I think they are going to get away with it, but it's but there is something to be said that now that you know online play on PS4 is PlayStation plus enabled. So on PS3 and Vita you can play online for free. And that was the cool thing about PS plus was that it was an additive kind of program. But since on PS4 it's basically Xbox Live Gold and you need it if you want to play games online unless you are strictly single player, which is fine. I am, but I have PS plus. Then there is something to be said that if you're paying fifty or sixty dollars for this year then should you not expect a little bit better. And I do think that the PSN is is is extremely unreliable. It's not to say that it's not even down ninety nine point nine percent of the time, but. We expect it to go down and it's never a surprise when it goes down. And someone made a good plan where I read it. I just thought it was a good point that resonated with me where they were",
            "start": 2131.92
        },
        {
            "text": "time, but. We expect it to go down and it's never a surprise when it goes down. And someone made a good plan where I read it. I just thought it was a good point that resonated with me where they were saying like especially about like the scheduled maintenance that just appears I know where it's like if it's scheduled and like why are you telling us like sometimes like twelve hours in. Yeah. And why why does it why why does this happen? Like why why does the network have to have maintenance all the time? Like I'm sure the Xbox Live is maintained in some way, but it doesn't go down. So I do think that there's a difference between the two the two that ironically does not seem to matter very much. Right and that's the big thing I think. I think you know his question is can they keep getting away with it? I think of course they can keep getting away with it because I think it shows right now the fact that it's not perfect. It's not even that great. And the fact is most people don't really",
            "start": 2168.2
        },
        {
            "text": "with it? I think of course they can keep getting away with it because I think it shows right now the fact that it's not perfect. It's not even that great. And the fact is most people don't really care. You know what I mean? Yeah, they don't complain about it. They don't do this. The one thing I'm starting to see more and more complaints with which I agree with is the interesting thing of like how bad is the wife the internet capabilities of the PS4 that downloads takes along. You know what I mean? There's people who are showing like I mean we have amazing internet here right and still it takes forever to extremely good simple stuff and it's like it's not the internet coming to the house. It's the PlayStation 4's ability to process. Sure. And so then I understand that it comes down to what is in the console that's now you know X years old at least especially when they pick the mechanic or you know what I'm saying the chip technology to put in there and stuff like that. But that and",
            "start": 2207.0
        },
        {
            "text": "is in the console that's now you know X years old at least especially when they pick the mechanic or you know what I'm saying the chip technology to put in there and stuff like that. But that and then you got to worry about how much that would have cost to go up and down. I'm sure it's just middle of the road right. It's the best it can be for it to keep the price at where they want to launch. But I would love a PlayStation 4 that talked to the internet quicker. You know I mean like as fast as I can download a steam game I'd love to be able to download a PlayStation 4 game. Yeah the thing is that there are technical ramifications for this new console I think interacting with the PSN in the fashion that it exists now across PS3 and Vita and PSP where I don't it's like everything we talk about surely more complicated than we think. But I also think that there's a lot of excuses being made so we talk about PSN IDs so much it's like there's just a lot of excuses I understand that's",
            "start": 2243.0
        },
        {
            "text": "about surely more complicated than we think. But I also think that there's a lot of excuses being made so we talk about PSN IDs so much it's like there's just a lot of excuses I understand that's complicated but fucking fix it. Yeah. You know like you're a mega corporation just fix the fucking problem. It's not it's not like you're just like 10 guys like running a company in your basement. You have no excuses to not be able to to fix some of these issues so the PSN ID thing or is a minor thing or trophy sinking I don't really care about that but like these are minor issues that should be fixed because your competition is lapping you. But Sony looks at it and says like well it's functional and we aren't really seeing any commercial ramifications. So if we have X amount of capital to invest in things like we're not going to invest in something that's not really even hurting us from a bottom like from the bottom line but they are flush and they're not flush with money. I mean they were",
            "start": 2279.58
        },
        {
            "text": "in things like we're not going to invest in something that's not really even hurting us from a bottom like from the bottom line but they are flush and they're not flush with money. I mean they were losing fucking hemorrhaging billions of dollars but they are making a healthy profit now and maybe it's time to reinvest some of that back into the PSN's infrastructure because PSN will be important beyond PlayStation 4 into PlayStation 5 and into like whatever sort of ubiquity the PSN ends up having which is you know something we talked about on the games cast with NX and is this thing you know there was rumors that NX might run on PlayStation 4 for instance and what does that mean and stuff like that. If PSN is going to be this thing that exists in 10 or 20 years and I'm sure it will be apart from the hardware then these kinds of capital investments in infrastructure matter. And that's why it's interesting to see them go off on these things to make communities right to make these other",
            "start": 2322.58
        },
        {
            "text": "from the hardware then these kinds of capital investments in infrastructure matter. And that's why it's interesting to see them go off on these things to make communities right to make these other things that don't have any real purpose. You know what I mean? Like communities exist and I know that we have two kind of funny communities. The audience is in there, the community, the best friends are in there chatting with each other but they're not interacting in a meaningful way with what happens on the PSN. You know what I mean? I would have rather see them not do communities and put that capital towards name changes or figure out a way to make things run a bit smoother or do this. You know what I mean? There's enough things that people complain about with the PSN that I don't think anybody's you know hankering for communities. That's what they wanted people to get to. Not to mention that I just feel that that's a lost thing. So I mean to the question from Matt right of like how long",
            "start": 2358.7
        },
        {
            "text": "you know hankering for communities. That's what they wanted people to get to. Not to mention that I just feel that that's a lost thing. So I mean to the question from Matt right of like how long can they keep getting away with this? I think for a long time but I agree with Matt's own point here is that they need to invest in the structure because yeah it's the same thing we talk about with brick and mortar versus download right? Like we're tip of the sword in that we're you know we have great internet in San Francisco. We are totally on board with just downloading everything in the rest of the country isn't that yet but as Google fiber and better Wi-Fi and all that gets out to everyone and it becomes a thing where everyone's there. PlayStation is still holding on to what it is now because it's also what we always talk about a little bit with like you know Stockholm syndrome right like PS3 was so bad that when we got PlayStation 4 we're like ah nearly everything's fixed the way it",
            "start": 2398.06
        },
        {
            "text": "it's also what we always talk about a little bit with like you know Stockholm syndrome right like PS3 was so bad that when we got PlayStation 4 we're like ah nearly everything's fixed the way it should be running the way it should be running. I think that's the important context is you can tell that not always but I think you can generally tell who owned a PS3 and who didn't by the way they talk about the PS4 because it's like you have no way you don't even know you like you can't even know how bad it was and we didn't know how bad it was until we went to PS4. I remember you know I had first played a retail PS4 in October before it came out when we started getting them and I was like this is insane. Yeah I was like I can't believe how good this works like how fast it is. So my friends requests crashed so my complaints are minimal to be honest with you but it's also my complaints are minimal just because I don't care if the network's up like unless I'm in one of those situations where",
            "start": 2432.1
        },
        {
            "text": "crashed so my complaints are minimal to be honest with you but it's also my complaints are minimal just because I don't care if the network's up like unless I'm in one of those situations where I need to download a game I really could give a fuck less if the network is up right. I don't look at what other people are playing I don't really message people I don't play online games but I mean like it's I'm with you on that but there's enough stuff I remember when the PSN was down for something or whatever our friend Sean Pitts you know one of the best friends logged on to play a game and found it locked right and he went on Twitter about like I can't even play my games and everybody's like well is this your primary PS4 and he's like yes and then we're like did you actually set it as your primary PS4 though right and had explained that like there's a few little hitches in there right that it would be like all right why not make that a little bit simpler for people to understand and get in",
            "start": 2473.42
        },
        {
            "text": "PS4 though right and had explained that like there's a few little hitches in there right that it would be like all right why not make that a little bit simpler for people to understand and get in there and do it those are use case scenarios I assume. Colin. Yes. Topic of the show was sponsored did you know that? I didn't. It was sponsored by Loot Crate. Loot Crate is a monthly subscription box service for epic geek and gamer items and pop culture for less than twenty dollars a month you get four to eight items that include licensed gear, apparel, collectibles, unique one of a kind items and more. Make sure you head to lootcrate.com slash PS and enter the code PS to save three dollars on a new subscription. Loot Crate is more than just a subscription service it's an entire community of fans that share their experience and interact with each other around the unboxing of each month's crate and Loot Crate guarantees you at least forty dollars in value if not more for every crate.",
            "start": 2505.42
        },
        {
            "text": "of fans that share their experience and interact with each other around the unboxing of each month's crate and Loot Crate guarantees you at least forty dollars in value if not more for every crate. Sometimes it's a lot more. When the cut off happens, Jack, that's it it's over so go to lootcrate.com and enter the code no lootcrate.com slash PS and enter the code PS to save three dollars on your new subscription today. Colin. Yes. It's time for the return to trophy time. That's great. I'm excited about that. What do you got for me? A segment you debuted last the first new segment for PS. I love you XO in a long time. Four games stick out to me this week now brief people. What is this segment? It's just we're just going to look at trophies that have popped recently and we can talk about trophies we've earned as well but show we said it popped on XO phase and PSN profiles for upcoming games. So just give you a look at you know some of the let me look here so there we go some of the games",
            "start": 2547.98
        },
        {
            "text": "we've earned as well but show we said it popped on XO phase and PSN profiles for upcoming games. So just give you a look at you know some of the let me look here so there we go some of the games that we might have to be dealing with soon or that you could deal with soon. I want to say might have to because that makes it sound like you're forced to have to play every game get every trophy. So Assassin's Creed, Assassin's Creed Chronicles trilogy packs trophies as a platinum. How do they look? Yeah they look easy to me. Just complete the games and stuff like that. Headshots, completing memory sequences and stuff like that. So it seems it seems reasonable enough unravels. Troveys are up. This also has a platinum. You have to find every secret. Mend a broken bond. That's probably beating the game. Finish each level from start to finish without dying. I think some of the platforming being a bit wonky might make that more difficult than you'd intend it to be. Yeah so there seems to be some",
            "start": 2619.98
        },
        {
            "text": "game. Finish each level from start to finish without dying. I think some of the platforming being a bit wonky might make that more difficult than you'd intend it to be. Yeah so there seems to be some difficult ones. There's like one off ones here at the bottom. Make it through the mire in one go without swatting any mosquitoes or make it to the waterwheel without using a log raft and such and so on. So these one off stage specific ones that are probably hidden. So there's that. The game I'm looking forward to Ninja Senki DX which is based basically it's basically supposed to be designed after a Game Boy Color platformer. Looks really fucking cool. Doesn't have a platinum which is disappointing but there are different endings. Get the worst ending. The second best ending. Get the best ending. Get the best ending in hardcore mode. So this is gonna be tough and it seems like the trophies are gonna be difficult considering there's no platinum. So I don't know if you want to make the",
            "start": 2658.46
        },
        {
            "text": "ending. Get the best ending in hardcore mode. So this is gonna be tough and it seems like the trophies are gonna be difficult considering there's no platinum. So I don't know if you want to make the investment. What are you building towards? And finally we talked about this on Colin and Greg but I don't think we talked about this here is Valkyrie Chronicles. PS4 trophies are live. The trophies are very Bandai Namco like which is weird because it's not a Bandai Namco game. In terms of the we make fun of the Tales trophies for being like these ridiculously long descriptions that are like paragraphs. This isn't quite that way but they're obtuse in that way. So like excellence in leadership is a gold trophy. It says obtain the decoration given to an officer who has demonstrated remarkable skill as a leader through the mastery of the art of command. Of course. The fuck does that mean? Obtain this one's order of the holy shield. Obtain the decoration based on the Valkyrian shield presented",
            "start": 2699.26
        },
        {
            "text": "as a leader through the mastery of the art of command. Of course. The fuck does that mean? Obtain this one's order of the holy shield. Obtain the decoration based on the Valkyrian shield presented to a squad shown to have earned victory without a single casualty. So that's a little more straightforward. You get that one. Yeah so these are all the trophies are like that. There's no like straightforward trophy. Do this to get this. Yeah obtain the decoration given to a person who helped save Gallia in times of need. Awarded only four times thus far. Once to general Gunther that's savior of Gallia. So those are the and they're popping already but this is I assume because of the Japanese release. So and someone has a platinum. Who has one platinum achievement? The name is Haruhi2728 who is in Japan and has let's see earns five point one trophies a day and out of three hundred fifty nine games played has only missed two hundred ninety three trophies. Thanks son. Three hundred thirty four",
            "start": 2736.22
        },
        {
            "text": "Japan and has let's see earns five point one trophies a day and out of three hundred fifty nine games played has only missed two hundred ninety three trophies. Thanks son. Three hundred thirty four completed games ninety seven point nine percent. What's his overall trophy level? Completion fifty two. Jesus Christ. Three hundred seven platinum trophies. Good for him. Ranked four hundred thirty ninth in the world and forty second in Japan. That's it for trophies. What have you earned lately? You want to talk about that at all? I went back and did the Gone Home trophies I was missing because I didn't realize the intro counted and I was like being a little lackadaisical about skipping it. Yeah. So you have to do the the you know. This is for the speedrunner one. Beginning go to the Christmas duck get the key run inside go to the attic at the key run upstairs unlock the attic go upstairs and get to the book in like a minute or a minute and a half. I thought it was less than. And so I did",
            "start": 2770.94
        },
        {
            "text": "duck get the key run inside go to the attic at the key run upstairs unlock the attic go upstairs and get to the book in like a minute or a minute and a half. I thought it was less than. And so I did that and then beat the game in ten minutes with all the intel which is easy because you can pause it when you're doing it so you can just use a video and that's what I did. Nice. Yeah. That's I think pretty much all I earned. Volume should be fixed according to a Mike Bithill tweet because I was having some people were having serious trophy problems on Vita where trophies were not popping which is the only Vita game I've ever had that problem with but then they were popping but then they weren't popping again so I'm gonna go back and probably get through that because I really like that game. Yeah. Love volume. But I stopped playing because the trophies weren't working. I was a little disappointed. I was I was disappointed. I'll also remind you since we're talking about volume and it",
            "start": 2823.62
        },
        {
            "text": "Yeah. Love volume. But I stopped playing because the trophies weren't working. I was a little disappointed. I was I was disappointed. I'll also remind you since we're talking about volume and it reminds me of a game that came late although not that late to Vita is that I was thinking about this recently. Let me see if I can just find the exact information. Let's see. Yeah. It's been almost a year since Axiom Verge came out. Wow. Really? Yeah. Axiom Verge launched March 31st on PlayStation 4. Dang. And it's still no word on the Vita. Just totally you know things happen. Personal things happen. I accept all of that. It's very sad but that's not acceptable. I just want to throw that out there. Like the game. Don't promise games for platforms and don't deliver them. That's like my only thing. What if we were keeping what if Tom Happ is keeping us more abreast of the situation? That's fine. I mean they do release things like information every once in a while but I'm just saying like we",
            "start": 2862.98
        },
        {
            "text": "What if we were keeping what if Tom Happ is keeping us more abreast of the situation? That's fine. I mean they do release things like information every once in a while but I'm just saying like we have a right as the consumer to you know if a game is promised for you to you on a system and you should expect that you're going to get it. Yeah. And I just wonder are we going to pass the year mark you know without getting the game on Vita like I bet we I just I will get it before. I just don't not knowing anything about programming. Sure. Which I don't. I just don't understand how hard it can be to get that game to run on Vita. It's not it's Super Metroid. It's not like you know technologically advanced. It's a beautiful game. It's a fun game. I just say that because I keep looking at it on my PS4 and I'm like I want to play this but I just don't want to play this here. You know this is not where I want to play this game. It's not even where this game is really meant to be played in my",
            "start": 2909.86
        },
        {
            "text": "my PS4 and I'm like I want to play this but I just don't want to play this here. You know this is not where I want to play this game. It's not even where this game is really meant to be played in my mind. It's meant to be played on Vita. So it's just disappointing. I was thinking about that when I saw the volume trophy so I'm not trying to like you know attack anyone. Sure. That's not me. You know Tom Happ's a friend of ours. Yeah. And he has other things to do and he did a great job with Axiom Verge. Just it's it's a little disappointing. I want to voice that. For my trophy time here I want to point out that I have 33 percent of the monopoly family fun pack trophies. You don't have any. Yeah. I hate that. It's gotten better. It seems like it's one of the early gen PlayStation 4 problems that developers didn't understand they could give us both trophies. But whenever that happens that's ridiculous. Yeah it sucks. We talked about the trophies also I think a week or two ago. But",
            "start": 2948.66
        },
        {
            "text": "that developers didn't understand they could give us both trophies. But whenever that happens that's ridiculous. Yeah it sucks. We talked about the trophies also I think a week or two ago. But firewatches trophies suck. Yeah. It's an end. You're on 100 percent no matter what you get to play through it which is on one hand. OK. Then I just like the walking dead. Yeah. Which is fine. You don't have to think about it. But in playing the game because I think Sean Vanaman said like well it's a story based game we don't want to do these guys you know these trophies or ever. Well I think we're going to talk to him this week. Yeah. When I played the game I'm like this is super disappointing. Like there's so many great opportunities for good trophies here. Yeah. You know I don't want to get into like what those are but there are so many things in that game where I'm like I felt like I've gotten I felt like you could have easily put some stuff in there for to make a second play through matter.",
            "start": 2987.22
        },
        {
            "text": "what those are but there are so many things in that game where I'm like I felt like I've gotten I felt like you could have easily put some stuff in there for to make a second play through matter. You know what I mean. Like right now the point of playing a second play through would be to find things you missed or advance the story or make different choices and see this kind of thing right. But none of them are that drastic. I don't think to warrant me wanting to go back and do another one. I've talked to people I've read other reviews I've seen other videos I'm like OK that's fine. Whereas it could have been go you know a trophy here of go find this or go do that or you know what I mean. And then why not. Sure I'll go back and do it again maybe see what's up. But otherwise no. Yeah. The more we talk about firewatch because we put up our review of course today the more I do think of some maybe I'd want to replay it. I don't know it's like but I like just talking about it. Yeah. Well",
            "start": 3022.78
        },
        {
            "text": "more we talk about firewatch because we put up our review of course today the more I do think of some maybe I'd want to replay it. I don't know it's like but I like just talking about it. Yeah. Well it's four hours. You know what I mean. It's like what does it even matter. Just to get a different perspective on it make difference. Yeah. I don't know I didn't watch a review I probably won't but I didn't want to come off too negative because it is one of those games where it's cheap enough and short enough like I said in the beginning of the show twenty dollars you're really gonna miss twenty dollars and like four hours your time to see if you like it. Yeah. I know that's like my job as a critic is to be a little more you know opinionated. Yeah. And I am. But my opinion is like the game is interesting and it seems like people really like it. I just don't I just don't get the story. You know like I just it's so frustrating people. I go into that more in the video the video. So I don't",
            "start": 3053.88
        },
        {
            "text": "interesting and it seems like people really like it. I just don't I just don't get the story. You know like I just it's so frustrating people. I go into that more in the video the video. So I don't want to get to I don't want to get too spoilery here but I just like for what you guys loved about it I'm like it was meaningless all this didn't matter and that's a game doesn't have to matter. Mario doesn't matter it's just fun to play. But this is like the fire watch is a good example of like this is a lost opportunity and it's sad you know it's fine but it could have been so much more than I. Yeah that I agree with. Yeah. Read or mail. Mailstrom. Mail call. Mail top cocktail. Oh that's going to. Mail pattern bawlness. First official reader mail question which you can submit over kind of funny dot com slash p s q just like tricky tricky did it goes. I'm curious to get your take on Sony's efforts to allow as many players as possible to try p s v r. I recently attended pack south and with",
            "start": 3089.88
        },
        {
            "text": "dot com slash p s q just like tricky tricky did it goes. I'm curious to get your take on Sony's efforts to allow as many players as possible to try p s v r. I recently attended pack south and with this being my first games conference and all I wasn't sure if I should expect PlayStation they're showing off the new hardware or not with the expectation. Well I'm sorry with the exception of a few developers who had demos on oculus or other similar hardware there wasn't any sign of PlayStation v r around now I know conferences are expensive expensive and that packs south is a comparatively small show but I couldn't help but think Sony was missing out on opportunities here to get as many people as possible trying it out firsthand considering the difficulty in marketing v r I thought this may be may have been a great chance to further spread the gospel do you guys think Sony should be making the extra effort or is the cost of these smaller shows not worth the investment would love to hear",
            "start": 3140.6
        },
        {
            "text": "be may have been a great chance to further spread the gospel do you guys think Sony should be making the extra effort or is the cost of these smaller shows not worth the investment would love to hear your thoughts of all you do keep it up Ricky. I mean I think so but they got to draw a line somewhere right they do the booths aren't cheap no they're not cheap they're not but but this is an exception like this is a device that you have to show people that you like every one of those people that packs out could have been an evangelist for for v r and for psvr maybe it would have leaked down been an like someone PC gamer plays psvr but then becomes an oculus blue or whatever it is like a high tide raises all boats with this particular segment of this dude of the of the industry rather so so do you think I don't work inverse then oculus whatever vive was there these people now again it could work like I wasn't saying that oculus had a booth or vive had a booth it was other random",
            "start": 3182.24
        },
        {
            "text": "so so do you think I don't work inverse then oculus whatever vive was there these people now again it could work like I wasn't saying that oculus had a booth or vive had a booth it was other random developers who had it it could it could be that way but I also I mean I could be wrong in my assumption about all of these conference like these big you know packs is like that console gamers sure like I mean I know there are people that play PC games is up but I mean these strike me as console people I don't know if that's true or not there are a lot of PC games on the floor all the time yeah but like this just strikes me as it's same thing with e3 it's like yeah there's a PC presence here but this is a console show you know like and it always will be that's why they did their own little you know PC press conference for instance in e3 right so that that could just be a leap too far for a lot of people but that was always my assumption but nonetheless Sony's got to take up and scoop up all",
            "start": 3225.52
        },
        {
            "text": "PC press conference for instance in e3 right so that that could just be a leap too far for a lot of people but that was always my assumption but nonetheless Sony's got to take up and scoop up all these opportunities because you have to like hit the ground running it's like campaigning yeah like you have to go shake hands and like you know kiss babies and you know get off the stump and show like that and like you just talking about it is not going to sell any of these things you could have maybe they would have only sold a few hundred more but it's the it's the butterfly effect of just getting this thing in the people's hands and making believers out of people are giving them the you know giving someone something to talk about that they tell you their parents about it they they tell a friend or an uncle or whoever like about you know I played this this VR and and it spreads it could spread like wildfire that's the way this is gonna work so I do think I personally do think it's a lost",
            "start": 3264.32
        },
        {
            "text": "or an uncle or whoever like about you know I played this this VR and and it spreads it could spread like wildfire that's the way this is gonna work so I do think I personally do think it's a lost opportunity I mean yeah booth space and and manning the booths and all that stuff is expensive for PAX South and all these shows no doubt it would cost Sony many hundreds of thousands of dollars to be at that show and put people there and do all that kind of stuff no doubt about it but is that really is it worth it maybe yeah I think the problem is I mean of what you're looking at it I agree in a perfect world Sony's at every show they're doing they're there they're shaking hands kissing the babies putting these the units on people's face and making them understand it right but I do think there's a big part that comes down is just that pack south I don't think matters yet you don't I mean this is your do you made that clear in your video for a packs mania sure yeah yeah for packs wrestling",
            "start": 3300.96
        },
        {
            "text": "a big part that comes down is just that pack south I don't think matters yet you don't I mean this is your do you made that clear in your video for a packs mania sure yeah yeah for packs wrestling yeah yeah yeah yeah yeah I mean is I make that I make that up is that no no no it's like real wrestling so there's now pack southern slam but there is a thing called packs mania okay there's packs from book and they all are part of the packs wrestling super tour but the problem is that I think packs out is still trying to find its footing and what does that mean you know what I mean like do people care do people go to it I mean people go to it right but this year in particular it seemed like even fewer people went on the press side on you know what I mean on personality side undeveloped per side right like it wasn't like you saw all the names you'd expect like paxi some packs out or packs prime like I expect VR to be there I don't know if PlayStation have a booth you know I mean like I don't",
            "start": 3337.92
        },
        {
            "text": "right like it wasn't like you saw all the names you'd expect like paxi some packs out or packs prime like I expect VR to be there I don't know if PlayStation have a booth you know I mean like I don't know how PlayStation will handle it because they aren't usually known for hey we have this giant presence on the show floor right but I mean developers will be there showing their games like you figure then that's just because you have to go to those shows to be if you're an indie up-and-comer or whatever like you know what I mean like if packs East doesn't have some kind of PlayStation VR presence I'll be surprised again I don't think that means PlayStation has a full-blown booth on the floor where you come in and put on your face but then again they did have you know rigs all to itself at PSX and I don't understand why you don't take that booth on the road yeah so maybe that gets put there but I don't think it'll be one you can walk up and play everything on trip sit there play",
            "start": 3375.52
        },
        {
            "text": "at PSX and I don't understand why you don't take that booth on the road yeah so maybe that gets put there but I don't think it'll be one you can walk up and play everything on trip sit there play evaluaries sit there play the job simulator game sure it'll be maybe based around rigs based around something and then you have a goofy little competitions or whatever but back south is very fascinating I'd love to know and I'm sure if I wanted to dig around more try to find out like what's the agreement their business wise have they said that they'll be in San Antonio for X amount of years this one convention center what I'd love to talk to penny arcade people to know what are the metrics of success for that like you know I mean do do they feel that is growing at an acceptable rate because I remember when they did packs South year one or whatever it was like they broke with a record for the highest attended first day of a new packs but that's like doesn't count really right because now that",
            "start": 3411.96
        },
        {
            "text": "when they did packs South year one or whatever it was like they broke with a record for the highest attended first day of a new packs but that's like doesn't count really right because now that packs is established everybody wants to go to a packs. I don't know I'm fascinated to see if that show sticks around because I thought I thought this year would mean even more than last year in terms of like acceptance and the fact that the people who gave a shit last year for not going in terms of personality friends and stuff didn't even go this year. I was like that's pretty indicative of what you have done there sure so we'll see Colin yes glorious G one two three wrote into kind of funny.com slash PSQ just like you can and says hey Greg call me when weigh in on this if he chooses what game really defines you as a gamer what I mean by that is what specific gamer genre really speaks to you as a gamer and defines who you are and how you play thanks and I love you guys PS I love you guys and",
            "start": 3447.44
        },
        {
            "text": "defines you as a gamer what I mean by that is what specific gamer genre really speaks to you as a gamer and defines who you are and how you play thanks and I love you guys PS I love you guys and then he puts in parentheses which I don't agree with one at all in parentheses especially Kevin Koala involve him more often because he is really hilarious a podcast with him as the host would be amazing in parentheses. No, no one hundred percent. No, Kevin calls got a lot of attitude problems. We can really show we keep out of the show for a reason, so I want you to weigh in, but I know I already know you're gonna say you can't be put in a box so doesn't work, but in terms of what game defines you as a gamer. I think for me it's Melger solid PlayStation one and I always talk about the fact that that was like you know such a turning point for me, but it's like when I get excited for third person action games right that are like a movie and I'm playing it's got a really cool story and I'm doing",
            "start": 3492.76
        },
        {
            "text": "was like you know such a turning point for me, but it's like when I get excited for third person action games right that are like a movie and I'm playing it's got a really cool story and I'm doing all these different things and I don't know what the twist is going to be like if I had to boil it down to what I would people always ask us you know what's your favorite game I always say you know third person action right because that's what I want out of me when I say that that's the kind of game I mean so what defines me as a gamer I assume is that because that's the game that gets me the most excited to sit down and play Lara Croft Uncharted an Assassin's Creed right let's get in get into this world find out who this character is and go forward yeah I think I don't know what game would define me but I do think the genre that most defines my sense of my sensibilities is the side-scroller and the the which I still think is maybe the most perfect of all genres and the way games really",
            "start": 3532.54
        },
        {
            "text": "define me but I do think the genre that most defines my sense of my sensibilities is the side-scroller and the the which I still think is maybe the most perfect of all genres and the way games really really should be played it's fundamental core video games like this is this was it's never gotten any better than that and I think it's just a genre I understand really well and I understand how it works and I understand what feels right what doesn't and it's not to say every game should feel the same Mario doesn't feel like Mega Man doesn't feel like Ninja guy doesn't feel like CastleMania doesn't feel like Contra but doesn't feel like codename viper I mean doesn't feel like Strider doesn't like these but I can pick up a game and in two seconds tell you if it's right or not just based on the game itself how does it feel what are the enemies doing what are the the obstacles it's it's shockingly hard for developers to make like competent competent you know side-scrollers I'm considering it",
            "start": 3571.14
        },
        {
            "text": "game itself how does it feel what are the enemies doing what are the the obstacles it's it's shockingly hard for developers to make like competent competent you know side-scrollers I'm considering it so straightforward not that I would be able to do any better but it's just to show that there's a lot more nuance in the genre than I think people give it credit for it's kind of feel right right yeah that's how we got a feeling like these are games that I like can dominate because I know how to play them and and grew up playing them and I think this is a genre that is a little old hat to newer gamers and younger gamers that don't really understand their genre similar to that I don't play adventure game or something so I don't really understand them so there's nothing wrong with that and it's not the only genre I like to play I love first-person shooters and and third-person shooters and third-person action sure strategy yeah but like yeah that's the one that speaks to me like if someone",
            "start": 3609.9
        },
        {
            "text": "not the only genre I like to play I love first-person shooters and and third-person shooters and third-person action sure strategy yeah but like yeah that's the one that speaks to me like if someone was like you could only play one genre for the rest of your life or like one perspective like a little side-scrollers you know it's gotta be definitely Colin yes I think you're gonna enjoy this question it's from lazy face lazy face wrote in the kind of funny comm slash psc just like you can it says hey guys loving the show nice okay enjoy the weekly juicy PlayStation morsels which we all eat in order together I am a writer over at unseen 64 and just wanted to say thanks for the quick shot out this week in regards to the Saints row undercover game we love what you we love what we do and we want to bring as much information on canceled games as we can to the wider please do yeah you guys do great work unseen 64 is awesome great checking that out everybody should do that we are even",
            "start": 3650.9
        },
        {
            "text": "we want to bring as much information on canceled games as we can to the wider please do yeah you guys do great work unseen 64 is awesome great checking that out everybody should do that we are even finishing up a book that will be out late this year hopefully with loads of information not found on our site filing my question I know it isn't PlayStation centric but it is the only podcast of yours I listen to then in parentheses I know I am sorry do you guys think that there is enough done in the gaming world to preserve games from the past and present or do you think that too many games are just thrown out into the pile and forgotten how important do you think it is that not just the developers and publishers but we as the larger gaming community preserve this data so that we can look back in years to come and look at the past mistakes PS I love the show and you and gaming lazy face do you think enough is being done no definitely not how do we fix that I don't know it's good like",
            "start": 3696.42
        },
        {
            "text": "back in years to come and look at the past mistakes PS I love the show and you and gaming lazy face do you think enough is being done no definitely not how do we fix that I don't know it's good like people are trying yeah you know the Library Congress has gotten and kind of involved a little bit and and there's the one over in Oakland do you remember this name it just reopen the video game museum or whatever yeah like that out like a lot of the the problem is that it's unorganized and loose like the way game you know ROMs and all this kind of stuff and this is like why I have no problem with old ROMs just existing of games because this is really the only way a lot of these games might exist in the future especially as hardware starts to fail you're not gonna see this problem with Atari 2600 or Coleco or NES or SNES but once you start getting in the really like significant moving parts inside like a ps1 or ps2 these games might become unplayable unless they're available digitally and",
            "start": 3740.1
        },
        {
            "text": "or Coleco or NES or SNES but once you start getting in the really like significant moving parts inside like a ps1 or ps2 these games might become unplayable unless they're available digitally and they're you know there's gonna have publishing gatekeepers and stakeholder gatekeepers that are gonna keep you away from these games and there's people out there doing really great work trying to preserve as much of this as possible but I do not think that enough is being done and there are straight-up games that have been lost history sure so going all the way back to the 50s and 60s with mainframe computer games like space war and stuff like that where like there are iterations of these dice rolling games that are gone and that's it's not like we want to play these games anymore they're terrible they would they would you know there was no screen like you would interact with like buttons and then it would give you like ticker tape like answers and stuff like that you know it was it was a lot",
            "start": 3778.62
        },
        {
            "text": "they would they would you know there was no screen like you would interact with like buttons and then it would give you like ticker tape like answers and stuff like that you know it was it was a lot of these games are very rudimentary back in the day you know the first digital display game was or just the first display game was tennis for two created on Long Island the island in 1959 but really games didn't start to have a screen as something that you would expect until you got around to pong and then you know and then Coleco Atari Fairchild and all that kind of stuff so so it's there are these even older games that we don't even think about that are really important to the mentality of how we developed games and where games came from I always talk about how Japanese role-playing games were heavily inspired by Western role-playing games which were heavily inspired by D&D and a lot of that kind of stuff was inspired in a way by these early mainframe computers that were all about",
            "start": 3814.42
        },
        {
            "text": "were heavily inspired by Western role-playing games which were heavily inspired by D&D and a lot of that kind of stuff was inspired in a way by these early mainframe computers that were all about statistics so it's sad that people don't people video games especially are so look forward look forward look forward you yourself say old game is old and that sucks because I know you don't mean it in that way I don't mean my context of course is that I don't want to play an old game that I've already played right exactly but like we have to have a mentality that games good bad or indifferent need to be preserved because they are they are freeze frames of time of game development of game design theory of what people worked on before and what people will work on after there are fucking awful games that I sold my Anna and the s collection like deadly towers or Athena because those games suck I mean those games are terrible fucking games for their time and they're even worse now but they have",
            "start": 3855.02
        },
        {
            "text": "that I sold my Anna and the s collection like deadly towers or Athena because those games suck I mean those games are terrible fucking games for their time and they're even worse now but they have the right to exist and to be preserved so that someone can go back and play them again I think what we need to do is have a Library of Congress like ISBN or whatever system I think that's what's called IBSN or whatever like where like everything should be given a number and like we every copy of every game should go somewhere where it should be held you know for safekeeping from away from the prying eyes of publishers and away from the prying eyes of the ebbs and flows of digital downloads and steam and all these kind of things where games can just disappear forever I mean look what happened PT it's a great example like PT I'm sure is is exists somewhere with I don't think it's just been a fucking they eradicated it from everywhere but wasn't it sad to see that that game just disappeared",
            "start": 3903.14
        },
        {
            "text": "PT it's a great example like PT I'm sure is is exists somewhere with I don't think it's just been a fucking they eradicated it from everywhere but wasn't it sad to see that that game just disappeared like what are people supposed to do and and in 20 years when we refer to PT we're gonna have any option other than some crazy person keeping on their ps4 all those years or YouTube videos to have played it or seen it so that's why I like unseen 64 so much is because it's a great website because these guys really understand gaming history and one of the most fascinating things about gaming history are the games that never come out yeah and there are games that are so far along we've played some of them that have never we've played games that have never seen the light of day ever that were well on their way sometimes you see early prototypes forever but that's not it's not uncommon in the in the industry to have games that are canceled so these guys are doing God's work that's what I'm",
            "start": 3938.78
        },
        {
            "text": "well on their way sometimes you see early prototypes forever but that's not it's not uncommon in the in the industry to have games that are canceled so these guys are doing God's work that's what I'm piece where's there where's layers a great example so this is why Mega Man universe is another great example yeah it was basically done yeah it was we heard so this is what we we don't want to go a hundred years from now we none of us will be here but we don't want to be in a yard great-grandchildren 100 years being like well they're still gonna play video games in some capacity are they gonna have some sort of touchstone to back to tennis for two or back to the mainframe games or back to pong that's relevant that matters it's quaint but it does matter do you think what I mean what's the role of YouTube and let's plays and all of this right is that good enough I mean because you're gonna have to be you were in this weird thing right where if I wanted to I mean you can read books I guess",
            "start": 3973.58
        },
        {
            "text": "of YouTube and let's plays and all of this right is that good enough I mean because you're gonna have to be you were in this weird thing right where if I wanted to I mean you can read books I guess on the history of movie and film and cinema right and go back and not have to go watch these ones but you don't get the exact thing but in what the the in the very specific way we're talking about things right now right of like this be got that be got that you know what I mean or begets this like if we just were to read a book and you read about what Jack and Daxter meant for Naughty Dog's history or you but in this case you're watching someone tell you about it while they're playing it you know what I mean is that good enough it's not good it's not good enough it's just it is what it is what it is because like we can still I can still go to the library and buy a book from the 14th or 15th century I want to I might be able to read it because the middle English is so weird but like you know",
            "start": 4014.14
        },
        {
            "text": "is because like we can still I can still go to the library and buy a book from the 14th or 15th century I want to I might be able to read it because the middle English is so weird but like you know you can go watch Gone with the Wind or Citizen Kane or something like that if you want to like so it's is it the same to read about Gone with the Wind or is it same to see it you know is it the same to to read Mark Twain Huckleberry Finn or is it should you read Mark Mark you know read about it or read it itself and you have those options those options are readily available is very easy in fact the ironic thing about old books is that is that you know copyrights are up and like these some of these books are free like old but the ironic thing is old books are free if you have like digital yeah means to download them because like no one controls you know the IP anymore and the same thing will eventually happen to film or whatever but with games being so fragmented and I don't know it's just I",
            "start": 4053.7
        },
        {
            "text": "to download them because like no one controls you know the IP anymore and the same thing will eventually happen to film or whatever but with games being so fragmented and I don't know it's just I love gaming history so much it's important for me like I wish you know Tennis for Two doesn't exist anymore because they broke the oscilloscope down to use it for parts they didn't have the foresight of how important this thing was because it really wasn't until the 70s wasn't until two decades later that you even saw another game like that but there were people that in the 50s that understood that and wouldn't it be cool if someone just had the foresight to be like we should probably take your oscilloscope game and maybe put it somewhere instead of breaking it down because that doesn't even exist in the original form and you could remake it but it's not the same it's yeah it's it's it's that's sad that sucks that's the first video game and we don't even have it you know yeah I'm not saying",
            "start": 4090.98
        },
        {
            "text": "in the original form and you could remake it but it's not the same it's yeah it's it's it's that's sad that sucks that's the first video game and we don't even have it you know yeah I'm not saying we have the first book but we know that Gutenberg was you know printing Bibles we do have Gutenberg Bibles and so like that and that's the maybe the the best thing we have these old papyrus you know sheets and these old these old kind of handwritten books and so like that we don't even have the equivalent of that in games that kind of sucks yeah the maid org is what I was thinking of the video game museum over in Oakland they just did a reopening so hit it up if you have time piggybacking off of that in this nostalgia trip and whatnot wet dirt 28 went over to kind of funny comm slash psq and left his question just like you can it says hey guys I was just wondering what video game endings left an impact on you the ones that immediately jump to my mind are the hospital scene and subsequent",
            "start": 4133.42
        },
        {
            "text": "left his question just like you can it says hey guys I was just wondering what video game endings left an impact on you the ones that immediately jump to my mind are the hospital scene and subsequent ending from the last of us the final shot of Batman and Joker and Arkham City and the mind fuckery that is last 15 minutes of Bioshock infinite or it could even be an ending that left a sour taste in your mouth like Halo five recently left me with thanks for everything. Ps I less than three you what jumps to mind for endings for you. I think last of us is a good example, but that's I always my whole thing with this. I never like sticking super close right because obviously last of us gone home shit. I've talked about a million times. I had to Google it because I always forget the name shadow of destiny on PlayStation two year play this game. It got re released. I believe on PS three is a digital download or whatever eventually not remade, but just digital download remake or whatever and",
            "start": 4171.74
        },
        {
            "text": "of destiny on PlayStation two year play this game. It got re released. I believe on PS three is a digital download or whatever eventually not remade, but just digital download remake or whatever and it stuck with me because it's the first time and it's not it can't be the first time first time, but it's the first time I really remember being fucking compelled to do everyone at the game's got like I remember as a kid playing on a kid playing on PS two. I remember being a young team playing on PS two or whatever and remembering I thought that the game had like 17 endings, but it probably had like five or seven or something like that, but I remember I would go back and replay that game to get the endings and not read about them. Just read like what I'm doing wrong or how to make myself get to that ending because for some reason it clicked so much with me and I tried to replay it when it was re released and it's not. It doesn't strike me as a good game. You know what I mean? It's clunky",
            "start": 4208.22
        },
        {
            "text": "to that ending because for some reason it clicked so much with me and I tried to replay it when it was re released and it's not. It doesn't strike me as a good game. You know what I mean? It's clunky and weird. You got to stop yourself from being stabbed in the back at one point by using a frying pan. It's one of those, you know, you're jumping in the timeline kind of thing, but the end there's all these different endings to it are right like that some throw you way into the past or you learn your true history, all this other stuff, but there's one where you go through this entire game, this entire crazy journey to get to this point or whatever and you're done and it's all over and you basically lie down in the cobblestone like outside of this fountain. If I remember correctly, but definitely lie down like the street or whatever and you like put your hand, you look at the stars and you're basically reflecting on how fucking crazy this was and you can't believe you did it. You know",
            "start": 4253.48
        },
        {
            "text": "lie down like the street or whatever and you like put your hand, you look at the stars and you're basically reflecting on how fucking crazy this was and you can't believe you did it. You know you've gotten to the end. You know what's happening and these drunk people in a car come by and run you over and kill you and I remember being like, what the fuck? You know what I mean? Like it was so weird that the endings were so to me at the time, so different and so jarring and so they left you in so many different places, but told you so much more about the characters. You went not the one you got killed by drunk drivers, not too much information revealed there about your personal, but going away in the back and this and what your relationship truly was to this girl and stuff. Like that was one I was like, fuck, I want more games like this. Yeah, I don't know. I mean, the last one does pop out to me. The metal gear games pop out to me, but like, but the, but what I find is that like we",
            "start": 4286.2
        },
        {
            "text": "one I was like, fuck, I want more games like this. Yeah, I don't know. I mean, the last one does pop out to me. The metal gear games pop out to me, but like, but the, but what I find is that like we overemphasize the role of the ending in a game. I think that more, like more, not only more often than not, I think like nine out of 10 times, maybe 19 out of 20 times the ending sucks and like it's not why I beat games. You know, I beat games to beat them and then you got the little cat, the end cap of it, but like I'm not, I'm rarely ever watching an ending and be like, huh, that's pretty awesome. You know, like usually it's like, all right, like that was fine. I feel like it's, you know, we're talking about a little bit with Nick in here about the third act of a suspense film, right? Or suspense anything. And it was particular about the firewatch thing we were talking. I feel that happens with games all the time too. Like for me, like I thought Bioshock Infinite's ending was like trying",
            "start": 4321.72
        },
        {
            "text": "anything. And it was particular about the firewatch thing we were talking. I feel that happens with games all the time too. Like for me, like I thought Bioshock Infinite's ending was like trying to do too much. You know what I mean? I feel like that happens a lot too, where you have this giant story and you don't know what it's about. And then all of a sudden it just tries to cram it all into what's happening at the end. You're like, what the fuck is even going on? Yeah. I think that Spec Ops, for every Spec Ops, the line, which had a great ending or for every Metal Gear Solid or Metal Gear Solid 2, which I think both had great endings. Metal Gear Solid 1 is sorry, real quick aside, is one of those. I remember sitting there and watching those credits roll and the polar bears are going, I was just like, wow, this was awesome. But for every one of those, there are literally 50 games with throw away endings. And so I don't like, it's so funny. We've never, I think they're so",
            "start": 4358.72
        },
        {
            "text": "going, I was just like, wow, this was awesome. But for every one of those, there are literally 50 games with throw away endings. And so I don't like, it's so funny. We've never, I think they're so inconsequential that, that we've never talked about them. I've never even thought about them in terms of like, you think about your favorite game, your favorite moment, your favorite character, whatever your favorite mechanic. But like, I never even really sat down and been like, what is my favorite ending? I back in the day, I used to be games just to say I beat them. You know, like I'm saying way back in the day, I remember my brother had like this, these like stapled together loose leaf papers that were like all the games he beat. That's cool. As he beat them like over years. And it's like, we're not beating them to see these like shitty NES and SNES endings. We're beating them because it's fun to beat them. Yeah. You feel like you completed something. You finished the book kind of thing.",
            "start": 4395.76
        },
        {
            "text": "not beating them to see these like shitty NES and SNES endings. We're beating them because it's fun to beat them. Yeah. You feel like you completed something. You finished the book kind of thing. You're closing, you're done with it. So will there be more attention paid to the endings? Sure. I mean, think about the ending to even gone home or something like that. The journey was like sure way better than the I mean, it's funny. He brings up, you know, the ending of Arkham City is what he's talking about there and I'm like, yeah, yeah, I thought that was an awesome ending right, but asylum like you, this weird boss fight that seems out of character and like all right, whatever you know what I mean like it was, but up and I mean like that doesn't take away from how amazing arkham asylum was right like this is your fucking fantastic game. Next question, Colin comes from famous custard. Here she says, I feel like it's time for naughty dog to try something radically different in their next",
            "start": 4425.52
        },
        {
            "text": "right like this is your fucking fantastic game. Next question, Colin comes from famous custard. Here she says, I feel like it's time for naughty dog to try something radically different in their next game. They've clearly mastered the linear third person action adventure game and while I'd be happy to keep getting these, I'd like to see what naughty dog could do with their talent in another genre. I'm hoping for an open world rpg last of us to starring a grown up ellie. What genre would you like to see them take on next? FPS walking simulator, moba, ps as a listener for five years. You guys are killing it more than ever. Thanks for all you do. Thank you. Famous custard. Maybe girl, maybe guy. I don't know. I don't know if I want to see them go away. No, me neither, but then, but so here here follow me down this rabbit hole thinking neither of us want to see them deviate from that right at what point do they need to keep doing that for you to come at them like a tell taylor t t games",
            "start": 4456.16
        },
        {
            "text": "here follow me down this rabbit hole thinking neither of us want to see them deviate from that right at what point do they need to keep doing that for you to come at them like a tell taylor t t games where okay, you're just doing the exact same thing again, but with a different character. I p yeah, I guess I mean I'm not I'm not this isn't an attack. I'm at no, I know it's not an attack, but because I've released four games in ten years so it's like telltale games releases four games in a month. Yeah. So it's like, so I don't, I don't know that they necessarily need to change and I think that we would be disappointed. We better be very careful what we asked them to do because there's multiple ways to look at it. It's like the pedigree of the studio right now is third person linear action games and linear shooters and they're good at that. And so if you're good at it, like you can do that a million different ways. There are fucking shit ton of third person shooters in the world.",
            "start": 4496.96
        },
        {
            "text": "games and linear shooters and they're good at that. And so if you're good at it, like you can do that a million different ways. There are fucking shit ton of third person shooters in the world. They're very different from each other and they're good for a lot of them are good for different reasons. They're, they're, they're heavy in the narrative, but, but while they used to do back in the day role playing games and stuff like that, and then they really did starting with crash, more platformers and character mascot games, and now they do these third person linear kind of story games. Well, they move on again maybe, but like that's their bread and butter and this is when they became big. You know, crash bandicoot made crash bandicoot big crash bandicoot didn't really make naughty dog like a household and jack and Daxter definitely didn't make no dog big and jack and Daxter was never that big. It was uncharted that made naughty dog big and it was the last one that made, that made people",
            "start": 4541.92
        },
        {
            "text": "household and jack and Daxter definitely didn't make no dog big and jack and Daxter was never that big. It was uncharted that made naughty dog big and it was the last one that made, that made people really respect them. And so you have to be very careful with, with what you do. You don't want to trifle too much with, with like a good formula there. That said, we, I mean, we've talked to many people at different studios where like they need to refresh themselves and look at her eyes and yeah, that's exactly what I was thinking. What was gorilla doing a first person shooter over and over again. Now they're doing a third person, you know, role playing game, but I'm not, I'm not convinced they're not doing a shooter. And so like like I'm, I'm fairly certain Killzone is in development, you know, so it's, it's not like maybe they're all hands on deck now, but I don't think they're going to walk away from a Killzone game again. That's the spirit of the studio. And think about how alienating",
            "start": 4578.8
        },
        {
            "text": "so it's, it's not like maybe they're all hands on deck now, but I don't think they're going to walk away from a Killzone game again. That's the spirit of the studio. And think about how alienating would be to a lot of people at gorilla to be like, well, a lot of these guys want to work on Killzone. I'm sure that they like Killzone. I mean, you don't make games you don't like. I mean, and so like for them, and so for them to be like, well, we, you know, some of these guys have been there for 10 years and we make Killzone and now we're making Horizon and we're just totally a different studio now. Sorry. Yeah. Yeah. Their DNA hasn't changed. You know, like it's fun to experiment and try something different, but you also want to stay true to yourself. Sucker Punch makes third person action games and I dollars to donuts bet you that the next game is gonna be a third person action game. And cause that's how they, what they know how to make. So what do you think the difference is then when",
            "start": 4608.24
        },
        {
            "text": "and I dollars to donuts bet you that the next game is gonna be a third person action game. And cause that's how they, what they know how to make. So what do you think the difference is then when you're talking about gorilla making this change, but not the other guys? I think it was, um, I think Killzone had ran its course and I don't think it's the shooter formula that ran its course. I think it's Killzone and I think it would be weird for them to make another shooter. You know, like, like Uncharted has always been popular and it's going to continue to be popular well after it's done. And the last of us is popular. Like, are you going to get an action or an open world RPG last was to know you're going to get exactly what last of us was with a different setting and a different, you know, maybe some deeper mechanics and stuff like that, but you're not going to get a role playing game out of them. You know, I just don't think that that's a smart use of their time and that's not what the",
            "start": 4646.08
        },
        {
            "text": "some deeper mechanics and stuff like that, but you're not going to get a role playing game out of them. You know, I just don't think that that's a smart use of their time and that's not what the last was is. Yeah. We have to talk about that with final fantasy, like making it, taking it from a really a turn based fundamental JRPG to a Mo just keeping a name maybe in losing sight of what that name means and what, why people connect with that name. Sure. That said, it's a thought provoking question because it's, it does, it does beg the question of the DNA of the studio can change or will change. People come and go and, and you know, the people that made crash bandicoot, there's only a few of them left, you know, and jack and Dax, there's only a few of them left too. So they clearly segued over. And then when the guys make uncharted eventually leave, I mean, yeah, well there'll be a group of people that I would be like, we want to make a first person shooter now. And is that a good use",
            "start": 4684.8
        },
        {
            "text": "over. And then when the guys make uncharted eventually leave, I mean, yeah, well there'll be a group of people that I would be like, we want to make a first person shooter now. And is that a good use of their time? And can they do that? Yeah, sure. But I just don't, if it was up to me, I wouldn't want them to change anything. Yeah, I agree. Final question called it comes from pass calf one. He or she says hi. Well, he signs it Pasquale from Northern Montreal, Pascal from Northern Montreal. I'm assuming it's a he. Hi guys. I often hear you guys say that everyone should buy digital games and you don't understand why people still go to GameStop or any other store to buy physical copies. But as far as I'm concerned, it just doesn't make sense to sense to only buy digital. I always buy my games new in a store online, but with the fact that I can sell my physical copies, I always get a return on my money so that the next game doesn't cost me the full price like it would on the PlayStation",
            "start": 4716.8
        },
        {
            "text": "new in a store online, but with the fact that I can sell my physical copies, I always get a return on my money so that the next game doesn't cost me the full price like it would on the PlayStation store. I know it sounds like I'm stuck in 2003 or something, but until digital games are cheaper than their physical counterparts, I don't understand why people buy digital and pay the same as retail. If I can get 20, 30, or even $40 back on my 70 or $80 in tax with Canada, I will take it any day of the week, which I can't do with my digital game. What are your thoughts on selling and trading games in 2016 and on the fact that we are still paying the same price digital as physical? Keep with the great work. You guys are awesome. Pascal all the way up in Montreal. We talked about it a lot. I can't wait for the day when digital is cheaper than it makes sense, but right now to keep the hardware on the shelves and keep people able to go in and buy the stuff, you play nice with GameStop, Walmart,",
            "start": 4759.52
        },
        {
            "text": "wait for the day when digital is cheaper than it makes sense, but right now to keep the hardware on the shelves and keep people able to go in and buy the stuff, you play nice with GameStop, Walmart, all these other carriers, right? These physical stores. I don't know if we've ever said everyone needs to buy digital. We understand bandwidth problems, which we talked about earlier in this episode, everything else, which we have a lot of in the US, right? Exactly. Not so much. Yeah, bandwidth and just, just we have infrastructure problems here. Sure. So I'm not saying I understand the reasons why people do. I think I often, when I'm in a store, I'm like, why would anyone come in? And that's, but that's not everyone. When I'm in a GameStop and it's fucking a baby screaming over here and I can't, I got to talk to somebody to get the game that I want and all this other stuff and dut, dut, dut, do you want to buy the magazine? No, I don't want to buy the fucking magazine. Like that's the",
            "start": 4803.44
        },
        {
            "text": "can't, I got to talk to somebody to get the game that I want and all this other stuff and dut, dut, dut, do you want to buy the magazine? No, I don't want to buy the fucking magazine. Like that's the experience I'm talking about. I, I that's more of a, as somebody who buys fucking toilet paper and paper towels off of Amazon, why doesn't everybody just use Amazon? Why doesn't everybody just order online in a world like that's connected to your phone at all points? You know what I mean? Because now it is you're out on the street and you remember something and you can just click, click and it's done and it's going to be there in two days or whatever. So that, that makes sense. And also, I mean, we always talk about it in this weird way of like, I, you know, we, I feel like myself, I can speak for myself that I'm all, I feel like I get on the soapbox a lot of don't buy used by new. You do this, you know, let's support developers and all that stuff. But I remember being in college and I",
            "start": 4840.32
        },
        {
            "text": "for myself that I'm all, I feel like I get on the soapbox a lot of don't buy used by new. You do this, you know, let's support developers and all that stuff. But I remember being in college and I remember being even younger than that and I'm going to go in and I had the funko sheets and this is how much I can get for these games and I'll go in and I'll trade them in and then I'll be able to buy this next game because of that. I understand the economics of all of it. It's just that we get to speak from being an adult now, you know what I mean? And actually having money and having a job where I do when I do buy a game, I do buy a digital and I do try to buy new obviously, but it's the fact of that, you know, for me, digital works for me, I don't want clutter. The house is too small. I don't want all these games around here. I'd rather have them all there ready to go. Yeah, I don't disagree. It's not a hill worth dying on for me. Like it's like, this is going to happen. I mean, whether",
            "start": 4871.12
        },
        {
            "text": "want all these games around here. I'd rather have them all there ready to go. Yeah, I don't disagree. It's not a hill worth dying on for me. Like it's like, this is going to happen. I mean, whether or not you want it to happen, it's going to happen. So it's just a matter of, you know, because some people are really like, well, digital games will never, you know, will never take over. Retail games will never go away. I'm like, no, they're going away. So it's a matter of when you buy PC games, it's the worst. Right. So it's still by, you know, very limited amounts now. So it's a matter of like, it's going to happen. Like the market will take care of this. It already is. We, you know, not too long ago talked about like the increase in digital sales that a lot of publishers are experiencing and witnessing. It's not a plurality of games sold, but it's getting there. And so I have no problem with like, ultimately, it's your game to buy or sell. It's your car to buy or sell. I don't really",
            "start": 4911.76
        },
        {
            "text": "and witnessing. It's not a plurality of games sold, but it's getting there. And so I have no problem with like, ultimately, it's your game to buy or sell. It's your car to buy or sell. I don't really care what you do. It's just, there are ramifications for doing what you do in terms of the developers and stuff like that. But I agree. I've sold, I've bought and sold used games in the past. I just haven't done that as an adult. Not because I have some sort of moral obligation not to, but because yeah, like I have money as an adult and I don't need to, you know, pinch pennies that tightly anymore. But I understand and respect that there are people that do and that's your prerogative to do that. But ultimately it's the digital, the digital future is real. It's going to happen. And the pricing situation is just that. It's just, it's a catch 22 for specific companies to not be able to do that. So, you know, I hope that people find a nice middle ground now between, you know, what they have",
            "start": 4945.76
        },
        {
            "text": "situation is just that. It's just, it's a catch 22 for specific companies to not be able to do that. So, you know, I hope that people find a nice middle ground now between, you know, what they have to do with retail, what they have to do with digital. But I would also just start getting used to the fact that, you know, these consoles have disk drives. I'm not so sure the next ones will, you know. We can hope. Because everyone should buy digital. There was a lot of conjecture that PS4 and Xbox one would have solid state, be solid state. It works so well for the PSP Go, but it's just that we're not there yet. But in 10, like internet infrastructure in 10 years should be fine. I mean, at that point we might even all be connected wirelessly with like my friend always talks about 5g. Like what does that look like? And like, do we need land lines? That'd be awesome. Awesome. Okay. So, okay. So don't even say it. Awesome. Ah, call in time for the segment we call PS I love this best friend",
            "start": 4990.48
        },
        {
            "text": "does that look like? And like, do we need land lines? That'd be awesome. Awesome. Okay. So, okay. So don't even say it. Awesome. Ah, call in time for the segment we call PS I love this best friend XOXO. It's when one of you heads over to kindofunny.com slash forums goes to the PS I love you XOXO board and posts your PSN name because you want to play with cool people and get cool messages from you, other cool best friends out there. This one comes from the PSN name I dream of August. All one word. I dream of August. He or she writes, I don't have many friends who are gamers so I could use new friends in the PSN. I'll be playing UFC two, the division and uncharted four. I'm currently playing hell divers, Lego, Marvel, Avengers, and metal gear solid five. He also used the kind of funny forums emoticon of Colin doing this where he points at the screen. I like that one. I miss you. You don't smile enough. No. Why aren't you smiling today? What happened? I'm just really tired. I'm fine. I'm",
            "start": 5032.64
        },
        {
            "text": "emoticon of Colin doing this where he points at the screen. I like that one. I miss you. You don't smile enough. No. Why aren't you smiling today? What happened? I'm just really tired. I'm fine. I'm in a fine mood, but just straight. I had a long weekend, very interesting weekend. A lot of things happened this weekend. We can't talk about Saturday at all, but one day it was, it was a very interesting weekend. So everybody go message or friend. I dream of August. Tell him PS. I love this best friend X, O, X, O time for this week's forgotten PlayStation game. It's my turn and I'm picking age of booty. You might remember Asia booty originally called plunder. I thought a better name. I don't remember why they had to change to age of booty, but probably copyright. It's a strategy game with little pirate ships and you went around. You fought each other and it was on the hexagonal grid or whatever knows fucking dope. It was awesome. PlayStation X, Xbox. Yeah. Uh, I imagine it's still out",
            "start": 5084.56
        },
        {
            "text": "little pirate ships and you went around. You fought each other and it was on the hexagonal grid or whatever knows fucking dope. It was awesome. PlayStation X, Xbox. Yeah. Uh, I imagine it's still out there available to get on both those platforms. Uh, fun times like, you know what I mean? It was one of those rare ones where I saw it at a preview and I was like, this seems awesome. Then it came out and it was still awesome and played it all the time, but little ship to ship combat and go around and get people very cool. Yeah. Fun strategy game. Simple enough to get into. I'm not, you know, other than Valkyria, I'm not, I'm no strategy master. I'm just like the rest of you. I think you'll enjoy it. Colin yes, that's another episode of PS. I love you. Xoxo in the books. Thank you, ladies and gentlemen for joining us and watching. Of course, remember PS. I love you. Xoxo is kind of funny. Com's PlayStation podcast, so head over there to keep the mics on. Also subscribe to us on itunes,",
            "start": 5121.52
        },
        {
            "text": "gentlemen for joining us and watching. Of course, remember PS. I love you. Xoxo is kind of funny. Com's PlayStation podcast, so head over there to keep the mics on. Also subscribe to us on itunes, maybe resubscribe to us on if you're not seeing the show for some reason. Subscribe to us on youtube. Follow us on twitter. Do all that junk because it's cool and we're the number one playstation podcast and it keeps that available. Peace said remember also for housekeeping stuff. If you're still watching this on Tuesday, February, ninth before twelve thirty PM PT, go to kind of funny dot com slash t shirt Tuesday to get your bakers dozens shirt and also head over to kind of funny. Com S X, S W to vote for me so we can go and shove it back in Pewdiepie's face and say Pewdiepie. You're a really nice person and we really appreciate you and want you on the shows, but we're excited that we won this award. When you have a gazillion subs and a TV show and you were on soft park and you have another",
            "start": 5160.96
        },
        {
            "text": "person and we really appreciate you and want you on the shows, but we're excited that we won this award. When you have a gazillion subs and a TV show and you were on soft park and you have another show, he's got a lot of shows. You can download the track right here on soundcloud. His soundcloud, of course, is some cloud dot com slash X Sean Thomas. I'm a spell all this because you can smell the stuff where X S H A W N T H O M A S X Sean Thomas on time cloud. You can download the track right there on soundcloud and I made a silly music video for it to if you're more individuals and a gross thumbnail. Thank you so much. Excited for year two Sean Thomas. Now here's my one complaint. We all it's we're twenty two episodes in people come and go great. They're learning. I'm glad Sean's joined us now. He did the right thing. You too. Link soundcloud link didn't put the title of track in the in his message post. Everybody has to remember that when I'm looking at it, I'm just seeing words, so I",
            "start": 5201.76
        },
        {
            "text": "now. He did the right thing. You too. Link soundcloud link didn't put the title of track in the in his message post. Everybody has to remember that when I'm looking at it, I'm just seeing words, so I need all the words you want me to say. You understand also, I don't think he didn't have he didn't originally put in the shot. The soundcloud link. He just said on the side cloud below and then it embeds, which looks pretty, but doesn't help me here when we're talking about now. So everybody from this moment forward do this. Remember, don't send in your friends music sending the music you made okay until next time. This is Sean Thomas with whatever the hell this song is called. It's been our pleasure to serve you.",
            "start": 5305.04
        }
    ]
}