{
  "id": 1723,
  "video_id": "-RgbGNh1JYU",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Dealing With Family Loss - The GameOverGreggy Show Ep. 126 (Pt. 4)",
  "description": "Tim Gettys explains how he deals with family loss.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1462431600,
  "duration": 1299,
  "transcript_chunks": [
    {
      "text": "Tim, yes, what's your topic? So I'm going to throw it back to you, Greg. It's a topic from Patreon. That's right. Chris, how do you pronounce his last name? Zos, Zevos. Chris Zevos supported us over on patreon.com/kindafunny. Get his topic right in the air and here it is. How would the Kinda Funny team deal with family loss or finding out a person you know has been diagnosed with a possibly terminal disease? Obviously, everyone focuses on the sick person, but it can really take a toll on the people around them. I recently heard Brian Alano's mom was recently diagnosed, so I looked to Brian to see how he handled the situation in a very public manner due to his job. It must have been difficult, but he also seemed supported by a great community. My story is on the GoFundMe is, I'm sorry, my story is on gofundme.com Gloria and I'm sorry, Zeos, is that how you said it? Is Zos? I would say Z. V. A. L. L. O. O. S. My mom actually passed away since the last time we spoke. It's destroyed our family because of the nature",
      "start": 2.85
    },
    {
      "text": "Gloria and I'm sorry, Zeos, is that how you said it? Is Zos? I would say Z. V. A. L. L. O. O. S. My mom actually passed away since the last time we spoke. It's destroyed our family because of the nature of my family. Basically, everyone is at each other's throats. I'm trying to cover all the cost to reel everyone and it's been difficult. Uh, this is from Chris, of course. He had reached out originally with this topic because he wanted to surprise his family, his mom, to go to the GoFundMe site to support her treatment. She has since passed away, so the GoFundMe site is turned into a memorial for his mom to pay for bills or service and everything else. So of course, we encourage if you can to go throw a few bucks that way. But this is one of those things I think about all the time cuz I'm getting older, which mean then I'll stop and be like, oh, ****, my parents are getting older. What is going to happen when inevitably something bad happens, you know what I mean? And I don't mean like shark attack. I mean they get and",
      "start": 56.44
    },
    {
      "text": "I'll stop and be like, oh, ****, my parents are getting older. What is going to happen when inevitably something bad happens, you know what I mean? And I don't mean like shark attack. I mean they get and I don't mean cancer. I, you know what I mean, anything. I had cancer, but you know, when one of those events happens for them, what is my reaction? I assume it's that I'm going to have to, I'm going to tear up stakes and go out there for as long as it takes. But what if it is like my cancer was right where it's like a six month process? I don't know how I'm going to deal with that. Now in terms of how I deal with it emotionally, I would have deal with it very much the same way Brian's doing with his mom where he's throwing himself into his work, into the comedy butt, into IGN, being public about it, right? Because that's all we know how to do. That's who we are. Sorry, you threw me off when you said your parents might die of a shark attack in Lake Superior, whever the **** it is, Michigan. I was like, Jesus, what",
      "start": 94.96
    },
    {
      "text": "that's all we know how to do. That's who we are. Sorry, you threw me off when you said your parents might die of a shark attack in Lake Superior, whever the **** it is, Michigan. I was like, Jesus, what a way to go. They mom was just on a cruise. You're telling me a **** shark couldn't have jumped out of the water onto the deck. Yeah, the Carnival, whatever the **** it was and then just started thrashing around gets her. She's over there trying to enjoy shrimp cocktail getting the where where did big old Jamie Kennedy go? Uh, down south to Mexico. Oh, Mexico. I think I don't know. I'm pretty sure that's right. Lots of sharks there. I think about this subject a lot actually, um, because same reason, right? My parents are almost in their 70s and they're thank God knock on wood both happy and healthy. Um, but every once in a while my mom will tell me something and know like the it was like six months ago she was like, well, you know, I went in for this this surgery and it was a pretty major surgery and I don't want",
      "start": 128.8
    },
    {
      "text": "once in a while my mom will tell me something and know like the it was like six months ago she was like, well, you know, I went in for this this surgery and it was a pretty major surgery and I don't want to get into details to you know, I want to respect to head transplant. It was a head transplant. It was actually a head and a foot transplant at the same time. They were there they put her under they like we got to do them both. Um, we went in to check on your foot there's a problem with your head we we did them both. Uh, but no, she just kind of casually was like, oh, well, you know, I just got out of the hospital. I did this thing. It's not a big deal. And I was like, what wait, you had surgery like like they put you under and you had surgery she like yeah, but it wasn't a big deal. I was like, but you got to **** tell me these things like where have we gone wrong in our life that you don't feel like that I Le I should at least get a call and the guilt trip for not being there. Yeah, I expect that cathol for",
      "start": 167.64
    },
    {
      "text": "tell me these things like where have we gone wrong in our life that you don't feel like that I Le I should at least get a call and the guilt trip for not being there. Yeah, I expect that cathol for yeah, the Catholic like where the **** have I have I been have I put up that big of a fortress between us um that you don't feel that you can do that to me anymore because it still works um and I actually have communicated that to her thankfully and she has heard it and now calls me more often which I like and had yeah good it's great well so she either calls me to guilt me I mean this is this is our relationship and this you know it's it's it's endearing because she either calls me to guilt me or she either calls me to talk **** about my brother both interesting on their in their own right but I prefer the one where we talk **** about my brother of it's just super fun but she cuz I know she does the same thing to me with Matt of course so when your brother did this thing and didn't",
      "start": 202.48
    },
    {
      "text": "but I prefer the one where we talk **** about my brother of it's just super fun but she cuz I know she does the same thing to me with Matt of course so when your brother did this thing and didn't invite us or whatever and I was like whatever um but I thankfully have not had had to deal with that but I've I've watched my dad go through um losing my grandmother Scarpino. I didn't know my grandfather he died when I was one but my grandma Scarpino went and she was the matriarch of that side of the family um and in some way kind of was the crazy glue that held it all together emphasis on the crazy so when she was not that that that sort of Cornerstone anymore um or Keystone rather uh it all just everyone started being becoming an interesting little kind of monstrous version of himself with my dad with my dad and his parents not my dad specifically but with his uh his relatives and not not nothing bad but it was it was a this person's gone it all this stuff is happening now how do we react",
      "start": 236.88
    },
    {
      "text": "dad with my dad and his parents not my dad specifically but with his uh his relatives and not not nothing bad but it was it was a this person's gone it all this stuff is happening now how do we react to this and they reacted kind of negatively and it kind of put a little bit of a dent in the relationship with all the families I think we've since um then been able to rectify it but it's it's hard because there's a lot of real **** that goes into that too and that's the big thing I mean when I think about like my parents getting older or whatever I think about being a kid and watching them deal with their parents you know what I mean who never that no one ever moved out of the Du Page County you know what I mean like they were all right there everybody's what a 10-minute at Max car right away Grandma Miller of course living down the street we've already covered this if line kill girls no raccoon she didn't kill it just trapped it but I mean like she was right down there you know what I",
      "start": 277.96
    },
    {
      "text": "Grandma Miller of course living down the street we've already covered this if line kill girls no raccoon she didn't kill it just trapped it but I mean like she was right down there you know what I mean then eventually moved downtown and then like my mom's folks Liv downtown Glenn Ellyn as well and stuff like it was everyone was right there and that's when you start getting to the point of like I remember those days of you know having the ambulance have to come to Poppy and grandmas which were you know Grandma and Grandpa Kennedy and all this stuff but like that people were able to be there like that you know what I mean and mine's always like **** when's it going to happen when is something bad going to happen where I'm like at PAX or whatever and we're doing some stupid **** panel and I come off and I'm like gotta go you know what I mean see you guys I I don't know when I'll be back or what's happening bye yeah it's never convenient I mean when my grandmother passed away she",
      "start": 318.12
    },
    {
      "text": "and I come off and I'm like gotta go you know what I mean see you guys I I don't know when I'll be back or what's happening bye yeah it's never convenient I mean when my grandmother passed away she hadd been ill for a while she um had had some I think she had a couple bypass surgeries like more than one should have I think in their life she didn't take the the best care of herself toward the end of life the doctor would tell her to stop eating so much salt and go for a walk every once in a while she basically told him go **** himself um I like her oh yeah she was like I don't care like straight up like H whatever and but the doctor's like you're going to die she's like eh I you are too doctor she died **** eating pizza and like no she didn't really no I mean like she not literally no but to the day she died she never once she didn't really go yeah hilarious she actually ended up um fighting with pizza guy he killed her um while she's eating he's like pay me and it just escalated F",
      "start": 351.08
    },
    {
      "text": "to the day she died she never once she didn't really go yeah hilarious she actually ended up um fighting with pizza guy he killed her um while she's eating he's like pay me and it just escalated F the cuffs he lost the leg it was a whole rigoll um but no but like but but that was that was really I mean I remember getting a call saying like your grandma's in the hospital and I was like oh this is not it's going to be fine and then but it was like the tone of my dad's voice was like this is this is it and I'm like this is weird this is the first time I've of this cuz even when I was young my mom lost her mother um but I was I was very young and I just remember my mom crying a lot yeah um but it wasn't I didn't really I was too young to really sure it was happening but this was the first time I'd see another thing that would stayed with me forever which was my my when my dad's mom died my grandmother died um she was in the hospital came out of the hospital and I had a call a couple weeks",
      "start": 389.08
    },
    {
      "text": "I'd see another thing that would stayed with me forever which was my my when my dad's mom died my grandmother died um she was in the hospital came out of the hospital and I had a call a couple weeks later that she had passed and it was like oh that it was really sad but then I remember seeing it hit my dad and I've never seen my dad cry before and that **** tore me apart and him and then seeing her um her brothers because she has a couple brothers are still alive and they're well into their 80s at this point crying as well and facing that and you seeing them face that their their own mortality and understanding that they like outlived their sister who was the younger version you know there's a lot of emotion that goes into that and so it becomes very very very real for you and then somehow through these beautiful brains of ours we just decided we just kind of shut it out cuz we have to right you can't you can't think about your death every day of your life or can I oh you can trust",
      "start": 429.84
    },
    {
      "text": "through these beautiful brains of ours we just decided we just kind of shut it out cuz we have to right you can't you can't think about your death every day of your life or can I oh you can trust me now uh I've said this in the past and I hate talking about it but like you know if you were to count the 0 people in my family closest to me or whatever like so like my siblings my parents my uncles and aunts like my cousins like everyone's still alive and like the last time we lost someone that was like super close to me was my grandmother in 2004 and before that my grandfather in 1996 um and when my grandfather died it was like a total polar shift for my family CU he was the patriarch of the family like very Italian family very Italian man and you know then his wife died she kind of like went you know um these this is my mom's parents like she kind of just lost her will to live and just **** went on for eight years and just went scile and had Alzheimer's and had no idea who anyone was",
      "start": 469.6
    },
    {
      "text": "you know um these this is my mom's parents like she kind of just lost her will to live and just **** went on for eight years and just went scile and had Alzheimer's and had no idea who anyone was just totally gave up so it was like that was like really sad but like I know that eventually like someone's num is going to get pulled and I hate to say that like it could be mine it could be like anyone's but I'm like but I like I look and I'm like **** this is what I was saying in the last thing where I'm like I got to be better like I don't know like when this is going to happen and who it's going to happen to and I'm gonna and and all I know is that I'm going to be full of regret and the last time it almost happened was my Uncle Mike who I love to death he's the guy I play fantasy football with we're always texting back and forth he's a he's a great man he's a really great man um he uh he had a heart attack when I was in college and had I think quadruple bypass and I remember going",
      "start": 510.52
    },
    {
      "text": "with we're always texting back and forth he's a he's a great man he's a really great man um he uh he had a heart attack when I was in college and had I think quadruple bypass and I remember going home to Long Island with my mom from Northeastern to see whatever what the **** and um and I remember just he was like stapled up like they like and I I remember just hysterically crying and I remember feeling bad because my cousin Jimie that's his only child like was being way more composed than I was and I was like this is **** up like I'm not like I don't think about this enough to like to understand that this mortality issue is going to like come and nip us in the butt at some point um and so I'm sad about like my parents are getting older and the one thing I know and I I'm I'm not trying to temp fate but it's just like this is wood too oh okay it's like I assure you that is not happened to my mom or my dad I would be finished for a while like absolutely **** finished especially I",
      "start": 544.48
    },
    {
      "text": "to Temp fate but it's just like this is wood too oh okay it's like I assure you that is not happened to my mom or my dad I would be finished for a while like absolutely **** finished especially I love my mom and dad equally but especially my mom because like of just the nature of mother son relationship like I'd be out of commission I'd be gone I'd be out of here for a few months probably like gone and like the the I just i' I said this to Erin and and I guess it's more of a but like I really want to go before like my parents do like I know that that's like I I really like I and my siblings like if I I can live if they can live into their like because of modern medicine all they live to 100 and that gets me into my 60s cool like I'll I'll gladly not **** bear witness to that **** tragedy of like losing one of my parents because it's so terrible I saw what it did to my mom you know and and um and it's it's it's a sad thing my Uncle Mike's um uh father just passed away actually as",
      "start": 590.76
    },
    {
      "text": "of like losing one of my parents because it's so terrible I saw what it did to my mom you know and and um and it's it's a sad thing my Uncle Mike's um uh father just passed away actually as well and then that was it's it's a it's a heartbreaking kind of thing um and so I try to remain cognizant of of of that because it's it's kind of it's kind of a scary situation and I I always I think I saw talked about when we were talking about 911 at some point like I remember when my dad's best friend died in 911 um Tommy um he was a fireman and I remember his daughter um she he was buried um he was the last one to get buried because they never the 343 because he never found they never found his body um so this was in 2001 and uh I remember his daughter was my age and we had known each other like kind of cursy way whatever and I remember her hysterically crying in the church or whatever and I was like depending on the situation in the day or whatever because everyone in the firehouse died",
      "start": 637.6
    },
    {
      "text": "kind of cursy way whatever and I remember her hysterically crying in the church or whatever and I was like depending on the situation in the day or whatever because everyone in the firehouse died that day that was on duty like that could have just been me yeah and so I realized at that point with my father specifically that I dodged many a bullet that I never even thought of as a kid because he was gone and he could have died any given day you know as anyone could but I mean he was putting himself in danger in danger yeah like over and over again so I've just kind of counted my blessings that everyone's healthy and everyone's good but the same thing my mom does the same thing to me and I feel bad because my mom who listens to the show hi Mom she like she bust my balls a lot because I don't I don't talk to her enough and I really don't and she's like I just want to hear from you and I just like want to talk to you I'm like I just don't know what you we said about this like I just feel",
      "start": 688.12
    },
    {
      "text": "I don't talk to her enough and I really don't and she's like I just want to hear from you and I just like want to talk to you I'm like I just don't know what you we said about this like I just feel like I'm **** boring like I don't have anything to say but at the same time it's like I would maybe like it comes the time when I'm never able to talk to her again you know like and my thing man it's like it's like almost bring tears my eyes it's like heartbreaking it's like Jesus like what's wrong with me you know like like dude like two weeks ago I straight up called my parents and I was like you guys need to call me more straight up and they were like yeah well you told us not to call I was like well **** me from from like two years ago like I know I was busy and I was an **** back then but you guys need to call me once a week like you're my parents you need to call me once a week done and they have yeah and it's good but to your point earlier like I don't really have that much to",
      "start": 727.12
    },
    {
      "text": "but you guys need to call me once a week like you're my parents you need to call me once a week done and they have yeah and it's good but to your point earlier like I don't really have that much to say that they can really relate to me on because I they know we run a business they know we're successful they were happy which is all that really matters when I start getting into the inter keys of like what it means to like be a part of of you know the roost the family or any of that stuff they don't know they don't know what the hell I'm talking about but ultimately they just kind of want to hear what's happening in your life and they want to tell you what's happening in their life and that's it and like it's a 15-minute conversation that I feel so much better about having every week now um unless my dad starts talking about taxes which case I want to **** shoot myself in the head because it's an hour and a half long tax code conversation where I'm like I put the phone down bake a cake",
      "start": 760.88
    },
    {
      "text": "my dad starts talking about taxes which case I want to **** shoot myself in the head because it's an hour and a half long tax code conversation where I'm like I put the phone down bake a cake watching porn Jesus good Lord yeah I think I think it's just it's so how would I prepared for it I I don't think I don't think you ever prepare for that I just know I just know what I would be like when it like when I lose someone that's close to me I just I've God it's like so I hate saying it but you have to verbalize it like it's just I've been pretty lucky yeah you know so far and but we are all getting older and this luck will not last you know so yeah that's the scary thing about it is just like man like I I kind of just want to go before any of these **** people and it's so selfish it's like such a it's like actually the most profoundly selfish thing you can possibly feel is to be like I so want to avoid this that I want to die before any of you oh yeah wait till get married wait",
      "start": 792.72
    },
    {
      "text": "like such a it's like actually the most profoundly selfish thing you can possibly feel is to be like I so want to avoid this that I want to die before any of you oh yeah wait till get married wait till get married and that that sentiment is like tenfold like I kid my wife about it but I'm deadly serious I'm like I'm going way before you way before you like I don't want I just want if there's any hint that you might be sick I might just be like just put one Jes have Kevin come up and put a 0 she like I just had the flu like well can't handle it can't handle it cuz I just I don't I don't think I do well with that and I also don't know the only the only that would break my heart about my parents is that they're still together and so I don't know which one would be worse if one went if my dad went first or my mom like it would just be bad cuz my dad I don't think is capable of I mean he's he can he's obviously a very competent and smart human being but like I just don't know that he'll",
      "start": 834.56
    },
    {
      "text": "went first or my mom like it would just be bad cuz my dad I don't think is capable of I mean he's he can he's obviously a very competent and smart human being but like I just don't know that he'll take care of himself very well and my mom I think as much **** as she talks about my dad really loves him course and like they have to like she just that's it's her partner you know yeah and like there's after it's it's weird now having that perspective when you're 36 and going like well if God forbid my wife one day was to say to me you know what this is just not working I don't want to do this anymore it would be it would crush me but I would B I would be able to bounce back right but when you're 70 yeah what the **** are you going to do what are you going to do you're going to go to the Disco Tech your local your local Club disc you know to find something from your it doesn't exist anymore there's no you can't do that like this is your partner this is this person's been with you your",
      "start": 872.12
    },
    {
      "text": "Tech your local your local Club disc you know to find something from your it doesn't exist anymore there's no you can't do that like this is your partner this is this person's been with you your entire life yeah exactly and this is and and when they go there's no getting that back that that takes a piece of you with them and you got to you just have to go after it eventually that's what happened to my grandma they were married 5 years and it was just like it was over she was done like she was done it was Inc it was incredible to watch as a kid like I was like this is my grandfather died she was normal for like two weeks and then it was over and I never had a conversation with my grandma for eight years after that like she had no idea who I even was that was when I what the **** happened you were fine when I think of my mom's folks dying that's what I think of like her mom her mom went first my grandmother went first or whatever and I remember on the way out my grandfather he was",
      "start": 912.08
    },
    {
      "text": "you were fine when I think of my mom's folks dying that's what I think of like her mom her mom went first my grandmother went first or whatever and I remember on the way out my grandfather he was already in a wheelchair whatever he had you know he was dealing with lung cancer and FM and all that stuff and I remember him grabbing the casket and leaning in kiss her goodbye and said he'd see her soon and like that was like you it was like him giving I mean he's you know he was stuck around for a long time ate some popery it's another story for another time but like told that story I love that story that's like one of like our family stories or whatever those chips tasted terrible what chips the chips you put on the coffee this is my after he moved in with my aunt my like anybody caught chip me you mean the poper you ate po Grandpa why' you eat the whole Bowl um although I will say this my my my wife's grandmother who was her husband's passed away a long time ago has a boyfriend so there",
      "start": 946.88
    },
    {
      "text": "me you mean the poper you ate po Grandpa why' you eat the whole Bowl um although I will say this my my my wife's grandmother who was her husband's passed away a long time ago has a boyfriend so there is there is you can kind of continue that like a compan she's happy yeah I mean they're like I don't know what they do I don't they want details no I don't I don't want that but apparently that's a thing by the way yeah nursing homes nursing homes like like the Olympic campus like people just ravaging each other what do you got to lose what do you care why don't they have anything to lose the Olympic campus it's like the Olympic well those was are two separate statements like the olymp campas period they have nothing to lose period um why do you is just cuz everybody's so hot you think at the Olympics are all like athletes that's what they say that's what I've heard that's that's the rumor in the campfire is that everyone's so incredibly fit and goodlooking and they're all hopped up on",
      "start": 980.68
    },
    {
      "text": "Olympics are all like athletes that's what they say that's what I've heard that's that's the rumor in the campfire is that everyone's so incredibly fit and goodlooking and they're all hopped up on like on endorphins and steroids and probably well we don't know steroids we don't want to start rumors but yeah steroids um Michael Phelps already cleans up or did oh I guarantee Phelps taking bong rips I there man I've never been more disappointed in a human being than when that photo surfaced and Michael Phelps apologize for it I would have just come up be like yeah that was me smoking weed and I've won like 18 Olympic gold medals how you doing yeah **** you you think I care about these endorsements I'm a millionaire **** yeah you just show the picture of him with those 80 medals are around his chest and then just another picture that's just his middle finger um yeah that was actually shitty I don't know is that is it illegal to smoke weed when you're on in uh the Olympics I think you",
      "start": 1024.76
    },
    {
      "text": "his chest and then just another picture that's just his middle finger um yeah that was actually shitty I don't know is that is it illegal to smoke weed when you're on in uh the Olympics I think you can test positive for yeah I don't know but in most sports they don't test you for weed though right no they do in football people get people get suspended for like four games and then baseball I don't know baseball you can smoke on the mound hold on well there's that whole famous there's that whole famous thing was the Pittsburg Pirates right with a guy threw a in a complete game shut out or something high on he was on acid there's a there's a 30 for there's a 30 for 30 about it oh wow I think yeah but like what the I I'll look into it it was like one of the great pitching it was like one of the great pitching performances of all time but he was like totally **** like the entire time in the zone man just focused was able to get touch with that that's crazy I'll get into that this is like the",
      "start": 1061.6
    },
    {
      "text": "pitching performances of all time but he was like totally **** like the entire time in the zone man just focused was able to get touch with that that's crazy I'll get into that this is like the one topic that I I like I have so much trouble even speaking on like it's so close to home and such a way that like it there's nothing that gets me more emotional than this in a bad way like it's it's weird cuz I I feel like I handle things well overall and um when there's problems either I can solve them or I have people like Kevin to solve them this is like the one thing that's been it's the issue of my life is my parents' health and my brother's well-being and it's it's like dealing with that over the  6 years I've been alive has always been the one thing that I have absolutely no control over and it's very difficult when I can't just do something or not do something or put myself in a position that will help and it's I I feel like it's the same advice you give someone that's just going",
      "start": 1100.68
    },
    {
      "text": "and it's very difficult when I can't just do something or not do something or put myself in a position that will help and it's I I feel like it's the same advice you give someone that's just going through any type of hard time where it's just just do the best you can you know be you and like that's how you handle it it's just be the best you that you can be yeah and cuz I I you need to realize what you can't control and you need to just you can't control life you control you can't re control how you react to life you know and that's the that's something I learned a long time ago and it's just been like something happens and you just need to allow yourself to feel the emotions that you feel but like to remember that you got to keep moving forward because you can't let it destroy you cuz it will like if you let that if you let these things get to you they're going to get to you more than anything like this this sounds stupid but it's not a joke at all at all like in Lion King when",
      "start": 1142.72
    },
    {
      "text": "it will like if you let that if you let these things get to you they're going to get to you more than anything like this this sounds stupid but it's not a joke at all at all like in Lion King when Mufasa dies like that moment with Simba like oh my God I can't even handle right now like really that resonates with me in such a **** way where I'm just like damn like Simba lost his dad you know he's not coming back that moment every time I see it it reminds me of my brother and just knowing that one day that's going to happen and that scares me you know but it's like I can't let that affect anything I got to just like keep being me keep doing good my mom's the same way like my mom is old my mom is not healthy my mom is you know and uh all I can do is make sure that Kinda Funny Live is as good as it possibly can because she's going to be at this one you know y yeah sorry no don't feel bad but uh just do you skate better skate better ladies and gentlemen this has been the Game Over",
      "start": 1189.8
    },
    {
      "text": "as good as it possibly can because she's going to be at this one you know y yeah sorry no don't feel bad but uh just do you skate better skate better ladies and gentlemen this has been the GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com kindof funny and toss us a few bucks to get exclusive access to each and every episode get cool perks and even see Nick naked Nick we got to take photos of you naked put him on the Patreon I like said goodies earlier yeah that was that was good I like that those goodies on Patreon okay I'll add them in there for you good we've been putting up these behind the scenes things for the Animated Series I got more for you all right cool if you have no money to give us no big deal head over to youtube.com/ kindof funny where we post the entire show topic by topic day by day until the entire thing goes up the following",
      "start": 1239.32
    },
    {
      "text": "all right cool if you have no money to give us no big deal head over to youtube.com/ kindof funny where we post the entire show topic by topic day by day until the entire thing goes up the following Friday as one big video In Mp3 until next time it's been our pleasure to serve  you",
      "start": 1278.08
    }
  ]
}
