{
    "id": 1720,
    "video_id": "_rohQoyNfYQ",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Our PAX East Story! - Kinda Funny Gamescast Ep. 68 (Pt. 3)",
    "description": "We tell the story of Kinda Funny's awesome PAX East 2016.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1462363202,
    "duration": 1300,
    "transcript_chunks": [
        {
            "text": "Kinda Funny Live is happening May 8th and 9th. It's a two-day event. The first day is going to be a completely ridiculous stage show. What we have planned this year completely blows last year out of the water, and I don't even know how that's possible 'cause we were really stupid last year, and this year's somehow even stupider. Day two, it's going to be full day of meet and greets. We're hanging out with, with all of us. A bunch of Rooster Teeth people are there, Funhaus people are there, Achievement Hunter. It's going to be a grand old time. There's going to be some games to play, there's going to be signings. It's, it's exciting. It's a really fun time. There's going to be exclusive merch. Oh yeah, there's definitely going to be exclusive merch. Go to kindafunny.com/tickets to get your tickets today. There's a couple VIP tickets still available, so make sure if you want one of those, you act fast. I'm going to move on to topic. I'm moving on Rascal Flats topic three. I'm going to split that one into two. Oh my.",
            "start": 0.04
        },
        {
            "text": "a couple VIP tickets still available, so make sure if you want one of those, you act fast. I'm going to move on to topic. I'm moving on Rascal Flats topic three. I'm going to split that one into two. Oh my goodness, yeah, 'cause we want, we went long on those. How long did we go for? 44 minutes. Oh my gosh, yeah. I got, I got one. You know how Dan broke my ribs? Yeah, speaking of Dan breaking your ribs, topic three. Hey, we went to PAX East 2016. We did. Making a note here, 44 minutes. Okay, good job, good job. Um, we went to PAX East and it was a lot of fun. It was a lot of fun, and it was very different for us. It was very different for us. It was, uh, the most unique PAX we've ever been to. I say I didn't see any games. Yeah, and that's a little bit of a lie 'cause I walked around at one point for one quick thing through the Indie Mega Booth and all the things there. But yeah, it was a weird thing to go there and have it be our first PAX as strictly personalities. And what I mean by that is that when I was at IGN and I",
            "start": 33.68
        },
        {
            "text": "Indie Mega Booth and all the things there. But yeah, it was a weird thing to go there and have it be our first PAX as strictly personalities. And what I mean by that is that when I was at IGN and I went to PAX, even last year when we were Kinda Funny and we went to PAX, we went and saw games and then reported back on the games, and that's how it worked. Whereas this one was, I had multiple panels, we had signings, we had pop-ups in the Rooster Teeth Booth, we had a party. And that meant there was like 30 to 30 minutes to an hour gap between every, every appointment, which, which did not mean that we could run to the show floor and go see what's new with Ark survival or run over and what's happening with YK right now, keep me updated. And that wasn't possible, which was weird 'cause I remember, you know, the old days of being at IGN and you'd see YouTubers or whoever you want to host, not even like G4 people who would come and do that kind of stuff and not see games. I was like, oh man, what a, what a peculiar",
            "start": 88.08
        },
        {
            "text": "old days of being at IGN and you'd see YouTubers or whoever you want to host, not even like G4 people who would come and do that kind of stuff and not see games. I was like, oh man, what a, what a peculiar world they live in. And now we are knee-deep in that world. It was really weird. Yeah, it is weird 'cause you know, back when we were at IGN again, I being a video producer would usually follow someone like you around and you'd go play the game and then we'd, you'd play a whole bunch of games, we'd walk off to just like the some random side thing and then shoot a bunch of videos of what do you think of this game, what do you think of that game and kind of just to quick, that was the content we made. Yeah, and so I, I never got to play too many games when I, when I did that. I, I play more games now than I used to. Um, so it's, that's been an interesting shift for me. But yeah, it's cool where we just get to kind of, especially now with the Rooster Teeth Booth, like now that we're with Rooster Teeth, they have their, the Let's",
            "start": 131.24
        },
        {
            "text": "um, so it's, that's been an interesting shift for me. But yeah, it's cool where we just get to kind of, especially now with the Rooster Teeth Booth, like now that we're with Rooster Teeth, they have their, the Let's Play Booth, which allows us to have a place to meet fans and have, and have a stage for us to, you know, yeah, sell merch and, you know, do shows and stuff, talk to people and meet so many people, not have it be how it used to be at the old days of like, all right, well, cool, meet me by the snack bar and we'll say hey and do, we'll play Freedom Wars or whatever. Like, it doesn't have to be. Yeah, no, and it's cool because I got to hear about a whole bunch of new cool games from people that got to go play them and they were telling me about. I was like, what'd you play? And then they, they explained everything. And that, that was hard to let go at this PAX is the fact that I do love playing games and I love the, you know, PAX works. And if you've never made it to one, you got to go, is the fact that PAX works because",
            "start": 172.52
        },
        {
            "text": "that was hard to let go at this PAX is the fact that I do love playing games and I love the, you know, PAX works. And if you've never made it to one, you got to go, is the fact that PAX works because it's a fan driven show where the fans' passion shines through. But in that same vein, it's the Indie devs that are there showing their game and their passion meets the fans' passion. You get this awesome experience. And so, you know, I made a point that one day where we did have an hour or not even, I think 45 minutes, whatever, where I ran over from the Rooster Teeth Booth and I went over there and I ran up and down the aisles. First off, to touch base with the so many people emailed me, you know what I mean, wanting us to see their game, try to touch base with them, not really see games as much as see people 'cause I, we've been doing it, I've been doing it long enough, you've been doing it long enough that usually when somebody hits me up and I watch your trailer, I can tell right off the bat if it's a Greg game, if it's a Colin",
            "start": 207.96
        },
        {
            "text": "it. I've been doing it long enough, you've been doing it long enough that usually when somebody hits me up and I watch your trailer, I can tell right off the bat if it's a Greg game, if it's a Colin game, if it's a Tim game. I don't need to play it. I can see if it's got the quality. And that's when I can sit like, you know, I keep going back and forth with like, I showed it to you when we passed it, uh, and we didn't get a chance to talk 'cause they were so busy, but We Are Chicago. Oh yeah, is this awesome looking game that's like this narrative driven, it's going to be thing, totally one of the Gone Home like, put yourself in their shoes kind of game in Chicago. And I was in Chicago, not the real Chicago, not suburbs on Corporate G.L. in Chicago. And so like, I'm like, 'Damn, that game looks awesome.' And I've been trying to make it work with us since GDC with them of seeing something and doing something. But that's the kind of connection you can make. And now that we run the business and have the company, it is that",
            "start": 248.88
        },
        {
            "text": "to make it work with us since GDC with them of seeing something and doing something. But that's the kind of connection you can make. And now that we run the business and have the company, it is that, all right, cool. Supergiant just announced Pyre, and Supergiant knows we love Supergiant, and Supergiant's local. And it's like, cool, their, their line was capped the entire time. I'm not going to go cut in front of people to play it. I'm not going to, I can work that out that at some point we'll get Greg over. Pyre looks damn awesome. Yeah, Pyre looks amazing. And that's the whole thing. And then, you know, we ran over through the whole flight out there playing Axiom Verge on Vita and landing and seeing T-Hat talk to him. And then K.M.'s there and I'm like, I'm already sold on Chasm. I don't need to play Chasm again, Dan. And it's this weird thing of, you know, I miss the days of, I, I don't know, maybe, you know, I did too many PAX this year. I did too many things. You definitely did. And maybe next year or next PAX Prime, I guess",
            "start": 285.88
        },
        {
            "text": "and it's this weird thing of, you know, I miss the days of, I, I don't know, maybe, you know, I did too many PAX this year. I did too many things. You definitely did. And maybe next year or next PAX Prime, I guess what I'd like to do maybe is maybe I'll just block out three or four hours and I'm like, that's my, I'm going over there and I'm running around and trying to play as much as I can because I know there is a sense of discovery over there and how it works. And you guys obviously, if you're listening or watching this, understand it already in the way that Colin and I come home and champion a game and then you know about it. It's like when we were at GDC and we were doing the Indie Night streaming, right, with like Arena Gods and all them. When we got, got that kid to 700 Twitter followers and he almost broke down to tears. He's like, 'It took me three years to get 300.' It's like that ability of being like, 'Oh, this is cool.' Like, it has a stamp of approval. I like, and I like being taste makers on that level and",
            "start": 320.92
        },
        {
            "text": "broke down to tears. He's like, 'It took me three years to get 300.' It's like that ability of being like, 'Oh, this is cool.' Like, it has a stamp of approval. I like, and I like being taste makers on that level. And that's the cool part of the job. So I missed that, but it wasn't, I don't think I, I missed it, but I don't think I blew past it. I think enough people reached out and I have enough demos and builds and stuff lined up that I think I know good stuff. But clearly I missed things. And of course, I mean, there's so, and that's the, the cool thing is I remember, remember my first PAX years ago at this point, maybe four years ago, the Indie Mega Booth was, it felt like a new thing still. It was small. Now PAX is the thing. That's what it is. Yeah, it was more bewildering. We're like, 'Oh, PlayStation has a giant Booth here this year.' Like, that's totally not normal. It's awesome, cool, glad you're here. But like, usually PlayStation's like, 'Oh no, we're not, we're not going to there. We're not doing anything.' Yeah, no, and it, it was",
            "start": 361.36
        },
        {
            "text": "this year. Like, that's totally not normal. It's awesome, cool, glad you're here. But like, usually PlayStation's like, 'Oh no, we're not, we're not going to there. We're not doing anything.' Yeah, no, and it, it was nice. It was cool to see, see how many booths there are of how many different games. And like, it's at the point now, there's so many, whether it's indie or AAA, they're everywhere. Um, and even older games, like it was cool seeing older, I say WoW, um, Ratchet & Clank, sure, games out floor. Yeah, games that are out. Um, and it was cool seeing people have so much fun with it. And like seeing PlayStation put so much behind that game. I was like, 'Oh, this deserves it.' That's awesome. And see, that's, I think that's that, them being a wise to how it works now. And the fact that it does that Ratchet & Clank, for better or worse, is coming up. And maybe people aren't super stoked for it. Then it comes out and people are like, 'Wait, people like us are talking about how great it is.' More, you guys, obviously, I didn't play. I still",
            "start": 402.64
        },
        {
            "text": "is coming up and maybe people aren't super stoked for it. Then it comes out and people are like, 'Wait, people like us are talking about how great it is.' More, you guys, obviously, I didn't play. I still haven't played, talking about how amazing it is. So then you get to a PAX and you do what you, people are trying to book their VR appointments or whatever the app. And we have time to kill and, and you see Ratchet & Clank pop over and see, 'Oh, I, I know people been talking this up. I want to see what's up.' What's also cool about PAX is just the, so it's such a community show and it's so cool that even older games have a new breath of life. Like I was walking by and I saw Gang Beasts and crowded people just having so much fun. I just popped in, probably one of the only games I played at PAX, Gang Beasts. Had, had a damn ton of fun because people are just there to have fun. That's why it works. That's why PAX, you know, has always been my, I, since my first PAX, has been my favorite show. And I remember being at IGN",
            "start": 438.48
        },
        {
            "text": "ton of fun because people are just there to have fun. That's why it works. That's why PAX, you know, has always been my, I, since my first PAX, has been my favorite show. And I remember being at IGN when I first got there, um, uh, Andre, who now does Gamespot, uh, he would go to PAX every year. And I say every year, I don't, and I forget how many PAX, how many PAX Primes did there been? No idea, exactly. Uh, but my, the first time I really, 'Oh, there's something called PAX. What is that?' And he was, he was going up to participate in the Mario Kart tournament. And he came back and I was like, 'So how was he?' He like, 'Oh, it was great. We did this, we did that, blah, blah.' I'm like, 'That's awesome, man.' And he's like, 'Yeah, but I have to turn my badge around when we go there.' I'm like, 'What do you mean?' And he's like, 'People hate IGN there. The PAX people hate IGN.' And I remember like, that was the moment of me. I'm like, 'I'm going to change that.' Like, I, and like, you get there and it's like, 'Oh no, that was just him.'",
            "start": 475.92
        },
        {
            "text": "like, 'People hate IGN there. The PAX people hate IGN.' And I remember like, that was the moment of me. I'm like, 'I'm going to change that.' Like, I, and like, you get there and it's like, 'Oh no, that was just him.' Hyperbole, you know what I mean? Maybe he did have a bad experience at some point where somebody's like, 'Damn you, IGN, guys.' I'm sure that's happened. But it's always been great. But it's also been great because I go out of my way to make it great where I love those shows in the point like from playing damn Metal Gear Solid: Peace Walker, like, and having these pop-up meet and greets or whatever. Like, you go out of your way, way to meet up with the cool kids. And luckily enough, like all the people who care about us are cool kids. So they come in the panel and they go to the Rooster Teeth. Such a good point, man. Like it, it was so fun to our, let's say, IRL at our booth. We had a, like me and Nick had like a pop-up at like 3 p.m. We'd be there early at like 1 p.m. spending an hour just hanging out with people and just",
            "start": 512.6
        },
        {
            "text": "it, it was so fun to our, let's say, IRL at our booth. We had a, like me and Nick had like a pop-up at like 3 p.m. We'd be there early at like 1 p.m. spending an hour just hanging out with people and just they're damn cool people. Yeah, like that's the, the best part about this whole thing is being around people that have similar interest, which means we can have conversations about what do you like? 'Oh, I like this. I like that too. Have you tried this?' 'No, I never heard of this.' Cool. That's why I always talk about it for like, you know, when I was growing up in the olden days, there wasn't these things. There was Comic-Con, but like, you know, I would never go to Comic-Con out of the blue. Whereas like, I've met so many people over the years at PAX conventions that do travel and came alone and now they have this and blah. And like, it's what I talk about in, I talked about, I guess, last year for Kinda Funny Live in the packet, right? Where I'm like, if you're alone or you're just a group of two and you're waiting",
            "start": 546.76
        },
        {
            "text": "and blah. And like, it's what I talk about in, I talked about, I guess, last year for Kinda Funny Live in the packet, right? Where I'm like, if you're alone or you're just a group of two and you're waiting in line, turn to the other people and talk to them because you have exact, you have a shared passion. And for Kinda Funny Live, it's, you know, the Kinda Funny content. But PAX is the same way of like, like you've traveled somewhere to see video games. Like even if you, that person likes WoW and you like Vita, like you can have a quick conversation, realize you're not compatible or whatever and bounce. Whereas like, that's what it's, is awesome about it. And when I'm talking about that, you know, that we didn't have, I'm like, I would have felt if this had existed back then, I would have bent over backwards and worked every horrible job possible to get to it 'cause it is such a, we take it for granted, right? That our lives are toys, our lives are, we're going to finish this. I'm in a, I'm not in a hurry, but I want to",
            "start": 580.96
        },
        {
            "text": "worked every horrible job possible to get to it 'cause it is such a, we take it for granted, right? That our lives are toys, our lives are, we're going to finish this. I'm in a, I'm not in a hurry, but I want to finish these things to go play an unreleased video game right now, right? And I, all I can think about is that. No, and like, and then you come in and you're playing the same game and you and I just sit here and talk about it forever. And a normal person who works at an accounting job or, you know, works at this place, they walk in and have no one to share their passion with. And that's why you see the internet and communities and friend groups and friends list and all these things expand and make so much sense. But PAX is that all in real life. And I think it's intimidating to go to one of these things and not know anybody or only have a few friends or go like, I, people, the kids we meet are so brave in the way of like, 'Oh yeah, you know, I'm 18 and we drove here, we flew here.' And dude, I was like, 'Damn, at 18, I'",
            "start": 620.88
        },
        {
            "text": "not know anybody or only have a few friends or go like, I, people, the kids we meet are so brave in the way of like, 'Oh yeah, you know, I'm 18 and we drove here, we flew here.' And dude, I was like, 'Damn, at 18, I remember it was a huge deal when like me and my dumb friends were like, 'Let's go tonight to a Downtown City, uh, strip club in Chicago.' And it was like, yeah, exactly. And like people like planning crazy trips. And there's the PAX 11, the Kinda Funny 11 of these 11 Kinda Funny fans staying in one hotel room. It's like, you guys are awesome and insane. And I love that. And like, that's the passion. Like I always talk about it, you know, when Colin isn't doing his Colin thing where he's like, 'Oh, Greg's got such an ego and he needs the limelight.' He's being honest. He's saying like, 'I know Greg's passionate about going to these, right?' I'm not passionate to go to these things to get recognized, to sign autograph, suit. I'm passionate to go meet you guys and talk to the people who actually drive our content and make",
            "start": 657.08
        },
        {
            "text": "to these, right? I'm not passionate to go to these things to get recognized, to sign autograph, suit. I'm passionate to go meet you guys and talk to the people who actually drive our content and make. Because without you, then I, the story always went like the, a long time, I went to Catholic School. You might not know this about me. I don't tell many stories about myself. And somebody once described faith as a glass of water, right? When you're, when you're a little kid, the cup's small, so the water is easy to fill the glass and you're, 'Oh, God got it. No big deal,' right? But as you get older, the cup gets bigger and the water level is always changing in terms of what you have faith in. And I was talk about it like when we're out, when we're here and we're mad at each other about somebody said something, some damn snide comment when we were on camera and like, you didn't address it then, but you want to address it. You, there's all this dumb crap in like just the daily grind of making this and emails and this",
            "start": 696.28
        },
        {
            "text": "snide comment when we were on camera and like, you didn't address it then, but you want to address it. You, there's all this dumb crap in like just the daily grind of making this and emails and this crap and everything's keeping you from playing damn video games like you want, right? It's so easy to lose sight of why this is great. But then get out there and meet you guys and talk to you and shake your hand and give you a hug and like, apology, right? Like, you know, this kid, you remember this crap who on Twitter had his damn mouth, his forever, his profile pick. And he finally changed it for me one day when I gave him too much crap, uh, year, like years of crap. Uh, like, you know, he was trying to meet up with me and, but you guys had already done your signing and I was getting ready to leave. And like, it's that thing of he tweeted me, he's like, 'Hey, where are you?' I'm like, 'I'm literally about to walk out the front door.' And he's like, 'Can you wait?' I'm like, 'Of course I can.' You know what I mean? Of",
            "start": 733.8
        },
        {
            "text": "and like, it's that thing of he tweeted me, he's like, 'Hey, where are you?' I'm like, 'I'm literally about to walk out the front door.' And he's like, 'Can you wait?' I'm like, 'Of course I can.' You know what I mean? Of course I will wait here at the front door of PAX for you to come over. And he came over and he gave me this gift or whatever. I didn't know that's what it was for, obviously. But it's like, that's what the connection we have with you. And it's, it's really crazy 'cause I, I'm so similar to you in so many of those ways and different in others where like, you're Greg and I know it. Um, I would never like, PAX isn't something that I'm like, 'I want to do that.' Like, that's not something that I'm like, 'That sounds fun.' Just 'cause to me, like, outside of, um, like being in it, I love us going. But I'm talking about like as a fan five years ago, right? Sure. Before I worked at IGN, the idea of traveling to a PAX and doing all that stuff, it is scary. Like, I, like, it's too overwhelming for me to even imagine going there by myself or",
            "start": 771.44
        },
        {
            "text": "five years ago, right? Sure. Before I worked at IGN, the idea of traveling to a PAX and doing all that stuff, it is scary. Like, I, like, it's too overwhelming for me to even imagine going there by myself or even like just me and Alfredo to, to just go do stuff. It's like, I wouldn't know what to do. I wouldn't know how to get into the parties. I wouldn't know, you know, how to find my way around the booths. What should I look for? Waiting in line, all that stuff. It's like, it's sound, it's overwhelming to the point of like, I, I wouldn't want to waste my time there. And I would feel like going there not knowing exactly what to do would be just detrimental to the entire experience. Having said that, the, the most similar thing I ever did was when I was 18, I went to the first the Toonami show, the Cartoon Network 5 Mega Show, where I, me and Alfredo and a bunch of people drove from SF to LA, which when I was, I think, 17 at the time, that was crazy. That was like the idea of like, 'I can't believe we're doing this. We're driving to a'",
            "start": 809.6
        },
        {
            "text": "I, me and Alfredo and a bunch of people drove from SF to LA, which when I was, I think, 17 at the time, that was crazy. That was like the idea of like, 'I can't believe we're doing this. We're driving to a completely different city farther than we've ever, I've ever been from my house, uh, with a bunch of my friends and we're just going to watch this thing.' And we get there and it's like, we made so many friends. Everyone of that concert was there for the same reason. For the whole weekend, we had fun together. And like, we created memories and friendships that I'll have forever, you know? And to see that happen at Kinda Funny Live is just like, it's so overwhelmingly like, 'Holy crap!' Like, this is a thing that's really, really, really cool. And then to see those same people at PAX East across the country and it's like, with these friendships they bonded through, they bond, you know, I see people and I'm just like, 'Hey, what's up?' Like, it's at the point now where I'll walk up to people and be like, 'Hey,' and they're",
            "start": 849.64
        },
        {
            "text": "like, with these friendships they bonded through, they bond, you know, I see people and I'm just like, 'Hey, what's up?' Like, it's at the point now where I'll walk up to people and be like, 'Hey,' and they're just like, 'Holy crap, you're saying hi to me!' I'm like, 'Yeah, what the crap, of course I am!' Yeah, there's nothing special about that. That's always the funny thing about like, you know, how people treat us. But then also how people treat, uh, voice actors and developers. And I, you're talking about waiting in line and going to PAX panels and stuff. And I, you can, I've hosted so many PAX panels, right? And you can have a room that is filled to the brim or the first three rows. And those developers, those voice actors are blown away. And developers for sure are terrified to speak in front of you. But they're so like, I, you know, the video game speech, right? The video game or The Game Awards speech, right? Like, that's their reality of busting their ass and breaking their backs and doing all these things. And usually only",
            "start": 890.56
        },
        {
            "text": "you know, the video game speech, right? The video game or The Game Awards speech, right? Like, that's their reality of busting their ass and breaking their backs and doing all these things and usually only getting you, 'Crap, you suck! Why'd you take this mode out? Why is it episodic?' Duh, you know what I mean? All these different things. So to get there and have it be, yeah, if it's 10 people or 100 people or 1,000 people telling them that they, you've connected with their, their, their product, their art, that's like crazy for them. And voice actors especially, right? That are like so behind the scenes, like not getting stopped in the streets kind of thing. But like to go there and have it be a huge damn deal that the voice of X is here right now talking to me, answering my question. They are like, to see what they get out of it. I always talk about it, you know, not a PAX, but similar experience when we did, uh, New York Comic-Con that year with the GTA V Guys. Oh yeah, and like we walked in there and that place went like",
            "start": 929.4
        },
        {
            "text": "out of it I always talk about it you know not a PAX but similar experience when we did uh New York Comic-Con that year with the GTA V Guys oh yeah and like we walked in there and that place went like they were like The Beatles and I've never seen three grown men because it was all it was all you know all all of them like get bigger smiles and be so blown away and like um I am blanking on his name um uh Shawn Fonteno why I can't remember his name damn it Franklin yeah Franklin but the actor's name Franklin's actor Shawn Fonteno that sounds right Frank Franklin's actor you know like when it all happened he turned around he gave me his phone he's like Greg please take pictures please cuz like he thought it was going to end and it was 15 minutes of pandemonium of people rushing the stage and giving them things to sign and da da like I had to finally sit everyone down but like that's their world too in the same breath right of like they like you know now Trevor's of course on Walking",
            "start": 965.88
        },
        {
            "text": "and giving them things to sign and da da like I had to finally sit everyone down but like that's their world too in the same breath right of like they like you know now Trevor's of course on Walking Dead or whatever it's a little bit different Steven Ogg but like at that moment like that was the their holy crap we've made something that people care about and that's awesome and I think that you know we just it's awesome that the you know Twitter and social media and stuff allows people to get to know those guys get to know the voice actors get to know devs get to know people in a way that years ago yeah right like that totally wasn't the thing totally closest you get to understanding people in video games was whoever wrote an EGM you know looking at picture of someone's face in a shoe for so long you know cuz that's all you had like you can connect to that person um now you can connect to all these people but there's something about PAX it's just it's positive you know it's like the the",
            "start": 1011.36
        },
        {
            "text": "long you know cuz that's all you had like you can connect to that person um now you can connect to all these people but there's something about PAX it's just it's positive you know it's like the the good comments on the internet yeah no they're all in a room though and that's the thing is yes and that's my faith analogy right of like it's you the negativity and your own stress and all the dumb shit knocks the water level down in that cup but then to go there and have people freak out to meet you cuz they enjoy your work that's what fills it all up and you come back re I come back recharged ready to go and ready to be whatever I need to be for people and the reason I do so many panels is because I want to be there for everybody I want to be able to I want to try to to touch everyone who wants to be touched I'm I'm trying to get Franklin's actor's name because I feel like an ass yeah no I mean that that's such a good point and like it's so funny that the the just raw passion that",
            "start": 1049.92
        },
        {
            "text": "wants to be touched I'm I'm trying to get Franklin's actor's name because I feel like an ass yeah no I mean that that's such a good point and like it's so funny that the the just raw passion that people have to be positive at these shows is very inspiring to me um even it's just misguided um positivity sometimes like something I thought was really funny was we did our uh the Kinda Funny party in PAX East and it was Kinda Funny The Hitman party it was a Square party and you know people don't necessarily know all the inner workings of how all this stuff works people here Square they think Final Fantasy you know that's Shawn Fonteno I apologize you were close um you know they think Final Fantasy and it's just like there's not not everybody understands first party second party third party exclusives and all that stuff so they hear Square they think Final Fantasy um we were at the Square party and we had a amazing line of people waiting for us us to say hi and take pictures and stuff",
            "start": 1085.28
        },
        {
            "text": "exclusives and all that stuff so they hear Square they think Final Fantasy um we were at the Square party and we had a amazing line of people waiting for us us to say hi and take pictures and stuff which is fucking awesome then there was this couple that came up that was Thanking us for making Final Fantasy and they were just talking how excited and so passionate they are about the franchise and how much it means to them and this and that and like they were so just like blah that like there wasn't even a moment to be like yo we didn't make that like whatever but it's just like I just love that they didn't know who the fuck we were but they wanted to thank us cuz they thought get they get yeah exactly it was just like that moment hit me where I was like oh man like I love that I'm just in a room people that just want to be positive and just want to be thankful and just want to enjoy the things that they enjoy ex and that's why it works and that's what I'm talking about in terms of",
            "start": 1127.52
        },
        {
            "text": "in a room people that just want to be positive and just want to be thankful and just want to enjoy the things that they enjoy ex and that's why it works and that's what I'm talking about in terms of like I would have gone to that and a heartbeat knowing what it is I I think maybe if if I'm 18 and I'm in Chicago and I PAX starts and I don't know that I wouldn't go but now knowing what I know I would totally go that's the thing honestly I think a good way to wrap this up is if you have ever questioned if it's worth going to one of these events go to it I think that you owe it to yourself to to experience it and and have that fun and do what Greg's saying everyone there is there just for the same reasons you are talk to them yeah that's the I mean that's the biggest thing you're going to get in as much as you you put into it you're get out whatever you put in so if you go there and you clam up you don't talk to me like this sucked I don't know why they're saying go there but if you go",
            "start": 1167.56
        },
        {
            "text": "in as much as you you put into it you're get out whatever you put in so if you go there and you clam up you don't talk to me like this sucked I don't know why they're saying go there but if you go there and it is holy shit you're you're in a Metal Gear jacket I love Metal Gear what are you doing you want to hang on like you can just say that because it's and I know that's intimidating but I just come from the guy like I always talk about when I went to Mizzou like that first weekend my friends went away and I was just like knocking on doors like I don't know anybody you want to hang out like I got nothing to lose yeah no for sure so definitely definitely give it a shot and you know I know for a fact that all of you at least somewhat like Kinda Funny so you should come to Kinda Funny Live too and and experience a bit of this this wasn't a whole ad for Kinda Funny Live was it no it wasn't but I mean it felt that at the end now it does feel that way being very clear who's my",
            "start": 1204.72
        },
        {
            "text": "Live too and and experience a bit of this this wasn't a whole ad for Kinda Funny Live was it no it wasn't but I mean it felt that at the end now it does feel that way being very clear who's my thing I I like natural transitions I'm not I'm not going to not take advantage saying to be clear that this was not the telegraph.com ticks you can hang out with your best friends there too and like literally those people are literally there for one reason well now some of them might like Bernie but literally the rest of them are there for us I that's so funny we're so good at our jobs that we don't even know when we're being good at our jobs I think we're just bad at our jobs but we fall into it you know I don't think that's possible it's somewhere because it's the same thing I was talking about on PS I Love You XOXO available every Tuesday at 9:00 a.m. where uh we Colin and I literally say nothing to each other about what's going to happen on that show but inevitably there's all these like",
            "start": 1237.64
        },
        {
            "text": "on PS I Love You XOXO available every Tuesday at 9:00 a.m. where uh we Colin and I literally say nothing to each other about what's going to happen on that show but inevitably there's all these like perfect transition and I'm like it's is if we plan this and I assure you we did not I will run with that all right py where's wrong all right so",
            "start": 1275.36
        }
    ]
}