{
  "id": 1770,
  "video_id": "F2XwLMA2P5c",
  "show_name": "Gamescast",
  "hosts": ["Greg Miller", "Tim Gettys", "Colin Moriarty"],
  "title": "Homefront and Doom Impressions - Kinda Funny Gamescast Ep. 71",
  "description": "We give our thoughts on Homefront and Doom, discuss Nintendo's movie plans, hypothesize what Rocksteady is up to, and get into EA's Battefront statement. (Released to Patreon Supporters on 05.20.16) \n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
  "published_at": 1464354000,
  "duration": 4346,
  "transcript_chunks": [
    {
      "text": "We know a ton of you are huge Overwatch fans and we are grateful for their support of Kinda Funny Live. Thanks again to the Overwatch teams at Blizzard and Activision. Are you excited for Overwatch? If you haven't bought it yet check out Amazon.com slash Overwatch to learn more about the game. What's up guys welcome to the first ever episode 71 of the Kinda Funny Gamescast. We are now two away. Okay just give up on that. When when how long do you think I can roll with it? You shouldn't have said it on episode 70. I think it's over now it's done. Episode 69 was that that that was that. And it's on to the next thing. But that's my thing I'm so nostalgic Greg. You are nostalgic. If you want to open in topic one of episode 71 was the four best moments from episode 69 that would make sense. See that's a Tim Gettys' ass move. You know we're getting numbers in the headline we're talking about bullshit. Yeah that's definitely a Tim Gettys' move. Classic Tim Gettys'. If you",
      "start": 0.0
    },
    {
      "text": "make sense. See that's a Tim Gettys' ass move. You know we're getting numbers in the headline we're talking about bullshit. Yeah that's definitely a Tim Gettys' move. Classic Tim Gettys'. If you didn't know I'm Tim Gettys joined by the coolest dudes in video games Colin Moriarty and Greg Miller. Hello it's good to be here with you today. This is the Kinda Funny Gamescast every week. We get together talk about video games a whole bunch of other shit. You can get it on YouTube.com/kindafunnygames where we break it down topic by topic Monday through Thursday. The full thing on Friday you don't have to get that on iTunes or SoundCloud or any of those podcast networks. If you want it early and if you want those goodies and if you want the authority of a pen in your hand you can go to Patreon.com/kindafunnygames throw some dollars our way you get all those things. If you want the pen you need to probably go to a Walgreens though. Is it a forward slash or a",
      "start": 41.12
    },
    {
      "text": "you can go to Patreon.com/kindafunnygames throw some dollars our way you get all those things. If you want the pen you need to probably go to a Walgreens though. Is it a forward slash or a backslash? It's a slash. I hate when people say forward slash. It's a slash. It's a Nick Scarpino thing. It's a Nick Scarpino chip. Nick won't stop saying forward slash. No one uses the backslash button. Backslash is like a made up bold thing. I know where it is on the keyboard and it's for programming I think but you don't... No one's getting confused on that. You don't use that button. It's like the tilde. Nick insists on saying forward slash as if anyone is confused. Nick is also the type of person to talk about AOL keyboards. The internet was invented or the World Wide Web was invented 3 years ago and we've been using slashes to type in URLs ever since. No one's confused about which slash you should use. No one's like... No one's like... A tilde is the... I know what it is but",
      "start": 82.8
    },
    {
      "text": "3 years ago and we've been using slashes to type in URLs ever since. No one's confused about which slash you should use. No one's like... No one's like... A tilde is the... I know what it is but what is it? What's it for? I think in math it's to approximate numbers. So they felt the need to put that on the keyboard? Yeah I guess so. What's it about? Yeah like one million you put a little tilde in front of it then it's approximately one million. I think that's kind of how it's used. Yeah. You need that kind of stuff. How many people are coming to Kinda Funny Live? Tilde 1000. Yeah. I guess you're right. You're always right. Just like Colin. Do you think Tilda Swinton was named after the little tilde? No probably not. Maybe. I'd like to hope. I don't know who that is but I hope that someone was like you know what? It made the keyboard it can make my daughter. And that's gonna be a good old time for everybody. I wanna talk about Homefront and Doom. Two first person shooters.",
      "start": 121.2
    },
    {
      "text": "someone was like you know what? It made the keyboard it can make my daughter. And that's gonna be a good old time for everybody. I wanna talk about Homefront and Doom. Two first person shooters. Yes that I have not played. Yeah. But you guys to some extent have played them. Yeah it's important. I mean I can't speak for Greg. It's important to note that I've played each of those games for a few hours. Yeah. So here's the thing. We were gonna call this the review but we're like no this is... We didn't do enough to do a review. First impressions. This is just gonna be what do you think? I've just been busy with those guys. So what I was thinking about this when you brought this topic the interesting thing about these particular games is that they're both games that had very tortured developments. And what I think... So Doom was announced all the way back in 2008. People forget about that. Doom 4 was a recording call. It was announced in 2008 and they scrapped it and they made",
      "start": 163.6
    },
    {
      "text": "developments. And what I think... So Doom was announced all the way back in 2008. People forget about that. Doom 4 was a recording call. It was announced in 2008 and they scrapped it and they made it again. And that's how we got Doom. And Homefront... I mean Homefront was so old that THQ still existed and announced this game. And people forget Montreal. THQ Montreal was developing it. Then it was kicked over to European studios like Crytek then Crytek owned it then Crytek went under started their studio went under then Crytek UK became Dambusters. And then the game was sold to Koch Media and Koch Media owns Deep Silver. And then it became an open world game. And so I thought it was interesting that these games coming out the same week really a few days apart they didn't come out technically the same week Doom came out first but that they both come from this tortured lineage. And one turned out pretty well and the other didn't turn out very well. And the one that turned out",
      "start": 200.16
    },
    {
      "text": "technically the same week Doom came out first but that they both come from this tortured lineage. And one turned out pretty well and the other didn't turn out very well. And the one that turned out well I think is Doom. And that's not a huge surprise. And the one that didn't turn out well was Homefront. And that's not a huge surprise but I think I had more expectations for it. So my... Do you think that's on a personal level or in industry level? Yeah it's a personal level I think because I just think the original Homefront Kaos Studios Kaos Studios was a very rare New York City based studio and they are the ones that made the original Homefront were shuttered even though the original Homefront sold like three and a half million copies. So I was like that's kind of bullshit. And there's actually great exposes about what happened at Kaos with the game and after the game came out on Polygon I think they wrote like a huge long form article about it. If you guys want to look",
      "start": 241.68
    },
    {
      "text": "there's actually great exposes about what happened at Kaos with the game and after the game came out on Polygon I think they wrote like a huge long form article about it. If you guys want to look it up it's really interesting. But the original Homefront was short but I think good. I think I gave it a good like seven and a half or something like that. I was solid. I enjoy the original Homefront. I'm not even a shooter fan. Yeah I like I love shooters and I love obviously these Red Dawn type games and that are kind of rare and few and far between. And I enjoyed it. I wanted more of it which is usually a compliment for a game. I thought it was very short. And then they had a multiplayer that you know when you talk about it with people they were quite into it. They enjoy I enjoyed the multiplayer. One of the rare show that I have is from the Homefront multiplayer action and which is entering a match with a full team of 1 or something like that you know I was inviting people",
      "start": 275.36
    },
    {
      "text": "the multiplayer. One of the rare show that I have is from the Homefront multiplayer action and which is entering a match with a full team of 1 or something like that you know I was inviting people from IGN. Exactly. Anyway so this game is you know I was always intrigued by this new game. And what I'm realizing from it is that it seems to be preliminarily very half baked. This is a game that clearly was tortured clearly maybe should have come out a while ago. Doesn't look very good certainly on PlayStation 4. It doesn't run very well. PC apparently is a disaster according to Jim Sterling who we trust very much. You watched that video yet? No I haven't watched it yet. It's awesome. He has this video up and he put it up at the one the Homefront embargo lifted. And I was like scrolling through because I had started on PlayStation 4 and I don't even think I got to the introduction. I was running poorly. It wasn't that I didn't want to play it anymore. It was that I was trying to",
      "start": 314.56
    },
    {
      "text": "through because I had started on PlayStation 4 and I don't even think I got to the introduction. I was running poorly. It wasn't that I didn't want to play it anymore. It was that I was trying to get through the introduction. I'm learning about where to crawl and how to do all this stuff. And it's all framey and shitty. And then my PlayStation just made the choice for me. It spit the disc out. I was like oh you don't want to play this anymore? I put it back in. I was like all right we'll play it. It's like serendipity. We'll start Ratchet & Clank. But Jim put up a review. His tweet was just everything you need to know about Homefront. And that's what he called the video. And it's just two and a half three minutes of characters running in slow motion for no reason in the game running into walls and just continuing to run in the walls. There's this female character on the ground and her neck's all distended like a worm. And he walks over it and then his leg starts to distend and go",
      "start": 352.16
    },
    {
      "text": "walls and just continuing to run in the walls. There's this female character on the ground and her neck's all distended like a worm. And he walks over it and then his leg starts to distend and go off. It's like Jesus. Yeah the game seems to be not very well made. And actually one of my major problems with it is that its story is just kind of nonsense. And I know that that's easy to say but why isn't that a complaint with the original Homefront? The original Homefront story is similar in that North Korea somehow consolidates power after the Korean War kind of becomes more powerful than South Korea because a lot of people forget that in real history North Korea was actually more prosperous than South Korea until the 70s. So North Korea was actually doing better with the help of the Soviet Union and all that kind of stuff. When that kind of stuff started to collapse North Korea obviously became the kind of bullshit place that it is right now. So this the original story suggests",
      "start": 387.92
    },
    {
      "text": "Soviet Union and all that kind of stuff. When that kind of stuff started to collapse North Korea obviously became the kind of bullshit place that it is right now. So this the original story suggests that North Korea has consolidated power and there's like an oil crisis and all these kinds of things. And I remember when I worked at IGN as I've said in the past I wrote this piece talking to ex-CIA agents about like how could this happen? This is ridiculous. How can this happen? And they walked me through like very specific things have to happen but this is how this might occur that like North Korea which can't even feed its own people instead became this military powerhouse that actually invades the United States. And I'm like OK. And I liked kind of the story. It was unorthodox but interesting in this in this new one the new one pretends that the original Homefront never happened which to me doesn't make any sense because the original Homefront sparks a revolution and",
      "start": 424.24
    },
    {
      "text": "but interesting in this in this new one the new one pretends that the original Homefront never happened which to me doesn't make any sense because the original Homefront sparks a revolution and they could have been the spark and it could have been the point in which this game began. So A that doesn't make any sense. B they rewrite the story so that there's a North Korean corporation called Apex that basically starts to dominate. They become like the Silicon. North Korea basically becomes Silicon Valley in the 70s. They create the personal computer. They create the microchip. They create smart tablets. And so it creates this whole thing and weapons. And we start buying everything from them. But mysteriously in the decades that we've been buying everything from them they've introduced back doors and all the technology and they shut everything off. And so first of all I'm like that's fucking absurd. How can no one know that that happened? Like no one knew. It's like the",
      "start": 463.04
    },
    {
      "text": "back doors and all the technology and they shut everything off. And so first of all I'm like that's fucking absurd. How can no one know that that happened? Like no one knew. It's like the Cylons getting into the fucking mainframe computers at the beginning of the battle of Battlestar Galactica. They had to at least be clever about it. This wasn't even like a clever thing. They shut everything off and now everything doesn't work. And then the North Koreans basically invade. And that's basically the foundation of the story. And there's like an economic collapse and all this kind of stuff. And I'm like all right so that's absurd. But isn't it just absurd in a different way? Because I mean it's one of those like the Homefront original storyline is a little absurd like you pointed out. Like you talked to these Cylons. Very specific things that happen. Very specific things. Yeah but this is like... This is action movie dumb don't get me wrong. But I think this is stick with me because",
      "start": 499.2
    },
    {
      "text": "talked to these Cylons. Very specific things that happen. Very specific things. Yeah but this is like... This is action movie dumb don't get me wrong. But I think this is stick with me because you're going to want to cut me off and yell at me. I loved the intro of setting it up. It was action movie dumb don't get me wrong. Of course I loved Homefront period. The original Homefront's intro was even better I thought because it was here's the geopolitical forces of how this would go and where it would go. Whereas this was just a gruff voice giving you a rundown of they made the smartphone and then they turned everything off. Like this is just Dark Angel motherfucker. So my assumption is that in the story at some point China must have been the bad guy. And if not and I feel that way about the original Homefront too. And there's like some... I guess one that was true though or maybe I'm thinking Red Dawn. Yeah Red Dawn is definitely they definitely had to change that. But",
      "start": 531.6
    },
    {
      "text": "way about the original Homefront too. And there's like some... I guess one that was true though or maybe I'm thinking Red Dawn. Yeah Red Dawn is definitely they definitely had to change that. But so because MGM was in trouble with their Chinese investors or whatever I don't know. But the story would have made way more sense if it was just China. Then you wouldn't have to have these complex geopolitical what ifs. It just makes sense. You don't have to set it up at all. This is one of those things that you get hung up on. I don't think 90 I think 90% of the players maybe 95% of the players go and just okay that's the story. And you're hung up like wait why how could they do this? And then like... I don't know that it's that small of a number. I think that if you're going to play Homefront: The Revolution especially because it's not getting great reviews you must be invested in the lore of the what ifs of a conquered United States. And I think that doesn't really make any",
      "start": 565.12
    },
    {
      "text": "Homefront: The Revolution especially because it's not getting great reviews you must be invested in the lore of the what ifs of a conquered United States. And I think that doesn't really make any sense. But that aside then you play the game. And what I realized about the game was and I don't know if Greg agrees or Greg didn't get far enough into really know is that it's a really half-baked kind of poor man's Ubisoft game. And I didn't really realize that's what it's going to be. I knew that it was open world. The game takes place in Philadelphia which I think is very cool. I think the city's well realized. There is a darkness and a direness to it to the revolution and all these kinds of things. I think that's great but everything about it is just kind of like not very good from what I can tell. And that's disappointing. The gameplay is not super satisfying. You're basically just taking over parts of maps just like you would in a Ubisoft game but it's just not as fun. The",
      "start": 600.32
    },
    {
      "text": "what I can tell. And that's disappointing. The gameplay is not super satisfying. You're basically just taking over parts of maps just like you would in a Ubisoft game but it's just not as fun. The stealth isn't as good. The gunplay is not as good. And then there's these characters and the characters just suck. And that was the one thing. There's memorable characters from the original Homefront. I still remember that one dude with the Don't Try Not Me flag shirt or whatever. He was like a nut job. And I remember that one scene in the original Homefront that I thought brought real residents when you're in the house the Resistance house or whatever and you're walking through their gardens and their makeshift farms and how they generate electricity. And it's really kind of cool insight into like there's a map about where everything is and stuff like a lot of environmental storytelling. I have not found that yet in this. No because this is the opposite of that. With the original",
      "start": 637.04
    },
    {
      "text": "into like there's a map about where everything is and stuff like a lot of environmental storytelling. I have not found that yet in this. No because this is the opposite of that. With the original Homefront okay North Koreans came in and take over and I expect it to be ramshackle. This one they come in and take over and it's very Times Square-y. There are digital signs still moving. They're clearly they've come in and given them power and it's just like well how did you get in and set this up to look pretty nice? Not great but you know what I mean? Where it is there's like digital barricades and shit like that. And like really nice armored guys who are just like what the hell happened here? It just doesn't work. And I'm going to keep playing because I hope that there's more to it than that. But I think that the reviews which are subpar to bad with rare exception are pretty probably pretty spot on. So I've just been underwhelmed by it. I thought that this was a game I was",
      "start": 672.4
    },
    {
      "text": "than that. But I think that the reviews which are subpar to bad with rare exception are pretty probably pretty spot on. So I've just been underwhelmed by it. I thought that this was a game I was going to voraciously consume because I've been looking forward to it for so long. And I'm almost glad that when I went to play it a few weeks ago the PC I was playing on didn't work and I just ended up playing it because it kind of would have jaded me I think even from that point. And it makes sense why the embargo was when it was. It makes sense that the games weren't really given out very early. It makes sense that no one really knew anything about the game. This game just I think that they I don't think it's Dambusters Studios fault. I don't think it's really anyone's fault per se. I just think this game passed through way too many hands and like way too many creative teams. And it looks old and it doesn't run right. And it's just fucking muddled. So that's my impression very early",
      "start": 708.4
    },
    {
      "text": "think this game passed through way too many hands and like way too many creative teams. It looks old and it doesn't run right. And it's just fucking muddled. So that's my impression very early in the game. Doom I think is awesome in a lot of respects. And it's fast. It's fucking crazy. It's Doom. And that's what we love about Doom. Doom's nonsense. And I think what Doom does right that a lot of games we talk about all the time is Doom delivers on what you remember the original Doom being. It's that nostalgia. So many games you go back to you're like I love this game. You play like oh this isn't exactly what I wanted. Or they reboot it. You're like this doesn't feel like it. Doom from the fucking heavy metal score to these brutal kills to running it. I was playing it and I'm way shorter than Colin. I'm two three levels in because I don't get to that. I'm only a couple levels in too. I just play very much. I'm looking for collectibles. We'll get to that in a second because",
      "start": 744.4
    },
    {
      "text": "way shorter than Colin. I'm two three levels in because I don't get to that. I'm only a couple levels in too. I just play very much. I'm looking for collectibles. We'll get to that in a second because that is great. But for Doom it was like the first big area you get into where it's kind of like all right cool. There's a million guys here. How are you going to do it? I started playing like a pop around corners and I died. It's like fuck. And I came back in the next one and it was like oh no run through this. Shotgun everyone. Stun someone. Break their neck. Run over to that because you're getting the health bonuses. You're getting the ammo off these guys. And it's meant I can't believe how well it runs. The antithesis of Homefront of so fast and so smooth. And it's so good looking. And you're running around just breaking necks doing this throwing these bodies. It's like oh shit. Now for me it was two or three levels of it. And I was like oh cool. That's what this is. And",
      "start": 789.2
    },
    {
      "text": "And you're running around just breaking necks doing this throwing these bodies. It's like oh shit. Now for me it was two or three levels of it. And I was like oh cool. That's what this is. And that's not where I am right now. It was over the weekend. I'm like that's not what I want to play right now. I ended up finally starting Ratchet & Clank and having a great time because I wanted a story and investigate these worlds and do all this different stuff. But I was playing Doom and I'm like I totally get why everybody's in love with this. And looking at Jeff Gerstmann and a bunch of other game writers and stuff over the weekend as they played and got deeper and deeper and deeper into it it was awesome to see them say I can't believe that this gets better as it goes. It gets more enjoyable as it goes. The combat loop of how you do this and how you upgrading where you go. But yeah trying to find everything. As soon as I found the first little blue Marine or whatever I was like fuck.",
      "start": 824.24
    },
    {
      "text": "I'll have to run around every one of these levels trying to find everything. The thing about Doom is that it's a game from a bygone era of shooters because shooters take themselves way more seriously now. And it's not that Doom doesn't take itself seriously because I don't really feel like the original Doom was supposed to be sarcastic like Wolfenstein was supposed to be sarcastic. We have to remember that the same studio made these games. Wolfenstein was definitely over the top and silly but Wolfenstein has important DNA because it's really the first first person shooter. And Doom was the one that really took it to a bigger scale. But I don't necessarily think it was supposed to be facetious. It was just silly. Yeah. With a metal soundtrack and stuff like that. But you're fighting",
      "start": 857.36
    },
    {
      "text": "the one that really took it to a bigger scale. But I don't necessarily think it was supposed to be facetious. It was just silly. Yeah. With a metal soundtrack and stuff like that. But you're fighting demons. There was just no context for what a shooter could be yet. I think that that is like the early 90s. We kind of understand that that's early 90s shooter personified. And then they went to Quake and all these kinds of things. The game's fidelity is really fine. Now a lot of the guys that really made the original games are obviously gone. I mean pretty much all of them at id. But it's all about fidelity. And I think that they kind of lost the plot with Rage for a lot of people. Rage was all about I liked Rage but Rage was they were like look how good it runs and look how like all these things. And they're like but yeah but it's just not fun. And I think that with Doom it's like well look how good it runs. And it's Doom. It's the classic Doom that you understand and that",
      "start": 895.12
    },
    {
      "text": "these things. And they're like but yeah but it's just not fun. And I think that with Doom it's like well look how good it runs. And it's Doom. It's the classic Doom that you understand and that you love full of demons and monsters. And the one thing that I think people are wrong about with Doom and reading some of the criticism is like it's stupid. It has no story and stuff like that. I'm like you're fucking wrong. Like I like I don't really get where you're why you're saying that there's no story. If you just run through the game into these into the from compound to compound across the red soil of Mars and all these kinds of things. But if you take the time to investigate and read the codices and read about the weapons all this kind of stuff. I was actually shocked by like like how much shit is in the like how much lore and writing is in the game. I'm not saying the story is good. I'm not saying I'm not but I'm not saying the story is bad either. I just people when",
      "start": 928.88
    },
    {
      "text": "like how much shit is in the like how much lore and writing is in the game. I'm not saying the story is good. I'm not saying I'm not but I'm not saying the story is bad either. I just people when people say like well there's it's not really a story driven game. And I'm like maybe it's not a story driven but there is a plot there. There is a story to be found. It's not just silly shooting but at the end of the day it's so fast and so fluid. And I love I mean and I've said this before this is why I love Resistance is that I love shooters with limited health with armor like no regenerating health. And I actually started as I usually do. I usually start games on hard and I started Doom on hard and I'm like fuck this. Like I'm like this is way way too hard for me right now. I'm just not in this mode. I haven't played a Doom game in a long time. So I went back and I'm playing it on normal. But I do think that there's just like nice loop there as Greg said with just",
      "start": 959.52
    },
    {
      "text": "now. I'm just not in this mode. I haven't played a Doom game in a long time. So I went back and I'm playing it on normal. But I do think that there's just like nice loop there as Greg said with just destroying enemies meleeing enemies finding these collectibles the maps are open too. And that was the cool thing that people forgot about the heritage about Doom is the open maps. Like people forget like Doom is a really important shooter. One of the most important issues ever made but Doom was huge for its time even. And actually for maybe a decade afterwards Doom was still a huge game with lots of secrets. And that's and that was found in Wolfenstein too but Wolfenstein secrets were absurd. Like you'd have to like go across walls that all look the same and just keep tapping the fucking space bar and hoping something opens in this like the map they have like really cool realized rendered 3D maps where you can go in and like see like where everything like I can spin it and",
      "start": 999.28
    },
    {
      "text": "space bar and hoping something opens in this like the map they have like really cool realized rendered 3D maps where you can go in and like see like where everything like I can spin it and like rotate it and stuff like that and see like what you're missing. I'm like pretty impressed with Doom. And it's actually the game that I've been thinking about like that. I want to go back to you because I've been kind of conflicted with Homefront and Doom where I want to play them both. And I want to see Homefront through to completion if I can because I just want to see the story but Doom is very satisfying. I definitely think that Doom and I don't want to render a final verdict on either of the games. I just haven't played enough of them but I do think Doom is delivering in a way that Homefront clear isn't delivering. Yeah. Again not being a shooter fan but having jumped into both these they Doom is the one I could see myself going back and playing when I'm in that mood. You know",
      "start": 1041.2
    },
    {
      "text": "front clear isn't delivering. Yeah. Again not being a shooter fan but having jumped into both these they Doom is the one I could see myself going back and playing when I'm in that mood. You know what I mean? When I do want to run around and blast stuff. I mean I was like that was such an awesome moment when you rip yourself off the table and you go over there and you see the suit and you put on the suit it was like that's fucking cool. And like I don't even have like a real soft spot for Doom. I love Doom II. I played a lot of Doom II back in the day but it's the one that yeah I think that's not one that's never going to get played again. I mean I will get back to that one. I'm like you know what? Fucker. I just want to fuck around for a few hours and kill stuff. Yeah. I really wish that wasn't so you know head down and Kinda Funny Live because like Doom looks like the perfect game for me right now after Ratchet and then Uncharted. This is what I want is just a fun",
      "start": 1070.72
    },
    {
      "text": "wish that wasn't so you know head down and Kinda Funny Live because like Doom looks like the perfect game for me right now after Ratchet and then Uncharted. This is what I want is just a fun shooter. So hopefully you know a couple of weeks we'll get back to it because it doesn't seem like it's that long. So it's supposed to be seven or eight hours. For me it's probably like 10 because I like to be fucking annoying and look in every corner. Just left it there. Yeah. I just like to be annoying. But I do want to say that this just reminds me of Chris a lot of people ask about books and all this kind of stuff. This reminds me that Masters of Doom is a must read video game book. Also the Bible. Also the Bible. You should read the Bible. The Masters of Doom is a game you should or a book you should absolutely look up about the creation of Commander Keen and Wolfenstein and Doom. And just reminds me of even though it's not the same id anymore but that is this id is kind of a",
      "start": 1104.08
    },
    {
      "text": "a book you should absolutely look up about the creation of Commander Keen and Wolfenstein and Doom. And just reminds me of even though it's not the same id anymore but that is this id is kind of a different id. Carmack's gone obviously. And it's just and Romero's been gone forever. It's just a great book. These guys are fucking crazy. That's that's the thing I always taken away. And even though that stamp doesn't mean the same it's seemingly Naughty Dog like Naughty Dog is a different company without its leadership there. The people that are there now are not the ones that were there in the beginning with rare exception after the merger with Sony. So but there's a spirit in that studio that never leaves. And I feel the same. I feel the same way with it. So people should go read that book. I think it's a fantastic fantastic read. Topic two. We're talking about EA. We're talking about Star Wars Battlefront. We're talking about it not having a campaign over on GameSpot. Eddie",
      "start": 1137.52
    },
    {
      "text": "book. I think it's a fantastic fantastic read. Topic two. We're talking about EA. We're talking about Star Wars Battlefront. We're talking about it not having a campaign over on GameSpot. Eddie Eddie speaking during his investor day event EA studios boss Patrick Soderlund talked about how Star Wars Battlefront while generally well received was criticized for its lack of a single player campaign. He also teased that a future installment might include a campaign. He started off by explaining it was a purposeful decision to leave out a campaign for Battlefront in part so that the team at DICE would get it out in time for the release of Star Wars: The Force Awakens. The game is based on the original Star Wars trilogy but it did have content based on Jakku a setting from the new movie. Additionally it makes sense that EA would want to get the game out in time for the film. While Battlefront was overall a success shipping over 14 million copies Soderlund said he's not pleased with",
      "start": 1179.6
    },
    {
      "text": "it makes sense that EA would want to get the game out in time for the film. While Battlefront was overall a success shipping over 14 million copies Soderlund said he's not pleased with the 75 score it has on Metacritic. Quote the one thing that we get criticized on was the lack of a single player campaign. It was a conscious decision we made due to time and being able to launch the game side by side with the movie that came out to get the strongest possible impact. I think the team created a really good game based on the premise that we had. I'd say the game was done very well for us and reached a very different demographic than a traditional EA game. So from that perspective it's a success. Are we happy with the 75 rating? No. Is that something we're going to cure going forward? Absolutely. So yeah then the game had missions. It didn't have an actual campaign. And then also he said another thing was the depth and breadth is something that's proven to be more and more important.",
      "start": 1216.4
    },
    {
      "text": "So yeah then the game had missions. It didn't have an actual campaign. And then also he said another thing was the depth and breadth is something that's proven to be more and more important. He said in a world where we want $60 upfront and we expect people to stay with us over the course of a long time the depth of what we offer is important. We have to go back and course correct that for another version if we were ever to build one. The future Battlefront game would need to offer more depth and breadth. We had designed it to be much more accessible product to a wide age group. So an eight year old could play with his father on the couch as well as a teenager or a 20 year old could play the game and enjoy it. So for the hardcore it may not have the depth they wanted in the game. So alright what do you guys take from this? I remember when Battlefront came out and we talked about it. I remember watching Greg play the game. And my original thought was this is a fucking waste. They",
      "start": 1254.16
    },
    {
      "text": "what do you guys take from this? I remember when Battlefront came out and we talked about it. I remember watching Greg play the game. And my original thought was this is a fucking waste. They built this I guess Frostbite or whatever this game is running on a beautiful DICE engine. It looks awesome. The gunplay is great. The worlds are beautifully realized and you have to play it online. And I was like that sucks. That just sucks. But you know what? Like 14 million copies of a game makes it one of the best selling games of the year easily. Last year or really over the last six months let's say not even calendar year but calendar six months. And EA can't be too disappointed. I don't think EA gives a fuck about that Metacritic score. I think that that's them saying like we can improve critically because of optics. And they've been doing a really nice job in the last few years of making them not the worst company the consumerist kind of worst company in the world anymore. Gamers",
      "start": 1289.76
    },
    {
      "text": "critically because of optics. And they've been doing a really nice job in the last few years of making them not the worst company the consumerist kind of worst company in the world anymore. Gamers first. But I think if they said like could we bump the 75 to an 80 and get 10 million copies sold? I think they'd be like fuck you guys we're good. I think it's an easy way to say they heard. They heard this because this is the one thing everyone lobbed at this game when it came out. Like when I played it and that's the thing months removed now right? What? We got to be six seven months removed from it. I still think Battlefront man I was like that was a great game. I had a lot of fun with that game. That's my reflection on it. Would I have played it longer or more if there was a single player? I don't know. Maybe but I- I wouldn't have played that campaign man. Sure. But what I'm saying for me personally I don't know if the campaign would have then cut into my multiplayer time or",
      "start": 1335.84
    },
    {
      "text": "I don't know. Maybe but I- I wouldn't have played that campaign man. Sure. But what I'm saying for me personally I don't know if the campaign would have then cut into my multiplayer time or would I have ever even touched ball in the player would I have cared? Like being a multiplayer only game for me is not a dirty word anymore. I think it definitely limits my interest in a lot of games but playing Battlefront it nailed what it needed to nail for that time. What he's talking about in the quote I should point out about a dad and son can play it or a 20 year old can sit down and play it and they can all have a great time. That's it. Kevin and I were talking about in Kinda Funny Live today. I'm like have you still playing it? He's like no but I'd like to get back to it one day. And that's how I feel. It is one of those games where if all of a sudden they dropped- if all of a sudden in Star- same day same Tuesday on PlayStation 4 some awesome expansion came out for Star Wars and",
      "start": 1374.56
    },
    {
      "text": "how I feel. It is one of those games where if all of a sudden they dropped- if all of a sudden in Star- same day same Tuesday on PlayStation 4 some awesome expansion came out for Star Wars and that's just multiplayer only and some awesome expansion came out on the- came out of The Division I would have such a better chance of playing Star Wars because I know I can just jump in and go. I'm going to jump in and be right there with every- some people have better guns than me but it won't be the end of the world. Whereas The Division like whoa what's your gear score? What's your level here? What's this that- but I'm like no did you do this pre-reclar- mission before? And I was like no you don't know if that's what it is. Star- Battlefront I think was a success. I think most people look back at it and say oh that was a fun game if they played it. If they didn't play it I think it is that they're hung up on the single player because that's what they wanted out of it which is",
      "start": 1407.04
    },
    {
      "text": "look back at it and say oh that was a fun game if they played it. If they didn't play it I think it is that they're hung up on the single player because that's what they wanted out of it which is totally fair and fine. But I don't think- it's not in the Titanfall sense of this multiplayer only game where history has forgotten it. And I think of Titanfall and I'm like yeah I did enjoy Titanfall for that month but man I never played any other stuff and they kind of screwed up this and that that that that that. I have like a laundry list of things that didn't go right for why Titanfall isn't looked back. And I'm not like man I fucking remember what a great time I had with the game which I did. And I can't wait for Titanfall but Battlefront it's like I still think of Battlefront positively and I still think about jumping back into Battlefront. Yeah. I mean I'm right there with you. I think that what you said about the multiplayer games it's not that you're not into",
      "start": 1438.56
    },
    {
      "text": "positively and I still think about jumping back into Battlefront. Yeah. I mean I'm right there with you. I think that what you said about the multiplayer games it's not that you're not into them it's just that it really needs to grab you. For me I'm totally not into it. I totally want it just a single player campaign. A single player Star Wars in that style that is really all that I need. I would have never touched the multiplayer at all. Having said that the fact that it was multiplayer only I did play it for a bit. And that's saying a lot like Star Wars is probably the only thing that can grab me in that way to make me do that. And it I had a lot of fun with it. I liked that it was accessible but I also understand that it had a limit to its depth which holds you back from really getting into it in that way. I think that you're right. It's them acknowledging the faults and it's not only the campaign but it's also the depth. And I think that this is all good signs for the",
      "start": 1475.04
    },
    {
      "text": "getting into it in that way. I think that you're right. It's them acknowledging the faults and it's not only the campaign but it's also the depth. And I think that this is all good signs for the sequel. Sure. That they heard you that they know this is what's coming they've seen that. I mean a great example of it is Poe. Poe my best friend back in Chicago doesn't own a PlayStation 4. But when I went out to Vegas to visit with him I brought a PlayStation 4 just to show him some cool shit that was on it. And I was like I have all these cool multiplayer games lined up. And he's like oh that's Star Wars game. I'm like yeah but we're not connected to the internet. We can we just played the mission the training stuff over and over again like flying the X-Wings or whatever and running through and shooting and doing all this. That's all he wanted out of that experience which is what a lot of people I'm sure wanted in this experience. Yeah. So we're supposed to be getting",
      "start": 1508.48
    },
    {
      "text": "running through and shooting and doing all this. That's all he wanted out of that experience which is what a lot of people I'm sure wanted in this experience. Yeah. So we're supposed to be getting another one this year right? Is that what they were saying at the E3 that they're talking about doing announcing that there'll be at least a... There'll probably be an expansion but Battlefront will be 2017. Yeah. I thought they had said something about 2017. Sorry. I mean this year we're getting an announcement for the next one. Yeah you're gonna get more content for Battlefront. Yeah. Yeah. Yeah. Yeah. And I mean yeah. And that's that's awesome. I think like this it's all good news. I mean it sucks last year because yeah like there was so much issue and people were really enraged with the fact that the game was so bare at first $60 purchase. And plus there was so much DLC and like day one this and that whatever. But it's like 14 million like that money's going somewhere.",
      "start": 1546.4
    },
    {
      "text": "with the fact that the game was so bare at first $60 purchase. And plus there was so much DLC and like day one this and that whatever. But it's like 14 million like that money's going somewhere. And if that 14 million gets this next one to be exactly what we do want like that sucks for the people that had to invest to make that happen. But I mean that's kind of just how this all works. But that's the weird thing right? Is I wonder this is always the thing is that in video games which is very which is very interesting is that everyone has an opinion about every game. And I always feel like it's always like when somebody wants to talk shit about DC Universe Online but didn't play DC Universe Online. They've just seen it from the outside. How many of the 14 million units sold are like me? Where I look back and I'm like I had a lot of fun. And how many are the rest of the industry who didn't buy it? We're like oh no single player no sale. That's stupid. I don't know if",
      "start": 1576.24
    },
    {
      "text": "are like me? Where I look back and I'm like I had a lot of fun. And how many are the rest of the industry who didn't buy it? We're like oh no single player no sale. That's stupid. I don't know if there's people and I'm sure that of course there are I don't know how large the percentage of people who bought that game and were like oh this sucks. And I mean I saw the tweets and I know this happened. I know John Boyega tweeted about wanting single player and all this different stuff. Like I get it. And I know you're out there but I mean I think there's enough informed consumers that bought it and were like I'm getting I got what I want or what I thought I was going to get. I also think there's a difference too between wanting single player and being upset about what you got. You know what I mean? I think that like I was going to your point where you're like well it sucks for them. And I'm like well for the people that suck for are they the ones who bought it? No for",
      "start": 1611.36
    },
    {
      "text": "know what I mean? I think that like I was going to your point where you're like well it sucks for them. And I'm like well for the people that suck for are they the ones who bought it? No for sure. That that is a totally valid point. I mean the thing is that EA is not disappointed in this game and for context and this is only because they renounced numbers recently like battle. So I just these numbers are fresh in my mind. Battlefront sold more than Dark Souls one two and three combined right? These are games that are like critic that are like critical darlings and that like hardcore gamers love and stuff yet and are not for everyone. Obviously I'm not throwing shade in any respect to Dark Souls. It's just those numbers are in my mind where Battlefront having been out six months against a series that is beloved by core gamers outsold it even though people had all of these complaints about it. So it's and it's a Star Wars game and it has commercials. I'm not saying",
      "start": 1645.04
    },
    {
      "text": "months against a series that is beloved by core gamers outsold it even though people had all of these complaints about it. So it's and it's a Star Wars game and it has commercials. I'm not saying that all things are created equal. All I'm saying is that context is really important. 14 million copies is a fucking lot. And even if even if half of those people liked the game a lot they're in great shape for the sequel. But I do think it's you know there's some confusion with what EA is going to do with Star Wars. That's why I think it's somewhat of a strategic error that they didn't have some sort of B tier single A tier Star Wars game attached to the movie that should have come out at the same time. And that's what I predicted for a long time that they were going to do. And it makes you wonder if that was the intent at some point because they obviously admit that they could have done a single player campaign but didn't to make it out come out with the same time with Force Awakens.",
      "start": 1677.12
    },
    {
      "text": "you wonder if that was the intent at some point because they obviously admit that they could have done a single player campaign but didn't to make it out come out with the same time with Force Awakens. So it makes you wonder like what kind of pieces were being moved behind the scenes. But with DICE is kind of mixed heritage of multiplayer. And then actually they're they have a single player heritage. It's it's it's interesting to see like what they can do with that particular franchise moving forward. But this fills a vacuum in between like what Respawn's going to do with Star Wars which my assumption is going to be very Titanfall probably not Titanfall literally but probably a third person online shooter with some sort of campaign component and then Visceral heritage of like narrative driven games. And I doubt that that Visceral game will have an online component at all. So they have like these voids filled with the Star Wars licenses pretty well. And it's the one cool",
      "start": 1707.6
    },
    {
      "text": "narrative driven games. And I doubt that that Visceral game will have an online component at all. So they have like these voids filled with the Star Wars licenses pretty well. And it's the one cool thing. And the one thing I credit EA for is that they're at least putting quality first. Like Battlefront was in no way shape or form anything but a good game. It's just not my kind of game. And I do think that it was a waste. Like having seen how beautiful that battle path was for instance how chaotic it was on my man. This is I know we've done this so many times but I could do this again. I can do this every few years really with these iconic battles. So you know I'm interested to see what the campaign is. I'm totally going to play the campaign in Battlefront II. And I hope it's awesome. I hope it's long. I hope it's 15 hours long. It'd be awesome. Oh my God. That sounds so so damn good. Cause that's the thing that yeah the presentation of this game is so immaculate that I",
      "start": 1742.64
    },
    {
      "text": "I hope it's long. I hope it's 15 hours long. It'd be awesome. Oh my God. That sounds so so damn good. Cause that's the thing that yeah the presentation of this game is so immaculate that I mean even even a nine hour experience with this I'd be like over the top excited about just cause like you're right. Like we're getting these other games as well. So it's like when you look at it as a whole man it's good ass time to be a Star Wars game fan. So yeah things are things are moved. I mean it's we haven't when we really think about it we have the great Star Wars PC games the X-Wing TIE Fighter Dark Forces. I mean people love those kinds of games and those are great games. Those are some of the few PC games I've actually really played and enjoyed when I was a kid because I was such a Star Wars dork. But then you had like the Super Star Wars games which I think were actually like really great games too on Super Nintendo. But after that like we",
      "start": 1777.28
    },
    {
      "text": "I was such a Star Wars dork. But then you had like the the JVC like Super Star Wars games which I think were actually like really great games too on Super Nintendo. But after that like we really didn't get anything worth a damn with rare exception. Like KOTOR was an exception. But you got like mass terrace or you got like yeah power battles. Yeah. Like you have a lot of like nonsense that didn't really respect the IP and the ones that didn't respect the IP really didn't respect it or went in their own direction with their own war like what Obsidian did and stuff like that. So it's cool to just see like studios that seem to understand it take it a little more seriously ground the game ground the games a little bit more into genres that we understand. Part of that Disney push we were talking about. The one thing that I would love is and one thing I hope is really in the works although it's not an EA so this is the complication is that EA is basically publishing all the",
      "start": 1815.36
    },
    {
      "text": "we were talking about. The one thing that I would love is and one thing I hope is really in the works although it's not an EA so this is the complication is that EA is basically publishing all the Star Wars games now. And this is not something that EA would be known to do because EA doesn't make role playing games typically with the exception of you know they have their BioWare studios making Dragon Age and Mass Effect but not they're kind of doing their own thing in BioWare might be muddling around with Star Wars whatever. But I would love to see them do another KOTOR. And that would be complicated because who owns the IP to that like Knights of the Old Republic? I don't know like where that falls in with Lucas and all that kind of stuff. But it would be cool for them to commit. I guess what I'm saying is it'd be cool for them to commission a studio outside of their own RPG realm which really is specialized in BioWare. And go to Obsidian or something and be like we",
      "start": 1855.52
    },
    {
      "text": "commit. I guess what I'm saying is it'd be cool for them to commission a studio outside of their own RPG realm which really is specialized in BioWare. And go to Obsidian or something and be like we are going to invest a lot of money in many years into you guys making a proper single player Star Wars role playing game. I think would be really cool in time for maybe the third film even you know really have a long kind of game and play the long game with it. I think it would be really fun and then let BioWare kind of mess around with their own IP because I think that's kind of their strength. I just don't want in other words I don't want like EA to become taking all of their studios and be like everyone's working on Star Wars now. It's like that's fucking boring. I'd really be bummed if BioWare like was just pivoting away from that kind of doing their own kind of thing. So they have to start looking at some maybe second party kind of type relationships to get something like that.",
      "start": 1892.4
    },
    {
      "text": "if BioWare like was just pivoting away from that kind of doing their own kind of thing. So they have to start looking at some maybe second party kind of type relationships to get something like that. And I think that a deep role playing game would be a good way to go. I agree completely. This topic brought to you by Squarespace. Whether you need a landing page a beautiful gallery a professional blog or an online store it's all included with your Squarespace website. Let's go through a bit of the features. Let's do it. Why don't we do they have the .com? Is that a feature? You can get a .com you can get a free custom domain. Actually Squarespace makes adding a domain to your site simple. If you sign up for a year you'll receive a custom domain for free for that entire year. It's very easy to do. Obviously we've been over this before. Creating a website with Squarespace is a simple intuitive process. You can add and arrange your content and features with a click of a mouse. I'm",
      "start": 1924.96
    },
    {
      "text": "easy to do. Obviously we've been over this before. Creating a website with Squarespace is a simple intuitive process. You can add and arrange your content and features with a click of a mouse. I'm talking about beautiful templates. Greg designed a best in class online store with Squarespace's award-winning templates customizable settings and more all without a single plugin. I'm happy about that. Plugins are what complicate everything Colin. I don't know if you're familiar with this. Nick made the original Kinda Funny website. No plugins necessary. He made it with Squarespace. He used Squarespace. He built it beautiful. It was a very beautiful website that we used for a long time. You can start your free trial today at squarespace.com and enter code Kinda Funny to get 10% off your first purchase. Squarespace set your website apart. You should. You should. Beautiful. You definitely should. Jack. I need to make a note for Kevin here. There we go. Say hi. Just say hi. Hi Kevin.",
      "start": 1968.64
    },
    {
      "text": "first purchase. Squarespace set your website apart. You should. You should. Beautiful. You definitely should. Jack. I need to make a note for Kevin here. There we go. Say hi. Just say hi. Hi Kevin. Yeah. It's time for topic number three. Unsurprisingly I want to talk about Nintendo. Nintendo movie plans. Oh God. Things are happening. Things are a brew over in Nintendo land. Over at IGN Alex Osborne writes Nintendo President Tatsumi Kimishima confirmed the company has plans to produce feature films and is exploring a production system in which we can do as much as we can ourselves. Kimishima did not give a specific timeframe as to when the company plans to release its first movie only saying quote the first title won't be ready this year but it also won't take five years. Oh he also noted that Nintendo isn't interested in producing live action movies with Kimishima citing the 1993 Super Mario Bros. film as the main reason why the company is leaning towards anime type content",
      "start": 2003.44
    },
    {
      "text": "noted that Nintendo isn't interested in producing live action movies with Kimishima citing the 1993 Super Mario Bros. film as the main reason why the company is leaning towards anime type content when Nintendo should produce as much by itself as possible. And instead with regard to which Nintendo franchise may be adopted he refused to specify. This isn't the first time Nintendo has expressed interest in the movie business. Last year Miyamoto said the company's open to movie adaptations based on its stable beloved characters. In fact legendary game designer really reached a batch of Pikmin short films in 2014 the same year during all those Sony leaks a hack revealed that Spider-Man producer Avi Arad was in negotiations with Nintendo to produce an animated Super Mario Bros. movie which would have been through Sony Pictures and that would have been interesting. And then last year there was those Netflix rumors about the Zelda series that are not panning out. What do you think?",
      "start": 2054.96
    },
    {
      "text": "which would have been through Sony Pictures and that would have been interesting. And then last year there was those Netflix rumors about the Zelda series that are not panning out. What do you think? Good luck. I don't know. My concern is are they all going to be like direct to DVD movies? Are they going to be real movies that come to a theater or are they going to be Netflix projects which would be cool too? There's a bunch of cool ways to do it but there's so many different ways for it to go wrong. You figure the Mario they're going to do a Mario one. They have to be looking at Mario. But I think when you talk to us and you talk to other people who are probably watching this core gamers you're jumping to man a Zelda movie would be awesome. Maybe a Metroid movie would be awesome. Taking these worlds that are cool but don't get super fleshed out with story and giving them and giving them characters and letting them go. They talk about anime style Legend of Zelda anime would",
      "start": 2090.16
    },
    {
      "text": "Taking these worlds that are cool but don't get super fleshed out with story and giving them and giving them characters and letting them go. They talk about anime style Legend of Zelda anime would be awesome if done right. But then just a CG movie of Legend of Zelda in the theaters would be fucking rad too and it would set the world on fire if you gave it the real promotional push and the right writers and the right director. It's similar to what we're talking about with Disney and how they're partnering with the best people for the best IPs. If Nintendo was like all right cool let's go. And they wanted to do some of it in-house which is the one that's like it'd be cool. What if you went to Pixar and were like let's fucking make a Nintendo movie which property do you want to do? Or do you have some kind of goofy idea to bring them all together? I think the in-house thing is a good thing. I think that what they're talking about is not necessarily doing the movie stuff but it's",
      "start": 2130.96
    },
    {
      "text": "do you have some kind of goofy idea to bring them all together? I think the in-house thing is a good thing. I think that what they're talking about is not necessarily doing the movie stuff but it's more about the writing and the characters and the story and all of that stuff. Recently they did the launch for Star Fox Zero. One of the few good things about that game was the anime that came with it. It was fucking awesome. I was like how did you nail this so well? How did you get the characters? And like And that was written in-house or done everything in-house? I don't know the exact things but I mean I know that Nintendo made it. They commissioned other people to work but I mean it was a Nintendo project. They had it planned out. I mean I imagine that this is what they're talking about. They're not talking about hey we make video games. Now we're making movies. I think it's more like you know they would be producing the project commissioning out other people that have the",
      "start": 2166.48
    },
    {
      "text": "They're not talking about hey we make video games. Now we're making movies. I think it's more like you know they would be producing the project commissioning out other people that have the skills and resources to do it. I know the anime the Star Fox one was made by like real anime houses that were Bleach and all that Naruto and all that stuff. And I really loved that. And I thought it was amazing. I'm like man if I was little I mean I loved it now but like if I was little that's the type of shit that like I remember Nintendo Power would come with like comics every once in a while like a Metroid comic or Star Fox comic. And I was like fuck this is this is awesome. And this the anime is like really one of those things where I'm like man I never thought that I'd see this type of thing. And I think that now we're finally at a place where media is is so making videos isn't a big deal. You know we're almost at a point that making movies isn't a big deal. Like people",
      "start": 2199.2
    },
    {
      "text": "type of thing. And I think that now we're finally at a place where media is is so making videos isn't a big deal. You know we're almost at a point that making movies isn't a big deal. Like people can just do it. Like we could make a movie right now if we wanted to with the camera would be good. That would be good but whatever you know a couple of years ago we couldn't do that. Colin Does Dallas. Oh yeah. I'd like to see that shit. So I think that there's also been a lot of other rumors about Nintendo talking about making actual anime series and will it go on Netflix or this or that whatever the distribution it gets weird. So when you say the real movie or direct to DVD direct to DVD at this point is even more of an insult than it used to be. Yeah it is. And that's why I just don't want Aladdin 4: Jafar Needs Glasses. I want like a real goddamn movie. Okay. First off do not talk shit about Return of Jafar or King of Thieves both fucking awesome movies. There was no",
      "start": 2238.24
    },
    {
      "text": "don't want Aladdin 4: Jafar Needs Glasses. I want like a real goddamn movie. Okay. First off do not talk shit about Return of Jafar or King of Thieves both fucking awesome movies. There was no Aladdin for if there was I'm sure it would be horrible but two and three were dope as fuck. But I think that when Nintendo it's like yeah if they did direct to DVD that would be an issue. But it's like if they made a Netflix movie I think that could be really cool really good even. And I think that we're in a in a place right now in 2016 when you look at CG movies like it kind of sucks. The Ratchet & Clank is seemingly not what it could have been. Yeah. And it seems that it's awesome but it missed the mark of the game of what made the game special is I didn't from I didn't see it but from reading the reviews it seems like it didn't kind of use any of the inventive weapons or kind of really hit on that level of the that's a big part of the game. What is Ratchet? What is",
      "start": 2274.16
    },
    {
      "text": "it but from reading the reviews it seems like it didn't kind of use any of the inventive weapons or kind of really hit on that level of the that's a big part of the game. What is Ratchet? What is Ratchet & Clank? And they they missed the the mark on that. I think that it's a little bit easier to to nail that with Mario and stuff because I feel like Mario is a little simpler than Ratchet & Clank in that regard. It is him trying to rescue the princess. That's the narrative. There's not that element that you can miss. You know what I mean? I get I worry about fleshing it out enough to make it a full blown movie. That's the thing is like right now Princess Peach and Mario aren't in depth characters. There's not a lot of depth to them when you play these games right? It is like Hey Mario I'm making you a cake come over. And then she gets kidnapped and then we go through all these worlds. Right. But there's potential there but I worry if Nintendo's there holding on too tight",
      "start": 2317.76
    },
    {
      "text": "Mario I'm making you a cake come over. And then she gets kidnapped and then we go through all these worlds. Right. But there's potential there but I worry if Nintendo's there holding on too tight do we ever get that potential where we're getting into who Mario is and all this stuff? And they're like well no we don't need to know that. Just get them out there. Bowser's made this thing and floating castle. But I think that's where it's at though. I mean I think that we'd be crazy to think that we're going to get a fleshed out Mario movie that like I just want to know his motivation. I want to know what his drinking problem. I think the margin it needs to be simple. It needs to be a kid's movie. You know it's like in that movie that needs to make a lot of money so that they can then make the the Zeldas or the Metroids or whatever. I honestly I think that the best foot forward would to be to make the Nintendo movie. Yeah. I totally agree with you. Make the Lego Movie of the",
      "start": 2356.48
    },
    {
      "text": "make the the Zeldas or the Metroids or whatever. I honestly I think that the best foot forward would to be to make the Nintendo movie. Yeah. I totally agree with you. Make the Lego Movie of the crossover. That's going to end in 10. It's Sonic. Don't call it Smash Bros. but it's Smash Bros. It's all the characters. Like if they just did the plot of Super Smash Bros. Brawl the single player campaign um and made that into a thing. There's some bad guy who doesn't matter who the fuck it is. All the bad guys are getting together and fighting and then all the good guys come they're all introduced. They first they're kind of fighting but then they join up to beat the bad guy. So just don't ruin the trailer. Cause everybody will act like that was going to be a big reveal that the good guys were going to get together at the end. I think that I mean I'm a little more bullish about this thing Greg. I think this is like an obvious win for them. And it's shocking that they really I",
      "start": 2388.0
    },
    {
      "text": "guys were going to get together at the end. I think that I mean I'm a little more bullish about this thing Greg. I think this is like an obvious win for them. And it's shocking that they really I mean I know that they really got burned with the Mario game movie like you know a long time ago and and that they've been like really quite siloed away from kind of the realities of entertainment and they've been very prideful and they've been very insular with their IP. But I think that you know this can go in multiple ways. And I think that all of the ways are pretty positive for them. They could do they could invest in a Pixar-style Mario movie. And what would even be more interesting is if they really got in a bed with Pixar or they really got in a bed with DreamWorks or one of these big studios and was like you guys do it and we'll like we'll license it and we'll we'll we'll green light it. But like a studio that has talent that's going to be published by Disney or",
      "start": 2428.24
    },
    {
      "text": "of these big studios and was like you guys do it and we'll like we'll license it and we'll we'll we'll green light it. But like a studio that has talent that's going to be published by Disney or something like that. And you have a whole marketing arm a whole marketing empire kind of behind it. I think that that movie can't lose. Even if it's bad I don't think that that like a Mario movie like that can lose. I don't think they'll do that is my thing. I think Nintendo's too stubborn for this. I think maybe things are changing though. I mean I think that there's and that's the thing is I think I would agree with you except for the last year or so or the last 18 months they just are a little different now and or they're changing. I don't know if it's fast enough. I don't know if it's too late but I really think that it's they're changing. The smartphone games is a really great sign that while they're not for me and I don't give a flying fuck about these games like Miitomo but",
      "start": 2462.08
    },
    {
      "text": "too late but I really think that it's they're changing. The smartphone games is a really great sign that while they're not for me and I don't give a flying fuck about these games like Miitomo but a lot of people do. And this is probably the direction you need to go in especially for the native market in Japan. And I think that when you really think about what would be I think the smartest and boldest move for them and what I think would be a really exciting second or so like secondary maybe even tertiary move once a Mario movie comes out or a Pokémon movie or whatever it might be would be. And I know that they've done Pokémon movies but you understand what I'm saying? Pokémon really was the last big marketing fucking shotgun blast right? When you really think about it like card game cartoon movie all these kinds of things like they really were all on board with that kind of shit. So there is that. But is I think Metroid obviously the one that's ripest for the for for",
      "start": 2500.88
    },
    {
      "text": "game cartoon movie all these kinds of things like they really were all on board with that kind of shit. So there is that. But is I think Metroid obviously the one that's ripest for the for for the picking in terms of real storytelling a real movie with real people in it not a cartoon. And this is one of those things where you can make us you could almost reverse engineer Metroid to be something that everyone's like what the fuck is Metroid when they're in the movie theater and they realize like wow this is a game series from the mid-eighties. This is awesome. Stars a female kind of heroine. You know she's she's sexy but she's badass and she's fucking killing all these monsters. Scarlett Johansson. Yeah. You could it could be someone like that. I mean hopefully not. But but so to me it's like I would love to see them do something bold like that because I think everyone kind of defaults to like well Mario and Pokémon. And I'm like well all right those make",
      "start": 2534.64
    },
    {
      "text": "but so to me it's like I would love to see them do something bold like that because I think everyone kind of defaults to like well Mario and Pokémon. And I'm like well all right those make sense. You can even do something with Donkey Kong. You do something Kirby. It doesn't matter. Like those are cartoons. Then you have something like Zelda which I think is dangerous because what we really are losing sight of with Zelda. And I say this is a huge Zelda fan is Zelda has no fucking story. So I don't think you really want to go in that direction and like shoehorn things into a silent protagonist and all these kinds of things. It's just not going to I think people are going to look at it and be like this isn't but I mean that's what I'm telling you. The same thing with Zelda is the same thing. I think with Metroid I think Zelda has a better shot of it of being the one you put out there that is different Link talks in this. It I think the story makes sense in the terms of",
      "start": 2575.12
    },
    {
      "text": "the same thing. I think with Metroid I think Zelda has a better shot of it of being the one you put out there that is different Link talks in this. It I think the story makes sense in the terms of you have to unite all these artifacts that are spread out throughout these dungeons or whatever. And that's why you get all these different cool areas to go into fight meet new characters raise up this army or whatever. But that's the one like we always talk about in the way of like I think the echo chamber core audience whatever you want to call it gives out there so much credit that it's a big deal to us. So it should be big deal. It must sell millions and millions and millions copies. And it does it does fine. Does well we're all excited about it. We love Zelda but I think that could be the one where you get that in front of people and like the people who had no idea what Lord of the Rings were before Lord of the Rings came out you could see people going like that trailer",
      "start": 2603.52
    },
    {
      "text": "could be the one where you get that in front of people and like the people who had no idea what Lord of the Rings were before Lord of the Rings came out you could see people going like that trailer looks awesome. And he's fighting that one eyed spider and this is happening and he's fucking knocking lightning bolts or whatever back at this red headed dude. I could go see that movie. Zelda doesn't have the residents but Zelda has and I don't want to say Metroid doesn't have the respect cause I'm a Metroid fan but Zelda has like a je ne sais quoi about it where people it's a little sacred to people I think. And like I think it is what it is. And I think the Metroid what I really want to see them do with Metroid and that's why I'm confident Metroid is in an excellent title as well is that they kind of probably realized that I mean you want to sit talk about Zelda not selling great. I mean a good example is like Skyward Sword was outsold by Uncharted 3 which to me was like",
      "start": 2632.72
    },
    {
      "text": "they kind of probably realized that I mean you want to sit talk about Zelda not selling great. I mean a good example is like Skyward Sword was outsold by Uncharted 3 which to me was like unbelievable considering the install base concerning the residents of Zelda considering that we hadn't you know people were not too happy with Twilight Princess but it seemed like Skyward Sword just like didn't really do it for people sold 4 million copies I think. But it with Metroid Metroid sells way worse. And that's why it's exciting because now they can have this thing where it's like Nintendo fans are excited about the dorks and the nerds about Nintendo excited about it. But then like they show it in the theater and it's got fine production value and it's a hundred million dollar movie. And it's all these kinds of things and it's Metroid for a whole new generation or just a whole group of people that have no idea what the hell Metroid is but it's a movie they can enjoy without",
      "start": 2668.56
    },
    {
      "text": "And it's all these kinds of things and it's Metroid for a whole new generation or just a whole group of people that have no idea what the hell Metroid is but it's a movie they can enjoy without any context for the games. And I think this is a great backdoor into like revitalizing that series and then figuring out what you can do with these IP that make a lot of sense. So I really feel like what I'd be most excited about is yeah Mario movie will be interesting. I think they can I think that'd be easy. I don't think there is a plot problem there. I don't think you have to have a plot. That's like really very deep. I think you can do something like I said cute with Animal Crossing or whatever you want to do. But I think Metroid is the one where they can make a serious good movie and they can really reap benefits from it that will reach back into their catalog and allow people to play those games again and realize that those games are great and let them kind of let Retro or another",
      "start": 2702.72
    },
    {
      "text": "can really reap benefits from it that will reach back into their catalog and allow people to play those games again and realize that those games are great and let them kind of let Retro or another studio kind of run with the series and tell us and give us a different look at Nintendo something that's dark and serious. I mean they've had this series since the very beginning of the NES. So it's not like this is a new thing for them but see that's like wave four or wave three or four though. Cause it was secondary or tertiary. Well I mean it'd be Mario and then it would be Zelda cause Zelda starts to deal with that where it gets darker but it's so bright and so light and you can't enjoy it. And it's not all scary times. And then yeah but I don't think we'll ever get to that. Yeah no I mean I mean it's this whole thing is crazy because so I mean they're talking about not doing any live action so it would all have to be cartoon. That's what I saw. And that's what I'm saying",
      "start": 2737.04
    },
    {
      "text": "I mean I mean it's this whole thing is crazy because so I mean they're talking about not doing any live action so it would all have to be cartoon. That's what I saw. And that's what I'm saying is like my my hope is that they realize that that's probably a mistake. I just don't know if it is but I agree with you that a live action Metroid would be awesome. I don't necessarily think a live action Zelda would would work that well. I think that a CG one could. But I just think that it's it's too hard to do that. Right. Is my problem is like it's like Lord of the Rings. Yeah. If it's Lord of the Rings fuck. Yeah. But it's not going to be. And I think if it was a Netflix show like we said a long time ago I'm totally cool with that. Cause there's a different level of quality associated with that and you have more time to explain things and the budget is just different. If a Zelda live action movie was in theaters I can't imagine it looking right or feeling right. And I think CG",
      "start": 2769.2
    },
    {
      "text": "with that and you have more time to explain things and the budget is just different. If a Zelda live action movie was in theaters I can't imagine it looking right or feeling right. And I think CG and I think that I mean that's where I'm doing with the Zelda movie. I'm not jumping out into live action. I'm staying away from that in general with my pitches or whatever. But the problem is that I just and I think it would have a better shot just in the fact of like when a kid's movie comes out I just don't give a rat's ass. And so like when Mario comes out I know it's going to be a kid's movie unless they're getting into his drinking problem. And then you but it's like when that comes out it's just like that's not doing anything to push it forward. I think it's all the movie can go both ways. It can it does expand out. You've seen the one I Gene put up the fake trailer for the Zelda movie like the way everyone freaked the fuck out. Yeah. It was still be there. Yeah. But I",
      "start": 2808.64
    },
    {
      "text": "go both ways. It can it does expand out. You've seen the one I Gene put up the fake trailer for the Zelda movie like the way everyone freaked the fuck out. Yeah. It was still be there. Yeah. But I think and I totally agree with you. I think a CG Zelda is is the right move but a perfect example of what I'm saying is that is all the trailer. If you look at it now I mean it's it's shit. It's really like it looked it's as excited as you were back then. It was more of the idea right? Somebody's doing this back then it was novel and fresh and that was crazy. But now it's like Oh God this is really rough. You saying Pokémon I don't even know why. Like I didn't even that didn't come to mind. Like the Pokémon movies it's different because Pokémon is a cartoon you know already in there. Like those movies were I don't look at them as video game movies. They're they're cartoon movies. You know what I mean? Sure. But that was just my example of the really the only time since",
      "start": 2842.64
    },
    {
      "text": "there. Like those movies were I don't look at them as video game movies. They're they're cartoon movies. You know what I mean? Sure. But that was just my example of the really the only time since Captain N where they which was like what I grew up with where they were like let's just do it. You know like like everything like cause you know you were young or maybe not even born but like there was a Nintendo at one time that was like all about merch and all about licensing. I had fucking Legend of Zelda cereal. I had Super Mario Bros. cereal. I had a fucking Zelda lunchbox. I had all these things that just are unheard of really. Unless you go to like the Nintendo store or something like where these were quite ubiquitous when I was a kid and Pokémon to me and like from like 98 99 until like the early two thousands. That was an example to me. I mean I remember I had my Team Rocket action figures just on my computer monitor and I was like this is I would never be able to",
      "start": 2873.76
    },
    {
      "text": "99 until like the early two thousands. That was an example to me. I mean I remember I had my Team Rocket action figures just on my computer monitor and I was like this is I would never be able to even get my hands on something like this unless I went to Japan unless I went to like like specialty shops or got my Funko power or whatever like whatever it is. In other words these were just more ubiquitous. I had my Zelda figures. I had like all of these kinds of things. And I think you're off about that. Like if you go to a toy store or even a target Nintendo takes up a surprising amount of like the action figure. I only see amiibo when I go to these. Besides amiibo. Non-video game stuff. Like there's there's like it's surprising me that there's so much Diddy Kong action figures and Samus and Link. But I mean it's it's pretty it's way more way more expansive. I thought like there's Star Fox and stuff like that's pretty cool. But yeah I didn't know that. What I'm saying is",
      "start": 2918.48
    },
    {
      "text": "Samus and Link. But I mean it's it's pretty it's way more way more expansive. I thought like there's Star Fox and stuff like that's pretty cool. But yeah I didn't know that. What I'm saying is like they really were all about like pushing an IP with Pokémon and that made sense. And they they made a lot of money. And I just think it's see Nintendo needs to change. And I think that they're starting to realize that they need to they have to leverage their IP and their licensing. They are just not going to be the Nintendo that they were ever again. And anyone who thinks that that's going to happen is wrong. They're done in that respect. Like they're not going to be this powerhouse of 50 million 70 million 80 million a hundred million selling consoles. It's not going to happen anymore. So you need to you need to figure out ways to like leverage those things. And since they refuse to go third party which would be obviously the salvation of that company obviously I think that",
      "start": 2952.24
    },
    {
      "text": "So you need to you need to figure out ways to like leverage those things. And since they refuse to go third party which would be obviously the salvation of that company obviously I think that they have to start like getting really comfortable with just heavy licensing. The fact that there's not like a Nintendo like theme park in the United States or like that they haven't buddied with someone in an intimate way whether it was Universal whether it was Disney whoever they're working on it. Oh they are. Okay. So oh yeah that's right. That's right. So like the fact that like why did that happen in 1990? Yeah. Like this is what I'm saying. Like why didn't like why isn't there a Nintendo channel? Like a really like like on television like why didn't they like become this ubiquitous thing? Like they just let it go. And I don't and it's just kind of it's kind of crazy how this company really like the like the the Q Score kind of aspect of this company has changed so much",
      "start": 2995.92
    },
    {
      "text": "thing? Like they just let it go. And I don't and it's just kind of it's kind of crazy how this company really like the like the the Q Score kind of aspect of this company has changed so much I think in a way Mario and and they just kind of like threw it away. And they the the thing is that they have this IP and they're always going to have it. And so they should leverage it in as many ways as possible. And I think that's going to be smart for them to do. I think that a Mario movie made by Pixar would make hundreds of millions of dollars in profit. And I think that allowing them to do secondary and tertiary moves like making a Metroid movie and taking risks. Because I'll tell you right now all the people that are talking about how much money they have they can't take too many risks. They if they start dumping money into these projects and they fail they're going to have no money. So I don't know. It'll be interesting to see how it all pans out for them. I'm rooting for",
      "start": 3030.32
    },
    {
      "text": "risks. They if they start dumping money into these projects and they fail they're going to have no money. So I don't know. It'll be interesting to see how it all pans out for them. I'm rooting for them. But I and the crazy thing we're talking about with distribution platforms is like what if the NX is the distribution platform? I hope not. I think that that's a that's a bad move. I mean they need your what you're saying is right. They need to use their IP to get out to different people to have them come back for the games. I think the CG routes amazing. I wish that Pixar would be involved. They're not going there and Disney's not going to be involved. They have too much going on. They have to make their own movies. DreamWorks. Absolutely. I think this is something that would be right up there. Their allies a whole bunch of other smaller um Jack Black is Mario. I mean absolutely. I mean that's I can totally see that type of shit happening. And like again like it's not",
      "start": 3070.72
    },
    {
      "text": "up there. Their allies a whole bunch of other smaller um Jack Black is Mario. I mean absolutely. I mean that's I can totally see that type of shit happening. And like again like it's not like I'm looking forward to the Mario movie. Like that is going to be the kid's thing. But I think that the the smartest call for them would be to do a Nintendo Lego movie style thing. Um Pokémon even if they did a Pokémon movie that wasn't related to that the cartoon I think that could obviously kill. I think that is the easiest win for them besides just Nintendo straight up. Mario's going to perform super well. I think Zelda is the next choice after that. But I love the idea of a Nintendo Cinematic Universe that uh I actually think would work with DC's planning but in a way the DC's I don't think is kind of working out where if they started with the everyone's here and then kind of split her out split her out in a way that they're not splitting me out to then re team up again it's",
      "start": 3101.36
    },
    {
      "text": "think is kind of working out where if they started with the everyone's here and then kind of split her out split her out in a way that they're not splitting me out to then re team up again it's more just like you go off in your own universe. Exactly. It's just like here's introducing like everybody knows these in term Nintendo characters. Might not know that eight Fire Emblem characters you might not know um Captain Falcon or whatever but here they are. And then if they ever get their own thing whether it's a movie or a a 10 minute anime short on YouTube or a Netflix series or a one off special whatever it is like I think that they have so many IP that work together in a in a way that we've seen with Smash Bros. Like we can see these things that should clash somehow not clash because the Nintendo that's something unique to Nintendo and Disney. I can't think of many more other people like that. So I I'm I'm excited by this but it's the same type of thing where I'm",
      "start": 3142.64
    },
    {
      "text": "because the Nintendo that's something unique to Nintendo and Disney. I can't think of many more other people like that. So I I'm I'm excited by this but it's the same type of thing where I'm like I remember when we heard about Crazy Taxi movies that never happened. We've been hearing about Metroid movies for 0 years you know and like that should never happen. So we'll see how this goes down. That show about one. That show about fan films. Yeah. I mean we've gotten so many fan films. I think that's actually like a bigger issue with this. And that's what I'm saying about the live action stuff is that I think CG gives this shit a chance because live fan films have already let us see what these things could be in real life. Right. So it's like unless they are super high budget and even then then we're getting Transformers. You know it's like I think the CG is the right route because it's the only way that these things can really work and actually impress us. Otherwise we're",
      "start": 3182.48
    },
    {
      "text": "even then then we're getting Transformers. You know it's like I think the CG is the right route because it's the only way that these things can really work and actually impress us. Otherwise we're going to get let down a hundred percent. We're just going to get a Splatoon movie. That is true. Yeah. I mean if they made a Splatoon like cartoon that went like maybe not a movie but a cartoon. And then if that led into a movie I think that they can turn that into a fucking franchise. Not for me but for some motherfuckers out there parents parents kids parents loves what's in absolutely. All right. As always final topic of the day brought to you over other Kinda Funny forms. Go to kindafunny.com/Gamescast topic. Hold on. I got anemic note. Make a note to Kevin again. Dear Kevin it's been 18 minutes since I last talked to you. Ryan Muraski says what do you think Rocksteady's up to now? Do you think they'll make a new IP? Good question. Oh that's a great",
      "start": 3224.32
    },
    {
      "text": "again. Dear Kevin it's been 18 minutes since I last talked to you. Ryan Muraski says what do you think Rocksteady's up to now? Do you think they'll make a new IP? Good question. Oh that's a great question. Yeah. I bet they're still I bet they're doing they'll do another license scheme. I don't I think that they saw what worked with Batman. They saw the critical acclaim they saw the millions of fans and I think they want to keep going with that. I'm sure WB is still trying to beat down their door to get them to pick up something. And I'm sure cause that's the thing when you're like for the to let them finish their Batman trilogy ignoring Origins that wasn't theirs to let them finish that. I'm sure WB is like what's next? What do you want to do? Do you want to take on this character? Do you want to do this? Do you want to do a Justice League? Do you want to do a do you want to do Batman Beyond which was like my dream would be my dream come true of course but there's so many",
      "start": 3262.24
    },
    {
      "text": "Do you want to do this? Do you want to do a Justice League? Do you want to do a do you want to do Batman Beyond which was like my dream would be my dream come true of course but there's so many different things but I would still say they're they're going to be doing a comic book game a licensed capital game. Yeah I would agree. I mean the thing though is that they have a lot of license to do whatever they want now. So they're I'm sure that there are people there that are creative that want to do their own game but I just don't know that that's a smart move for them. They can build a war chest and like a lot of as long as they keep doing well they can build up a lot of acclaim which I think that and I think they frankly they lost a little bit of their acclaim with the last Batman game. So I think that they yeah yeah. I think that a lot of people weren't crazy about that game. And I think that I think they have I was just saying I think that they they probably I think",
      "start": 3307.04
    },
    {
      "text": "game. So I think that they yeah yeah. I think that a lot of people weren't crazy about that game. And I think that I think they have I was just saying I think that they they probably I think that's why I think they do stay in within comic books is cause I think they feel like they have something to prove and it's not like they're not bad. I mean the game wasn't bad. It was good. It was just not nearly as good as Arkham. See that's what I was going to say is I think that they have a bit of an Uncharted syndrome of just like all right cool. Arkham City was awesome. Arkham Knight's kind of the same and there's this tank shit I hate you know what I mean? It was still like a great game. But unlike Asylum and especially City I think like that game like no one even talked about that game after like two months. Like it wasn't it was so that it was so the same. Yeah. It was. And but I think that like it just wasn't in game of the year discussion. It wasn't anything. I think that",
      "start": 3340.0
    },
    {
      "text": "game after like two months. Like it wasn't it was so that it was so the same. Yeah. It was. And but I think that like it just wasn't in game of the year discussion. It wasn't anything. I think that they have something to prove. I think they overthought that game. I think that it's clear that they felt like they had to change too much and they didn't have to change much at all to make you know because their production value is so high the writing is so on point. It's just like they need to go back to the drawing board and I think tweak some things remove some things tweak that gameplay which I think is getting a little tired and a little stale. But I think my guess is that it would be like Justice League related. Yeah. I think I think that they obviously stay with Warner Bros. They stay with DC but they could do whatever they want. I could see him do another Batman game just a different Batman. You know what I mean? There's so many different versions of Batman and",
      "start": 3372.16
    },
    {
      "text": "They stay with DC but they could do whatever they want. I could see him do another Batman game just a different Batman. You know what I mean? There's so many different versions of Batman and alternate universes. I could I wouldn't want that. I would much rather see them make a Superman game see them make a Daredevil game see them make a Ninja Turtles game. Like there's a million other grounded heroes that fight in an open world that I'd like to see. But I can also see them be like well Batman's still fucking the biggest thing going. How do we somehow capitalize on that? Maybe it is just we what if we make a one in the DC Cinematic Universe? What if we do a Batfleck game? It would be cool to see Batman again. I just I think that's selfish of me to want that because I think you know don't get me wrong. I'm I'm right there with you. Because you see them do Superman too. I think I agree. John Horrigan wants to know what video game characters would you like to see in a",
      "start": 3404.56
    },
    {
      "text": "you know don't get me wrong. I'm I'm right there with you. Because you see them do Superman too. I think I agree. John Horrigan wants to know what video game characters would you like to see in a crossover game? Not Smash Bros. type but story mode centric. A couple of years ago there was a big rumor going into E3 as there ought to be where a game called Nintendo Fusion was being talked about and it was going to be Metroid and Star Fox story based stuff. And I was like that is fucking awesome. At this point I did not want that at all but a couple of years ago I wanted that real. That's the problem is I feel like it's hard to do that and not have it be super cheeseball or not work where fucking Samus is just talking to this Fox McCloud. What the hell? Like I don't know. There's crazy ass aliens and shit Metroid but still like you know this cartoon Fox and I'm this bad ass bounty hunter. Like what are why are we making this work? Yeah. I don't really want that stuff. I don't really",
      "start": 3439.12
    },
    {
      "text": "and shit Metroid but still like you know this cartoon Fox and I'm this bad ass bounty hunter. Like what are why are we making this work? Yeah. I don't really want that stuff. I don't really like that. I like things to kind of exist on their own. That's why I was so happy. Well I don't want to spoil anything. I love crossovers. I love them a lot. I feel like there's a very special place for them. And you said not Smash type but like Marvel vs. Capcom to me is always such a special game just because you get all the characters together. And it's like I liked the even taking it out of the gameplay of that and it cause it is just people together. The stupid story elements they had not canon doesn't matter but just the interactions between all these different characters. I always love that shit. And I think I think that it's it is hard to not be cheesy but it's like if they just kind of own the cheese but that's the thing is yeah. Embracing that kind of shit makes sense",
      "start": 3484.56
    },
    {
      "text": "love that shit. And I think I think that it's it is hard to not be cheesy but it's like if they just kind of own the cheese but that's the thing is yeah. Embracing that kind of shit makes sense but I'm sorry for like a yeah for a fighting game for sure. That's why Persona is able to get away with it. That's why you know capital like the games that you're talking about but it's just outside of that when it is like Oh we'll see Lara Croft mashed up with Uncharted. It's like well that kind of takes away from both of them and how are they going to do this? And what's how's that work? I see. I'm into that. I love it. But the thing is I love it at a point. I got I would love that now because I've gotten the Uncharted the two minutes. I know what those are. I have enough experiences alone where it's like Oh cool. This is something that could be different. It is how do they mesh those things? And I always think that it's interesting when they there is two lines of Canon",
      "start": 3517.2
    },
    {
      "text": "alone where it's like Oh cool. This is something that could be different. It is how do they mesh those things? And I always think that it's interesting when they there is two lines of Canon and you have to kind of cross them over and try to make them make sense together. I don't like it when it's bullshit and they're just like they come up Oh it's an alternate universe or whatever. So I like when there is a grounded reason or grounded within the Canon of of why it all works. That's why the comics right now Batman/Ninja Turtles you're going to bring it up. It's good. It's perfect way to do that type of stuff where it's like you read it and it doesn't feel too out of line to be a Ninja Turtle story or to be a Batman story. It does simultaneously feel like both. And I think that the games it's a little harder with because the gameplay needs to also do that as well as the story. But I think that if you take two franchises like I think Uncharted and Tomb Raider actually is like",
      "start": 3555.68
    },
    {
      "text": "games it's a little harder with because the gameplay needs to also do that as well as the story. But I think that if you take two franchises stories give it a totally new type of gameplay so that people aren't like you know comparing it to one side or the other. But it's a new type of game with the story elements of the other two. I think that could really work. And there's a whole bunch of shit that I'd like to see. Mm. Maximum Cortez. Never heard of him. Andy from Rooster Teeth. He says what games resulted in the most broken controllers Crash Team Racing back in the PlayStation days when there was a that was the game that I got a Multi-tap for. Nice. So we're talking four fucking controllers and it was an accident. What I know you're asking about rage by. I have never broken control out of rage. Oh really? Yeah I'm only done.",
      "start": 3594.4
    },
    {
      "text": "for. Nice. So we're talking four fucking controllers and it was an accident. What I know you're asking about rage by. I have never broken control out of rage. Oh really? Yeah I'm only done. No I have once I probably broken more at it. I guess but like the one that always stands out to me is a freshman year college. I'm across the hall of my friend John's room playing WWF SmackDown! 2 on PlayStation One which was right because it was SmackDown! SmackDown! 2 and then just bring it on PS2 I believe. But SmackDown! 2 because like the story with that is like you know I moved to Mizzou. I didn't know anybody. And one day I shut my door to go to class and I turned the corner and I heard the SmackDown! music like the menu music. And I like went down the hall looking in every room until I found John. It was like we're going to be friends. High flying little shit. That fucking would get up every time that he would land these moves. And like his you know momentum meter would",
      "start": 3638.88
    },
    {
      "text": "until I found John. It was like we're going to be friends. High flying little shit. That fucking would get up every time that he would land these moves. And like his you know momentum meter would spike but I was good enough usually to beat it. But there's this one time where I'm sitting on the floor playing him with my PlayStation One controller. And he just keeps doing this flip off there and getting up fast enough. He's like he's storing finishers and stuff. And like I couldn't do anything. And I remember just going fucking slamming it down on the floor but it was a concrete floor. So I just shattered the base of the controller but then I went on to beat him because I scared him so badly. And the fact that I'm raging it was totally worth it. Yeah that's funny for me. So like I said I never broke it out of rage but my fucking friend put the Multi-Tap on a window and the window was open. Didn't know. We like I forgot exactly how it happened but we just finished a race",
      "start": 3680.64
    },
    {
      "text": "I said I never broke it out of rage but my fucking friend put the Multi-Tap on a window and the window was open. Didn't know. We like I forgot exactly how it happened but we just finished a race and we put the controllers down. The Multi-Tap falls out the window pulls all the controllers with it. And all four controllers fall like five stories. Oh wow. Yeah. I mean it was bad. I forgot. Yeah. You're growing up in San Francisco. I'm thinking like a second story. Oh yeah. No no no. And then four controllers broke. That seems like one of the that would have been the perfect time for one of them to act like a grappling hook and like cash the windowsill. There was so it was one of those situations where there was so many ways that that could have not happened. I was I got to say I'm kind of impressed that it did because like you would think that the Multi-Tap wouldn't have enough like wait wait to pull four fucking controllers. But I guess it did. They were they were just the",
      "start": 3708.72
    },
    {
      "text": "kind of impressed that it did because like you would think that the Multi-Tap wouldn't have enough like wait wait to pull four fucking controllers. But I guess it did. They were they were just the original place. Sure. No no no dual. So we didn't have the dual stick dual stick. So yeah. But yeah. Do you ever break a controller? Colin? Yeah definitely. I mean organically would break them playing games like Dreamcast controllers really flimsy. So I've talked about how Crazy Taxi we broke controllers but the last game I broke a control out of rage for was I think Heavenly Sword. And that was one of the Sixaxis controllers had no girth and they you just I just smashed it on my desk and I just broke it. But I always remember throwing controllers when I was a kid which was like a funny thing. And it was funny on the NES and SNES because they were they were attached to the system. So like you would just throw your controller in the game would like reset. I remember just like",
      "start": 3749.04
    },
    {
      "text": "funny thing. And it was funny on the NES and SNES because they were they were attached to the system. So like you would just throw your controller in the game would like reset. I remember just like walking away from games that were just like blinking like gray and you're just like fuck this game. Just to keep it at that for hours or whatever. Yeah. That's your punishment game. Yeah exactly. That's what you get from me to Dick. Michael Barbosa says what are some of your favorite old games that you'd want to play in a Let's Play? My God. That list for me is so long. I literally I have documents of like games that I hope to one day Let's Play. It's just Let's Plays are just so not a focus for us and it gets hard to kind of prioritize that stuff. Let alone to bring in something old and try to figure out how to make it work and get all this stuff for. Yeah. And that's the other problems. Like early on we did a bunch of old ones and then our little converter thing stopped working",
      "start": 3794.48
    },
    {
      "text": "and try to figure out how to make it work and get all this stuff for. Yeah. And that's the other problems. Like early on we did a bunch of old ones and then our little converter thing stopped working and it was like fuck. But I definitely like the old first Ninja Turtles on NES was the game that broke the camels back when it came to us doing the things because we couldn't get it to fucking work. I've always wanted to do that. There's so many PlayStation games that I want to do. I need Crash 2. I need to beat Crash 2 and 3. Um I want to do full plays of those and then there's just it's just hard to figure out a good way to to cover old games. Like what is the best Let's Play of an old game? Because most people want the whole game but that's hard to make the content worth doing for the amount of views that that gets. So it's kind of like figuring out the right equation to making it fun making it entertaining but also making it worth doing. Um because yeah if it was if",
      "start": 3827.6
    },
    {
      "text": "for the amount of views that that gets. So it's kind of like figuring out the right equation to making it fun making it entertaining but also making it worth doing. Um because yeah if it was if it was obviously worth doing that's all I would do is just play old games. Yeah. Oh yeah. Uh correct. Talking to you. Let's see. How long we've been going. We'll do a couple more questions. Ryan Verrell says why can't a company like Disney succeed in the video game industry? Specialized enough. I don't think I think you have to be all in. I mean what do you think about the company is the publishers that do succeed. They're publishers of video games. They don't do other things like Activision doesn't do anything else. EA doesn't do anything else. Obviously these companies diversify in some ways but um but doing this industry is a unique beast and you have to have you know specialty in doing that. And there's no hemorrhage a lot of money. Um so it's just not for everyone. And I don't",
      "start": 3871.36
    },
    {
      "text": "ways but um but doing this industry is a unique beast and you have to have you know specialty in doing that. And there's no hemorrhage a lot of money. Um so it's just not for everyone. And I don't think that you know I think that you know there are some midsize publishers that are still probably not long for this world. So I don't think it's a safe space for a lot of companies to be in. That's my opinion. No I mean we did a whole topic about it right? I think it's also just Disney being smart and coming to that realization that we could be doing other things and we are really good at other things and we should do those things and partnering with people who do these video games really well. Yeah. That is smart. Zachary Hood says how can I find friends through gaming? I mean I think the easiest answer and I think a very very very effective answer is forums KindaFunny.com/forums. There you go. But it's like there is such a community. Those people are there to",
      "start": 3914.08
    },
    {
      "text": "the easiest answer and I think a very very very effective answer is forums KindaFunny.com/forums. There you go. But it's like there is such a community. Those people are there to be friends to have conversations about games. I think it's easier to find friends through gaming when it's not actually through the gaming. Having said that Alfredo is very very obviously into multiplayer games and the amount of real life friendships that he's formed over the last 15 years that I've known him through playing games with people. It's crazy. Like the the cruise that he runs with and the teams that he runs with like those are his people you know? And I think it's really cool and awesome that like I'll be down at and all over the fucking country for events we're doing. Like we were in Texas for SGC last year or when we're at E3 or whatever people will come up to me like Tim Hey like I'm Alfredo's friend I'm on his team whatever. And it's like that's just they're local",
      "start": 3951.28
    },
    {
      "text": "in Texas for SGC last year or when we're at E3 or whatever people will come up to me like Tim Hey like I'm Alfredo's friend I'm on his team whatever. And it's like that's just they're local to that place. You know? And I think that it's it's cool that because of the internet you can kind of have friends anywhere you want. Let's see. George Barrett says how many generations of consoles do you see HD Remasters continuing to God? That's a great question forever. Yeah. Forever in perpetuity. I mean there won't be called HD Remasters. Now they'll be called collections because these games are already in HD. Do you think it'll be though? Like I guess it'll be that on PlayStation 5 right? We'll get all of the Batmans. That's how they'll go around to doing it. We'll get Arkham City, Arkham Knight, Arkham Asylum. Maybe. I think that we might advance so far in the next five to 10 years that some of these games just might not be long you know might not belong on these consoles",
      "start": 3989.44
    },
    {
      "text": "Arkham Knight, Arkham Asylum. Maybe. I think that we might advance so far in the next five to 10 years that some of these games just might not be long you know might not belong on these consoles because they might just not look good anymore. It's the way we almost feel about like why isn't there a Crash Bandicoot Collection? It's like it was like those games look like garbage you know? And they play like garbage too. And it's not an NTSC-era PS One polygonal games just don't look right anymore. So those games aren't good to re-release them. And we saw I mean with rare exception we saw Final Fantasy VII for instance come to PS4 and it's looks like shit but like it is what it is. So I wonder if we'll have the similar land look look at the old games in a similar lens but I don't think so. Cause a lot of these games have a lot of artistic direction style as opposed to just putting like you know polygons together. I hope it just if it's going to keep going it's",
      "start": 4031.68
    },
    {
      "text": "but I don't think so. Cause a lot of these games have a lot of artistic direction style as opposed to just putting like you know polygons together. I hope it just if it's going to keep going it's just one generation back of Hey there's this new console and you're buying it. Did you know you miss these games on PlayStation 4 or Xbox One? So on the next one you get those. Cause that seems like the majority of them are nowadays right? With the exception of PS2 classics things every every now and then. But I think that it's it's less about the they won't be HD Remasters obviously because of what Colin said but I think that there it's less going to be about the graphics or whatever but it's going to be more about what do the new consoles offer that these don't. And like that's when you look back that's all that re iterations of games are when you look at now the it's not even HD Remasters when we're we're talking about the PS3 to PS4 job. It's just",
      "start": 4065.68
    },
    {
      "text": "that's when you look back that's all that re iterations of games are when you look at now the it's not even HD Remasters when we're we're talking about the PS3 to PS4 job. It's just here's a collection edition but not even a collection The Last of Us you know what I mean? Things like that. I think it's just that's just going to be the norm. And like I it's I think it's a good thing overall. It sucks that you know like if you have to buy it twice but you don't have to buy it twice. I feel like the the they've taken their foot off the gas a bit for a while there. It was like what the fuck are you doing? And now it is like okay I guess that makes sense. Sure. Why not? Like it as development cycles get longer and longer companies and publishers need to worry about making money and keeping everybody going into business. So it makes sense for WB who doesn't have an Arkham Knight this year to say all right cool let's put out the other two Arkham games. Cause it's",
      "start": 4099.68
    },
    {
      "text": "money and keeping everybody going into business. So it makes sense for WB who doesn't have an Arkham Knight this year to say all right cool let's put out the other two Arkham games. Cause it's people like those wanted those want to play them again. Here you go. Yeah. I think it's like a easy way to kind of fill the void that like things like Fallout: New Vegas and stuff like that did before where it's just like let's keep the brand in people's conversations and all that stuff. Final question of the day comes from Taylor Now and back at IGN when you get early slash review copies are they retail? Do they have their own special box or they come in a bland secret box? Depends nowadays it's codes. The industry has changed mostly to where you just get codes for games and that's on retail. It's running on retail. A part of it. I don't know if it was this shift of this generation as much as it was our shift as well but it seems like it's always retail. It's rare nowadays. Correct me if",
      "start": 4137.6
    },
    {
      "text": "It's running on retail. A part of it. I don't know if it was this shift of this generation as much as it was our shift as well but it seems like it's always retail. It's rare nowadays. Correct me if I'm wrong for us to really feel like it'd be getting debug PS4 builds. If you're getting that it's like Hey this is debug version of a game the entire time we've been doing this game six months out. So here's a build to go play like three levels of or whatever. I think that with no that wasn't even with when we did the Ratchet & Clank Let's Play before it came out three months ago that was a code on retail that they uploaded. They upload that stuff to retail. So it would work cause at IGN back in the day when we when I started and it was working PlayStation 2 stuff and the PlayStation reviews you got burned CDs and DVDs all the time or DVDs all the time. And then PlayStation 3 was the same thing. And those just arrive. Yeah. A plain old gem case and a burned disc in there",
      "start": 4176.88
    },
    {
      "text": "reviews you got burned CDs and DVDs all the time or DVDs all the time. And then PlayStation 3 was the same thing. And those just arrive. Yeah. A plain old gem case and a burned disc in there with something written Sharpie on what it was. And then now it just feels like discs are pressed. So early this are our games are if you want it to get reviewed are uploaded so early that you're just getting the retail experience. Yeah. I think the for the retail games that we do get usually for me it's been Nintendo games. It's it is hit or miss where it does sometimes just come in a bland box. Like it's it'll be the retail disc but it's not actually in the box box. It'll be more like some weird white box that's really nondescript or whatever. But yeah they're usually retail games completely. So this topic brought to you by Total War: Warhammer. What is Total War: Warhammer? It's a fantasy strategy game of legendary proportions. It combines an addictive turn-based campaign of conquest and",
      "start": 4211.2
    },
    {
      "text": "empire building with explosive colossal real time battles all set in the vivid and incredible world of Warhammer Fantasy Battles. It's the perfect match. It's a marriage made in gaming heaven. We're talking of fantasy world of perpetual war and massive battles that you'd find in Warhammer mixed with the critically acclaimed epic scale and conquest based strategy games of Total War Total War plus Warhammer equals a gorgeous high fantasy world of perpetual war and conquest on a colossal scale brought to life in hours and hours of gripping strategy gameplay epic fantasy Total War style. No one's done Warhammer or indeed fantasy like this before from the personal skills of your characters to 0 000 roaring orcs. No fantasy strategy game is this big and detailed as fantasy spectacle. It is",
      "start": 4253.36
    },
    {
      "text": "done Warhammer or indeed fantasy like this before from the personal skills of your characters to 0 000 roaring Orcs. No fantasy strategy game is this big and detailed as fantasy spectacle. It is unmatched. If you're a PC gamer and not involved you're missing out. The actions that all feel and play very differently. Each race is wholly different with their own unique characters campaign mechanics battle for the units and play style. So if you're interested in this go over to PC Steam all that stuff. May 24, 2016. That's by the time you're listening to this probably going to be that. So it'll be out. Yeah. Yeah. Unless you're over on Patreon.com/KindaFunnyGames supporting us. And we thank you very much for that. Yeah. Then you can just get ready. Prepare your bodies for Total War.",
      "start": 4290.48
    }
  ]
}
