{
    "id": 1714,
    "video_id": "jDkGEaCHOFU",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Nintendo NX Release Date and Zelda Delayed - Kinda Funny Gamescast Ep. 68 (Pt. 1)",
    "description": "So much Nintendo updates!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1462190402,
    "duration": 1498,
    "transcript_chunks": [
        {
            "text": "Kinda Funny Live is happening May 8th and 9th. It's a two-day event. The first day is going to be a completely ridiculous stage show. What we have planned this year completely blows last year out of the water, and I don't even know how that's possible 'cause we were really stupid last year and this year's somehow even stupider. Day two, it's going to be full day of meet and greets. We're hanging out with all of us. A bunch of Rooster Teeth people are there, Funhaus people are there, Achievement Hunter. It's going to be a grand old time. There's going to be some games to play, there's going to be signings. It's exciting, it's a really fun time. There's going to be exclusive merch. Oh yeah, this is definitely going to be exclusive merch. Go to kindafunny.com/tickets to get your tickets today. There's a couple VIP tickets still available, so make sure if you want one of those, you act fast. What's up, guys? Welcome to the first ever Episode 68 of the Kinda Funny Gamescast. As always, I'm your host, Tim Gettys.",
            "start": 0.04
        },
        {
            "text": "a couple VIP tickets still available, so make sure if you want one of those, you act fast. What's up, guys? Welcome to the first ever Episode 68 of the Kinda Funny Gamescast. As always, I'm your host, Tim Gettys, joined by one half of the coolest dudes in video games, Greg Miller, and Portillo wearing a T-shirt. Right, Con Live, we said I didn't want him to put him in the shirt. I was going to give it to the audience, and then Colin put him in the shirt, and now he's just been wearing the shirt all the day. So one of the people on Con Live who wins the prize box will get a shirt worn by Portillo straight off of his back. Right, you his front, his whole entire body's kind of covered by that thing. He is a sausage in a sausage casing. I enjoy it. Yeah, no, he likes clothes. I just didn't want to be a poser. This is an Adventure Time shirt. I don't know the reference to not necessarily your thing, so it's like I don't really want to push him into something he's not comfortable doing. Somebody on the street's going",
            "start": 33.68
        },
        {
            "text": "is an Adventure Time shirt. I don't know the reference to not necessarily your thing, so it's like I don't really want to push him into something he's not comfortable doing. Somebody on the street's going to talk to him like, 'Oh, you love Adventure Time! You love that,' he'll do that whole light, 'You love that dog!' I think that's in Adventure Time. Portillo's going to be like, 'I don't know what you're saying.' 'Do you watch Adventure Time ever? Like, have you ever seen?' I've seen it once in a pizzeria. I was at Comic-Con. That was on in a pizzeria, and I looked up. So you didn't hear it, you just saw? I think I might have heard it. They might have had it up loud enough that you could hear it. I've never seen an episode. Seems like something I'd like. Yeah, but you're a busy man. You're an adult now. You're an adult man now. You have this show to host, but I want to watch, I want to watch Adventure Time at some point in my life. We should sit down, we should make a date out of it. Well, I think before this, I'd have to see Rick and",
            "start": 82.36
        },
        {
            "text": "have this show to host, but I want to watch, I want to watch Adventure Time at some point in my life. We should sit down, we should make a date out of it. Well, I think before this, I'd have to see Rick and Morty. Rick and Morty is another show that I was told that I would really enjoy, and I, I never really watched it. Kevin Coello forced me to watch the first three episodes. Yeah, first episode, I'm like, 'I mean, it has funny moments, but like, I don't understand why.' Well, plus it's just Kevin Coello's trying to make you do something, so you immediately don't want to do it. I understand 100%. First episode, I was like, 'All right, it's funny, but like, I wouldn't want to keep watching.' Episode two, I'm like, 'All right, I, I get what they're going at.' And three, by three, I'm like, 'This is great.' I haven't watched any since, but I get it. Those guys are good guys. They're doing God's work out there. So what's up with Colin Moriarty? He's not here. He's sick. He is sick. He's got a sore throat. One half of the coolest dudes in video games, but I'm the",
            "start": 114.92
        },
        {
            "text": "those guys are good guys. They're doing God's work out there. So what's up with Colin Moriarty? He's not here. He's sick. He is sick. He's got a sore throat. One half of the coolest dudes in video games, but I'm the bigger half of the, the half. So I'm, I'm cool. Like, I'm big. I'm the bigger half of the whole. Like, physically or like, sure, emotionally, that too. Okay. I am a deep well of emotions. I know that Colin Moriarty is a puddle, just anger, seething anger right below the surface. That's Colin Moriarty. I have a range. Sometimes I am angry. I hope he recovers. I'm happy. I'm sure he'll be back by who we find that Pox, man, that pox pack, yeah, pox pack, yeah, pox plague thing, whatever you want to call it. I like that you like pox plague better. Yeah, a pox on both your houses. Yeah, that sounds too like freaking too Shakespearean. And it reminds me chickenpox, and that was the whole thing when we were, did you ever have chickenpox? Yes, I did. Me too. Me, Kevin Coello, and my brother got it together. Oh, that's cool. It was, did your parents do the thing where it was",
            "start": 147.56
        },
        {
            "text": "chickenpox, and that was the whole thing when we were, did you ever have chickenpox? Yes, I did. Me too. Me, Kevin Coello, and my brother got it together. Oh, that's cool. It was, did your parents do the thing where it was like, one of you put them together? Not on purpose, but you always together. It happened, and they ran with it. I'm pretty sure by now they claimed that they did it on purpose, but it's like, at the time, they didn't know what they were doing. Didn't do shit. We were just there. Sure. Playing with each other's genitals. That's how you get chickenpox, right? No, no, that's how you get chlamydia. We, you know, might not be a cause and effect, but we were playing with each other's genitals, got chickenpox. So is that a real story? Parts of that are no, we weren't. No, no, no, no. We did used to take baths together, though. Sure, that I understand. Yeah, three of us, three of us in one little bathtub. That was back when Kevin Coello was could fitted normal size. Yeah, before he became a little tiny little dude. But uh, before he was mid-Vero assault",
            "start": 195.12
        },
        {
            "text": "I understand. Yeah, three of us, three of us in one little bathtub. That was back when Kevin Coello was could fitted normal size. Yeah, before he became a little tiny little dude. But uh, before he was mid-Vero assault transformation. This is Gamescast, where every week we get together, talk about video games and all the shit that we love about them. You can get it early on patreon.com/kindafunnygames alongside a whole plethora of goodies related to Kinda Funny Games. Uh, you get the show early, you get exclusive episodes of this show. Usually they're worth a dollar, sometimes they're not, but I usually will let you know if they're not. Um, otherwise, youtube.com/kindafunnygames, you can watch these all for free later than most people would like them. People complaining in the comments are like, 'Hey, this is late.' All right, buy it on Patreon. It won't be late. It's not late for our Patreon supporters and subscribers. I love everyone, though. You guys, not to mention, though, you do a good job of keeping the topics. I",
            "start": 229.76
        },
        {
            "text": "all right, buy it on Patreon. It won't be late. It's not late for our Patreon supporters and subscribers. I love everyone, though. You guys, not to mention, though, you do a good job of keeping the topics. I try, I try. And then, then every once in a while, there's a situation where Nintendo controller, the Nintendo talk, well, Nintendo controller, every time we talk about Nintendo, there's an issue because last time we did the controller, the day we put it out, then, um, you know, it's denounced that the was fake. I thought it was still great discussion, though. Like, fuck it, we're still putting it up. And then yesterday, as of this recording, a topic goes up that's NX rumors, completely not talking about all the major NX stuff that, but it's okay, we're going to talk about it now. Yeah, that's a great seg topic. More will change from here on out. Absolutely. There's no way they can change what they've said about the NX out there. Zelda Wii U 2016. Before we get there, I want to give a shout out speaking of the Patreon stuff.",
            "start": 276.0
        },
        {
            "text": "from here on out. Absolutely. There's no way they can change what they've said about the NX out there. Zelda Wii U 2016. Before we get there, I want to give a shout out speaking of the Patreon stuff. We're kind of in a weird, it was a good segue, but now I need to go. You're doing fine. You're Patreon. Shout out to Steven Inler. I want to make sure I'm saying that right. I believe you are. Sounds right. Steven Inler. He's a Patreon supporter. He's a Patreon producer because you went to patreon.com/kindafunnygames. Support there, making the show happen. I really appreciate. I get, I like his name because I get to look at it all the time on the calendars because you put it on this show. Sure. So for the last couple weeks, next couple weeks, I'm just looking at it there. So shout out to you, Steven Inler. You are the wind beneath my wings and the shirt upon Portillo's. No, this is Lote Crir. You're my hero. L.com. Everything could ever be like to be. I don't know the words. You don't know anything about, about words. It's true. So,",
            "start": 314.72
        },
        {
            "text": "beneath my wings and the shirt upon Portillo's. No, this is Lote Crir. You're my hero. L.com. Everything could ever be like to be. I don't know the words. You don't know anything about, about words. It's true. So, Greg Miller, I want to talk about Nintendo. Sure. Big surprise to everyone at home. I, you are the NX biggest fanboy, so I'm going to, to throw some, some facts at you. Sure. And then I want to get your feedback. Me and Colin Moriarty talked a bit on Con about this. We're going to get deeper into the whole thing, but I want to hear what you have to say. You got it. The facts are, NX not going to be at E3 this year. Going to be released 2017 in the month of March. Zelda delayed, also going to be on NX, presumably a launch title. Um, Nintendo not doing well. The big, big issues, they're down 61% in profits. That's not good. They're selling their stock in the Mariners to what extent we don't know, but they are trying to figure all that out. Wii U ceasing production by March 2018. Their holiday season is abysmal this year. This year is",
            "start": 350.12
        },
        {
            "text": "their stock in the Mariners to what extent we don't know, but they are trying to figure all that out. Wii U ceasing production by March 2018. Their holiday season is abysmal this year. This year is abysmal this year. Yeah, this year they're done. Absolutely. Zelda was what you were holding on to for this year with the Wii U, and they're like, 'Whoa, no.' See, holiday season not looking good, which no, you know something Nintendo fans are used to at this point, but this 2016, it's going to go down in history as the worst Nintendo year of all time for sure. I, I mean, I don't even think that's going to be questioned. Like, that's absolutely true. Um, and then Fire Emblem and Animal Crossing for mobile announced. So there's, there's some light. And Pokémon Go. I know this is part, Go leaked footage came out, and it looks very interesting, very cool. And Pokémon Red, Blue, and Yellow's Virtual Console sales numbers came out, and over 1.5 million, which is great for Virtual Console titles and, you know, downloadable stuff. So I think",
            "start": 407.56
        },
        {
            "text": "very cool. And Pokémon Red, Blue, and Yellow's Virtual Console sales numbers came out, and over 1.5 million, which is great for Virtual Console titles and, you know, downloadable stuff. So I think that that's a good message to Nintendo of what the people want. Um, BabyMetal Mario Maker DLC came out. BabyMetal, of course, the classic, I think J-Pop, I want to say J-Pop, uh, band that's the little girls doing death metal. Okay. Oh, Greg, you don't know about this? I thought you don't know about BabyMetal. I thought it was Baby, you said BabyMetal Mario Maker, so I was thinking it was just Baby Mario, little Mario, and the, the Metal Mario. Yeah, no, Mario DLC. I mean, this is the, it's the greatest thing in the world. Uh, it went viral, like the, a video went viral in the States maybe two years ago, but they're a huge deal. It's like this group of like three 9 to 13-year-old girls. Okay. And they just do heavy metal shit, but in like a J-Pop format. Okay. Um, so very colorful. Uh, I mean, no, 'cause it's heavy metal, but it's like,",
            "start": 454.56
        },
        {
            "text": "it's like this group of like three 9 to 13-year-old girls. Okay. And they just do heavy metal shit, but in like a J-Pop format. Okay. Um, so very colorful. Uh, I mean, no, 'cause it's heavy metal, but it's like, it'll be heavy metal, like it really intense, and then the chorus comes, and then it turns into like, okay, okay, okay, style. Exactly. It's very Ryan Clements. Um, so that's great. And then 10 million people have signed up for Miitomo. So 10 million people have used it. Yeah, yeah. Feels like that one burst pretty quick. I know that many people used it. How many people are still using it other than Mike Drucker? I get the Mike Drucker. That's my thing is there's not 10 million people still using it, but I, numbers are great, don't get me wrong. I'm not, not trying to take away from it. I'm, I am shocked by how many posts I see daily from my Twitter feed of people, people still using. Yeah, and it's not just like two people, it's like 10 people, which I don't follow that many people. That's a pretty good percentage of it. Um, I'm not",
            "start": 500.84
        },
        {
            "text": "using it daily, I can tell you that much. Did you ever use it? Did you download for the first couple days? I used it, and I was like, 'I, this is, it's not enough of a distraction.' And it's like, I'd like to use it on planes and stuff, but then you need internet access, so it, it ruins it. So anyways, back to the real shit, NX stuff. E3 news. What's your whole take on this? Um, for me, the entire situation has been awkward. You know what I mean? I feel like it seemed like such a no-brainer that we've been talking about it forever that here we go, E3, Nintendo's big coming out party. They're going to come out, they're going to show you the NX, explain it, and it'll be out this fall. Having it moved to March doesn't bewilder me that much, but then like how they're coming out so early, I guess, and that's me trying to put E3",
            "start": 549.32
        },
        {
            "text": "to show you the NX, explain it, and it'll be out this fall. Having it moved to March doesn't bewilder me that much, but then like how they're coming out so early, I guess, and that's me trying to put E3 further back than it is really. So it's not that early, but getting out ahead of the messaging, I guess, and explaining ahead of time that no, NX won't be there. E3 is Zelda. You know what I mean? Like, E3 is going to be Zelda. That's what we're there to pitch. That's like, or sell. It's like, 'Hmm, that's a cool,' in one sense of like, I can't wait to see Zelda. Everything we've seen for the new Zelda looks awesome. But it's bewildering in the sense of, is that all your, like, that's thing. So to elaborate on that a bit, Zelda is going to be the only playable Nintendo game out of that. Is crazy. Like, in an, in, in an E3 where we are seeing it radically change leading up to it, where you're seeing Activision peel off and EA peel off and all these uh, companies make a point of saying they're not going to now have Nintendo go",
            "start": 593.64
        },
        {
            "text": "we are seeing it radically change leading up to it, where you're seeing Activision peel off and EA peel off and all these uh, companies make a point of saying they're not going to now have Nintendo go and like, we're going to have one playable game there. That is fucking crazy. 'Cause even if you are like, we're always talking about, right? Like, you hope that was happening with the NX and the Wii U, you know, uh, lineup is the Wii U was already, you know, dwindling off, and now we have more solid numbers and timelines, and now we know where NX is. The hope was that, cool, we're going to see Wii U die this year, but at E3, going to come out, you're going to be like, 'Here's your Metroid game, here's this game, all these game, here's your true 3D Mario, all the things you thought you were going to get on Wii U at some point.' We saw the numbers, we saw the writing on the wall, took those projects and put them into the NX silo. So we are flush with NX games. It's going to be amazing. There was that, you know, we talked about on",
            "start": 636.44
        },
        {
            "text": "Colin and Greg Live, and I think maybe last week on The Gamescast. Yeah, yeah. Where it was like, they were talking about the lineup that they had and how many NX games were supposed to be coming and all these different things, which is super exciting. I'm excited for the NX, and I don't mean I'm going to buy it day one. I don't mean that. I'm excited because it's going to be cool, and what I'm excited to know what it is and how Nintendo rebounds from the Wii U and what their messaging is. And it's very much why I'm so intrigued right now with PlayStation Neo. Right? Like, how do you come out and sell this? How do you come out and say why you need this? And for Nintendo, the messaging has to be completely different of like, it's got to be, you assume, hat in hand, PlayStation 4 thing, where it's like, PlayStation 3 was",
            "start": 681.12
        },
        {
            "text": "you come out and say why you need this. And for Nintendo, the messaging has to be completely different of like, it's got to be, you assume, hat in hand, PlayStation 4 thing, where it's like, PlayStation 3 was hard to program for, and we kind of got our ass kicked for it for a long time, and we're sorry. This is a high-powered PC. It's very easy for you to bring your games over. Indie dev is going to work. You da da da. You know, they said all the right things to that PlayStation 4 launch event. And so you figure, I figured Nintendo had to come out and say that as well. And I still think they do at some point. But to not do it at E3, to do E3 and only show one game, to do E3, only have one game playable, and announce that it's delayed till next year. It's, it's so awkward. The entire thing is so, and have it like, and I know I talked to you a little bit about uh, yesterday when the news broke. I was just like, for me, it was out of the blue. I, I know I would have expected, we're going to tell you the launch date. We're going",
            "start": 718.64
        },
        {
            "text": "I talked to you a little bit about uh, yesterday when the news broke. I was just like, for me, it was out of the blue. I, I know I would have expected, we're going to tell you the launch date. We're going to tell you when Zelda's happening. We're going to tell you all these different things. I would have expected that to be a Direct. I would have expected there to be cryptic tweets of like, 'This is what's about to happen. Everybody get excited!' And the fact that they didn't do it as a Get Hype moment felt, made it be, feel very much like a weird corporate restructuring. Like, 'This isn't,' Nintendo is usually so good at speaking to you, speaking to the Nintendo fan, making you, you guys so excited and enthralled with what they're doing. And this one seemed like it was very much like, 'All right, we're in the boardroom, and here's like,' I'm, I'm talking to you from the Nintendo podium of what's happening and where we are as a company. I don't know why you left me. I had this trash show here. You should have. I got rid",
            "start": 762.04
        },
        {
            "text": "and here's like, I'm, I'm talking to you from the Nintendo podium of what's happening and where we are as a company. I don't know why you left me. I had this trash show here. You should have. I got rid of that. People are watching this right now. They're horrified, they're disgusted. Trash show. Uh, so it's just been for me an awkward thing. How, where your, where's your head? You're this Nintendo fan. I, you were like going through all the stages, it felt like. And like, at one point, you were like, 'I'm accepting of it now.' Yeah, I mean, it's, you know, it's difficult for me to talk about because I am a fanboy of all of this stuff. I, I want this to succeed. I, I put a tweet out yesterday that was saying, it's just like, I, I don't understand the desire to just hate on all of this and to like, I, I know, but like, to call out all of the like, everything doing wrong. In my opinion, it's like, like, I'm not in denial. Like, that's the thing is, I'm not in denial of where Nintendo is or has been the last couple years. I get it. When",
            "start": 804.04
        },
        {
            "text": "all of the like, everything doing wrong. In my opinion, it's like, like, I'm not in denial. Like, that's the thing is, I'm not in denial of where Nintendo is or has been the last couple years. I get it. When they do something right, I want to celebrate it because I enjoy it. You know, when they release Star Fox Zero, I'm going to say that I'm not happy with it. When they release Smash Bros. or Mario 3D World or Donkey Kong Tropical Freeze, Mario Kart, Mario, I'm going to be like, 'Hell yeah!' When they release something good that's not for me, Splatoon, I'm going to say that this is good, not for me. You know, it's like, I, I feel like I have a fairly level head when it comes to, I can, I can be critical of them. I'm not just going to completely, everything's a rubber for. Yeah. So I, I did, I also did not expect all this information to come out. Like, I knew that they're doing their financial report thing. Nintendo always does this, and what they do, it is never consistent. Sometimes we've seen them announce games, usually",
            "start": 844.84
        },
        {
            "text": "information to come out. Like, I knew that they're doing their financial report thing. Nintendo always does this, and what they do, it is never consistent. Sometimes we've seen them announce games, usually smaller games. Sometimes we've seen them not announce anything, just give numbers. Sometimes we've seen them come out and announce, I think, uh, the 3DS at some point was first talked about, um, at the, maybe it was the New 3DS. It was one of the, at the financial things. So it's like, no, there's no guarantees of what you're getting in. But every single time NeoGAF explodes with hype. Nintendo has something unique about it, unlike any other dev, publisher, like, console maker, anything where anytime a Nintendo announcement's coming, the internet explodes with, 'We're getting F-Zero! We're getting Star Fox! We're getting Metroid! We're getting this!' Megatons left and right. As an outsider, the thing is, and I speak as an outsider, and I speak for you as a fanboy, we want Nintendo to succeed. I want NX to be awesome. I want there to",
            "start": 891.4
        },
        {
            "text": "we're getting this megatons left and right. As an outsider, the thing is, and I speak as an outsider, and I speak for you as a fanboy, we want Nintendo to succeed. I want NX to be awesome. I want there to be the Metroid game all the Metroid fans have been waiting for, the Mario game I'd love to play, like the Zelda, you know, the, the Zelda game that is ported over and is better on NX and all these different things. I want them to succeed. And it's one of those things where it, it's very much to, you know, draw the parallels. It's very much like when we were going into PSX and we're like, 'Are we going to get Crash? Clearly they're going to announce name changes. We're going to see Sony Bend's game, da da da da.' And then when we got there and it none of that happened, and you're like, 'Well, what the, what the fuck is going on? Why is it not going the way we thought it was?' This seemed like this is how it was going to be. Like, E3, when I was like, for PlayStation, I'm like, 'There's going to be 20 minutes on",
            "start": 936.4
        },
        {
            "text": "the fuck is going on? Why is it not going the way we thought it was?' This seemed like this is how it was going to be. Like, E3, when I was like, for PlayStation, I'm like, 'There's going to be 20 minutes on PlayStation VR,' and there was two and a half. It's, you get into these things where you, we all start talking about things in such a way, like we talked about Fallout 4, but the opposite, where, where Fallout 4 panned out the exact way we said it was going to be, that they were going to do it at E3 and it would be out that year. You get in your, into your head that like, of course, we've said it, this podcast has said it, this journalist is saying, everyone is saying NX will be talked about at E3 and it'll be the big thing, da da da da. And so you get in and like, that's the right move. That's the way it should be. This is the way Nintendo should do this. And then when they come, they're like, 'That's not at all what we're doing.' You're left with, 'Well, what the fuck? Like, that does, why are you doing something that is'",
            "start": 980.8
        },
        {
            "text": "is the way Nintendo should do this. And then when they come, they're like, 'That's not at all what we're doing.' You're left with, 'Well, what the fuck? Like, that does, why are you doing something that is so, why are you doing the opposite of something so obvious?' And then, you know, that's classic Nintendo. Like, that's what they do is it's like, you, everyone feels like they have the answer, and then Nintendo does something totally different. And, you know, recently that has been the wrong decision seemingly, you know, or like, pretty much for sure. Like, that they have made the wrong choices. Um, with the whole E3 thing, with all of this, I, I'm right there with you. We've talked on countless podcasts about Nintendo's going to come out at E3. The question wasn't, are they? The question was, are they going to have a, um, a Direct or press conference? Sure. We've talked about that so many times. So the fact that they're just not even going to talk about NX there, definitely a shock. Um, having said that, a couple days ago, I was",
            "start": 1014.68
        },
        {
            "text": "or press conference sure we've talked about that so many times so the fact that they're just not even going to talk about NX there definitely a shock um having said that a couple days ago I was talking to Kevin and I was just like I can't believe we are weeks away from the NX announcement the reveal of all of it like that's crazy like yeah we've heard rumors for so long but like it just seems a little close to like get that much information especially with where we're at with the Wii U and all this so when I first heard all this I was like oh man like this sucks I was looking forward to E3 so much for this now I'm still looking forward to E3 but like the thing that I was waiting for is not going to be there you Mega 10 announcement but it's like the more I think about it the more I'm like man business-wise like this might be the only way Nintendo can succeed I don't think this means Nintendo will succeed but I think that they're setting themselves up so at least there's a possibility",
            "start": 1054.56
        },
        {
            "text": "man business-wise like this might be the only way Nintendo can succeed I don't think this means Nintendo will succeed but I think that they're setting themselves up so at least there's a possibility you know they're being stubborn by staying in the the console space I truly believe that I wish they'd go and just make games for Xbox and PlayStation but they're not they're making a console so **** you steam with that being a fact you know they're sticking with it I me as a fan I'm looking like all right how can this succeed how can this work and I think that they need to let the the Wii U die and everyone's going to say oh the Wii U is already dead it's not though like as long as there's people that are um talking about like the complaining about Zelda like Nintendo **** them over for putting Zelda on the other thing they've been waiting for it here and delaying it and all this stuff it's like as long as that's happening the Wii U is not dead like the Wii U is still something that",
            "start": 1093.72
        },
        {
            "text": "putting Zelda on the other thing they've been waiting for it here and delaying it and all this stuff it's like as long as that's happening the Wii U is not dead like the Wii U is still something that people care about people still are waiting for certain games on it so it's not dead and I think that Nintendo's making a smart call by pretty much just nose diving the thing and giving space to then make an announcement and to have that direct I think if they were to have done the direct yesterday they'd have nothing to show and that's the problem like I liked that this was at a business Financial thing and that like all the boring **** all the bad news is coming out now it's coming out in a way that's it's before E3 whatever you know of course yesterday the internet was as of recording this a buzz with all of this and everyone having their opinions but then E3 is going to happen everyone's going to be topping with the PS4.5 the Xbox 1.5 all the new games all this stuff it's just like",
            "start": 1142.12
        },
        {
            "text": "a buzz with all of this and everyone having their opinions but then E3 is going to happen everyone's going to be topping with the PS4.5 the Xbox 1.5 all the new games all this stuff it's just like and then whatever they think of Zelda um give that some space and then sometime later this year they confirmed that uh Nintendo new president confirmed that there's going to be an event and they're going going to announce the features price software at launch and other details by the end of the year so I'm like okay thinking about all of that we we're targeting March here that means that we're going to get a launch lineup and when you think about the the teams that haven't released games in a long time like the the teams that worked on Mario 3D World Mario Kart 8 um Retro making Donkey Kong Tropical Freeze they haven't made games since 014 like that's a long time had a lot of time yeah they're doing something obviously and when you look at the what's been happening on the Wii U in the last",
            "start": 1181.32
        },
        {
            "text": "Freeze they haven't made games since 014 like that's a long time had a lot of time yeah they're doing something obviously and when you look at the what's been happening on the Wii U in the last couple years Smash Bros notwithstanding which probably will be ported over um there hasn't been much going on and it was it's either the their big games like Mario Maker or things like Star Fox or um the Mario Tennis game or Animal Crossing which are all the spin-off games and even they were not given the level of polish that Nintendo is usually known for it's like why is this all happening and it's kind of embarrassing you know it's kind of bad and as a Nintendo fan I the one thing I can stand on is the Nintendo games are amazing so when they release ones that aren't it's like **** you know I don't even have that and I hate that Star Fox was caught as a casual te in this because I love Star Fox so much but like with the other stuff I'm like all right cool this is necessary to kill the Wii",
            "start": 1226.12
        },
        {
            "text": "even have that and I hate that Star Fox was caught as a casual te in this because I love Star Fox so much but like with the other stuff I'm like all right cool this is necessary to kill the Wii U you my and again like I'm not the business guy obviously NE neither are you you you have to imagine Nintendo ran aill scenarios and where they are and da d da I just feel like the Wii U you're talking about nose diving it this year right and I'm not trying to I'm not at all trying to be insulting to the Wii U it's already been on its way out we've already been saying all these different things and I feel like the messaging could have been so different if it was E3 here's NX it's out this fall and it's time you know Zelda's hitting at the same time on both units die there wouldn't be so much anger as right now there's this anger and and honestly I think a lot of the anger is the usual internet her purose hyper just like you're seeing with PlayStation 4.5 oh this is a middle finger do us",
            "start": 1271.04
        },
        {
            "text": "anger as right now there's this anger and and honestly I think a lot of the anger is the usual internet her purose hyper just like you're seeing with PlayStation 4.5 oh this is a middle finger do us they're **** us over D it's like well how often are you playing your Wii U like and don't get me wrong there are definitely plenty of people out there who are really into Wii U but there's other people are like that sucks I bought a Wii U I've had a Wii U and that's why I've been leaving it plugged in it's like what do you care it's still you'd still get the game there if you want it that way and if you're going to buy the NX you're going to buy but what I'm saying is if there could have just been that 3 Monon layover of like okay cool the Wii U is riding off into the sunset into the NX whereas now now there seems like there's this whole half a year a little bit more nine months where it's like all right like I now I feel screwed or whatever I feel like I can't be excited for it for",
            "start": 1312.6
        },
        {
            "text": "whereas now now there seems like there's this whole half a year a little bit more nine months where it's like all right like I now I feel screwed or whatever I feel like I can't be excited for it for another nine months it's going to be nine months of or honestly I guess more like six probably more like five getting your face rubbed in how bad everything is right now and there's nothing to play in this unit you really were a champion of and you were talking about but there's no good news until that an that event comes out and even the event though is going to be marred by can we trust them can they keep this up this is what they've been trying to do forever have all these games that you know Nintendo fan wants Nintendo fans want and it hasn't panned out that way especially with the Wii U so how can we look at them now and be like well they're going to get it right this time I mean I so I guess where I stand with that is that's what I wanted right that's what we've been talking about",
            "start": 1346.88
        },
        {
            "text": "so how can we look at them now and be like well they're going to get it right this time I mean I so I guess where I stand with that is that's what I wanted right that's what we've been talking about forever and I feel like I there is a change now where I believe in this plan that they have in that I think that that is too soon I feel like the the nose I it's the space thing I do think that letting it die and Nintendo taking a step back working behind the scenes planning exactly what they're going to do at an event that they completely control they are going to be the focus of it entirely and coming out and being like this is the NX this is how powerful it is and again this is all assuming the NX is what we want it to be but that's what I'm going I'm going to keep going down that path I'm going to keep want believing that this is a good thing they're going to come out give all this good news here's the launch lineup here are the games you want here are games that aren't launched but",
            "start": 1384.2
        },
        {
            "text": "going to keep want believing that this is a good thing they're going to come out give all this good news here's the launch lineup here are the games you want here are games that aren't launched but are going to be coming throughout the year you know here is the plan and I think that that will be better served at it as its own thing down the line I think that we need to get our faces rubbed in the dirt for but my my counter argument that is like haven't you already been doing that hasn't that been this entire generation but but that I think but there's a difference to me between living it and not having it you know I'm saying I I don't want like I don't think it needs to be like a cross fade like it can't be like that it needs to be more just like it's done here's something new we yeah the Phoenix Rises From the Ashes not so much just uh like oh seamless transition like we we understand we're bad let's let's here's a fresh like restart yeah I guess that's my thing is I don't want it to",
            "start": 1423.56
        },
        {
            "text": "Phoenix Rises From the Ashes not so much just uh like oh seamless transition like we we understand we're bad let's let's here's a fresh like restart yeah I guess that's my thing is I don't want it to be a restart I want it to be just a total new start total new push this is a totally new thing this isn't the continuation of the Wii U's cycle this is that cycle is done this is new sure that makes sense",
            "start": 1466.76
        }
    ]
}