{
    "id": 1768,
    "video_id": "JDyK1MxsuUY",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How To Make Colin & Greg Live Better - The GameOverGreggy Show Ep. 129 (Pt. 4)",
    "description": "Colin Moriarty wants advice on how to improve Colin & Greg Live.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1464246000,
    "duration": 2290,
    "transcript_chunks": [
        {
            "text": "Thanks to Amazon Video Games for supporting Kinda Funny Live. Amazon debuted an awesome program for their Prime members, Prime Gamer pricing. You can now get twenty percent off all your game pre-orders and also any newly launched games up to two weeks after they come out, valid on physical video games. Learn more at Amazon.com/gamesave. Kinda Funny Live 2 is this Saturday and Sunday. If you haven't got your tickets already, go get them at KindaFunny.com/tickets. Colin, what's your topic? I want to talk about Colin & Greg Live, which is our morning show on Twitch. We've been doing it since the day we launched in January 5th, 2015, pretty much every weekday. We've missed that, I would say cumulatively, probably 5 days in that time, with the exception of the two weeks we took off into the air. And so there's a pretty consistent product, actually, most consistent product in terms of like air time. I'd say it's it's five, six, seven hours a week, um, and I wanted to kind of",
            "start": 0.0
        },
        {
            "text": "into the air. And so there's a pretty consistent product, actually, most consistent product in terms of like air time. I'd say it's it's five, six, seven hours a week, um, and I wanted to kind of openly bounce ideas off you guys and just kind of a notion I had about Colin & Greg Live, right? So my thought about this particular show, I was talking about this show with, who was I talking about about it with? Okay, I like it. I was talking about Nancy Reagan. Nancy Reagan, who is dead, ghost of, never didn't talk too hard. But I was talking, I was talking to someone in the industry, high up at a big developer, and Ted Price, you know, and you know, we're talking about the show and he's like, and he was like, this is the show with the greatest, really the greatest potential because it's it's that you guys do because it's different. And I started really think about what he was saying because I was like, well, that was the way I pitched it to you guys to begin with, is like, let's do something a little different, um,",
            "start": 56.36
        },
        {
            "text": "it's different. And I started really think about what he was saying because I was like, well, that was the way I pitched it to you guys to begin with, is like, let's do something a little different, um, and my thoughts are, are we putting enough, are we, we're talking, I like the bandwidth is full, right? Like we have no more bandwidth, but are we making a mistake by not putting more time, effort, and thought into that show in particular? And do you agree with the assessment of this learned gentleman that this show might have way more untapped potential than almost anything else we do? We just kind of do it, and a lot of that's on me, obviously. I mean, it's my show, it's our show, Greg and my show, but is there some, where do you see the show growing? Do you see the show changing? Because basically the impetus that I wanted that of this particular conversation was, I was thinking about going to the audience and being like, what do you want the show to be? Because like, it's just whatever I want it to be, and it's",
            "start": 102.44
        },
        {
            "text": "I wanted that of this particular conversation was I was thinking about going to the audience and being like, what do you want the show to be? Because like, it's just whatever I want it to be, and it's just stupid and funny. And what we've noticed is that the numbers have gone down from Karns, from like five or four thousand to like 5,000 to 3,000, but the show is way more profitable, gets like tons of tips. So like, and subscribers. So that the numbers are kind of inverse where the actually the number, the viewers, daily viewers have gone down, but the money that we make off the show and all the practical things that we need to worry about in the business are actually way up. So what's it, you guys having both coasts of the show and also doing the show without us, right? I'm curious like what your thoughts are on this and if it would be a wise play for us to go to the audience of whether now in this video or in the few in the near future and be like, what do we make this show? Because it was modeled after",
            "start": 148.01
        },
        {
            "text": "on this and if it would be a wise play for us to go to the audience of whether now in this video or in the few in the near future and be like, what do we make this show? Because it was modeled after things that were way more serious and the show is totally like not serious anymore. Yes, I kind of like that's what makes me like doing it. So I don't want to get up and do like, I was wondering like, we make it 60 minutes, we have segments, do we like to have everything in it? So it begins this and then it goes into this and then it ends with this. And I guess kind of boring, you know, but maybe that's what people want. Maybe that's why the numbers have gone down, but then would it be more profitable? Yeah, so I personally like the show, but I wanted our normal shenanigans, right? Like I, I know we've, there, there have been instances where we have to kind of get through it. And I think on the shows that I've been on in the last like two months, the ones that I've enjoyed the most are the ones where we just have a",
            "start": 185.87
        },
        {
            "text": "been instances where we have to kind of get through it. And I think on the shows that I've been on in the last like two months, the ones that I've enjoyed the most are the ones where we just have a bunch of stories. Some of them are fun, some of them are serious, some of them are worthwhile, and some of them are just dumb to read. And we know that we're gonna be able to vamp off each other, shoot the shit. It really is to me, I think the power of the show is the same power that we always have in everything we do. It's a bunch of us shitting around, talking about stuff and having a good time. And people like to have a good time. Like people like to watch people having a good time. And we're having a good time, they're having a good time because at the end of the day, there may be all halfway across the world someplace where there either bored or just need a break for a half hour and they want to watch a bunch of guys shit, goof around, right? I mean, that's that's my thing is when I've seen the tips come",
            "start": 220.52
        },
        {
            "text": "someplace where there either bored or just need a break for a half hour and they want to watch a bunch of guys shit, goof around, right? I mean, that's that's my thing is when I've seen the tips come through and I've seen people who respond very positively, whether it's tip or a new sub or something like that, it's always after some stupid back and forth between Kevin or some really insightful pieces of information that came from another dumb shit joke that we're talking about about a story, you know? And I think all that's built on a foundation of you guys actually being a strong knowledge for the industry, especially for it, specifically for games. But once you get that out of the way, I personally just like it when the shit show goes off the rails. Greg, with you, where your loss is your show as well. I mean, I think you go either way. I think that's the thing. I think if we're gonna have a bad day, it starts with Colin & Greg Live. It starts with you're late. Kevin yells at us to get in the room. We",
            "start": 254.42
        },
        {
            "text": "as well. I mean, I think you go either way. I think that's the thing. I think if we're gonna have a bad day, it starts with Colin & Greg Live. It starts with you're late. Kevin yells at us to get in the room. We don't get in the room. This is happening. We bicker between the three of us about something stupid. And then I'm off on a bad mood. I mean, so it's like those the days where I'm like, shit, cancel this. I'd rather answer emails. I'd rather play in PS I Love You. I'd rather edit Thank You videos. I'd rather respond to Patreon messages. I'd rather do all this stuff. But then when it works and we're all in a good mood and we all come in ready to make a show and positive and we have that energy together, that's when it's shit awesome. And that's when there's a million subs and there's a million tips and everything's great. And it's a product you can totally be like, yes, this is shit fantastic. But the problem is that with there, you know, your ass, should there be structure? Because it should, of course,",
            "start": 293.57
        },
        {
            "text": "great and it's a product you can totally be like, yes, this is shit fantastic. But the problem is that with there, you know, your ass, should there be structure? Because it should, of course, there should be. I think that's one of the reasons why Beyond worked. It's one of the reasons why this works. It's one of the reasons PS I Love You works, that you know what your responsibilities are and how to hit them and where to go and all that. And I think we get into this weird thing of like, you know, I'm texting you like 10:40, like, are you come, where are you? I don't know if you like, there's a day, I understand you're home and I thought you were dead because like, I didn't hear him leave last night and he's not here now. Like, I don't know what's happening. And it means like this weird flux, um, just like if it's if it's haphazard and stressful to get started, then it just it has a bad tone. So I talk to y'all at the time about it. We get to set it right. Like when we like that PS I Love You that nobody liked,",
            "start": 329.22
        },
        {
            "text": "if it's haphazard and stressful to get started, then it just it has a bad tone. So I talk to y'all at the time about it. We get to set it right. Like when we like that PS I Love You that nobody liked, heard a lot of people then like where we sat down, your first thing is like, I'm tired, it's been a long day. And then people like, we hadn't said anything, nobody would know. You know what I mean? Like that's what, um, when I that day, so nobody knows this, uh, like Christine and I break up on a Sunday. I come back, immediately go out to Wing Wings and come back and go, Mom, go to bed. I saw you for like two seconds, you're on living. But I wanted to talk about it. And so that morning I woke up, we did Colin & Greg Live. We had, we started into lunch and then we did the meeting. I broke down in tears and told you all that we broke up. And you're like, I can't, how did you do that? Like for me, like the part of the job I shit hate is the emails, is the planning, is the shit, is this thing, is this back and forth to",
            "start": 361.62
        },
        {
            "text": "all that we broke up and you're like, I can't, how did you do that? Like for me, like the part of the job I shit hate is the emails, is the planning, is the shit, is this thing, is this back and forth to somebody about a W-9 that we need to fill out after this. It's all these dumb, stupid things, right? But when I get to be in front of the camera, I have to ignore everything. I get to ignore everything. And so if that can be pure, if that can be as excited, if that can be us, even if we are any of us interplay between each other, it's bad. You know what I mean? Like we've had an argument or something right before we went on. If we can all check it and just be wow and be the people we want to be, that's when it's the best. And we leave here on an up note. Whereas like, I think if the show is bad, where we come in with baggage over us, or I come in with a chip my shoulder that it's later, I didn't know, or Kevin, shit, again, was asking me like, comes out, he's like, yeah, what is it? A every good morning at 10:50.",
            "start": 397.59
        },
        {
            "text": "with baggage over us, or I come in with a chip my shoulder that it's later, I didn't know, or Kevin, shit, again, was asking me like, comes out, he's like, yeah, what is it? A every good morning at 10:55, you come on, you go, dogs go by. Like, why are you, there's four more, four of us right here. You know what I mean? Like, it's these little things about like, it's not that that's what sets me off. It's the Nick thing of we're just talking about, not the Nick thing, but like, that's the acceptable, that's the tiddlywink that set it off because I am upset that I, you know, my schedule is always shit in the morning where I wake up and today I wake up and I put the shit on myself. Like, we've put everything on it. I wake up, right? Well, on your satchel, huh? Why me? Shit on myself. Yeah, it is a good, it's like a good exfoliator. Yeah, no, you know, I, I wake up and then I, I'm waiting for my personal laundry to come or whatever. It fun, it gets here. I give it to them. I answer comments in Colin. I'm like,",
            "start": 436.2
        },
        {
            "text": "like a good exfoliator. Yeah, no, you know, I, I wake up and then I, I'm waiting for my personal laundry to come or whatever. It fun, it gets here. I give it to them. I answer comments in Colin. I'm like, cool, we're getting close to ten. And that's usually when people start showing up. So I want to make sure I get people in the house. Then I'm like, oh yeah, I have a phone call about this project. I get on the phone call. You guys come down about. And then I'm now behind the schedule I wanted to be on. It's like, so I'm already like amped up. So if it is the Kevin comment, if it is Colin being late, if it is this, like that's just another thing. It was like, and then it's harder to shake it. And then if we do have some dumb exchange, you know what I mean? Like whether it's me and Kevin, whether it's you and Kevin, whether it's us, when it's all of us, whatever, it's me and Nick. Like that's all it takes to set it off. So to get to Colin & Greg Live, yeah, I think like I, I think standardizing some of it would help. And I don't",
            "start": 475.65
        },
        {
            "text": "whether it's us, when it's all of us, whatever, it's me and Nick. Like that's all it takes to set it off. So to get to Colin & Greg Live, yeah, I think like I, I think standardizing some of it would help. And I don't mean standardizing in a static shit way, but I do think that, you know, 10:40, the stories are in your own. I mean, like it isn't a sliding. And that works for me to where it's like, whatever my responsibilities, 10:40, I'm not in the showers. Today was in the shower 10:45. You know what I mean? Like we turn the shower on the jaws at the cinema. Exactly. Notes that I put my the wall. We got that. We have that's always like literally the same time. Yeah, it was pretty well. I that's the thing is like we standardized it to the point where there was, okay, here we go. We're getting ready. We're checking our shit. We go rather than the shit coming in behind us. That's the thing where I can't get away from the shit. Yeah, I mean, I would love to see from that show because I've pretty much stayed out of the the planning",
            "start": 513.78
        },
        {
            "text": "than the shit coming in behind us. That's the thing where I can't get away from the shit. Yeah, I mean, I would love to see from that show because I've pretty much stayed out of the the planning execution over for a while. But what I would love is there is only that's true. So I mean, but but ain't I see Kevin being really stressed out and you like his first words to you right before you guys have to go on as a stressful, right? So he is stressing you guy. And I see it because he does it to me sometimes when I had to be on the show and I don't like it. But I don't also don't like putting him in that spot, right? When he has to come over to me for the third time and say, can you please come into the room so I could do a sound check? Otherwise we're gonna, there's gonna be no sound. I don't know what's going on. I need someone to speak into a mic while I can listen to it, right? And it puts me on edge. The way to alleviate that is to have what you're talking about, which is a set production schedule that",
            "start": 549.69
        },
        {
            "text": "on. I need someone to speak into a mic while I can listen to it, right? And it puts me on edge. The way to alleviate that is to have what you're talking about, which is a set production schedule that you got to lead. It has to be you, right? Cause we're always the ones that like, you're the one constant the show. So you need to be the one that's like, it is your show. Yeah, I mean, for the most part, like, you know, Greg's able to put something of the document, but you're the one gathering just on the content and you're the one honestly that it's, you know, you anchor it. You're the anchor the show. So to me, like having more of a stringent format that we can play around with, I think would be a good idea. Like I'm not saying we never break the rules. Like we'll always break the rules, but let's know what the rules are. Slightly dynamic. Exactly. Yeah, that's so that that's kind of the the the the meat potatoes. But I think is on one hand, I take a lot of pride in the show because it is easily, like effort put into",
            "start": 586.83
        },
        {
            "text": "are slightly dynamic. Exactly. Yeah, that's so that that's kind of the the the the meat potatoes. But I think is on one hand, I take a lot of pride in the show because it is easily, like effort put into the show. Like we don't like Greg and I don't really talk about how like we didn't even plan the show before we did it the first time. We didn't talk about it at all. We just did the show because we recognized it's so much together that we were like, we know exactly what the show it. We brought on the same page. It's and the show in my mind is kind of like my vision for it in a way it would work better. So in one way, I'm like, great, proud of it because I'm like, this is easily the most profitable thing we do for time spent on it. Like we make like the show makes quite look, I don't think it is though. I think then that's that's where my take is on the whole things that even though the money's went up, it's still not near the money that we make on the other shows, even per time put into it when you check in the",
            "start": 622.44
        },
        {
            "text": "that's that's where my take is on the whole things that even though the money's went up, it's still not near the money that we make on the other shows, even per time put into it when you check in the consider sponsorships or just like the overall ad money when it all adds up in this and that and whatever. Um, but I I think that it's interesting where it's it's worth doing. I think that's the most important thing to keep in mind that's worth doing. But, um, I I think that it again, I agree that it's at its best when it's you guys having fun, you know, and when it is more of a fun thing. It's funny with Nick was saying earlier about how I think he's not more Kinda Funny Live where it's like, I it's not how you would do it, but it works. You know, I feel that way about it. Like definitely, definitely not how I would do it, but it totally works. Am I cool? Um, I think that it if it was more of an actual news podcast and that could be a different product to like, that's the thing is it doesn't necessarily",
            "start": 658.32
        },
        {
            "text": "how I would do it, but it totally works. Am I cool? Um, I think that it if it was more of an actual news podcast and that could be a different product to like, that's the thing is it doesn't necessarily need to be Colin & Greg Live, but I think that actually really getting into the news is what people want from from you, you know what I mean? Uh, maybe I don't like that. And that's that's the hard thing. That's that's the hard thing that that's for me to read is like, I don't know. Like the the I I like that's why I need to like, I need more feedback from the audience specifically because it's hard for me to know why the show is profitable, but also understand why the show shed viewership is because it's definitely it's not a show for casual Kinda Funny fans. And that and it was when we were not really a defined entity really. So it was like something I was like very malleable and people were in and out. But I've noticed that like the more off the rails it's gone, the funner it is for me to do. And I more and",
            "start": 699.18
        },
        {
            "text": "entity really. So it was like something I was like very malleable and people were in and out. But I've noticed that like the more off the rails it's gone, the funner it is for me to do. And I more and more or less we have and the more tips we get and more subscribers we have, but the fewer viewers we get. Yeah. And so like for me, I'm like, I don't know. Like I don't, I don't know what I'm supposed to make this into because part of so going back to what my friend was telling me is like, this show has significant untapped potential, but it seems like it needs structure. And to me, I'm like, structure's good because it was modeled after shows that have significant structures are on TV or on the radio. You can't just like shit do whatever you want for any old sub. Tell me 45 minutes tomorrow, be an hour and a half. Like that's possible. And so in my mind, I'm like, it's gotta be a confluence of both things. Probably a less less visual show and that way it can be made an audio podcast because a lot of people who I",
            "start": 748.17
        },
        {
            "text": "half like that's possible. And so in my mind, I'm like, it's gotta be a confluence of both things. Probably a less less visual show and that way it can be made an audio podcast because a lot of people who I wise in the pocket like it does not work as a podcast. It will not work as a podcast. Trust me, it doesn't work. But we can make it work. PTI, which is a TV show, does work as a podcast. I listen to it as my cause I don't watch the show anymore. So, um, I think part of it is going to be a collaborating with the ideas of some sort of structure. Like making it an hour, choosing only five news stories or something a day, the most five important things to talk about. Totally aping what PTI does and putting a clock on the board that forces us to only read the story and talk about it for a minute. Rewriting the stories to condense them, which will create more planning. But then I feel like the show loses its soul. And then I wonder if the show is just not meant to be any more than what it is, you know? Um, but I",
            "start": 787.41
        },
        {
            "text": "stories to condense them, which will create more planning. But then I feel like the show loses its soul. And then I wonder if the show is just not meant to be any more than what it is, you know? Um, but I go back to this idea of there's nothing like it. Like there really isn't anything like it. I'm really proud of that. Like there's their shows that are more serious and better produced that talk very gregariously about games. Boy, our product is unique and it is inspired by things outside of games. But the things that inspired it are way more structural. And we've let Kinda Funny kind of infiltrate like the modus operandi, the way we do things, infiltrate the spirit of the show. And I think it's made it more fun. Like I enjoy doing the show way more the last like few months than I've ever enjoyed dinner because I just think it's like it's shit stupid. Yeah. But then there are people in the comments to Tim's point where though I just get into the news. But then there people economy like this is so",
            "start": 833.85
        },
        {
            "text": "because I just think it's like it's shit stupid. Yeah. But then there are people in the comments to Tim's point where though I just get into the news. But then there people economy like this is so shit, grand whiteboard, whiteboard. And and I'm like, I'm like, we, I mean, like what we did a show with Ramon, we didn't do the news at all. Yeah, you know, and I think that's the key thing, the point is like, okay, so like, yeah, there's people are never gonna always agree. There's always going to be different groups that want different things. But it's like, all right, what are we doing? Why are we doing that show? We're not doing that show at least from now or the financial means or for the the views or anything because they're just not in comparison to any of the other shows you do. It's the only show that we have that has went down in any regard. Everything else goes up. Having said that, there is definitely like a loyal fan base around that show. And I think that show is very important to who we are. And I",
            "start": 876.88
        },
        {
            "text": "have that has went down in any regard. Everything else goes up. Having said that, there is definitely like a loyal fan base around that show. And I think that show is very important to who we are. And I think that that is the the importance of it is finding that essence of what that is. And I don't even think it's the news stories. I think it is just the back and forth between you guys and stuff. And it's like, if I could change things, I would go back and just call it the Kinda Funny Morning Show and have just rotating cast. It could be all four of us. It could be two of us, maybe three of us. It doesn't matter. It's some combination of us. We'd over the shit wall for an hour if we want to. Look, like I think looking at the news is a good thing to talk about because that's going to be new every day. And there's something that just gives you a springboard. But really, it's more just it is about hanging out and it's not about the news. It's about the hanging out. I think that right now it's kind of in",
            "start": 912.76
        },
        {
            "text": "and there's something that just gives you a springboard. But really, it's more just it is about hanging out and it's not about the news. It's about the hanging out. I think that right now it's kind of in that weird middle ground where it creates the dichotomy between the chat where it's like, get to the news or get the whiteboard. Where if it was about getting the whiteboard, it'd be about getting the whiteboard. The news would just be, you know, something to go out from there. And I think that that makes room in a perfect world where we have more bandwidth in whatever to then make another show that is a potentially daily news podcast that is structured and is something that goes up that is is, I mean, this is great. We're getting super ambitious here. But sometimes it is us giving our actual opinions about the news and not us shit around at all. Like PS I Love You, I think has a very, very ravenous fan base for a reason, you know? And it's because it is topical and it is released without any Patreon this",
            "start": 951.28
        },
        {
            "text": "the news and not us **** around at all like PS I Love You I think has a very very ravenous fanbase for reason you know and it's because it is topical and it is released without any Patreon this or that whatever but we need to remember the Patreon people because they're the ones that matter most yeah your PS I Love You is a weird I knew PS I Love You was gonna work and become popular and there's no doubt my mind that that what that shows can become popular because it's the show we used to do that made his popular begin with so I was like okay it's like kind of like you got to go back to the well for nostalgia everyone's well but you continue to the product well but what the weird thing about that show to me is that that shows like quite wild I'm unpredictable in a way where we do we start a show for 10 minutes talk about food people hate it right they remember they don't hate about their vocal minority people are mad about my comments then we did then we do a show or what I mean",
            "start": 992.48
        },
        {
            "text": "a show for 10 minutes talk about food people hate it right they remember they don't hate about their vocal minority people are mad about my comments then we did then we do a show or what I mean then we do it then we do a show where Greg goes and has to deal with the water bill guy and so like that and I go on like a 10-minute tirade about this this bar and everyone loves that and I'm like these two things are not different yeah I mean same but I that they are literally the same vamping nonsense but you liked one and not the other I'm like so I don't know what the **** you want so we're just gonna continue to do the show the way we want to do it and that's what we've done I think you only misstep we had a PS I Love You's entire run which I think is a **** super I mean I I I don't mean to Pat myself on the back PS I Love You was a **** very good podcast and and I'm proud of that show because it's exactly what the audience wants but the only misstep I think was the Rooster Teeth",
            "start": 1031.69
        },
        {
            "text": "to Pat myself on the back PS I Love You was a **** very good podcast and and I'm proud of that show because it's exactly what the audience wants but the only misstep I think was the Rooster Teeth episode and that a lot of that is my fault but I didn't want it like we should have done the show at all that we probably but we said we would never miss a week and we didn't and we don't we don't miss a week but I was **** shot that day I was like Jesus Christ but in the Sun this long ever you know so I was dying and and um so with Colin & Greg Live like I think what I want to do with the show in my mind is and people can leave comments on this podcast or you know you can tweet at us and so I'll read those whatever Facebook message wherever you like to do you could give us your feedback but what I'd like to do is find a more structural way for feedback to be provided over the next few weeks or months not a change the show for most exactly I think that's why I'm gonna do and then you see",
            "start": 1069.01
        },
        {
            "text": "I'd like to do is find a more structural way for feedback to be provided over the next few weeks or months not a change the show for most exactly I think that's why I'm gonna do and then you see because I want I want feedback from the people that watch the show I also want feedback from people that are lapsed and I want people fee I want feedback and people that understand what the show is what might need XYZ to get into the show because I do agree with my friend that like so are our main products are podcasts and and we do three I think great podcast three phenomenal podcasts um and I stand behind every one I think this is a great show in a fun show I think the Gamescast is a great show and I think PS I Love You's a great show um but I do agree that in the untapped potential area this Colin & Greg Live is on it's almost criminally underserved in a way where like I have to figure that out because the show can remain for years what it is in it will grow no shrink and we'll make a",
            "start": 1110.72
        },
        {
            "text": "Colin & Greg Live is on it's almost criminally underserved in a way where like I have to figure that out because the show can remain for years what it is in it will grow no shrink and we'll make a little bit money I will do whatever we want to do and like four and and I still say for like the amount of thought that goes into that show I'm super proud of of like what it's becoming it has this dismal ravenous fanbase of several thousand people that watch it every day and then thousands people watching and VOD every day and then a hundred people pay for it on YouTube so it's it's it's got it's like a little nice little fan base smaller than PS I Love You and certainly small in the GameOverGreggy and Gamescast so what I want to do is I kind of solicit some original feedback and just get where everyone's minds are at but ultimately I want to find a way to solicit feedback on what the show should be and here's like where my mind is with it this is this is the way I would",
            "start": 1151.67
        },
        {
            "text": "and just get where everyone's minds are at but ultimately I want to find a way to solicit feedback on what the show should be and here's like where my mind is with it this is this is the way I would restructure it if I could it's not make it 60 minutes we would have some sort of meeting beforehand about it not long not a long meeting five minutes where I'm like here's five stories there are 14 stories today those will be on PS I Love You I'm not too worried about that but here are the five stories for today X Y & Z Activision does is intended to this we have some sort of timer so we're just going to eight PTI everyone has and just be like top story gets five minutes second story gets four minutes third story gets three minutes and then maybe toss for the last two stories and then and then do tips and then do like Q&A and have like segments that are very defined at eleven thirty eight this segment begins at 114 this segment ends it you're late to it like there on PTI you just skip the",
            "start": 1187.91
        },
        {
            "text": "do tips and then do like Q&A and have like segments that are very defined at eleven thirty eight this segment begins at 114 this segment ends it you're late to it like there on PTI you just skip the segment completely you cut it in the segment and then it becomes a very defined show and we make it less visual more audio that way the show can be then be proliferated in audio podcast form we can get it right up on iTunes and all that kind some people that actually do it on that commute home wherever can go ahead and watch it so that's kind of like where my head's out with it but at the same time I want to make sure we have that spirit where if I have something to say or a tirade or Portillo's **** in my room or did something where I'm like I want to be able to talk about that like it's funny it's stupid that's what the show is and then I'm afraid that if we do the structured thing then it becomes more like the other shows are out there then it alienates the audience then we lose the",
            "start": 1226.49
        },
        {
            "text": "it's stupid that's what the show is and then I'm afraid that if we do the structured thing then it becomes more like the other shows are out there then it alienates the audience then we lose the entire spirit of Colin & Greg Live then we either have to go back we cancel the show so like that I mean the thing about is the structure I mean PS I Love You is structured there are segments you know what you're going to get but but we still get to be goofballs in there and do all this dumb stuff the timing thing would be the one where yeah we have to figure out how that would run you know I mean what does happen when we start with joke and run over and then we get to the top story we have five minutes per, or three minutes close to where we're supposed to be the break to me that's all stuff you figure out as you go and figure you know **** around with it in other words if there's not parameters that I'm not gonna stick to them I mean that's always been my rule my life like if there's not",
            "start": 1262.34
        },
        {
            "text": "figure out as you go and figure you know **** around with it in other words if there's not parameters that I'm not gonna stick to them I mean that's always been my rule my life like if there's not parameters I play I play game like hockey their parameters I follow the rules but if I'm just gonna like be like here's a show you know what you're doing a camera you've done this for **** ever right do a show and it can be as short as long as you want and it's all about your mood and it's all about all these kinds of things and it's like I don't know like then it's gonna be my show and that's and that's what I think Colin & Greg Live has turned into and I'm fine with that because I do I do think we're done that Kinda Funny Live where like that's the most hardcore audience right and maybe it is maybe it isn't cuz some people can't travel some people have the funds to do that however I do think Colin & Greg Live is more aligned with that hard core audience because it's just way easier to",
            "start": 1292.16
        },
        {
            "text": "it is maybe it isn't cuz some people can't travel some people have the funds to do that however I do think Colin & Greg Live is more aligned with that hard core audience because it's just way easier to access is so the people that are just ravenous about this nonsense at work or whatever it's for you guys but I want to be the show that it's not even about making more money because it's not like super relevant to me like I always want us to be more profitable I always want to be more in the black on all the kinds of but that's not the most relevant or salient point it's that like this is the product that is the most different then so should it be treated with the most care and that's and that's kind of the conundrum I had so I want to pose that too and then see what you guys look you know you saying that it's a interesting thing because I don't want to come across as just like I'm talking I like if it's not making money it's not worth doing but I do think that there's a value and I",
            "start": 1326.54
        },
        {
            "text": "you saying that it's a interesting thing because I don't want to come across as just like I'm talking I like if it's not making money it's not worth doing but I do think that there's a value and I get to fight with my girlfriend all the time about this where it making money is a sign that you're doing something right you know so you talking about the there's the most untapped potential and and I know you understand this but if you're not tapping into it it's worthless you know what I mean and I think that that money and money comes from views and money comes from from this or that or whatever that is all a sign of going in the right direction and tapping into that potential and I think that that is what we what we need to figure out and it's it's interesting where you're saying I I do think that the the that that success that the potential there is the less structure more freedom it is just hanging out it is just a glimpse into our minds you know and I'll just having fun so",
            "start": 1359.87
        },
        {
            "text": "I I do think that the the that that success that the potential there is the less structure more freedom it is just hanging out it is just a glimpse into our minds you know and I'll just having fun so maybe that's the answer I mean that's why I wanted that's why I need I need data cuz cuz my with with what you brought up with the structure I think that's **** awesome I don't think that's a Twitch show I think that we needed to think about Colin & Greg Live what is it it's a Twitch show it's a live show we're interacting with people and I think that is the the power of it turning it into a podcast I know people want that or at least they think they want that but the thing is no you would much rather us make a podcast for you you know and it's like you want to listen to the audio version of it that's different than a podcast you know what I mean that's just an MP3 at that point and I that's not just mincing words there I think that it's there's a different amount of planning a different amount of",
            "start": 1395.89
        },
        {
            "text": "different than a podcast you know what I mean that's just an MP3 at that point and I that's not just mincing words there I think that it's there's a different amount of planning a different amount of thought that gets put into that stuff and I think that the fun Colin & Greg Live in the magic of it and where the untapped potential is it's having fun it's being purely us making it the reason people are coming to is us whereas the other thing is news and you do the PTI I think that sounds like a great **** show I think that should be a podcast you know that should be a PS I Love You style thing where there is a format we can yeah we can have fun with it but it's still that's where it's on iTunes and it's you know being given out to people this way that way but the way that we distribute content is the most important piece of the puzzle because the more we have too many podcast then we are just podcast Colin & Greg Live is one of the few things we do that puts us in a different vertical in a",
            "start": 1436.06
        },
        {
            "text": "is the most important piece of the puzzle because the more we have too many podcast then we are just podcast Colin & Greg Live is one of the few things we do that puts us in a different vertical in a different category and we need certainly Twitch Presents yes exactly and it's like I feel like we need to make it more Twitch instead of more podcast if that makes sense no I said I mean it's it's it's in the exact opposite direction one of these answers is right right and I think that maybe Tim's right I think that the status will give us the status quo to give a status quo financially the status quo views maybe there's ups and downs it's just like I can't ignore I can't ignore the data that's been given to us right more money fewer viewers what what's more relevant and you know viewer drop-off is forty thirty thirty-five percent or so well you're reading that front-page promotion anymore from Twitch we're not getting its header, its prominence and there are other tangible intangibles I",
            "start": 1474.1
        },
        {
            "text": "is forty thirty thirty-five percent or so well you're reading that front-page promotion anymore from Twitch we're not getting its header, its prominence and there are other tangible intangibles I would say one in five years organically is left right sure after like you you factor in and that's just conjecture but I mean after you factor in Twitch placement all I can I don't know but it's like but then the tips are like through like once we were like once we really started reading tips through the roof once we started reading subs through the roof now forever the record subs are consistent I'm saying but like but no subs weren't always consistent because we weren't always getting we weren't even in reading substance to like 1100 now or 1300 we've been 1300 forever sure but what I'm saying is that we would get tips what I noticed back in the day on Colin & Greg Live in at anecdotal but what I noticed having been on the show almost every day is like we would get a lot of new subs and",
            "start": 1516.58
        },
        {
            "text": "is that we would get tips what I noticed back in the day on Colin & Greg Live in at anecdotal but what I noticed having been on the show almost every day is like we would get a lot of new subs and stuff you even see those numbers have been like you know 13 months 14 months whatever a lot of those our baseline months that actually started not in the beginning but in the summer and if you will get those numbers and those are numbers that I just like have observed like between nine and fourteen months or so but we started the show like longer ago than that so that's one of the things I'm saying is like once we paid attention to these things at work the no that wasn't really my idea that's Blessy thinks so I'm not taking credit for that at all but I so we have to kind of figure out as a **** like structurally I think like doing I like the idea of Tim and Nick doing their own show on on Twitch I think are gorgeous I think our Twitch presence should be not trimming games typically but like",
            "start": 1555.46
        },
        {
            "text": "structurally I think like doing I like the idea of Tim and Nick doing their own show on on Twitch I think are gorgeous I think our Twitch presence should be not trimming games typically but like L.O.L. another **** you know and and so that's what's fun of me but it's funny that I are you, Blessy, give me my hand it's funny to me that it's just it's it's something that I've it's just like kind of a given that we do the show but I've not tried to program it because it never seemed worth programming but then it's like well there it what my friend said to me being a knowledgeable personally that's interesting because he watches the show and they're their developers and publishers that watch the show right and I'm like it's just so silly but they like it they got a lot of pleasure out of it but it's so contingent on our personalities the you know what I think another factor that I think is really important to this is the fact that it happens every day and the fact that it gets promotion",
            "start": 1590.11
        },
        {
            "text": "but it's so contingent on our personalities the you know what I think another factor that I think is really important to this is the fact that it happens every day and the fact that it gets promotion every day so every day when people are in a you know on this side of the the coast at work they are they're seeing this pop up on their Twitter feeds because people look in their Twitter feed so it's like that's how they're there you know getting into it and I think that's something to really kind of keep in mind when it comes to our podcast and stuff it's all in a minute that's being tweeted throughout the day like maybe a new couple hours later you come hours later you and it's like I think that the fact that every day at the same time this thing is being brought up I think that's why people have this sense that the show is bigger than it is which is good that's the whole secret to what we do is looking bigger than we are making people think they were bigger than we are so the fact that",
            "start": 1630.7
        },
        {
            "text": "have this sense that the show is bigger than it is which is good that's the whole secret to what we do is looking bigger than we are making people think they were bigger than we are so the fact that there's people out there that think Colin & Greg Live is a big deal that's **** awesome because I don't know the numbers you know I mean they look at the concurrence I don't know you can tell oh yeah we used to get 5000 they wouldn't know the difference you don't I mean I think that that's the magic there and it's just like how do we take that and it's like how do we think about what the users are actually doing and engage with that and you kind of enhance that and and find the way to just give give the people what they want more and find out what other people are being turned off by which most of it is they're just not on Twitter at that time yeah and to be fair like I've stopped tweeting from the Kinda Funny account at all the last two months about the show like I just stopped because I'm",
            "start": 1666.96
        },
        {
            "text": "it is they're just not on Twitter at that time yeah and to be fair like I've stopped tweeting from the Kinda Funny account at all the last two months about the show like I just stopped because I'm like it's the same thing every day at ten-fifty like and and I tried to engineer Toldy we talked about this many times but like I've stopped actually been responding tweets and just instead of retweeting people like to empower users be like will tweet us your nice comments or your pictures of your Kult you know your merch whatever and that way it's like a nice feed of things that people can read about then I was like the weird anomaly here is that every day 1050 is still the same **** image in the same **** about Colin & Greg let's figure out something else say about so like I just didn't promote it at all so much because the click-through wasn't like great so like we there is there is much to figure out with the show but I do think but I do want to solicit and I will you can do in the",
            "start": 1705.3
        },
        {
            "text": "it at all so much because the click-through wasn't like great so like we there is there is much to figure out with the show but I do think but I do want to solicit and I will you can do in the comments in whatever get at me but I will do an organized I'll do it in an organized way that um that brings up in bubbles up the salient points and I do think that we have to figure it out because I like the show and I think it's stupid but that's why I like it and I want to know if someone identified why they like the show if the word stupid would come to mind for them it might and if that also is where that would turn off other people because I would understand that if someone's like this show stupid you should watch it why the **** I watch a stupid show but then maybe I like it when I get in there so I feel that Broad City action I Love You Notes which I think is a fantastic or super solid but smart good that actually caused excitement yeah archaea that we talked about the plane I don't",
            "start": 1738.27
        },
        {
            "text": "in there so I feel that Broad City action I Love You Notes which I think is a fantastic or super solid but smart good that actually caused excitement yeah archaea that we talked about the plane I don't think our lives actually like and again like I know people agree I think it's actually a surprisingly smart show because like it's it's two people that know each other very well and like how to deal with each other very well when that shows on like the comedy is good the the vibe is is pleasant and that's when I so I don't know it's Kevin turn on your shitty microphone and tell me what your thoughts are because you're you're the producer I'm you're the producer of the show so well so what like so you're the producer and I use that in the loose as possible sense by the way did I wanna I want to start honor you with that term so you're the producer of Colin & Greg Live so what would you do and I'm being serious like what would where do you see it what do you want out of it so I think that",
            "start": 1778.98
        },
        {
            "text": "to start honor you with that term so you're the producer of Colin & Greg Live so what would you do and I'm being serious like what would where do you see it what do you want out of it so I think that there's like two things like the future for it and things that we could do now to make things run a little bit smoother like we talked no you're right about all the getting in time in the news stories that's fine that that is on me but I'm talk about way more what is your vision for like an adapted yeah but like you don't want to talk about that a little bit sure hopefully that's what you want to talk about well just I'd like to see a change in that and like Greg said, no it has it has we don't start a tango party so it's it's 10 minutes better but still it's like we kind of all came to an agreement we sat together and we're like hey it will all be in in our seats at 1055 and that's why at 1055 I very loud I don't do it for you like you will come in I do it to get your attention",
            "start": 1819.48
        },
        {
            "text": "to an agreement we sat together and we're like hey it will all be in in our seats at 1055 and that's why at 1055 I very loud I don't do it for you like you will come in I do it to get your attention like hey it I'm putting it on standby because we were already supposed to be in our seats so what is your vision for the show though for the future I like the idea of having rotating seats not necessarily you to all the time I like it when they're on I like the different combinations I like seeing you with Nick seeing you with Tim you with both of them and I think that that's cool and I think if we incorporate that more I I don't think that's like a solid structure isn't gonna help necessarily I like the idea of just not having that structure like yes having like okay comments at the end how we got a structure now I know there's an order of operations but not sure not like a big old time and it's like ticking down yeah I think that like that could kill jokes that would happen naturally and would",
            "start": 1865.05
        },
        {
            "text": "got a structure now I know there's an order of operations but not sure not like a big old time and it's like ticking down yeah I think that like that could kill jokes that would happen naturally and would be a lot of fun I mean I just think that a little more diversity in who's hosting will go a long way cuz I love when they're on and I love seeing you guys mix up and who you guys are talking to it's a lot of fun yeah I like that too I don't know that that's in the cards I want them up beyond whatever they want and I like the idea that we came up with before which was like once or twice a week they just come on um I still see the show anchored by Greg and I I think I'd want to see a show that is nothing to do with me on Twitch that is more up Tim and Nick's alley because I like to heighten their personalities and get them out there especially because like I don't want um one of the cool things about doing this is that to me is that I like the idea of Nick and Tim being more internet",
            "start": 1921.6
        },
        {
            "text": "their personalities and get them out there especially because like I don't want um one of the cool things about doing this is that to me is that I like the idea of Nick and Tim being more internet personalities it's like not even really something I ever wanted there's something I was that's kind of happened and I lie i mean i like it i'm good at it but it's it's so i like the idea of you guys like seizing control making it she'll do better and more popular than mine there we go let's go skating this flaming garbage show or the internet we could we could Internet Explorers or we can every Monday at 9 AM talk about love and sex stuff could do that just have headlines and thumbnails and get the views that's more my alley as far as points concern uh I think we you're asking really is how do I grow the show right well that might be more of the like that and that's that's why I'm hearing from you is like you're asking while I'm asking what that what's most relevant right I think to me most",
            "start": 1962.88
        },
        {
            "text": "do I grow the show right well that might be more of the like that and that's that's why I'm hearing from you is like you're asking while I'm asking what that what's most relevant right I think to me most relevant is whatever strategy grows the show I don't think we necessarily have to us change it from a Content standpoint I think consistency would help in pits with cat look at what I'm here from Colin is that starting consistently and letting everyone know that yeah whatever is happening after that might be a garbage truck on fire but at least the **** thing left the garage at eleven o'clock every day so people know to count on that I think that's we joke around about it but I think that's very very important because if I tuned in at eleven o'clock in my busy day and it wasn't started yet how quickly could you get distracted IGN from 11 to 11:05 right that's the difference between someone going I need you right now for something you go I'm gonna make a bit excuse or we'll have no reason",
            "start": 1999.81
        },
        {
            "text": "quickly could you get distracted IGN from 11 to 11:05 right that's the difference between someone going I need you right now for something you go I'm gonna make a bit excuse or we'll have no reason they can excuse I'm gonna go right but I think the more salient point to use a term that Colin does is how do we grow it and that brings up a larger question of how do we grow our Twitch presence in general because we're really only doing that one show on Twitch right we talked about doing more streaming on Twitch having a couple shows like when we originally talked about me we were kicking on the idea of like okay you guys go from 11 to 1 and then Tim and I'll pick it up from 1 to 1 or some combination of that wish I still think will be cool but I don't know if that's the answer or not but really so it's hard to answer because so much of our focus is we are YouTubers who are flirting with this girl called Twitch right but we're married to YouTube when we're married to iTunes but the",
            "start": 2038.11
        },
        {
            "text": "really so it's hard to answer because so much of our focus is we are YouTubers who are flirting with this girl called Twitch right but we're married to YouTube when we're married to iTunes but the Twitch girl ah there's something there how do we get in there how do we pry those sweet sweet no all right no but any that's that's the question I think would actually I mean I'd love to hear what fans' perspective are but I think you're gonna get again I think it gave me a whole variety of response from that if you're digging you're gonna get trends sure I'd like trend the trend is gonna be when you guys are having the most fun the biggest thing is I don't think so i think whatever we put out there is what we're gonna get back so you saying the P.T. i think people are gonna want P.T. i think that's just how this works you know it's kind of the the game of you need to to always think about what you but it's just framing you know I mean I mojo option people didn't don't know what they want until you",
            "start": 2074.38
        },
        {
            "text": "how this works you know it's kind of the the game of you need to to always think about what you but it's just framing you know I mean I mojo option people didn't don't know what they want until you tell them exactly exactly and I think that that's you know where a lot is gonna come from but yeah there will be trends there will be a lot use we just need to really look into all of the comments and look at all the different avenues I think the forms you should write a post I think you're gonna get a lot of really good feedback there the comments there'll be a lot of stuff all over the place the Facebook group I think that it's all of these different groups that you know how all serve different functions but at the end of the day they're all part of this community and I think that that's where this all comes down to because it's what we do is for them and you know they're here for us and it is a really intrinsically tied thing so mm, much to think about, much to think about, to think about",
            "start": 2116.5
        },
        {
            "text": "this all comes down to because it's what we do is for them and you know they're here for us and it is a really intrinsically tied thing so mm, much to think about, much to think about, to think about Nick why don't you think about how this was brought to you I Harry's Shave Club stop compromising on your shave Nick and get started with Harry's for far too long you either paid too much for a comfortable shave or ill gross he's making me touch it you settled for a low price but low quality razor and hair yes he's making a touch my if you're listening the MP3 it was his neck Harry's offer something you've never had before a great shave at a fair price Harry's makes its own high-quality razors cuts out the middleman and ships them directly to you and half the price of the leading brand good shave good price it's simple get the best of both with Harry's Harry's starters just fifteen dollars that includes a razor three blades and your choice of Harry's shave cream or foaming shave gel which do you",
            "start": 2153.55
        },
        {
            "text": "good price it's simple get the best of both with Harry's Harry's starters just fifteen dollars that includes a razor three blades and your choice of Harry's shave cream or foaming shave gel which do you prefer and why as an added bonus you can get five dollars off your first purchase with the code Kinda Funny all in one word after using the code you can get an entire month's worth of saving for just or shaving for just ten dollars but cutting out the middleman Harry's offers an amazing shave at a fraction of the price those drugstore brands and shipping is always free Harry's will be five dollars off your first purchase with the promo code Kinda Funny go to Harrys.com right now and look for the Truman Set that's Harrys.com enter the code Kinda Funny to check out to get five dollars off and help support the show stop compromising give Harry's a try today ladies and gentlemen this has been The GameOverGreggy Show each and every week four sometimes five best friends gather on",
            "start": 2196.1
        },
        {
            "text": "off and help support the show stop compromising give Harry's a try today ladies and gentlemen this has been The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to Patreon.com/KindaFunny and get each and every episode early along with a bunch of exclusives and perks goodies you have no goodies and monies and stuff to toss go to YouTube.com/KindaFunny where break the show up topic by topic day by day until the entire thing posts as one big MP3 and YouTube video for your amusement this is the final time we get to speak to you before Kinda Funny Live if you're on your way safe travels if you're already here don't drink too much if you see Amy Gilroy hugger until next time it's been our pleasure serve you you",
            "start": 2237.38
        }
    ]
}