{
    "id": 1769,
    "video_id": "jlTxSWUSO_0",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What Is Rocksteady Working On? - Kinda Funny Gamescast Ep. 71 (Pt. 4)",
    "description": "We theorize about what Rocksteady is up to.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1464267601,
    "duration": 1119,
    "transcript_chunks": [
        {
            "text": "we know Antony or huge Overwatch fans and we are grateful for their support of Kinda Funny Live. Thanks again to the Overwatch teams of Blizzard and Activision. Are you excited for Overwatch? If you haven't bought it yet, check out Amazon.com/Overwatch to learn more about the game. Kinda Funny Live 2 is this Saturday and Sunday. If you haven't got your tickets already, go get them at KindaFunny.com/tickets. All right, as always, File Top of the Day brought to you over other Kinda Funny Forums. Go to KindaFunny.com/Gamescast's Topic. Hold on again, any, make a note to Kevin again. Yeah, you're Kevin. It's been 18 minutes since I last talked to you. Ryan Moroski says, what do you think Rocksteady's up to now? Did you go make a new IP? Good question. Oh, that's a great question. Yeah, I bet they're still, I bet they're doing, they'll do another licensed game. I think that they saw what worked with Batman. They saw the critical acclaim. They saw the millions of fans and I think",
            "start": 0.0
        },
        {
            "text": "yeah, I bet they're still, I bet they're doing, they'll do another licensed game. I think that they saw what worked with Batman. They saw the critical acclaim. They saw the millions of fans and I think they want to keep going with that. I'm sure WB is still trying to beat down their door to get them to pick up something. And I'm sure because that's the thing when you're like for the to let them finish their Batman trilogy, ignoring Origins, that wasn't theirs, to let them finish that. I'm sure WB's like, what's next? What do you want to do? You want to take on this character? Do you undo this? Do you want to do Justice League? Do you want to do a, do you want to do Batman Beyond, which is like my dream come, be my dream come true, horse. But there's so many different things, but I would still say they're gonna be doing a comic book game, a licensed comic book game. Yeah, I would agree. I mean, the thing though is that they have a lot of license to do whatever they want now. So, um, there, I'm sure that there are people",
            "start": 55.08
        },
        {
            "text": "be doing a comic book game, a licensed comic book game. Yeah, I would agree. I mean, the thing though is that they have a lot of license to do whatever they want now. So, um, there, I'm sure that there are people there that are creative that I want to do their own game, but I just don't know that that's the smart move for them. They can build a war chest and like a lot of, as long as they keep doing well, they can build up a lot of acclaim, which I think that I think they frankly, they lost a little bit of acclaim with the last Batman game. So I really, yeah, Arkham Knight. Yeah, I think that a lot of people weren't crazy about that game. And I think that I think they have, obviously, I think that they probably, I think that's why I think they do stay in with in comic books, excuse. I think they feel like they have something to prove and something they're not good, bad. I mean, they began with a Batman. It was good. It was, it was just not nearly as good as Arkham City. That's what I was insane. I think that they had a bit of an",
            "start": 91.44
        },
        {
            "text": "to prove and something they're not good, bad. I mean, they began with a Batman. It was good. It was, it was just not nearly as good as Arkham City. That's what I was insane. I think that they had a bit of an Uncharted syndrome of just like, all right, cool. Arkham City was awesome. Arkham Knight's kind of the same. There's this tank should I hate, you know what I mean? It would still like a great game. Yeah, it just, yes. But it, but unlike Asylum and especially City, I think like that game, like no one even talked about that game after like two months. Like it wasn't, it so that it was so the same. Yeah, it was. And but I think that like it just wasn't in Game of the Year discussion is was than anything. I think that they have something to prove. I think they overthought that game. I think that it's clear that they felt like they had to change too much and they didn't have to change much at all to make, you know, because their production value is so high. The writing is so on point. It's just like they need to go back to the",
            "start": 125.04
        },
        {
            "text": "they had to change too much and they didn't have to change much at all to make, you know, because their production value is so high. The writing is so on point. It's just like they need to go back to the drawing board and I think tweak some things, remove some things, tweak that gameplay, which I think is getting a little tired and a little stale. But I think my guess is that it would be like Justice League related. Yeah, I think I think that they obviously stay with one or others, they stay with DC, but they could do whatever they want. I could see them do another Batman game, just a different Batman. You don't mean there's so many different versions of Batman and alternate universes. I could, I wouldn't want that. I would much rather see them make a Superman game, see them make a Daredevil game, see them make a Ninja Turtles game. Like there's a million other grounded heroes that fight in an open world that I'd like to see. But I got also seem to be like, well, Batman's still **** the biggest thing going.",
            "start": 158.7
        },
        {
            "text": "a Ninja Turtles game. Like there's a million other grounded heroes that fight in an open world that I'd like to see. But I got also seem to be like, well, Batman's still **** the biggest thing going. How do we somehow capitalize on that? Maybe it is just we, what if we make a one in the DC Cinematic Universe? What if we do a Batfleck game? It would be cool to see Batman again. I just, I think that's selfish me to want that cause I think, yeah, don't get me wrong. I'm right there with you because he them do Superman too. I think no, I agree on person. John Horgan wants to know what video game characters would you like to see in a crossover game, not Smash Bros. type, but story mode centric. A couple years ago there was a big rumor going into E3 as there ought to be where a game called Nintendo Fusion was being talked about and it was going to be Metroid and Star Fox story based stuff. And I was like, that is **** awesome. At this point, I do not want that at all. But a couple years ago, yeah, I wanted that.",
            "start": 193.44
        },
        {
            "text": "being talked about and it was going to be Metroid and Star Fox story based stuff. And I was like, that is **** awesome. At this point, I do not want that at all. But a couple years ago, yeah, I wanted that. Real problem is I feel like it's hard to do that and not have it be super cheese ball or not work. We're **** Samus is talking to Star Fox, man. Know what the hell like I doing wrong? Another's crazy ass aliens and ****, Roy. But still like it was cartoon Fox and I'm this badass bounty hunter. What are we making this work? Yeah, I don't, I want that stuff. I don't really like that. I like things to kind of exist on their own. That's why so I don't want to spoil anything. I love crossovers. I love them all. I feel like there's a very special place for a minute. You said not Smash type, but like Marvel vs. Capcom to me is always such a special game just because you get all the characters together and it's like I liked the even taking out the gameplay of that and it because it is just people together the stupid",
            "start": 237.03
        },
        {
            "text": "me is always such a special game just because you get all the characters together and it's like I liked the even taking out the gameplay of that and it because it is just people together the stupid story elements they had not canon doesn't matter but just the interactions between all these different characters. I always loved that ****. And I think I think that uh it's it is hard to not be cheesy but it's like if they just kind of own the cheese. But that's the thing is yeah, I embracing that kind of **** makes sense. But I'm sorry for like yeah, for a fighting game for sure. That's why Persona is able to get away with it. That's why I but you know, captain Lee the game you're talking about. But it is outside of that when it is like, oh, you Lara Croft mush mashed up with Uncharted. It's like when I kind of takes away from both of them and how they gonna do this and the what's how's that work? I see I'm into that. I love it. But the thing is I love it at a point like I would love that now",
            "start": 276.22
        },
        {
            "text": "when I kind of takes away from both of them and how they gonna do this and the what's how's that work? I see I'm into that. I love it. But the thing is I love it at a point like I would love that now because I've gotten the Uncharted, the Tomb Raiders. I know what those are. I have enough experiences alone where it's like, oh, cool. This is something that could be different. It is how do they match those things? And I always think that it's interesting when they there is two lines of canon and you have to kind of cross them over and try to make it make sense together. I don't like it when it's **** and they're just like they come up, well, it's an alternate universe or whatever. I like when there is a grounded reason or grounded within the canon of why it all works. That's why the the comics right now, Batman/Teenage Mutant Ninja Turtles, you can bring it up. It's good. It's it's a perfect way to do that type of stuff where it's like you read it and it doesn't feel too out of line to be a Ninja Turtle story or to be a Batman",
            "start": 315.43
        },
        {
            "text": "and Teenage Mutant Ninja Turtles. You can bring it up. It's good. It's it's a perfect way to do that type of stuff where it's like you read it and it doesn't feel too out of line to be a Ninja Turtle story or to be a Batman story. Sure, it does simultaneously feel like both. And I think that the games, it's a little harder with because the gameplay needs to also do that as well as a story. But I think that if you take two franchises like I think Uncharted and Tomb Raider actually, it's like the perfect example of that. Totally just works. But I think that you can take two franchises stories, give it a totally new type of gameplay so that people aren't like, you know, comparing it to one side or the other. But it's a new type of game with the story elements of the other two. I think that could really work. And I there's a whole bunch of **** that I'd like to see. Maximum Cortez never heard of Andy from Rooster Teeth. He says, what games resulted in the most broken controllers? Crash Team Racing back in a the PlayStation days.",
            "start": 353.35
        },
        {
            "text": "bunch of **** that I'd like to see. Maximum Cortez never heard of Andy from Rooster Teeth. He says, what games resulted in the most broken controllers? Crash Team Racing back in a the PlayStation days when there was a that was the the game that I got a multi-tap for. Nice. So we're time for **** controllers. And it was an accident. Well, yeah, I know you're asking about rage, but I have never broken control out of rage. Oh, really? Yeah, Emily don't know. I have once. I probably broke him or a Tai Chi. And I guess, but like the one that always stands out to me is a freshman year of college. I'm across the hall in my friend John's room playing WWF SmackDown! 2 on PlayStation 1, which was right now because if SmackDown, SmackDown 2, and then Just Bring It on PS2, I believe. But SmackDown 2, he's like the story with that is like, I, you know, I moved to Mizzou. I didn't know anybody. And one day I shut my door to go to class and I turned the corner and I heard the SmackDown music, like the menu",
            "start": 396.28
        },
        {
            "text": "like the story with that is like, I, you know, I moved to Mizzou. I didn't know anybody. And one day I shut my door to go to class and I turned the corner and I heard the SmackDown music, like the menu music. Not like went down the hall looking in every room till I found John. Weren't we friends? And I we go over there and playing. He always played at his created character, Johnny Charisma, who's his high-flying little ****. But ****, we get up every time that he would spam these moves in like his, you know, momentum meter would spike. But I was good enough usually to beat it. But there's this one time we're sitting on the floor playing with my PlayStation 1 controller and he just keeps doing this flip off there and getting up fast enough. He's like, he's storing finishers and stuff. And like I couldn't do anything. And I remember just gonna **** slamming it down on the floor. But it was a concrete floor side. I shattered the base of the controller. But then I wanted to beat him cause I scared him so bad.",
            "start": 444.36
        },
        {
            "text": "anything and I remember just gonna **** slamming it down on the floor. But it was a concrete floor side. I shattered the base of the controller. But then I wanted to beat him cause I scared him so bad. For him raging is totally worth it. Yeah, that's funny. For me, so I say I never broke it out a rage, but my **** friend put the multi-tap on a window and the windows open. Didn't know we like, I forgot exactly how it happened. But we just finished a race. We put the controllers down. The multi-tap falls out the window, pulls all the controllers with it. And all four controllers fall like five stories. Oh, wow. Yeah, I mean, it was bad. I forgot. Yeah, you're on up in San Francisco thing like a second story. How ya known enough? And then four controllers got it broke. That's all in one. That seems like one of the that would have been the perfect time for one of them to act like a grappling hook in like, I know, ask the windowsill. So it was one of those situations where there's so many ways that that could have not",
            "start": 479.25
        },
        {
            "text": "would have been the perfect time for one of them to act like a grappling hook in like, I know, ask the windowsill. So it was one of those situations where there's so many ways that that could have not happened. Yeah, I was I say I'm kind of impressed that it did because like you would think that the multi-tap wasn't have enough like, wait, wait for four **** controllers. But I guess did they were there in uh just original PlayStation? No, no, no. Don't have the DualShock, the DualShock controller stick. Yeah, but uh you know, do you ever break controller, Colin? Yeah, definitely. I'm organically would break them playing games like a Dreamcast controller is really flimsy. So I just talked about how Crazy Taxi we brought controllers. But the last game I broke a control at a rage for was I think Heavenly Sword. And that was one of the Sixaxis controllers had no girth. And they do just smash it on my desk and I just broke it. But I'd always remembered throwing controllers and I was a kid, which was like a",
            "start": 519.27
        },
        {
            "text": "Sword. And that was one of the Sixaxis controllers had no girth. And they do just smash it on my desk and I just broke it. But I'd always remembered throwing controllers and I was a kid, which was like a funny thing. And it was funny on the NES and SNES because they were attached to the system. So like he would just throw your controller and the game would like reset. I remember just like walking away from games that were just like blinking like gray, just like **** this game. Yes, to keep it at that for hours or ever. Yeah, are there such a punishment game? Yeah, exactly. As you get for me to do. Uh Michael Barbosa says, what are some of your favorite old games that you'd want to play in a Let's Play? My God, that list for me is so long. I really I have documents of like games that I hope to one day Let's Play it. Just Let's Plays are just so not a focus for us. And it gets hard to kind of prioritize that stuff, let alone to bring in something old and try to figure out how to make it work and get all",
            "start": 560.31
        },
        {
            "text": "Let's Plays are just so not a focus for us. And it gets hard to kind of prioritize that stuff, let alone to bring in something old and try to figure out how to make it work and get all this stuff work. Yeah, and that's the other problems. Like early on we did a bunch of old ones and then our little converter thing stopped working. It was like ****. But I definitely like the old first internals on NES. It was a game that broke the camel's back when it came to us doing the things because we couldn't get **** work. Yeah, Balaji want to do that. There's so many PlayStation games and I want to do. I need Crash 2. I need to be Crash 2 and 3. I want to do full plays of those. And then there's a it's just hard to figure out a good way to to cover old games. Like what is the best Let's Play of an old game? Because most people want the whole game. But that's hard to to make the content worth doing for the amount of views that that gets. So it's kind of like figuring out the right",
            "start": 602.46
        },
        {
            "text": "Let's Play of an old game because most people want the whole game. But that's hard to to make the content worth doing for the amount of views that that gets. So it's kind of like figuring out the right equation to making it fun, making it entertaining, but also making it worth doing because yeah, if it was if it was obviously worth doing, that's all I would do. Play old games. Yeah. Oh, yeah. Ah, Greg talking to you. Let's see how long we've been going. We'll do a couple more questions. Ryan Verrell says, why can't a company like Disney succeed in the video game industry? Move. There's none specialized. And if I don't think, I think you have to be all in. I mean, what do you think about the company is the publishers at do succeed? Their publishers, the video games, they don't do other things. Like Activision doesn't do anything else. EA doesn't do anything else. Obviously, these companies diversify in some ways. But but doing a game industry is a unique beast. You have to have, you know, specialty in doing that. Doesn't have",
            "start": 641.64
        },
        {
            "text": "anything else. EA doesn't do anything else. Obviously, these companies diversify in some ways. But but doing a game industry is a unique beast. You have to have, you know, specialty in doing that. Doesn't have merged a lot of money. So it's just not for everyone. And I don't think that, you know, I think that, you know, there are some midsize publishers that are still probably not long for this world. So I don't think it's a safe space for a lot of companies to be in. That's my opinion. Mm-hmm. No, I mean, we did all the topic about it, right? I think it's also just Disney being smart and come to that realization that we could be doing other things and we are really good at other things. And we should do those things in partnering with people who do these video games really well. Yeah, very smart. Zachary Hood says, how can I find friends through gaming? I'm going to think the easiest answer. And I think that a very, very, very effective answer is forums, kind of like a message board for us. There you go. But it's like that",
            "start": 691.88
        },
        {
            "text": "how can I find friends through gaming? I'm going to think the easiest answer. And I think that a very, very, very effective answer is forums, kind of like a message board for us. There you go. But it's like that there is such a community. Those people are there to be friends, to have conversations about games. I think it's easier to find friends through gaming when it's not actually through the gaming. Having said that, Alfredo is very, very obviously into multiplayer games. And the amount of real life friendships that he's formed over the last 15 years that I've known him, you know, through playing games with people. It's crazy. Like the the cruise that he runs with and teams that he runs with, like those are his people, you know? And I think it's really cool and awesome that like I'll be down it and all over the **** country for an event or doing like we're in Texas for SGC last year when we're at E3 or whatever. People come up to me like, Tim, hey, like I'm Alfredo's friend. I'm on his team, whatever. And it's like",
            "start": 726.13
        },
        {
            "text": "**** country for an event or doing like we're in Texas for SGC last year when we're at E3 or whatever. People come up to me like, Tim, hey, like I'm Alfredo's friend. I'm on his team, whatever. And it's like, that's just your line. Get away from their local to that place, you know? And I think that it's it's cool that because of the internet, you can kind of have friends anywhere you want. Hmm. Let's see. George Barrett says, how many generations of consoles do you see HD remasters continue? That's a great question. Forever. Yeah, forever. In perpetuity will be called HD remasters. That'll be called collections because these games already in HD. Do you think about be they like, I guess it'll be that on PlayStation 5, right? We'll get all of the Batmans. That's how they'll go around to doing it. We'll get Arkham City, Arkham Knight, Arkham Asylum. Maybe I think that we might advance so far in the next five to ten years that some of these games just might not be long, you know, that might not belong on these consoles",
            "start": 768.11
        },
        {
            "text": "Arkham Knight, Arkham Asylum. Maybe I think that we might advance so far in the next five to ten years that some of these games just might not be long, you know, that might not belong on these consoles because they might just not look good anymore. It's the way we almost feel about like, why isn't there a Crash Bandicoot collection? It's like, was like, those games look like garbage, you know? And they didn't play like garbage to the eye-Q and sound. It's an N64/PS1 era polygonal games just don't look right anymore. So those games aren't good to re-release him. We saw, I mean, with rare exception, we saw Final Fantasy VII for instance, come to PS4 and it looks like ****. But like it is what it is. So I wonder if we'll have the similar land look, look at the old games in a similar lens. But I don't think so. Stylized games have a lot of artistic direction style. Yeah, I supposed to just putting like, you know, polygons together. I hope which is if it's gonna keep going, it's just one generation back of, hey,",
            "start": 809.67
        },
        {
            "text": "so stylized games have a lot of artistic direction style. Yeah, I supposed to just putting like, you know, polygons together. I hope which is if it's gonna keep going, it's just one generation back of, hey, there's this new console and you're buying it. Did you know you miss these games on PlayStation 4, Xbox One? So on the next one, you get those. That seems like what the majority of them are nowadays, right? With the exception of a piece to class. Yeah, there's things every every now and then. But I think that it's it's less about that they won't be HD remasters, obviously, because of what Colin said. But I think that there it's less going to be about the graphics or whatever, but it's going to be more about what do the new consoles offer that these don't. And like that's when you look back, that's all that re-releases are. When you look at now, the it's not even HD remasters when we're talking about the PS3 to PS4 job. It's just yeah, you're the collection, definitive edition, collection, Last of Us, you know, right?",
            "start": 845.46
        },
        {
            "text": "re-releases are when you look at now, the it's not even HD remasters when we're talking about the PS3 to PS4 job. It's just yeah, you're the collection, definitive edition, collection, Last of Us, you know, right? Things like that. I think it's just that's just gonna be the norm. And like I it's I think it's a good thing overall. It sucks that, you know, like if you have twice, but you don't have to buy. I feel like they've taken their foot off the gas a bit. For a while there, it was like, what the **** are you doing? And now it is like, okay, I guess that makes sense. Sure, why not? Like it as development cycles get longer and longer, company in publishers need to worry about making money and keeping everybody and going in a business. So it makes sense for WB who doesn't have an Arkham Knight this year to say, all right, cool. Let's put out the other two Arkham games since people like those, one of those want to play them again. Here you go. Yeah, I think it's like a easy way to kind of fill the void that like things",
            "start": 879.42
        },
        {
            "text": "cool. Let's put out the other two Arkham games since people like those, one of those want to play them again. Here you go. Yeah, I think it's like a easy way to kind of fill the void that like things like Fallout: New Vegas and stuff like that did before where it's just like you, let's keep the brand in people's conversations and all that stuff. Final question of the day comes from Teyla Now. And back at IGN, when you get early such review copies, are they retail? Do they have their own special box or they come in a bland secret box? Mm-hmm. Depends. Nowadays, it's codes. The industry's changed mostly to where you just get codes for games. And that's on retail. Is running on retail part of it? I don't know if it was this shift of this generation as much as it was our shift as well. But it seems like it's always retail. It's rare nowadays, correct me if I'm wrong, for us to really feel it get be getting debug PS4 builds. If you're getting that, it's like this debug version again. The entire time we've been doing",
            "start": 923.67
        },
        {
            "text": "retail. It's rare nowadays, correct me if I'm wrong, for us to really feel it get be getting debug PS4 builds. If you're getting that, it's like this debug version again. The entire time we've been doing this game six months out. So here's a build to go play like three levels of or whatever. I think that with no, that wasn't even when we did the Ratchet & Clank Let's Play before it came out three months ago. That was a code on retail that they've uploaded. They upload that stuff to retail so it would work. Cause at IGN back in the day when we when I started, it was working PlayStation stuff. And the PlayStation reviews, you got burned CDs and DVDs all the time or DVDs all the time. And then PlayStation 3 was the same thing. And those just arrived yet a plain old jewel case and a burned disk in there with something written Sharpie on what it was. And then now it just feels like discs are press so early. This are our games are if you want it to get reviewed are uploaded so early that you're just",
            "start": 965.3
        },
        {
            "text": "with something written Sharpie on what it was and then now it just feels like discs are press so early this are our games are if you want it to get reviewed are uploaded so early that you're just getting the retail experience yeah I think that for the retail games that we do get usually for me it's been Nintendo games it's it is hit or miss where it does sometimes just come in a black box like it's it'll be the retail disc but it's not actually in the box box it'll be more like some weird white box that's really nondescript sure or whatever but yeah they're usually retail games completely so yeah this topic brought to you by Total War: Warhammer what is Total War: Warhammer it's a fantasy strategy game of legendary proportions it combines an addictive turn-based campaign of conquest and empire building with explosive colossal real-time battles all set in the vivid and incredible world of Warhammer Fantasy Battles it's the perfect match it's a marriage made in gaming heaven we're",
            "start": 1000.82
        },
        {
            "text": "and empire building with explosive colossal real-time battles all set in the vivid and incredible world of Warhammer Fantasy Battles it's the perfect match it's a marriage made in gaming heaven we're talking of fantasy world of perpetual war in massive battles that you'd find in Warhammer mixed with the critically acclaimed epic scale and conquest based strategy games Total War. Total War plus Warhammer equals a gorgeous high fantasy world of perpetual war and conquest on a colossal scale brought to life in hours and hours of gripping strategy game play epic fantasy Total War style no one's done Warhammer or indeed fantasy like this before from the personal skills of your characters to 0 000 roaring orcs no fantasy strategy game is this big and detailed as fancy spectacle it is unmatched if your PC gamer not involved you're missing out factions that all feel and play very differently each race is wholly different with their own unique characters campaign mechanics battle for the units",
            "start": 1043.06
        },
        {
            "text": "your PC gamer not involved you're missing out factions that all feel and play very differently each race is wholly different with their own unique characters campaign mechanics battle for the units and play style so if you're interested in this go over to PC, Steam all that stuff 5 4 016 that's the time you listen to this probably gonna be that so it'll be out yeah unless you're ever unpatriotic office that's Kinda Funny Games supporting so we thank you very much for you can just get ready sorry",
            "start": 1081.69
        }
    ]
}