{
    "id": 1740,
    "video_id": "LmfQKR4raXk",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Why Aren't There More Republicans In Games Media? - The GameOverGreggy Show Ep. 127 (Pt. 4)",
    "description": "Colin Moriarty wants to know why there is such an in balance of politics in games media.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1463036401,
    "duration": 2423,
    "transcript_chunks": [
        {
            "text": "Kinda Funny Live is happening May 8th and 9th. It's a two-day event. The first day is going to be a completely ridiculous stage show. What we have planned this year completely blows last year out of the water, and I don't even know how that's possible, 'cause we were really stupid last year and this year's somehow even stupider. Day two, it's going to be full day of meet and greets. We're hanging out with, with all of us. A bunch of Rooster Teeth people are there, Funhaus people are there, Achievement Hunter. It's going to be a grand old time. There's going to be some games to play, there's going to be signings. It's, it's exciting. It's a really fun time. There's going to be exclusive merch. Oh yeah, there's definitely going to be exclusive merch. Go to KindaFunny.com/tickets to get your tickets today. There's a couple VIP tickets still available, so make sure if you want one of those, you act fast. Colin, yes, what's your topic? Um, so I was having a conversation with someone recently. Sorry, my phone's blown",
            "start": 0.04
        },
        {
            "text": "VIP tickets still available, so make sure if you want one of those, you act fast. Colin, yes, what's your topic? Um, so I was having a conversation with someone recently. Sorry, my phone's blown. Um, um, and we were, the conversation was about politics in the games industry, but then it was like, well, the, the statement came up like, well, you're the most prominent conservative, the most prominent Republican in, in the games industry, right? And I was like, well, maybe, but what about? And then I like went in my mind, I'm like, there's no one else. Nope, no, like, like, and, and I'm, and, and I don't mean that with any disrespect or whatever. It's just like in the, in the gravity well of like all of the major sites and then like all the offshoots of those sites that came. So like, we're kind of an offshoot of IGN, not literally, but figuratively, in the sense that like, we come from that area. So like, I'm not talking about people that were born YouTuber and other spaces, but people that were born in like traditional games",
            "start": 33.84
        },
        {
            "text": "but figuratively, in the sense that like, we come from that area. So like, I'm not talking about people that were born YouTuber and other spaces, but people that were born in like traditional games media or whatever. What was traditional games media? I realized that there's like no one else. And I, I started that for the first time in years. I've been in this industry for a long time, started to really think about, I'm like, isn't that weird? Like, isn't that strange? And I started to think about it. Well, I was like, so I started like looking up statistics and I'm like, there's got to be a statistical anomaly that explains this. And so I started like going into, um, I, this is very American-centric, which I apologize to our foreign audience. It's just like, I can't, I can't account for that. And most of the people we deal with in terms of like our peers are actually Americans. So, um, so I, I went and I looked up some statistics just about political ideology in the United States and I think these numbers will",
            "start": 90.84
        },
        {
            "text": "we deal with in terms of like our peers are actually Americans. So, um, so I, I went and I looked up some statistics just about political ideology in the United States and I think these numbers will surprise people. Okay, so, um, I found three polls. Okay, um, Gallup and USA Today did a poll in 2010 of Americans. 40% of Americans identify themselves as conservative. Only 20% identify themselves as liberal, and then everyone else is in the middle. And then Pew Research did another one in 2010. 40% of Americans consider themselves conservative, 25% liberal, and then 36% in the middle. And then in 2013, Gallup did another one and the numbers are going down. Conservative 34%, liberal 23%, moderate 38%. And you can go into typology and stuff like that, which is like how you identify yourself and like why you identify as conservative, whatever. And so I don't really know where this is going other than to say this top, other than to say like, isn't it, isn't that, that doesn't strike you guys as weird? Like that, like we are",
            "start": 129.32
        },
        {
            "text": "as conservative, whatever. And so I don't really know where this is going other than to say this top, other than to say like, isn't it, isn't that, that doesn't strike you guys as weird? Like that, like we are in this massive echo chamber where everyone agrees with each other except for me. Like, like that, that, that's like, like, and am I like, can you guys think of anyone I'm missing? I don't know anyone. Greg, especially you, you're like the mayor of the video games industry. Hey, how you doing? Like, that's not weird to you. Like when, when someone's, my mind immediately went to like, yeah, maybe I'm the most prominent, but there's got, and then I'm like, I can't name one. Yeah, not a single one. To answer your question, is it weird that you're the most prominent? You said Republican in the beginning and now it's swinging a little more conservative. No, it's not weird to me that you're the only one we can think of. I remember meeting you and if you and we were talking out at a bar one night and you were and I was like, it was",
            "start": 174.48
        },
        {
            "text": "more conservative. No, it's not weird to me that you're the only one we can think of. I remember meeting you and if you and we were talking out at a bar one night and you were and I was like, it was like we'd known each other not a while, but you know, we were still young in our relationship. I was like, man, you're the coolest Republican I've ever met because no one identifies themselves as a Republican because Republicans suck. They hate abortion and they hate gays and they hate like, why would anyone want to identify themselves as that? And you were the first one where I was like, oh, fiscally conservative, uh, uh, socially liberal. Yes. And I told you, I've said it a million times, if you ran the party and that's what Republicans were, they'd win every election. That's a great idea. Keep the government out of my stuff. You don't care what I do at my house. Drugs are legal. We're not going to spend more than we make. Perfect. But that's not what Republicans are. And I think, yeah, but you're missing, you're miss, I",
            "start": 213.2
        },
        {
            "text": "my stuff. You don't care what I do at my house. Drugs are legal. We're not going to spend more than we make. Perfect. But that's not what Republicans are. And I think, yeah, but you're missing, you're miss, I mean, that might be true, but you're missing, I think the point that like in, in America, like a majority of, well, it's not a majority, but, uh, let's say, uh, many people, almost twice as many people identify as conservative over liberal, yet where are they? Like, that's not, that's not, that's not weird to you? Like that there's, like there's no, there's no parity at all. Like there's not even a few of them. I think you're the most outspoken one of the lot. I think there's, I think they're in the industry. I think they just don't vocalize it as much because like, you got to think about it. There's probably not people that like the conservatives. I don't know. I'm Australian and so I would say that you're probably the most outspoken. That's why you're the most notable and you can't think of anyone else because",
            "start": 250.76
        },
        {
            "text": "people that like the conservatives. I don't know. I'm Australian and so I would say that you're probably the most outspoken. That's why you're the most notable and you can't think of anyone else because no one else talks about it. Yeah, that's the, like, that's kind of the thing I'm getting the root cause of why I wanted to bring this up was not only the strangeness that there's just no, it's just an echo chamber. Like everyone just agrees with each other. Like you're not, can you go back to 2010 and figure out any other game journalists that was like, I want to vote for Mitt Romney? Sure. But here's, here's the point though, is the other thing of why you're the most prominent. It's because you say all that stuff. Why? I couldn't tell you. I mean, you're correct. And do I know any other conservatives that are outspoken? No. But why would I? I wouldn't follow them on Twitter. I wouldn't want to listen to them. I follow a bunch of liberals on, on Twitter. Sure. But I'm saying I don't, when even when the liberals tweet",
            "start": 294.72
        },
        {
            "text": "no, but why would I? I wouldn't follow them on Twitter. I wouldn't want to listen to them. I follow a bunch of liberals on, on Twitter. Sure. But I'm saying I don't, when even when the liberals tweet about political stuff on Twitter, that's not what I'm following them for. If I go in and Kez is going off on policy or something, it's keep scrolling. I don't want, I don't care. I want to know about what she thought of the, how her Dark Souls book is going or what she's playing. That, and I think that's the other thing about it is that we're an industry where our passion and our careers are gaming. So we all talk about gaming and that's what I, I, I mean, that's how I identify people more as what they play or what they do or what they cover more than I don't, I don't know. Like it's, this is similar to being like, uh, oh, I always screw up her last name, but, uh, no, I'm going to screw up her first name too. Danielle from Polygon, you know what I'm talking about? Help me out. No, uh, with the R last name. Yes, I can't",
            "start": 327.88
        },
        {
            "text": "oh, I always screw up her last name, but, uh, no, I'm going to screw up her first name too. Danielle from Polygon, you know what I'm talking about? Help me out. No, uh, with the R last name. Yes, I can't pronounce it. She was like, oh, she turned out a French name. Yes, exactly. Sorry, I can't remember your last name, uh, but or how to say it, I should say, or something like that. Exactly. And it turned out, oh, that, you know, during pandemic, she came out as the boxer EMT. And it was like, oh, she boxes, 'cause I've seen that on her Twitter and she's an EMT. And I'm like, I didn't know about her. You know what I mean? Like, that's just a thing that like, I don't know about her, but I know where she works and I know what she likes to play and I know this, this is where the argument to me gets a little strange because there a lot of games journalists and games media are super outspoken about politics, but none of them, well, see, are outspoken about conservative politics. See, that's, that's the thing though. I think that's not, it's",
            "start": 362.8
        },
        {
            "text": "of games journalists and games media are super outspoken about politics, but none of them, well, see, are outspoken about conservative politics. See, that's, that's the thing though. I think that's not, it's less of a, to me, an issue of the games industry and more an issue of the entertainment industry, which the games industry is part of, right? You see this all the time in Hollywood and a lot of people and, and people talk about it down there a lot where everyone's liberal in LA, but that can't be possible. Right? There are clearly people who would vote Republican or people who would side with the Republicans in so far as some of what they, what they stand for, but everyone's afraid or just likes being caught up with the common voice of, of liberal Hollywood simply because that is, that is the, the most popular voice down there. And so I think it's probably the same in the games industry, right? Which is seen as a very liberal. I mean, you're talking about art and art is very liberal. There's no such thing as",
            "start": 398.56
        },
        {
            "text": "voice down there. And so I think it's probably the same in the games industry, right? Which is seen as a very liberal. I mean, you're talking about art and art is very liberal. There's no such thing as a conservative art form, right? Like there's no such thing as really a person who would, uh, you know, go out there, be like, I, well, I don't want to get through down to that, 'cause I think I'm mixing my terms here a little bit. But most people that would could be considered artists would be considered free and free thinking and, and, you know, free acting and that kind of goes a little bit more along terms with, uh, liberal ideology. It's certainly that in Hollywood, that's the same in the games industry. I would reckon to say there's a lot more people who are conservative in the games industry that just don't feel that they can actually voice that for fear of being jumped on. Like you get jumped on every single time you tweet everything. Yeah, well, there, there are, I mean, I, I said there, there are, there are",
            "start": 436.76
        },
        {
            "text": "feel that they can actually voice that for fear of being jumped on. Like you get jumped on every single time you tweet everything. Yeah, well, there, there are, I mean, I, I said there, there are, there are prominent people that are conservative in the industry that I know they're conservative. They just don't say it. They tell me. Uh, but I just think it's, I'm not even talking about people in the industry because I've actually never really met many people in the media side or like the YouTube coverage kind of side, whatever, that really do feel that way. And I like, I, it's just funny to me that, and I'm not trying to start a quarrel with anyone at all, because it's like, I don't, I don't really care. I like, believe what you want to believe. It doesn't really matter to me. I just that never really stopped to think, I'm like, why am I the only one that's, that's just weird to me? Like, but think about the themes and, and, and the, the ideology that most games deal with, right? It's, it's, it's more about, it's more about",
            "start": 468.48
        },
        {
            "text": "I'm like, why am I the only one that's, that's just weird to me? Like, but think about the themes and, and, and the, the ideology that most games deal with, right? It's, it's, it's more about, it's more about liberal thinking than it's about conservative thinking, right? So you've got a whole industry that's, that's basing a lot of their, I want to turn it to you. I'm sorry. What, what does it mean for you when you're talking about, you mean like talking about the Republican race? And well, just like presidential politics. Like you're not going to find, not that I support Trump, but you're not going to find anyone that supports Trump. Everyone loves Sanders or Clinton or they just, they talk about how like, you read things from PR people from like, whoever, like how dumb the Republicans are, how stupid it is, a clown car, all these kinds of things. You see like really none of that except for from me. And again, I'm talking like in the sphere of influence of these major sites and then their offshoots. I'm sure that",
            "start": 499.92
        },
        {
            "text": "car, all these kinds of things. You see like really none of that except for from me. And again, I'm talking like in the sphere of influence of these major sites and then their offshoots. I'm sure that there are plenty of people on YouTube that are conservative gamers. I'm sure there are plenty of people and all these other alcoves. I just am not familiar with them. I'm talking about like mainstream, we mainstream, we're not really mainstream anymore, but mainstream and then the offshoots of those mainstream things. I mean, I remember when we were at IGN getting huge arguments with people. Like there was no one at that site like me and there were a lot of us, you know, like that was, and I never really stopped to think about it. Like I never actually stopped to think about like, I knew that I was like kind of on an island alone, but I never thought about like why that was weird. And then so I started to think about it more today when I was preparing for this and I like, it has to do with age. Yeah, and it",
            "start": 535.16
        },
        {
            "text": "of on an island alone, but I never thought about like why that was weird. And then so I started to think about it more today when I was preparing for this and I like, it has to do with age. Yeah, and it doesn't because the statistics show that the average age of a gamer is 31 years old and only 29% of gamers are under 18. So these are like more of like maybe Bernie Sanders-centric, like very ideological, um, or really not ideological, idealist. And then 30% 18 to 35. And then 39% of gamers are 36 and over. Then I, I, where did I, there it is. I looked up this thing about because I wanted to see, um, political typologies. They, they shift. So like they get closer to what it was like 30 or 35. That was the breaking point. People go more conservative. And, um, and so only 18 to 29 year olds, only 4% of them consider themselves steadfast conservatives. And then business conservatives 6%. And then young outsiders, which are like moderate Republicans, which are like, like me, are 19%. And then you have like",
            "start": 570.2
        },
        {
            "text": "them consider themselves steadfast conservatives. And then business conservatives 6%. And then young outsiders, which are like moderate Republicans, which are like, like me, are 19%. And then you have like hard-pressed skeptics, which are kind of like moderates 9%. And the Next Generation left 19%. Family and Faith and Family left 10%. Solid liberal 16%. And then bystanders is actually 17%. So people that are just apathetic, which you see a lot with younger people that, that by the time you're 65 or older, that goes down to 3%. And then steadfast conservatism raises to 21%. But actually like young outsiders and business conservatives actually like shrink or stay the same. So like the conservative ideology becomes bigger, but not by much as you get older if you go by these numbers. And these numbers I think come from Pew Research. So like that doesn't explain it away either. Well, here's my question. It's, I really do think it's like, it's like ideological, ideologically consistent people hiring",
            "start": 612.72
        },
        {
            "text": "I think come from Pew Research. So like that doesn't explain it away either. Well, here's my question. It's, I really do think it's like, it's like ideological, ideologically consistent people hiring ideologically consistent people making ideologically consistent people say feel safe and like they can say something and then like everything else is buried. Goes my question from all that in the stats, even though is like, what about when you said it's about our age, our age, right? How old we are, our, you know, age demographic. I'm not talking about the numbers you're bringing up. I'm talking about for our age demographic. You're the most politically active person I know. You're my most politically active peer. You always have been. You're dialed in. And so is what you're talking about now and what you're seeing now just, and stick with me, 'cause it's going to be a walk, but you'll get there. Just another World Cup, 'cause now the election matters. Now everybody's suddenly talking about it like they've been campaigning, stump speeching for Bernie or Hillary forever, right? But where were they when the regular elections come around? That's a good point. That and, and, and I've said it before, insinuated it before. Like I, out of all these people that like, you know, I've had, you know, quarrels with or just like that talk, or whatever, none of them know like, seem to know anything. Like most of them. So it's like just the way they talk and like how they, so I do agree with you like where they don't seem like super dialed in. And that's not an insult because they're liberal. It's because like they really aren't super engaged. But you see like a, like you were bringing up Nick, the movie industry. And I agree with you in the music industry. But there are very conservative alcoves in those, sure, in those, in those, uh, arenas.",
            "start": 649.08
        },
        {
            "text": "now just and stick with me 'cause it's going to be a walk, but you'll get there. Just another World Cup, 'cause now the election matters. Now everybody's suddenly talking about it like they've been campaigning, stump speeching for Bernie or Hillary forever, right? But where were they when the regular elections come around? That's a good point. That and, and, and I've said it before, insinuated it before. Like I, out of all these people that like, you know, I've had, you know, quarrels with or just like that talk, or whatever, none of them know like, seem to know anything. Like most of them. So it's like just the way they talk and like how they, so I do agree with you like where they don't seem like super dialed in. And that's not an insult because they're liberal. It's because like they really aren't super engaged. But you see like a, like you were bringing up Nick, the movie industry. And I agree with you in the music industry. But there are very conservative alcoves in those, sure, in those, in those, uh, arenas.",
            "start": 688.6
        },
        {
            "text": "but you see like a, like you were bringing up Nick, the movie industry. And I agree with you in the music industry. But there are very conservative alcoves in those, sure, in those, in those, uh, arenas. Like country music for instance, isn't all conservative, but that's a conservative and very mainstream, you know, Southern genre of music that is certainly dominated by conservatives. And there are plenty of conservatives in Hollywood. Like, like there might not be like as many as are liberals, but are plenty of concern. There are, but they're, they're definitely the minority though. Sure. Like, or at least as far as thought sharing is concerned, right? And, and it's because I was, you know, echoing Greg's sentiment. Like I think that a lot of people, a, don't feel informed to make opinions, uh, because that's not their beat, especially specifically with games journalists, right? They don't, they don't cover politics, they cover games, right? So if you're asking for dissenting opinions on games, you're going to get, you're",
            "start": 725.72
        },
        {
            "text": "especially specifically with games journalists, right? They don't, they don't cover politics, they cover games, right? So if you're asking for dissenting opinions on games, you're going to get, you're going to get multiple, a multitude of different decisions, based opinions based on every game. You're talking about politics. Politics is a very scary thing for people to have an opinion about. And so I think what a lot of people do is they default to whatever the most popular opinion is. And that tends to be liberal thinking when it comes to, and to dial it back. I don't even know. I think it's when exactly you're hitting on something, right? Because I do again think it comes down to generally that if you're looking at the Republican Party, they are the evil party. They are the ones who want you to not be gay, not do this, be the, we are the Christian Right. I think, right? You know what I mean? Like they, when you, and I'm not saying that's true, obviously, that's what I go back to. I would vote for your Republican",
            "start": 763.16
        },
        {
            "text": "not do this, be the, we are the Christian Right. I think, right? You know what I mean? Like they, when you, and I'm not saying that's true, obviously, that's what I go back to. I would vote for your Republican Party every single time. But when you sit there and you do talk about it, that's how it nets out for at least my generation or at least my point of view. Maybe I'll listen into that. And I think a lot of people are in that. And I think that's why you're talking about like why people come out of the woodwork or whatever. And I think you're saying, you know, again, I can't speak for you, I guess. But when I look at my Twitter feed and I see it's all these people, rah rah, look at how terrible the Republican Party is. It's jumping on a trending hashtag. There's a debate going on right now. And Trump's being crazy. Cruz is crazy. This is crazy. That they're the, and I honestly think it's when you look at the Democratic Party this time around, it's a very similar conversation in terms of like, all right,",
            "start": 795.52
        },
        {
            "text": "Cruz is crazy. This is crazy. That they're the, and I honestly think it's when you look at the Democratic Party this time around, it's a very similar conversation in terms of like, all right, well, they suck. Like the Republicans suck and are evil. But Democrats aren't, they're not evil. That's like the best you can say, right? Like Hillary's and Bernie has a bunch of plans that are socialist and maybe it couldn't work and he can't pay for them. But it's like, this is the election where I feel like everybody's, like everybody feels like they're in this one. But it's the Republicans are still an easier punching bag. Republicans are still an easier punchline when you get to the end of it of what they're going to say or what they're going to do. Whereas, you know, when the democratic debate comes around, it's not a big deal. I don't really know what's happening till midway through. Drucker makes a joke. Like Drucker, super. Like that's, I guess for me in the conversation,",
            "start": 834.88
        },
        {
            "text": "debate comes around, it's not a big deal. I don't really know what's happening till midway through. Drucker makes a joke. Like Drucker, super. Like that's, I guess for me in the conversation. Again, now I blow by these tweets. I don't care. This is not why I follow people, right? But if you're asking me who the most, um, active liberals are, I see, right? I'd be like Drucker. And then I see jokes from other people, but I don't count them. You know what I mean? Like I would say like you and Drucker are the only political voices I'm seeing from our echo chamber that I'm like, oh, these people are actually dialed in and super into it and know what's happening. And I'm sure there's more, but again, that's not standing out to me. And maybe I'm not following those people for that reason or, sure. But I guess, I guess the bigger question, and again, this, I didn't know where this topic was going to go, which is kind of why I wanted to do it. But I just find it, it's not about whether it's right or wrong, the ideology. And it's not",
            "start": 872.72
        },
        {
            "text": "question. And again, this, I didn't know where this topic was going to go, which is kind of why I wanted to do it. But I just find it, it's not about whether it's right or wrong, the ideology. And it's not about like kind of the, like the enclaves of people that are conservative or liberal that are outside of this sphere, which I'm sure there are many. Again, I, I want, you know, I just, I, I reiterate that only because I don't, I am not familiar with like really about like with YouTube or with like these alcoves right now. Be honest. I mean, I would say probably, well, YouTube's a little different though, 'cause there's so many different creators. Of the ones that I see, most of them are liberal, right? But what I'm saying is like, so I'm not familiar with like the alternative press. Like I'm sure that there are, uh, games, uh, media on YouTube or and these smaller sites that are more conservative. I'm really just talking about like, like what I'm exposed to, which is like the stuff that most people read, you know, like, um, and I",
            "start": 910.08
        },
        {
            "text": "media on YouTube or and these smaller sites that are more conservative I'm really just talking about like like what I'm exposed to which is like the stuff that most people read you know like um and I I I really am astonished that I just never thought about it where I'm like it's not even about like outward or inward you know I know a lot of people that have political leanings that we used to work with at IGN that are there are not there anymore and you can pull all them they're all liberal all of them you know maybe a few moderates but like all liberal and then there's just me and like that's to me that like the reason that like I think my frankly my arguments are so sharp is because I have to constantly defend myself and so like and I'm not like trying to my own horn it's just like I've I've been tempered in the **** fires of this **** this industry that is totally against me and why is it against like my political leanings and why aren't there more conservatives and like why",
            "start": 942.24
        },
        {
            "text": "I've been tempered in the **** fires of this **** this industry that is totally against me and why is it against like my political leanings and why aren't there more conservatives and like why aren't they more comfortable being like me cuz I'm the one that says like **** Donald Trump **** Ted Cruz **** Reince Priebus and all these guys like this party sucks and like this isn't conservatism anymore this is bigotry this is wrong this is racism this is sexism and like but we there are core conservative principles that I believe in and I'm still the only one even saying that yeah but I think it's because oh God you go I was going to say you just hit the nail around the head right all those things you just listed are all the hot hot topics uh the hot button topics of of the Internet right not a lot of people want to really kind of get down the nitty-gritty of like our economy but they do want to talk about abortion they do want to talk about women's rights they do want to talk about",
            "start": 980.8
        },
        {
            "text": "not a lot of people want to really kind of get down the nitty-gritty of like our economy but they do want to talk about abortion they do want to talk about women's rights they do want to talk about black rights or race relations they want to talk about all these incredibly important social issues and those are the ones that everyone everyone has a liberal opinion on and I feel like that's the big thing is that those opinions matter more to me than they do the conservative thing this is what I've talked about before with you right like I care way more about your stance on abortion than how you're going to fix the budget or the economy because guess what it's always going to be broken I don't and I granted I'm super jaded which I think a lot of why why do you care about that because like that's fathom that's already settled though that's that's the thing is like the the pro first of all pro-life there are more pro-life people than pro-choice people in the United States and the and the",
            "start": 1017.16
        },
        {
            "text": "that's fathom that's already settled though that's that's the thing is like the the pro first of all pro-life there are more pro-life people than pro-choice people in the United States and the and the that's a settled that's settled it's over but but look at what we're seeing right Arizona are like trying to make changes to that right now in Texas yeah but the federal government had already rule has a rule on the states have 10th Amendment rights to say abortion is illegal it's not settled like they're making changes that will then go to back to the Supreme Court and could like overturn Roe v. Wade well how would they overturn Roe v. Wade like who's gonna overturn Roe saying that in Arizona I think it's Arizona they're saying that they want people to have um like the abortion the clinics that will do abortions have to have like a I think it was like they have to have a certain type of doctor and most clinics don't have it so they'll have to close and that'll make it so in Arizona there's like",
            "start": 1047.2
        },
        {
            "text": "do abortions have to have like a I think it was like they have to have a certain type of doctor and most clinics don't have it so they'll have to close and that'll make it so in Arizona there's like going to be two clinics that'll be able to do abortions yeah I mean that that happened in Texas I think you're talking about Texas that was the whole Wendy Williams not Wendy Williams Wendy uh Wendy Davis what's her name the uh the chick that ran and lost for governor against uh Greg Abbott Wendy Spencer maybe something like that no that's a character in The Animated show Wendy Spencer that's correct Wendy Wendy Wendy Wendy I don't know I'll figure it out and we we'll correct it next time but the point I'm trying to make is like that to me like I'm sick of like quarreling over things that are all but settled that the states have the right to to like do these things I guess and you don't have to live in those States and you don't have to support those policies I don't support those",
            "start": 1089.6
        },
        {
            "text": "are all but settled that the states have the right to to like do these things I guess and you don't have to live in those States and you don't have to support those policies I Am pro-choice but like but to to me it's like if you're going to talk in your mic turn on your mic I'm not against you talking though fine it's fine to me what I'm saying is that like and I'm surprised that like I I this isn't I not that I really had any expectations for this topic I'm just surprised that I'm hearing that like you think it's normal that there might be 100 liberal people and one conservative person in a country where more people identify as conservative than liberal in in an industry where that is getting older and older which which negates the whole like well when you're young you're liberal and when you're older you're conservative it's like well the average age of a gamer is in his 30s now and and to me I'm like that's not that's not strange to anyone but you're",
            "start": 1132.4
        },
        {
            "text": "young you're liberal and when you're older you're conservative it's like well the average age of a gamer is in his 30s now and and to me I'm like that's not that's not strange to anyone but you're also talking games journalism right which tends to be which tends to skew fairly young as well like how many guys outside of how many guys do you know that are writing for Publications that are above the age of 36 uh a few but that's handful none of them are like that's what I'm saying like I just feel like there is like actually a deep bias and like and I had never really thought about it like it was always obvious but that's the entertainment industry in general man that's just the way it is and it's weird I mean there's a discrepancy there there's a huge discrepancy but I think honestly you know to go back to the idea of more social thinking is like look at what's happened in the last like five years we've had uh gay marriage legalized and for the most part we're",
            "start": 1169.24
        },
        {
            "text": "I think honestly you know to go back to the idea of more social thinking is like look at what's happened in the last like five years we've had uh gay marriage legalized and for the most part we're starting to legalize pot all around you know that's great so people I think are honestly responding to that and understanding that like that's what social media can be used for that is how opinions can be shared and that can actually move the needle whereas like no one really understand like that's quantifiable right boom we all got together we all got behind this and uh gay marriage is now legal Colorado can now smoke themselves into Oblivion and make a ton of money and their economy can be **** awesome right um but not a lot of people can understand the tax code right and that's not as easily quantifiable in 140 characters on Twitter as it is you know to like legalize it so I don't know I feel like it's just a lot of people want to share more in those ideals because they're a little bit",
            "start": 1202.68
        },
        {
            "text": "quantifiable in 140 characters on Twitter as it is you know to like legalize it so I don't know I feel like it's just a lot of people want to share more in those ideals because they're a little bit easier to grab a hold of and I think they're also a little more easier to prove that you're a real human being by by believing in pro-choice by believing in gay rights well I I mean I believe in gay rights I do take as someone who's pro-choice I do think that the pro-life argument is actually quite righteous and like that there is a you're not Not a Human Being because you believe that there's sanctity of life apologize that com I just I just out I I personally outbalance the woman who's carrying the baby her rights over the the embryo inside of her but I do think that there's a righteous aspect of the pro-life argument and in the in the media age or in the in the Internet age out of all the social issues the only thing that's gotten is the pro-life argument everything else has actually gotten more",
            "start": 1239.32
        },
        {
            "text": "pro-life argument and in the in the media age or in the in the Internet age out of all the social issues the only thing that's gotten is the pro-life argument everything else has actually gotten more liberal except for pro-life has actually got more conservative so like that's that that movement is actually strong and I don't I'm not pro-life but I know good people that are pro-life they're not crazy you know like the people that are bombing **** clinics and stuff like that but they believe that like that they're religious people a lot of them and they believe in that kind of stuff and I respect that I don't agree but the the but the point I'm trying to make is I'm actually more with with Greg where it's like I actually think that there's the echo chamber has built itself up to to make good and evil and good and bad and right and wrong and all this kind of stuff where people are just afraid of saying how they really feel uh and I just don't care you know like like and that's and",
            "start": 1281.44
        },
        {
            "text": "good and evil and good and bad and right and wrong and all this kind of stuff where people are just afraid of saying how they really feel uh and I just don't care you know like like and that's and that's the the big difference is that like I can argue my point of view and kind of like tell you where I'm coming from and and not really attack you for the way you feel and I don't really feel like I need to be attacked for the way I feel even though I'm attacked every day for the way I feel like wearing the shirt is just going to trigger people because it's an Ayn Rand shirt you know even and 95% of them that attack her never read they have no idea what the **** the book's even about they just know that it's that Atlas Shrugged is bad and so they're like well well and and that's the problem right is like you take the time to actually educate yourself not a lot of people do right and so and and a lot of people just want to go with whatever the common flow is just to keep the status quo",
            "start": 1313.52
        },
        {
            "text": "right is like you take the time to actually educate yourself not a lot of people do right and so and and a lot of people just want to go with whatever the common flow is just to keep the status quo like I am terrified to have well I'm not terrified but I I'm very cautious to voice um different opinions than whatever the popular opinions are because people will just have that mob mentality online and they'll rip you apart without even thinking and that's the Patrick what's up yeah so I was what your point is that your the one that's been taking the hit for all your conservative use for years and people have seen you cop **** like a **** T of it and there and as Nick's saying that um yeah so you're taking all the flak so you're the one that's going to cop the flak and they're afraid to get in front of that they're they're afraid to there's probably more conservatives in the gaming industry than you realize yeah and and there's those people that are saying I'm not going to Colin",
            "start": 1349.64
        },
        {
            "text": "to get in front of that they're they're afraid to there's probably more conservatives in the gaming industry than you realize yeah and and there's those people that are saying I'm not going to Colin does such a good job at representing us as a as a as a conservative that I don't see the point of me jumping in front of him because a I'm afraid to cop it and B that you're doing an awesome job at it and what's the point trying to get involved what's the point in trying to get involved in something that I could possibly screw up my choice my My Views yes they're different to Colin's but they're in line but I could be completely wrong and I could **** it up and I could ruin ruin my career or or anything in those situations sucks right that you would ruin your career for a political point of but but it's it's a genuine fear for people no it it is we've seen it play out and and that was and that was the that was the thing is like part the zeitgeist right now is like very you know is is a",
            "start": 1398.6
        },
        {
            "text": "of but but it's it's a genuine fear for people no it it is we've seen it play out and and that was and that was the that was the thing is like part the zeitgeist right now is like very you know is is a growing anti-political correctness kind of thing going on but like I was writing about that like five or six years ago you know you remember like and I was getting like no one was talking about that **** everyone I remember people telling me political correctness literally doesn't exist like that doesn't exist when I was writing about in 2010 2011 like the things you're saying and and and I'd get attacked by all my peers and all this kind of stuff and now it's like everywhere now everyone's talking about it and I'm like but where was everyone like like and still where is everyone about this like there's no one amongst you that supports Trump or Ted Cruz or John Kasich there's no one that's like that that you know is pro-life or can make an argument about why government should be smaller like",
            "start": 1442.16
        },
        {
            "text": "there's no one amongst you that supports Trump or Ted Cruz or John Kasich there's no one that's like that that you know is pro-life or can make an argument about why government should be smaller like none of you like I'm and to me I'm like n there's something wrong here there's something wrong and I think that there's like it's just I feel like it's it's it's an intellectually dishonest medium I feel like it's like the it's a it's a it's an echo chamber like it is so **** it's so shallow and I I feel like maybe that just says something like maybe that just says like maybe they're not afraid of you know saying what they really feel or like um having their own thoughts maybe that they just agree with that stuff you know and I think that it's I don't I'm not that shocked by it really I mean it when they're really is when you're boiling it down to two sides you know you're going to fall on one or the other and I do think that even if you don't make it good or evil it's like I feel like",
            "start": 1476.56
        },
        {
            "text": "it when they're really is when you're boiling it down to two sides you know you're going to fall on one or the other and I do think that even if you don't make it good or evil it's like I feel like that's it's not going to fall 50/50 even though there's two sides I think that it's you know there's the chance for it to to be heavily one-sided and like I mean I'm the type of person where I am not that up to date on all this stuff this is not my beat I do not know it that well I have opinions on it I have feelings about it I'm never going to go toe-to-toe with you I'm never even going to try to like argue with you about it and it's hard to even like have an opinion on these shows about it because it's like I I don't know what I'm talking about I don't have the to to talk to you about that but it's the same thing if if I was arguing about something that I did know you know I'd be able to completely trounce you with it you know this **** so it's like you being the the loud voice on the",
            "start": 1520.44
        },
        {
            "text": "it's the same thing if if I was arguing about something that I did know you know I'd be able to completely trounce you with it you know this **** so it's like you being the the loud voice on the Internet it's like yeah people are going to talk **** to you and a lot of them are not going to have good arguments but that's because you're saying something that upsets them you know whether or not they understand what it is like they don't agree they know they don't agree they can't tell you why they can't tell you what they would do to change it but they know they don't agree and that's something that's funny I was actually talking to Greg about this recently like I find myself with you specifically there's a lot of times on on every show whether it's Gamescast or GoG or just in general when we're just talking where I'm like man I find myself arguing with Colin all the time disagreeing with him all the time and I'm like am I doing that on purpose like am I con like going out of my",
            "start": 1559.64
        },
        {
            "text": "when we're just talking where I'm like man I find myself arguing with Colin all the time disagreeing with him all the time and I'm like am I doing that on purpose like am I con like going out of my way to like be Devil's Advocate and like it took me some time to think about it like stop myself a couple times until I realized I was like no I just disagree with him on a lot of things and there's nothing wrong with that I just fundamentally see things differently than you in a lot of different ways and I I am nowhere near as well well spoken as you and I wish I was you know I really try to get better at at at being more well spoken but you know it's I do know what I feel and I do know that what I feel a lot of the times is the antithesis of what you feel but I can't explain it yeah I think I mean that's fine I have no problem with people disagree with me I guess that the salient point that I wanted to kind of end with is like it I want more of I want more parity because like what I'm",
            "start": 1591.76
        },
        {
            "text": "I mean that's fine I have no problem with people disagree with me I guess that the salient point that I wanted to kind of end with is like it I want more of I want more parity because like what I'm wondering is with the numbers I was bringing up is like that surprises me because there just are way more conservatives than our liberals and so like are is there a whole group of people out there that play games I don't think video I really don't think that video games the act of playing video games is a conservative or liberal thing and I don't think the act of using technology in 2016 is a very conservative liberal thing e or it's just ubiquitous and I'm like is there just a whole group of people that just feel like they're like totally alienated like that they like they don't they don't feel like there anyone's talking to them is that the reason that like I've weathered many storms and have become like somewhat prominent in speaking about those issues and speaking to a group of people",
            "start": 1631.16
        },
        {
            "text": "like there anyone's talking to them is that the reason that like I've weathered many storms and have become like somewhat prominent in speaking about those issues and speaking to a group of people that feel like no one else talks to them and what dis what disappoints me is not that I'm the only one and necessarily just that like we're not sharpening each other's arguments or like keeping each other honest at all because like everyone just agrees with each other and that's really scary for me here's what I want here's what I want you to chew on because I think it keeps coming back to the word Echo chamber right and now this is not a great example but give it give me time to flush it out here for you okay it's similar to me in the way that you are the most prominent Islanders fan or the most prominent Jets fan in the video game industry maybe and you can correct me if I'm wrong but let's just for right now know know any other Islanders fans in the in the industry and so there's my point",
            "start": 1663.68
        },
        {
            "text": "prominent Jets fan in the video game industry maybe and you can correct me if I'm wrong but let's just for right now know know any other Islanders fans in the in the industry and so there's my point there are any yeah so there's a lot so that's my point though right you're talking about something in an echo chamber that that doesn't not not belong in but people just don't care about or don't that doesn't matter to them right like you're the only Jets fan in the video game Echo chamber and few other Jets fans you you you don't understand what I'm saying the same thing with like the Republicans like when you start talking politics I'm always like oh cool Colin's well spoken and then eventually I'm just like cool ready to move on or do something else like it's not what I care about just in the same way that that's possible that that how it is for everybody that in the video game Echo chamber we care about video games and obviously if like when that on the one where we did like a the GameOverGreggy Show topic",
            "start": 1699.24
        },
        {
            "text": "same way that that's possible that that how it is for everybody that in the video game Echo chamber we care about video games and obviously if like when that on the one where we did like a the GameOverGreggy Show topic where we ranked our media right like not obviously I think on this table actually I might have been the only person who put video games at number one maybe you did but Sim but like for any everybody in the video game Echo chamber video games are one of the top slots for them right and so when that Echo chamber is being used for talking about if Severed is as good as we say it is or if IGN is as good as say it and there's there's argument there's uh opinions and there's backing up with what they have I think it's the same way where I mean I think maybe you're looking for the political Echo chamber where it doesn't belong maybe you're looking for the Islanders Echo chamber where it doesn't belong right because you're not you're not confused by they're not being more",
            "start": 1736.52
        },
        {
            "text": "political Echo chamber where it doesn't belong maybe you're looking for the Islanders Echo chamber where it doesn't belong right because you're not you're not confused by they're not being more Islanders fans right in the video but that that argument doesn't make any sense because what I'm saying is that it's not the the industry isn't apolitical and then I'm a conservative the industry is Libertarian used to be Libertarian I am Libertarian is libertarianism is a form of conservatism and I am and I am a conservative I believe small government and like I am fundamentally conservative but like when people you say conservative people think Republican they think Cruz and Trump and you're like doesn't anybody else in this support them no they don't no one in this industry supports you don't either though don't you is that talk about I don't but I'm saying that's not weird there are millions and millions of people voting for them no one in this industry so like I I I'm sorry like I",
            "start": 1771.56
        },
        {
            "text": "don't either though don't you is that talk about I don't but I'm saying that's not weird there are millions and millions of people voting for them no one in this industry so like I I I'm sorry like I just like he just Donald Trump just won a super liberal state my home state you know like where is everyone that's like the question I'm asking is like no I don't support them either I just think it's weird that there's it's just there's just a total vacancy I think that like we're kind of losing the argument because it's like yeah that would be true if the if the echo chamber was just apolitical but it isn't the I've never seen a I've never seen an ancillary industry so politicized as as games ever so it's like that that that to me is why it's so confus do you think it's genuine I think so with some people genuine I think a lot of it's opportunism and I think a lot of it's easy wins too because no one's challenged you know and that's so what I'm saying is like I wish that there was more",
            "start": 1807.2
        },
        {
            "text": "some people genuine I think a lot of it's opportunism and I think a lot of it's easy wins too because no one's challenged you know and that's so what I'm saying is like I wish that there was more people that were arguing all the different because it would sharpen everyone's arguments and kind of get down to like the the nitty-gritty of what's true and what's and what's false because I think the reason that I've been able to figure out about what I've been wrong about what I've been right about is because I've had to like really defend myself and I'm sure that there and sometimes I'm like no actually my defense doesn't make any sense like what I'm saying actually is wrong and you change your opinion you're allowed to do that that's fine with me but I just thought that that was weird I'm surprised that you guys don't find it more strange because we've all been we're all especially the three of us I think have been in the industry for a really long time and Tim joined it a little later",
            "start": 1846.68
        },
        {
            "text": "that you guys don't find it more strange because we've all been we're all especially the three of us I think have been in the industry for a really long time and Tim joined it a little later but has known many people in the industry too and I find that very I find that authentically weird like like that there's an imbalance there and you you know where there should be maybe not 50/50 or maybe not 40 0 like it is and there you know 40 4 0 with conservatives moderates and and liberals but not like 99 to one you know like that's not weird I don't know like that's that to me is a little strange and so that was the thing I was bringing up it's not necessarily about what the ideology or what you even believe but just the sense that like there just seems to be a vacuum and uh I think I think if you were to somehow be able to poll the industry and compare them to that you'd find apathy way bigger here well and that's what I hear privately and that's but that's not so much from media as that is",
            "start": 1877.28
        },
        {
            "text": "were to somehow be able to poll the industry and compare them to that you'd find apathy way bigger here well and that's what I hear privately and that's but that's not so much from media as that is from Developers so you know and it's not like I talk to a million developers but I've had people that Dev's big and small comment to me thank me for that but I've never dealt with that with media and that's specifically what I'm talking right because Dev's are running a business right these people are engaged in that level of you know profit making that most journalists don't necessarily have to trouble themselves with right sure um and that makes sense I mean it's it's true I know it's just such a such a nice way to put it I didn't mean it like that I just mean like when you're when you're paid to just write about things like that's all you concern yourself with when you're running a company and if your product sucks your company goes away um a tax break could be a very big thing right uh so",
            "start": 1914.0
        },
        {
            "text": "just write about things like that's all you concern yourself with when you're running a company and if your product sucks your company goes away um a tax break could be a very big thing right uh so it is a lot of I mean most corporations are conservative because that's the nature of a corporation like you want to run an economy that the government's not dipping into your pocket and taxing the **** out of you so you can hire more people so you can have a higher output so you can make more money that's the way it works that's how that's how businesses work yeah I think I think I think the answer in in my opinion I think the answer is more simple like Twitter's clearly blocking conservatives no I don't I don't think that at all I I think that conspiracy I think that it's more simple I think that like-minded Minds higher like-minded Minds higher like-minded Minds higher like-minded Minds true and I think that that I was yeah and but it's like out of control yeah it's not it's not",
            "start": 1949.64
        },
        {
            "text": "I think that like-minded Minds higher like-minded Minds higher like-minded Minds higher like-minded Minds true and I think that that I was yeah and but it's like out of control yeah it's not it's not equivalent to the people that they're talking to you know what I mean like it's just not but I mean like so I I'm not following that just in the sense that no one ever asked me my political thoughts no but they can feel it they can just feel it yeah in the balls well then I mean in the big fat you get what the argument is no you're political no no one ask your political feelings but you're a liberal I mean you're obviously a liberal the the and there's nothing wrong with being a liberal my my most of my family are liberals like I'm not I have no problem with liberalism it's just not what I feel I would say Tim's a lot more libertarian than he's liberal Tim's definitely I mean I mean he's from San Francisco and I don't mean that as as a pejorative like socially he's liberal but he like",
            "start": 1986.0
        },
        {
            "text": "I feel I would say Tim's a lot more libertarian than he's liberal Tim's definitely I mean I mean he's from San Francisco and I don't mean that as as a pejorative like socially he's liberal but he like behind the scenes conservative yeah well now he owns a business understands how much the money I like business so so to me it's like so you might lean more libertarian but you have social liberal views which I do too and it becomes more complicated to identify those things but you know I didn't see many people writing the kinds of articles I was writing or saying the kinds of things I was saying and but they seem so evident and when I would write them I'd be attacked by some people and I'd be attacked by a lot of people in the media but I'd get a lot of support from people that were reading it and to me that's said a lot where I'm like do you just feel like no one's writing to you because because games are very political art is political anyone who says they they remove your politics and all",
            "start": 2025.96
        },
        {
            "text": "to me that's said a lot where I'm like do you just feel like no one's writing to you because because games are very political art is political anyone who says they they remove your politics and all this **** from art you have no idea what you're talking about you can't remove that kind of stuff from from games like the games are political even even games that aren't political are political and you can read into all sorts of kinds of things to them what's the same thing like the Vita though like no one was writing about the Vita you were so of course the audience there is the people that want to hear you talk about the Vita so of course they're going to love it and love you for it you know but and and those people to my point needed someone to talk about the Vita and so there was someone talking about the Vita and what I realized was just like I didn't my intent was never to become like a a conservative like light like like lightning rod ever in this industry but but it did happen",
            "start": 2063.36
        },
        {
            "text": "talking about the Vita and what I realized was just like I didn't my intent was never to become like a a conservative like light like like lightning rod ever in this industry but but it did happen because there was just nothing else and I'm like there are way smarter people way better writers way like more eloquent thinkers than me that could do this and I feel like they must be amongst us but I just feel like there is a bias and I just don't I and and that's fine if there if there is a bias but I got through it somehow I don't know because I I was always political too is there is there an analog on the other side for you I mean can you think of anyone that's as political in the games industry As You Are I can think of many I'm not going to name names I don't want to talk about it as political as like as left as spoken yes based on my Twitter there's a couple people that are definitely seemingly the anti-Colin yeah absolutely I mean there are I don't want because it's not about",
            "start": 2093.56
        },
        {
            "text": "political as like as left as spoken yes based on my Twitter there's a couple people that are definitely seemingly the anti-Colin yeah absolutely I mean there are I don't want because it's not about individuals I don't want to talk about individuals it's not about them it's like I don't want to call anyone out it's not about any of that everyone's allowed to have their own opinion it's not their fault necessarily that they were hired into an industry that's already super liberal and so they're going to hire super liberals and then they're going to hire super liberals I mean that's the way it goes because I know that I've been my politics have been held against me in this industry or whatever this goes back to another topic we already talked about which I don't want to I don't want to retread I just thought it was interesting I never thought about that particular angle whether it's true or false and I'm curious what people out there think about it you can let us know in the comments I'm",
            "start": 2130.24
        },
        {
            "text": "I just thought it was interesting I never thought about that particular angle whether it's true or false and I'm curious what people out there think about it you can let us know in the comments I'm sure I'll hear from you on Twitter but like that's interesting to me you know like politics are ubiquitous in art games are ubiquitous in society there's no evidence as far as I can tell that there's more liberals playing games and conservatives or and they are more moderates than both said but then you're talking about different things though right cuz playing games we're not talking about we talking people write about games we're talking about people that are but then we're talking about people reading what my my walk is that people are then reading this content but they're reading it all from similar like just really from one side and I'm curious about like well why how did that happen like there's there's definitely is there something you think in the art of being a writer you think that",
            "start": 2160.08
        },
        {
            "text": "similar like just really from one side and I'm curious about like well why how did that happen like there's there's definitely is there something you think in the art of being a writer you think that draws out the liberal people well do you think it's just the locations artist you think of games media where is games media it's all in San Francisco or New York City New York, LA if you're YouTube right yeah that's it it could be but but that suggests the point is is that wouldn't it even make more sense if it was 9010 you can't even say that that to me is so that's the only point I'm trying to make yeah I think it goes back to the fact that art is generally Progressive right is an art seen as a progressive medium and that's that engenders that kind of thinking for the most part that's a possible explanation for it I don't know I just thought it was interesting it was this is basically just an observation I don't know whether people agree with it or disagree with it or what the",
            "start": 2194.8
        },
        {
            "text": "a possible explanation for it I don't know I just thought it was interesting it was this is basically just an observation I don't know whether people agree with it or disagree with it or what the reasons are or whether it even really exists but I think it's evident I just think it's one of those things where you always talk about um hopefully this breaks the Republican Party this presidential election right yeah I almost want Trump to win and we come back with a the nomination we come back with a another party that is exactly what you're describing right and that's when I'm all in when there's a party that is what we're talking about socially liberal financially conservative there it is why does nobody identify themselves as a conservative because a conservative is attached to Republicans and Republicans seem batshit crazy and I think even you are saying you're not going to vote for any of these candid or you know you don't support these candidates no I wouldn't I'm not going to I don't",
            "start": 2234.12
        },
        {
            "text": "Republicans seem batshit crazy and I think even you are saying you're not going to vote for any of these candid or you know you don't support these candidates no I wouldn't I'm not going to I don't know like it's as weird dedication to a party I guess that I don't think I don't see why people would have that Dedication that party that's why I'm registered independent right cuz I want to see every time who the best person for the job is I'm with you right there like I'm saying like if that party comes around and that's what they're doing and that's what they're selling I'm going probably have to do it myself if big old Mitt Romney get Republican Party 4.5 that'll be nice so anyway I I was curious I was that's very good I was just curious what you guys think about I'm sorry if I if I ranted well I don't think it was rant I think it was pretty coherent but but uh something I was just thinking about thinking about very recently that I was surprised I just never thought about before and curious",
            "start": 2267.24
        },
        {
            "text": "I don't think it was rant I think it was pretty coherent but but uh something I was just thinking about thinking about very recently that I was surprised I just never thought about before and curious what people think about that imbalance if it really exists and I do think that part of it must be mitigated by alternative press alternative YouTube alternative sources of information that do not come from this what is really a dying core of video game press anyway but um to me it's like that still was fascinating that I never really I don't know like I sometimes I'm astonished by the really obvious **** I never thought about and uh I wanted to bring that up as one of my conversations I hope people enjoyed it and you definitely let me know what you think of it if you didn't know ladies and gentlemen this has been The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head",
            "start": 2298.96
        },
        {
            "text": "gentlemen this has been The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to Patreon.com/KindaFunny and toss this a few bucks to get every episode early along with a bunch of exclusive content and perks if you have no bucks to toss no big deal head over to YouTube.com/KindaFunny where break the show up topic by topic day by day until the entire thing posts is one big video each and every Friday in MP3 of course around the world yeah you should definitely go to Patreon.com/KindaFunny just like Adam Garcia did our Patreon producer for this month great no there's nothing goes up forget no put it put your hands down nothing goes up for Patreon producer anyway shout out to Adam Garcia he's freaking awesome he made the circle logo shirt the Kinda Funny shirt you can find on KindaFunny.com store beautiful blue I love it you go follow him Adam Garcia on",
            "start": 2335.56
        },
        {
            "text": "shout out to Adam Garcia he's freaking awesome he made the circle logo shirt the Kinda Funny shirt you can find on KindaFunny.com store beautiful blue I love it you go follow him Adam Garcia on Twitter and Instagram shout out to Anthony Carbon who turned me onto those armpit pads those diapers so now I can wear the blue shirt and not have armpit sweat stains still I'll break it in tomorrow if you watch the Kinda Funny Live some for your panties also Pat you were **** awesome I like you thank you for all your treats thank you thanks for having me do you want do you want people to follow you on Twitter or anything that's right I don't use Twitter okay go don't follow on Twitter don't do anything bad then no happy marriage and everything yeah nice Cheers Cheers Cheers until next time cheers",
            "start": 2371.36
        }
    ]
}