{
  "id": 1763,
  "video_id": "S5iXvqFrzZc",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Planning Kinda Funny Live 2 - The GameOverGreggy Show Ep. 129 (Pt. 2)",
  "description": "Tim Gettys is excited that Kinda Funny Live 2 IS HAPPENING.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1464073200,
  "duration": 2051,
  "transcript_chunks": [
    {
      "text": "Thanks to Amazon video games for supporting Kinda Funny Live. Amazon debuted an awesome program for their Prime members, Prime gamer pricing. You can now get 20% off all your game pre-orders and also any newly launched games up to two weeks after they come out, valid on physical video games. Learn more at amazon.com/gamesave. Kinda Funny Live 2 is this Saturday and Sunday. If you haven't got your tickets already, go get them at kindafunny.com/tickets. Tim, what's your topic? Yes, my topic of course, Kinda Funny Live is happening, so I wanted to talk about it a little bit. This is the last GameOverGreggy Show leading into the event itself, right? Right, right, right. This will, we'll record one before then with a guest, Mhm, but a guest that we'll be at, yeah, Patreon supporter from patreon.com and then he'll be at the real show, the live show and that's very, very exciting. We've been working super, super, super hard on this. **** it's going to be really, really cool. I want to get you guys thoughts",
      "start": 0.12
    },
    {
      "text": "then he'll be at the real show, the live show and that's very, very exciting. We've been working super, super, super hard on this. **** it's going to be really, really cool. I want to get you guys thoughts a week in a week out, not in mean I didn't sleep last night. You were up till 5 a.m. editing stuff for Kinda Funny Live. Yeah, and that's what I'd like to stress if I can. You say we've all been working really, really hard on this, that's a load of ****. You have been working, so is Nick, give Nick crit and Kev, big Kev, but here if I'm being clear and I think seeing as how you guys have your own projects you're working on secret projects. Sure, again, the Lion Share has been you, you and I mean like in terms of planning and editing and talking to people and writing things and figuring out what's going to happen next da in terms of planning the event and making that happen. I feel that's been you and Nick joint for sure because that's been months and months a months and then in terms of getting",
      "start": 60.52
    },
    {
      "text": "to happen next da in terms of planning the event and making that happen. I feel that's been you and Nick joint for sure because that's been months and months a months and then in terms of getting things we need and doing all the other crap, it's Kevin we got the doer. Yeah, and I Kevin's the best doer in the world. What I really appreciate about this show in particular, it was a little bit like this last year, but this year is the first time, thank you very much for the kind of words by the way, um but what I appreciate at the thing thanking me I didn't do goddamn thing you're doing you're doing cool ****. I planned one thing uh what I really appreciate this time is it's the first real time that I feel like me and Nick are switching roles in the I am directing this you are producing this sense where usually you're directing the thing and I'm just helping you produce you and I'm the one that's like Nick okay you need to **** get this **** done stop doing that **** choose things now",
      "start": 100.12
    },
    {
      "text": "where usually you're directing the thing and I'm just helping you produce you and I'm the one that's like Nick okay you need to **** get this **** done stop doing that **** choose things now totally flipped like Tim totally flipped like don't do a balloon drop and I'm like I'm **** doing a balloon drop and you're like don't and I'm like all right I'm just going to order the balloons and then we ordered the balloons so we're get balloon drop but point of clarification of the balloon drop I was not the only person on the planet that said don't do a every other person was like you're I was going to say wasn't it the person who owns the venue or whatever or the person who's doing all the set and lighting was like you're going to put balloons above my set none of this is true none of this is true at all the only trueu to that it was the was the venue lady who was oh no Matt gave you **** too for the balloons Matt was the one that told me to do the balloons no Matt was like Matt",
      "start": 132.68
    },
    {
      "text": "this is true at all the only trueu to that it was the was the venue lady who was oh no Matt gave you **** too for the balloons Matt was the one that told me to do the balloons no Matt was like Matt said something about like Junior High dance or something like that that balloons that was a Nick joke no I'm pretty anyways you guys are going to **** love the balloons they're going to be goddamn awesome I led the balloons last year so did I he was going to hate that's cool everyone else gets balloons I didn't like blowing up the balloons yeah why Kevin bought machines this time we got Mach he also bought balloon tires which uh I guess take a some sort of advanced engineering degree pull it out and you're going to have to do it you want I'm not doing that **** I'm not blowing up one **** balloon I'll tell you that right now no see me near a balloon if a balloon hits me I will lose my **** that's the that's the final straw for Nick that is it that is it I get big it's over yeah",
      "start": 163.68
    },
    {
      "text": "balloon I'll tell you that right now no see me near a balloon if a balloon hits me I will lose my **** that's the that's the final straw for Nick that is it that is it I get big it's over yeah it's been it's been really crazy CU like last year was a lot of work this year is like a whole other level because it's such a bigger show but I'm really excited because it's finally reaching that like kind of pushover point where um all the things are out of other people's hands and now it's on us so I'm like oh we got this **** cuz I know we could do **** it's when it's other **** I don't trust other **** sure cuz other **** you know it's never a priority for those **** um but a lot of the **** came through and I appreciate that so now it's just about finessing it into the beautiful Eagle that is Kinda Funny Live too that's the thing as much as you know you talked about it in I think what two episodes ago you had stress for the first time or finally understood stress that was",
      "start": 200.28
    },
    {
      "text": "Eagle that is Kinda Funny Live too that's the thing as much as you know you talked about it in I think what two episodes ago you had stress for the first time or finally understood stress that was the thing of like I was excited to get you closer and closer to this moment where it's like it's cuz now we're that thing of like if it happens it happens and if it doesn't it like whatever two in a week and a half this show is happening whether it's us on a cardboard box or whether it's us **** floating around in a pool that you can go underwater for drum solos I like that a lot that'll be cins in maybe for KFL 3 um we're not getting a pool yeah but um but that's the thing it's like if the the fear of the balloon drop was that oh it's awkward it might not work all right it doesn't work doesn't matter we're Kinda Funny we do whatever the **** we want say you think I'm if it doesn't work you think Zyer is going to make fun of me for it nah n Zager is's going to love that ****",
      "start": 241.88
    },
    {
      "text": "doesn't matter we're Kinda Funny we do whatever the **** we want say you think I'm if it doesn't work you think Zyer is going to make fun of me for it nah n Zager is's going to love that **** he's just going balloon Zager will be too busy looking at pictures in his hotel room thinking that their scenery from outside is window even though it makes no logistical sense how that picture can be there stop eating peyote so the real I mean you're asking how we feel I mean I'm **** hyped I I've never been more excited for anything in my entire life it's going to be **** awesome like if even 30% of what we have planned actually goes through this is going to be way well that was the thing when you and I sat down months ago at dinner and like we were I think we were planning Square enic stuff maybe or whatever we came back here and kept drinking and we went through like what it was and like we laid out all these dumb ideas and you're like if if this",
      "start": 281.36
    },
    {
      "text": "we were planning Square enic stuff maybe or whatever we came back here and kept drinking and we went through like what it was and like we laid out all these dumb ideas and you're like if if this happens that's and like I think just about every one of those things we talked about happened every gu we wanted every stupid video bit we wanted yeah yeah there's a couple things that we had to like tone down a bit but it's like then we also toned up 10 other things and added five more things sure to make up for it I think it's going to be going to be **** cool what do what do you think Nick where you at with it all I I'm I'm in the same place where it it took a lot to get sort of the the partnership and stuff in place with RT um toward the beginning of the year and this kind of played into it originally we were going to kind of just do the event on our own and it wasn't going to build into the bigger sort of Let's Play partnership and now because obviously it makes a lot more sense and",
      "start": 318.36
    },
    {
      "text": "it originally we were going to kind of just do the event on our own and it wasn't going to build into the bigger sort of Let's Play partnership and now because obviously it makes a lot more sense and it's a lot more fun to work with another group um we did that I think that added a lot more stress so up until probably last week I was like I don't want to **** do any of this um this week was the first week where I'm like oh this is I forgot this is going to be fun this is going to be a good time I just have to remind myself of that but there's a lot more moving pieces in this um that there wasn't last year um because we made it bigger now there's always in the back of my mind that I'm like people would probably be okay with us just going up there and just hanging out for a couple hours talking to them just like Kevin Smith does um and we chose to do the complete opposite of that which is make a crazy like variety show with special guests and video pieces and crazy lighting and set",
      "start": 354.12
    },
    {
      "text": "talking to them just like Kevin Smith does um and we chose to do the complete opposite of that which is make a crazy like variety show with special guests and video pieces and crazy lighting and set and stuff like that uh which is cool but honestly I'm at a point with it where I'm I I'm behind on a couple other projects so I'm just **** like I just want it all go away I just want to get to it have fun and then not do it again for another year yeah see I want to get it done and do it again immediately but that's I'm dumb no not really cuz I mean let's play live June 17th La even though we that we don't need to plan that that we just need to go and show up that's going to be **** awesome yeah I I'm so so excited for this cuz my whole thing was I remember last year everyone expected it to be that where they just came and watched the podcast and like I remember the moment I remember seeing everyone walk in in their faces be like holy **** when there was like Kinda Funny branding",
      "start": 389.2
    },
    {
      "text": "to be that where they just came and watched the podcast and like I remember the moment I remember seeing everyone walk in in their faces be like holy **** when there was like Kinda Funny branding everywhere and like there was an actual stage it just had like a feeling of like see stage we're about to fill this room with people like it was definitely really really really cool seeing the merch table seeing like Kinda Funny branding with all of our names on like table curtains that was definit I that was you know that was what four months into the project last year in terms of like you know real days four months and a half I guess yeah but like when it was like real and so it's in a similar vein for me this time around where it's like you've been doing so much and you know so much about it that it wasn't really I like when I sat down to edit that video a couple weeks early lay out my storyboard for that video I was like oh this going be a lot of fun and then like last night when I",
      "start": 432.28
    },
    {
      "text": "it that it wasn't really I like when I sat down to edit that video a couple weeks early lay out my storyboard for that video I was like oh this going be a lot of fun and then like last night when I I sent you that photo of me in a costume I was like it's kind of cool like you know what I this is going to be super super fun it is and and I think that it's crazy cuz I didn't think that we could outdo what we did last year in terms of that feeling it's kind of like the Uncharted conversation we always have like Uncharted 2 has it's special because of what it was at the time that it happened and Kinda Funny Live one was that I think for a lot of people myself included um but we me and Nick did the venue inspection a week ago and just being in that space and imagining what it's going to be when it's filled and with the amount of tickets we sold this place is going to be **** packed and that's awesome like it's going to be awesome oh yeah don't get me wrong d of it's going to be an",
      "start": 464.44
    },
    {
      "text": "be when it's filled and with the amount of tickets we sold this place is going to be **** packed and that's awesome like it's going to be awesome oh yeah don't get me wrong d of it's going to be an amazing event and it'll be well worth every single piece of effort we put into it it's just the leadup to it has been not bad it's just a ton of work and it's like everything we always do where we've got we chose to throw a couple other projects on our plate that had we not would have made the workload pretty manageable like I would have actually been able to enjoy the process this time but it's been just kind of like a Non-Stop **** just Avalanche of Works since I don't know forever January of this year January going back all the way to January last um so when I stopped like when I'm well rested in the like when this morning when I woke up I was super excited about it right and then today I spent all day like doing sound effects for the last episode of latest episode of kind of fun of",
      "start": 500.72
    },
    {
      "text": "rested in the like when this morning when I woke up I was super excited about it right and then today I spent all day like doing sound effects for the last episode of latest episode of kind of fun of the animated series and I'm getting text from my animator right now uh Dean who has been working for the last like a month and a half straight to give me one final shot that he stayed home from work to do today and I feel bad asking but we need it so it's like right now and this is the shitty thing about where I'm at and this is I apologize for jumping down your throat earlier but I'm so **** tired that that I just want to **** curl up in a ball and I want all this **** to go away and I know that come Saturday night that'll all go away like it'll all be worth it but right now the animated show all this other **** that I'm doing is not panning out and it's not I I'm not getting that emotional payoff that I get when I present an awesome piece of work to the audience it just hasn't",
      "start": 543.4
    },
    {
      "text": "show all this other **** that I'm doing is not panning out and it's not I I'm not getting that emotional payoff that I get when I present an awesome piece of work to the audience it just hasn't happened um and so my it's literally **** clouding my mind right now like there is a dark cloud above me and it's been above me for the last two and a half months so it's going to be awesome because I'm really looking forward to sharing this night with all you guys and with the fans and finally decompressing from that and not only that but this will have come out and the other thing we're doing will have also come out we can start working on that but until we get to that point I'm gonna **** kill someone probably at some point metaphorically speaking and I didn't think you jumped on my throat today for the record I don't I did and I apologize for that I mean in terms of like we've all jumped on each other's throats worse than that calm down it's fine sh but like remember that we it's the",
      "start": 578.48
    },
    {
      "text": "today for the record I don't I did and I apologize for that I mean in terms of like we've all jumped on each other's throats worse than that calm down it's fine sh but like remember that we it's the I remember this last year that's when you did the poster tube on the wall was last Kinda Funny last like we understand the amount of stress you're under the amount of thing and that's that's why I think for Colin and I we try to be helpful but we try to stay out of the way it's like what can we do okay nothing all right rece on yeah and it's I mean it's on me too and it's on Tim as well that we we put the stress on ourselves right like I said earlier we could have we're really bad at saying what's doable okay let's go 5% above that right we just let we just we start there kind of we're like what could we accomplish and then on the walks to and from Starbucks that 5% goes to 10% and then 20% and then 40% and now we're at a **** like to put in context we going to rent the Great American",
      "start": 614.16
    },
    {
      "text": "what could we accomplish and then on the walks to and from Starbucks that 5% goes to 10% and then 20% and then 40% and now we're at a **** like to put in context we going to rent the Great American Music Hall which is a 400 seat venue had it locked I was about to give her the deposit and then Gusa said oh you guys are doing 400 oh we should triple that yeah and that **** tripled not no offense to Gusk if he's watching Fu you g should have killed you with that b g was like oh you guys we we could push more people than this we could bring more people in a lot bigger of an audience can be a part of this and we had to say yes I'll never forget that phone call cuz it was like the first time it was right when the RT like partnership was really becoming a real thing right and we're we're talking to him and he's just like you're only getting 400 oh you guys you guys can push 1,000 easy yeah and I just I remember looking at you and I was like and we both were kind of like he's right we can",
      "start": 647.68
    },
    {
      "text": "to him and he's just like you're only getting 400 oh you guys you guys can push 1,000 easy yeah and I just I remember looking at you and I was like and we both were kind of like he's right we can and then like afterwards we walk away and we're like can we I don't know we can we can surprise oh no surprise we can I mean I had no doubt that it was a good idea it was it was a well it was a calculated risk right it was one of those things we like we're like well let's let's take this is worth the risk this is worth going big for cuz if we fall short whatever it'll be the first time we've ever really it'll be the first time the garbage truck exploded and we have to put it back together um but it's still going to be on fire no matter what so whatever yeah um this fire is going to burn brighter than any fire we've ever Liv it's smell disgusting in that room after two days yeah um but no but I think day like how I feel right now am I going to feel like this come Saturday night at 11:30 good",
      "start": 691.84
    },
    {
      "text": "than any fire we've ever Liv it's smell disgusting in that room after two days yeah um but no but I think day like how I feel right now am I going to feel like this come Saturday night at 11:30 good getting sleep and going into the meet and greet portion on Sunday no I feel great it'll be a huge huge huge like Albatross weight lifted off my shoulders right yeah um and then of course we'll go right at E3 which will be another interesting thing that we have to start planning at certain point but that I'm planning that don't worry that's actually to me way easier than this because there's less moving Parts but that's something we do we have done all collectively for the last 10 years and so like I have every faith that you will plan that perfectly we will come in as backup do whatever you need to do we'll knock that in the park this is a **** mamore style concert that we are throwing for up of 1,00 people and the big thing for me is like I I think I'm like we're going to get everything",
      "start": 729.72
    },
    {
      "text": "to do we'll knock that in the park this is a **** mamore style concert that we are throwing for up of 1,00 people and the big thing for me is like I I think I'm like we're going to get everything you're talking about getting done but we got to still rehearse all that stuff and get it all the day of because we didn't have enough money to get the venue the day before we have to figure out in a six-hour period to load the entire show in get it rehearsed with all our special guests provided they all show up on time which our people are good but who knows uh and then doors open at 7 for VIP so see what happens it's going to be but merch is on lock there's so many things that could have been **** that aren't that's the thing for me like I I do have to remind myself on this that we don't have to be no one expects Perfection from us right but there is a part of possibly but there's a part of my brain that year for that right there will always be that is always who I am and that is that is",
      "start": 771.48
    },
    {
      "text": "to be no one expects Perfection from us right but there is a part of possibly but there's a part of my brain that year for that right there will always be that is always who I am and that is that is usually why I get really stressed out because I don't like 90% I don't like 95% I like 110% I like giving people way **** more than they thought they were going to get because that's what we all do every time we go to B like we swing for the **** fences we don't bunt we don't we're not trying to get a base hit we're trying to get **** Grand Slams every time we do anything sometimes we fall short but at least you know you put all that effort into it you swung as hard as you possibly could and had you made contact the **** thing's gone no no no don't don't put on him I just want to know if you had the same thought I did where it's like how do you get the gr side without putting people on Bas I was like do we call him on the fact that's no nobody nobody's because I knew you were there",
      "start": 810.84
    },
    {
      "text": "you had the same thought I did where it's like how do you get the gr side without putting people on Bas I was like do we call him on the fact that's no nobody nobody's because I knew you were there but I was afraid it was one of those 50-50 things where like GNA **** the room I had that I had that thought too I had that thought too I was like you shouldn't have gone with I I was like so with you cuz you were doing great you were doing great just the end I was like if you wanted to hit solo dingers all day then that's great that's that's an ambitious goal even I don't know I'm thinking maybe but uh par um so anyway so I mean that's the problem is like you have to with production you just have to let go sometimes and I've been really bad lately about letting go just cuz there's a lot of stuff I want this to be awesome I want I want us to wear silly costumes and and give people exactly what they're expecting but more yeah I think the going back to your other stresses I think the big",
      "start": 848.48
    },
    {
      "text": "stuff I want this to be awesome I want I want us to wear silly costumes and and give people exactly what they're expecting but more yeah I think the going back to your other stresses I think the big problem with what we do is that we add on so much when it is just us and we've been getting a lot more help now than we did before like with RT they've been **** awesome about helping out with this event they've also added a lot of complications and layers just because dealing with more people creates more issues and more we're not as fast right yeah so you know there's just different issues that come up but the thing with us is it's like all right we're doing the press conference a Kinda Funny life Guess what at a press conference you need to have announcements you need to do things so we take that as a **** challenge to let's do 10 new huge projects you know so like yeah the **** you and Kevin are working on now it's like it's why are we doing that right now why are we doing that",
      "start": 893.72
    },
    {
      "text": "take that as a **** challenge to let's do 10 new huge projects you know so like yeah the **** you and Kevin are working on now it's like it's why are we doing that right now why are we doing that right now because it's **** awesome that's why and it's going to be awesome I can't wait for when people see that announcement oh I think so I and honestly it's it you can't pick and choose in business and in life you can't really pick and choose when things happen sometimes you can but for the most part things you know there's things you can you have to just react to them things happen to you and you you go this is an opportunity we either take it or we don't and we're really really we have a great track record of thinking of like as a group going we got to take this one right and like Kinda Funny Live is one of those instances where we could have we could have been done with the show already we could have been sitting on our thumbs like twiddling with if we just wanted to do a",
      "start": 930.28
    },
    {
      "text": "Kinda Funny Live is one of those instances where we could have we could have been done with the show already. We could have been sitting on our thumbs like twiddling with if we just wanted to do a podcast or like I said just do the Kevin Smith does. By the way, Kevin Smith phenomenal show not taking anything from him but all he does is sit up there and tell the same 10 stories that he's told for the last 30 years that I think are amazing and I'll listen to every single day. Um but we we don't want that for ourselves and I don't think we want that for our sanity so we made it four times as hard on ourselves and then decided to just keep **** taking on. I think the other thing there too and this is something that me and you kind of talked about over the last couple years but it's like you know last year we we charged like $0 a ticket I think $0 $50 for VIP this year it was 70 and 50 right and it's like is that too much is that a lot whatever we're discussing it's like well if we",
      "start": 968.12
    },
    {
      "text": "know last year we we charged like $0 a ticket I think $0 $50 for VIP this year it was 70 and 50 right and it's like is that too much is that a lot whatever we're discussing it's like well if we charge that much that puts it on us to put on a show that's worth that much and it's like that's how I like think where it's like cuz that money goes straight into putting it into the show to making it bigger and better and it's like I really enjoy that that's the level we're at this year like we're at a level where we're putting on it's at least a $70 show like it's **** insane like I've seen big budget concerts that don't have as much dumb **** as this does you know but that's what people are here for if they're not here for dumb **** what are they here you know why I think the money you know I was I was I didn't really have an opinion on the money one way or the other about what we were charging but it reminded me of the fact that at concerts specifically I mean I'm not so familiar",
      "start": 1001.56
    },
    {
      "text": "know I was I was I didn't really have an opinion on the money one way or the other about what we were charging but it reminded me of the fact that at concerts specifically I mean I'm not so familiar with the YouTube Community but concerts that are known to have like big touring groups so like a band that I love like 311 or whatever um they do 311 day every other year and they do 311 cruises every summer and it seems like the and those are like expensive and it seems like this the part of the experience is not only seeing them play for five hours or something which is an incredible amount of time for a band to play and play Rarities and songs they never play or you know but also to it's part of like being around other people that feel like you feel and I think that that's kind of part of what you paying for almost is to like it's like uh dating for 100 people but not in a romantic way where you kind of like get to like I feel like part of that is like a really nice way to meet",
      "start": 1040.08
    },
    {
      "text": "of what you paying for almost is to like it's like uh dating for 100 people but not in a romantic way where you kind of like get to like I feel like part of that is like a really nice way to meet other people in line or you're kind of vibing with people and and and you meet new people and you you knew someone on the Facebook gr on the forums and you meet them there I think that part of that is kind of the fee the entry fee is like this is I don't like using the term that this is our most hardcore fan base that's going because I don't think that is true I think it's our most hardcore fan base that can access the tickets or access San Francisco I think we have Europeans and people from all over the place or just younger people people without a lot of funds that can't do it but so I my whole Mantra with this is been you know to to just stay away because it reminds me I've never planned something this big but it reminds me of just little things that I've done in the past where I'm like",
      "start": 1074.76
    },
    {
      "text": "Mantra with this is been you know to to just stay away because it reminds me I've never planned something this big but it reminds me of just little things that I've done in the past where I'm like everyone just needs to go the **** away and I'll handle this myself and funny enough the thing that came to mind the most was when Greg and I used to sit in a room every year and do the top PS3 and V and PS4 games and then everyone would try to give feedback and bosses would comeing i' be like can everyone just get the **** out right you know like we we're making the list the list is going to be the list it'll be great just leave us alone and when I thought about that in a very that would take like a day of our lives every year yeah you know we want to **** kill ourselves and then I multiply that by 100 and I realized that that's kind of what you guys are going through so I'm like my creative input not really needed the trust is what's needed and you kind of just back away and I've",
      "start": 1107.92
    },
    {
      "text": "that by 100 and I realized that that's kind of what you guys are going through so I'm like my creative input not really needed the trust is what's needed and you kind of just back away and I've given feedback on a couple things but like I'm like I don't know I it's not really my pet you know and I kind of just trust since we've been doing this for a long time now and nothing's really gone like totally off the rails that like you guys are going to be fine doing these things but I also think positive reinforcements I wrote him a message the other day and stuff like that just let let people that like we're thinking about you and you know we're we support you but like I get it I wouldn't want to deal with me I wouldn't want to deal with Greg and uh I certainly would want to deal with Kevin I I don't want to pop in with dumb questions you've been thinking about for like four months I have questions and and and I don't have any concerns really but I have questions and stuff but I'm like you",
      "start": 1140.76
    },
    {
      "text": "don't want to pop in with dumb questions you've been thinking about for like four months I have questions and and and I don't have any concerns really but I have questions and stuff but I'm like you know what like like I'll be I'm like I'll just figure it out when we rehearse like I'm not even I'm like really not even worried about it and in fact like I think that the onus on us this year in terms of rehearsal and things you have to remember is actually not as high because it seems like we used more of a spreadshot this time with like a lot of cool **** that it it doesn't seem like so totally focused on only us it seems like it's focused on some cool events and some other cool people and stuff like that and so my personal take you ask like what where where is my head I'm like I'm not worried about it and I haven't really given it too much thought because I'm like I'm going to I I have no prec preconceived notions when we sit down and we unveil everything to each other like when",
      "start": 1179.32
    },
    {
      "text": "worried about it and I haven't really given it too much thought because I'm like I'm going to I I have no prec preconceived notions when we sit down and we unveil everything to each other like when we're getting in there I'm like then I'll understand it and that's the time for me to think about it in the meantime like just like you guys trust that the things I do are getting done I'm like I trust that this stuff's getting done and that they don't need me to really bother them about it so do I have a bunch of questions sure am I super interested in knowing what's going to happen yeah do I have a general idea what's going to happen sure but I'm not like now's not the time you know we're like it's almost like a band that tours every year and they don't talk to each other until two or three days before when they rehears CU they're like we're going to play our music right like I think we know what we're going to do so let's not you know let's not we don't have to worry about it I",
      "start": 1213.52
    },
    {
      "text": "three days before when they rehears CU they're like we're going to play our music right like I think we know what we're going to do so let's not you know let's not we don't have to worry about it I appreciate that um because your level of trust you got both of your level in trust in US is has been kind of I never actually have thought about that until now but Tim and I have gone out and spent a lot of money on this and you guys are just like okay well know you're spending money we know you're you're doing things but I'm like we'll we'll make it back and if we don't it was a learning experience but we're going to make it back and I'm not super worried about I'm just not when have you steered us wrong that's the big thing and I don't we don't we don't stress that enough to you which I know comes off as maybe not being interested or not caring but it's like when you're like here's the budget for this project and it's obscene right and it's just like yeah whatever cuz that would be like",
      "start": 1245.04
    },
    {
      "text": "comes off as maybe not being interested or not caring but it's like when you're like here's the budget for this project and it's obscene right and it's just like yeah whatever cuz that would be like me coming you and being like I don't even know I need to do this on the for my topic I don't you know I have no great analog but it's like yep whatever you say the animated series is going to cost or what you need sure whatever you need for this show whatever you need for the next big project you come in and you lay it out and call like it's like you know what I mean it's like every time you guys come in here there was a day Rec not recently God within this year where you came in here for a call probably about Kinda Funny Live and it was right after you got some other announcement about Kinda Funny Lobby you came in here and I turned him like thank God we have them you know what I mean cuz like this is well if the business was just the two of us would be we would have $10000 on",
      "start": 1277.64
    },
    {
      "text": "Kinda Funny Lobby you came in here and I turned him like thank God we have them you know what I mean cuz like this is well if the business was just the two of us would be we would have $10000 on Patreon our one Patreon we would have $10000 on and I would cry cuz of all the Twitch stuff like I like we would know nothing we would have no idea we would we be great at creating shows and shotgunning them out there I don't know how to get any of on the logistical back end is like what's really um pretty remarkable and that was what I part of what I said I don't want to talk about all I said to Tim in his message but part of what I said is that Tim is a dual threat right and like that's really become super interesting to and dual threat of course is like a sports term but like you know so I'm not really that b but like it means like you could do two things very well when you really expected to do one you can in basketball you can play defense and you can shoot in hockey you can back",
      "start": 1311.92
    },
    {
      "text": "I'm not really that b but like it means like you could do two things very well when you really expected to do one you can in basketball you can play defense and you can shoot in hockey you can back check and you're fast like you know like those kinds of things matter and they're unusual and I am not a dual threat right and Greg's more of a dual threat than I am but it's like it's the the analogy I've used in the past before is like we get games right Greg and I are the G getter of games we know the Publishers we know the developers and we acquire the games you don't ask how you got them we just give them to you right it's like yo you want a code for this okay I got it for you here it is and you guys don't ask those kinds of questions about like well how did you get it who did you know and like tell me about and it's like it doesn't matter I got you the game it's so it's just the same much more serious way of way you guys are doing where it's like Yeah The Venue cost X and you're",
      "start": 1348.64
    },
    {
      "text": "and like tell me about and it's like it doesn't matter I got you the game it's so it's just the same much more serious way of way you guys are doing where it's like Yeah The Venue cost X and you're dealing with Y and vendor Z and all that kind of stuff and I'm like okay like I I don't need to even know how this is happening you guys have it unlock right the same way that your tweets are written every day and Facebook and Instagram's taken care of or we're getting you codes or we're dealing with Publishers and all that kind of stuff and Greg's planning E3 it's like we don't need to know like there's enough trust it's Kinda Funny because the parallel to what Greg was saying in the original topic about how like tensions are high my personally feel like my tensions are really low right now you know like because I'm kind of just more relaxed than ever but again as I said on the last week show I am still Colin so like right so there's like 30% tension right and it comes with a Litany of",
      "start": 1382.32
    },
    {
      "text": "you know like because I'm kind of just more relaxed than ever but again as I said on the last week show I am still Colin so like right so there's like 30% tension right and it comes with a Litany of quirks and authentic annoyances both with myself and with others but like to me it's it's it's to say that at the core of this group of four and now five is there is like a level of trust where I'm like I've never trusted anyone ever the way I trust like when we were at even at IGN like there were people I trusted there like people that were veterans where I'm like I know you can do this but if someone like that I didn't know or didn't trust or like was newer was writing a story whatever I'm like I read that whole thing and I would rewr half of it you know because I'm like nah no right you know but with this it's like I don't I there's just a level of trust that is so high um that I think it's kind of remarkable and I think that's kind of the antithesis in a sense of what Greg was saying",
      "start": 1415.6
    },
    {
      "text": "but with this it's like I don't I there's just a level of trust that is so high um that I think it's kind of remarkable and I think that's kind of the antithesis in a sense of what Greg was saying not to say what Greg is saying isn't real it is is but like you can cut that **** with a knife sometimes but at the same time I just feel like there's a there a high level of trust and that's what makes the company function that's what's making the company you know very profitable and very successful and growing is because I think that we're not up each other's asses that in fact like I'm technically the CFO of the company M but like that's just a title it doesn't mean anything you really are the one dealing with all the all that kind of stuff and I trust you to do it you know meanwhile Greg is the CEO but you guys are kind of dealing with outside vendors and doing like the leaders ship roll positions that you know need to be done with Rooster Teeth and all these kinds of things so there's",
      "start": 1455.08
    },
    {
      "text": "the CEO but you guys are kind of dealing with outside vendors and doing like the leaders ship roll positions that you know need to be done with Rooster Teeth and all these kinds of things so there's a lot of different permutations of the way things happen that I think it's quite remarkable and I think Kinda Funny Live to is a really nice lens into how this happened and we were kind of stupid not to document it better and when we do Kinda Funny Live three we really should hire acrw to document it I mean we talked about it it's just that's it's hard I mean because that's the thing is it's like that's you know that cost money that who's going to plan that and like it's just it gets to the point where hope next year we'll be more than F they either get to plan the thing they're planning or work on right we could we could next year we could have done that yeah it's it's it's the inclusion of the additional uh Project X that we're working on that project I think was and and that's you",
      "start": 1495.24
    },
    {
      "text": "or work on right we could we could next year we could have done that yeah it's it's it's the inclusion of the additional uh Project X that we're working on that project I think was and and that's you know to your earlier Point like it's it's it's really up there's no bosses here no one made us do this stuff this is something we all got excited about and I was like I'm really excited about this this is like right up me and Kevin's alley like this sounds awesome this is a tremendous opportunity that could really really benefit the company Long Term like yeah let's **** do this and it was like cuz you and I for were like neck on Kinda Funny life for a while and then it was like exactly I'll see you later bro and you like I guess but that's that's my thing is it's like the thing you guys are working on I I definitely have my opinions and my thoughts but it's just like I'm not going to get that **** done you know what I mean I know I know he will I know you I I me I have my thoughts",
      "start": 1527.0
    },
    {
      "text": "are working on I I definitely have my opinions and my thoughts but it's just like I'm not going to get that **** done you know what I mean I know I know he will I know you I I me I have my thoughts on the programming for the stuff but at the end of the day it's like I look at what you're doing and I'm like even though some of it's not what I would do balloon drop um it's still going to be awesome it's still going to be fun it's going to be hilarious when the balloons drop with with you know or don't drop whatever **** car we'll make a um thank you but I look at it and I'm like again it's one of those things like and this is this is important for anyone out there who's working in a team or in a business together like you have to know when to put your opinion forth or know when to look at something and go not the way I would do it but still going to get the effect that I would want to get it's fine it's great and that's exactly how I feel about your guys' thing I'm like I trust I'll",
      "start": 1565.8
    },
    {
      "text": "something and go not the way I would do it but still going to get the effect that I would want to get it's fine it's great and that's exactly how I feel about your guys' thing I'm like I trust I'll be good if I ever need to give my opinion I will for sure um but it's been hard and I apologize to you guys because sometimes over the last like month I've given my opinion for no even I I I'll hear the words coming out of my mouth for things and I'm be like you're just being negative cuz you're tired like I I I don't even mean to do it I'm just like G that thing you're like yeah like oh that's fine like that's great cool but like I so I've been trying consciously to like to not it's it's difficult for me to do when I'm super stressed out but not see everything as a negative first right not have that first guttural negative reaction or something and you guys see it I'm sure when you guys talk to me and I'm like and then I'm I get through it I'm like oh wait this is actually a fun thing",
      "start": 1602.92
    },
    {
      "text": "have that first guttural negative reaction or something and you guys see it I'm sure when you guys talk to me and I'm like and then I'm I get through it I'm like oh wait this is actually a fun thing let's talk about this right um but it's been hard this last couple months have been probably to the hardest of my life oh 100% yeah I think the one thing you have to so little bit of that oldfashioned renowned Colin optimism yeah is that you know a lot so I think that I think that so a lot of people ask when we're going to grow right and when we and like as in terms of new like numerically and um we grabbed Kevin over a year ago and we've not grown since then and actually I do feel like we're like we will be in a position and I don't know the ins and outs of it you know like other than knowing the back end of our business which I do but where like next year when this happens to point of like who's going to manage these things I think we are going to be six or seven or eight next year like",
      "start": 1644.52
    },
    {
      "text": "the back end of our business which I do but where like next year when this happens to point of like who's going to manage these things I think we are going to be six or seven or eight next year like I do think that like it's entirely possible that like we can do a show even more grandiose with less stress spreading the ball even more than it's already been spread and so I think that's what gives me optimism and gives me pause when I say like well it can only cuz now we have to really worry about Kinda Funny Live three and four and five in a way of like being like well the **** are we supposed to do now and I'm like well but I'm like it's going to be fine because even if because like because we're not going to be the static group of five people with a static amount of you know funds or the whatever it is I really am optimistic that when we are planning this next year the the look of Kinda Funny next year this time is going to be radically different I think the shows will be the",
      "start": 1686.28
    },
    {
      "text": "the whatever it is I really am optimistic that when we are planning this next year the the look of Kinda Funny next year this time is going to be radically different I think the shows will be the same we'll have some new shows of course but like I I I just feel like it's not going to be quite as dire as we might think where I think this might be the hardest you've ever had you might ever have to work on one specific thing because I think that there's going to be more people to rely on that you trust that are in CRA and ey uh so take take heart in that because I think that you know you worked really hard at this and Tim's thinking exactly what I'm thinking that I love that concept it is a beautiful concept but Tim and I will find a way to blow those people's plates as **** high as ours right now and then do more go **** bad we are bad at you and I are bad at prioritizing yeah I mean it's true it it really is I mean but case and point Rooster Teeth has struggles with this right",
      "start": 1719.88
    },
    {
      "text": "ours right now and then do more go **** bad we are bad at you and I are bad at prioritizing yeah I mean it's true it it really is I mean but case and point Rooster Teeth has struggles with this right because they have a whole events team now but they're really busy because they've said well instead of just RTX now we're going to do Let's Play Live which is happening the week after E3 right but they're all going to E3 they're all so so like I feel like that's that's a that's a that's a hard thing for businesses to rectify because there's still an inherent fear inside me that this might go away one day and I don't ever want that to happen so I pedal the **** metal right until the car Burns itself out right which it is burning itself out but it's fine I'll get it washed over the weekend I'll be fine um that's not how you fix a car you're burning out oh **** should probably take my Honda in then um but but that's what I'm saying is like and and that STS from the IGN days right where",
      "start": 1758.16
    },
    {
      "text": "be fine um that's not how you fix a car you're burning out oh **** should probably take my Honda in then um but but that's what I'm saying is like and and that STS from the IGN days right where we all good enough wasn't good enough ever at IGN for me it wasn't Port just threw up in Greg's mouth did we get that on camera hand if you're list3 hand not mouth hand what's out of his mouth 40 that's scary so I got to take care of this now Greg that was so **** up how poro threw up in your mouth I like that that's you said I'm like anyone listen to the MP3 imagine we oh God I'd like to give props to myself though for just catching that was good I didn't even know what the **** was happening till it was over so that was keep an eye on him and see what that's all about yeah but Kinda Funny Live it is is yeah no it's going to be crazy I I'm so I'm so excited for I know at this point it's Overkill of me talking about just because like I this is my what I want to do with my life is this",
      "start": 1796.2
    },
    {
      "text": "live it is is yeah no it's going to be crazy I I'm so I'm so excited for I know at this point it's Overkill of me talking about just because like I this is my what I want to do with my life is this show you know and it's I think that's kind of why I want to go so overboard with it and I am so pushy when it comes to stupid **** like balloon drops and stuff because it's like I want the whole thing to just be moment after moment of memorable **** because it's like this is what I experienced this is the things I looked forward to growing up and it's just it's awesome that you know from my path of making stupid videos in high school to IGN to what Kinda Funny is it's like this is my one chance where I just get to act like the the stupid ass I get to be Kanye you know what I mean and like this is my Kanye moment that's **** awesome that's all I want there a bunch of people that are in on the joke with me um so that's away from the Kanye think but like uh just the fact that they",
      "start": 1842.0
    },
    {
      "text": "like this is my Kanye moment that's fuck awesome that's all I want there a bunch of people that are in on the joke with me um so that's away from the Kanye think but like uh just the fact that they you've all been here for this whole fuck ride so it's like for me to be on stage you know looking like an fuck and for all them to be into it it's like that is the the best thing for me to look forward to and like I'll fuck never sleep again for that fuck because it's going to be it's going to be great no I agree it's going to be awesome and like even when you were talking about inviting people you you know you reached out to everyone which I'm like you're right we should this is going to be awesome this is something that like this is going to be one of those shows that at first you're like is it is some of the stuff in there embarrassing yes will people think it's hilarious and laugh yeah is it weird that all like some of my old bosses are coming to this and they're going to see",
      "start": 1883.64
    },
    {
      "text": "like is it is some of the stuff in there embarrassing yes will people think it's hilarious and laugh yeah is it weird that all like some of my old bosses are coming to this and they're going to see us being complete chuckleheads but I'm like they knew who we were anyway yeah no the chucklehead part I think everybody's expecting that don't worry about it but I just love how this show is totally built for you the viewer of the of our content where so many people who are just like our casual friends and love love us and love what we but don't like watch it are going to be there for the first 15 minutes like like what I don't understand why any of this is happening or people like what's happening my entire extended family is coming but they're going to be in a room with people going fuck crazy to get it and they'll feel that energy I remember all my friends last year like I don't understand what the hell happened but obviously I'm missing out and I'm like cool that's fuck great you",
      "start": 1920.0
    },
    {
      "text": "crazy to get it and they'll feel that energy I remember all my friends last year like I don't understand what the hell happened but obviously I'm missing out and I'm like cool that's fuck great you fuck are missing out you but but uh I don't I have never ever been more proud of a project that I've worked on and that's cool because I feel like continually that just keeps happening with us like we just keep doing stuff I'm like fuck this is awesome but this I don't know I'm going to beat this but I will I know you will is it jawsome Street Sharks jawsome that's the thing Street shark Street Sharks oh yeah Tim my only I don't want to bug you with questions that you've already thought through my only thing have you encouraged everyone to bring poster tubes uh no but I mean I feel like the the VIP the sorry the merch trailer people have been hitting me up like what size is it for poster like last year we had chairs so it was easier to hide stuff under them and stuff like that I just",
      "start": 1959.12
    },
    {
      "text": "the VIP the sorry the merch trailer people have been hitting me up like what size is it for poster like last year we had chairs so it was easier to hide stuff under them and stuff like that I just want to make sure there's a Cod check if people posters probably this is not I mean this is a problem that you deal with the concerts it's not like it's not like being like hey bring your poster tubes got to figure that out you need to make sure we at least bring rubber bands yeah yeah like we did last year Kevin's on it Kevin's doing the shug what are we worried about Kinda Funny life is gonna be great sorry Kevin almost quit because you fuck said that you think did you see as a side note did you guys see the fuck balloon tie tool that and he was like I don't understand how this oh when he figured it out it was amazing Kevin you're so smart",
      "start": 2001.96
    }
  ]
}
