{
    "id": 1722,
    "video_id": "s7aANZeFZug",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Greg Kasavin"
    ],
    "title": "Like Bastion and Transistor? Let's Play Pyre! - Kinda Funny Plays",
    "description": "Greg plays Pyre with Greg Kasavin from Supergiant Games!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1462464002,
    "duration": 1911,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to another let's play here on youtube.com/KindaFunnyGames. I'm Greg and so is this Greg Kasavin. How are you doing? Well, Supergiant, thank you so much for coming through here. Very excited for Pyre. Of course, we're big fans at Kinda Funny of Supergiant, Transistor, and then going backwards, Bastion. Bastion finally came to Vita though, so that's all you need to know. Kevin, did you like Bastion on Vita? I sure did. He sure did. Yeah, we're big fans. We're big fans. So, now you guys have announced Pyre. Yep. What is it? What are we going to see today? Uh, well, it's it's a new game from us. We're once again uh switching kind of the entire setting, uh switching genres even. Our previous games have been like action RPGs and this one we consider to be a party-based role-playing game. So we wanted to make a game with with a bigger cast of characters in it. That was like a big starting point for us 'cause you don't want to do anything easy. Don't stick with what you've been",
            "start": 0.08
        },
        {
            "text": "game. So we wanted to make a game with with a bigger cast of characters in it. That was like a big starting point for us 'cause you don't want to do anything easy. Don't stick with what you've been doing. No, it's the you know, the thing like we're we're we're still small and everything. We want to stay small and we're in this, we think we're in like a pretty unique place of being able to just make new stuff. Like even for bigger studios who experience success, they often get bound to their successes and you know, your your game was a hit. So you get to keep making that game over and over. So for for us it's like for as long as we can, we've just really enjoyed just trying to push ourselves creatively and see what see what comes out the other end, see if people are into it. Well, what blew me away about Pyre and I should have expect nothing less from you guys that you know nothing about it. You announce it and then it's at PAX East, you play it and I'm like, what the, that seemed like a fast",
            "start": 37.12
        },
        {
            "text": "away about Pyre and I should have expect nothing less from you guys that you know nothing about it. You announce it and then it's at PAX East, you play it and I'm like, what the, that seemed like a fast trajectory. No, that's I mean, that's always we've uh if you if you kind of uh study our moves, we've done that and we've done that every time where it's like it's super important to us to not reveal what we're working on until we feel like we're ready to just hand it over to someone and let them play it. Um 'cause until that time we feel like it's not really ready to be shown yet if we're not comfortable just uh letting letting someone else have a go at it. And we it's important to us to get the both the gameplay and like the whole atmosphere and presentation uh far enough along to where uh yeah, it can just kind of speak for itself. Okay. Well, let's let it speak. Well, I mean, we're going to talk over of course, but play some show. We can talk over it and and you um you you have invited me to",
            "start": 74.64
        },
        {
            "text": "it can just kind of speak for itself. Okay. Well, let's let it speak. Well, I mean, we're going to talk over of course, but play some show. We can talk over it and and you um you you have invited me to play it. I don't want to look terrible. I don't want to do this is I haven't played it yet. I don't want to sit do one of those things where I do it and I'm walking to the walls like no, you got to go do this and like you just show me why 'cause again, you're Supergiant. Like I'm I'm going to be a fanboy for this game no matter what. So, it doesn't matter. I mean, as usual, the art style breathtaking. Thank you. Yeah, this is this is what we just showed at at PAX East uh just what was it? I guess two weeks ago. Yeah, it goes so fast. I don't like think about it. So, um the whole uh right away the um you know, narrative has always been key in in our games and uh it is key in this game once once again uh we deliver it in kind of a different way. Um, I will be talking over some of the initial",
            "start": 113.6
        },
        {
            "text": "um you know, narrative has always been key in in our games and uh it is key in this game once once again uh we deliver it in kind of a different way. Um, I will be talking over some of the initial narrative here, obviously. But guess what? You got to play the game when you get the chance. Like, you know, we're not here to just ruin the game. You still got to give your hard-earned dollars to him. Wait in line at future PAXes. When's this one coming out? Uh, next year sometime. Yeah. So, you got like four more PAXes before it comes out 'cause it's going to get delayed. Oh, we haven't, you know, we've been on time with our with our previous game. So, we shall see. That Vita version of Bastion right on time. Yeah, I didn't drop off the map forever. Yeah, that one. Okay, that one took a little while. There we go. Nails you. So, the platforms this, PS4, PC. Uh, that's that's right. Okay. Yeah. Um, so so what's going on here is uh you are an exile sentenced to life in this place called the",
            "start": 152.0
        },
        {
            "text": "while. There we go. Nails you. So, the platforms this, PS4, PC. Uh, that's that's right. Okay. Yeah. Um, so so what's going on here is uh you are an exile sentenced to life in this place called the Downside. And you have been found by these three strange masked characters. Uh, and they've rolled up in their crazy black wagon here. And they're just kind of talking about what to do with you and they've you're kind of close to death right now. Um, so two of them are like, ah, he's he's done. Um, but one of one of them is kind of like, let me see what I could do with this guy. So he is he kind of reveals himself now. This is one of the first guys you meet. Totally normal looking dude. Normal looking dude. He's been around here uh he's he's had to survive and he's he's kind of helped you to your senses now. And his name is Hedwyn. I like this. I like this whole Wikipedia style. Yeah, we have, you know, uh, this got it was it was awesome that for us it's like um not like a major feature or",
            "start": 195.92
        },
        {
            "text": "senses now. And his name is Hedwyn. I like this. I like this whole Wikipedia style. Yeah, we have, you know, uh, this got it was it was awesome that for us it's like um not like a major feature or whatever, but it's really it's really cool that people responded well to it at PAX. Uh, for us it it is like the ability to just kind of hover over key terms in this world. You're you're a character who knows about the world that you're in. So, uh, so we don't have to do the normal, I have amnesia. Teach me everything about the world. And without like plotting exposition of like, you you you know my sister from ever since you know we played tether ball together when we were children, that kind of dialogue we can avoid all of that and just give you the context um very cool as you desire. And here's Jodariel, there kind of a the horned woman, uh, and our third and third and final companion, dog man with a mustache, yes, who who we may regard by the name of Rooke Greentail. So, he is kind of a uh sort",
            "start": 245.12
        },
        {
            "text": "Jodariel, there kind of a the horned woman, uh, and our third and third and final companion, dog man with a mustache, yes, who who we may regard by the name of Rooke Greentail. So, he is kind of a uh sort of a scheming character. Gotcha. So, now they're wondering something about you and Rooke is less patient. And he's wondering if you can read. Um, you can figure out what a reader is. Uh, in case you don't know what a reader is and you kind of starting to pick up here that in the world of Pyre, literacy is uh prohibited. Uh, but you uh as a as a reader and as a video game player do have the capacity to read. Um, but but of course we can we can claim that we can't read. Never heard of it. Read the mere insinuation. How dare you accuse me of being a reader. But they they know they really know what you are. Um, you can't really hide it at this point. Um, and they need for you to read something that they have found because they themselves cannot. And that's why they were looking for someone like you.",
            "start": 286.4
        },
        {
            "text": "are. Um, you can't really hide it at this point. Um, and they need for you to read something that they have found because they themselves cannot. And that's why they were looking for someone like you. Uh, but before we can go jump into that, but before we do that, this here is the is the black wagon. And you find that you can kind of interact with a variety of objects in there. There are these little pyre-imps hanging around and stuff. There's this shady looking fellow off in the corner you could blow out. We kind of wanted to make the the sort of world where you could almost feel like you could reach out and touch it. Um, and um, we this screen is kind of a, that's awesome. It's always so boring when you play these kind of interactive games, right? And the only thing you can touch is your objective. Yeah. And we wanted we wanted to make the kind of world where where you could you could really sort of feel like you could explore it. So here is this artifact called the Book of Rites that",
            "start": 341.84
        },
        {
            "text": "Yeah. And we wanted we wanted to make the kind of world where where you could you could really sort of feel like you could explore it. So here is this artifact called the Book of Rites that you alone can read. And um in here you basically discover that there is a way to be free from this location that supposedly no one can ever return from. Gotcha. So these guys are like, \"Uh, hey man, uh, so what's what's in that book?\" And uh, but before you can tell them, one way or another, it does something to you. Always the way. Oh jeez. Dare you tamper with forbidden knowledge. So now strange things are afoot. So soon after your sentence into exile, it is true what the book says. You can be free again. Perhaps not you yourself, but someone worthy of the privilege. So, you witness, I always feel bad talking over the voice over is, you know, it's uh some witness some folks who've enjoyed our previous games, they've they've been like, \"Hey, is is the guy uh Logan Cunningham? He's the voice of",
            "start": 386.16
        },
        {
            "text": "bad talking over the voice over is, you know, it's uh some witness some folks who've enjoyed our previous games, they've they've been like, \"Hey, is is the guy uh Logan Cunningham? He's the voice of the Bastion narrator and the sword and the Transistor.\" They're like, \"Is Logan Cunningham in this game?\" And like, \"This is this is actually him.\" Yeah. Are you **** kidding me? Logan Logan is a good actor with with quite some range. See, I thought he was just a gravelly-voiced dude, but no, he can do a whole bunch of different stuff. Yeah. So, he's this this character we refer to as the Arch-Justice who's kind of presiding over this ancient competition. What does this guy have on you that he's just the lead in every one of your games? He's he we like like just about everyone at the studio. Uh we just go way back with him. He's old friends with uh Amir Rao, one of our one of our co-founders, and Darren Korb, who does all our audio and music. So, they've known Logan since they were like kids",
            "start": 445.04
        },
        {
            "text": "Uh we just go way back with him. He's old friends with uh Amir Rao, one of our one of our co-founders, and Darren Korb, who does all our audio and music. So, they've known Logan since they were like kids playing soccer in middle school. Nepotism. Got it. We missed her even in the family. So, now Hedwyn here vows that if the rest of them are going to be free, you will be free, too. But they need your help in order to kind of figure out what this what this mystical ritual is all about. Gotcha. And here we learn how it works. We gain control over our characters. So you'll see conduct the Rites as a triumvirate for they. So this is just introducing some of the basic mechanics. How you control your characters just in themselves. The three must act as one. So this uh this competition called the Rites has its own set of strange sometimes arbitrary seeming rules just like any uh ritual. Sure. Um you kind of learn the Orb and be you learn more about it. But the real objective is to extinguish uh",
            "start": 486.56
        },
        {
            "text": "has its own set of strange sometimes arbitrary seeming rules just like any uh ritual. Sure. Um you kind of learn the Orb and be you learn more about it. But the real objective is to extinguish uh this Pyre on the other side of of the uh of the field here. The animations look awesome. Thank you. Into the flame is banished for a time. So there are some special rules to consider. Cohorts must make do on their own. Oh, but it is not so simple. In the Rites you shall face adversaries whose own freedom is at stake. So the Rites are kind of this zero sum competition where the worthiest exiles can go free, but exiles are pitted against each other to see who, if anyone, will be able to regain their freedom. So here we're just kind of just learning the rules. Accept it as a part of and uh the exiles get surrounded by these auras that can basically banish the opposing side. You can also launch it forward in kind of an attack like this. Gotcha. Correctly done. Again, so you can take out your your",
            "start": 543.52
        },
        {
            "text": "get surrounded by these auras that can basically banish the opposing side. You can also launch it forward in kind of an attack like this. Gotcha. Correctly done. Again, so you can take out your your adversaries either by kind of running into them or by blasting them. So in this case, we'll just run into them there. Is there a benefit? I mean, is this range? You have to worry about how far you can go. It's essentially just it's it's just a ranged benefit. It's just kind of like purely whatever is best suited to the tactical situation that you're in. And you'll see how it all we're going to put it all together in just a moment here. Then the Orb. So yeah, the the twist is when you when you grasp this object called the Celestial Orb, your aura is absorbed and that's how you that's how you extinguish the Pyre. So you're vulnerable. If I walk into their auras here, I'm kind of eliminated. But I could also I can leap and leap over their auras and go into the when I don't choke. No one's",
            "start": 607.84
        },
        {
            "text": "extinguish the Pyre. So you're vulnerable. If I walk into their auras here, I'm kind of eliminated. But I could also I can leap and leap over their auras and go into the when I don't choke. No one's watching. Don't worry. There we go. Interesting. So, that's the basics. And now, um, we're going to get have to do it for real. Okay. Adversary, whilst yours yet burns. I cannot get over this. The Bastion voice. Yeah. Yeah. And the and the Transistor voice. I know. I know. Um, he um, yeah, Logan. Uh Logan is I I do the the writing on our games and it's just always been a huge pleasure to work with him. Uh he's he just really stand I feel like whatever I can write the worst garbage and Logan will make it sound awesome. It sounds epic as soon as he says it. Yeah. Yeah. So in in this case the uh you know this is a voice that we just had a lot of fun with. Um it's a it's you know, yeah. Sounds quite a bit different for in its own right than like either the Bastion or Transistor voices, but it felt",
            "start": 659.04
        },
        {
            "text": "know this is a voice that we just had a lot of fun with. Um it's a it's you know, yeah. Sounds quite a bit different for in its own right than like either the Bastion or Transistor voices, but it felt very uh in in tone with this game. So, he kind of takes on this almost like an MC type of role during these competitions. Is he I mean, is it similar to the other games where like he's the voice like this is the voice of? He is um he's the voice that you hear during these competitions for sure. And then uh we we can I'll I'll make note of it during uh some of the other some of the other sequences, but you hear like um you hear the characters in their own voices a little bit too. Okay. Okay. So, this is um it's going I I have played this video game before, so it's it's um there's not as much for you to learn. It it's going it's going a little easy on on you at the beginning. Uh we uh it kind of uh it's just giving you an opportunity to try out some of these uh some of these various moves",
            "start": 719.12
        },
        {
            "text": "for you to learn. It it's going it's going a little easy on on you at the beginning. Uh we uh it kind of uh it's just giving you an opportunity to try out some of these uh some of these various moves that you have and get get comfortable like um basically extinguishing their Pyre. Sure. And and every time the the larger the character you you kind of go in with, the more of the fire that you put out with a single shot. Oh, so he got it. I can get it back. You're getting cocky. You're talking. They can hear you talking in the trash. Their flame has died. So, it's down to just one kind of one health. So, I can um I can I can seal the deal right here. Gone you lot. There you go. There we go. Home. Bring in your smallest guy but fast. Yep. I understand. There, dear reader. Now you understand. Or do you? This was but a glimpse of that which lies ahead. I would tell you to turn back. Cast down your hope. But all those such as you, you never listen. So with those uh pithy remarks, uh we kind of",
            "start": 764.32
        },
        {
            "text": "do you? This was but a glimpse of that which lies ahead. I would tell you to turn back. Cast down your hope. But all those such as you, you never listen. So with those uh pithy remarks, uh we kind of reawaken from this strange vision that we had. And these guys are like, these guys experienced it as well. And this is apparently something that they've heard about um but only only kind of rumored and they needed someone like you to interpret this book in order to kind of figure this out for certain. So when future battles happen, are they happening on the battlefield or is it visions again or it it's the the future ones are like for real. Uh which which we'll see a little bit later, but that's a good question. Yeah. So here here they need you once once more and um you know, back to the back to the Book of Rites. This is a this is a cosmic competition and they need you to kind of read the stars as well and figure out where the Rites are going to commence for real. And you've now kind of",
            "start": 824.84
        },
        {
            "text": "the Book of Rites. This is a this is a cosmic competition and they need you to kind of read the stars as well and figure out where the Rites are going to commence for real. And you've now kind of determined that the location of where the Rites are about to take place. Gotcha. So, we have some traveling to do at this toward this place called the Ridge of Gol. And they don't seem too excited about the idea of having to go there, but they've got three days and Hedwyn here is like, \"Hey, this is this is our shot. So, we got to we got to go.\" They all have their different points of view on it. Of course, uh Jodariel here is is a little bit more little more skeptical that this whole thing is going to pan out. Rooke is like, \"Whatever, man. I got nothing better to do.\" But Hedwyn is like, \"We got to do this. We got to go.\" So, um we're going to join them. We don't have much of a choice. We could stay and rot or or pursue this kind of path to freedom. So now we're off. How long have you",
            "start": 885.36
        },
        {
            "text": "got to do this. We got to go.\" So, um we're going to join them. We don't have much of a choice. We could stay and rot or or pursue this kind of path to freedom. So now we're off. How long have you guys been working on this game? We started in uh a few months after Transistor came out. Back in July of 2014 is when we first started kicking around ideas for this. Um so it's been a while. Like initially our pre-production is kind of slowgoing as we just kind of ruminate and start trying stuff. Um and we've been full-time on it probably for about a year. Obviously, we were busy with stuff like Bastion for Vita like you mentioned. So, available now. Check it out. Residents of Vita Island. I highly recommend it. So, here we are on the the kind of the way the over map plays out and we have a few resources to consider. We have our fuel and how many days we have to get to the loca location that we need to get to. Uh we can unpack here um and then sort of resolve the the events that unfold. And",
            "start": 933.28
        },
        {
            "text": "resources to consider. We have our fuel and how many days we have to get to the loca location that we need to get to. Uh we can unpack here um and then sort of resolve the the events that unfold. And here in this in this moment, uh, you know, the the characters are like, \"Hey, man, you're going to have to figure out what to do with your time here.\" As in being an exile is kind of rough going, so you need to figure out how to how to spend your time so that you don't go nuts. Sure. Um, 'cause you don't have access to the internet here. And uh, in the Downside, you have to choose from other things to do. So those things in your case are are various daily tasks uh which here include uh foraging for resources, studying in private or mentoring one of your companions. So do you have a do you have a preference off? I think I think we got to get resources right now. We're just starting. You got to build you stockpile. So let's go look around. That's true. Um so in in any given location, you could",
            "start": 978.24
        },
        {
            "text": "preference off? I think I think we got to get resources right now. We're just starting. You got to build you stockpile. So let's go look around. That's true. Um so in in any given location, you could choose where where specifically to forage. So here we have the meadows where there may be sources of fuel or the stonework may be sources of things that are valuable to traders. Uh any pref talk to me like he's Batman. I like that. Keeps calling me chum. Yep. And and uh so we get something, yeah, that we could sell for a little bit of money and and that starts to add up after a while. Sure. So, um, that that's something that'll come into play later on. We can now go back into our wagon here. Um, this is kind of your, yeah, it's your home base. Uh, we can interact with some of these systems a little bit more than we could in that in that very first scene and learn a bit more about these things. Our lone minstrel here is kind of in a stupor, but Hedwyn is like, uh, don't worry about him. So,",
            "start": 1023.04
        },
        {
            "text": "bit more than we could in that in that very first scene and learn a bit more about these things. Our lone minstrel here is kind of in a stupor, but Hedwyn is like, uh, don't worry about him. So, maybe these guys have a few skeletons in their closet. Uh, maybe not. I'm sure everything's fine. Um, there's this closed door back here. He's like, h, I can't. That's That's where they're eating people. That's where they're eating the people. Yes, exactly. So, what I mean, how does this, I what, how does this game start on paper for you guys when you're starting to kick around to work on it? It's it already looks like it's resource management and it's it's RPG, but then the battle systems like this. Yeah. I think I think for us like our um our games start from kind of a touchy-feely place. I would say it's more about like what is what is the feeling that we want to convey and for us this idea of like getting closer to a larger group of characters was was really appealing. Um so a lot started to",
            "start": 1074.72
        },
        {
            "text": "it's more about like what is what is the feeling that we want to convey and for us this idea of like getting closer to a larger group of characters was was really appealing. Um so a lot started to stem forth from there. The idea that you're you're kind of almost on like a big road trip with these guys. So having more time in the game to meet and interact with these characters than as compared to our previous games. Uh and also you know when it comes to the actual competitions uh this this environment where they have to rely on each other to achieve you know they have to achieve success together to get what they want uh individually. Um that that like thematically was very interesting to us and something that we could we could all relate to you know having having work together I think. Um so as you as you make your choices around where to where to travel you have these little events unfold. You get to know the characters a little bit better. You get you get more items and quests and",
            "start": 1119.2
        },
        {
            "text": "things. Um and you we could try a different choice this time. Let's mentor somebody. Let's mentor somebody. This is how well this uh says as much here, but the the characters are on their individual path toward enlightenment. And when they achieve enough enlightenment, then they can be free again. So, we can sort of uh by by interpreting the book for these characters, we can help them toward their path. So, let's let's do Rooke. Let's do Rooke. He's been he's been the GM so far. He's been helpful. So, Rooke is down for a little enlightenment. Um you you kind of talk him through some of it and he gains a little bit more which they normally would get from conducting the Rites, but you can you can basically sort of power level your characters this way. And once they get to a",
            "start": 1162.0
        },
        {
            "text": "some of it and he gains a little bit more which they normally would get from conducting the Rites but you can you can basically sort of power level your characters this way. And once they get to a sufficient level they get uh what are called masteries which are like specializations so they can get better at at their various traits and stuff. You could talk to them in the wagon. This is kind of a fun moment but um so we're still kind of getting chummy with Rookie here and he wants he wants to get our take on something and it's about his mustache in particular uh which he's been getting conflicting reports about. And we we really try to try to put the screws to you with these tough moral choices such as whether Rookie's mustache suits him. So he's better off without it. Better off without it. All right. All right. Hopefully we won't crush his dreams here. You know what? We got to be honest. That's got to be honest. Rookie understands that. He likes that. So yeah he app he's going",
            "start": 1213.76
        },
        {
            "text": "it. All right. All right. Hopefully we won't crush his dreams here. You know what? We got to be honest. That's got to be honest. Rookie understands that. He likes that. So yeah he app he's going to be right back. Yeah. Look. I mean look at how much better Rookie looks. So yeah uh even early on you know we find that our words can can have can have influence over these characters and Rookie kind of appreciated our honesty here and he gained a little bit of hope at least for now. Um hope is one of the several stats that these characters have. This uh this kind of roster area has opened up now where we could learn. We're not going to go through this in great detail here but you have your like your stats and your biographies for all these characters. Um and this stuff will expand over time as you learn more about them. Uh you know Jodariel here is does not have a lot of hope. She's rather melancholy but Rookie is upbeat now cuz he especially without his mustache to of course he",
            "start": 1259.12
        },
        {
            "text": "time as you learn more about them. Uh you know Jodariel here is does not have a lot of hope. She's rather melancholy but Rookie is upbeat now cuz he especially without his mustache to of course he doesn't look like a creeper anymore. Looks like a normal dog. Yes normal dog man. So now uh we we are within reach of of where we need to go. Okay. So we will head there. This is just again just some of the early uh decision-making where to go and how to spend your time and just try to ease you into it right? Yeah. And and we want you know we want the overmap to feel uh um uh we've seen comparisons of games like there's like FTL a game I really really enjoy um where you're making these like really painstaking decision these really tough decisions about where to go and you may be it may be like certain doom anywhere you go. And here uh I think we're going for something more kind of expressive where um it's it's not necessary this this game is really about the the choices you make",
            "start": 1303.12
        },
        {
            "text": "be like certain doom anywhere you go. And here uh I think we're going for something more kind of expressive where um it's it's not necessary this this game is really about the the choices you make along the way and kind of picking yourself up from your some of your defeats and some of your setbacks. Uh so we want the story to kind of move forward no matter what happens. Sure. And kind of be a little bit different I guess based on for every person and what they choose. So now we're kind of at the Yeah. We made it to the Rites kind of for real. We had the vision. Okay this is the real deal. Yeah. And your Triumvirate is ready. We hear the voice once more. Your adversaries in the Rite. I still can't get over it. So different. The talents of this voice actor. Logan Cunningham. Yeah he's a good dude. Burns once the other is extinguished shall step closer to freedom. Now so now these others these other guys show up and the this kind of cosmic event starts unfolding. Okay. So",
            "start": 1357.44
        },
        {
            "text": "he's a good dude. Burns once the other is extinguished shall step closer to freedom. Now so now these others these other guys show up and the this kind of cosmic event starts unfolding. Okay. So this is someone we haven't met before. He he refers to us as the Nightwings. Good name. And you're kind of like it's kind of slowly dawning on you at this point that maybe your characters they have these strange masks and robes in this wagon. Maybe this book like something shady is going on. How do they get all this stuff? And this guy Lendle here um is talking like we've met before even though you're pretty sure we haven't. So there's seems as though our friends here have come into possession of these robes and masks and have gotten in on some information but now they have to conduct the Rites for real. Now okay. Yeah. So do you I mean like I'm already seeing it. It strikes me. It's interesting how it's like this sporting event you know what I mean? In terms of like the way you move",
            "start": 1400.16
        },
        {
            "text": "for real. Now okay. Yeah. So do you I mean like I'm already seeing it. It strikes me. It's interesting how it's like this sporting event you know what I mean? In terms of like the way you move the ball and get into the That's an interesting uh interesting observation there. We we've enjoyed seeing um seeing that that kind of analogy dawn on people at different times during the course of this. Um and it's for us it was like a really uh a really interesting uh metaphor for a lot of what we wanted uh to be kind of at stake here where it's it's a it's a high stakes competition. Uh but if you fail um if you fail in this in this in this situation it's almost a fate worse than death that you're kind of like stranded forever in exile. uh if you died typically in a video game if you die you'd just kind of try again. So here we wanted we wanted characters to to have to have to deal with it the liar. So we're learning a bit about Lendle here. They're trying to defend their Pyre. Uh it's a setup",
            "start": 1464.64
        },
        {
            "text": "kind of try again. So here we wanted we wanted characters to to have to have to deal with it the liar. So we're learning a bit about Lendle here. They're trying to defend their Pyre. Uh it's a setup for us to try to throw them out of position here. So when he has the when he has the orb he's totally vulnerable and I could just grab it back from him. Okay. So a lot of a lot of the strategies around like moving your characters into position trying to kind of advance up the field but if you get everybody too far up the field and and you get taken out then then they can they can kind of recover the the orb very quickly. But there's um there's there's a lot of kind of mind games in close quarters because a a welltimed a welltimed jump can can take you over over their auras and kind of get you right into their right into their Pyre. So he just Oops. He just got me. I everyone all my guys are banished. So yeah he just Greg my Pyre weakens. you made this game. Well the we're we're doing a lot of",
            "start": 1526.8
        },
        {
            "text": "right into their right into their Pyre. So he just Oops. He just got me. I everyone all my guys are banished. So yeah he just Greg my Pyre weakens. you made this game. Well the we're we're doing a lot of fun stuff with the with the with the AI here and it it just like kind of I I shouldn't reveal too many of its tricks but it it adapts to the player's own skill level. So we we have a lot of fun playing this thing over and over no matter how many times we've we've gone through this. You ever just play dumb? What's that? You ever just play dumb on a different play through? You're like \"Yeah you know what? I want an easier match so I'll act like I want. It like works more the other way around where I'll I'll like go to town on it and then and then it just he'll like um Yeah he just he's like \"Oh way.\" But I uh Yeah I won't go too easy on him here. So he's busy trying to deal with Jodariel down there but I I was able to run it in. Very nice. I'm not I mean I understand I like single",
            "start": 1584.24
        },
        {
            "text": "like \"Oh way.\" But I uh Yeah I won't go too easy on him here. So he's busy trying to deal with Jodariel down there but I I was able to run it in. Very nice. I'm not I mean I understand I like single player games and all this but you're sitting on the next big esport right here. This can be that's that uh we we are um we got that it was cool to hear a number of folks like interested in the possibility of multiplayer in this. It's definitely something that we are looking into um and something that we're we're excited about the possibility of. But for us they're like there are a few stakes in the ground which are like if if we did multiplayer it would not be at the expense of single player. Like the the um the like the narrative and the the that aspect of the experience of this game is is our priority. Um and that's why like you have fans like me right? Cuz I know that's what I'm going to get from you. I know that your games are going to be story driven. They're going to be these",
            "start": 1632.4
        },
        {
            "text": "is our priority. Um and that's why like you have fans like me right? Cuz I know that's what I'm going to get from you. I know that your games are going to be story driven. They're going to be these great experiences. That's definitely if if we do one thing it's going to it's going to be that we're going to throw all of our effort against that. Um and and the other the other thing about multiplayer is like if the quality of the experience of just like getting into a match and all that kind of stuff if that's not there oh I just won. You have prevailed. So we need to get it then in your single fleeting. Let him talk. Sure. Sure. Sure. We have to get uh what was I saying? If we could do it not at the expense of single player and get the quality of the experience to be good enough that's that's when we would we would do it. So we're looking into the possibility of all that right now. But of course first you got to get Transistor and this on Vita. Like that's got to be the main",
            "start": 1691.04
        },
        {
            "text": "that's when we would we would do it. So we're looking into the possibility of all that right now. But of course first you got to get Transistor and this on Vita. Like that's got to be the main goal. We're all the boats have left Vita Island. We're all aware. Only the enlightened can regain their dude. This game's awesome. Thank you. Yeah. So here's where uh so Jodariel here gained gained sufficient enlightenment to where yeah her her masteries her potential masteries have revealed themselves. So in this in this initial case she could either do her rush twice in a row or fire her aura in a wider arc. So get get folks thinking about some of the some of the like character development type stuff that can happen. But this is this is suggestive of the the kind of the path that these characters will take. They need to gain enough experience to where they can be free again and then do what it takes to achieve that. That's that's essentially implicit of the structure and this is winding up",
            "start": 1734.88
        },
        {
            "text": "will take. They need to gain enough experience to where they can be free again and then do what it takes to achieve that. That's that's essentially implicit of the structure and this is winding up toward what what we have to show here. We're now back at the wagon uh with our with our friends here recapping some of what has happened. They've discovered that the Rites are in fact real and they've found their way in something that they've heard a lot about but didn't know that it was true and they've with your help as the reader uh there's a possibility that they can be free again. I bet they get free. I bet we get them free. Yeah we shall see next year. So uh so Hedwin is noticing that you probably have some questions now about all of what's happening and can ask why you was exiled and how did you get this wagon anyway and what happens if you refuse to help and things like that. Cool. Um and he's going to be still a little bit holding a few of his cards close to the vest there. You",
            "start": 1783.68
        },
        {
            "text": "did you get this wagon anyway and what happens if you refuse to help and things like that. Cool. Um and he's going to be still a little bit holding a few of his cards close to the vest there. You can trust me. We're on an adventure together. We're on an He needs you and you need him a little bit too. son of a **** So it's uh with with this initial portion of the game that we've shown it's it's a chance to meet some of these first characters that that you encounter and just the the setup for the for the journey at stake and we kind of you're going to go further and further deeper into this world like the map in the back. Yeah. It actually kind of keeps going uh almost like an onion uh back uh in into the Yeah. farther and further reaches of this mystical purgatory. Awesome. Uh yeah so that's Pyre. That's what we have. It's still kind of technically pre-alpha but um we're uh uh from here on out we just have a whole lot of game to make but we know we think we know where it's",
            "start": 1829.28
        },
        {
            "text": "so that's Pyre. That's what we have. It's still kind of technically pre-alpha but um we're uh uh from here on out we just have a whole lot of game to make but we know we think we know where it's going and we're really excited to push forward on it. That's awesome dude. Looks awesome. There it is. I don't have to say it. PlayStation 4 2017. Thank you so much for coming. My pleasure. Everybody follow my Twitter. It's been up a bunch of times during this. Uh and of course until next time it's been our pleasure to serve you.",
            "start": 1879.04
        }
    ]
}