{
    "id": 1760,
    "video_id": "yeFthtOEk-4",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Fixing Kinda Funny - The GameOverGreggy Show Ep. 129 (Pt. 1)",
    "description": "Greg Miller has an idea on how to fix Kinda Funny's issues.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1463986802,
    "duration": 1743,
    "transcript_chunks": [
        {
            "text": "we know a ton of your huge Overwatch fans and we are so grateful for their support of Kinda Funny Live. Thank you again, Overwatch team, Z Blizzard and Activision. Are you excited for Overwatch? If you haven't bought it yet, check out Amazon.com/Overwatch to learn more about the game. Kinda Funny Live 2 is this Saturday and Sunday. If you haven't got your tickets already, go get them at KindaFunny.com/tickets. What's up, everybody? Welcome to the GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer/to do sir, Nick Scarpino, in a very out of the ordinary heather gray shirt. I'm trying something new. I like it. It looks good. You should probably go out buying more of them. I thought about it. I've molded over as they say. Thank you very much. And you over here, the Prada Long Island, Colin Moriarty. Did you know that Kinda Funny Live 2 was happening? I did. The Reddit one cracked me up over there. The pure one, Timothy, that about it one. The Reddit one was just like",
            "start": 0.0
        },
        {
            "text": "the Prada Long Island, Colin Moriarty. Did you know that Kinda Funny Live 2 was happening? I did. The Reddit one cracked me up over there. The pure one, Timothy, that about it one. The Reddit one was just like, hey guys, something was, I don't forget what it was, something about Kinda Funny, I mean, it was just the entire workforce and then everyone talking about it back and forth. So funny. It's just funny that like, it's just they're not even mad about it. They're just like, we hear a lot about it, but it works. Oh, really? Do what we do. It is. It works. It's so funny. I've gotten more feedback for this ad read, quote unquote, that I've ever gotten for pretty much any piece of content I've ever made. Yeah, surprisingly positive. Like there's these guys, it's not negatively tinged necessarily. I'm sure some of the people are, but I'm surprised at how many people I genuinely liked it and genuinely are just like, hey, I thought you did a good job with that. Like that big like three tweets like, hey, this is your best",
            "start": 53.58
        },
        {
            "text": "people are, but I'm surprised at how many people I genuinely liked it and genuinely are just like, hey, I thought you did a good job with that. Like that big like three tweets like, hey, this is your best option. What the **** just thank you guys for being so supportive. Place somebody like doesn't, you know, like we make the content, right? And then Kevin goes and edits and I added PS11 thought of that. I don't, I didn't realize it was a thing that was happening. And something when I went through and I looked at the comments like, oh, that's what I like how they like, there's like one part where you start your like, is this, is it that good? It's a great, you know, how about you? They even put in your yea or nay. My God, I love that these guys are your big, the best friend, Steve and I. Oh, **** I'm planning out there like this one seems like fun. There's some coppenole, not really, not all that. Maybe in the comments on YouTube somewhere. I mean spirited into me. It's like you just took a duty time. What does that",
            "start": 90.87
        },
        {
            "text": "there like this one seems like fun. There's some coppenole, not really, not all that. Maybe in the comments on YouTube somewhere. I mean spirited into me. It's like you just took a duty time. What does that mean? We did. They just took, they just took more time to post like, what does that even mean? They just sorry, almost that then it took for them to get through the ad read or just fast-forward it. What's the big deal? I don't understand these, these companies. This is lame. Battery at the end of love and sex stuff. Oh, yeah, exactly. When yeah, I mean, I think the thing that people don't understand is that it is always someone's first time. And with the content, the amount of content we put out, I get that if you listen to everything we do, it is a little bit excessive. But like, Colin saying, it is just a slide away. And it's listening to the full podcast, you only hear once. Come on. You listen to Rush Limbaugh on the radio, New Yorker, you hear 1-800-Cars-For-Kids like 17 times a day. I thank you. Can't ask for word",
            "start": 128.61
        },
        {
            "text": "and it's listening to the full podcast, you only hear once. Come on. You listen to Rush Limbaugh on the radio, New Yorker, you hear 1-800-Cars-For-Kids like 17 times a day. I thank you. Can't ask for word. That 1-800-Cars-For-Kids, Kars4Kids. Yes, it's like a 30 minutes long. It's like over it for **** 5 years. They updated it. Finally did it. Yeah, I heard an updated version. It just as annoying buzz about remix slightly more. I think it was like a bit more upbeat. I think my dad finally in the car, the Kars4Kids, there's to shut him out of the tax break. I would if I do this is about ya. Do I opted out of the ad reads on the radio? What I'm saying is, yeah, what are you also in the radio? Are we're watching like YouTube as you can't skip those. You can only skipped it. I just don't understand people. I just skip it. Yeah, you can play about such mundane things. The other thing too is assignment about it's the ads as frustrating as they are to some people. It's so important because it's we're putting so",
            "start": 169.58
        },
        {
            "text": "just skip it. Yeah, you can play about such mundane things. The other thing too is assignment about it's the ads as frustrating as they are to some people. It's so important because it's we're putting so much work and it Kinda Funny Live. And I want people to go and I it's working. People are buying tickets because of those things. I can see it on the dais. Don't on weekends ticket sales are down. Then weekdays they're up. Why? Because the sod there. Yeah, so you are we putting him on this week's episode? No, I don't think it'll be on this this week's. Maybe a couple, but maybe an abridged version. We'll see. I delicious inserted right here, right here. Kinda Funny like now. Don't do it. Don't do it, Kevin. Big get real mad. Kevin, do it every time. Greg edits. Kevin going to attend minute. All right. Don't know. Just YouTube comments of something deal. What I mean, what is your problem all of a sudden? I'm she really know what O'Leary. The YouTube comments no matter what. Everything sucks. I wasn't mad that",
            "start": 212.87
        },
        {
            "text": "know just YouTube comments of something deal. What I mean, what is your problem all of a sudden? I'm she really know what O'Leary. The YouTube comments no matter what. Everything sucks. I wasn't mad that before. I've been on the internet for 11 years. Can you believe that explains so much about your personality on internet every day in my life for 11 years. **** neck. What a great way to spend my time, my life. Look at me now. Better than the radio. All right. Good memory. Over 11 years ago, right? Over 80,000 cars. Radio's an interesting industry. I'd like to learn more about how that's still going. How it goes already doing their thing yet. Devote as much time as that as possible to that one because it's gonna be around forever. It's really worth the time. And I know a couple people that I went to college with that are now like radio host at local things. I mean, they're they're successful. Yeah, I'm gonna call it. Yeah, quote unquote. Do I mean, they're doing it. I hear him whenever I listen to radio. I hear the",
            "start": 252.86
        },
        {
            "text": "that are now like radio host at local things. I mean, they're they're successful. Yeah, I'm gonna call it. Yeah, quote unquote. Do I mean, they're doing it. I hear him whenever I listen to radio. I hear the voice. I'm like, that's that's where multiple people at different channels. Do you know Chuy Gomez? I don't person. I doubt Chuy Gomez when personally. That's pretty cool. I was the wing eating competitions with him. Thanks for coming, Kev. He's kind of big friend. Kevin Chewbacca talking about no Bay Area radio legend, Chuy Gomez. Yes. Um, so yeah, he's 11. He's very legend for sure. It's not a one joke, but uh, it's weird because they do exactly what we do, but we get to have so much fun in sure. They don't FCC can stop us. We want to talk about dicks and taints and all we do. Yeah, right. You guys are out for it, Madrid. You **** love anuses and ad reads. If you didn't know, this is the GameOverGreggy Show. Each and every week, four, sometimes five best friends gather on his table. He's bringing a random",
            "start": 295.85
        },
        {
            "text": "for it, Madrid. You **** love anuses and ad reads. If you didn't know, this is the GameOverGreggy Show. Each and every week, four, sometimes five best friends gather on his table. He's bringing a random topic discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny. When you toss us a few bucks, get each and every episode early along with a bunch of exclusive parks and goodies. But if you have no bucks to toss, head over to YouTube.com/KindaFunny. We're opposed to show topic by topic, day by day until the entire thing post is one big video in MP3 the following Friday. What the **** your shirt? This is YIIK. To help Levin's. No, this is YIIK. It's a postmodern RPG coming out to the all sorts of systems including the Vita. Oh, wow. And they commit. I played it in enough events. I'm really excited for it. So I nag the Creator on Twitter all the time. Damn assure. No, no, no. Release your game. Really should get. And then I put out the link for the shirt and I said, are you you",
            "start": 337.04
        },
        {
            "text": "events. I'm really excited for it. So I nag the Creator on Twitter all the time. Damn assure. No, no, no. Release your game. Really should get. And then I put out the link for the shirt and I said, are you you think your game is going to deliver? I don't want to buy a shirt and then have garbage because I don't know anything. I think it'll deliver. And somebody else who some other person I trust chiming like, yeah, now watch you're done. If he said no, it's actually kind of a joke. I would have been like, you know what? I can respect that. You know, it's gonna get it bad. If you ever see when you see me burning the shirt an effigy, you'll know that YIIK let me down. Is this what I would hear what Marty Sliva on it though? Way. So it's towel or it's Marty, or it's Marty. So I oh, that's so much our Sliva. How could you possibly get that wrong? So the common Jewish guys name. Okay, calm down. I'm sorry. It's okay. We were just giving you a hard time. This is just weird that you never you worked with him for probably like",
            "start": 378.29
        },
        {
            "text": "you possibly get that wrong. So the common Jewish guys name. Okay, calm down. I'm sorry. It's okay. We were just giving you a hard time. This is just weird that you never you worked with him for probably like maybe three or four years when I first when he first got that. I did for sure thing. It was so Sliva. Yes, not two persons name. Yeah, well, because it's one of Eva. Yeah, things though. Like what his family came over to take my family. We were we were the Moriartys for a long time. We were the Murtaughs like a long time ago. And it's something we were tossed. Yeah, and sometimes much better. And some point that got all **** up. And you hear that all the time with people go to Ellis Island. Something I bet you it's possible that Marty's family the name might have been misspelled of a ledger somewhere and it became Sliva into the Silva. That's boss. I'm just saying it's not maybe likely. What's possible? Did you hear those stories all the time? As possible. No, my topic is more, you know, my topic is that having",
            "start": 423.53
        },
        {
            "text": "became Sliva into the Silva. That's boss. I'm just saying it's not maybe likely. What's possible? Did you hear those stories all the time? As possible. No, my topic is more, you know, my topic is that having you know, Nick's outburst kind of brings it all home for what my topic is. All right, Jim. When we branched out and started Kinda Funny, we did it as friends. And then we knew we'd be partners on it. That we became enemies. It's over time. We've begun to sour relationship. It's a bad time right now. Kinda Funny Live coming up. E3's coming up. When you came up, GTC. Those million excuses. RTX is coming. We're all stressed out. There's a million things wanna. We are the balance of our relationship has for sure swayed into the business partnership more than the friendship side of it. And so you're prone to outbursts like that. We make a little Jam. Marty Sliva and Nick was ready to kill everyone in the room. No dragging a murderous use. We should chill. Oh, yeah, sir. Sometimes you guys make fun of me and",
            "start": 468.14
        },
        {
            "text": "to outbursts like that. We make a little Jam. Marty Sliva and Nick was ready to kill everyone in the room. No dragging a murderous use. We should chill. Oh, yeah, sir. Sometimes you guys make fun of me and it's 99 percent of the time it's warranted. But there's every once in a while just acts. It's an honest mistake. And you think it's funny to make fun of me. And I push back. And then you get all butthurt because you didn't grow up an older brother. Now I didn't even make funny for this Sliva thing. I just laughed on Colin's shoulder. So we're back to wash. I made for you. Yes, that one scene. Oh, I know me. I put my money. I don't like you pointing at me or getting away from the topic. Sure. I've wrestled for what seems like dodecahedron. Not how to unify us. How to bring us back together to give us a common goal. And I've never been able to connect all your like this. This is like, is it this one? But if this involves us go kart racing, it doesn't. No, this is you're totally right up your alley. Hold on.",
            "start": 510.77
        },
        {
            "text": "goal. And I've never been able to connect all your like this. This is like, is it this one? But if this involves us go kart racing, it doesn't. No, this is you're totally right up your alley. Hold on. Stay. Okay. You know, it's gonna sound like I'm not up your alley. Okay. But then get come back. Come right up my alley. I needed it. I needed something to write up my holiday. Play straight up their main street map door. Now I've been looking for a way to unify us. Something to do so where we could get together. And I've racked my brains dodecahedron. It's all these different things, right? How but the problem is we're all so different. So different. How? There's no multiplayer game we could all play. You know what I mean? There's nothing we could do there. You know, the alienation comes out. You don't want to play it or something like that. Or there's the shooters. Nick doesn't wanna play this one doesn't. There's a million things where we can't get together on something. But then I was out to dinner with a friend of",
            "start": 555.96
        },
        {
            "text": "or something like that. Or there's the shooters. Nick doesn't wanna play this one doesn't. There's a million things where we can't get together on something. But then I was out to dinner with a friend of mine, Kyle Morris, an ain't leur, a good individual visiting from Kansas City, Missouri. We're talking about a real person, my friend. Hey, Abraham's good. No, we're out there eating. We're talking about everything's going on. Kyle's big into sports. We're talking about a lot of sports. When I let them go, right? I forget what what sport is about to what just kicked up. Baseball just baseball. Eurovision. Eurovision. The sport just kicked up as well. Uh, still no idea what that is. Don't tell me. I don't want to know. Don't tell no snow tell all something everybody care about it. So this weekend everyone **** cared about is on it very much. I like to wait couple situation. Thank you very much. Give me a pound on that one. There you go. But Kyle started talking about, you know, the fantasy sports. And I'm like, oh, yeah,",
            "start": 590.85
        },
        {
            "text": "about is on it very much. I like to wait couple situation. Thank you very much. Give me a pound on that one. There you go. But Kyle started talking about, you know, the fantasy sports. And I'm like, oh, yeah, Colin's big in the fantasy sports. I enjoy them, but I'm never dedicated. There's too much to do. I'm like, you know, Nick and Tim, they don't know. They don't care about fantasy sports of all. They're more into like movies and stuff. This isn't their thing. He's like, oh, well, I'm so I'm shaking so badly for Morse fantasy sports that I started doing Fantasy Movie League. And I said, what is Fantasy Movie League? Mmm. And he introduced something that'll change our lives, ladies and gentlemen. That what I'd like to do is take you to probably one of the premier journals you're currently going is a periodical in the United States. Well, People magazine. Okay. Fantasy Movie League lets you play feeder owner instead of franchise owner. Box office results just got a lot more exciting. Matthew Berry, ESPN's senior",
            "start": 634.19
        },
        {
            "text": "in the United States. Well, People magazine. Okay. Fantasy Movie League lets you play feeder owner instead of franchise owner. Box office results just got a lot more exciting. Matthew Berry, ESPN's senior fantasy sports analyst, recently launched Fantasy Movie League. Essentially, a fantasy league for films. Instead of drafting a dream team of athletes to their athletes to their rosters, players are given fake money each week to fill a theater with eight movies of their choice. Parentheses with blockbusters costing more than indie films. The goal, try to guess which movies generate the highest revenue. Think Trainwreck is going to be the next Bridesmaids? Put it in two theaters. Think Self/less will overcome the reviews and be a big hit? Put it in three. Think Minions is gonna have a smaller week? Put it in one. Quote, the game is really fun, really addictive, and doesn't take a lot of time. Barry tells People, if you love movies, it makes you love them more. If you don't love movies, it gives you a reason to care. You",
            "start": 675.98
        },
        {
            "text": "the game is really fun, really addictive, and doesn't take a lot of time. Barry tells People, if you love movies, it makes you love them more. If you don't love movies, it gives you a reason to care. You have no idea what it's like to find yourself saying things over the weekend like, come on, Minions, or trying to convince your friends to see Trainwreck instead. Man, man goes a little bit more about him. And I was fascinated about this. Uh-huh. So the idea is, and I want to be very crystal 1,000% Kinda Funny clear about this. This is not an ad for Fantasy Movie League.com. Totally natural. Came up and I like it. And I want us all to do it together. So I went there. And the idea is fascinating. You go there. You go to your you go to your front page or whatever. Once you're logged in, of course. And you every Monday at five, it resets. We have to like cats what you're gonna do, right? I don't know. It's not doing it to where you cast what you're gonna put in there. And then you have them all over there. You",
            "start": 715.55
        },
        {
            "text": "every Monday at five, it resets. We have to like cats what you're gonna do, right? I don't know. It's not doing it to where you cast what you're gonna put in there. And then you have them all over there. You get a thousand fantasy movie bucks a month or week, sorry, to take to take and then pop them in. Like I was looking at today, Neighbors, right? 11 screen of Neighbors is like 435 dollars. And so you have up to eight screens, I think it is, to fill. So you could go the route of, well, I'll get a whole bunch of little indies, put them in there. Or I think Neighbors is gonna be huge. I'll put it in two. And then it starts graying out the options as I lose my money and go there. So I want us to get into this. I feel this would be bridging the gaps of our Colin's massive love for fantasy sports, my interest in fantasy sports, but a simpler fantasy source because there's no training, no **** like that, right? I don't have a thousand dollars that Monday at five p.m. Pacific time. I",
            "start": 757.91
        },
        {
            "text": "fantasy sports, my interest in fantasy sports, but a simpler fantasy source because there's no training, no **** like that, right? I don't have a thousand dollars that Monday at five p.m. Pacific time. I have to set before nine a.m. Friday Pacific time. Oh, okay. You get a whole week to do this. You know, whole week because it's just counting that. I think it's just kind of the weekend box office. Okay. That's how it goes. So we're how do we feel? How is it striking us? Nick, does this sound exciting to use the movie guy? It sounds fun, but you I'm just go says point of point of criticism if I may. You started this off by saying we're all super busy and overworked, right? Throwing one more thing on the play. Sure. Concerns me. Does sound fun. Yeah. Can we take something else off that we have to do like this podcast every week and do that? Don't think it's gonna take you that long to book eight screens. Got your family, your miss. Sounds like it's literally gonna take 90 seconds a week. Exactly. I'm gonna be honest, you",
            "start": 795.02
        },
        {
            "text": "week and do that. Don't think it's gonna take you that long to book eight screens. Got your family, your miss. Sounds like it's literally gonna take 90 seconds a week. Exactly. I'm gonna be honest, you don't. We could play fantasy baseball and that's a full-time job doing. I'm not too nice, Tall Amita. Like you you saying all this scares me because I've seen how much time. But again, case is not that. I understand. This is not the Psychopaths layne collins family or whatever that goes up there and does the draft live and pay use for transactions. You know, oh, I lost a lot of money last year. It's just it's 15 with us. It's 15 week. We're just playing for TVs yet launched angry. Yeah, I'm not gonna take this lightly. Yes, I am gonna do this. But that's fine. Can't even get crazy like you can in real fantasy sports. Again, try me. I don't know what do. I don't know how to really respond to that. I bring Fast 7 back into. No, you got it. Don't let him because then it would make no money and you'll lose. I mean, I don't",
            "start": 833.75
        },
        {
            "text": "again, try me. I don't know what do. I don't know how to really respond to that. I bring Fast 7 back into. No, you got it. Don't let him because then it would make no money and you'll lose. I mean, I don't think she jokes on you more on it. There's not like a right in category for fantasy movie where you go, okay, I want to put this in there. Okay. All right. Let's play it. But here's the big, here's the big thing about this. Sure. Let's we have to. There need to be a significant monetary pot. Ah, now against you trying to make that money back from Offutt. No, so I won't be really clear because I play fantasy sports for a long time. You some play fantasy sports in the 90s when you have to go into plucking newspapers and use the box scores and keep them by hand and trust everyone was doing it evenly and honestly. Sit the **** kitchen table, go over box scores and news day every day for you. Like the accumulation of thousands of hours my life. Probably cut yourself, grandpa from Rugrats. Oh, yeah, absence is crazy. So,",
            "start": 873.89
        },
        {
            "text": "the **** kitchen table, go over box scores and news day every day for you. For you like the accumulation of thousands of hours my life. Probably cut yourself, grandpa from Rugrats. Oh, yeah, absence is crazy. So, I love fantasy sports. I love them forever. I love statistics in all the kinds of this say. I wish it was way more deeper. I wish you were like, I wish this was like ten times deeper than any other. But since can I read a few rules to you or do you want to get one in just one moment? I just want to say there is more depth to it. Don't no, don't touch me. So here's the, here's the thing about this. Fantasy sports, I've realized over time, only really fun if there's a lot at stake. That's why the family or the design my family uncle and his friends and I'm in that way up it probably for a few years that leaves **** dead serious because they have lots of money invested in this. And you get if you win, if you lose, you're losing whatever. It's not it's not like a huge deal. I lost like 400 dollars. Don't",
            "start": 911.12
        },
        {
            "text": "dead serious because they have lots of money invested in this. And you get if you win, if you lose, you're losing whatever. It's not it's not like a huge deal. I lost like 400 dollars. Don't like that last year. But if you win, you win thousands and thousands of dollars. And that's why every transaction costs money. That's why every trade costs money. Every sign it costs money because you just keep putting money in the pot. And then it makes you want to engage. If there's no reason for Nick to pay attention. Like for instance, if Nick puts 500 dollars in the pot and then mixes a week, he's gonna feel really bad about it. So we're gonna happen again. Well, if you just let us play for no reason, then I bet you these two guys floppies. They don't play fantasy sports. That's what I think this is enough. This is a Tim has a competitive streak in him. And I think by bringing in movies to it, something he can understand and eliminating the whole, oh, trade deadlines, this that, they all you need a wide",
            "start": 946.73
        },
        {
            "text": "this is a Tim has a competitive streak in him. And I think by bringing in movies to it, something he can understand and eliminating the whole, oh, trade deadlines, this that, they all you need a wide receiver defense kind of thing. I think this works. Tim, how do you feel? I I agree with you. I only hesitate. I feel when they saying about the the time stuff. As far as I'm concerned, this whole thing is a fantasy sport. But I just happened to be playing a little Kinda Funny Live. They live. Sure. So it's like, you know, I'm already doing that **** there already is, you know, good financial gains and gains from the the good will of the people and all this ****. So it's like, I feel like I'm already kind of wheeling and dealing in that ****. It's like wheelin dealin it show Nashville. This this movie stuff though, because I feel like this would be fun. And I feel like I would totally be not so easy. It sounds so not easy to win it. Easy to what? Let me give you so many some of some of the more nuts and bolts before we",
            "start": 981.23
        },
        {
            "text": "Cause I feel like this would be fun and I feel like I would totally be not so easy it sounds so not easy to win it easy to what let me give you so many some of some of the more nuts and bolts before we get going right so there's different you know seasons hit me with the nuts and bolts then let me hit you with my financial proposal got it may it was worth it we are doing them in here something we have to decide right now and the financial proposal still stands I say currently and I don't know if there's a limit so stick with me but what we should do is it's us five we put the money in and then it's based on our ranking with each other right but I say we open it up to them is we can just give them though okay no no not that they're into the money is us anybody can join I'm like if we're like if I'm 91st and Colin's you know 87th or whatever Colin gets its first place for the our group yeah hi so there could be that many people no idea that I don't have any information cause what's the",
            "start": 1025.94
        },
        {
            "text": "like if I'm 91st and Colin's you know 87th or whatever Colin gets its first place for the our group yeah hi so there could be that many people no idea that I don't have any information cause what's the difference with just the five of us if it's it's insular and then do we ever talk about it whereas like you know how kids like doing interact with us and do things with us the Best Friends I like them you can't just have a fantasy league I can't just have a fantasy like no yes we agree yeah exactly your attorney you are literally turning a fantasy this is actually unprecedented this is a good point you're turning a fantasy Movie League into a meet and greet I guess never which I think is actually never had this is actually a new number yes yes yes let's do on that for a bit let me run so we're doing May 2nd through August 30th okay so the Monday this breakout posts would be the first time we have to set our rosters for the upcoming weekend Captain, guys to keep that in mind and maybe if they",
            "start": 1064.67
        },
        {
            "text": "doing May 2nd through August 30th okay so the Monday this breakout posts would be the first time we have to set our rosters for the upcoming weekend Captain, guys to keep that in mind and maybe if they allow it you two out there or if you want to go start your only you can do that all right cool I've already covered you get a thousand bucks to put it in there right in most weeks there will be 15 movies available for selection however in some weeks there is there may own I'm sorry in some weeks where there may only be one release a single movie will be broken into three different showings Friday only, Saturday only, Sunday only with each available as its own selection right so that it will you know you know Captain America was going to do gazillion dollars rather than just put that in you have to choose which night to try to break it up and do something differently there so that's in there right players can feature a movie on as many screens as their budget allows which we already talked",
            "start": 1104.99
        },
        {
            "text": "to choose which night to try to break it up and do something differently there so that's in there right players can feature a movie on as many screens as their budget allows which we already talked about other but players do not have to select movies for all eight of their fantasy Cineplex screens it may strategically choose not to do so however a two-million-dollar penalty will be assessed for each unused screen and the total sum of all penalties penalties will be deducted from the players box office total at the end of combat that's interesting there you go see yeah it could be that I'm gonna put Neighbors on to that's looking really pleased with enough money for one movie but then I have five so I'm 10 million dollars out all managed to play against that that's more interesting exactly super super interesting I like that if a player does not select any movies for their Cineplex all movies from the prior week that are available in the current week will automatically be carried over the",
            "start": 1142.07
        },
        {
            "text": "super interesting I like that if a player does not select any movies for their Cineplex all movies from the prior week that are available in the current week will automatically be carried over the low so there's so there's no penalty for not play well there's a penalty for not playing but your still your last week's selection will pop is this is what I was concerned about is opening up to everyone as you can't guarantee everyone's gonna play and then this in the standings will be useless and the bigger the league gets the more useless standings will be important note that's right that's one of my major reasons why wouldn't open it up okay go on um the actual box office earnings of the movie featured on each screen is the is the players fantasy Cineplex the players fantasy Cineplex are added together to form a total score for the week that's easily the total of all weeks during season is accumulated for ranking purposes but does not carry over from one season to another I think those are",
            "start": 1178.88
        },
        {
            "text": "together to form a total score for the week that's easily the total of all weeks during season is accumulated for ranking purposes but does not carry over from one season to another I think those are the big ones so first screen you lose two million mmm right you have a blank screen million till you miss okay five screens will be 10 million all it would be 16 I like a catch so although they wouldn't let you keep all eight empty than they would fill it automatically the question I have is that the seasons are created statically like we can't make our own season because this was my proposal sure as we play for a full five-week season thousand dollars each $5,000 winner-take-all hot at the end of the year sounds like f***ing boldness to me I'm out that's how you f*** your wife your answer that thousand dollars sounds long around, can let is long, correct? Cash some of those Google checks that you have stock checks you get give us a thousand I should give me a thousand also real quick I already",
            "start": 1211.97
        },
        {
            "text": "thousand dollars sounds long around, can let is long, correct? Cash some of those Google checks that you have stock checks you get give us a thousand I should give me a thousand also real quick I already f***ed it up I was looking at the wrong thing this is that was 2015, 2016, 2016, 2017 May 23rd to August 14th week that's that's one we're jumping on let's do it big money big money how much money we putting in dude I'll show up at a thousand dollars them that seems that seems like a lot of money how much would use I'm not putting you that I'd rather put into this um it's not though okay again there's not that much work I mean like you click and they start growing out the options I'm just gonna throw out before we decide to do this yeah a counterproposal we take Friday as a half day and go see one of these movies together sure that way we get to have fun and not stress ourselves out with winning or losing by just throwing it out there I like a loss of a thousand dollars me just a",
            "start": 1256.28
        },
        {
            "text": "go see one of these movies together sure that way we get to have fun and not stress ourselves out with winning or losing by just throwing it out there I like a loss of a thousand dollars me just a little bit add to my stress level overall you think I'm bad now you could win four thousand dollars I could work I'll be on you is gambling big every night I'll think about that you're really good at movies like you would know what's gonna go two walks on four students how The Jungle Book was gonna bomb it's like the best movie that's come out in like 10 years and this is why the games fun hold its stress and someone else what I would have lost that too it is stressful that's what thanks a lot whatever if they seemed to not want to do it Greg so what no not for a period oh I knew it I'll give it a shot you'll see how long it allows right without anything on the line 100 bucks sure elbow no here's my thing hundred dollars and we have to take all the money that we have cumulative in the pot roll",
            "start": 1298.72
        },
        {
            "text": "it up into a little ball and put it on in one of those little like old whiskey things that they used to put around St. Bernard's nice and put it on Portillo's next we have to carry around them anywhere he goes you just be dragging the bear yeah well the barrel just like a faux barrel okay roll it up into a wide she's a little my labile it has to ride on his neck but we'll paint it like a barrel okay Kevin are you in 600 bucks go 500 700 hours coming what what that's one more Google sake goodbye this isn't gambling cause you think about it this way no gambling is a game of chance this is a game of skill sure just look at the newspaper I don't read Variety they'll tell you who's gonna win when I go to Vegas I don't really gamble that much I play like very low low stakes poker something like",
            "start": 1347.05
        },
        {
            "text": "of skill sure just look at the newspaper I don't read Variety they'll tell you who's gonna win when I go to Vegas I don't really gamble that much I play like very low low stakes poker something like that I don't so I'm not a gambler but when it comes last on this Vegas but $5 yeah dude when I used to go to Mohegan Sun or something I was in college I got there even I was like I f***ing won you know so so I'm not a big gambler but when it comes to sports and fantasy sports look like that's like fantasy sports sucks if there's like not big things on the line that's why when these guys play fantasy baseball a lot of them have a lot of money on the line because it's yeah dollars is like all right that's a very low end it's very low and a little out of my like my comfort level I might so the question becomes what do you wanna do add the kids the Best Friends Wow they all put a hundred dollars in know again it's not know they don't come for money so it's a big barrel for futility",
            "start": 1390.37
        },
        {
            "text": "so the question becomes what do you wanna do add the kids the Best Friends Wow they all put a hundred dollars in know again it's not know they don't come for money so it's a big barrel for futility concerned about I'm concerned about fantasy fatigue I mean that's a real thing and people don't stick around with fantasy leagues if there's nothing on the line and I can't trust that this group of people will be able to what's your minimum number that you want us to put it all right now how about money Maurice I want the kids no give me the kids I'm sorry yeah I think me with us because the thing about it though is like when you're doing on you about fantasy football in someone f*** up and just stops doing it right that does what happened to my leagues I know but think about I'm on it like that would be a problem because okay well you have the best QB but now it's just sitting yeah probably for other people that need you to win or lose games to it then f*** other people and that's not",
            "start": 1428.08
        },
        {
            "text": "would be a problem because okay well you have the best QB but now it's just sitting yeah probably for other people that need you to win or lose games to it then f*** other people and that's not cool that's why that's why there is a financial incentive in the leagues I and especially in the big football league I play and that does not happen right but I'm saying this is all independent event if you just let your thing roll over roll over yours can keep rolling over till your movies are out of the theater so yours gonna come along yeah but then the things have fun you know like yeah it's not fun for the bottom twenty percent or whatever that's no longer doing it down I don't at doesn't matter and what you wanna do I'm not a try I'm yeah here's my thing though on my list of priorities it's a long list yeah real low real low yeah but I'm down to do it just to f***ing see okay you're missing my point I'm saying about letting kids into it no audience into I always down I like that okay I'm",
            "start": 1474.97
        },
        {
            "text": "a long list yeah real low real low yeah but I'm down to do it just to f***ing see okay you're missing my point I'm saying about letting kids into it no audience into I always down I like that okay I'm gonna be I'm any clearer who you have a shorter list of priorities and this isn't one of them at all but I'm still going to play this is something you do why you poop Monday morning it's that simple tell people I really I took to be fair knowing fantasy for solitude it's literally sound like maybe one minute a week it's a nice example looking at game on tap unless you want really go into it but but you don't know how long it takes for me to pick picks like I will obsess about this for an entire day you will lose a day of work from me alright want you to know that we were at Goodwill today buying stuff for Kinda Funny Live and my f***ing Nick is the whole I just don't understand what goes through your head when it comes to buying a prop that will be seen for one second has been very",
            "start": 1510.94
        },
        {
            "text": "buying stuff for Kinda Funny Live and my f***ing Nick is the whole I just don't understand what goes through your head when it comes to buying a prop that will be seen for one second has been very prudent and I like to go threw away all the options I three people on the body Nick here do you appreciate that you have a thousand dollars you eight screens right there those are the 15 you can pick from build you build the right there you got Neighbors you got The Angry Birds Okay, see I mean here's the deal I got to go through watch all these trailers I gotta see what they spend for the marketing budget I gotta see what the who the actors are I would say The Nice Guys it's probably gonna do very well do you guys know The Nice Guys about it's the Gosling right it's Ryan Gosling but also Shane Black it's not gonna do what I wanted to do well but that's not how you play this game what the f*** is The Money Monster that's exactly why would you be so right there you know to put Neighbors in",
            "start": 1551.03
        },
        {
            "text": "Black it's not gonna do what I wanted to do well but that's not how you play this game what the f*** is The Money Monster that's exactly why would you be so right there you know to put Neighbors in there put Angry Birds in there put Civil War in there when you probably are over money already you just happen yeah but I'll just came honestly not dead once I don't know if it's optimized okay there you go Angry Birds is going into theaters there you go see in that day or are you what happened I died no that's how much ever you have a thousand dollars those movies cost like 400 each so now you can't get any day a big budget ones you gotta go down there and get the next one this is horseshit Fantasy Wall Street Movie League FantasyMovieLeague.com I will say from an entrepreneur standpoint of view this is a brilliant idea yeah because this gets fantasy sports are great when sports isn't fantasy sports I began a bigger justing but people aren't interested in sports but they'd be",
            "start": 1586.46
        },
        {
            "text": "point of view this is a brilliant idea yeah because this gets fantasy sports are great when sports isn't fantasy sports I began a bigger justing but people aren't interested in sports but they'd be interested in the system right that's so I think this is a way to this is completely ridiculous I can't add Angry Birds and Neighbors know theater on the planet is not going to have both of those no but you have a thousand not Nick it's a game you're not not a sim game is a problem it's a survival horror game if you're limited on ammo you just have to choose the right but Huntsman commentators so go if you want to play with us the FantasyLeague.com it's the Kinda Funny I need onions back you understand how it works now even though you hate it apparently because you can't build the exact thing you want we're the Kinda Funny Movie League our password is Best Friends on one word all lower case so there you go being come play with us we agree the 50 degree $100 yes for $500 dollar pot sure",
            "start": 1627.83
        },
        {
            "text": "you want we're the Kinda Funny Movie League our password is Best Friends on one word all lower case so there you go being come play with us we agree the 50 degree $100 yes for $500 dollar pot sure yeah everybody hands very low very low stakes me very very low today we're gonna do a woah Al Bundy on three one two three he's from me over children who is it I don't know when he was white football or something ya wanna clear that I think people jump on Kyle's you didn't know what a mana but I pretended I did the well Al Bundy hmm I'm all most f***ing interestingly enough Nick yeah this one fantasy football or FantasyMovieLeague.com was brought to you by GameFly this but this topic of course was brought to you by GameFly are you ready to save money and play more games or watch more movies and let me introduce you to our sponsor GameFly GameFly is the best way to buy and rent all your favorite games just go to GameFly.com pick your favorite games and have them mail directly to your door they have",
            "start": 1665.32
        },
        {
            "text": "you to our sponsor GameFly GameFly is the best way to buy and rent all your favorite games just go to GameFly.com pick your favorite games and have them mail directly to your door they have more than nine thousand titles to choose from and you can try before you buy go to GameFly.com/KindaFunny and start your free premium 30 day trial today the premium trial allows you to have two good games and or movies checked out at a time you can only get this offer by visiting GameFly.com/KindaFunny",
            "start": 1711.94
        }
    ]
}