{
  "id": 1718,
  "video_id": "YKDf_OhPfWc",
  "show_name": "Reactions",
  "hosts": ["Greg Miller", "Tim Gettys"],
  "title": "Unboxing Uncharted 4's Ultimate Collector's Edition - Kinda Funny Reacts",
  "description": "Greg and Tim have Uncharted 4: A Thief's End Libertalia Edition. Wanna see what's in it? NO SPOILERS!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
  "published_at": 1462398593,
  "duration": 478,
  "transcript_chunks": [
    {
      "text": "What's up, guys? I'm Tim Gettys. This is GameOverGreggy himself, Greg Miller. Hi, Greg. Yep, we got the Libertalia Collector's Edition of Uncharted 4. We sure did. Do you think it has tickets to Libertalia? Are you taking me to Libertalia? Take me to Libertalia, Greg. You're take it is, of course, Uncharted 4: A Thief's End, available next week, but our review is up tonight on youtube.com/KindaFunnyGames. And if it's not May 4th and it's already up, I wonder Miller liked Uncharted 4. I know, right? Big. I'm more excited to see if Tim liked it. Those liked it. So now what we got in the Libertalia Edition. Appreciate that. The vuu Zella. Oh my God. What you got in this collection, Kev? Okay, is Uncharted 4: A Thief's End, of course, on PlayStation 4, the Collector's Steelbook, a 12-inch premium Drake statue, 48-page hardcover art book, mini art book, Naughty Dog sticker set, multiplayer bonuses. Open here. Open here. I'm doing it, Greg. I'm going in. Should we like, should we, should we show them the open? Open it now. Hold, hold on.",
      "start": 0.08
    },
    {
      "text": "art book, mini art book, Naughty Dog sticker set, multiplayer bonuses. Open here. Open here. I'm doing it, Greg. I'm going in. Should we like, should we, should we show them the open? Open it now. Hold, hold on. Hold on. Hold on. Open it. Do the music. El Goddamn Dorado. Cool. All right, we in. We in. There's the steel bookcase. Could stop a bullet. All your favorite characters on it. Kevin, give me a rack zoom. Rack zoom. Kevin, there you go. You got this guy's Nathan Drake. That's Sam Drake. That's Rafe. Elena, who should be bigger and probably be just the entire thing. Yeah, Nadine, Sully, and a whole bunch of guys you're going to kill. Yeah, I like Rafe's hair, by the way. Big fan of Rafe's hair. Yeah, Rafe does have good hair, but he's he's got trendy hair like you. I like it. He's like he's got he's he's like a clean-shaven you or or a clean-shaven, uh, Darren Brazil. Oh, so now here we got a whole bunch of here are the Naughty Dog stickers we were promised. Oh, man, on the thing. All right, now, of course, yeah, you having trouble there. I",
      "start": 51.6
    },
    {
      "text": "a clean-shaven, uh, Darren Brazil. Oh, so now here we got a whole bunch of here are the Naughty Dog stickers we were promised. Oh, man, on the thing. All right, now, of course, yeah, you having trouble there. I don't want to I don't want to name the stickers, you know. Yeah, so we have the Naughty Dog stickers as you expect. You put these on whatever you want, your skateboard, your Vans, yeah, your cool, your your Tech Deck, maybe a little bit, your glasses. You could wear them as eyebrows. Grandma doesn't have eyebrows after the fire. Put these on. She's angry. She's sad. So we got some more stickers. These are of the Pirates, pirate sigils, pirate sigils, right, that you'll after you play A Thief's End will be very, you'll probably be familiar with them. Now, having said that, Greg, there's a couple that I I am not familiar with, but I'm happy are here. So we have Henry Avery, of course. We have Thomas England, Richard W, Christopher Condent, Tariq bin Malik. Sure. I appreciate the rhyme there. I'm getting somewhere here. This is I",
      "start": 102.12
    },
    {
      "text": "but I'm happy are here. So we have Henry Avery, of course. We have Thomas England, Richard W, Christopher Condent, Tariq bin Malik. Sure. I appreciate the rhyme there. I'm getting somewhere here. This is I say where we going with. We got William Myers. We got Joseph Farrell. That's the devil Fel, not Farrell. Sure. We got Anne Bonny. We got Yazid al-Basar, Adam Baldridge, and Guy Wood. Oh, you just like Guy Wood. You're telling me that Guy Wood is a pirate? Nah, he was a low-level pirate. Since that booty, since you didn't pick up on that, I guess during the thing. I didn't need. I I recognize all the sigils from Uncharted: A Thief's End, but I know, uh, here's our Redemption card. We're getting Madagascar sidekick outfits, Henry Avery's sigil baseball cap, 300 Uncharted Points, Uncharted: Drake's Fortune outfit, Heist Drake, Desert Drake outfits, golden weapon skins, and a desert weapon skin. So it's Uncharted 1, yeah. Uncharted 2's intro, right? And then there's Uncharted 3's desert main out, the main one you remember. I'm taking",
      "start": 143.24
    },
    {
      "text": "Drake outfits, golden weapon skins, and a desert weapon skin. So it's Uncharted 1, yeah. Uncharted 2's intro, right? And then there's Uncharted 3's desert main out, the main one you remember. I'm taking that one because I'm going to be playing multiplayer Friday after release here, twitch.tv/KindaFunnyGames. I know this is in Twitch, but you understand what I'm doing. I'm still a fan of this art book. Drake on the cover. He might be the main character. That's weird. Open and not the singing Drake. Yeah, that'd be even weirder. Aubrey Drake. Did they see anything? Oh, is it? I wouldn't I wouldn't look at this till after you played the game. How come? Let me see. Let me see. Well, the first thing I I kicked open to was this. And like, you could kind of predict that was going to happen, but you didn't know that was going to happen. This person you wouldn't know a while. Yeah, you know, know. Okay, see, it'll spoil. Yeah, do this. Don't open this book until you beat in this game. Even P. Even P. What the hell? Why would they do that?",
      "start": 193.76
    },
    {
      "text": "to happen. This person you wouldn't know a while. Yeah, you know, know. Okay, see, it'll spoil. Yeah, do this. Don't open this book until you beat in this game. Even P. Even P. What the hell? Why would they do that? 'Cause why wouldn't they do that? But holy, can you imagine how pissed you'd be? You get it. You're all excited. You open it up and that's what you see. No, don't do it. Don't open it. All right, be. Now here we go. Now hold on, 'cause they said they said I know I saw it on the box, but I didn't. 12-inch premium Drake statue. Now before I touch it, oh my God, before I touch Drake, I want I'm I I always have that concern. Is it really a premium statue? You know what I mean? 'Cause a lot of collector positions come with those wobbly. Me and you, Greg, we've been known to break a couple premium statues in our unboxing days. Once or twice. There was that Batman glove thing we did that one time. There was the okay, okay. Oh, and The Walking Dead thing we did that. We broke that. What did we what we broke season five of Walking Dead? We stuff.",
      "start": 236.48
    },
    {
      "text": "there was that Batman glove thing we did that one time. There was the okay, okay. Oh, and The Walking Dead thing we did that. We broke that. What did we what we broke season five of Walking Dead? We stuff. All right, so premium. It's better than the DC Universe Online statue in terms of quality, but feel it. It's it's still that like plastic. It's not like I always want like a I want like a real I thought it was going to be a lot beefier than this. Yeah, exactly, exactly. It looks good. It ain't beefy. It does look good though. It'll definitely be on the C the set of GameOverGreggy. No, that's not the one. Gamescast. I literally picked the show wouldn't be on. That's not a real plant. I mean, it's you can move it and stuff, but it's not real. You think it's one of those like ice plants that you can kind of break and they have all little weird water inside? Do you mean aloe? No, aloe, aloe. Yeah, maybe is all those aloe, aloe vera also like that. But I think it's talk about the ice plant, crabgrass. I don't know what you're",
      "start": 277.32
    },
    {
      "text": "they have all little weird water inside. Do you mean aloe? No, aloe, aloe. Yeah, maybe is all those aloe, aloe vera also like that. But I think it's talk about the ice plant, crabgrass. I don't know what you're talking about. I'm gonna go with crabgrass. Oh, okay, okay, okay. Now here's an interesting non sequitur for everybody. I got my laundry picked up today. Yeah, right. I get my laundry picked up. This organization does it great, folks. Really good. If you ever if you need a place to pick up your laundry and do your laundry in San Francisco. But the the doorbell rings. I buzz it. The guy doesn't immediately come upstairs. I'm like, oh, new guy. Guy finally comes upstairs. Spiked up hair. Looks good. Cool aviator sunglasses. Classic. Um, a a shirt similar to a Drake shirt. Now this is why I'm going to get there. You know what I mean? Like a a V-neck thing, but it's a bright color. Then he's got the holsters, the gun holsters on his side. No guns in them. What? And then he's got really short shorts on. What? And I said, you are the most",
      "start": 320.52
    },
    {
      "text": "mean like a a V-neck thing, but it's a bright color. Then he's got the holsters, the gun holsters on his side. No guns in them. What? And then he's got really short shorts on. What? And I said, you are the most. And I was like, I almost asked him if he was cosplaying as like sexy Nathan Drake, but I didn't. Instead, I just said, you are the best dressed laundry pickup person I've ever had. And he goes, yes, this isn't my only job. And then left. I was like, I have so many questions. Like, oh my God, are you a stripper? Are you like a dancer? Real talk. I think it's the guy that works at Starbucks. No way. Do you know who I'm talking about? You just described the guy that works at Starbucks. He wears short shorts. He has the hair. We he doesn't wear holster for guns. He's worn some some some things. I'm interested in this though. I want to know what his jobs are. Well, when he comes back tomorrow, if he drops it off, I'll check it out and get some more answers for you. Ladies and gentlemen, this has been Uncharted 4: Libertalia.",
      "start": 365.4
    },
    {
      "text": "I want to know what his jobs are. Well, when he comes back tomorrow, if he drops it off, I'll check it out and get some more answers for you. Ladies and gentlemen, this has been Uncharted 4: Libertalia Edition. You're taking me to Libertalia? No, we are not taking Libertalia. Remember, we're putting up our review on youtube.com/KindaFunnyGames at 1:01 a.m. Thursday, May 5th. If it's after that, it's already up. You can go see it. It's spoiler-free. 48 minutes of us not spoiling Uncharted, but talking about Uncharted. So, you know what, Greg? Yeah, the embargo of my review, of our review, just ended right now. Oh, I see. I can tell. So you can review our review. I thought it was a really good review. I thought our review was a great conversation, really good discussion. I think there was good discussion. People are going to be excited about it. Mhm. I agree. Uh, remember that we'll also have a spoiler cast up talking about all the things we can't, you know, that we wouldn't want to spoil in it about the book. Monday. Goddamn it. Yeah, the book is",
      "start": 409.72
    },
    {
      "text": "it. Mhm. I agree. Uh, remember that we'll also have a spoiler cast up talking about all the things we can't, you know, that we wouldn't want to spoil in it about the book. Monday. Goddamn it. Yeah, the book is filled. This again, do not open the book unless you've beaten the game. Yeah, you're going to ruin it. Until then, subscribe to us, share us with your friends, and it's been our pleasure to serving.",
      "start": 448.32
    }
  ]
}
