{
    "id": 281,
    "video_id": "oufe7Yecb-I",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "This Would Prove God Is Real - The GameOverGreggy Show Ep. 22 (Pt. 1)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nNick's Harry Potter video!\nhttp://www.youtube.com/watch?v=2WhhS2maFEs\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1399273203,
    "duration": 1953,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to the Game Over Greggy show. I'm Greg Miller and this is my group of friends right here. The pride of Long Island, Colin Morardi. Hello. How are you? Oh, hello. Hello. Yes, that's how microphones work. You've been on you've been on your retirement vacation too long. #retirement vacation. What is #retirement vacation all about? Uh, I'm on vacation all week and I'm and the theme of the vacation is retirement. So, I'm pretending like I'm actually retired. So, I've been getting up I've been getting up every morning going to the diner down in the inner sunset that I really like and I'll I'll read the news with the old people sitting at the counter which is a lot of fun. Do they know you by name yet? Do you hang your hat when you come in? No. No. I'm just like, \"Hello, how are you?\" Do you do it in a disgruntled fashion though? So, like no matter what the news story is, you're disappointed with it. Yeah. Well, I'm trying to be a little angry, a little",
            "start": 1.1
        },
        {
            "text": "like, \"Hello, how are you?\" Do you do it in a disgruntled fashion though? So, like no matter what the news story is, you're disappointed with it. Yeah. Well, I'm trying to be a little angry, a little more commodinly. Do you like hard when you're reading like a story about like like a fire that saved like kids? Or you just like Yeah, you got to do that that Yeah, that that heavy side. I'm just not agreeing with anything. Are you drinking coffee or drinking the the cups of coffee? You got to do that. That's that's a staple. I don't like I don't like I know you don't, but you got to do it. You got to do it if you're going to be I'm not that committed to to retirement vacation, I guess. Okay. Otherwise, no. Just been hanging out, not doing anything. Going to San Diego in a couple days. That'll be fun. Tomorrow, right? No. Is that how days? I thought you left Thursday. No, Friday night. Friday morning. Yeah. All right. Then, of course, the producer/seducer Nick Scarpino. Hi everyone. How",
            "start": 36.8
        },
        {
            "text": "be fun. Tomorrow, right? No. Is that how days? I thought you left Thursday. No, Friday night. Friday morning. Yeah. All right. Then, of course, the producer/seducer Nick Scarpino. Hi everyone. How are you? Thanks for joining us. I'm doing well, thanks. Good to see you. Good to see you. Beard's looking good. Thanks. It's full. Yeah, it's going to get it's going in for a trimming this weekend. Wait, who trims it? I do. My sending it in. Okay. I was going to say in a Roco beard trimmer, but I got to get a haircut and I can't decide whether I should go super short on the sides, keep it long on top, and then just have the beard be big or do my normal thing where no matter what I do, it looks exactly the same. You know what I mean? I mean, it always looks awesome, though. Yeah. But like sometimes I just like I'll tell the girl like, \"Hey, I want sort of like a kind of like a Justin Timberlake, sort of like a you know Jason Sudekas from the Circa Academy Award when he showed up with a very",
            "start": 74.32
        },
        {
            "text": "I just like I'll tell the girl like, \"Hey, I want sort of like a kind of like a Justin Timberlake, sort of like a you know Jason Sudekas from the Circa Academy Award when he showed up with a very lovely and very pregnant Olivia Wild. Um they have disgustingly good relationship. I'm so jealous of all both of their success and their looks.\" Anyway, so I'm probably just going to go with something short. I'm probably just going to go short, like just a little long on top, short on the sides. That's it. That's fun. I recently saw a video of us from a couple years ago. Yeah. We were in a cameo appearance in Cheap Cool Crazy. Oh, a little hit start. Start. That was a hit show. And uh there's a clip of me and you walking out of an elevator and we both look like we are 10. Did I have the beard? I didn't have the beard, did I? You couldn't You couldn't have had the beard if you was 10. It was crazy. You were beardless. Kind of point. Yeah. Someone on Twitter pulled a uh a clip from up at noon",
            "start": 108.08
        },
        {
            "text": "didn't have the beard, did I? You couldn't You couldn't have had the beard if you was 10. It was crazy. You were beardless. Kind of point. Yeah. Someone on Twitter pulled a uh a clip from up at noon when I was in the intro for it. Yeah. I think I was talking about Game of Thrones and how it's the best game um ever. It's the only game that matters. It's the only game that matters. Thank you, Tim. Uh and I didn't have a beard. I was like, I look disgusting without a beard. My beard is so much better than I mean my non-beard. Does the wife like it? Uh she likes it. She doesn't like when it becomes unruly like it is right now. What's that where it's just creeping north? Well, it starts to go here and then you get the over the lip beard where it used to be you can kind of play with it and she doesn't like when I talk that it kind of dips in my mouth and then you get the the wings on the side here. You're starting to look where if I fluff it out a little bit. It's it's a little too long.",
            "start": 147.52
        },
        {
            "text": "doesn't like when I talk that it kind of dips in my mouth and then you get the the wings on the side here. You're starting to look where if I fluff it out a little bit. It's it's a little too long. See, that's a problem with my beard is it doesn't get full. It gets long. Yeah. And then I have to like kind of quaff it back into place. So, it's like get some of that hair gel and put it in there. So, I think I got to shave it down a little bit, but you know, we'll see what happens after this weekend. We'll see next next week what I look like. Then I was going to say beardless, but you have a beard, too. The pure one, Tim Gettys. Tim, I like your shirt today. This is new. It's very nice. Yeah. My friend was get doing an interview, so we had to buy a new shirt and I was with him and I'm like, well, I want to buy a nicer shirt than the one you're buying, so I bought this one. Yeah. That's not fair. I know. You're trying to get a job and I have so much money. Yeah. So, Maybe it gives him",
            "start": 180.56
        },
        {
            "text": "well, I want to buy a nicer shirt than the one you're buying, so I bought this one. Yeah. That's not fair. I know. You're trying to get a job and I have so much money. Yeah. So, Maybe it gives him something to look forward to. Yeah, exactly. That works. Well, ladies and gentlemen, if you didn't know, this is the Game Over Guggie show. Every week, four best friends gather around this table, each bringing a random topic of discussion to discuss with each other. If you like that, you should like the video, subscribe to us over on youtube.com/gameoverggy. But if you really like the show, you can wait every Friday. We put up the MP3 at gameovergy.bancamp.com. The full show, every topic right there for a dollar, days early. Then over on that YouTube channel I just mentioned, you get it day by day, topic by topic. Until Friday, we post the entire shebang for your approval. Greg, I'm sorry, but I'm a little distracted right now. Yeah, you should be. Your shirt's really nice. Thank you. I'm",
            "start": 214.0
        },
        {
            "text": "day, topic by topic. Until Friday, we post the entire shebang for your approval. Greg, I'm sorry, but I'm a little distracted right now. Yeah, you should be. Your shirt's really nice. Thank you. I'm not You're not the only one with a nice new shirt here, everybody. This literally is just out of the package. The new Sean Finnegan likes hiking. Gameover Guggy T. Oh god. At districtlines.com/gameovery. Oh, he's come back from he's come back from bigger hits than there. But look, it's green. It pops. I really like the logo. Another Nick Scarpino production. Good job. No, that actually was that was Mike Nos actually. I can't believe I just raised your hand. You [ __ ] [ __ ] You didn't do anything for this shirt. I put the logo together and I picked the color scheme, but Mike Nos actually was one of the one of the uh designers. Well, the designer, not one of them, was like a whole team on a whole team back behind. We cut to like the game over like a t-shirt shop of like beers and stuff",
            "start": 252.96
        },
        {
            "text": "one of the one of the uh designers. Well, the designer, not one of them, was like a whole team on a whole team back behind. We cut to like the game over like a t-shirt shop of like beers and stuff pouring smoke and all this crap. But yeah, Mike Mike is on Twitter. You can hit him up. I think it's Mike Nos. Um, and thank him for this this sign if you like it. If you hate it, let them know you hated it. And uh don't do that. Don't put out negative. If you like it, the best way to not like it is to go to districtlines.com/gameovery and buy them all. Buy them all and burn them. Yeah, that's a perfect example. If you don't like it, buy 30 of them and burn them. Just buy us out or just buy the other shirts so we see how unpopular this Sean Finnegan shirt is. That's true. We do have other shirts, right? Yes. There's a Nick Scarpino one. There is a lot of pictures of that going around Shadow Boxing Association established 199. It's interesting. I It It's the most popular shirt last month.",
            "start": 290.72
        },
        {
            "text": "right? Yes. There's a Nick Scarpino one. There is a lot of pictures of that going around Shadow Boxing Association established 199. It's interesting. I It It's the most popular shirt last month. Mhm. By a landslide. I beat out the Colin for president one. I beat out the Game Over Greggy one. I beat out Sean Finnegan. I didn't expect it. Well, you didn't. You're our golden cal. You're the one we got to I'm the one who's your suckling. Yes. All day long. God willing. Oh my god. God willing. I'll be suckling. What other shirts you got in your repertoire? What are we doing right now? I think that's it. We got one more in the background. There's one more. We got the Oreo Gasm. Oo. Okay. Okay. We got the game of Greg. A staple on the channel. I might I might add it's as classic as the Ray-B band sunglass named brothers wore game over Greggy shirts underneath their outfits. I heard that. I heard that. That's what killed John Belushi. Too tight. We're on a mission from a gad. That's what they",
            "start": 326.64
        },
        {
            "text": "sunglass named brothers wore game over Greggy shirts underneath their outfits. I heard that. I heard that. That's what killed John Belushi. Too tight. We're on a mission from a gad. That's what they said. 106 miles to Chicago. Full tank of gas. You know, in a lot of ways you remind me of Dan Akroyd and John Belalushi in one. I got I have the Dan Akroyd height. You do have height. You actually look a lot like a young like when he was like skinny and fit. No, no, no, no. I look like Dan Akroy just as he starts to turn the corner to fat Ghostbusters too. Like they all cuz they all started getting a little sucking the guts guys with the Ghostbusters. Yeah. Yeah. That horrible scene. What do you mean that horrible scene? They come triumphantly into the museum. Yeah. And it's this really bad music and then they stop there totally self-aware of the fact that they're in a movie which is like just totally against everything. No, it's not self-aware. They're in a movie. They're the Ghostbusters",
            "start": 369.12
        },
        {
            "text": "and then they stop there totally self-aware of the fact that they're in a movie which is like just totally against everything. No, it's not self-aware. They're in a movie. They're the Ghostbusters showing up at this like stuffy museum. Two people look over at him and then he's like suck of it in guys with the Ghostbusters and they all try to suck in their guts and you're it just reminds you of how young and awesome they were in the first one and how everything has to die. When I was a kid I didn't remind me of that at all. I just watched that movie. Everything must die though. That is true. That is true. That's I think there's a new book right next to Everybody Poops. Everything must die by Colin Morardi. Just a black cover and two red eyes on it. George Railroad Martin. right next to George Railroad Marty Nick kick it off this week. So this uh this question is actually was submitted to us uh as a result of our topic uh last week I believe which was if aliens were to come to Earth",
            "start": 408.32
        },
        {
            "text": "George Railroad Marty Nick kick it off this week. So this uh this question is actually was submitted to us uh as a result of our topic uh last week I believe which was if aliens were to come to Earth what would happen and I think a couple of us said well I think it was Colin said that would completely destroy religion right like it would just completely uh negate everything that was written in the Bible because there'd be another creature out there that wasn't accounted for. This question is a really interesting one though. So, we all decided, okay, that would probably make us um not believe in God. But this comes from Kenny. Kenny Belaloo. Well, you like the Jungle Book guy. My dude Kenny. Kaloo. And I'm not sure what he is on Twitter. I didn't write it down here, but he's on Twitter. Everybody search for Kenny Belaloo. What would it take? Find the Jungle Book guy. There you go. He's It's That's I don't watch Disney films. Blue is the bear, right? He's the one. The bear necessity.",
            "start": 448.32
        },
        {
            "text": "Everybody search for Kenny Belaloo. What would it take? Find the Jungle Book guy. There you go. He's It's That's I don't watch Disney films. Blue is the bear, right? He's the one. The bear necessity. That's the one. And then in the sh the cartoons, he eventually becomes a pilot. Correct. Yes. in in Tails. Oh my god. Yes. Tails. No, that's not right. Is that not him? That looks like him, right? That was blue. It cannot be him in Tails. I don't even I feel bad that I don't know this off the top of my head, but I'm I'm pretty sure it's blue. No. No. Oh, you give the topic. I'm looking for the topic is this. So, if aliens came uh and and you know, discredited religion and made you not necessarily believe in religion, what would it take to make you believe in God? So this is Wait, is this related to the aliens or just in general for people who don't believe? Because like I believe in God. We know Colin doesn't, right? What would it take to make non-believers? Like would you need to get a",
            "start": 487.2
        },
        {
            "text": "to the aliens or just in general for people who don't believe? Because like I believe in God. We know Colin doesn't, right? What would it take to make non-believers? Like would you need to get a sign? Would it have to be like a cross that just floated around behind you the entire time and was like, \"Hey, hey.\" You're like, \"That's how God sounds, huh?\" Yeah. And that's how my mom sounds. I don't know, Colin. What would it take? What would Holy [ __ ] it is blue. I totally took a shot in the dark there and I connected that the bear [ __ ] grew up from the Jungle Book and learned to fly. He was old then. You're thinking Mowgli. Mowgli is the kid. No, I'm not thinking about the kid. He was the one that grew up. Blue was always just 40 years old. Tail spin. Tailspin was awesome. So good. It was really good. What would it take to make me believe in God? Yeah. Uh I would some irrefutable proof that he does that God talking the burning bush. Yeah. Yeah, I mean like my legs getting broken.",
            "start": 529.12
        },
        {
            "text": "was really good. What would it take to make me believe in God? Yeah. Uh I would some irrefutable proof that he does that God talking the burning bush. Yeah. Yeah, I mean like my legs getting broken. There are there are things especially in, you know, even with Jesus in the New Testament where if I saw certain things that he did, I would believe, you know, now you'd have to see those with your own eyes, right? Yes. Because here's my thing. I at first thought I was like, \"Okay, I would I would just love to see someone descend from heaven and land.\" And then I'm like, \"Wait, how would I watch what up?\" Right? And they were like, \"Yo, I'm back.\" Um, but what would then I think I watching that on TV most likely and I probably I would use that as a device to disbelieve it, right? If it's TV, they're totally faking it. Like a lot of people think the Apollo moon landing was a fake and the ET Atari thing and the ET Atari dig was a fake, right? Which I still don't quite understand why everyone",
            "start": 571.52
        },
        {
            "text": "totally faking it. Like a lot of people think the Apollo moon landing was a fake and the ET Atari thing and the ET Atari dig was a fake, right? Which I still don't quite understand why everyone go through that much trouble to fake to sell their Xbox TV show. Yeah, Sam Claybornne made some compelling Anyway, go on. Well, we can talk about that later at a different time. Um, yeah, I think I would probably need something the same, right? I would I would I would need I would need to see God come down from the heavens. Yeah. I mean, here's the thing. Here's the thing that always bothered me about religion. This is the questions I started asking when I went to Catholic school and didn't engender me to the nuns very much, which was why like why is it Jesus says something along the lines of, you know, blessed are those who believe without seeing, right? He says that in the New Testament and why but why? Like what the whole like faith, right? The word faith is having faith in something that",
            "start": 616.0
        },
        {
            "text": "know, blessed are those who believe without seeing, right? He says that in the New Testament and why but why? Like what the whole like faith, right? The word faith is having faith in something that you can't see or touch or feel but you know exists or you think exists. That's faith. But that seems like that that particular issue of faith is in every major religion. Like you can't see and you can't touch, you know, but you just have to believe that it's there or whatever. And to me that's not a coincidence. That's because that there is there is nothing there. You know what I mean? Like why doesn't God like what about God makes him not want to make himself known, right? like you can just solve everything all these problems every like if especially if it was like well it was the Christian God or the Muslim God or whoever where it's like make yourself known and your your shit's obviously legit you know like and it never made any sense to me where it's like well you have to have faith you",
            "start": 655.6
        },
        {
            "text": "or the Muslim God or whoever where it's like make yourself known and your your shit's obviously legit you know like and it never made any sense to me where it's like well you have to have faith you have to have faith that something's there because God will never make himself well why not it doesn't make it doesn't make any sense and if aliens were going to invade Earth it would be brilliant for them to act as if they were God if they knew something about like seriously if they knew something about our society and are like these people are like there's a billion people on the earth that believe in Jesus Christ and if we just pretend you're Jesus then like seriously we'll get no resistance like you know like that's an interesting genius yeah like I'm throwing out a good idea for fiction here like that does you know like they're so smart they can they can travel you know galactic intergalactically or whatever and they and they arrive at Earth they obviously know about us and they can",
            "start": 698.88
        },
        {
            "text": "here like that does you know like they're so smart they can they can travel you know galactic intergalactically or whatever and they and they arrive at Earth they obviously know about us and they can study us and all those kinds of things and it would be interesting to see if they were like well I'm Jesus You know, who are you to say that he's wrong? You know, like like he does have a really Especially if he has powers levitate stuff. Uh I love how he went powers like this like like like a Sith general where like I assume that's how Jesus used his powers. Definitely water to That's where I stand. I mean an alien an alien being able to get to Earth or whatever makes means that he's so hyper advanced or you know it is so hyper advanced that that is as close to God as we will ever see you know in terms of like power. Yeah. And we've talked you can have telekinetic powers and all those kinds of things and the mind the mind gets bigger and more robust and can do more things. I mean, who",
            "start": 738.96
        },
        {
            "text": "know in terms of like power. Yeah. And we've talked you can have telekinetic powers and all those kinds of things and the mind the mind gets bigger and more robust and can do more things. I mean, who knows? See, I feel like that would still freak me out, right? I think that would still like if I saw someone come down was like, I'm Jesus. I'm like, he looks like Jesus. And he can shoot lightning out of his hands. I'd be like, dude, I'm terrified of this. Are you Jesus or are you Emperor Palpatine? Because I'm confused here. You're mixing your metaphors here a little bit. Mixing your fiction. Tim, what would it take to make you believe in God? I mean, obviously seeing something. seeing something. What? What are you seeing? I don't know. I don't know. I feel like you're you're the kind of person that that that would like like when there's a magician in front of you, you're the one that's like, \"I know. I know how that trick's done.\" So, if there was like a burning bush, you'd be like,",
            "start": 779.6
        },
        {
            "text": "person that that that would like like when there's a magician in front of you, you're the one that's like, \"I know. I know how that trick's done.\" So, if there was like a burning bush, you'd be like, \"Dude, kerosene and a lot.\" Yeah. Like a lot of the stuff I I I've often I'm very ignorant and do not know the backstory on a lot of this at all. The backstory of Jesus. Yeah. I don't know. Caught up on those back issues, the Bible, but uh you know, like so I don't know that. So when I talk to people about this stuff and a lot of things they say like oh this happened and this happened and I understand that a lot of it's like metaphorical or whatever but like I'm I'm just like what if he was just a dope ass magician like and he's he is tricking these people and like you know what if he was just a really smart dude that knew a lot of magic tricks and did the magic tricks and then everyone's like oh man and then he got his way because he's really smart and like his way was a good way or",
            "start": 815.36
        },
        {
            "text": "just a really smart dude that knew a lot of magic tricks and did the magic tricks and then everyone's like oh man and then he got his way because he's really smart and like his way was a good way or whatever got his way. That's true though. I mean, that's that's often something I think of, right? That uh how how you easily would be able to get you can commit a crime back then and get away with it because no forensics. There was no forensics if you didn't have any sort of I mean, they would probably just point the finger at someone. You can easily frame someone be easy. Yeah. Jack the Ripper. I was thinking about going back in time with a machine gun being Yeah. being the dopest [ __ ] Robin trains. I'd be a good guy, but I'd take care of bad with the machine gun. Yeah. Yeah. You'd only have a limited cartridge though, so you would have screwed. The whole thing is I would have had I would have brought a whole bunch of bullets. He's ready. Oh, so that would be your weakness. Like just",
            "start": 853.12
        },
        {
            "text": "a limited cartridge though, so you would have screwed. The whole thing is I would have had I would have brought a whole bunch of bullets. He's ready. Oh, so that would be your weakness. Like just steal his bullets. Steal those things he puts in that thing. I'd figure you out. I'd stop you. You couldn't stop me. Your answer too dumb. No, that's true. You couldn't stop me. They were like pig farmers or something. Yeah. So, I would I would have to see something that like I'd be like, you know what, that might be magic, but it might not be. I feel like that would be enough for me. And also like the moon landing thing. I mean, I'm convinced we went to the moon because enough people said we did and enough people are like, \"I saw that. That did happen.\" I'm like, \"Okay.\" So, if enough people saw it and enough people are like, \"Yeah, it's legit. That checks out.\" They'd be like, \"Okay.\" If there's only one dude that was like, \"Oh, no. I know the trick to this. He's doing all this stuff.\"",
            "start": 893.76
        },
        {
            "text": "saw it and enough people are like, \"Yeah, it's legit. That checks out.\" They'd be like, \"Okay.\" If there's only one dude that was like, \"Oh, no. I know the trick to this. He's doing all this stuff.\" They'd be like, but if there was a lot of them, then I'd be like, \"I don't believe this at all.\" Do you think that if you were to believe it, do you think it would change anything in your life the way you guys did anything? Would you stop masturbating as much? I mean, I don't know. I'd masturbate more. on one hand. Is that even Is that possible? Oh my god, I'm so tired. I'm stoked. I'm going to heaven. Yeah, I wonder like pops in. He's like that is not guaranteed by anything you are doing right now. It's a surefire way to not get yourself an invite to a party. I feel like it's on one hand be smart if you know it exists. Be like, \"Oh, I probably should be better.\" But on the other hand, if you know it exists, it's just like, \"Well, then you're going to just be cool with whatever I do and",
            "start": 927.52
        },
        {
            "text": "smart if you know it exists. Be like, \"Oh, I probably should be better.\" But on the other hand, if you know it exists, it's just like, \"Well, then you're going to just be cool with whatever I do and forgive me for things, right? That's how this works.\" See, I feel like you're really good at gaming the system. So, you'd figure out how to be like, \"Okay, how can masturbate all the time and be cool to chew Hail Marys?\" Yeah, that's how I got through college completely. It was just like, \"Okay, here's the syllabus. Here's exactly what I need to do to get an A. I'm going to do that.\" And I got a lot of A's. That's how a lot of people got through college. Things are easy. Things are great. So, that's what I'm going to do with Jesus one day, Greg. Yeah. You already believe. Yeah. But you believe in a spirit. I believe in a guiding force of some kind. I'm talking about Jesus Christ. Yeah. who I learned about in the history books. What would it take for me to believe Jesus Christ is back? He's",
            "start": 968.72
        },
        {
            "text": "in a spirit. I believe in a guiding force of some kind. I'm talking about Jesus Christ. Yeah. who I learned about in the history books. What would it take for me to believe Jesus Christ is back? He's back. I don't think it's gonna I don't think there's If Jesus comes back, there's no doubting that's Jesus. People just [ __ ] disappeared and now hell on earth is beginning. Yeah, we have to we have to be clear that the if Jesus returns, it's the rapture and fair enough. So like that is in the the New Testament and it's re and it's the book of Revelations. It's a really dumb question. On ground level, Jesus is back and I'm not gone. I'm like [ __ ] So, I've heard I've heard a lot about this this rapture business. I don't think it's ever been clarified to me. So, why where he's going to come back and [ __ ] things up? So, Jesus, he's going to come back and take all the believers, take all take all of his people with him. My mind all the good people are going away. So, like it's very it's",
            "start": 1001.28
        },
        {
            "text": "back and [ __ ] things up? So, Jesus, he's going to come back and take all the believers, take all take all of his people with him. My mind all the good people are going away. So, like it's very it's it's obviously a very Christian thing. It's a very Catholic thing like the rapture and um just like our obsession with Revelations is which Revelations is the [ __ ] best book by the way. If you like it is so [ __ ] up. The last book comes after the return of the king. Yeah, it is. Revelations is the last book in the New Testament and it's [ __ ] up. It's about the end of the world and every and it's it's beautifully written. People should like go read it. It's just it's absolutely awesome. Quoted in the movie Ghostbusters, but uh well so so the rapture is is basically Yeah. God coming back. God will come again and he takes everyone but it's like that all the believers. And so like my mom used to tell me stories, you know, that her parents probably told her or whatever. Theoretically,",
            "start": 1039.2
        },
        {
            "text": "God will come again and he takes everyone but it's like that all the believers. And so like my mom used to tell me stories, you know, that her parents probably told her or whatever. Theoretically, like one day Jesus comes back and you're flying the air and you're in an airplane and the pilot's gone like that and and half the people on the plane are gone and the plane just crashes. Well, that's the book left that's the first book of Left Behind. What what Left Behind? Left Behind the incredibly popular book series about the the It's a fiction series. Okay. That's probably where she Yes. Kurt Cameron did the Made for TV movies. But yeah. Oh, this is newer. Yeah. Yeah. Yeah. It's uh No. No. But the books are old. The books are old. Oh, the books are old, though. Books are from early 2000s. Oh, no. No. She was talking about this way before. Somebody straight up Jack. This is probably So, no. Yeah, this is like in the 80s. I I used to be obsessed with Revelations. Like my mom I was so",
            "start": 1075.68
        },
        {
            "text": "Oh, no. No. She was talking about this way before. Somebody straight up Jack. This is probably So, no. Yeah, this is like in the 80s. I I used to be obsessed with Revelations. Like my mom I was so obsessed with Revelations and the Stations of the Cross. Oh, Stations of the Cross. That u my mom when I was like really young brought me in to talk to the priest like one day. It was just me and him. And he would he brought me around to each of the stations. I love to have heard that conversation. And I I was It's fascinating. The stations across are all [ __ ] up, too. But you walk in and there's just a Roman numeral and Jesus is getting like, you know, [ __ ] nailed to a cross over like what in the [ __ ] is going on here? Um, and why do we have this on every church? Uh, got to remind everybody got to guilt everybody to come back. So yeah, rapture happens and then everyone, you know, is it's hell like like so. Okay, so that's that creates hell cuz they took all the good people. So it's",
            "start": 1115.12
        },
        {
            "text": "got to guilt everybody to come back. So yeah, rapture happens and then everyone, you know, is it's hell like like so. Okay, so that's that creates hell cuz they took all the good people. So it's just left with a bunch of [ __ ] Well, so I think it's got a timeline on it though. It's got it's hell on earth for a while and demons and devils. It's what this is the end was dealing with. Yeah, I was about to say this sounds familiar. Yeah. And so it's all that happening. I forget what the timeline is. I can still look it up on how long that lasts, but that's the idea. Yeah. Is that like longer than a year? Yeah. Okay. I couldn't do that. But it's not a good year. You don't want to be down there. And that's what the whole Left Behind series is, is like that happens and then it's living in the aftermath of it as it starts. And the guy who's like the Antichrist, that's obviously the big bad dude on Earth. He's spoilers for the left behind. Oh, I I want a lot. No, I want to read it. Don't I'm",
            "start": 1148.88
        },
        {
            "text": "of it as it starts. And the guy who's like the Antichrist, that's obviously the big bad dude on Earth. He's spoilers for the left behind. Oh, I I want a lot. No, I want to read it. Don't I'm going to read it. I'm going to read it. That sounds really cool. It was It was a cool idea. Then they made a really bad movie with Kurt Cameron like you were talking about. I like so I mean so to me like that's all it's just it comes Nick it comes back to this for me there's something when all right when you go to like the molecular level of like Judeo-Christianity right like there's just everything doesn't make any sense like nothing makes sense and and I can't you know over time in my 29 years like I like I said before I have a huge respect for religious people I have a huge respect for my the Christian faith I consider myself culturally Catholic and my family is very religious um well not everyone but like my you know my dad especially is like very religious man. And uh but like I get into we",
            "start": 1182.56
        },
        {
            "text": "faith I consider myself culturally Catholic and my family is very religious um well not everyone but like my you know my dad especially is like very religious man. And uh but like I get into we and we agreed 15 years ago to never talk about religion again. You know, you shake hands on it, walk away. But like cuz you get to the molecular level of you know a science and you understand it like right chemistry and you get to the you know to the molecular level of the atoms and quarks and all this kind of stuff like but when you get to the molecular level of something humanity like religion everything starts to fall apart. Nothing makes any sense you know like and and to me I can't I can never run away from that. Even as a little kid, I could never like convince myself that. It felt to me like I was lying to myself. And I I always felt like that was kind of weird. And I didn't want to diminish people's religion. And I don't. If you're if you have faith out there and you believe, more power",
            "start": 1219.76
        },
        {
            "text": "I was lying to myself. And I I always felt like that was kind of weird. And I didn't want to diminish people's religion. And I don't. If you're if you have faith out there and you believe, more power to you. But to me, it's like how like Jesus comes back to earth, right, in in in around the turn of, you know, BC to to AD. He dies in 32 AD or whatever. Um he is the son of God, but God is one in the trinity. So Jesus is God and the son of God and the spirit of God all at once. He comes back to earth. Why? Then like they they they draw this whole thing out where he has to be not only die but has to be crucified by the Romans. Why? Like why why is it so hard? Just bring everyone to salvation. Like if you're like why does that have to be a game? You know what I mean? That's like why I don't think God exists because it doesn't make [ __ ] sense, you know? Yeah. I mean in that sense, right? Like they I mean he gives his life and everything to put you in debt, right? to indebt to indebt your",
            "start": 1258.08
        },
        {
            "text": "God exists because it doesn't make [ __ ] sense, you know? Yeah. I mean in that sense, right? Like they I mean he gives his life and everything to put you in debt, right? to indebt to indebt your followers or you to indebt the human race. How many Twitter followers would Jesus have? Oh, so more than Ellen. More than Ellen. His selfie would go bigger. I mean, right, that's the idea, right? He gave his life for you and but his death opened the gates of heaven so everyone can go or whatever. Like, that's the thing. That's why on top of original sin, right, you're also carrying this guilt that this guy died for you. It just doesn't it just we I know, but it doesn't make any like like just in a philosophical way. why just cut to the chase if like why are you letting all these bad people live for thousands of years just [ __ ] have the rapture now you know kill them be done with them and then it's like free will and all this stuff but if you're a Calvinist you don't really believe in free",
            "start": 1303.36
        },
        {
            "text": "for thousands of years just [ __ ] have the rapture now you know kill them be done with them and then it's like free will and all this stuff but if you're a Calvinist you don't really believe in free will but if you know and then like it just gets into this granular level where like now none of them disagree the Jewish people you know the Jewish faith believes Jesus existed and was a holy man but he's not the Messiah yeah he's not the son of God you know so then like it splits up that way then it's like Jesus is a holy man in the Muslim faith But he's not the Messiah. You know what I mean? It's it's like I don't know. It just doesn't make any sense. If I'm reading this graph right, it's the second coming and then a millennium and then last judgment. How long is the millennium? Thousand years. Do a thousand years. Yeah. The willennium is much shorter. Hasn't the millennium come and gone? Yes, it has. Circa what? Men in Black 2. Yeah, something like that. Okay. when I was when I was",
            "start": 1343.2
        },
        {
            "text": "years. Do a thousand years. Yeah. The willennium is much shorter. Hasn't the millennium come and gone? Yes, it has. Circa what? Men in Black 2. Yeah, something like that. Okay. when I was when I was young um you know and there's Santa Claus and Easter Bunny and Tooth Fairy and all that stuff like I remember fairly young realizing that these are madeup things and when I was younger and dumber than I am now slightly hard to believe. Yeah, I know. It's crazy. Especially with what I'm about to say. Um I always used to I I thought that that Jesus was part of that crew. Yeah. I also thought that Michael Jackson was No way. Swear to God. How was that possible? when I was young. King of Pop. When I was young. Well, so cuz here's the thing. So, I grew up with um like very close to this one one family and they Now we have our next shirt. We had Santa Claus. Santa Claus and Easter Bunny and Jesus and Michael Jackson. So, it' be Christmas like um my my close friend's Peruvian. And when it'd be",
            "start": 1380.64
        },
        {
            "text": "and they Now we have our next shirt. We had Santa Claus. Santa Claus and Easter Bunny and Jesus and Michael Jackson. So, it' be Christmas like um my my close friend's Peruvian. And when it'd be Christmas time, we'd go to his house and like we'd be talking about Santa Claus and he's talking about this little little rat that would come like they had I I want to say his name's Pepe, but it's probably not Pepe. cafe would come racist and this little rat that would bring presents and I'm like that's [ __ ] stupid and then then I like he was like your shit's [ __ ] stupid. I'm like I guess you're right. My [ __ ] is stupid. And then that was kind of the source of realizing that wasn't true. And then there's all these other things, right? And I thought that religion was one of those things, right? Like later I realized that oh you know it's it's not. But um then Michael Jackson, I thought he was a madeup I thought it was a madeup thing because I would see Michael Jackson and he was a black",
            "start": 1428.16
        },
        {
            "text": "Like later I realized that oh you know it's it's not. But um then Michael Jackson, I thought he was a madeup I thought it was a madeup thing because I would see Michael Jackson and he was a black man and then all of a sudden I saw him and he was a white woman. And it confused me because I hear him sing. He sounded like a woman. He looked like a woman. I was like five and he was singing the Free Willie song and I was like, I don't get this song. And yeah, that classic. So the thing I see the thing about it is that's the thing that's so hard to wrap your head around when you know Colin and I talk about all the time, right? That you know, raise Catholic or whatever. We go to these Catholic schools or whatever. And then when people are so quick right now to tear apart Scientology or any other religion or but mainly Scientology these days, right? Book of Mormon, something like that. And you sit there and you're like, \"Yeah, that is silly. Aliens coming down.\" And then you start and when",
            "start": 1465.76
        },
        {
            "text": "religion or but mainly Scientology these days, right? Book of Mormon, something like that. And you sit there and you're like, \"Yeah, that is silly. Aliens coming down.\" And then you start and when you actually turn it around and look objectively at the Christian faith or the Catholic faith, huh, I guess there's some flaws in that one, too. You know what I mean? Like it just bo This is what bothers me the most, right? Like we Cath Catholicism specifically Rome, right? Like has evolved many times o over the years, right? And like some people in the comments of last week's video about aliens were like, \"Well, religion doesn't necessarily or Christianity doesn't necessarily disappear because of, you know, aliens showing up.\" I'm like, \"No, it does. It does because we have to draw the line somewhere, you know, because the line the line, you know, during, you know, during Galileo and and, you know, um, you know, the the the Renaissance scientists that, you know, the Enlightenment scientists",
            "start": 1505.36
        },
        {
            "text": "you know, because the line the line, you know, during, you know, during Galileo and and, you know, um, you know, the the the Renaissance scientists that, you know, the Enlightenment scientists that were like, \"No, the Earth's not at the center of the of, you know, of the universe. It doesn't make any sense.\" But the Bible says that it is, you know, the Bible also says the Earth was created before the sun, which makes no sense because there can't be a planet around with no star holding it into a gravity well, right? So like there's all these things and they're like, \"No, no, that's just a that, you know, that's just metaphor.\" Yeah, it's just a metaphor. It's just a metaphor. It's just a metaphor. It's just a met like over and over again. It's like, well then what in this book is real, you know, because even the part where you hate gay people and can't masturbate, right? Exactly. That's the real stuff. Not the part where you can stone your wife or any of the other stuff. Yeah. It's",
            "start": 1546.8
        },
        {
            "text": "you know, because even the part where you hate gay people and can't masturbate, right? Exactly. That's the real stuff. Not the part where you can stone your wife or any of the other stuff. Yeah. It's like it's like adul it's like divor divorce and adultery is like is totally totally illegal in the Bible, you know, in the Old Testament. No, not anymore. You know, like slavery even like it's like, you know, there was people that justified slavery with the Bible, but no, that was, you know, now, yeah, homosexuality is probably the new battle, but it's like eventually you have to draw the line and be like, listen, there's more wrong in this book than we've ever really examined before. Maybe we have to look at it as a great manual to which to in which to live your life written by people that didn't even agree with each other. Even the even, you know, even the gospels [ __ ] contradict each other, you know, and they're all supposed to be together. It's not like they were like all, you know,",
            "start": 1579.36
        },
        {
            "text": "even agree with each other. Even the even, you know, even the gospels [ __ ] contradict each other, you know, and they're all supposed to be together. It's not like they were like all, you know, like all the these, you know, these four guys specifically that wrote the four, you know, the four gospels or whatever like weren't together. They were [ __ ] together, you know, and then but obviously they were invited people afterwards, but they don't even agree with each other. Some of them all tell the same story, different ways and different ways. And someone will tell this story and someone will tell this story that seem to have happened at the same time, and it's like, come on, guys. Yeah. You know? Yeah. And so that's like where I'm coming from. It's like I believe I like religion and I like faith, but I also feel like it holds us back to understanding like the true nature of humanity, the true luck of us being here. Sure. And that maybe we shouldn't take our lives for granted because",
            "start": 1614.88
        },
        {
            "text": "faith, but I also feel like it holds us back to understanding like the true nature of humanity, the true luck of us being here. Sure. And that maybe we shouldn't take our lives for granted because we're like, well, we'll be in a better place one day. Maybe we won't be. Maybe we only have our 80 years of existence. Well, that's the whole thing, too, of like when people talk about the the book being a metaphor, right? and the fact that the kingdom of God and the kingdom of heaven is earth. You know, heaven is on earth. And so, you're supposed to be living a just life now to enjoy the fruits of all this, right? You know, how blessed we are to live and do all these things, but that gets lost and gets mistransated or whatever. Maybe it doesn't get mistransated. People interpret how they feel. But, but yeah, I I agree. You know, it's just like when I think about like the heliocentric theory or like like versus a geocentric theory and like how they were like going to [ __ ] kill people over",
            "start": 1646.88
        },
        {
            "text": "But, but yeah, I I agree. You know, it's just like when I think about like the heliocentric theory or like like versus a geocentric theory and like how they were like going to [ __ ] kill people over this and they were like going crazy and they're like, \"Ah, forget it. You're right.\" you know, or like how like, you know, Lu Martin Luther was the one that went to Rome and was like, \"What are you doing?\" Like, \"You have all this money and all this gold. This is wrong.\" You know, nailed his, you know, thesis to the to the, you know, the church door and started basically started Protestantism. You know, it's like there already were these disagreements and everyone's just like kind of sweeping under the rug being like, \"Well, everything's kind of still the same.\" But it's not because like over and over again like you check things off just like you know it insinuates the seven days of Genesis and then the seven days are metaphors but then maybe they're not and then maybe it's like but then",
            "start": 1681.92
        },
        {
            "text": "and over again like you check things off just like you know it insinuates the seven days of Genesis and then the seven days are metaphors but then maybe they're not and then maybe it's like but then things are made out of order and it doesn't make any sense. Woman comes from man's rib. No, no, no, no. Doesn't make any sense. Yeah, we we got we got a little bit of a long lineage of proof against that one. You know what I mean? Like we know where women come from. Where do they come from? Babies. I was going to say the kitchen, but Oh my god. Snake. Wow. I'm joking. But who built the kitchen? God. Yes. God. Now, you want to mark that one, Greg? Are we taking that one out? No, it's so I don't know. To me, it's like there's just all these there's all these philosophical issues like and and and I can't be intellectually honest with myself and think that this is real, you know, like like I said, God bless you and more power to you and I respect religion and I will always stand up for the",
            "start": 1715.6
        },
        {
            "text": "and I can't be intellectually honest with myself and think that this is real, you know, like like I said, God bless you and more power to you and I respect religion and I will always stand up for the Catholic faith as a culturally Catholic person. I'm Italian and Irish and it's very Catholic. But um yeah, it's just I so proof I need to see and seeing is believing, but the New Testament says that you, you know, blessed are those who believed and did not see. Yeah. Well, that's the brilliance of all the religions that put that in there is that it's a fail safe, right? Yeah. You can't sit there and be like, well, I need to see something. Well, no. The faith is it's based on you not seeing like that makes sense. Wait, so then if you saw it, then it doesn't exist. No, you were chosen one. You saw the toast that had Maria burned into it. It's But think about it this way. Like Tim makes a good a good point. Like think about Lazarus, right? Like people saw him coming out of the grave. So",
            "start": 1759.6
        },
        {
            "text": "You saw the toast that had Maria burned into it. It's But think about it this way. Like Tim makes a good a good point. Like think about Lazarus, right? Like people saw him coming out of the grave. So everyone there that knew and then the people they told and maybe just for a few generations were like that was [ __ ] up. Like that dude was dead, you know? And like he like came out of the grave and he was alive. Or when Jesus casts the net into the waters and pulls it back and there's, you know, all the fish and the turning water into like Yeah. Exactly. It's like Jesus, you know? So like those are the kinds of things that people did see that like apparently did see that and again we've said Josephus and and Roman historians have talked about Jesus Jesus existed there's no doubt about that but maybe he was maybe like we don't often think about like he like I don't want to say cultist or anything like that but like he might have just been delusional you know like too like there's totally",
            "start": 1796.64
        },
        {
            "text": "maybe he was maybe like we don't often think about like he like I don't want to say cultist or anything like that but like he might have just been delusional you know like too like there's totally a possibility of that plus you have Mary Magdalene who is probably his wife which the Bible would never ever ever touch in a million years you know and then you have his mom Mary and Joseph who's really only alluded to a few times the virgin birth and all this kind of stuff. It's just like what the [ __ ] This is so complicated. Just come back. You know, this is so complicated. Yeah, it's too complicated. It's too complicated. I appreciate it because it's fascinating. I've read the Bible. I take classes on the Bible. I know the Bible, but I study it as, you know, a piece of fiction, you know. And I took a great class, a couple classes in college, and we wrote we read a book called uh which is a great book. It's a short book, too, called, you know, Who Wrote the Bible? on it's it's it's split",
            "start": 1837.52
        },
        {
            "text": "I took a great class, a couple classes in college, and we wrote we read a book called uh which is a great book. It's a short book, too, called, you know, Who Wrote the Bible? on it's it's it's split into four parts for the four gospels and it ties all the who they might think wrote it and when they wrote it and stuff like that. It's fascinating stuff. Yeah. But it's for scholars now, not theologians to figure everything out in my opinion. Interesting that. Yeah. Also, real quick, yeah, the thing that bothers me the most, Catholic faith has books in the Bible that are not accepted by other faiths. And vice versa, we have the book of Ruth, for instance, which is considered part of the New Testament that is then not considered New. So like there's all this like I don't know doesn't make any sense. I'm done. Okay. So we're done with your topic. That's it. Unless you're out. I always talk about it. I always see little signs and feel the presence of God. And that's how I know. Like when you",
            "start": 1878.0
        },
        {
            "text": "I'm done. Okay. So we're done with your topic. That's it. Unless you're out. I always talk about it. I always see little signs and feel the presence of God. And that's how I know. Like when you see Portillo. Yeah. Only you see God's eyes in Portillo. Only Only a God could make something this perfect. Look at him. Aerodynamic. Look at him. Low to the ground. Able to bounce back from any problem. Got his own built-in spoiler on the end there. [Music]",
            "start": 1916.88
        }
    ]
}