{
  "id": 1665,
  "video_id": "2BWEtme1pQM",
  "show_name": "Gamescast",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Cliff Bleszinski",
    "Colin Moriarty",
    "Donald Mustard",
    "Mike Bithell",
    "Nina Freeman",
    "Steve Gaynor"
  ],
  "title": "GDC 2016 Super-Sized Special! - Kinda Funny Gamescast Ep. 64",
  "description": "At GDC 2016 we had a chance to chat with Cliff Bleszinski, Mike Bithell, Nina Freeman, Steve Gaynor, and Donald Mustard! (Released to Patreon Supporters on 04.01.16)\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
  "published_at": 1460120401,
  "duration": 8131,
  "transcript_chunks": [
    {
      "text": "Oh hello there Greg. Oh hey there welcome Tim to the first ever episode 64 of the Kinda Funny Gamescast. We're doing something a little bit differently, a little bit different, why not shake it up as the we only have some of the coolest dudes in video games, half the coolest dudes in video games are here, but you'll be seeing them all together throughout the the week. This this episode's different because we did a bunch of interviews at GDC 01. We interviewed a whole bunch of cool people and we're like let's make this a Gamescast extra long games. The biggest thing we took away from GDC 015 which is Kinda Funny as first GDC is that we did all this awesome content on Twitch live and then it went into the ether and not everybody saw these interviews. So this time around we went in and approached it the way we approached all the streams we did for Kinda Funny the Animated Series where we did it and we're live the entire day but broke the day up and these interviews packaged them as",
      "start": 0.31
    },
    {
      "text": "it the way we approached all the streams we did for Kinda Funny the Animated Series where we did it and we're live the entire day but broke the day up and these interviews packaged them as what's up everybody. Welcome to youtube.com, you know what I mean? Like this is something that live in the anals of history, but it means five topics for you guys rather than your regular four. Yeah cuz you're getting five starting on Sunday today, but the whole episode are broken up day by day, but now it's Sunday through Thursday instead of Monday through Thursday over at youtube.com/ Kinda Funny Games, you know got to get the rigoll right, got to get it out. If they want it early they go they go to patreon.com Kinda Funny Games throw some money our way and they can get stuff early and that would be great. You're probably you're probably one of those people that did that. Is this one worth a dollar? Yeah this one's this definitely worth five topics the biggest names in video game development. Yeah it's",
      "start": 48.0
    },
    {
      "text": "you're probably you're probably one of those people that did that. Is this one worth a dollar? Yeah this one's this definitely worth five topics the biggest names in video game development. Yeah it's worth a dollar you punks. This one's going to be awesome so who we going to start off with Craig? I figured we'd go big and start with what was the final interview of GDC, Cliff Bleszinski from Boss Key. Yeah there were you part of that one it was Colin it was me and Colin talking to him and honestly I think what you guys are about to see will change you no jokes one of the best interviews I've ever been a part of. Oh sure fascinating **** he knows his **** and his ideas of where the industry is at and VR and all this stuff enjoy. What's up guys I'm Tim Gettys this is Colin Moriarty and over there the one and only Cliff Bleszinski. Y y I'm going to since Greg's not here I'm going to have to do the the lean back. I'm kind of happy Greg's on here he's just so **** intense he's super just like that",
      "start": 83.0
    },
    {
      "text": "one and only Cliff Bleszinski. Y y I'm going to since Greg's not here I'm going to have to do the the lean back. I'm kind of happy Greg's on here he's just so **** intense he's super just like that level he's just I'm like Cliffy how's it going? Uh it's going great man. Uh we had a panel today how how did it go? Uh well we announced not to plug too much and too quickly uh that AR game Law Breakers is coming to Steam exclusively which is kind of a no-brainer when you really think about it like what we going to put it on an Origin no offense um and then uh we also announced we're not going to do freeo play with the game really so that that's a that's a huge change. We were initially thinking freeo play and the more we dug in the more we realized we weren't thinking about how to make the best game possible we're always just worried about how we going to monetize this how we going to monetize we I'm just like dude I want to make a great game that hopefully people want to throw some money at",
      "start": 119.96
    },
    {
      "text": "possible we're always just worried about how we going to monetize this how we going to monetize we I'm just like dude I want to make a great game that hopefully people want to throw some money at and they enjoy right so I'm looking there's got to be a a gray area between you know free to playay sleaziness and $60 disc based there's you know maybe there's an Impulse you know initial gate in there and maybe some interesting microtrans inside the game but you know we're kind of re rethinking and upending that whole model because I announced the studio and first off people are like Nexon really Nexon and I'm like well you know yeah they make Cart Rider but you know they have some money and they want to make western games and that's what I do. Um I make shooty shooty western games and um that well not like wow W West West anyway and so the um and then the other thing was free to play like you lost me a free to play and I'm like well League is free like come on man um and so you know we want",
      "start": 159.0
    },
    {
      "text": "not like wow W West West anyway and so the um and then the other thing was free to play like you lost me a free to play and I'm like well League is free like come on man um and so you know we want to have halfway point with it yeah so I mean that's interesting that's kind of an honest moment like right about like reflection to be like this maybe you benefit more from selling the game it's it's a kind of a meta statement on developing in 016 and Beyond where you kind of I mean I sto I stopped lying when I hit like 5 cuz I realized like I couldn't keep up with what I told anybody so I might as well just be myself and be **** honest with everyone and so it's the same thing with game development it's like just be you you know be straight up you know be as honest as you can be with your community and they'll they'll trust you back and occasionally they'll still yell at you because they care they'll call you horrible names on social media but you know if they show up and they play the",
      "start": 194.88
    },
    {
      "text": "and they'll they'll trust you back and occasionally they'll still yell at you because they care they'll call you horrible names on social media but you know if they show up and they play the game and they're talking about it that you're doing something right AB absolutely what what's the for people that aren't familiar with Law Breakers what kind what's the elevator pitch for? Um so it's uh takes place in the near future where there's been a massive earthquake and uh you know the uh people have managed to rebuild however and gravity just gets funky uh there's areas with no gravity there's areas with increased gravity areas with the you know inverted gravity as well as Humanity learning how to kind of harness these Powers so it's a character-based firstperson shooter that's probably going to be like mated you know right now the trend is for kind of these OverWatch and battle boor games that are very colorful and and they're cool I'll play the **** yeah and so you know I'm not saying",
      "start": 230.08
    },
    {
      "text": "to be like mated you know right now the trend is for kind of these OverWatch and battle boor games that are very colorful and and they're cool I'll play the **** yeah and so you know I'm not saying we're going to go full War as hell kind of Gears and Kill Zone an era from 10 years ago but there's got to be a halfway point where we're going to be the the grownup version of that you know they're going to be like kind of the G-rated ones and we're going to be like the R-rated one in that version and basically you know all these questions that I asked about the verbs you're doing the game as you're playing as these characters you know you grappling hooks and jetpacks and double jumps and side Dodges and inverting gravity yourself and creating Zury pockets and basically just what verbs can you do in the environment with game types that yield maximum drama to make just a fun fun team- based 5v5 first person shooter that's kind of the super super high level aw of course more to it there",
      "start": 262.84
    },
    {
      "text": "you do in the environment with game types that yield maximum drama to make just a fun fun team- based 5v5 first person shooter that's kind of the super super high level aw of course more to it there always is and the game you said the game's coming exclusively to Steam yep um your heritage obviously is on PC but you've been more well known my Heritage is actually Polish Polish well literal yes your literal Heritage uh that's the thing is when I was doing you know so the PC was always in a state of flux that's the beauty of the PC right so back in the day um you know we started on PC with uh epic and whatnot and share where days I'm old and then uh you know we decided to do console stuff for a while with Gears and then I decided to return to PC and when Gears was out the Steam wasn't the Juggernaut that it is and PC games are making a transition from boxed to All Digital which was a bit of a bumpy one and piracy was relatively High I saw the numbers and so at that point I was like yeah",
      "start": 294.76
    },
    {
      "text": "that it is and PC games are making a transition from boxed to All Digital which was a bit of a bumpy one and piracy was relatively High I saw the numbers and so at that point I was like yeah I know there's too too much piracy in the PC and which PC Gamers get very defensive rightfully because everyone always attacks their platform even though it's pretty much the **** uh it's amazing and it's all I play things on right now is my PC and so um and then deciding to just do something on PC because Steam has how many people installed B now like you know it's it's huge and you know valve you know we've been talking to valve and you know valve could use a shooter like this on their platform to kind of supplement the tremendous juggernauts that are you know uh DOTA and uh you know CSGO and all that right so it's like you know if you can find somebody like a valve that you can kind of get an agreement with you know and hopefully get all sorts of Vive Dev kits to play with have you seen have",
      "start": 335.84
    },
    {
      "text": "that right so it's like you know if you can find somebody like a valve that you can kind of get an agreement with you know and hopefully get all sorts of Vive Dev kits to play with have you seen have you been over there at all you just guys been nonstop over not the jet from valve is this like Cyrus from the Warriors of VR but like by this very soft way about him and he's like this kind of like VR in a good way cult leader we like there's all these Indie devs doing all these awesome things with the Vive and he's kind of like leading the charge and like you know Oculus and Palmer also and there's these like figureheads of this new world order of what VR could be and and I I just I personally love it I think it's it's great they're all sharing Dev secrets on how to you know do traversal in VR how to deal with motion sickness or how can you move around seated versus standing VR you know what what are the best uh you know uh techniques and ways to solve these kinds of problems it's very",
      "start": 372.8
    },
    {
      "text": "VR how to deal with motion sickness or how can you move around seated versus standing VR you know what what are the best uh you know uh techniques and ways to solve these kinds of problems it's very it feels very like uh communal in a good way and that's what's cool about GDC you know it's different than all the other other shows because that's what it's about all I keep hearing from everybody is that all the the VR **** specifically like with the the vibe everyone's just like you got to try this Star Wars thing you got to try this thing like it's going to blow your mind and uh it's it's cool to see have you seen it any of it yet? Well I mean we we went to the the PlayStation uh VR the PlayStation VR solid too man yeah you know they have a very good shot at doing well um it's one of those things like you know the biggest mistake that you know Chad and the crew made with the vibe was assuming you need an entire room for it which you don't you can just have it set up at your desk just",
      "start": 415.68
    },
    {
      "text": "things like you know the biggest mistake that you know Chad and the crew made with the vibe was assuming you need an entire room for it which you don't you can just have it set up at your desk just like Oculus so that's that's one of the issues with it the other main thing is like for case in point you know I was visiting I I've have a friend who has both the Crescent Bay and the Vive setup and one of my wife's friends was free on a Saturday and you know she she's not into games or anything right she's not really into Tech she's just a friend of ours and so we brought her in sat her down on the floor and showed her Henry which is the the uh Oculus story studio kind of movie we're about the Hedgehog while you're in the house you don't even interact with them right but just the the sheer delight and to look around and see Henry's bed behind you where you can see his quill sticking out and he's just this little hedgehog who has no friends and he just wants a hug for his birthday and",
      "start": 451.72
    },
    {
      "text": "delight and to look around and see Henry's bed behind you where you can see his quill sticking out and he's just this little hedgehog who has no friends and he just wants a hug for his birthday and he makes a birthday wish and maybe something magical will happen right and you can tell this is done by like X Pixar and DreamWorks folks cuz the animation is just on point and then put her in luy taale which third person VR games work surprisingly well and like I felt like the first time I played Mario 64 and lucky tail and then you put her in tiltbrush as well as job simulator and then just once that those goggles come off I mean I had there's this thing that I even know if they've termed it in VR it's like VR dissonance where you spend a little while in VR when you come back to the real world it's like you know coming coming out of the Matrix you're like holy **** where was I it's really cool the other experience I got to do we posted on social my friend Tom Ham over at the create Ad",
      "start": 485.88
    },
    {
      "text": "it's like you know coming coming out of the Matrix you're like holy **** where was I it's really cool the other experience I got to do we posted on social my friend Tom Ham over at the create Ad Agency they made this VR experience to promote the Robert Zemeckis movie The Walk about which was based on man on wire which is based on that awesome French dude who fired an arrow with the cable and and made it top between the World Trade Center towers and tight RPP walk the damn things oh my God and so basically what they do is they tape like a cord on the ground and you put the Vive on and you know they have the headphones on and they have fans even blowing on you right it's like okay oh no can you do it that sounds horrifying I I made it three steps and I had to stop and I know I i' I play with the Vive extensively I've done a ton of VR but like when you're standing at the top of a 100 story building and the wind's blowing you hear the cars all the way down below it goes against every part of",
      "start": 522.12
    },
    {
      "text": "Vive extensively I've done a ton of VR but like when you're standing at the top of a 100 story building and the wind's blowing you hear the cars all the way down below it goes against every part of your lizard brain to put your **** foot out there that sounds awesome I want to do that right now it's really cool and so um my my wife of course you know she a little freaked out but she did that just great you know brought a couple friends over and varying degrees of success with it but it's like it's so convincing and you know there's still a little bit of that screen door effect it's not as high res as it can as it can be it's going to get better and better and better and humanity is doomed did did you make it across Lauren yeah very and I just ran I got  it's not called The Run and of course in the back of everyone's head as were thinking about what happened back in the day with those buildings and everything it's just this very surreal experience and uh it was it was it was",
      "start": 561.2
    },
    {
      "text": "of course in the back of everyone's head as were thinking about what happened back in the day with those buildings and everything it's just this very surreal experience and uh it was it was it was moving and dark and and scary and you know that's the thing is you know I was talking earlier about when I had a chance when Brandon and Reby came to Epic's office years ago with this device that was duct taped together and that Palmer made with with Carmack and I'm like okay this is going to be big I just felt something which so this just blew my mind for a second so you're actually you physically are walking yeah so since it's the Vive it's room siiz VR so you're actually you know they have the cord tape down it's it's only about you know 10 to 15 ft you know but they but you walk you know you feel the cord beneath you you look down you see completely below you you actually tell I shouldn't have looked down that was my problem and you walk to the other side and you turn around you walk back",
      "start": 602.88
    },
    {
      "text": "the cord beneath you you look down you see completely below you you actually tell I shouldn't have looked down that was my problem and you walk to the other side and you turn around you walk back and like people can't do they can't do it you know I mean I'm not even that much of afraid of heights I'm more like a arachnophobe guy but this just got me man oh can you imagine can you imagine what they're going to do with the big the biggest thing about VR that's you know there's a lot of things that could go all day about VR but one of the things that'll screw VR first is bad and cheap VR like people like we got one too and then you know if it's not VR is not perfect it'll it'll just make you sick and like there's always going to be a small percentage of people that might hit you know like there's people that get sick in cars all the time and things like that there's people that get sick playing Portal yeah exactly so you know the inner ear and whatnot it's very complicated thing but it's",
      "start": 641.84
    },
    {
      "text": "people that get sick in cars all the time and things like that there's people that get sick playing Portal yeah exactly so you know the inner ear and whatnot it's very complicated thing but it's all gotten good enough now that you're the majority of people can use it and you know it's worth you know **** up your hair and having VR face for a couple hours cuz it's really that interesting um and the other thing is like dumb VR experiences that's why Oculus has a store that's curated so it's not just some vomit roller coaster or it's not just some like big dumb cheap scare because you know something when something you're next to a big robot who looks at you in VR you know you you feel it's right next to you you know I did one of these uh multiplayer games with my wife I can't remember what it was called on the Vive where like you know we're back to back and this and we're shooting robots together and she's in the other the room but I turn around I see like her Avatar like moving around",
      "start": 679.36
    },
    {
      "text": "it was called on the Vive where like you know we're back to back and this and we're shooting robots together and she's in the other the room but I turn around I see like her Avatar like moving around behind me shooting and like of course you know first thing we kind of do is trying and shoot each other in the head yeah of course marriage and um and then well the other people I put in there like try to grab the other person and just like make out their Avatar like yeah I'm more of that type of person yeah make lover War depends on how it is and so but like feeling her like right there in my back it was like oh I'm in your bubble I'm sorry and it's just it wasn't even a very well-rendered Avatar it was like some stock Unity thing or something but it was just that there you're there and that's the big thing about VR there's going to be Soler experiences uh there's going to be the social experience is what I think Zuckerberg believes in in regards to you know imagine you know I'm at my",
      "start": 713.28
    },
    {
      "text": "the big thing about VR there's going to be Soler experiences uh there's going to be the social experience is what I think Zuckerberg believes in in regards to you know imagine you know I'm at my house in Raleigh and we're all sitting here talking and you know via the Internet when you have an avatar and you have an avatar and all that like it's you know if I can play ball with my niece who lives in Orange County and I live in Raleigh you know or if I can play hide-and go seek with our niece in New Orleans you know nor Raleigh like virtually I mean it's going to be pretty magical you know how do you how do you think this is all going to shake out with these kind of three major competitors um we were talking to Lauren Lanning earlier he's of the mind and we I brought it up specifically because at E3 he said PlayStation was going to do it and this that was when I thought it was unintuitive to say like PlayStation's the one that's going to succeed but with the price point being more",
      "start": 746.48
    },
    {
      "text": "because at E3 he said PlayStation was going to do it and this that was when I thought it was unintuitive to say like PlayStation's the one that's going to succeed but with the price point being more affordable the the device that you need the PS4 being probably way more affordable than the rig you need to run Oculus how do you see it all shaking out? Well the first thing people always ask me is 016 going to be the year of VR and I said it'll be the year your Rich friend has VR and it's also one of those situations PlayStation has a great shot at it I've used the system myself London Heist is awesome they got a lot of great experiences it's really good stuff um it's a great Gateway right but very very quickly you know the resolutions the next year or two are just going to get higher and higher res the sensitivity of the calibration the rendering of your avatars you know and it's one of those things it's I think it'll it'll be a short-term winner but I think long term you look at Vive",
      "start": 779.52
    },
    {
      "text": "res the sensitivity of the calibration the rendering of your avatars you know and it's one of those things it's I think it'll it'll be a short-term winner but I think long term you look at Vive and Oculus Vive I think is going to do very very well if they can shed their you know you need an entire room you know like good luck for the person who spends $4,000 a month at San Francisco having a spare room for this um or a person even in like New York or Tokyo right uh versus uh Oculus I think a my if I was a betting man I think it'll go go Sony short-term uh Oculus longterm and VI Vive some and HTC somewhere in the middle more of a specialty thing yeah well I mean it's one of those things like you know I I'm a big fan of VR as I said I'll defend it uh to the nines but people like oh you know assuming you have the room if you this is a big assumption depending on you know person's socioeconomic status where they live there's a lot of factors there's significant other what the **** is",
      "start": 811.6
    },
    {
      "text": "assuming you have the room if you this is a big assumption depending on you know person's socioeconomic status where they live there's a lot of factors there's significant other what the **** is this in my house um it's one of those things where like we didn't have a TV room many years ago you know even before when radio really came about you see those old black and white photos of people with that big ass radio listening to war the worlds that was like the center of their living room if it's as good as it can be which I honestly believe it will be people will find a way you know they'll you know if you're in a small apartment get the thing installed where the bed can go up in the wall like you know in the classic movie where the person always winds up in the bed and the in you know like or the old like Looney Tunes cartoons and um the at the end of the day and this is going to sound really dumb and sad for Humanity porn oh yeah I mean so obvious to say that but it's when it's",
      "start": 853.64
    },
    {
      "text": "like or the old like Looney Tunes cartoons and um the at the end of the day and this is going to sound really dumb and sad for Humanity porn oh yeah I mean so obvious to say that but it's when it's really like really like this is what's going to drive this but it's like there's a lot of lonely people out there you know and an entire generation who grew up online that may or may not how to like socially interact as well as the earlier generation that's just going to be like ah this is all I need now Vibes doing it already there that's the thing is I don't think I my gut is saying from what I know about Sony I don't think Sony's device will have porn yeah you know and I I know Facebook's really careful about what you see on on Facebook's feed however you know when it comes to the VR setup people will find a way for that one and it I just think it's funny that people having sex right now with 360 cameras on their foreheads yeah I mean it's I'm it makes me happy to know that somewhere out",
      "start": 887.44
    },
    {
      "text": "will find a way for that one and it I just think it's funny that people having sex right now with 360 cameras on their foreheads yeah I mean it's I'm it makes me happy to know that somewhere out there they're thinking of the little people you know right I don't know it's I had a buddy mine was telling me a story about he had a friend who had the the Oculus DK setup and he said his uh spouse came home and he had the the headphones on and the the headset and pants all the way down just going to town and I was like if I was his his wife I just would have taken my phone and just holiday Christmas card and then punch him in the nuts but um yeah it's one of those things the other thing I want to do is you know um just play with like you know take my friends with the Gear VR and and find some sort of VR porn and you know for instance the the some of the guy friends that are heterosexual that I'm friends with you know take them and put it on where they're like oh I'm female I have boobs and",
      "start": 927.16
    },
    {
      "text": "of VR porn and you know for instance the the some of the guy friends that are heterosexual that I'm friends with you know take them and put it on where they're like oh I'm female I have boobs and and what's hey what's wait what's he doing oh my God right like cuz there's reaction videos um and everything in between right just to kind of mess with people's heads a little bit um and again horror has to be subtle in VR it has to be just very gentle I like how you jump from from that to porn well oh I didn't if I stay in the porn thing too long it get weird man we're talking about yeah you know all that it's just it is what it is but that's the sad fact that porn drives technology for Humanity half the time um so back to horror is uh jump scares in VR terrible idea you know one of my friends made a little VR experience a while back where you're in this creepy environment kind of hanging out and there's a wall full of like creepy dolls you know like the old ones missing an eyeball and",
      "start": 967.28
    },
    {
      "text": "made a little VR experience a while back where you're in this creepy environment kind of hanging out and there's a wall full of like creepy dolls you know like the old ones missing an eyeball and stuff like the little spider one from Toy Story right and and um they're all just sitting there and you look away and you hear a sound behind you and there's nothing there you look at the wall and one of the very obvious dolls that was in the front is just gone and then you turn around at the end of the hallway the dolls just standing there just little things like that are so easy in VR to kind of make the back of your neck stand up as opposed to just you know boo giant you know Monster from The Ring Pops in your face and makes you tear the headset off and throw it on the ground it's like they have a Paranormal Activity one that's supposed to be pretty good and I'm like n I'm good because there's apparently a story um some woman was using it and she literally tore the Vive headset off and",
      "start": 1007.96
    },
    {
      "text": "have a Paranormal Activity one that's supposed to be pretty good and I'm like n I'm good because there's apparently a story um some woman was using it and she literally tore the Vive headset off and threw it in the ground and smashed it and broke it oh no yeah so anyway shortterm PC law Breakers Long Term we'll see where VR goes yeah um yeah so I'm I'm interested uh one of the things we were talking about with Donald Mustard uh yesterday from Chair um I asked Shannon Studstill this from Sony Santa Monica too and I just I like you have a great brain for the for the industry like you just you you see things and you you have a good analytical mind for this stuff and I know this is kind of a a random left ter but I'm curious about what you think about this we were talking about pricing and we were talking about how many games exist now and I'm curious do you you know having in general or VR in general just in general I'm Sor everyone stack of Shame yeah but just even if you go on PSN",
      "start": 1040.92
    },
    {
      "text": "we were talking about how many games exist now and I'm curious do you you know having in general or VR in general just in general I'm Sor everyone stack of Shame yeah but just even if you go on PSN there's like 10 new games a week like then you never heard of any of them uh as someone like with a mind for this kind of stuff and someone who kind of experimented with the freeto play and kind of you know the idea of doing it anyway and then kind of going back to a pricing model do you think games are too cheap or too expensive uh do you think that we like have a sweet spot with like a $60 retail game well I think there's it's a hugely complicated thing you know first off there's there's too many damn games out there right now when it comes to my personal taste what I like is little VR experiences or little like personal games on Steam that are like you know $10 to $30 that are you know very experimental and cool um the whole $60 like dis based thing I'm kind of over it like is the G all",
      "start": 1081.24
    },
    {
      "text": "or little like personal games on Steam that are like you know $10 to $30 that are you know very experimental and cool um the whole $60 like dis based thing I'm kind of over it like is the G all the games just feel like they're screaming please don't trade me in and as a developer who's who made a mantra for some of our games keep the disc in tray so they don't trade it in it's I can see oh collect 100 of these things I'm like this is just busy work like you're just trying to keep me in your game instead of experiencing something else in regards to pricing digital will save us all that's the funny thing about it all you know it's like you know you can have something that's $4.99 that's kind of a bite-size experience or you can have you know the Witness which is you know John John B is like $39.99 people are like all right he makes millions like good for him right so the thing is is you know the the free market can be a good thing and a bad thing but in this instance I think it's a",
      "start": 1115.8
    },
    {
      "text": "$39.99 people are like all right he makes millions like good for him right so the thing is is you know the the free market can be a good thing and a bad thing but in this instance I think it's a good thing but the big X Factor in all of this is YouTubers and streamers viously said on stream um and the fact that you know there's this weird tail waging the dog thing that's happening right now where people are deliberately making the most absurd video games imaginable and putting it out there just to see if it'll go viral because the YouTubers and the Twitch streamers are trying to find wacky **** to play to have a funny reaction to so that the kids who barely even play games just watch them online have something funny to watch it's like this weird like the PewDiePie ification of the world that's happened and it's so funny like you know when you look at you know these these platforms they're the new MTV that's crowdsourcing their celebrities by way of you know the fun things",
      "start": 1154.52
    },
    {
      "text": "the world that's happened and it's so funny like you know when you look at you know these these platforms they're the new MTV that's crowdsourcing their celebrities by way of you know the fun things that they get to do with all these unique video games as well as you know cosplayers and that whole ecosystem so it's it used to just be make a great game put it out there and have your Publishers spend a bazillion dollars to Market it at NCAA commercials now it's like 15 different factors coming together in order to hopefully make get make something go somewhat viral and actually like sell and make money instead of just getting lost in The Ether of everything else that's out there yeah yeah I I'll pick kicking in yeah veins right here what about you brought it up because I agree with you 100% way too many games um what like I I'm surprised economic realities has haven't stopped this from happening already but why do you like why like obviously there's a market imperative to make a game",
      "start": 1190.24
    },
    {
      "text": "way too many games um what like I I'm surprised economic realities has haven't stopped this from happening already but why do you like why like obviously there's a market imperative to make a game and make money it's it's it's not an altruistic thing but like do you ever think there'll be like a correction that it seems to have been a bleed over from maybe uh the app store and then maybe a little bit with Steam whereare there's just a lot of **** and I I don't understand like where this is all coming from and how people just continue to raise capital and make these games I think um you're going to see a bit of a bubble in the traditional disc based Triple H space because people you know you already saw this like Titanfall did pretty well but it seemed to hit a bit of a brick wall in regards to longevity uh Evolved did okay right and Gamers they can smell value and when you put out a multiplayer only experience for $60 day one with a fake campaign that's just Bots or something Gamers",
      "start": 1230.36
    },
    {
      "text": "to longevity uh Evolved did okay right and Gamers they can smell value and when you put out a multiplayer only experience for $60 day one with a fake campaign that's just Bots or something Gamers with DLC and gamers are like really you know I don't buy it you know like in my opinion you know those games could have been free to play or some sort of mid-tier model you know a lot of the ones that I like to site the examples is like a Counter-Strike GO you know small price of admission like a you know like a cover at a bar to keep the idiots out and everyone who's there paid a little small chunk of money to be there um with an interesting key crate system for microtrans and wrapped around a super airtight one of the greatest firstperson Shooters still today of all time so that you know that's why Valve's been steadily grooming that and it's just keeps going and it's still a great game so in regards to your average disc based game though you know I've heard me you've heard me rant about used",
      "start": 1266.52
    },
    {
      "text": "why Valve's been steadily grooming that and it's just keeps going and it's still a great game so in regards to your average disc based game though you know I've heard me you've heard me rant about used games before you know when I was younger and a lot broker you know I would have bought the **** out of a $39.99 used game that used to be $60 you're damn right I would I wouldn't care if the developers didn't make any money off that but the the ecosystem cannot sustain the feature set that Gamers expect the Fidelity of the graphics the amount of money the marketing campaigns cost and developers actually getting paid and keeping their doors open there's a hole in the bucket which is of course used in rentals and that's you know I site the game I worked on with uh people can fly Bullet Storm that I was you know helping out with when I was at Epic it was a great kind of you know in hindsight everyone's like man that was a great shooter like yeah the problem was was a a shitty marketing",
      "start": 1305.24
    },
    {
      "text": "that I was you know helping out with when I was at Epic it was a great kind of you know in hindsight everyone's like man that was a great shooter like yeah the problem was was a a shitty marketing campaign for it I thought it was just funny and it was stupid um and B the fact that it was kind of a campaign rental you know it was like an 8 Hour play through the campaign without Co-op or anything you're like it had a tack on kind of like Co-op multiplayer but it wasn't very good so it's just once you play through that thing you're like okay well I'm just going to trade this in for the next game and the cycle continues it's a revolving door and so in that space you know you know Google Fiber is even coming to Raleigh like there's still plenty parts of the world that don't have the internet but so many of these games now are always online like you know can you even play Destiny without internet connection right now I don't know I know you can't play the division without without an",
      "start": 1340.56
    },
    {
      "text": "but so many of these games now are always online like you know can you even play Destiny without internet connection right now I don't know I know you can't play The Division without without an internet connection you know and it's it's you know it's coming sooner or later no matter how much people were kicking and screaming when you know Microsoft attempted to do like the digital sharing and all that stuff and I don't want to say I told you so but you know I got a lot of heat back then when I wrote blogs about it but you know it's all these you know online games are they're they're here now you know and like Netflix look how big **** Netflix is you know and everyone watches Netflix you know and you know the world you know there's always places that lag behind with shitty internet connection rural areas people in the military don't have a good signal that absolutely is a case um so you know there's a case for actually downloading and having the stuff on whatever device but you know",
      "start": 1372.6
    },
    {
      "text": "rural areas people in the military don't have a good signal that absolutely is a case um so you know there's a case for actually downloading and having the stuff on whatever device but you know sooner or later you know the most of the world's going to be connected that's one of you know Facebook's hairy hairbrain schemes is to have like balloons in areas that don't have internet to bring internet there so Zuck can grow his user base for Facebook and continue to take over the world which is what he's doing yeah just I think the problem is it's not there yet even for the the well-connected places you know like even here in San Francisco like I at my house I have great my mom's house I mean I have great internet but then the house I'm living at now not so great internet and that's just because of where it ISU mountain and all you have the whole conversation about infrastructure in this country as well I'm going watch John Oliver if you want to see something interesting about that um but",
      "start": 1408.12
    },
    {
      "text": "of where it ISU mountain and all you have the whole conversation about infrastructure in this country as well I'm going watch John Oliver if you want to see something interesting about that um but I mean eventually it'll all just be Wireless and just be super fast and we'll all probably get brain tumors or something it'll be worth it though for my my VR experiences from the cloud yeah I mean we have uh you know I think we're onun Time Warner Cable for our internet at the house and like with Google Fiber coming suddenly I'm getting these calls from like hey we've upped your you're blah blah blah I'm like I'm like oh really now **** oh I see how it is uhhuh because fibers coming I'm warning you Fiers coming it's not the person's falling the phone but I can't help but a little bit it's like getting mad it's like getting mad at your pharmacist you're just like these drugs are too expensive I knew and it's like the person's like I didn't make set the price talk to your freaking",
      "start": 1443.56
    },
    {
      "text": "it's like getting mad it's like getting mad at your pharmacist you're just like these drugs are too expensive I knew and it's like the person's like I didn't make set the price talk to your freaking pharmaceutical company and your health care provider Jesus Christ one of the last questions I want to ask because I I'm always been intrigued even before I met you uh about this about you is that you are well known for being to some people Brash or to some people just to me I've always thought that you just tell the truth and I'm wondering like and I I've had the pleasure to to speak to you and know you in person over the last few years to know that you're not just saying the **** you say to say it like I never to be fair I can be an **** on on the internet I mean and and when you have a culture that doesn't know where a person's coming from they take something out of context it's really really easy to be like you said what I hate you without actually like reading what was actually",
      "start": 1476.0
    },
    {
      "text": "a culture that doesn't know where a person's coming from they take something out of context it's really really easy to be like you said what I hate you without actually like reading what was actually said because clickbait culture and etc etc um but yeah I mean I just I speak what's on my mind I don't like my **** time wasted and Life's Too Short you know and I mean if you know I get hit by a bus tomorrow I think those who've known me in person Find I'm an okay person you know and I you know I have plenty of friends in the industry and whatnot and you know I don't like kick cats in my spare time um but you know I do talk a little bit of **** but it comes from the heart you know I usually say what I think you know and it's one thing to on on a side note like for case point on Twitter the other day um I got owned by a community manager from Ubisoft cuz I was complaining about Rihanna's new song Work Work Work Work and how I felt like there's this mumification of hip-hop that's been",
      "start": 1511.96
    },
    {
      "text": "other day um I got owned by a community manager from Ubisoft cuz I was complaining about Rihanna's new song Work Work Work Work and how I felt like there's this mumification of hip-hop that's been happening lately and I say this as a 41-year-old kid who's raised in the suburbs of Boston but I've always loved like good rap and hip-hop um I just I just **** love it and so I was like wow you know rap's turning into a full Mumble Fest I don't know what's going on out there you know I can't even understand a word in this thing and this guy's like well actually it's um Rihanna's background mixed with this kind of cultural uh kind of way of speaking that the song's actually about this that and the other and I'm like I quoted it I was like well **** I look ignorant now and I apologize now I know and it's like one of the the biggest things you know if you know something be confident in the fact you know it if you're",
      "start": 1548.76
    },
    {
      "text": "and it's like one of the the biggest things you know if you know something be confident in the fact you know it if you're **** wrong be willing to be like Oh I'm sorry you know like it's even in my relationship with my wife it's like um did you leave the you know a little stupid like did you move my slippers uh no well I can't find my **** slippers and then later on oh yeah I left him in the bathroom my bad you know like it's important to be like admit when you're **** wrong that way when you're right people will know like that you're not invincible and you're a **** human being you know I just like to curse too like Jeff yeah I know it's fun I also really enjoy the mumification that's like such a good just a good word whether or not you were right that see that I won't stand for no **** that trap Queen **** needs to go dude give me Little Dicky any day of the week thank you Little Dicky is awesome uh I asked that question or just bring that up only because I wonder if you",
      "start": 1586.12
    },
    {
      "text": "no **** that trap Queen **** needs to go dude give me Little Dicky any day of the week thank you Little Dicky is awesome uh I asked that question or just bring that up only because I wonder if you know is the like I I feel like the gaming industry is like so full of **** sometimes like or a lot of times I feel like it's like I feel like it's just it's like politics and maybe it's like any industry which is not I've never been in any other well I mean the problem is it's like the stock market perception is reality in the world same thing with game design if your rendering engine is showing some sort of Reflections in the wall and they think it's actually reflecting the water then you have Reflections even though it's a hacked texture so it's like it's you know Randy Pitchford does this whole talk where he says video games are magic because ry's a he's a magician he's on the board of the Magic Castle and you know if I do this whole thing and reach behind your ear and find a quarter",
      "start": 1620.96
    },
    {
      "text": "whole talk where he says video games are magic because ry's a he's a magician he's on the board of the Magic Castle and you know if I do this whole thing and reach behind your ear and find a quarter and you think I actually found a quarter behind your ear then you believe it and so it's misdirection it's also it's also the incredibly short-term memory of humanity in regards to you know if the internet comes down on you for some **** just wait a week you know and it'll blow over and they'll be on to the next you know and so what you have is instant gratification culture uh people now have a platform and a voice uh things taken out of context uh as well as people looking for a reason to get upset about things and so when you add in all that together you get **** like Trump MH you know cuz he's willing to say what I'm thinking like no he's an **** you know but like when you have this this world of this clickbait culture and people who are you know like you get this guy that's I'm",
      "start": 1655.84
    },
    {
      "text": "cuz he's willing to say what I'm thinking like no he's an **** you know but like when you have this this world of this clickbait culture and people who are you know like you get this guy that's I'm not going to get into too much politics but that's I tweeted about that earlier which is why I think you this kind of thing well Cliff thank you very very very much this was a great great interview I'm excited about it me too so Greg yeah we're coming up today on topic two of the Kinda Funny Games Cast the super siiz GDC special exactly you guys are probably familiar with how this is going by now uh topic two is Mike Bithell the one and only Mike Bithell of course made Thomas Was Alone found enormous success put out Volume it came to some platform the PlayStation 4 and stuff nobody cared about then it came to Vita everyone went wild for it and then to make it even crazier for Mike Bithell he's taking to the next Dimension he yeah he is wow good one he announced that yeah the PlayStation VA",
      "start": 1693.2
    },
    {
      "text": "then it came to Vita everyone went wild for it and then to make it even crazier for Mike Bithell he's taking to the next Dimension he yeah he is wow good one he announced that yeah the PlayStation VA version Volume Coda is coming as well and is free add-on to regular Volume so we brought him in of course during GDC to talk to him about Volume Coda and of course Volume getting a little physical packaging that's exciting we had our best talk to him about it Colin Moriarty and Nick Scarpino what they have so we had our best talk to him and Nick yeah how is uh how's GDC treating you I hell it sound wrong um really good it's a weird GDC um usually a GDC I'm here like you know uh demoing showing the games to press obviously as Volume's out um we're not doing that this year and the uh Volume Coder wasn't quite where I wanted it frame rate wise specifically because VR obviously you want that great frame rate so we're holding back uh for now but that will be at future events um so it's this weird",
      "start": 1733.48
    },
    {
      "text": "quite where I wanted it frame rate wise specifically because VR obviously you want that great frame rate so we're holding back uh for now but that will be at future events um so it's this weird situation where we're just you know we're in and out of meetings this is literally the only like thing I'm doing that is in a meeting or a party this whole this whole week so it's it's really nice actually to not like be trying to convince a publisher that I'm good we tell you but we actually brought a disco ball we're going to drink later so this is actually a party a party this a Party of Three Kevin's a party getting started that's what it is yeah I know it's cool so yeah it's been um so my voice obviously is like croaky because I went to I tried I I did three parties last night which was optimistic to say the least I'm not really a party guy so I was just like uh but it was it was fun and I got to see a load of uh a load of buddies so it's nice um oh Sor no no please please please I've",
      "start": 1780.04
    },
    {
      "text": "to say the least I'm not really a party guy so I was just like uh but it was it was fun and I got to see a load of uh a load of buddies so it's nice um oh Sor no no please please please I've already I've asked all the questions so far I was going to ask him about about which parties he went to last night cuz we did not I did not go to any party last night I fell asleep like an elder at 8:00 I've been doing that as I I did that I've done that like two nights in a row and last night I was like no I'm going to some down parties so last night was uh Humble Bundle party uh which was really cool had loads of like Indie Games playable and stuff so drinking and looking at stuff uh then the Sony party which was awesome yeah um they always throw really cool parties uh which was where just kind of I was just wandering around meeting basically seeing all the Indies and then IGF finished so all of the guys who' won came along and we were all Ching it was a lovely evening um and then I went to Epic",
      "start": 1820.68
    },
    {
      "text": "was just wandering around meeting basically seeing all the Indies and then IGF finished so all of the guys who won came along and we were all ching it was a lovely evening um and then I went to Epic uh all of it sounds horrible so no no those were cool and what I liked about the so so the humble party was cool cuz it was quite quiet and like it wasn't very loud music it was just people playing video games it felt cool right uh only one there was like an outdoors area that was quite quiet which suited me just fine kind of stood there with my Coke having a chat Coca-Cola um important distinction the problem is hilarious if you're just holding a mirror the entire time there's no flat surfaces me I see um and then uh and then I went to the Epic party which was just like loud and bright lights and just terrifying that one was that one was like that was a big that was like I've not been clubbing since I was like 18 like I I did that when I was very young and now I'm just too old for that",
      "start": 1864.6
    },
    {
      "text": "and just terrifying that one was that one was like that was a big that was like I've not been clubbing since I was like 18 like I I did that when I was very young and now I'm just too old for that stuff no I feel the same way yeah um all right so we have first of all the big announcement in case you're just tuning in Volume coming boxed limited run yes with on the V on the Vita we're just doing the Vita version for now we're going to see how that goes and and who knows but uh but yeah and that's will you'll get so you actually do get like the the little the little disc for the V it's a it's a proper box release well I'm glad you're able to enjoy yourself for uh GDC not having to show the game like you know like it's nice like you're not having the same conversation every 10 minutes that's the thing right like I I I get it like I'm you know press have the hardest time at these events cuz they are running from room to room I get to S who am I to moan about seeing in a room showing off for",
      "start": 1909.32
    },
    {
      "text": "thing right like I I I get it like I'm you know press have the hardest time at these events cuz they are running from room to room I get to S who am I to moan about seeing in a room showing off for like four days right but like the one thing that's tiring is like if you're showing a game you have like these are the things I need to make sure I show this is this is the stuff that like I have to get through and you just have that same conversation over and over it's very tiring whereas with this like we're having meetings with platform holders Publishers other devs that we're helping other devs that help helping us and it's just a really nice flow of different conversations and getting to see some cool like Tech and secret things as well so that's good that's awesome um I noticed that you know because you don't have to show the game off the young Japanese boy that was assisting you last last year so he's apparently like something's going on with him he's really busy I guess there's like",
      "start": 1949.2
    },
    {
      "text": "because you don't have to show the game off the young Japanese boy that was assisting you last last year so he's apparently like something's going on with him he's really busy I guess there's like I don't know he got a job I forget where um like this little Japanese company and he's doing this it's like glasses or I don't know right yeah special glasses the young Japanese boy working on special glasses okay I'll okay on another day I'll get him on another day and the other thing is I don't have anything to demo so what would he do right he would just he would just he would he's not he's not got many interesting things to talk about really so it's fine that's still one of my favorite moments of GDC last year was just I you were talking about Shu but I didn't want he just but he for people that didn't see it he just showed up like so he DM so he dm'd me like that morning on Twitter just saying and had we met at that point I feel like we'd had dinner like a while before um and he just",
      "start": 1987.0
    },
    {
      "text": "that didn't see it he just showed up like so he DM so he dm'd me like that morning on Twitter just saying and had we met at that point I feel like we'd had dinner like a while before um and he just cheed me going hey I saw you're on Kinda Funny and I'm not gring on this morning do you want me to come and demo your game with you and it was just like and we met like uh met on a corner outside just before coming in it just like that's Shida just and then he just totally played along I I think I'd met him like in a big thing with lots of people but like you know we got to hang out and stuff and we we've hung out since quite a few times he's lovely but like no he was just uh he was just great and he totally as we were walking in like I was like it would be really funny if like we pretended we didn't know who you were he's like that's really good so we actually I think we managed to for I think Greg messed it up if I remember right like I feel like he just kind of was like uh he just like",
      "start": 2022.36
    },
    {
      "text": "didn't know who you were he's like that's really good so we actually I think we managed to for I think Greg messed it up if I remember right like I feel like he just kind of was like uh he just like he said Shu by a mistake but we managed to keep this thing going for a while that none of us knew who this guy was he just the it's great it really fun yeah he was just playing the game didn't do wasn't there for any Sony related business at all and then just left it was awesome it also took $50 from you as well I think which he then proceeded to go around the rest of GDC like photographing himself holding the $50 and tweeting at me so it's cool no I I love Shu I've uh I've enjoyed I've enjoyed many an evening with Shu too he's a he's a cool guy and uh he's just he has a he has a sense of fun which is great and obviously he should right in the industry he works but like it's real like it's real when he is he loves what he does he loves uh the medium and I just yeah he's great he's uh he's",
      "start": 2062.16
    },
    {
      "text": "which is great and obviously he should right in the industry he works but like it's real like it's real when he is he loves what he does he loves uh the medium and I just yeah he's great he's uh he's my kind of people so uh I'm kind of curious I was wondering this with Volume because Volume you you tweeted out a while ago um that you know Volume obviously exceeding the sales of Thomas Was Alone pretty significantly does Volume does a high tide raise all boat for or does a high tide raise all boats for your games in terms of like has have you looked back at Thomas Was Alone sales to see that those have spiked at all it it does and it's incredibly cool like it's it's this thing that when CU because it was a surprise to me and then I've talked to like Publishers about this and they're like yeah catalog that's how it works you know you bring out the new game the old game does better but it was a surprise to me and yeah no so Thomas Was Alone continues to do really well um and we're still",
      "start": 2101.4
    },
    {
      "text": "yeah catalog that's how it works you know you bring out the new game the old game does better but it was a surprise to me and yeah no so Thomas Was Alone continues to do really well um and we're still finding weird opportunities to do cool stuff with Thomas Was Alone we we've done some some weird different bundles and sales and things recently just experimenting with it um but yeah people people go back cuz we find people there's a lot of people um who like you know who have played Volume who've never played Thomas Was Alone so they finished that and hopefully they like it and they're like I want to try something else by this guy and see what see what's gone before so uh so yeah so it's Thomas Was Alone continues just to do really nicely and and that's again like I my job is to make V my job is to make video games and that's amazing and I still like still like the idea that like I make stuff and people bother to play it and then because they play I get to keep making more stuff is just",
      "start": 2140.36
    },
    {
      "text": "is to make video games and that's amazing and I still like still like the idea that like I make stuff and people bother to play it and then because they play I get to keep making more stuff is just mind-blowing to me so I'm incredibly grateful every copy of Thomas Was Alone I sell like literally lets me keep making games and same with Volume now so it's it's really cool awesome um now I know Kota is like kind of like your focus now um but I did respect the jump from Thomas Was Alone to Volume in terms of they're just totally different games I it's totally different style you made basically like a kind of a Puzzler and then you made kind like a stealth like a Metal Gear Solid VR kind of game which I think and I think Volume is is fantastic um it's great again on Vita that's I waited for it on V it's working really well with those short play sessions I think yeah absolutely um and there's a nice little story in there and all you know like there's a lot to find um but like where's your",
      "start": 2178.44
    },
    {
      "text": "on V it's working really well with those short play sessions I think yeah absolutely um and there's a nice little story in there and all you know like there's a lot to find um but like where's your head at in terms of like once you pass all this and once VR I know this is like in your focus until the end of the year maybe beyond that but do you have any ideas for like what's next is it'll totally radically different idea again I mean the problem is we have too many ideas I that's the big challenge is that you know of because we've released two games now and they've been well received and that like there's lots of opportunity for us to do sort of whatever we want next which I'm finding incredibly difficult like speaking completely candid League because uh it it just opens so many doors and it's scary and weird because so I I I always have to try explain this to people like Thomas Was Alone was like the reason it's rectangle I literally was making it my evenings and weekends I had no",
      "start": 2223.04
    },
    {
      "text": "it's scary and weird because so I I I always have to try explain this to people like Thomas Was Alone was like the reason it's rectangle I literally was making it my evenings and weekends I had no time no resources no money I just had to like make something um and then that came out that did okay and you know Thomas took a while to kind of build build and and do stuff so Volume was very much okay I have like a year salary in my bank account I can make something a bit bigger maybe but like I have to be you know oh you know maybe stealth but like more puzzly stealth out I can get that done in a year obviously it end up taking three years um but like but but like at every turn it's always been that constraint and kind of thing and now that we don't have the constraint that's that's tough so the honest answer is I have like four or five ideas and we're just trying that's big part of GDC is just talking about those ideas with people and seeing which things people react well to um I've had",
      "start": 2260.16
    },
    {
      "text": "the honest answer is I have like four or five ideas and we're just trying that's big part of GDC is just talking about those ideas with people and seeing which things people react well to um I've had one person laugh in my face at one of the ideas that might not be the next game but um plus it's a comedy game in which case there you go you crushed it so it's cool and we're just kind of so we're going through that process we're also in the process of kind of structuring everything better um Alexander my new business partner is kind of uh really like organizing everything and like building a business which was never something I did because I make video games and I just wasn't thinking in that way um and I will now plug actually we're doing a podcast which we're focusing on that stuff cuz we noce there's a lot of games podcasts about game development but they're all kind of about the fun stuff and the kind of the game creation stuff so we have a the BTHL games podcast uh uh which is like",
      "start": 2298.08
    },
    {
      "text": "noce there's a lot of games podcasts about game development but they're all kind of about the fun stuff and the kind of the game creation stuff so we have a the BTHL games podcast uh uh which is like it's all on iTunes and YouTube and stuff and that is that is really focused on like like literally we did we the the most recent episode we did and uploaded was literally an hour interview with our lawyer like basically just like talking about like fair use and what that is and how legally that all works just the really kind of the nerdy business side of stuff we talk about Game Dev and and the fun stuff as well but like it's been really fun kind of exploring that and talking about that so we're trying to organize be more professional and then just work out which of those cool ideas to do um I I assume you're attracting attention and maybe even be for Volume from Publishers right I mean do do you want to work with anyone or do you kind of want to remain independent and kind of chart your",
      "start": 2338.36
    },
    {
      "text": "I assume you're attracting attention and maybe even be for Volume from Publishers right I mean do do you want to work with anyone or do you kind of want to remain independent and kind of chart your own course it's it's a it's a tough one because yeah I mean that's the thing is you is without trying to be you know too boastful like we've shipped two solid games and that gets certain people's attentions and you start to be attractive to those people so it we're having the conversations and we're seeing um I think for me it's like it has to be something that it has to be something that we would make on our own as well like I don't want it to be something that's um that we feel like we're doing because we have to because I mean you the players can tell you know I've worked on those kind of games in the past and players not my independent ones but like I've worked on those games you players know players know like if you're faking it right they know if you're not into the thing you're",
      "start": 2378.04
    },
    {
      "text": "of games in the past and players not my independent ones but like I've worked on those games you players know players know like if you're faking it right they know if you're not into the thing you're making um so I don't ever want to that kind of project but yeah we're talking to everyone at the moment cuz there are these opportunities but we'll see man but it will always be something that I want to make it will always be something that I would have made on my own anyway it's just nice to have the help you know yeah I mean is is the perfect middle ground for you kind of the situation you have with Sony where it was with Volume where it was like it's coming to PS4 and VA first um on in the console space and then I mean is that kind of like the perfect Middle Ground to give you like kind of a little bit of a voice and a little bit of a stage and they helped us you know and and Sony have been just the most you know I know I'm I'm Kinda Funny so this might sound empty but it's true like",
      "start": 2416.0
    },
    {
      "text": "a little bit of a voice and a little bit of a stage and they helped us you know and and Sony have been just the most you know I know I'm I'm Kinda Funny so this might sound empty but it's true like Sony have been like just amazing partners and collaborators on the stuff that people see you know in terms of like yes got to go out on stage which like for me is just mind-blowing again um and like you know support with marketing and all that stuff but then in private as well like having you know uh chats showing them stuff you know working on them with uh with Koda the VR expansion like just like getting like the guys making PlayStation VR to play the game and find problems or find stuff that works and we found these weird situations where like there's stuff that's in coder which is now being put into other VR games cuz it's a nice solution and we're also fixing loads of things in Coda which other developers have solved better so it's like this whole kind of collaborative and VR in",
      "start": 2451.36
    },
    {
      "text": "being put into other VR games cuz it's a nice solution and we're also fixing loads of things in Coda which other developers have solved better so it's like this whole kind of collaborative and VR in general is super collaborative but Sony have been awesome at kind of sharing that information around and and making sure that all of us are producing really cool stuff can you tell us a little bit like what is the nature of Koda going to be like I I don't know how much you've talked about it but I mean can you tell us a little bit about it without obviously being able to show it yeah so we're not showing it um and I don't want to like over overstate it so it's the best game ever no it's like you plant an acorn and it grows into a tree and in VR um no it's so it's um it's still top down it's still um it's still you're viewing kind of an isometric uh space uh so if you've played Volume you know it's kind of that like you say like MGA solid VR kind of top down camera um but it takes",
      "start": 2492.56
    },
    {
      "text": "it's still um it's still you're viewing kind of an isometric uh space uh so if you've played Volume you know it's kind of that like you say like MGA solid VR kind of top down camera um but it takes place in this kind of cool VR environment you're sat with a controller or stood with a controller and it's a hologram in front of you of the level you can make the level bigger in times like in the real world you can make it bigger smaller rotate it so it's comfortable and you can and to be honest like just for fun right so like you can be playing it on like a and it's like the size of like a like a like travel chest kind of thing and that's kind of cool like really close to your face or you can like scale up so like GI Jo's kind of walking around and you can poke your head into it and kind of look around it's a really it's a really it's it's you know it's taking that Twisted it is it is weird and cool and it's a fun toy I I remember when we were talking like very early on like just kind of",
      "start": 2533.4
    },
    {
      "text": "around it's a really it's a really it's it's you know it's taking that Twisted it is it is weird and cool and it's a fun toy I I remember when we were talking like very early on like just kind of working out the high level design of it we were like um we I I always use the reference of like I want people to be able to like play with the window of a car like you know when you're a kid you're like just fiddling with the window and like making go up and down off your grandma exactly and I'm like when I get VR for the first time I want games that let me kind of fiddle and just like do things and be silly with it and up you know workout ways of uh of of of playing the game their way and this was the kind of solution of like let's let them like cuz we had like versions where like it auto did its thing and it was all Dynamic and blah BL blah it's like no people want to fiddle with the windows they want to kind of mess around with stuff um so this feels like a good way of taking the Volume",
      "start": 2572.64
    },
    {
      "text": "its thing and it was all Dynamic and blah BL blah it's like no people want to fiddle with the windows they want to kind of mess around with stuff um so this feels like a good way of taking the Volume gameplay we have and kind of putting into a VR context and then doing like you know new vo it continues the story with some new characters it's it's cool so it's it's safe to I mean you're kind of experimenting with VR I think because everyone is I don't know no one knows what what going to what the future is going to hold but my assumption is that you're kind of a believer in the potential of it because I I talked to a lot of developers that you know that actually shocked me we had Steve Gainer on uh the Kinda Funny Gamescast or maybe it was GameOverGreggy show I don't know which one Gamescast and uh by the way he has like he is looking great I saw him I was Ching to him last night like he is like he's groomed very great uh you look great Steve you look great and I was shocked like he",
      "start": 2614.36
    },
    {
      "text": "and uh by the way he has like he is looking great I saw him I was Ching to him last night like he is like he's groomed very great uh you look great Steve you look great and I was shocked like he was the one where I was like I know he's going to be a believer in VR but he was actually like I don't really care and I was like cuz his games are like I was like oh Tacoma in VR would be awesome not not that it's coming to Xbox One first but but assume it would come to every other things eventually so what are you finding with your de friends like are you finding like a lot of support or kind of a lot of skepticism I think it's like well I think it's like anything it's like and it's like anything with like down the pup with your mates right like there's people who think like this is awful it's rubbish it doesn't count and like other people who like this is the future of everything and I think I fall kind of in the middle personally um but I think there's a lot of support out there there's a",
      "start": 2646.04
    },
    {
      "text": "it doesn't count and like other people who like this is the future of everything and I think I fall kind of in the middle personally um but I think there's a lot of support out there there's a lot of people I mean there's a lot of people who see as a really cool toy to play with and something interesting to me I'm a Believer in that I think it's I think it's badass I think you put it on and it just feels great and it's fresh and its own thing um but you know I also like we've not sold one yet so like there's there's a lot of unknowns on a business level so I always have to kind of balance those two parts of my brain but like no for me I think VR is magical I have all the headsets and stuff and I play with them way too much um and it's just it's it's super cool it's it it's something the I the the biggest challenge I think it has is explaining that coolness because I think if you look at a trailer you're like okay I get it's first person game okay I've played those I get this I get the",
      "start": 2683.6
    },
    {
      "text": "the the biggest challenge I think it has is explaining that coolness because I think if you look at a trailer you're like okay I get it's first person game okay I've played those I get this I get the but the um but but like conveying to people like these are going to have to be in like shopping malls and you're have to play around your friends houses and like those first VR experiences like no one's played one so it's a that's going to be a tricky problem but no I I would love to make games in VR forever and ever but we'll see how that works and also it's worth saying that there are games games that don't suit VR there are there are experiences that I want to make that you know some of the stuff we're talking about where it's like okay that I can see in VR but that would be awful that would be people would die um how about you guys like where are you both at uh I I'm a I'm a firm believer in it I I think it um I've said it many times so I'm sorry for our audience but I feel like it's",
      "start": 2725.52
    },
    {
      "text": "be people would die um how about you guys like where are you both at uh I I'm a I'm a firm believer in it I I think it um I've said it many times so I'm sorry for our audience but I feel like it's it's it's religious you know like Greg's not right Greg is more on the fence yeah Greg Greg likes it but he has more more on the fence and I don't know how you feel feel about I'm a Le adopter to everything so I mean I I just damn I I you know for me I I'm I'm I'm the the most Casual Gamer In all in all of our group obviously by far by by a huge margin so for me to actually Rectify putting that on at night would just be uh it's just too far of a stretch for me it's like everything else that really just depends on what the experience going to be what what's the game that's going to sell it for me what what what's going to be that addictive thing that I have to have but I mean it has the capacity to be as impactful to the to the industry as like say a dual anal anal to control it right like it",
      "start": 2764.72
    },
    {
      "text": "what what what's going to be that addictive thing that I have to have but I mean it has the capacity to be as impactful to the to the industry as like say a dual anal anal to control it right like it really does if the experience is there I think the price is going to really help with that like it it is a it's PL it's placed at that console level especially for early adopters like if you're if you're someone who like me went out and bought a PS4 on launch day then you might be ready for like another big Hardware investment and I think it kind of that scale makes sense I think I think the price for me like that's I think that's the perfect price for it from a like a obviously free would be amazing but like in terms of reality like I think it's definitely it suits what the what the what the device is and it's yeah they I think they've said it's it's profitable right like it's they which I didn't know until yesterday that they said that yeah which is that is amazing that unit price will",
      "start": 2804.28
    },
    {
      "text": "device is and it's yeah they I think they've said it's it's profitable right like it's they which I didn't know until yesterday that they said that yeah which is that is amazing that unit price will be profitable for them that's what they said yeah which is amazing that's what you want yeah we're we're wrapping it up we're wrapping it up Kevin we got you we got all right so let's W let's wrap things up by saying all right Thomas Was Alone's on everything you can buy that's on pretty much every console and PC too many if anything right uh Volume's on PS4 PC and Vita right that's correct and you have any Xbox One plans I guess that will come we'll talk about that later we'll see yeah um and then uh Kod will be coming up and that's PSVR only or is that Oculus as well uh that's PSVR only um and then we have our podcast which I already mentioned uh we have the Limited Run Games you should go to the website and get on the mailing list so you can buy Volume on Vita when it comes out it's I",
      "start": 2846.56
    },
    {
      "text": "um and then we have our podcast which I already mentioned uh we have the Limited Run Games you should go to the website and get on the mailing list so you can buy Volume on Vita when it comes out it's I don't think we have a specific date it'll be in the next couple of months we just need to work out the exact date but I want to mention it here because you guys might like it um and then uh and yeah just follow me on Twitter Mike Bthl and I will promise I'm I'm reasonably interesting on there I think I'm okay oh no you're you're great okay you're you're a quality Twitter user fascinating said that there it is intriguing the stuff you with Mike tell you can tell the uh the level of your humor when you play Volume and you've got that really kind of Twisted dry sense of humor which I like a lot which is good I think the English thing right I think we're 90% English the accent actually truth be told the rest of it it's just if you had an American accent you'd be boring as ****",
      "start": 2883.56
    },
    {
      "text": "I like a lot which is good I think the English thing right I think we're 90% English the accent actually truth be told the rest of it it's just if you had an American accent you'd be boring as **** completely that's fair that's fair Mike thank you for joining us you're welcome with us anytime you know that all right who's let's see Greg will be on next I think with Tim with Nina Freeman so uh we should scadaddle Gamescast episode 64 topic three we're starting it right now who is it Greg Nina Freeman she of course works right now at Fullbright she's working on Tacoma I make fun of Tacoma and Steve Gaynor a lot during this interview but we're also talking a little bit about Sabel or Cibele if you want to pronounce it correctly which I never do cuz I played the game loved the game and I call it Cibele and if Nina wanted to pronounce the correct way she probably should have just written it a normal way more importantly I'm spoiling what you're about to see but there's a moment in this where I",
      "start": 2924.84
    },
    {
      "text": "Cibele and if Nina wanted to pronounce the correct way she probably should have just written it a normal way more importantly I'm spoiling what you're about to see but there's a moment in this where I am mind blown that she's the one that created How Do You Do It yeah the hit Sensation that there's a let's play of over at YouTube.com/ KindaFunnyGames where me and Nick figure out How Do You Do It Nina's a very special game developer and I was excited to talk to her hey everybody it's me Greg this is Tim and this is Nina we're talk about our game now here's the thing out there you in this we're live obviously camera never Cuts we're going to break these up as little conversations what not so I'm going to do a fullblown intro here totally Cibele right yes I was calling it Cybel forever everyone pronounces it in different ways and I'm like wow I'm a bad game developer for naming my game something like so weird to spell and say Cibele it's because of the pizza place yes exactly that is exactly",
      "start": 2967.24
    },
    {
      "text": "pronounces it in different ways and I'm like wow I'm a bad game developer for naming my game something like so weird to spell and say Cibele it's because of the pizza place yes exactly that is exactly why I do it classic and really good you might want to reconsider making Cybo cuz people like Cyel yeah if you could get if you could get a Cybo pizza sponsorship that be that I would take what's up everybody it's me Greg this is Tim and this is Nina Freeman Nina you made a game that reached out and touched my heart this year I want you didn't know that it's called Cibele not Cibele not to be cute either any way you spell it you're going to find the game and get it and it's spelled C I B E L E I've learned to say that in everything cuz no one everyone's like I can't find it on Google and I'm like you're spelling it wrong yeah we learned the hard way too where it's was like oh you're Kinda Funny it's like no kind of spell it this way but it's still a good name it's a good name um now the fun",
      "start": 3004.64
    },
    {
      "text": "you're spelling it wrong yeah we learned the hard way too where it's was like oh you're Kinda Funny it's like no kind of spell it this way but it's still a good name it's a good name um now the fun thing is I feel like we have a connection because I've played this deeply personal game and we've tweeted a few times about it and then you know this hack I know named Steve Gaynor who doesn't put Platinum trophies in his games but we've never actually met so this is an interview where we're getting to know each other Tim of course hasn't played this game I brought Tim along because this is a game Tim should play yeah and I want him to know more about it what's more important than that is your Twitter yes I did not know that your Twitter was Hentai PhD that is my Twitter I I like that a lot I don't have a PhD in Hentai for the record so you're a liar I'm a liar I have Masters not in Hentai though I just thought it was funny and even when I started being like a real professional person I was",
      "start": 3046.72
    },
    {
      "text": "have a PhD in Hentai for the record so you're a liar I'm a liar I have Masters not in Hentai though I just thought it was funny and even when I started being like a real professional person I was like I can't change it like people are just going to have to accept me for who I am I I appreciate that a lot as someone who didn't know anything about you and then found you through I think probably Steve retweeting you and doing some stuff and then played the game and then started following I I think it all fits pretty well with who Nina Freeman is you got the hair you got the hint PhD you got this game you take sleeping bags and make them into dresses sometimes yes I love to do that I like you you're my type of person I knew I knew big fan of sleeping bags just in general as a concept like the children's sleeping bags with like you know Bell on them and stuff like that is there any other type of sleeping bag the only one that you want get my sleeping bag has spell on it too have you done a",
      "start": 3082.04
    },
    {
      "text": "children's sleeping bags with like you know Bell on them and stuff like that is there any other type of sleeping bag the only one that you want get my sleeping bag has spell on it too have you done a real Ghostbusters one yet cuz I'll send you a real Ghostbusters one if you'll do all right I'll do it um let's no let's talk about Cibele though Cibele also I made it with Star Games shout out to the team see and that's the whole thing so let's dial me back to the beginning of like how did this game come to be sure um so I guess for people who haven't played it or want to know what it is it's a game about two young people who met in an online game kind of like a World of Warcraft or something and they have this relationship and it's about how they decide to meet up to have sex um in real life um you you like this I really like this game and you play from Nina's perspective the character who is based on me that's the name um but yeah so it started as actually I made the prototype in a",
      "start": 3125.24
    },
    {
      "text": "um you you like this I really like this game and you play from Nina's perspective the character who is based on me that's the name um but yeah so it started as actually I made the prototype in a prototyping class at NYU when I was a grad student so it was originally student game which is kind of cool yeah um and then I made part of it for my Master's thesis and then continued to work on it after school um I I'm a level designer at Fullbright right now in Tacoma um and when I started working there I was kind of finishing it up and that's why Tacoma's delayed it's cuz you had to put out your own name actually I don't know I managed to finish it and do a lot of work on Tacoma all at once I just worked all the time I went a little crazy there um but it was good and I had a lot of support from them which was really nice um and yeah we made it all on weekends and at nights so that was about a year and a half of work so yeah when uh when did you graduate school and then when you graduated",
      "start": 3165.88
    },
    {
      "text": "them which was really nice um and yeah we made it all on weekends and at nights so that was about a year and a half of work so yeah when uh when did you graduate school and then when you graduated NYU did you immediately move out to work at Fullbright yep yeah I literally defended my thesis and like a week later was on a plane headed to Portland was crazy so when you say the characters based on you personality wise and stuff but is it the look does it also look like you yeah actually in the game um there's each Act there's three acts um three conversations between the two of them that sort of contextualize why and how they meet later in the game um and each of them is bookended by short films to sort of remind the player that hey this is a game about this character you play most of it in first person but it brings you out of the game to show you her and I play her so that's kind of like weird that I'm like talking about it is my game but I treat her more like a character um but she is",
      "start": 3213.88
    },
    {
      "text": "person but it brings you out of the game to show you her and I play her so that's kind of like weird that I'm like talking about it is my game but I treat her more like a character um but she is based on me and play her as well and that's the that's it's hard to wrap your head around this one and I didn't want to show it cuz it wouldn't show well or whatever but it's almost in you can correct me if I want but give me a second before you immediately slash me think of it bless you in a similar way to Her Story except we're not getting the reflection of us in the monitor like we're at the computer we turn on the computer and then we our Mouse is her Mouse and so we get to open up stuff on our desktop and see what's happening in her life that way like photos this that and the other and then double click on the game to go into the game and then play the game and click around and you're playing the game inside of her game like the game Nina in real life made but you're playing as Nina in the",
      "start": 3254.44
    },
    {
      "text": "click on the game to go into the game and then play the game and click around and you're playing the game inside of her game like the game Nina in real life made but you're playing as Nina in the game while you play that and then the conversations are happening over like a Voiceover IP deal so even though we're playing we're hearing the things we the character are saying without making any choices ourselves and so then this relationship starts to develop so it's kind of like em is way that we played sure except yeah yeah exactly talking and exactly exactly and there's no choice at all but so like the story is just playing out as we go and do all this stuff and it's this weird thing where like at the end when I was like and he broke our the spoilers but you know like how do you think this is going to end uh you know I'm having these conversations with you about the character you play in the game about the game you made but then also it's it's from your life as well right is like so",
      "start": 3294.2
    },
    {
      "text": "is going to end uh you know I'm having these conversations with you about the character you play in the game about the game you made but then also it's it's from your life as well right is like so that's what's mindboggling about the whole thing and not not to mention in this day and age and the internet and everything else and how toxic the climate can be to go tell a story this personal ripped from your real life but put into like at any point did you think maybe I shouldn't do this no so like my background I started out in poetry actually when I was in undergrad I worked in the New York poetry scene for a little while was an intern at the Poetry Project did all that stuff and in poetry it's like pretty common practice for people to draw on their personal lives and that is actually what my mentor back then Charles North sort of urged me to do and taught me in that way so for me it's been pretty natural to take that kind of stuff into games cuz it sort of I learned to write um so I",
      "start": 3332.52
    },
    {
      "text": "my mentor back then Charles North sort of urged me to do and taught me in that way so for me it's been pretty natural to take that kind of stuff into games cuz it sort of I learned to write um so I mean I guess also practice makes perfect like almost all the things I've worked on um prior to Cibele have been drawn from my own life so I've kind of gotten used to that feeling of putting myself out there but it was definitely fun like going back through my old live journals and old photos and stuff to like draw from them to put them in the game because a lot of that stuff is really like taken from actual Source material that I like did make when I was like a teen jeez Louise this is great so then the question I mean becomes like so well let's stick with the personal part of it first I guess how do you then deal with people reacting because I have to imagine as with anything on the internet people are then criticizing the choices in the game but then in a way they're criticizing you",
      "start": 3374.6
    },
    {
      "text": "how do you then deal with people reacting because I have to imagine as with anything on the internet people are then criticizing the choices in the game but then in a way they're criticizing you because you really made those choices or some version of them yeah so the way I think about it with this personal stuff is like I really treat it like a story like it is saying like a lot sorry it is based on my own life um but I kind of treat my own memories as like Source material that's like separate from me it's sort of this like m exercise that I have to do cuz I don't want these games to be like my diary I'm more like interested in the craft of it and storytelling um so you know I might not do personal games forever I just really like the storytelling aspect of it and I love telling ordinary human stories and I happen to be an ordinary person so my life is like a good source to draw on for that kind of story material so when people criticize like the character or whatever that's just",
      "start": 3416.84
    },
    {
      "text": "human stories and I happen to be an ordinary person so my life is like a good source to draw on for that kind of story material so when people criticize like the character or whatever that's just normal like I take it like any game developer would you know just like listen to what people say and take that as feedback hopefully do better next time um and I don't try not to take too personally gotcha yeah and then what about so you put this out there and not open an old wound but I mean you're talking about this personal thing was has there been any reaction from the guy is he uh we actually did chat about it was yeah yeah we hadn't talked in like years so kind of tell me all about it it's weird cuz I feel like it's gossipy but it's like I lived this and I want to know what this **** is saying story here we all love Gossip so I'm glad that my game can promote that in a way yes this is your director's cut can be the EP yeah um yeah we chatted uh it was cool I didn't know if I could get",
      "start": 3456.92
    },
    {
      "text": "story here we all love Gossip so I'm glad that my game can promote that in a way yes this is your director's cut can be the EP yeah um yeah we chatted uh it was cool I didn't know if I could get in touch with him at first because I kind of wanted to be like hey is this cool with you cuz like but also no one really knows you know I didn't put any real names in the game other than my own sure and that's a practice you know I've had to get good at that making all these personal games I don't want to make anyone uncomfortable you know um but I still still you know I have the right to tell my story so I go ahead and do it anyways um but I got to chat with him and be like hey are you chill with this like how you doing and and he was like totally okay with it so that was a very nice interaction to have and it's surprising that a game can bring that out I guess um it does so often though I think that's the thing is like we all know people that have some some story that at some point relates",
      "start": 3505.4
    },
    {
      "text": "to have and it's surprising that a game can bring that out I guess um it does so often though I think that's the thing is like we all know people that have some some story that at some point relates to we met over a game or whatever have you ever done that met people through a game mhm yeah yeah I friends like that not real life friends cuz they live far away but I've met them at events and stuff since then okay I mean that's that's enough real life and video games was the difference sure no I I I'm with you I'm with you I'm just saying like you know Her Story is a lot different than my stories okay that's all I'm saying I don't know Her Story yet I'll have to play this yeah but excellent work now how many so it's you obviously did you do everything like what how does this work for you so I W I am the designer and writer and sort of project manager and Lead um I made the original prototype and basically just asked a bunch of my friends to work on it with me cuz that's my style I just",
      "start": 3546.72
    },
    {
      "text": "I W I am the designer and writer and sort of project manager and Lead um I made the original prototype and basically just asked a bunch of my friends to work on it with me cuz that's my style I just like working with friends um on these sort of personal side projects so EMT Butler Rebecca Dunlap Dey C uh Samantha the Corey a bunch of my friends came together um they did Emma did programming Rebecca did Art Dey did music and I sort of was managing all of this and doing all the writing and sort of like putting things into the game and deciding how it would flow um so managing all of that sort of in a creative lead capacity gotcha and so then like you you put this game out you hit your date is it just Soul crushing to go into Fullbright and just like just the dates keep moving and there's no trophies in any of the game and your boss is an idiot and doesn't Steve ho hey how you doing I see you there oh wow hey how how you doing she loves working for us yeah it's true thank you hi Steve I",
      "start": 3589.32
    },
    {
      "text": "trophies in any of the game and your boss is an idiot and doesn't Steve ho hey how you doing I see you there oh wow hey how how you doing she loves working for us yeah it's true thank you hi Steve I won't ruin your tast too much you're ruining my life Steve you're ruining my life so when you're working on this game and deeply personal it's something I feel is really different you know in terms of games that I get to play and go out and do actually get sit down and play something we talk about all the time like who's doing new stuff this is new you know what I mean in terms of Storytelling thanks did you expect it to hit I mean you just want an award last night did you expect it to do what it's doing or did you just think this is something you're going to put out and that'll be the end of it yeah I didn't expect the award that's for sure that was a big honor um yeah I don't know it's interesting cuz it really did just start in school like I actually have only been making games for",
      "start": 3635.08
    },
    {
      "text": "of it yeah I didn't expect the award that's for sure that was a big honor um yeah I don't know it's interesting cuz it really did just start in school like I actually have only been making games for three or four years now um I'm relatively fresh so you're a wonder I'm I'm a little kid in terms of game developer experience years um so it's been cool to like do well and have people be excited about ordinary human stories in video games I know that more and more of that is happening these days and it feels really cool to be part of games and to be making that kind of stuff when other developers are getting really into it too it feels like there's a wave of that kind of thing right now um and I I feel good about contributing to that because it's really it's really important to me um and I just feel so great that Cibele can sort of like be Leading The Way with these kinds of games and being a part of that movement and it's hugely inspired by Gone Home um which obviously Steve heard rest of",
      "start": 3682.36
    },
    {
      "text": "feel so great that Cibele can sort of like be Leading The Way with these kinds of games and being a part of that movement and it's hugely inspired by Gone Home um which obviously Steve heard rest of right yeah what's that game um that was like the one of the main Inspirations for the game so you know I'm kind of trying to follow in their footsteps so then how does that work where you get to go work for them then yeah it's actually I don't know it was like kind of my dream job and I just met Stephen Carla at GDC like a couple years ago met him at a party we kept in touch um and actually Steve um and the rest of the team at Fullbright but particularly Steve I've been going back and forth with for a really long time before I even knew I was going to work with them about Cibele and you met him playing a a game and this game is B yeah well actually I met him cuz he came up and played the game I worked on How Do You Do It about the doll you did that you did How Do You Do It oh my God go check",
      "start": 3726.12
    },
    {
      "text": "a a game and this game is B yeah well actually I met him cuz he came up and played the game I worked on How Do You Do It about the doll you did that you did How Do You Do It oh my God go check out the let's play at YouTube.com/ KindaFunnyGames where me and Nick loved that game oh thank you so much oh yeah we had a lot of fun with that thank you're my type of person this is this is good you're my type of person I like that you like these games that's awesome very cool thank you yeah um so Steve liked that game and then I was like will you try my game Cibele and like give me feedback I loved your work um and so we sort of have had that relationship ever since it's cool it's cool to work with them now it's like really a huge honor and amazing so I have I hate doing this but it's and it's a hack need question but stick with me cuz I want to drive to the point let's do it is it getting better you're a female Game Dev we don't we always talk about that there's not enough of that is it",
      "start": 3767.88
    },
    {
      "text": "a hack need question but stick with me cuz I want to drive to the point let's do it is it getting better you're a female Game Dev we don't we always talk about that there's not enough of that is it getting more inclusive I why why are you how are you able to do it when it seems like it's such a hard thing to do yeah um it's definitely getting better I mean a lot of people are talking about it now and thinking about it um and actively doing things to change that I mean I feel really happy to be at full break cuz the company is like I think half or more than half women at this point which is amazing um you don't see that every day obviously um and for me what I've been learning lately is that you know obviously there's a lot of in culture in general there's systemic sexism in a lot of ways and that's just the reality of our lives so like how can I do my work and just sort of like live with that and help change it and I have been trying to help Mentor young women getting into games and",
      "start": 3812.4
    },
    {
      "text": "and that's just the reality of our lives so like how can I do my work and just sort of like live with that and help change it and I have been trying to help Mentor young women getting into games and doing that sort of one-on-one thing that's been good for me and also I've learned that it's really hard cuz yeah this question comes up a lot but for me that's why I hate asking but I feel like it's NE how do you how do you solve the problem without address addressing the issue and for me personally what I've learned is that you know to answer that question I just mentor and try and help other women get into it so that we don't have to keep asking that question every year and also I want to be known as a designer and not like a woman in games you know I want to be known for my work as a game developer so I think it's important I always am trying to like change the conversation around my games and trying to direct it into more about the craft rather than oh like cool a woman made a game",
      "start": 3853.28
    },
    {
      "text": "developer so I think it's important I always am trying to like change the conversation around my games and trying to direct it into more about the craft rather than oh like cool a woman made a game like I always want to be like there's more to it than that like 100% understand and I just think that working to change that conversation is really important in addition to mentoring and just being really open to new voices and one of the things I like about you is that you're is that you um I guess the way I we always talk about it right that the best part about being Kinda Funny now and being independent is that if somebody pops up in the chat and they're a dick we say get out we don't want you we don't want your money we don't want you to be a subscriber if you don't if you're not chilling whatever then **** off you know what I mean and so what I like about that is in that same vein of just like this is who we are unapologetically I feel that's who you are too like I was talking",
      "start": 3892.24
    },
    {
      "text": "whatever then **** off you know what I mean and so what I like about that is in that same vein of just like this is who we are unapologetically I feel that's who you are too like I was talking about it earlier with you know you're coming at this personal story in a time where people are very mean at times you know what I mean granted it's a very vocal minority I know that but they can be but you're in there there's this game about sex there's this game about you you're putting your these liveaction cut scenes or whatever are in some various states of undressed and there's photos and there's all these different things that like could easily be used as ammunition against you but you're like well if you want to there it is and but that's not what this is about and so by acknowledging that and putting that out there and saying this is who I am you make yourself invulnerable to it and in the same way I saw you tweet recently probably within the last month or something about the fact that",
      "start": 3930.6
    },
    {
      "text": "putting that out there and saying this is who I am you make yourself invulnerable to it and in the same way I saw you tweet recently probably within the last month or something about the fact that you were sick at uh conventions of people coming up and be like oh did you do the art for this game and you're like no **** I made this game yeah I know I do always feel really good coming back at people like that and being like I was the lead I also wrote a ton of code in this game so I did a little bit of everything and I feel really good about that good yeah and that's what it should be and that that's why I'm excited that it's not like that Kevin says there's 10 minutes left cool what do you want to do with your final 10 minutes I think you know on that topic I'm happy to have made a game that is sort of very feminine and very pink and and all that stuff cuz I don't think we see many games like that um I think of actually like Splatoon was a huge inspiration for me when that came out I",
      "start": 3967.8
    },
    {
      "text": "is sort of very feminine and very pink and and all that stuff cuz I don't think we see many games like that um I think of actually like Splatoon was a huge inspiration for me when that came out I was like not for Cil directly but just as a game developer I was like wa like look at this color palette like this is just a different look for games and I just saw it appealing to so many different kinds of people and a lot of people that don't normally play lots of games and I just feel like you know introducing more feminine games or games like Splatoon that just have cool fashion and stuff like that I think that's really amazing and I'm glad to see like a company as big as Nintendo doing something as Progressive as that it was I've been impressed by byon and that that kind of so I like seeing those different kind ofes not only from Indies but from like big developers as well and that's what's exciting you know we talk about it in waves in the fact of like you know right this last year",
      "start": 4004.44
    },
    {
      "text": "those different kind ofes not only from Indies but from like big developers as well and that's what's exciting you know we talk about it in waves in the fact of like you know right this last year right it was oh my God there's all these open World Games right which are a knee jerk reaction to three years ago this open world game Hit And so here are all these other ones and so now like I always talk about you know is our walking simulators games and I **** hate that question too or whatever they are I agree but I love that genre and I love the fact that now you know you've seen it now with Gone Home you've seen it with Firewatch which everybody has something to say about and then even with Tacoma like that will continue to go and you will see other not only developers try to tell the story that way but I mean other big developers not other just other Indies yeah exactly yeah I like seeing how like Indies can do something like like a Gone Home and you can see that sort of like",
      "start": 4047.24
    },
    {
      "text": "the story that way but I mean other big developers not other just other Indies yeah exactly yeah I like seeing how like Indies can do something like like a Gone Home and you can see that sort of like trickling through the industry and other people trying to do stuff inspired by that and it's it's cool how we can all like be in conversation with each other as game developers um I like that about making games it's good well it's I think it's you know game development and we I always talk about the Spectrum out of triple now in Indie AAA with how much money gets involved they can't afford not to have a success right whereas Indies can come out and like it's like Kinda Funny right where we put up a video and it gets 30 000 to 50 000 views I'm like yeah that's awesome because it doesn't like that's a fine number for US whereas a big site or a big YouTube Corporation whatever that'd be a huge issue for andies can take the chances find out what the audience is willing to do and then you",
      "start": 4086.84
    },
    {
      "text": "that's a fine number for US whereas a big site or a big YouTube Corporation whatever that'd be a huge issue for andies can take the chances find out what the audience is willing to do and then you can see that ref Ed somewhere else and that is what exciting of like I I'll never forget coming home and playing Cible yes and sitting there and I was a little drunk and I was like I'd heard good things and I Steve had sold me on it and I sat down and played it all one sitting at like  : in the morning and it was like this is great because this is something different it's what Colin's always talking about when he's talking about PlayStation VR or the fact that everything's on PlayStation 4 right now could be on PS3 it's not like we have this I want different experiences and I want to see different voices like that yeah also recommendation for playing Cibil like a candle and pour yourself a glass of wine that is basically how I made it I always had those two things yeah for The Full Experience",
      "start": 4123.84
    },
    {
      "text": "voices like that yeah also recommendation for playing Cibil like a candle and pour yourself a glass of wine that is basically how I made it I always had those two things yeah for The Full Experience yeah you just reminded me of that I'm glad you played it while you had had a drink it's creepier though that I had lit a candle I mean candles are great it makes smell good so then you're in a good mood and that makes a better experience it was that weekend where we went and bought all those candles remember that Kevin and I bought a bunch of candles remember that yeah we went to serab and then we went to Ikea and they had a great sale on candles I'm not a big candle guy maybe I'm just I think I'm just doing it wrong I don't know I can get down on some wine though wine I get I mean you need more than one candle you know like one candle is like candles candles yeah that's what I'm doing wrong I've only been lighting one candle so maybe maybe if I get a couple candles we'll see you get them",
      "start": 4159.6
    },
    {
      "text": "than one candle you know like one candle is like candles candles yeah that's what I'm doing wrong I've only been lighting one candle so maybe maybe if I get a couple candles we'll see you get them all mixed around the house yeah you're doing pretty good okay okay I'll try that okay good red or white for the line um red yeah nobody wants white yeah White's it's a little weird unless it's a hot day cuz White's colder yeah should be chilled should be chill it's a day drinking thing I think white wine is sure okay is your game a day a day game or a night game night game I mean it's all like about sex and a lot of it it takes place in dark rooms so it feels like maybe not totally night but like with yeah let's not limit ourselves I don't want to limit oursel to only night sex like SE should be available at any time I was wondering why you're in the bathroom so no that's the thing about the game is that it's weird cuz you think about games and setting a scene and doing all these different",
      "start": 4199.84
    },
    {
      "text": "available at any time I was wondering why you're in the bathroom so no that's the thing about the game is that it's weird cuz you think about games and setting a scene and doing all these different things and you think about okay well The Last Of Us in beautiful Vistas and this that and the other whereas your game is staring at a computer monitor but being there I wanted to play it in the dark po dimly lit cuz like I'm envisioning how and characters are in college for part of it or the whole thing or just part of it a while the whole thing yeah great but I remember when I would play games in college right and I was hunched over my little desk sitting there do it and talking about other people and it is supposed to be like your sitting there embodying nah as you're playing it so you're like her sitting in the chair at your computer clicking around it's kind of like the game tries to connect your hands to her hands basically um which is it's funny like her story also does that like a",
      "start": 4243.0
    },
    {
      "text": "her sitting in the chair at your computer clicking around it's kind of like the game tries to connect your hands to her hands basically um which is it's funny like her story also does that like a lot of these desk people are calling them desktop simulators guess oh my God is that a thing now too I think that's a thing now and I actually kind of love it I like that lot me is away sure but I'm but you understand don't don't take the it's okay if we grab it and we adopt it but people use walking simulator say it's not a game it's walking thr it out there I I'm taking it back walking are awesome desktop simulators desktop simulators any simulator we're always talking about the Kinda Funny game that could be it yeah it's just a desktop simulator where you go to excel you go to an Excel grid and you fill in metadata oh no and then you make the you make the you make Photoshop thumbs and we like you get a percentage on how great it is up the vibrancy on all the thumbnails that's how you",
      "start": 4280.36
    },
    {
      "text": "and you fill in metadata oh no and then you make the you make the you make Photoshop thumbs and we like you get a percentage on how great it is up the vibrancy on all the thumbnails that's how you gain maximum points you go to Google to search like whatever it's about if it's about we're doing a video about Oreos you put in Oreos and then hit and then you only get 50% of the points but if you put in sexy Oreos as Tim would hit search you get all the points it works it I like this anyway we're taking it back do you want to make this do you want this to be your next game you want to make the kind of fun it's not worth it trust me so that that is a a good jumping off point so Cibil's out Sible is out you can get it now it's been out forever how long has it been out uh I ran into it you know a few months it came out like in February I can't even remember anymore it's all a blur but yeah um a couple months ago you're hard at work on Tacoma with the Steve Gainer guy and I'm sure he's not",
      "start": 4320.4
    },
    {
      "text": "a few months it came out like in February I can't even remember anymore it's all a blur but yeah um a couple months ago you're hard at work on Tacoma with the Steve Gainer guy and I'm sure he's not just leading you off into The Ether this game that'll never come out uh do you are you do you start working on another one on your own like how how do you balance your time um right now I'm totally focused on Tacoma and and doing my level design work there um but you know I find making games fun and I like do it on the weekend sometimes like a game Jam or something like that sure I recently was commissioned for this event in No Quarter um in New York City or called No Quarter um and I made a game for that actually while we were finishing Civil up which was crazy I don't know why I did that to myself but hopefully we'll release it at some point in the future it's an eight player car combat dating Sim racing game Jesus **** Christ I love you walking simulator yeah well like I wanted so you",
      "start": 4361.0
    },
    {
      "text": "but hopefully we'll release it at some point in the future it's an eight player car combat dating Sim racing game Jesus **** Christ I love you walking simulator yeah well like I wanted so you know when you make a game like Syble people it's easy for people to expect you to make more games like that in the future and sometimes that's really cool if you're iterating on on an idea that you're really passionate about but I like you know going and doing something totally different just to keep myself feeling freshh um um so I was like I'm going to make a racing game and like just see how that works and it's still kind of about like it's about sexiling your roommates basically so it still got that narrative TST sexing yeah like what's sexling you know when you live with people and you're like going on a date and you want to take your date home but like you don't want to like be doing it while your roommates are in the room so you got to lock them out I'm making a note of this this is",
      "start": 4405.76
    },
    {
      "text": "like going on a date and you want to take your date home but like you don't want to like be doing it while your roommates are in the room so you got to lock them out I'm making a note of this this is great sex ising sex ising is the best that needs to be a love and sex St topic yeah um oh yeah I have I have two questions you might have already answered but I want make sure that that that I hit on them so what award did you win Noovo what's that mean um it is category for games that basically don't fit neatly into the other categories so often like more experimental leaning games games that are doing stuff that's like really different um so that's pretty cool I'm excited to be considered someone doing something very different it's awesome that's great and the second thing is why is it called Cil so the name of the game is actually the name of my real avatar from when I was was playing Final Fantasy online which is sort of when I had this experience in my actual life so shout outs to",
      "start": 4447.36
    },
    {
      "text": "Cil so the name of the game is actually the name of my real avatar from when I was was playing Final Fantasy online which is sort of when I had this experience in my actual life so shout outs to the Sil server Final Fantasy online that's where I played um and my character was called Syble um and I actually stole that name from a girl I really admired in high school it was her AIM username awesome and this is the spelling she used and she pronounced it syil and I've been using it as my handle in online games ever since that's awesome and now there's a game yeah now there's a game about it that's awesome very cool Nina yes thank you so much for coming by C's available now everyone go get it follow her on Twitter hint iphd look forward to Coma soon did I plug everything yeah uh Cil is at Cil game.com um and there's trailer cool trailer for Tacoma at Tacoma dame.com there you can check those out okay until next time it's been a pleasure to serve you bye oh hi oh **** I talked over your",
      "start": 4486.76
    },
    {
      "text": "game.com um and there's trailer cool trailer for Tacoma at Tacoma dame.com there you can check those out okay until next time it's been a pleasure to serve you bye oh hi oh **** I talked over your Ohio it's okay you can do that there's no **** rules Greg this G we don't even we're making this up as we go topic four but it's on the topic Four's days usually on topic three days CU this is a super sized episode of games this is a weird weird world that we're living in Steve Gainor is back he was on the Gamescast a couple weeks ago but now you have new questions for him except you don't cuz you weren't on this one I wasn't maybe you were no I think I was I'm pretty sure I was on this one you know what in fact you were cuz I think Nick tapped out at the last second right that's what it was he terrified he saw Steve come in he got all scared of him Steve Gner of course ladies and gentlemen founder of Fullbright made Gone Home now working on Tacoma we give him a lot of **** in this",
      "start": 4535.48
    },
    {
      "text": "he terrified he saw Steve come in he got all scared of him Steve Gner of course ladies and gentlemen founder of Fullbright made Gone Home now working on Tacoma we give him a lot of **** in this interview for two reasons number one he delayed Tacoma that I'm not upset about number two he didn't put a platinum trophy and Gone Home so right now well I'm going to finish a sentence or two then you're going to hit pause on this and you're going to Tweet at Steve Gainer I love you Steve Gainer and he's at Fullbright I love you at Fullbright on Twitter even though you didn't put a platinum in Gone Home don't make this a thing it's too late once it's said is a thing I love you at fbite even though you didn't put a platinum in Gone Home home period xoxo Gossip Girl parenthesis Greg at game over gregy period I mean Greg Miller and I'm sure going to run out characters trending gamer  015 trending gamer  015 South by Southwest most entertaining online personality of  016 toys to life ambassador",
      "start": 4576.04
    },
    {
      "text": "period I mean Greg Miller and I'm sure going to run out characters trending gamer  015 trending gamer  015 South by Southwest most entertaining online personality of  016 toys to life ambassador of the year  016 you might want to just write all this on your phone and notepad screen cap that and tweet that at full bright leave a couple leave a couple blanks like underlined spaces cuz we know Greg is going to keep winning more **** that's true I'm going to keep winning more Awards Kevin thanks no more 911s minorities are good that's my presidential thing if you don't watch I guess if you don't watch Conor Greg live out of context that seems kind of weird to be fair I left out the part where even in context it is weird I left out the part about burning people alive don't do that I thought we were done with that in call the interview Steve Gainer what's up everybody it's me Greg Miller That's that's Steve G from fbite we are here on youtube.com/ ofun games to talk to Steve see what's",
      "start": 4618.36
    },
    {
      "text": "we were done with that in call the interview Steve Gainer what's up everybody it's me Greg Miller That's that's Steve G from fbite we are here on youtube.com/ ofun games to talk to Steve see what's happening see I was pretty that was two Millers in the room for a second but before we do that we're start Lightning Reaction game of the year now are you familiar with Lightning Reaction game I feel like I'm about to enter hell you ready to play I don't want to play this again I know you don't want to but that's not how that's not that's not how Lightning Reaction works all right so you want I'm going to hit the button I'm pretty sure this is going to lead to our life oh I'm going to hit the button it's going to this button I'm going to hit it's going to turn red and creepy song when the song stops it'll turn green you want to buzz in on your thing and be the first person to buzz in if you are not the first person to buzz in you will be penalized if you buzz in early you are penalized okay",
      "start": 4663.36
    },
    {
      "text": "it'll turn green you want to buzz in on your thing and be the first person to buzz in if you are not the first person to buzz in you will be penalized if you buzz in early you are penalized okay penalized so wait sry this thing turns green yeah you'll see it okay Greg always wins not always most of the time damn it I hate this game I **** hate it God **** damn it I lost that you got in my head saying I always win nice try GRE thank  you I will say the batteries on this are going because that shock wasn't nearly as bad as the first time they did it where my entire arm went numb for about a half an hour holy **** do we have more batteries Kev Kevin's on it don't worry well I shouldn't have said anything no you shouldn't have you screwed that one did both of you guys get shocked yeah oh everyone who doesn't win gets shocked there can only ever be one winner well there you go fix that guy up for me please since when then it'll just one on we'll One V one Nick see he can get F",
      "start": 4703.12
    },
    {
      "text": "yeah oh everyone who doesn't win gets shocked there can only ever be one winner well there you go fix that guy up for me please since when then it'll just one on we'll One V one Nick see he can get F whatever youtube.com/ kindof funny games there you go you nailed it Tacoma hey everybody the game that's never coming out before we get into that I I told you this earlier off camera but I want to say it again I actually finally got a chance to sit down and play Gone Home and it **** blew me away and I loved it and I was like I'm I just I can't I just wanted to thank you for making that game it was really really fun if anyone out there has not played it I can go get it it is great you have no excuse anymore no excuse yeah unless you respect trophies shots fired for Kev I know if I can get Kev I get I get the audience yeah cuz like uh had you you hadn't played it cuz you you don't play PC games as much no yeah that's that's why so when it came to PS4 I was oh okay I'll give this a shot",
      "start": 4756.44
    },
    {
      "text": "Kev I get I get the audience yeah cuz like uh had you you hadn't played it cuz you you don't play PC games as much no yeah that's that's why so when it came to PS4 I was oh okay I'll give this a shot so yeah if you if you've heard of it or whatever and you haven't got a chance to play it it's on Xbox and PS4 now so yeah give it a shot thank thank you so much for taking the time to to check it out I'm really glad you like absolutely pleasure I don't think we've ever really talked about it we haven't no I know that you liked it yeah but did you go in not knowing anything zero so so what did you think for the first part of the game I think I think that means that you empirically don't watch Greg's content oh no he no no I mean I knew I knew enough about it to know kind of I don't want to spoil it for people who haven't played out in the audience but seriously if you haven't played it yet **** you I don't know how many times I got to talk about this game I'm buying this game for kids",
      "start": 4802.4
    },
    {
      "text": "it for people who haven't played out in the audience but seriously if you haven't played it yet **** you I don't know how many times I got to talk about this game I'm buying this game for kids come on I clearly I like it I mean everybody's Christmas GI that was the one did you see when I broke this kid's heart on Twitter this one one of our fans tweeted at me and he was like uh I see Gone Homes on PS I I tweeted out the Gone Homes on PS4 and I yeah and he's like I see it's on there is it worth my time and I'm like no I've just been talking about it for three years cuz it's piece of garbage and he deleted his Twitter and then it became a whole thing no yeah well that's what he gets um no I knew I knew sort of the rough like character dynamics of it what it was what it was going to be based off of but going into it I was like w this has a at first I'm like this is a really kind of kooky not kooky spooky Jack Tripper um no I didn't really know what to make of it but the ambience that",
      "start": 4840.32
    },
    {
      "text": "off of but going into it I was like w this has a at first I'm like this is a really kind of kooky not kooky spooky Jack Tripper um no I didn't really know what to make of it but the ambience that it sets right right off the bat and the tone that it sets is really awesome and then you kind it kind of draws you into the mystery of what's happening at first I'm like okay is this going to be a mystery or I thought this more about the relationship Dynamics between these two people um and then you just get sucked in and then by the end of it it really is just a nice like I don't want to say payoff because that's that seems like the wrong term for it sure yeah it's just a nice sort of you you just feel oh God end of Journey it is it's a Bittersweet end of the journey it's very Bittersweet um and it was and it was cool and I actually went I went uh I think I played it and then was like wait a minute no I got to I got it wait what like that the ending kind of like it kind of had such an impact",
      "start": 4879.44
    },
    {
      "text": "it was and it was cool and I actually went I went uh I think I played it and then was like wait a minute no I got to I got it wait what like that the ending kind of like it kind of had such an impact on me that I'm like I'm gonna I'm gonna go back and do it again I kind of went back and like I can change this I can change this if I get to the room faster because I I wasn't paying attention at the beginning to some of the things that you find in the the front room that you come in I'm going to restart this and and uh I think it actually if I remember correctly it resets you and I kind of went back to the yeah you go back main men main menu kind of went back um so it was cool just to kind of just to kind of tie that in I was like oh this is such good really it's good writing when you look at it because a lot of the setup was there for you and you don't get that until it comes full circle and all those threads come together at the end which that's the thing I admire most about it was I",
      "start": 4920.04
    },
    {
      "text": "at it because a lot of the setup was there for you and you don't get that until it comes full circle and all those threads come together at the end which that's the thing I admire most about it was I was like God I it's like Gaynor like he he weaved a good tail that was the funny thing and I don't think we' talked about this about when I went back and did the playthrough on PlayStation 4 that was my first time playing it again since PC it was one of those games the first time I finished it I was like that was my story and that's awesome right but I remember and it kind of sounds funny it kind of feels like when you go back to like your elementary school and you're like I remember these desks being so much bigger when I went back and was playing it this time knowing everything like I remember there being so much clutter of so many things I picked up that didn't matter when in reality everything I pick up in that game matters but in the beginning on my PC play through I had no idea I",
      "start": 4958.12
    },
    {
      "text": "there being so much clutter of so many things I picked up that didn't matter when in reality everything I pick up in that game matters but in the beginning on my PC play through I had no idea I remember you know I remember picking up the photo of Lani and just like whatever this isn't what am I looking for you know what I mean you put it all down and then to play through it again you're like oh **** right like from the beginning you've been telling me all these things yeah I you know the game is the same like it's the same stuff in it every time you play it's not like randomized or anything but I I don't think I've ever talked to anybody who played it more than once and didn't like discover new things the second time they play either because they just missed it the first time or because they're like oh I didn't realize that that like had a connection to something and it's cool to hear people you know kind of like go back through with some for knowledge and and get what the",
      "start": 4991.36
    },
    {
      "text": "because they're like oh I didn't realize that that like had a connection to something and it's cool to hear people you know kind of like go back through with some for knowledge and and get what the implications are so yeah thanks for playing through it for the second time in three years no problem it's a pleasure have play through it now I'm going to rock Tacoma yeah I beat the **** out of that game when it comes out cuz now I know what to expect yeah yeah yeah you're going to overanalyze everything Tacoma looking around doing everything talk to us about Tacoma all right you you delayed it this week and I'm giving you joshing I don't I don't mind take your time with it make it great yeah how hard of a well it's because I mean so okay I'm just going to you're going to put there no I mean we came talked to you guys it's going to take us a while to get that platinum trophy in thank we couldn't do it this year with that and I was like I was like we we're going to ship I was like we're",
      "start": 5026.0
    },
    {
      "text": "we came talked to you guys it's going to take us a while to get that platinum trophy in thank we couldn't do it this year with that and I was like I was like we we're going to ship I was like we're going to ship it  2016 we can't get the Platinum I'm going to sh and then I was like but Greg will be so sad yep if you can hold off and get it I mean you can push it to  2019 if you get on the PlayStation V I'm just you you do whatever you need to do to make that happen well cuz the thing is we're launching on Xbox so like figuring out how to get a platinum trophy on Xbox is like like hard but we're going to be the first we're going to be the first to do it somehow it they're talking about connecting the networks so it could just be that all of a sudden you ping you got it you figured out you did the way to do it uh yeah no we we were uh we basically you know we were showing it last year uh came around and and showed the the stuff we were working on and between then and now you know we had",
      "start": 5061.88
    },
    {
      "text": "the way to do it uh yeah no we we were uh we basically you know we were showing it last year uh came around and and showed the the stuff we were working on and between then and now you know we had people that we know play it we had you know people in the press play it and there were things that we were like okay pushed what we're doing you know this far and if we just take that and be like okay well that's the game let's just finish it it was like pointing towards the stuff we really wanted to talk about but wasn't really addressing it fully you know what I mean it was sort like we got it as far as we did and we were like okay we're doing this like Aug reality stuff we're doing like stuff with gravity what do we like now it's clear this is actually what's important about it and we need to figure out how to like like push further on like what you do as a player and how the game works to support like actually what we're trying to say about those things and not just have it be like our",
      "start": 5101.36
    },
    {
      "text": "figure out how to like like push further on like what you do as a player and how the game works to support like actually what we're trying to say about those things and not just have it be like our first idea for what we what we're going to put on screen and so like that mean you know it's the kind of thing where it's like if we had been at a point where we like oh our first idea is good enough just finish it yeah um that would have been great uh you're not it's rarely the case game Mak isn't you're not always lucky enough to have that so we gave it the time it needed to be like what are we really doing with like these augmented reality scenes and how you relate to them etc etc and now we're at a point where we're like this is the thing that the this is the this is what the game is wants to be like what it's trying what it's trying to get us to make and now we're making it and we got to make the rest of it so yep spring  2017 what I what I what I liked about your announcement and maybe",
      "start": 5150.36
    },
    {
      "text": "be like what it's trying what it's trying to get us to make and now we're making it and we got to make the rest of it so yep spring  2017 what I what I what I liked about your announcement and maybe I was just reading between the lines too much and you can correct me if I'm wrong but was you talked about the fact that yeah you you know shared it with friends and other devs and whatever and they had played it and you want you took the feedback and we going this way with it and what I loved about about that statement is that it's the snapshot that you can compare to Gone Home because you talked about it in your interview with me over on youtube.com/ ofun games oh uh where you said that I was like when did you know you had something with Gone Home and you're like well we sent it out to our friends and devs and they all wanted more yeah and so to see that now not that this is like up that see that you now get the opposite reaction or not maybe the opposite of like **** this game I don't",
      "start": 5189.36
    },
    {
      "text": "and devs and they all wanted more yeah and so to see that now not that this is like up that see that you now get the opposite reaction or not maybe the opposite of like **** this game I don't want to play but you know there was something there on those play tests where you're like well now I know that I I want to pump the brakes yeah I mean there's a there's a certain point where you know some of it is is we had a lot of very um you know positive like public reaction when we put stuff out and like that's and that's awesome but there were also points like yeah so so we had we had developers and stuff that play tested and gave us feedback you know oneon-one but also when we took the game around um depress and showed it to them you know we we them have hands- on time with it they played it and then afterwards you know we did like an interview kind of thing and like a few different people played it and then like one of their first questions was like so uh you know what what do you guys",
      "start": 5225.44
    },
    {
      "text": "and then afterwards you know we did like an interview kind of thing and like a few different people played it and then like one of their first questions was like so uh you know what what do you guys uh want to do to really differentiate what you're doing from Gone Home and I'm like you shouldn't be asking tell if that's what you're wondering then like we aren't pushing ourselves hard enough you know what I mean and so the good thing is I think that when we take what we're working on now get it polished up to a point where where we can you know take it out into the light of day I think when people put their hands on it they will not be thinking about well how is this different it'll be like this is a different thing and let's talk about that you know what I mean so um we're excited about it uh going to be showing more of it later this year let people get hands on it give everyone the elevator pitch for it cuz we haven't done that we're being we're just walking all over uh hey everyone",
      "start": 5265.12
    },
    {
      "text": "uh going to be showing more of it later this year let people get hands on it give everyone the elevator pitch for it cuz we haven't done that we're being we're just walking all over uh hey everyone hey everybody you ever heard of this video game Tacoma um point it your little your there you go we gave those away in the prize bin last year thank you so much no problem um so uh Tacoma is a first person story exploration game that set on a space station um so it's set in the year  2088 and you are a character that is sent to this space station basically to do a job like a very like sort of like just kind of do your job don't worry about what's going on here and as you explore this station you're finding these uh kind of digital records of things that happened to the crew before you got there and you as the player are able to interact with them move through the timeline of what happened in these different parts of the Station Move Yourself through it and connect all these threads to",
      "start": 5308.32
    },
    {
      "text": "there and you as the player are able to interact with them move through the timeline of what happened in these different parts of the Station Move Yourself through it and connect all these threads to effectively you know rebuild a picture of like oh so this is what led to the station being the way it is this is why I was sent here this is what's really going on under the surface um and that's a big part of of what the two of the biggest things we pushed on were last time we showed the game the whole station was Zero Gravity but you used magnetic boots to walk around and you could like transfer between surfaces and stuff and like that's theoretically cool uh and and and it's cool to do and everything but um the a it requires really big spaces for that to be cool and like really big huge spaces are not actually great for like making Gone Home kind of like yeah and like the the density it's just like that's a lot of floor space and then the other part of it is like as we played it we're",
      "start": 5354.16
    },
    {
      "text": "are not actually great for like making Gone Home kind of like yeah and like the the density it's just like that's a lot of floor space and then the other part of it is like as we played it we're like it's a cool idea but like it doesn't really talk about what it would be like to be in a situation like this or how this thing would probably be built you know what I mean cuz that people have to live for like years at a time I mean you know they they're they get like Shore leave or whatever but we're like this doesn't we want the player to feel like oh I I feel like I'm on a space station I feel like I'm I'm I'm like gravity in ways that I can understand is like relevant here so one of the big things that we did is we rebuilt the station to be more of like a um  2001 style Central Hub that's full zg just like float you're you're just free floating around this zg and then you transfer out to the arms to the habitable wings and you're in like Earth gravity and so there's this real contrast",
      "start": 5402.52
    },
    {
      "text": "full zg just like float you're you're just free floating around this zg and then you transfer out to the arms to the habitable wings and you're in like Earth gravity and so there's this real contrast between like oh I like it makes it tangible that you're like I can feel how this station is constructed I'm in the middle and I'm floating and now I'm walking and I can contrast like maybe this is kind of like what it would be like to be on a facility like this and like I am living that through the through the character and then the other side of it is yeah when we were showing stuff last time we had those AR scenes the figures that you know that that were recording um but for the most part they were a pretty localized you know sort of like here's a little scene and B you didn't really you're an observer like you know you're still an observer you're not like whatever there's not one character who looks over and like why is he here you're like what yeah you're not like talking to them and",
      "start": 5445.4
    },
    {
      "text": "an observer like you know you're still an observer you're not like whatever there's not one character who looks over and like why is he here you're like what yeah you're not like talking to them and doing you know any changing what happens but we have pushed ourselves further to make those scenes much more like kind of uh robust in terms of there's more characters involved in a single scene and you as the player cuz the cool thing is so like sorry part of the the what we were pushing ourselves towards was like we're in a futuristic setting right so like how does this futuristic technology actually affect like what I do as the player and what my relationship to the game is and so at some point we were like these are digital recordings of what happened to these characters why like why don't we just let the player have control over like Fast Forward rewind oh I think I missed something I'm going to pull it back and pause and I'm going to walk over here okay these two things are happening",
      "start": 5489.52
    },
    {
      "text": "we just let the player have control over like Fast Forward rewind oh I think I missed something I'm going to pull it back and pause and I'm going to walk over here okay these two things are happening at the same time unpause and like give you the tools to really pull all those threads together instead of just like okay I'm it's cool that I'm watching like a visual audio diary but that's all that's happening it's like no this is like in dialogue with how this technology might work and and what your involvement with it would be so anyway that's the that's the elevator pitch we just went about uh 800 stories no I mean that's what gets me so excited about is when you were talking about that fast forward rewind when you were on the one-on-one interview before with me where even right now like are you playing The Division I haven't gotten to play it yet in The Division you'll walk through and you'll find Echo locations and you Echo and then it's around you but it's like it's very localized",
      "start": 5536.48
    },
    {
      "text": "are you playing The Division I haven't gotten to play it yet in The Division you'll walk through and you'll find Echo locations and you Echo and then it's around you but it's like it's very localized and it's not moving you know what I mean and that's like I always talk about it when I think when I've mentioned it to you or other people who are that fans of like it's similar to the one of the favorite I thought the underutilized part of Arkham Knight of rebuilding a crime scene and playing it back again super small I I can't wait to be there and be listening to this conversation and notice somebody walks away and be like all right cool play the conversation out stop rewind play it and then just follow that dude where does he go what does he up and we have the you know people have have told us that there these really satisfying moments where it's sort of cuz like you know it basically the scenes are still localized to a part of the station so you're like okay when I'm in this area this",
      "start": 5577.12
    },
    {
      "text": "us that there these really satisfying moments where it's sort of cuz like you know it basically the scenes are still localized to a part of the station so you're like okay when I'm in this area this is what was going on here that has kind of like a snapshot of a thing that happened there um but it's still like branching enough that yeah you're like okay I'm following these people we got here I watched the rest of the scene I'm going to pull it back and follow those people and like that moment where you follow them back and you just realize like they're sabotaging the space station they're putting rats into the vents that is I mean the the rat vent moment that's a little bit of a spoiler Greg I think you're kind I was I was looking forward to that moment again you know now I know that there is a rat now we're just going to have to change the rat vent thing oh sorry I didn't mean does that mean you get rid of my map no that means we had another year on the schedule thanks sorry well get",
      "start": 5613.8
    },
    {
      "text": "is a rat now we're just going to have to change the rat vent thing oh sorry I didn't mean does that mean you get rid of my map no that means we had another year on the schedule thanks sorry well get to but you know yeah those moments of like being like Oh I okay I'm back at that point these things have like Recon converged and like just having that kind of like light bulb moment it's it's really cool to see so uh you know still a ways to go but we're excited about the stuff that's been going on in the background sure what is Kevin Love I don't know what are you eating over there Kevin got into some of the morios no Cheetos they hot Cheetos are they flaming hot they don't have that here just talking Mike these are really good though I haven't had like regular Cheetos in a long time yeah you guys want some cuz you only eat hot Cheetos exclusively oh yeah he does only eat hot Cheetos did you see that article the other day about the invention of Hot Cheetos and the guy who did it no it",
      "start": 5654.76
    },
    {
      "text": "you guys want some cuz you only eat hot Cheetos exclusively oh yeah he does only eat hot Cheetos did you see that article the other day about the invention of Hot Cheetos and the guy who did it no it was a really inspiring thing where the the they at the corporation whatever he the like CEO put out like everybody's part of this team you're all part we're all collaborative here and you know we I want ideas and stuff and d d and I'm going to get some of this wrong I believe he was just a maintenance worker or whatever and they they **** up Cheetos that day and they had Cheetos that had none of the powder on them they made too many they were so he took them home and put them down and then he had like a hot sauce there and he put some spice on them and it was really good and so he brought him in like he put together a presentation and he got a suit and like they **** did it and took the idea and like used it and ran with you find gold like that yeah it behooves you to actually take",
      "start": 5695.16
    },
    {
      "text": "him in like he put together a presentation and he got a suit and like they **** did it and took the idea and like used it and ran with you find gold like that yeah it behooves you to actually take the idea yeah I'm waiting for Kevin to come up with the idea for Kinda Funny soon I hope that that guy got to got to benefit from that aside from a shout out he got an article an article all the Flaming Hot Cheetos he could eat in article about him did you you've watched The Wire no I haven't the Showtime show uh HBO H yeah you've watch it yeah so there's the whole thing in the first uh okay hey what are you doing watch it and then yeah the whole thing in the first Supergirl episodes aren't going to watch themselves they won't I know about that uh there's a there's that conversation in the first season where he's talking about the guy that invented chicken nuggets Mr nugget is like stuck down to the base do you remember this it's one of the one of the guys on the corner is basically uh",
      "start": 5729.68
    },
    {
      "text": "first season where he's talking about the guy that invented chicken nuggets Mr nugget is like stuck down to the base do you remember this it's one of the one of the guys on the corner is basically uh it's um D'Angelo I think yeah yeah is uh is saying like there's a conversation where they're eating chicken nuggets and one of the the kids is like ah whoever made whoever invented these must be rich and the guy's like no that's somebody who works in the basement of McDonald's he came up with them they're like nice work come up with something else Mr nugget so I hope that guy actually is not just Mr nuget in the basement he's not just like okay I guess I'll go back and keep back to me the maintenance guy thanks guys that's cool though I mean that's that is awesome that is was somebody who wasn't like I'm a food scientist how do we maximize exactly it's weird that I think that everyone that works at the Cheetos Factory wears like a white coat but then it's always pissed off when",
      "start": 5773.48
    },
    {
      "text": "who wasn't like I'm a food scientist how do we maximize exactly it's weird that I think that everyone that works at the Cheetos Factory wears like a white coat but then it's always pissed off when they get the Cheetos dust yeah cuz Kevin's lifting up his filthy little paw covered in Cheetos dust right now and then he slams it on his pants on his white pants where did you get those all white skinny jeans I licked my fingers first great I'm glad I touch here's the next thing I'm going to toss out yeah you get sick a lot Kevin yeah I don't get sick a lot are you sick right now were you sick last two weeko I was S I was sick last week last week no yeah it was last week do you do a lot of licking your fingers then touching your pants then licking your fingers again certainly do he likes to also touch like park benches and bus benches and just pretty much anything he get little hands on I was walking I was walking back to the place I'm staying last night and I was on Valencia Street and uh",
      "start": 5814.08
    },
    {
      "text": "touch like park benches and bus benches and just pretty much anything he get little hands on I was walking I was walking back to the place I'm staying last night and I was on Valencia Street and uh I dropped something and it rolled like like you know just like off to the side or whatever and I got down like I crouched down to like find it and I just I had that moment where I like I put my hands down I was like I just put both my hands on all of Valencia Street sidewalk okay I am not touching I'm going to the closest place that has soap and water right now bad idea bad idea but if you live through it you become stronger exactly it's great for your immune system it is it was I it took me one Comic-Con it was like my second Comic-Con I think for IGN where I woke up and like couldn't speak and my throat and I was like never again and ever since then any once you leave the house at a convention like your hands are biards so I just realized so I'm I I did a thing just now so I said I dropped",
      "start": 5857.4
    },
    {
      "text": "my throat and I was like never again and ever since then any once you leave the house at a convention like your hands are biards so I just realized so I'm I I did a thing just now so I said I dropped something I was looking for it I thought I saw a rat run under a car and I wanted to see if it was really there I I I said the the fake part cuz I was self-conscious and I was like no I was you're in a safe place kind of I thought I saw a rat and I wanted to see if it was under there that was actually why I touch the only reason why I wouldn't do that and I'm I'm with you on that I have a more of a curiosity of like Critters as well but I have that fear of like the '80s movies fear when you the thing and it just goes your face and then you lose an eye like Night of the Creeps it like jumps out of the dog's mouth into your mouth it jumps out of the dog's mouth into your mouth night the creeps remember Night of the Creeps you got watch the creeps this movie it's a movie where it's like",
      "start": 5903.4
    },
    {
      "text": "out of the dog's mouth into your mouth it jumps out of the dog's mouth into your mouth night the creeps remember Night of the Creeps you got watch the creeps this movie it's a movie where it's like Body Snatchers kind of thing where these aliens crash whatever and they all look like was a Rottweiler was that the dog no it was a super small dog it's it's all these little worm wormy alien creatures they like they take over they jump into your your mouth and then breed inside you and then eventually you explode but they also can spit out at people and get in their mouths or whatever and so at the end it looks like they beat them all and like the girl like who the guy saved or whatever like no one's watching out of the Creeps I'm not ruining this movie she oh you survived what potillo it goes and shoots it into her mouth and the credits roll it's also where that great line the guy opens the the blinds and he goes good news girls your your dates are here bad news they're dead",
      "start": 5942.96
    },
    {
      "text": "and shoots it into her mouth and the credits roll it's also where that great line the guy opens the the blinds and he goes good news girls your your dates are here bad news they're dead actually remember that yeah that's funny that sounds like a good movie yeah Tacoma sounds like a good game see how I brought it all back around but that sounded like an extreme ice bur like you were just like that sound did no I thought was I was like up like that's how I would like showes no you were like Night of the Creeps and I was like that sounds like a good movie and you're like well Tacoma sounds like a good game oh I think was a really good game you know that I I I know I'm fan boy number one brother how many of your fans got walls full of arts and crap at home probably one or two but you're like the best thank you we had Max Landis over the other day for a podcast you know this guy writer director okay uh and he he was talking about Firewatch he just played Firewatch he was",
      "start": 5980.64
    },
    {
      "text": "but you're like the best thank you we had Max Landis over the other day for a podcast you know this guy writer director okay uh and he he was talking about Firewatch he just played Firewatch he was disappointed in Firewatch and I was like well Firewatch is one of these games it's a lot like this game Gone Home and you need to play G yeah I haven't played G home you got to play Gone Home you got to play Gone Home and he looks at the wall he's like oh yeah Gone Home he's like what is this other thing from like nothing don't worry nobody say I was like nobody say anything so he knows kind of but he doesn't know yeah right I think I asked you for a code that I then gave to him oh really nice there you go all right I'm doing it I'm doing God's workout the word the gospel one code at a time exactly exactly exactly I I saw a movie um oh my God it's I Ghostbusters Ghostbusters Ghostbusters man Ste Superman one no Superman I I I think that it's I think the title is Return of the Living Dead",
      "start": 6025.16
    },
    {
      "text": "exactly exactly I I saw a movie um oh my God it's I Ghostbusters Ghostbusters Ghostbusters man Ste Superman one no Superman I I I think that it's I think the title is Return of the Living Dead I'm oh **** yes Return Of Living Dead you me and Michael Rosen mom love this movie yes yeah so you know all the **** do you want a party it's party time yeah they just play that song over and over again like this the only song you could afford yeah no I mean that's as far as like Night of the Creeps just made me think about like movies that are like so here's so Return To Living Dead yeah I didn't know about it I A friend of mine brought it over and we watched it last Halloween do you know about it no I mean I've heard them talk about it this is one that's not a Romero film right exactly so they took a totally different direction it's like a kind of like punk rock like it reminds me of like Repo Man with zombies okay um and it was written and directed by the writer of alien the first",
      "start": 6058.28
    },
    {
      "text": "so they took a totally different direction it's like a kind of like punk rock like it reminds me of like Repo Man with zombies okay um and it was written and directed by the writer of alien the first Alien um and it's it it it's a crazy movie it's good it's really trashy but actually good like like it's like in the first 10 minutes there's one of the female characters just like likes to take all her clothes off and she's naked for most of the movie it's like it's like it's not a classy the nc7 they had to give her a pasty for her vagina really yeah well I mean so she looks like a Kendal little bit you know um and so uh but but yeah written by I know wrap it up shut up Kevin written by the by the writer of Alien uh and and you can kind of feel it because like so that movie was the movie that established that zombies want brains like it was the first movie where zombies were like brains and then it became a thing and it's because like the weird thing is you can really feel it cu",
      "start": 6102.36
    },
    {
      "text": "that established that zombies want brains like it was the first movie where zombies were like brains and then it became a thing and it's because like the weird thing is you can really feel it cu the whole movie is about like the plot of the movie is based around like basically going through the steps of how a zombie works and how it becomes a zombie and then what it wants after it's a zombie and like and like oh yeah Alien was about the cycle of how does this alien work and What stages does it go through and then you see it in this movie but it's also this weird ridiculous punk rock like you know midnight movie kind of like movie everybody go watch it the soundtrack is **** good it's it's a weird movie and it's totally totally worth watching yeah probably like Tacoma will be totally worth playing when it comes out this spring right next spring well oh I guess it is still this spring you know what I mean I'm I'm thinking already so far ahead 2017 you're wishing no I'm thinking that",
      "start": 6151.28
    },
    {
      "text": "playing when it comes out this spring right next spring well oh I guess it is still this spring you know what I mean I'm I'm thinking already so far ahead 2017 you're wishing no I'm thinking that I'm thinking that we're already in Spring it's already popping here when it comes out next year it's March a year from now Steve Gaynor is going to be back here we'll be talking about this game we'll be saying it'll be out in the fall that's that's the spoilers now that's just being a hater it's just being a realist about game development Steve thank you for coming by absolutely thank you it's always great be in here I'll shake your hand as well thanks everybody thank you fun so Greg we're rounding out our Kinda Funny Gamescast adventures you know just for tradition as always the final topic brought to you by the Kinda Funny forums go to kindafunny.com gamescast topic leave topic we'll get to it eventually we didn't do that for this one but I felt the need to to put that in there today",
      "start": 6193.72
    },
    {
      "text": "to you by the Kinda Funny forums go to kindafunny.com gamescast topic leave topic we'll get to it eventually we didn't do that for this one but I felt the need to to put that in there today we're talking to one Donald Mustard correct that was I yes it was it was it was Callin I was going to roll with it cuz I was roll with things man if I could just be frank with you ladies and gentlemen Tim's very tired cuz Tim's been busting his ass for this company I'm ass buster on a business deal that I cannot talk about right now because it won't be live in time for when this goes live on Patreon but oh yeah it will but oh right cuz this is next week because the Rooster Teeth stuff Tim's living his dream and getting us to work with the Rooster Teeth and so it's **** awesome but it's a lot of emails and a lot of him staying up late and him talking to this there and not showering so my hair does this thing exactly and there's this one like disgusting fan Tim has to keep",
      "start": 6235.64
    },
    {
      "text": "but it's a lot of emails and a lot of him staying up late and him talking to this there and not showering so my hair does this thing exactly and there's this one like disgusting fan Tim has to keep working with named Andy Cortez who's just you mean Andy Cortez fromer I do mean Andy Cortez from who keeps making us awesome shirt designs that we keep selling that we're selling right now over on our brand new store at kindof funny.com store but it's not on the Rooster Teeth site so shipping is really quick so Donald Mustard Donald Mustard ladies and gentlemen chair which means Shadow Complex which means Shadow Complex which he has entirely laid out and they have a block for but they've never done anything with and we talked about that it means Infinity Blade and now it means Shadow Complex remastered and it means that J. J. Abrams joint he's working on we talk about that basically if you don't know Donald Mustard and chair this is one of the oggs in the industry one of the coolest dudes one of",
      "start": 6276.44
    },
    {
      "text": "and it means that J. J. Abrams joint he's working on we talk about that basically if you don't know Donald Mustard and chair this is one of the oggs in the industry one of the coolest dudes one of the most important people going so we had to get him in here yeah if you don't know Donald Mustard now it's time to catch up I **** hate you sorry God damn it Tim what's up everybody welcome to your very special Kinda Funny Games Cast here on youtube.com/kindafunnygames time for one of our segments with the one and only Donald Mustard from chair how are you I'm so good how are you guys I'm excellent yes it's Colin and I here to talk to you about this now Colin is here because this man loves Shadow Complex and I love him oh there you go that works out great that's why I came very symbiotic uh today as of our recording Shadow Complex remastered out on Xbox One yep it came out a few hours ago on Xbox One you can go get it right now congratulations yeah great job when's it coming to",
      "start": 6314.56
    },
    {
      "text": "uh today as of our recording Shadow Complex remastered out on Xbox One yep it came out a few hours ago on Xbox One you can go get it right now congratulations yeah great job when's it coming to Playstation 4 so it is coming to Playstation 4 and Steam in May okay I don't know the exact day yet but as of this morning like we just like I just got an email a few minutes ago saying that we're at ZBR which means we have zero bugs like we're ready to submit it inert so it will definitely be in May awesome congratulations on that how big is that I mean when you look back at chair and lineage and like I think right now so many people know you for Infinity Blade right but then I feel like there's so many console Gamers who know you guys for Shadow Complex like what does Shadow Complex mean to you now oh man that's a good qu so I mean I I desperately love Shadow Complex I mean for me it was um and and for the whole team like this was it it was not that all of our games aren't but this was an",
      "start": 6355.0
    },
    {
      "text": "now oh man that's a good qu so I mean I I desperately love Shadow Complex I mean for me it was um and and for the whole team like this was it it was not that all of our games aren't but this was an absolute labor of love for us and especially when you know when we set out to make Shadow Complex um there just weren't there weren't not not only were there not a lot of Sid scrollers being made but there was absolutely not you know a nonlinear Metroid esque SES scrollers being made at all and you know anyone we talk to about they like you're crazy if you're not a first-person shooter or like a cover-based thirdd person action game like you're done and we're like no I we just really believe that if we make it they will come right there will be an audience for this type of a game and it's just been so immensely satisfying to to to just not only make that game but to have have it win you know like over 50 game in the Year Awards and be so critically acclaimed but also just sell to so many",
      "start": 6397.12
    },
    {
      "text": "been so immensely satisfying to to to just not only make that game but to have have it win you know like over 50 game in the Year Awards and be so critically acclaimed but also just sell to so many people like there there's a huge audience for those kind of games and I think you know for made Infinity Blade we'll get to that eventually you left it behind you hung it out to dry you never made a sequel I hear you got Maps worth though you got everything planned out out you just got to sit out no it's okay but for Shadow Complex I mean like to think back to when that came out when it came out on Xbox 360 that was still when downloadable games were like looked down upon and it was it's pretty good for a downloadable game and like oh we'll do these games of the year but we'll do download XB game of the year and stuff like that like no and it was interesting because I I hadn't I hadn't really Revisited Shadow Complex at all since until we started redoing this and I actually went back and",
      "start": 6444.6
    },
    {
      "text": "game of the year and stuff like that like no and it was interesting because I I hadn't I hadn't really Revisited Shadow Complex at all since until we started redoing this and I actually went back and read some of the reviews and it was interesting like it was almost this theme through the reviews like it's weird because I I feel like I have to give this game a nine or 9.5 but I almost I almost think it should be a $60 retail I I don't understand this game it doesn't I don't it doesn't fit into this category that we've we've presupposed a digital title should be and it's so crazy to even think that nowadays like that there's this weird line between downloadable or not and and I yeah I I hope that Shadow Complex played at least a small part and kind of changing the Viewpoint of what a game should even be classified as I think it did I mean col you agree yeah absolutely I mean I Shadow comic is still my favorite Xbox 360 game um and thematically it's fantastic uh obviously the gaml is",
      "start": 6485.56
    },
    {
      "text": "should even be classified as I think it did I mean col you agree yeah absolutely I mean I Shadow comic is still my favorite Xbox 360 game um and thematically it's fantastic uh obviously the gaml is fantastic I mean you guys kind of you made Infinity Blade and obviously this game must have been by volume and by Revenue a much even bigger success than than Shadow Complex which of course changed maybe the direction of where chair was going but I it surprised me now that we're seven years or so removed from Shadow Complex you guys really haven't made a sequel to it it's it's almost for a lot of Shadow Complex fans out there like me it's it's almost frustrating because because the game clearly was a huge hit um and I think warranted a sequel so and there has always been rumors that you guys wanted to do it or you know had ideas about it but like where is your head at now are you kind of putting out the remastered versions of the Shadow Complex to kind of see is that is that interest still",
      "start": 6527.16
    },
    {
      "text": "to do it or you know had ideas about it but like where is your head at now are you kind of putting out the remastered versions of the Shadow Complex to kind of see is that is that interest still there is it latent um I mean I wouldn't say that that's not one of the reasons why we're doing yeah no I mean that's definitely part of it I mean we we loved making Shadow Complex and the truth is so in in we we did you know intense study of what we thought made the Metroid games work so well and some of the Castlevania games work so well and you know could we could we put our own spin on that but really kind of find the vibe of and the soul of what made those things work and to me by the end of making Shadow Complex was when I'm like all right I know actually know how to make one of these games like now I could actually go make a really good one and so for me shadow complex was like you know our warmup like and then you just shut it all down and push no like we really know how to do it and we",
      "start": 6566.84
    },
    {
      "text": "now I could actually go make a really good one and so for me shadow complex was like you know our warmup like and then you just shut it all down and push no like we really know how to do it and we did we immediately went into devel in Shadow Complex 2 and we worked on that for about 9 months um Greg's not wrong and we did we did we we laid out we had the we have the whole game designed on paper um we even yeah I mean we blocked the whole game in and and BSP just think of it as like just like rough like gray box everything and yeah I mean we can you know I've I can play through Shadow Complex 2 not in not with all the AI and it's not beautiful at all it say blocks but you can play through the whole thing from start to finish and it's amazing like it it is probably one of the best things I think that we've designed um but as we were doing that you know Steve Jobs called and and said hey do you want to do this little thing and we're like oh yeah we'll paish alic for a little bit and go",
      "start": 6607.6
    },
    {
      "text": "think that we've designed um but as we were doing that you know Steve Jobs called and and said hey do you want to do this little thing and we're like oh yeah we'll paish alic for a little bit and go do this thing with Apple that became Infinity Blade and yeah it became just this this huge thing and I again we love Infinity Blade like I think there's some of the Innovations we were able to bring to mobile and the design space there that are so Innovative and we've been so fortunate to be successful there um but yeah I mean we really want to get back to Shadow Comx if it warrants it and so um if you want more Shadow Comx you know get the remas REM see if you guys tell us you want it you know I don't know if I'm just furious right now or really happy that shlex exists and you can play it and it's been just sitting there it's not and it's not just that I mean there's there's massive amounts of work to do but the rough shell of it yeah I mean is it's pretty awesome thematically I mean do",
      "start": 6653.28
    },
    {
      "text": "it's been just sitting there it's not and it's not just that I mean there's there's massive amounts of work to do but the rough shell of it yeah I mean is it's pretty awesome thematically I mean do you guys have you know I know that you know there were some controversy with Orson Scott Card kind of you know being uh evolved with a dee or whatever with the story of the original um would you want to revisit that kind of Empire based um uh story and like continue that or would he still be involved or would you well so one of the awesome things about sh comics and maybe maybe this isn't clear to everyone it was actually written by Peter David oh okay yeah and so why was theover why was there controversy around around that then so when we so not that I agree with the controver so no I I think this interview is over no I mean it's just the way things get communicated and whatever but um no we I love working with great storytellers that's why we love working with like J. J. Abrs just I'm",
      "start": 6697.08
    },
    {
      "text": "this interview is over no I mean it's just the way things get communicated and whatever but um no we I love working with great storytellers that's why we love working with like J. J. Abrams just I'm always interested in finding great Partners to work with and I I was you know a huge fan of Peter David and his work uh on on all sorts of comic books Supergirl yeah no yes super but specifically like I loved his early work on Wolverine in the early 90s for any of you that you know want to go look up some of that stuff or you know whatever like some awesome stuff and so when the opportunity came up that we're like oh man we could get like someone like a Peter David to write with us that'd be amazing so we he was amazing and we convinced him to work with us on the script and he wrote Shadow Complex and he wrote Shadow Complex too like that script the script's done um and while that was happening Orson Scott C you know we we knew Orson Scott Card and he was like Hey i' would love to write a book",
      "start": 6740.64
    },
    {
      "text": "and he wrote Shadow Complex too like that script the script's done um and while that was happening Orson Scott C you know we we knew Orson Scott Card and he was like Hey i' would love to write a book in your universe so he licensed the rights from us so it went the other way around it's the other way around we own Shadows he licensed it from us he wrote a book and there you go but and the book is Empire right the book is Empire because I read Empire yep um but yeah it was it was based on our universe not the other way around that's interesting oh so okay so that's where the controversy stems from as well so okay so so the story is also written by this gentleman for shadow complex 2 and is just sitting there along with the the kind of the shell of the game as well it's just kind of enticing stuff yep Peter David's awesome Peter David's awesome you should read his Supergirl run you should read his Young Justice run tell Youk yeah tell Youk I mean yeah no it Colin hates Comics because he",
      "start": 6787.08
    },
    {
      "text": "stuff yep Peter David's awesome Peter David's awesome you should read his Supergirl run you should read his Young Justice run tell Youk yeah tell Youk I mean yeah no it Colin hates Comics because he sucks and he even made Aquaman cool like he made Aquaman cool somehow like it's crazy I know that Peter David's awesome that was ever a thing stop talking don't worry about that well this is I mean that's so exciting to know because I I I know that you know Infinity Blade seemed to be an amazing distraction for your studio and it and it vaulted you guys into this that's not a distraction I mean we bled for that I that was I'm I'm not saying I'm saying I'm saying from Shadow Complex specifically and so that's a great direction for you guys to go it's not like you guys were struggling doing you know having to do contract work or figure out how you're going to make ends me I know that that was a great direction for you guys to go and you choose that path 100 out of 100 times it's just great",
      "start": 6826.56
    },
    {
      "text": "know having to do contract work or figure out how you're going to make ends me I know that that was a great direction for you guys to go and you choose that path 100 out of 100 times it's just great to know um it was great to see you at at the game awards talking about you know sh com because it really is a game that I adore and uh you know I I would like to think there are hundreds of thousands of us there are out there you'll see them come out in droves I'm sure that's what's got to be so exciting about the remasters is putting it out and getting it to Playstation audience getting it to the PC audience yeah I mean and again with any I mean even with the work you guys do I mean we I I our our intent is to bring delight and to bring joy to people in their lives right and if if the work we make can even Delight or entertain you at all like that's amazing to us and so the opportunity to bring that to more people is all we really want and so it's so awesome to be bringing it to",
      "start": 6868.68
    },
    {
      "text": "work we make can even Delight or entertain you at all like that's amazing to us and so the opportunity to bring that to more people is all we really want and so it's so awesome to be bringing it to Playstation and Xbox One and PC like it's a dream come true now should call out you've given us five codes for Shadow Complex remastered on Xbox One and we're going to do it like we did with those Indie developers last night so right now twitter.com Shadow Complex has 737 followers if we can get it to 1,00 we'll give away all five that way it'll be one by one by one by one and so this is interesting because we actually just started at Shadow Complex on Twitter surprised you got it because because here's how crazy it is when Shadow comic came out in 2009 Twitter wasn't even really a thing so they didn't have Twitter accounts so so this is like a whole new thing for sh how the hell did you even get that did you have to buy that off of someone or said no one take sh or did some or did you have",
      "start": 6904.44
    },
    {
      "text": "didn't have Twitter accounts so so this is like a whole new thing for sh how the hell did you even get that did you have to buy that off of someone or said no one take sh or did some or did you have a Savvy person just sit on it for five years you know I don't even ask how things come back you know I don't want to know how the sausage gets made I just want to get there and have it there um so in terms of the Cher's timeline we've started talking about Infinity Blade I mean when Steve Jobs calls was that a hard Vision to WP your on where you guys like h like it's a cool opportunity but do we care is this going to work does mobile and Touch Gaming matter well it was interesting because uh I mean because we just want to make great stuff and while we were you know we were working on sh o it was amazing but I found myself personally like earlier that year Mass Effect 2 had come out which is one of my favorite games of the last generation and while I was playing through Mass Effect",
      "start": 6951.16
    },
    {
      "text": "o it was amazing but I found myself personally like earlier that year Mass Effect had come out which is one of my favorite games of the last generation and while I was playing through Mass Effect I was sitting on my couch one day watching a football game and I'm like oh my gosh I actually have some time right now I could go play a game and I'm like oh I could go upstairs and play Mass Effect or I was like or I could play you know I could play Field Runners on my phone it was this those little like tower defense game and I picked field like I in my own brain like I'm like I'm going to play Field Runners I'm going to play that instead of Mass Effect and it was like this crazy moment for me I'm like what have I just done like what have I become what what's wrong with me you know but but this little light went off in my head where I'm like Oh my goodness like this mobile stuff is going to be a thing you know it's going to be a big deal and so there was a part of not just my brain but",
      "start": 6993.12
    },
    {
      "text": "this little light went off in my head where I'm like Oh my goodness like this mobile stuff is going to be a thing you know it's going to be a big deal and so there was a part of not just my brain but everyone at Chair we started switching our brain a little going hm if mobile if mobile what would we do and so that was like kind of already happening um so when Apple called and when Steve Jobs was like Hey I actually have this new thing that is pretty powerful I think it can run 3D it can run Unreal like do you guys want to try and do something together um it wasn't that hard for us to say I mean was like because again initially we're like you know is it worth pausing Shadow Complex for three or four months to do try in this little thing and we're like yeah a few months let's let's let's see what's the future is going to be and we had no idea like we had no idea that Infinity Blade was going to become so huge that mobile was going to become so huge we just kind of were in the right",
      "start": 7037.2
    },
    {
      "text": "see what's the future is going to be and we had no idea like we had no idea that Infinity Blade was going to become so huge that mobile was going to become so huge we just kind of were in the right place at the right time how how was that introduction made I mean how did Apple come upon you know do you have a personal relationship with people there or did someone kind of send you send I mean so Chair part of Epic so we're part of Epic Games which makes uh Unreal Engine technology and at the time it was Unreal Engine 3 and we had a a little part of the engine team secretly working on getting Unreal Engine working on mobile and they had got like a little version spun up on an earlier version of Apple hardware and I think some of the Apple folks had seen that and so they knew that was happening and so they knew our technology was I mean Unreal Engine technology is incredible right it Powers such amazing games and so that I think is how some of the early relationship formed and and then",
      "start": 7075.84
    },
    {
      "text": "and so they knew our technology was I mean Unreal Engine technology is incredible right it Powers such amazing games and so that I think is how some of the early relationship formed and and then you know Steve right he he wanted he need it's not just technology that shows off it's it's a you know something visual to show that and and so I think that's where um we got we got invited to participate in that yeah it's amazing yeah that's that's the right men for the right and women for the right job I guess MH uh Shadow Complex Twitter the push has begun you've crossed 800 are closing in at 900 so the first winner of Shadow Comp remastered is from the twitch chat by the random number generator and it's Panzer so when I get the codes I will send them to you and you'll have it on Xbox one nice so as Infinity Blade keeps going What's happen who's talking over the codes are sent to your email thank you very much Kevin you're a good guy Kevin snappy dresser too thank you infinity Blade's",
      "start": 7119.84
    },
    {
      "text": "nice so as Infinity Blade keeps going What's happen who's talking over the codes are sent to your email thank you very much Kevin you're a good guy Kevin snappy dresser too thank you infinity Blade's going you guys see so much success with it was that was that just the no-brainer to keep going there and continue to you know indefinitely pause Shadow Complex to no I mean like uh you know as you've probably seen right like we don't just immedi like yeah let's just make a sequel It's not really our thing no I mean it to me it's more about is is there more that we feel like we need to say design wise in a genre and and it was I mean truthfully when we finished Shadow Complex we're like there now we've learned how to do this we have more to say there's more there's Innovation we think we could bring here with Infinity Blade we in a lot of ways had kind of invented this new genre right there just I mean now there's you know hundreds if not thousands of Infinity Blade like games in the world",
      "start": 7167.88
    },
    {
      "text": "bring here with Infinity Blade we in a lot of ways had kind of invented this new genre right there just I mean now there's you know hundreds if not thousands of Infinity Blade like games in the world but at the time there was nothing like that and so at the end of Infin Blade one it took off so huge and and even for us we like this is just the cusp of what we think a mobile game could be of what the design relationships could be like of what we could even say in this space and and it did I mean we very much felt obligated to flesh out this genre that we had kind of invented in some ways and so it required and again for us even though it had an Infin one a two and a three on it for us it was more it was the same code base we just we basically worked on that for two and a half years you know from the beginning of Infin Blade to the end of Infin Blade 3 and it took us that amount of time to fully Express that design and so to me what Infinity Blade 3 is now is the full representation of",
      "start": 7214.52
    },
    {
      "text": "from the beginning of Infin Blade to the end of Infin Blade 3 and it took us that amount of time to fully Express that design and so to me what Infinity Blade 3 is now is the full representation of what we thought a full featured AAA Mobile game could look like um and we're done now like for me I'm like I have fulfilled what we think we need that to be and now we could move on and we moved on to Spy Jinx but yeah you know yeah you move on to something else called Spy Jinx because we had this awesome crazy idea and had explain the idea to everybody I'll tell you later I'm not going to tell you yet tell everybody R it right now you've already it's already been leaked JJ's been talking about it left and right oh yeah well if JJ saying no no no we're not ready no we had again we just we had this really what we thought was a cool idea for a new intellectual property and a new game and uh and we'll talk more about it soon but we've been working on it uh for a while it's it's gon to be",
      "start": 7260.64
    },
    {
      "text": "had this really what we thought was a cool idea for a new intellectual property and a new game and uh and we'll talk more about it soon but we've been working on it uh for a while it's it's gon to be really cool but how does the collaboration then with J.J. Abrams come to be um because you get a call from Steve Jobs does this time does Abrams call you or you calling Abrams no no no no so so again it kind of all feeds together right so um JJ is a fan of Apple products right and so he I think happened to be watching some of the keynote stuff and and I happen to be on stage with Steve Jobs being like look at Infinity Blade and whatever and and then Infinity Blade comes out and it's you know it gets like a 10 from IGN and it's like winning all these Awards and and I think JJ at that time is like oh you know he he he was aware of us the real thing that happened though was his son started playing Infinity Blade and his son is like super into it and yet would get to these bosses that he",
      "start": 7304.84
    },
    {
      "text": "is like oh you know he he he was aware of us the real thing that happened though was his son started playing Infinity Blade and his son is like super into it and yet would get to these bosses that he couldn't beat so he' be like Dad you got to beat and so JJ had to get good at Infinity BL right but then he started getting into the story and he started seeing it so that was kind of happening and then on the side of that like I'm a huge JJ Abrams fan right and and again like part of our thing at Chair is you know when we identify people that we really respect like a Peter David or Brandon Sanderson we're like we got to work with these people and forever we're like we got to work with the JJ we got to just meet him and mostly so I can just be like asking him all my loss questions sure of course right and that's really what it was it was like I have like a whole like notebook of like man you and college get coffee after this and so and so and so yeah there it came an opportunity where",
      "start": 7352.36
    },
    {
      "text": "course right and that's really what it was it was like I have like a whole like notebook of like man you and college get coffee after this and so and so and so yeah there it came an opportunity where through Apple we were able to get kind of introduced and um and I really thought it was going to be that just like I could meet him I could bow down and I could be like I love you and then that would be it right but we we got talking and you know what was supposed to be like a 15 0 minute say hi thing turned into three or four hours and by the end of it um we were like we have to work together and so kind of went from there amazing we're so lucky uh I'm curious about you know we have you only for a few more minutes and it's more I guess an Infinity Blade related question but how do you feel I don't want to say you're you know like you helped Pioneer a specific Niche and a very respected and hardcore core Niche on mobile gaming um but we've been very critical of mobile gaming as it seems",
      "start": 7395.28
    },
    {
      "text": "I don't want to say you're you know like you helped Pioneer a specific Niche and a very respected and hardcore core Niche on mobile gaming um but we've been very critical of mobile gaming as it seems like only 1% of 1% of games even are relevant everything else kind of falls to the ways side as a race to the bottom in terms of pricing the landscape seems to have changed a great deal since you released Infinity Blade for sure how do you feel about mobile as a platform now because it seems like for most developers unless you are what a game of war whatever these commercials you seeb whatever like you're kind of have no prayer like you see thousands of these guys just going out of business you know one two three person Studios making these games so how do you feel about the way it's evolved now do you think it's like a positive place to still be for games today I think it depends on the game right I mean uh it's definitely it's definitely hard I mean I think we're and I think it's I",
      "start": 7440.56
    },
    {
      "text": "now do you think it's like a positive place to still be for games today I think it depends on the game right I mean uh it's definitely it's definitely hard I mean I think we're and I think it's I think you can see it in its most I'll use the word pure it's most pure form on mobile but I kind of think that's indicative of the whole industry right now where um making a game is very very hard but the tools to make games and the platforms that games are available on have just become so wide that there there's just there's millions of people making games right now there's probably hundreds of thousands of games or least a year and if you looked at like across all platforms the ones that make it it's it's a very small number it's not just mobile right on console on PC on Steam like very few of the games actually get released yeah like become viable commercial products and and so it's a it's it's an interesting time I'm interested to see like how over the next few years all of us kind of",
      "start": 7477.76
    },
    {
      "text": "of the games actually get released yeah like become viable commercial products and and so it's a it's it's an interesting time I'm interested to see like how over the next few years all of us kind of navigate this um again I think mobile is it's in it you see it in it's most you know pure uh capitalistic you know kind of expression um but I do think I mean as a designer you have to look at different business models and I I look at free to play as a business model I I look at that and I go I think there are ways and I think they're starting to see games now games like Hearthstone and games like even like Supercell's new game Clash Royale and stuff that that are like actually really really really good games they have a really smart design there's really good gameplay inherent in them and I think they're finding ways to to make money on those games that isn't exploit you know that that is a clear like value to players and so I think there's so much design Innovation that can come",
      "start": 7522.76
    },
    {
      "text": "and I think they're finding ways to to make money on those games that isn't exploit you know that that is a clear like value to players and so I think there's so much design Innovation that can come through that business model if we're more smart about it but um I don't know it's it's we're in an interesting time period right now saturation right it is it's interesting so we'll see I don't know what do you guys think I mean I I don't know to me it's I stay away from it because I just I feel like and we've talked about even PSN I mean Steam's already kind of think gone on the other side of the the Paradigm now where I think it's getting too flooded with just there's no quality control like I don't I think there's any shame in having you know I think that there's a subjective nature to reviewing games for 95% of it but there is a 5% objective is this game even worth anyone's time does it run is does it have a you know is is it decent is is someone going to feel like they're ripped off",
      "start": 7570.6
    },
    {
      "text": "games for 95% of it but there is a 5% objective is this game even worth anyone's time does it run is does it have a you know is is it decent is is someone going to feel like they're ripped off when they and I just feel like there's not enough of that even on Console now you're seeing on PSN when we read the blog every week I'm like did you read are half these games even relevant are these read the description of these games yeah like even 30 million PS4s out there are these half these games even selling 10000 copies like is it even worth yeah exactly are you are you flooding the PSN and making the good stuff harder to find I think that that's unfortunately bleeding into the console space so I think it's actually the mobile kind of infection as it war with that kind of race to the bottom is starting to infect everything um I think that's a negative kind of thing personally I don't know if I'd blame mobile for it as much as I just blame the tools becoming more and more access seems",
      "start": 7611.48
    },
    {
      "text": "is starting to infect everything um I think that's a negative kind of thing personally I don't know if I'd blame mobile for it as much as I just blame the tools becoming more and more access seems like that to me I think it's just the tools are so ubiquitous now that it's just it's you figure mobile was the first one that was the a huge shift right when it was like for $99 you are developing for Apple like what okay and then that's when you got all these weird games and now with PSN or and how you know you the ability to make something in unity and put it on Steam put it to Xbox and put it to PlayStation yeah no I I mean from again the capitalistic Viewpoint it makes perfect sense to proliferate all I'm wondering is if the stakeholders need to have a little bit more control because it makes it lowers the value of PSN it lower I feel like PSN is more powerful on the PS4 in terms of the games that are there but I feel like the PSN actually quality-wise was way better on PS3 like on an",
      "start": 7648.56
    },
    {
      "text": "it lowers the value of PSN it lower I feel like PSN is more powerful on the PS4 in terms of the games that are there but I feel like the PSN actually quality-wise was way better on PS3 like on an average basis well and I think again like if this is getting way boring we can just change the subject but think yeah like the technology the technology curve of like how again not like making a game as easy by any means again which is why the huge quality disparity it's not easy to make a good quality product right but the curve of being able to make that and then the curve of user experience from a store standpoint I don't know that any of the people that designed the storefronts in any of the platforms we have have I don't even have the opportunity to Think Through like how do you service hundreds of thousands of things in a way that can actually be organized and sorted like the stores are just behind the technology and it's going to take some time for people to figure it out it's not this",
      "start": 7683.8
    },
    {
      "text": "of thousands of things in a way that can actually be organized and sorted like the stores are just behind the technology and it's going to take some time for people to figure it out it's not this is easy stuff to solve no of course not I promise there's probably people out there who are very motivated to like solve it so that the good stuff the cream can rise right yeah exactly it's it to me it's and it's probably such a simplistic and ignorant way of looking at it from my point of view but like could PlayStation for instance have just a number of people 0 people that are just like these are the games that are inert right now like would any of you even buy this like like is it worth you know because they they really lose Nothing by putting the game up getting a 30% rip on the game I mean I understand them but at the same time say you know three games start with uh you know PES or something when you're searching for it and it's like well maybe we can knock that down to two to make to",
      "start": 7727.24
    },
    {
      "text": "I understand them but at the same time say you know three games start with uh you know PES or something when you're searching for it and it's like well maybe we can knock that down to two to make to to you know like soone some someone's using the the slider to search the games are actually worth a damn yeah come up and they're not hidden and then maybe that increases our sales in other words a very convoluted way of looking at it and I don't know if it's accurate I don't know if anyone would even agree but I just wonder if less is more and I'm seeing that with you know with obviously mobile is tens and tens and tens of thousands of games on there but like are more than a thousand of them even you know fun and so I wonder like is you know it seems like the consumer suffers ultimately and that's why the race to the bottom to not pay anything then hurts all the developers but that's that's a philosophical I'm confident we'll solve it right like I mean that's if of course it's going to",
      "start": 7767.48
    },
    {
      "text": "that's why the race to the bottom to not pay anything then hurts all the developers but that's that's a philosophical I'm confident we'll solve it right like I mean that's if of course it's going to get solved everyone is motivated to solve that right I hope so yeah I think you're right you're way smarter than I am so no you would it's true it's true I know him and I know you it's 100% true Donald thank you for coming through we got Shadow Complex on Twitter up another 100 followers you're at a little over 900 right now so we'll give away another code this one going to patreon user Kevin not our Kevin it's not you Kevin it's a different Kevin another Kevin has won a code for the Xbox One version of Shadow Complex remastered which is coming to PC and PS4 in May yeah so it's on Xbox one today uh PS4 in Steam in May and then also we started to Hint it I know I didn't tell you much about Spy Jinx but Spy Jinx we are starting to if you go to spy jinx.com we're starting to take people",
      "start": 7802.04
    },
    {
      "text": "today uh PS4 in Steam in May and then also we started to Hint it I know I didn't tell you much about Spy Jinx but Spy Jinx we are starting to if you go to spy jinx.com we're starting to take people registering for a beta that we will be announcing at some point and that we will be telling you more about the game you know a few months from now and it's going to be crazy awesome soes if you want to go check it out check it out and For the Love of All That is Holy by Shadow Complex we want sh it's pretty much all done he could easily just ship all these documents to Blueo or somebody and they would just do it buy it yeah that totally works and makes it totally awesome and refined and it's exactly what you want ship it off to a third party they'll do it for you you'll find some Kevin will do it for you just send it to Kevin it would be amazing I'm sure yeah Donald thank you so much for coming by have a great GC man all right thanks guys good to see you yep whoa Greg that was a",
      "start": 7845.16
    },
    {
      "text": "will do it for you just send it to Kevin it would be amazing I'm sure yeah Donald thank you so much for coming by have a great GC man all right thanks guys good to see you yep whoa Greg that was a fascinating interview it was I don't want to lie I'm pretty good at this you are you're really good at this I just keep you know I like just being I like being the second fiddle I like just being there and having someone actually know what they're doing and I can just kind of say like stupid **** every once in a while I like you being I like you being my second fiddle because I'm not going to name names I've had a a broken out ofune fiddle for a long time now and he's right a lot though but I mean broken fiddle's right twice a day it's like you didn't I'm playing the fiddle oh you didn't you didn't thank me in your award it's like all right buddy you know I just I don't see you thanking me all the time in your tweets he's pretty good at tweets he is that second want some really headyy",
      "start": 7886.64
    },
    {
      "text": "didn't thank me in your award it's like all right buddy you know I just I don't see you thanking me all the time in your tweets he's pretty good at tweets he is that second want some really headyy tweets that are about like the Republican party it's great I guess Colin Islanders it's like I'm I keep I'm sub you know I keep walking this taco joint expecting tacos and he just keeps giving me reron and I'm like this doesn't make any sense I **** love reron that's a San Francisco tree you grew up on it out here are you aware that for real like that's when you talk to the rest of the country about San Francisco the place you're from and now that I've been here for 9 years my place too mhm you talk to anybody else it's reron they talk about and then it's about it the gay that's all all anyone and the golden gay bridge but nobody talks about that really I mean they talk about that's not the Talk of the Town you're telling me people are sing around the street corners like hey what's up with",
      "start": 7926.24
    },
    {
      "text": "and the golden gay bridge but nobody talks about that really I mean they talk about that's not the Talk of the Town you're telling me people are sing around the street corners like hey what's up with that reron and the gays but not they're not talking about our beautiful Bridge our big beautiful bridge I I they talk enough about it but like one yeah it's not is no it's really all about reron and then how Progressive we are I'm going to be real about this yeah I love the city that I'm from yeah City by the way last yesterday I saw a picture on the internet where where it was one of those before and after and it was like 10 years ago this cop stopped this guy from jumping off the bridge yeah and this is him 10 years later and it was like the cop seeing for the first time in 10 years and the guy has like two two kids now and he's like has a great ass life and stuff and I was like hell yeah I'm taking credit for this for some reason Pride I'm from Chicago and if somebody if you're about",
      "start": 7968.6
    },
    {
      "text": "guy has like two two kids now and he's like has a great ass life and stuff and I was like hell yeah I'm taking credit for this for some reason Pride I'm from Chicago and if somebody if you're about to jump off a bridge in Chicago the cops push you they're like we don't have time for this we have to get to Portillos and we're really upset about the Bears holy **** it's a depressing well ladies and gentlemen this has been the first ever episode 64 of the Kinda Funny Games Cast join us on our you know WrestleMania there's The Road to WrestleMania yeah with the Kinda Funny Games Cast we are on the road to episode 69 we're on the way are you going to have anything up your sleeve for 69 I haven't planned it yet it out is it no who knows when it's happening so I'm saying something will happen now probably won't but at the very least I can promise you I'll be really excited when I say it you scared me cuz we had a moment there where I thought our minds were in perfect sync cuz I was",
      "start": 8008.0
    },
    {
      "text": "happen now probably won't but at the very least I can promise you I'll be really excited when I say it you scared me cuz we had a moment there where I thought our minds were in perfect sync cuz I was literally thinking right before you started talking and I was finishing up my thing about how cool it would be if the mics hung like this like we were in rings and then you're like you started talking about WrestleMania and I was like oh my God are we becoming one right now Kevin get on it until next time I love you for episode 69 I want I want it like this all right that that would make sense actually I like it I thought that these are going up as one stitch together podcast so **** you Kevin that's my outro and if you need one **** Kevin Coello tweet at him at Kinda Funny Kevin and tell him **** you so Kevin future Kevin not real Kevin now I'm sorry future Kevin that I did this to you there you go all right **** you future Kevin not dead that'd be sad if future Kevin but I",
      "start": 8046.52
    },
    {
      "text": "tell him **** you so Kevin future Kevin not real Kevin now I'm sorry future Kevin that I did this to you there you go all right **** you future Kevin not dead that'd be sad if future Kevin but I mean future Kevin wouldn't be watching this I hope everything's great I hope Paula didn't dump you future Kevin I hope you have both hands still future Kevin future future Kevin she's not gonna dump you I hope you got a new belt by now future Kevin yeah you're doing this bit that no one will see all right here we go sorry",
      "start": 8094.2
    }
  ]
}
