{
  "id": 1669,
  "video_id": "78kwV7nIaPE",
  "show_name": "Love & Sex Stuff",
  "hosts": ["Greg Miller", "Tim Gettys", "Nick Scarpino"],
  "title": "Dating Someone That Doesn't Want Sex (w/Greg Miller) - Love & Sex Stuff",
  "description": "Support this show! Get the Love & Sex Stuff Shirt here!\nhttp://store.roosterteeth.com/collections/kinda-funny/products/kinda-funny-love-sex-stuff-shirt\n\nSubmit your questions here!:\nhttp://www.kindafunny.com/loveandsex\n\nAll love, no sex stuff.\n\nEach and every Monday at 9AM PST Tim Gettys and Nick Scarpino answer your questions about dating and relationship advice....cause that sounds like a good idea.\n\n\nFollow us on Twitter!\nColin Moriarty - https://twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\n\n\n\nMusic by Tonedeff - http://www.QN5.com",
  "published_at": 1460390400,
  "duration": 255,
  "transcript_chunks": [
    {
      "text": "Yeah so Greg Nick today's question comes from 18-year-old Jack. Jack says hey guys this Jack L yeah Jack says hey guys this girl and I really like each other and we were talking about having a relationship we were both excited about it until she said she was an asexual. We both agreed we probably shouldn't be in a relationship or one person wants sex and the other doesn't. Did I make the right decision or is sex not that important? The window is still open so we could change this if we wanted to help me Kinda Funny you're my only hope now you made the right choice yeah and based on the description alone if he wants sex and that's not something she's into well that's a huge problem yep exactly I think that is a relationship without sex possible absolutely if both people aren't interested and aren't into it if get two asexuals and asexuals even pretty far you get two people that aren't like you know dying for and wanting it and thriving off of it then it's like all right you",
      "start": 7.06
    },
    {
      "text": "and aren't into it if get two asexuals and asexuals even pretty far you get two people that aren't like you know dying for and wanting it and thriving off of it then it's like all right you could make that work got things to do but if one person wants it the other doesn't recipe for disaster yeah no I mean these guys are absolutely right look you could probably put up with it for maybe a month or two but at the end of the day it's a basic need in a relationship and if that's something that you want you got to have it it's not even like you're you're you know equating into being horny right and wanting to have sex whereas I think really it comes down to just feeling unwanted that's what it's it gets into I've been in relationships that end that way right and it's just it's just you know it's not a good feeling you feel like you're not attractive this isn't working even that would be the whole thing here from the GetGo that's how you'd feel Jack yeah I I Feel like sex is one of the",
      "start": 52.04
    },
    {
      "text": "it's not a good feeling you feel like you're not attractive this isn't working even that would be the whole thing here from the GetGo that's how you'd feel Jack yeah I I Feel like sex is one of the biggest uh causes of arguments like specifically the the difference between levels of interest and sex between two people in a relationship because that it starts off of like why don't you want to and like oh can we just do it now and what about this and then all of a sudden like gets to that it starts off with oh no big deal okay no and then you stop even trying to initiate and then the partner isn't even saying that they want it or don't want it and like get in your head exactly you guys are talking a little bit different like you guys are talking more about intimacy too which is what which is what really that that actually is a huge problem because there is for a lot of people once the sex stops that is the that is that is the end product of the the bigger issue which is that you're",
      "start": 89.16
    },
    {
      "text": "is what really that that actually is a huge problem because there is for a lot of people once the sex stops that is the that is that is the end product of the the bigger issue which is that you're having a lack of intimacy or trust or something's wrong in your relationship and that's manifesting itself with not wanting to have a physical relationship because something emotionally is probably not there or not happening it happens a lot with people that have been buried for a while or been together for a while um you got to fight through that but uh yeah I mean there is so much more than just the physicality to sex there is an intimate aspect of it liquids and fluids and stuff and smells don't forget about the smells um but yeah I mean that's something that you should that that you should have if if that's what you need because that's going to make you feel whole it's going to make your relationship feel right yeah especially you're 18 you're super young and that I think that's the",
      "start": 128.32
    },
    {
      "text": "have if if that's what you need because that's going to make you feel whole it's going to make your relationship feel right yeah especially you're 18 you're super young and that I think that's the biggest thing is it's like she might be super awesome and like giving it a try might be worth it but where you're at right now you want it and this is obviously a big deal to you so I think that you should try to find someone that might be a little bit more compatible with your your needs at the time and then go from there and appreciate these glorious 18-year- old boners you're getting right now those things could you could through a wall if you wanted to just right through the drywall Jesus it takes and I'm not saying I can't I don't get those all the time I what I'm I still get those kind of boners let me get up here I still get those kind of boners I'm saying that but not with like the frequency you know what I mean like every boner when you're that young but I feel like you get those",
      "start": 163.88
    },
    {
      "text": "boners let me get up here I still get those kind of boners I'm saying that but not with like the frequency you know what I mean like every boner when you're that young but I feel like you get those because of like I don't know what you're talking I like it I like it a lot gent sex it's more like Just Pizza got ordered yeah this has been Love and Sex Stuff as always every Monday 9:00 a.m. you can find this over on youtube.com/kindafunny Greg thank you very much for joining us thanks thanks thanks for having me if you have a question for this big beautiful show go to kindafunny.com love and sex fill up the form and we'll get back to you and if you want the 11 Stu t-shirt go to kindafunny.com store and get you one there support this all over the place make **** happen we can't not have them there I'm verified on PSN you can follow me there",
      "start": 198.08
    }
  ]
}
