{
    "id": 1660,
    "video_id": "FE1QNB9qZRY",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Why Mobile Ordering Sucks - The GameOverGreggy Show Ep. 122 (Pt. 3)",
    "description": "Nick Scarpino has a meltdown at Starbucks.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1459926001,
    "duration": 876,
    "transcript_chunks": [
        {
            "text": "Nick, yes, what's your topic? My topic is also about technology, but namely and how it's used at Starbucks these days, which is **** pissing me off. And here's the setup for the story. I walked into my Starbucks two days in a row and they're doing this stupid thing now where you can order ahead and people, it's awesome, don't get me wrong, and I should get on this band, I should probably jump on this bandwagon, but I have not yet and it bit me in the ass twice because I walked in and there's five people in line. I'm like, dope, there's only five people in line. It's this was the day that I had to get you the Cherry yogurt and you didn't get it inside and I was like, oh great, I got Greg wanted some cherry yogurt. I'm going to get to the house by 10:30. He'll eat it. He he won't be angry at me. It's going to be fine. He won't take it out on Colin. It's going to be great. And I looked down the as you know, they always do the thing where they're writing your name like what's your name? Nick, Nick, how do you",
            "start": 2.85
        },
        {
            "text": "to be fine. He won't take it out on Colin. It's going to be great. And I looked down the as you know, they always do the thing where they're writing your name like what's your name? Nick, Nick, how do you spell it with an N like N I C K um and they're like cool and they have to ask. There's always a **** guy being trained because the Starbucks I go to is like hell on Earth. It's the one that like breaks people. It's the Vietnam of **** Starbucks, right? And so like they always are just dropping people left and right so no one knows how to do anything with slows line that right one. The nicest Starbucks in the city. No, it's not because it's like the bum Starbucks now. There's a lot of like homeless people around you. The one in the marina. Yeah, the one in the marina. It's pretty bad, but it's also it's also just not set up for that volume of people. It's a high volume of Starbucks so I go and I'm like they write my coffee down. I'm good. I got all the snack thems that Greg asked me to get ready to rock",
            "start": 50.6
        },
        {
            "text": "just not set up for that volume of people. It's a high volume of Starbucks so I go and I'm like they write my coffee down. I'm good. I got all the snack thems that Greg asked me to get ready to rock and roll. Look down the line and there is no lie like 30 drinks and I'm like **** cuz I only put 10 minutes on the meter and this is going to take longer than 10 minutes. I'm cool. I wait. I got it. I got it metered out of my watch. I'm like, okay, 9 minutes. I'll be right back. Now I'm seeing other people do this by the way. People are dropping like flies. One woman was just like **** it and left and I didn't see her come back and trust me I would have **** seen her come back because I was there for 30 minutes waiting for an iced coffee which finally I was like and you know me I'm I'm cool as a cute cumber until you are not that one moment where the the I'm like **** it what am I what do I have to lose this is a $3 cup of coffee I don't need there's 30 there's like 300 Starbucks in this city I'm",
            "start": 84.56
        },
        {
            "text": "until you are not that one moment where the the I'm like **** it what am I what do I have to lose this is a $3 cup of coffee I don't need there's 30 there's like 300 Starbucks in this city I'm like yo what's going on with the drinks and the guy's like I know we're really backed up you're preaching to the choir man and I'm like oh my God no I'm preaching to the preacher and I was like well dude I've been here for 30 minutes and I'm about to my meter's about to run out again like I got to go put this on but if I get a ticket it's going to be a 75 cup of coffee and that's is that acceptable the guy's like I'm honestly sir I don't know and I was like well who the **** does know and at this point I'm doing the thing I'm starting to raise my voice people are starting to back away from me but in solidarity because they're also **** pissed off they're joining hands and making a no security guard could get I'm Nick Scarpino we're late to our job at Google but we back you up sir even",
            "start": 122.92
        },
        {
            "text": "but in solidarity because they're also **** pissed off they're joining hands and making a no security guard could get I'm Nick Scarpino we're late to our job at Google but we back you up sir even though we will never say the word and I'm I'm just getting irate on this guy I'm like who's the manager here go get the manager and finally this manager comes over and I've had so many lovely interactions with these people before this your you know this daily Starbucks and people like this guy is really nice most of the time and this one time man that changed their opinion of me wholeheartedly because I was like this is unacceptable like and I'm like what's going on he's like well it's these to go orders we got to do all these to go orders and I was like but you're the manager and he's like yeah and I was like so fix it and he's like yeah but we're not set up I was like hey fix it and the like well I don't know I'm like but you're the **** manager it is your job to make sure this this",
            "start": 162.84
        },
        {
            "text": "yeah and I was like so fix it and he's like yeah but we're not set up I was like hey fix it and the like well I don't know I'm like but you're the **** manager it is your job to make sure this this thing runs correctly so if it's not running correctly it is your fault so make my coffee fix it and he's like well here I'll make it out of order cuz then you're **** them over I'm like I just want you to speed this up so the next time I come in you're not having this problem because this is the second day in a row that I noticed this right and it's not going to get any better so I'm like I got to go get my meter when I come back on and see my coffee here put money in the meter come back the coffee there locked the coffee's there and the guy left me too like free coffee things and he's like sir I'm so sorry here's the two free coffee things for you like whatever like you know the little cards they gave you like free coffees and I and in some stupid like stance",
            "start": 200.08
        },
        {
            "text": "things and he's like sir I'm so sorry here's the two free coffee things for you like whatever like you know the little cards they gave you like free coffees and I and in some stupid like stance of like I'm going to stand on my morals right now I grabbed my coffee and I said you can keep those I'm never coming back to Starbucks again are you sure about that and I left the biggest lie and I went to Starbucks again that day a different Starbucks today we get out of the cars like we both park like right next to each other in the morning we start walking over and I see Nick with with some Starbucks me and Kevin just start laughing cuz it's like he just told us the story I'm like is that and he's like I went to a different Starbucks and it's just like mostly because not not because I'm standing on principal it's because I'm so embarrassed that I'll never go back it makes me wonder this is happening every single day this exact situation that's that poor guy probably he probably told corporate",
            "start": 239.4
        },
        {
            "text": "principal it's because I'm so embarrassed that I'll never go back it makes me wonder this is happening every single day this exact situation that's that poor guy probably he probably told corporate like a thousand times he's probably like you guys have to authorize me to get more people in here and they're like no but at the same time he's ineffective here's the other problem though is the fact that he his response of like you're preaching the choir sounds really like oh don't say that if you're manager and there's an issue not the manager the manager was like I you he's interacted with you countless times so it's like I'm sure he felt like a level of like bro code of like appreciate the chir man we're cool I you know we're on that level you won't blow up my face call my manager like oh I mean I've seen you go from 0 to 60 and it's one of those things where it's like oh **** we were cool we're not not cool this is crazy but I mean yeah it's it's so funny that it's like whose fault is",
            "start": 282.0
        },
        {
            "text": "I've seen you go from 0 to 60 and it's one of those things where it's like oh **** we were cool we're not not cool this is crazy but I mean yeah it's it's so funny that it's like whose fault is it is it the manager's fault well I'll tell you whose fault it's not mine true so I don't give a **** who else's fault it is cuz it's not my fault that this is happening right it's not my and by the way I've been sitting there when people don't even pick the **** orders up cuz they forget or they don't have time they're just sitting there there's like 10 drinks and I was there again 5 minutes I'm like counting my watch no one picked those drinks up no one did were any of them your kind of drink no think if they were I would have been like scoop you should have been like I'm taking my coffee I'm never coming back and caramel now have you thought about just getting on board with mobile ordering no because he's Nick so here's the deal Uber like Ubers like I can totally imagine you",
            "start": 324.4
        },
        {
            "text": "I'm never coming back and caramel now have you thought about just getting on board with mobile ordering no because he's Nick so here's the deal Uber like Ubers like I can totally imagine you screaming at an Uber to get their manager because it's just like you're getting in the way of the taxi cabs it's just like once you get on it you're going to love it and then it's all good no no once I got on I loved Uber until I started taking Ubers and then I was like wow you don't even know how to drive a **** car let alone get me from point A to point B like you don't know the relationship between the steering wheel the gas pedal on the brake you just don't get these things these are **** mystifying to you like you never like you came from Krypton and we're like I can fly but I don't know what this **** Toyota silica does you know what I mean I got **** prus I don't understand why it doesn't make it doesn't make noise um I don't like Uber and and they've been pissing me off",
            "start": 360.36
        },
        {
            "text": "know what this **** Toyota silica does you know what I mean I got **** prus I don't understand why it doesn't make it doesn't make noise um I don't like Uber and and they've been pissing me off lately and I actually I've reverting back to taking cabs cuz cabs are like on the **** they're on the ball now you call a cab they're there in 5 minutes they're so thankful to get your business and they don't charge you you know why I don't like Uber cuz they charge you these **** Flex rates where it's like three and a half like 3.7 times the fair to get any place between the hours of like 3 and 7:00 come on they probably don't play Boom by pod like my driver did yesterday a driver oh my God no no it was it was a Uber driver oh no I've had some interesting and also I forget which one of us some someone said maybe it was a comedian maybe it was one of us but I'm so tired of talking to Uber drivers about being Uber drivers yeah was all you about so true but the thing we we took an Uber from",
            "start": 404.56
        },
        {
            "text": "someone said maybe it was a comedian maybe it was one of us but I'm so tired of talking to Uber drivers about being Uber drivers yeah was all you about so true but the thing we we took an Uber from Uber is really deteriorating it it like there there's no doubt there's like no doubt about it because it's saturated there's so many people that are brand every single time I talk to Uber driver it's his first **** day driving I'm like great wait driving period or driving like Uber never get the answer I don't know they're on the sidewalk the funny thing about the funny thing about Uber is like the this this this Orthodoxy to the fing GPS and like we took we came home from hard water in the EMB barad yesterday a route I didn't even know you **** could take no you but I was I was why it was ridiculous we were going like I was like spit over we're going through like pack Heights like where the **** are we we're in places in San Francisco I've never even seen I Liv there for nine years",
            "start": 444.36
        },
        {
            "text": "ridiculous we were going like I was like spit over we're going through like pack Heights like where the **** are we we're in places in San Francisco I've never even seen I Liv there for nine years and I'm like this is but I'm I'm all the time but I'm not mad at him because I'm I'm looking at his GPS and it's telling me him and I'm like you don't even know that this is **** whacked out like we could have gotten home 15 minutes ago Dam and like so I agree with you like it's just it's it's it's uh lack of days ago and it's like like and and it doesn't it doesn't take into account like the fact that like I feel like Lyft and Uber are both just in total Cahoots with each other like they like and I'm surprised they haven't just merged because like they like you hear a lot of stories about both of them just kind of people like one or the other but you like people used to really talk about like in 2012 2013 like Uber or Lyft like these are **** awesome you know and now you hear them and",
            "start": 487.64
        },
        {
            "text": "of them just kind of people like one or the other but you like people used to really talk about like in 2012 2013 like Uber or Lyft like these are **** awesome you know and now you hear them and you like you you hear like these like you're lucky like it's the same thing like why am I getting a phone call ER and I have talked about this where uh like why am I getting a phone call from you you see me on your map I dropped the I told you the business like and they like oh are you there and I'm like yes like I just I I literally just put it in that I'm at this address at the airport every time when you take from the airport they call you like are you at the and I'm like yes I literally literally just put this in there that happened to me yesterday cuz I you know they have that uh option now where you can tell them what terminal you're at and what door and then I see the guy coming and he keeps going and I'm like and he's like oh yeah sorry you wrote uh door five and I was like no I",
            "start": 528.52
        },
        {
            "text": "now where you can tell them what terminal you're at and what door and then I see the guy coming and he keeps going and I'm like and he's like oh yeah sorry you wrote uh door five and I was like no I didn't well it's funny though because you're slowly this is what we're starting to see we're slowly seeing them turn into cab drivers we see what the cab drivers used to be before they turned into monsters yeah and now we're seeing the cab drivers have to actually again because they're like **** our business is dying we actually have to go out there and like get do good customer service oh my god I've had horrible C some C I have not I have not had a single good cab experience even in a post Uber World they haven't been an ounce better they are just **** horrible horrible service I found be an ounce better but I still man I still get that like The Guilt Trip of tips and **** oh I **** hate cred cards and **** I I hate when they ask me for a tip it's like I'm going to **** tip",
            "start": 567.96
        },
        {
            "text": "be an ounce better but I still man I still get that like The Guilt Trip of tips and **** oh I **** hate cred cards and **** I I hate when they ask me for a tip it's like I'm going to **** tip that's part of this deal you know don't like recommend what I give you like that's just it really upsets me I don't like that **** at all it's so funny this whole conversation though it's like it's funny that we expect people to give a **** about their job or be good at their job or that they owe us literally anything us going to the Starbucks does not guarantee that that person is living to give me that cup of coffee cuz they're not I know they're not but at the same time it's like if you are if you accepted the job as a manager right you taken on the responsibil the extra pay that accompanies that you should actually give a **** about how your store runs right and if you don't oh you're going to incur my wrath mean com you man I'm coming if we were to like listen to the people",
            "start": 615.92
        },
        {
            "text": "that you should actually give a **** about how your store runs right and if you don't oh you're going to incur my wrath mean com you man I'm coming if we were to like listen to the people that are angry in the the comments like they're saying we're not good at our job because X Y or Z it's like okay yeah but we're awesome other stuff works that's not true we're actually really good and we really give a **** and we try every day like we're recording this way later than we normally would and these guys still have podcasts and they're going to **** do them because we actually give a **** about what the audience thinks and that's why our company is thriving right now because we care that **** at Starbucks doesn't care in fact it pretty sure he was high out of his mind and I'm like now I'm just making now I'm this you go to now but he did cigarettes no but but you know I get I get you're in a place where you're like I don't like this job I'm not working but at least have some",
            "start": 659.84
        },
        {
            "text": "now I'm just making now I'm this you go to now but he did cigarettes no but but you know I get I get you're in a place where you're like I don't like this job I'm not working but at least have some like and and I I don't want to pay this guy in that bad of a light because I came at him like like a like a tsunami of Rage so he was like I don't know how to deal with this and he did the best he could he offered me a free drink and apologize but at the same time I'm like I have no I I would have let up on the guy if I had any if it had just been a normal mistake but I'm like this you have created chaos here in my happy place this is my happy place this is the place I go to every day before work because I like to have just that one little thing that I do to myself you know I get a cup of coffee I get a cup of coffee yeah what do you do to yourself well do for myself you know what I mean like I I the rest of the day I'm I'm just surrounded by you guys which is fine but it's maddening",
            "start": 699.04
        },
        {
            "text": "coffee I get a cup of coffee yeah what do you do to yourself well do for myself you know what I mean like I I the rest of the day I'm I'm just surrounded by you guys which is fine but it's maddening sometimes and it's tiring and it's like we're constantly just going and I just want to take a break from my relationship with my wife get in my car drive to a Starbucks get a cup of coffee have that be a pleasant interaction that give me my drug I go in my car I do my drug and I listen to a podcast on the way you five Knuckleheads and it's and that's that's my ritual in the morning and when something disrupts that yeah I'm a little protective of it my ritual is not figuring out how to **** get it to go order that's going to stress me out when they **** it up right and I don't know where your order went it's here okay great well awesome now I have to do I have to get in line to talk about this now this is a stressful situation no it was easy I just walked in stood in line maybe there's",
            "start": 737.8
        },
        {
            "text": "order went it's here okay great well awesome now I have to do I have to get in line to talk about this now this is a stressful situation no it was easy I just walked in stood in line maybe there's something cute for me to look out ahead maybe it's behind me and I have to do the thing where I'm like is there Sun out today there is Sun out today it's fantastic right and they've ruined it they've ruined it now I have to go to this **** weird like Starbucks that's in a a con like a Molly Stone which is like a Safeway by the way true story the Starbucks you today is inside of Molly Stone that is how I can par how far away from you shaving the beard or hair are we so you can start going to your old Starbucks again give it a couple months it won't matter CU they have they'll have such a turnover in 3 months I'll forget and they won't work there anymore what is Molly it's it's like a yeah it's a supermarket it's like a **** ass Whole Foods oh but it's super expensive yeah yeah just like",
            "start": 778.16
        },
        {
            "text": "in 3 months I'll forget and they won't work there anymore what is Molly it's it's like a yeah it's a supermarket it's like a **** ass Whole Foods oh but it's super expensive yeah yeah just like everything else in this **** City everything well that's the other problem with the city in generals there's too many people in it too I don't understand how that many people are actually existing in the city it's just packed const L everywhere I go and they're all Uber drivers that's why yeah but I feel you I feel you on the Uber driver front because they just they don't live here so they don't drive the streets and they don't really know where they're going which is unfortunate like at least cab drivers are like I'm going to take Franklin cuz Franklin's fast and you know when a cab driver is trying to screw you over with Uber you can't tell if they're just incompetent do you want me to follow a thing or do you want me to go where are we I don't know follow **** dude this is your",
            "start": 819.64
        },
        {
            "text": "is trying to screw you over with Uber you can't tell if they're just incompetent do you want me to follow a thing or do you want me to go where are we I don't know follow **** dude this is your job you want to ask how to get something up on YouTube I will personally call Kevin and then he will walk through it damn",
            "start": 854.8
        }
    ]
}