{
  "id": 1672,
  "video_id": "iADoYL7rPwU",
  "show_name": "PS I Love You XOXO",
  "hosts": ["Greg Miller", "Colin Moriarty"],
  "title": "The Great PSN Outage: 5 Years Later - PS I Love You XOXO Ep. 31",
  "description": "Can you believe it's been five years since the PSN was taken down by hackers. I mean, the BIG one. Not the little ones. Let's reflect on the bad times and how Sony's rebuilt your trust. (Or have they?) (Released 04.12.16)\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://youtu.be/jp-rO1Lnj3M\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/kindafunnyvids\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1460476802,
  "duration": 6265,
  "transcript_chunks": [
    {
      "text": "what's up everybody? Welcome to PS I Love You EXO EXO episode 31. I'm one of your hosts, Greg Miller, alongside the pride of Long Island, Colin Moriarty. Greetings and salutations. Good to be here today. What are you downloading? Severed. I know, I can't wait. Are you going to jump right in or are you going to do like delayed gratification? No, I got to jump right in. You're going to Jump Right In. I got that plane trip on Thursday. I think I'm going to wait till then cuz what I want to start tonight is something I've been putting off as well for more delayed gratification. Valkyria Chronicles on PS4. Oh yeah, yeah, we've had that for a while. I know I've had it for a while, but I I was so hung up on The Division. Yeah, I got The Division out of my way. Yeah, I I got the episode two of Michonne over the weekend. I started in Enter the Gungeon. I've been playing a lot of games catching up in my backlog. Yeah, yeah, there's a firmware update that happens. I thought I just played the Vita. We all think we just played the",
      "start": 0.5
    },
    {
      "text": "in Enter the Gungeon. I've been playing a lot of games catching up in my backlog. Yeah, yeah, there's a firmware update that happens. I thought I just played the Vita. We all think we just played the Vita when in reality the Vita hasn't been played in 14 years. That's true. It's one of those where you don't even know, you don't even remember. It's just gone. You think you just played the Vita yesterday and it turns out you turn it on, you haven't touched the goddamn thing since Hot Shots Golf World Tour or yeah, I was right, right, Open Tee Invitational. Yeah, that that checks out, that checks out. I believe. All right, so the system update 3.60 it improves system stability in some games. Everybody wants their R to be more stable. I guess we'll just worry about that for now. Okay, you can do that. How you doing? I'm well, how are you? Good. What are you been playing? Uh, Ratchet and Clank pretty much exclusively. Um, I'm on the last boss. I didn't quite beat it. I mean, I'm like five minutes away from beating it. I",
      "start": 55.16
    },
    {
      "text": "I'm well, how are you? Good. What are you been playing? Uh, Ratchet and Clank pretty much exclusively. Um, I'm on the last boss. I didn't quite beat it. I mean, I'm like five minutes away from beating it. I just I had gotten to that point in the game right when uh I had to go on Saturday and I have not been home until this morning. So um it's uh as I tweet out today, it's uh one of PS4's best games and big words from you, Colin. Yeah, and I think with the exception of Resogun, I think it's it's strongest exclusive um and I know that that's going to be a hard thing for people to believe. I know people are going to throw to throw Bloodborne in there. I'm sure some people are going to want to throw uh Infamous in there and and things of this nature. I wouldn't put that in there, but I'm sure some people will sure. Um, and I'm talking about like AAA or media exclusives. I'm not talking about you know downloadable exclusive. I can't my my mind just can't go down that rabbit hole right now. I can't. So um Ratchet",
      "start": 97.24
    },
    {
      "text": "sure um and I'm talking about like AAA or media exclusives. I'm not talking about you know downloadable exclusive. I can't my my mind just can't go down that rabbit hole right now. I can't. So um Ratchet is extremely beautiful and it's fun and it's funny and uh I can't believe they're charging $40 for it. I can't believe they're charging not charging $60. Doesn't feel like a budget game quot no you said it was better than Crack in Time. You think it's the best Ratchet Poss? It's been a while since I played a Crack in Time and it's been a while since I played the original Ratchet but so the idea of this particular Ratchet which is on which is an Insomniac game um is it is a reimagining in some respect of the original game yeah and they do kit around a little bit in the marketing I think and even in the game like it's the game based on the movie based on the game and so I think that this is so I think the movie has its script that is Loosely based on the first game but they've taken out some",
      "start": 136.48
    },
    {
      "text": "in the game like it's the game based on the movie based on the game and so I think that this is so I think the movie has its script that is Loosely based on the first game but they've taken out some things about it and it's been a while since I've played the original Ratchet so the one thing is that I don't remember many of the story elements anymore. The one thing I know that they removed is that Ratchet and Clank don't hate each other anymore which is like a huge I think that was in the first game I I could swear I could almost swear that that was in the first they had uncomfortable relationship yeah when they got when they first meet yeah build that relationship that report and I feel like maybe in my history of Insomniac I don't know I talked to someone over there about it like what it's so uncomfortable and I think that they knew that do this they like immediately and the St a little loose but there's of new cuteness and kind of new elements but the a lot of the design of the",
      "start": 175.48
    },
    {
      "text": "it's so uncomfortable and I think that they knew that do this they like immediately and the St a little loose but there's of new cuteness and kind of new elements but the a lot of the design of the planets that already existed in the original game are there and and what I realized like is that the shit's just implanted in your gray matter somewhere like I like I remember all of these planets I remember this sequence I remember it's just cool to see this planet this planet or this planet this sequence this sequence and this sequence that you totally played reimagined in HD reimagined in 1080 and all these kinds of things so it's it's a beautiful game and and Drew Murray we were talking about this on Colin Greg Live this morning Drew Murray who's a friend of ours who worked on Resistance and Sunset Overdrive and Insomniac um came on GDC stream last year and he was really one of the first people to ever talk about Ratchet and Clank and he talked about our our show got heavily cited where he was",
      "start": 207.4
    },
    {
      "text": "Overdrive and Insomniac um came on GDC stream last year and he was really one of the first people to ever talk about Ratchet and Clank and he talked about our our show got heavily cited where he was basically saying it looks like a Pixar movie and it does like I'm not saying it's like all the way there but the game is really pretty and um the cut scenes obviously are pre-rendered and absolutely beautiful but the the cut scenes I should say that are pre-rendered cuz there are cut scenes that aren't but the game is beautiful the color palette is very vibrant um and I feel like this is a must-play game like I feel I feel like this is that I had so much fun playing this game and and dare I say it's my favorite game of the year so far um you're allowed to say that I think now it has like all the things that you love like it has new weapons and old weapons like the Groovatron there and all that kind of stuff you upgrade each Weapon by using them so it's a very similar you know identical way",
      "start": 248.56
    },
    {
      "text": "things that you love like it has new weapons and old weapons like the Groovatron there and all that kind of stuff you upgrade each Weapon by using them so it's a very similar you know identical way that you play Ratchet then Ratchet gets upgraded with experience to increase his health um Clank gets and Ratchet both get their upgrades to make them in the jetpacks or whatever but there's a lot of reimagined or completely new parts of the game too that I think are are pretty neat and there's a whole card collection system in the game so like you kill enemies and sometimes they drop cards in addition to dropping a Raritanium which you use to upgrade your weapons on the back end which is another upgrade tree um and these cards when you make groups of three of them so like similar weapons whatever Rhino or whatever they happen to be they can give you like a 5% drop rate for Raritanium or they can give you like um uh Cho you're making no basically it's just like you collected these three",
      "start": 292.68
    },
    {
      "text": "Rhino or whatever they happen to be they can give you like a 5% drop rate for Raritanium or they can give you like um uh Cho you're making no basically it's just like you collected these three cards so now you're going to enemies will drop 10% more collec cards or bolts or whatever it is and uh so there's an extra layer of depth there that I really appreciate and then there the challenge mode which I believe was inherent in the original Rat and Clank so like there was a whole think about like Resistance Fall of Man or something which is another Insomniac game where they'd have like a list of things to do yeah in the game like crazy things like win this battle do this thing like in this very specific way I think that's unlocked after you beat the game so it gives it like some more replay value plus there's easy medium or normal and hard difficulties so at $40 like I I just I don't know that this game is going to be for everyone no games for everyone but if you're into 3D Platformers or",
      "start": 326.36
    },
    {
      "text": "plus there's easy medium or normal and hard difficulties so at $40 like I I just I don't know that this game is going to be for everyone no games for everyone but if you're into 3D Platformers or you want to see what Ratchet and Clank is all about if you are obviously a Ratchet and Clank fan this is a must-play game I I wish I talked I Scott Ro um tweeted to me today and was just like you know we're really glad to hear that you like it because you know I'm paraphrasing but because we were really happy with the way it turned out I'm like I'm really surprised that you guys in my mind I'm like why are you not charging $60 for this first of all it's cool that you're not but second of all this game's **** great this I'm surprised that they didn't talk about it more they must have known how good this game was and so I think I want I want to talk to you about no I want to talk to you about why they charge that and not the other but I think I we have a question that plays into it hamood 07",
      "start": 361.56
    },
    {
      "text": "this game was and so I think I want I want to talk to you about no I want to talk to you about why they charge that and not the other but I think I we have a question that plays into it hamood 07 says greetings and salutations by the time by by this time hopefully both of you or at least Colin have played and enjoyed Rash and Clank my question is why AR we getting more games like this why aren't we seeing new Jack and Daxter games or Ape Escape or maybe another Sly Cooper I know there's a lot of talk about how people don't play these kinds of games anymore but I refuse to believe that Nintendo keeps making these familyfriendly games and while their Hardware is not selling the games are doing well Splatoon sold over 4 million copies on Wii U and let's not forget how well Skylanders Disney Infinity and the Lego games are doing I know figures and Licensing helps but still P.S Greg I finally got around to playing Diablo II and you were right that game's awesome told you that's my thing",
      "start": 394.52
    },
    {
      "text": "Infinity and the Lego games are doing I know figures and Licensing helps but still P.S Greg I finally got around to playing Diablo II and you were right that game's awesome told you that's my thing and why I think the $40 price point makes sense right it's another Rash and Clank insert it could be another Jack and Daxter there could be another Ape Escape right and for me I'm like cool I've played those games a lot but you're coming out now saying how great this game is how different this game is that there's all these added on things and so it's 40 bucks well you already saw in uh Colin Greg Live today a person went over and pre-ordered it based on that right because $40 you don't have to think about as much the the barrier to entry here I don't think is this is an improving IP it's a I've seen this IP once or twice like what is this game going well I I I appreciate the whole like entry way into because the the movie is coming out in a week or two and this is going to be a game that",
      "start": 432.44
    },
    {
      "text": "seen this IP once or twice like what is this game going well I I I appreciate the whole like entry way into because the the movie is coming out in a week or two and this is going to be a game that they hope parents go and buy their their kids and at a cheaper price point it's going to be more palatable for them to do that and so I totally respect and appreciate that yeah but when I was just reading about the game I mean they would you know and Insomniac and Sony said certain things and I never really trust what PR people say about like games in the sense that you know like this game is a market Improvement or this game is this or this it's like all right let me see for myself I'm not saying that they're not trustworthy people but I'm just saying like I'm skeptical of like everything that I'm fed yeah and I'm surprised it didn't like this game really isn't the original game like it is but it's so much more than that and maybe I'm just maybe it's been so long since I played the original",
      "start": 469.72
    },
    {
      "text": "fed yeah and I'm surprised it didn't like this game really isn't the original game like it is but it's so much more than that and maybe I'm just maybe it's been so long since I played the original it's not that long actually I played on PS3 when they re-released it in the collection but maybe it's been so long that it just feels newer and fresher to me but there are definitely like new sequences new this new that in the game like I definitely don't recognize a lot of **** in the game and com next exactly and I just feel like to his point Sly 4 was a similar thing like we've said when sansar really Sly four we we said similar stuff which was why don't they make more games like this or why is this so good and I think it's because they just have a little Sony has a little bit of reluctance with the platformer the mascot platformer now which I think is healthy and so when you do get them you're excited about them it's the same thing with ukulele which is not a Sony product but sure it's",
      "start": 502.92
    },
    {
      "text": "with the platformer the mascot platformer now which I think is healthy and so when you do get them you're excited about them it's the same thing with ukulele which is not a Sony product but sure it's like we're excited about this because we don't have them anymore so I hope that there's some restraint shown because I do think hey this game's going to do very well the game the game already critically is being acclaimed it's gotten tens and nines and eights like across the board a lot of nines um so when I saw the scores I'm like am I crazy like this is so **** good what's interesting is that it's maybe the inverse it's actually part of a plan where a Sly 4 just kind of came out right Thieves in Time and it was we we liked it we were happy to have Sly back it didn't I don't think it emboldened new Sly fans it wasn't like somebody found this game was like oh I love this I'm going to go back and do all this stuff right whereas this one's based around the fact that right now it comes",
      "start": 541.96
    },
    {
      "text": "new Sly fans it wasn't like somebody found this game was like oh I love this I'm going to go back and do all this stuff right whereas this one's based around the fact that right now it comes out hey you you've given up on Ratchet or just aren't super stoked about this it's really good it's 40 bucks and then you hope yeah in two weeks the movie comes out people leave the theaters are like oh and there's a new game sure and they pick it up and like oh this is awesome yeah I think Sony has something here I I it's so funny because like if people just give the game a chance I think they're going to love it and if the movie does well and I don't know anything about the movie but rat ratch I mean this I was kidding around saying this movie is like 15 years too late and it kind of is I mean the game it's 14 years technical rtion came out 2002 but um I feel like they could live again with this series the series isn't dead and and we thought they were like into the Nexus was a game people get",
      "start": 576.28
    },
    {
      "text": "game it's 14 years technical rtion came out 2002 but um I feel like they could live again with this series the series isn't dead and and we thought they were like into the Nexus was a game people get mad as for ignoring that game that was a budget real Ratchet and Clank game but it really wasn't it was seemed like very half-ass and I just I played it a little bit I remember Insomniac came in IGN to show it to us and I played I'm like that's there was nothing since a Crack in Time which was in 2009 where I was like this is um Ratchet and Clank sure and I'm not the world's biggest Ratchet fan by any chance some people are saying like that I was **** talking Ratchet I don't think that ever happened I **** talk Jack and Daxter um I always liked Ratchet my sister actually was really in Ratchet she was the one to introduced me to it when I was younger but um well not I guess I was a teenager but she had you still younger yeah um so it's not like I'm the world's biggest Ratchet fan but it",
      "start": 607.4
    },
    {
      "text": "she was the one to introduced me to it when I was younger but um well not I guess I was a teenager but she had you still younger yeah um so it's not like I'm the world's biggest Ratchet fan but it just felt very nostalgic and I want to say like the the writing is really funny like game's funny and it's the first time since maybe South Park that I was laughing out loud at I was like laughing at it I was like this is it's just you know Mr. Ziron is amazing Mr. Ziron can't be but and his lines are some of them course telling the story right yeah so like it's it's a yeah I don't want to ruin too much of it but it's the perspective of the story is through Captain Cork's eyes as he's in prison and like what happens in the in in that kind of that sequence of events um but to me it's it's just a super special game and I I I I like it and I'm surprised by it and I'm surprised by Insomniac and I'm surprised by Sony's like seeming reluctance to to pound the **** pavement on this game and get it",
      "start": 645.6
    },
    {
      "text": "special game and I I I I like it and I'm surprised by it and I'm surprised by Insomniac and I'm surprised by Sony's like seeming reluctance to to pound the **** pavement on this game and get it into everyone's hands immediately and talk to everyone about it just didn't seem like a game they really cared much about and I'm shocked by that because it's way better than a lot of the games they do care about so um congratulations to imom and congratulations to ins uh to Sony and hopefully we get more of these that's the one thing I'm super excited about is I'm like okay we don't need a remake of the second and third games on PS  now what we need is like a brand new $60 15h hour Ratchet and Clank for 2018 can we do that I would say it's I I I must be 10 or 12 hours into it but I I'm really I mosy about when I play R CL I get all the bolts I'm looking for gold bolts I'm collecting the cards and Raritanium and so I mean you can probably play way quicker than that and you can play it on easy",
      "start": 691.2
    },
    {
      "text": "about when I play R CL I get all the bolts I'm looking for gold bolts I'm collecting the cards and Raritanium and so I mean you can probably play way quicker than that and you can play it on easy and you can like skip puzzles and stuff like that so it's very kid-friendly um so we'll see what happens but I'm I I want to I want to you know take you know my words were take with a grain of salt everything I say about anything I mean you have to kind of figure things out for yourself but this game is **** great I I just want to say that so okay while you were focusing on that I was playing a whole bunch of different stuff this weekend like I was talking about a lot of it was Quantum Break we'll talk about that on the Games Cast however I wanted to bring up this question from I Dream of August dear Colin and Greg after playing The Division for a few weeks now I'm already getting bored with the repetitive nature of the game I only reached level 15 in the alert of the beautiful environment",
      "start": 736.04
    },
    {
      "text": "dear Colin and Greg after playing The Division for a few weeks now I'm already getting bored with the repetitive nature of the game I only reached level 15 in the alert of the beautiful environment wasn't enough for me to stick around are both of you still actively playing it if not why uh you had stopped you were already slowing down did you hit 30 yet I mean and now I'm distracted because now we have Severed and which is like a huge priority for me because I **** love Drink Box. We're going to talk a little bit about them in the rers report um so I need to get back to I just want to get it out of the way sure my thing is I hit 30 the other night with Fran and them played a little bit more running through the dark Zone getting crazy good weapons having a great time and then just I I was playing Quantum Break all weekend or all Saturday and Saturday night Ty and Fran hit me up and like do you want to play The Division like yeah and I hopped on and it was just like a **** wall of",
      "start": 770.08
    },
    {
      "text": "playing Quantum Break all weekend or all Saturday and Saturday night Ty and Fran hit me up and like do you want to play The Division like yeah and I hopped on and it was just like a **** wall of just like oh I'm not going to be in for this the rest of the way you know what I mean cuz it was jumping in and TI had been like oh man I've been I've been uh milking this m Miss Mission all day long getting Phoenix credits doing this then we went out and we were doing another challenging mission to get more Phoenix credits and like you're talking about how many Phoenix credits you're earning 30 at a pop but it's like 150 to go get the the next piece of gear that like good I'm like the gear treadmill just out of the blue that's what the game's always been but it was always an obtainable carrot right in front of me I was able to get to you right away and all of a sudden it was just like nope this is going to be now playing the same missions over and over again with strategies and this and",
      "start": 807.56
    },
    {
      "text": "right in front of me I was able to get to you right away and all of a sudden it was just like nope this is going to be now playing the same missions over and over again with strategies and this and having people pull you and tell you what to do and where to go to go get this to get this I'm like this is not what I wanted of this game cuz I enjoyed my entire run up to level 30 no problem my secondary character all that is it reminds me a lot of DC Universe Online where all of the leveling mechanics and stuff were great and I was enjoying myself and I was you know okay that's coming next I've got this you know level  9 item that I'll be able to use in two levels when I hit it that's going to be fantastic that's going to be fantastic and now that I've hit 30 and it's to this point of do I want to go grind on these missions over and over again it's like no I definitely do not want to go do that yeah I mean I always knew that that was in the complexion of Division that's I didn't catch me",
      "start": 845.2
    },
    {
      "text": "to go grind on these missions over and over again it's like no I definitely do not want to go do that yeah I mean I always knew that that was in the complexion of Division that's I didn't catch me but I mean I knew that that was going to wear me out I wanted to see the story and I like the world I like The Division I think it's a really good game but I just want to get to level 30 and just forget about it and maybe forever but at the very least until the DLC comes out I'd like to go to Brooklyn do something queens or I don't know but the world is very compelling it's just not it's and the mechanics are great it's just not the back end of the game is not what I want it to be and that's just me so I mean not every game's for me most I was hoping it would slowly wear me down but it seems like all of a sudden I'm still going to jump back in a few times I know because I know I'm right there on a few trophies right that I can just get in knock out a couple Silvers by going through",
      "start": 878.96
    },
    {
      "text": "seems like all of a sudden I'm still going to jump back in a few times I know because I know I'm right there on a few trophies right that I can just get in knock out a couple Silvers by going through completing these other encounters I've come so far on the Collectibles it' be kind of stupid not to go through and see those through yeah I stopped kind of just even caring about any that stuff player stuff that I can worry about myself and then see how this goes I know they're dropping incursions on that chz but those are supposed to be even harder which would motivate me more to go on these **** missions to get Fenix credits to keep this **** treal going and I'm not about that I like it it's just it's just way too much stuff you said we have Valkyria Chronicles we have Severed there's way too many other games **** Enter the Gungeon are you going to play gon absolutely dude I've been having way up I about I play you know I I've been talking I've been beating the drum for Gungeon",
      "start": 914.04
    },
    {
      "text": "way too many other games **** Enter the Gungeon. Are you going to play Gungeon? Absolutely, dude. I've been having way up. I about I play, you know, I I've been talking I've been beating the drum for Gungeon since me and Nick saw at that event year and a half ago and I when I when I got and sat down and played it I really expected it to be more Rogue Legacy than it was where okay I die I come back I get to invest you know my coins or whatever my bullets here and do this and get that and it's totally not that it's totally Spelunky where every time I go in there it's brand new and you've just got to be better and better at the game or whatever and at first and at first I was like what a turn off but then I find myself unable to stop playing it and get those you know I start wrapping my head why I would teleport where I would teleport to coming back from that jumping into the game figuring out how to attack this boss what my method will be for that how to use these guns in different ways what the",
      "start": 945.6
    },
    {
      "text": "teleport where I would teleport to coming back from that jumping into the game figuring out how to attack this boss what my method will be for that how to use these guns in different ways what the bonuses are the different characters on each one of them it's great what do you it looks we just got Axi Verge codes too oh nice good it's raining codes it's raining codes today so wait let me ask you before I even take that let me for S did you take one of these yet yeah I take the top one top one all right so let me just enter this how do all the housekeeping while you do that if you new ladies and gentlemen this is PS I Love You XOXO it is kindafunny.com PlayStation podcast it is the number one PlayStation podcast on the internet and it posts each and every Tuesday at 9:00 a.m. Pacific Time on youtube.com/ Kinda Funny games and podcast services around the globe so why don't you subscribe to that YouTube channel why don't you check out other podcasts like the Kinda Funny Gamescast",
      "start": 982.88
    },
    {
      "text": "on youtube.com/ Kinda Funny games and podcast services around the globe so why don't you subscribe to that YouTube channel why don't you check out other podcasts like the Kinda Funny Gamescast or the GameOverGreggy show why don't you tell your friends and I know what you're saying Greg I'm one of the best friends you have more best friends than I have best friends and I understand that may be true in a number of sense but you have best friends that I don't have so make sure you spread the word about our little show so we keep doing it and we stay motivated and everyone's happy because if I'm ever unhappy you'll know how you doing you need more time need more fill time well I'm trying to see if I have enough space that's preparing to download get that big oh then you should be oh no pop out yeah yeah you're know I'm sorry no I'm good wo made it I want to before I go let me go back in here and I'm just going to delete what am I going to delete I'm going to delete CB for now oh my god",
      "start": 1023.36
    },
    {
      "text": "out yeah yeah you're know I'm sorry no I'm good wo made it I want to before I go let me go back in here and I'm just going to delete what am I going to delete I'm going to delete CB for now oh my god really you just just started CB you were so excited space because I Axi Verge should be small but I'm going to download Axi Verge concurrent to this as well should have got that big memory card damn I'm **** in Vita heaven right now dude yeah I know these are like the two games I want to play Vita I get them within a half an hour of each other yeah the is a cruel mistress Severed at the top of the list right oh my God know but Axi Verge meant to be played on Vita of course and I'm G to play the **** **** out of it on Vita I'm telling you right now I never beat it no no I know you were you were you made the cry you would wait until Vita for it and then Vita came a year and a half later my Vita is like so **** I'm telling you man years carbon is over there right now amarice hit him up and say",
      "start": 1060.52
    },
    {
      "text": "made the cry you would wait until Vita for it and then Vita came a year and a half later my Vita is like so **** I'm telling you man years carbon is over there right now amarice hit him up and say buy me the color of the Vita you want what color Vita do you want you want that bright orange one I wanted the Dragon Quest one but I will it's probably I should ask him to buy it for me that's not a bad idea something just failed but I don't know what it was I heard the noise yeah I know the the troubled Vita noise of course we all know so hold on let me do this sorry I know this isn't good TV or whatever we do no I don't know what the hell this is it's fine YouTube stuff I guess it's just I you're making me want to go get my Vita and download Axi Verge cuz I already got Severed I'll do that no it's I'm almost done all right fine who am I to say I mean can you not who am I to say hold on jeez who am I to say you get it was actually a secret trap the Waterman is back wait hold on be quiet he's going",
      "start": 1108.24
    },
    {
      "text": "almost done all right fine who am I to say I mean can you not who am I to say hold on jeez who am I to say you get it was actually a secret trap the Waterman is back wait hold on be quiet he's going back he's passing by never mind I didn't say anything about it talk about the Waterman ongoing romance with the Waterman here thank you did you take top code they already oh la what a nice young man Danman Dan thank you Dan I like how he gave Nick and uh Tim codes is that they play the **** Vita you would assume that if you are part of Kinda Funny you play the **** out of the Vita but you would assume wrong cuz Nick Scarpino is a jerk all right while you're doing that I guess we should get the RER report let's begin the show with what is and forever will be RER report time for some singular possessive news there are 14 items on the list Baker's **** Axi Verge Severed dozen what an exciting time to be alive and that's rare for me to say Severed's downloaded and installed",
      "start": 1150.84
    },
    {
      "text": "some singular possessive news there are 14 items on the list Baker's **** Axi Verge Severed dozen what an exciting time to be alive and that's rare for me to say Severed's downloaded and installed okay yes number one now this story people were asking about Greg and people were asking about it specifically why we didn't talk about it but it happened kind of uh at the same time as we were recording at Rooster Teeth last week the show that some people hated now they hate it they they hate everything that's true now I want to talk about now number one major leaks have purportedly uncovered many Secrets surrounding Sony Santa Monica's upcoming AAA PS4 exclusive and it's you guessed it a God of War game a delu of artwork leaked via site NeoGAF leaks appar apparently garnered from a personal website of an artist who worked on the game a Del of artwork leaked via site near and apparently garnered from the personal website of the artist who worked in the game that's really not a complete",
      "start": 1207.4
    },
    {
      "text": "website of an artist who worked on the game a Del of artwork leaked via site NeoGAF and apparently garnered from the personal website of the artist who worked in the game that's really not a complete sentence but deal with it according to polygon the site has been taken down but NeoGAF smartly archived come on NeoGAF you smart guys the artwork and accompanying information suggest that Kratos is the protagonist but that he'll be visiting Norse mythological locations this time around Sony hasn't commented on the leaks but polygon sources note that the artwork is quote unquote legitimate and I can tell you that this is completely in line with what I've been hearing about this game for sever years so um I want to yeah at least two years I mean we you and I heard about this a long time ago correct and we just never corroborate it I guess but I've heard this it's been an ongoing from people so um I've heard this as of like we were still at IGN so like this I I my assumption is and I'm talking",
      "start": 1259.6
    },
    {
      "text": "and we just never corroborate it I guess but I've heard this it's been an ongoing from people so um I've heard this as of like we were still at IGN so like this I I my assumption is and I'm talking specifically about the Norse myth mythological thing yes so and you've heard this as well correct so um I would say that it's almost certainly real and I would expect that this is an E3 game and I would expect that this is a spring 2017 game okay um I don't know that for sure either of those things so far that's working out I agree with most of that I think so people like their God of War I personally don't care about it but maybe this will there's like some interesting stuff here old man God of War like he's older looks like from this is from the concept AR the gaffs okay uh Kuro Inferno writes in just like you can to kindafunny.com psq for your questions and says greetings Colin and Greg I have a question for you to regarding God of War some days ago a user on NeoGAF leaked some details",
      "start": 1293.84
    },
    {
      "text": "in just like you can to kindafunny.com psq for your questions and says greetings Colin and Greg I have a question for you to regarding God of War some days ago a user on NeoGAF leaked some details about the rumored God of War 4 in that threat it was stated that the game will take place in North mythology setting and Kratos will be the main lead as in the previous games in the series now assuming that this leak is legit my question is do you want Kratos to be part of this game or someone completely new to be featured in this setting I would love to hear your thoughts on this you say you don't care of course never going to be God of Warf no I but it's the the ironic thing is that the game play is great and two I played God of War 3 for a little bit I played Ascension at like events yeah I actually think I platinumed God of War one or two I don't know which one or I was like one trophy away I **** something up but um when it came to PS3 I uh so I like the way the games play very",
      "start": 1339.16
    },
    {
      "text": "I actually think I platinumed God of War one or two I don't know which one or I was like one trophy away I **** something up but um when it came to PS3 I uh so I like the way the games play very arcadey very quick I mean those are the kinds of games I like there there's a there's a ninja Guiden DNA in there there's a you know there there's a lot of what I like in terms of the gameplay it's just that Kratos is a terrible **** character he's absolutely awful and he's unlikable but he's supposed to be but he's not like Tony Soprano unlikable or something like that where it's like you kind of like I **** hate Kratos he su's no depth to him there's no character to him no exactly I'm mad all the time Aries so the the ironic thing is that I don't want more God of War because I don't like Kratos but you can't really have God of War without Kratos so it's like having Uncharted without Drake like you couldn't really do it he is the God of War so I'm kind of in the middle to a catch",
      "start": 1381.24
    },
    {
      "text": "Kratos but you can't really have God of War without Kratos so it's like having Uncharted without Drake like you couldn't really do it he is the God of War so I'm kind of in the middle to a catch because I'd like more of that gameplay and I'd like Sony Santa Monica to take advantage of their knowhow in that gameplay because they they they make great games like in the vacuum that's like those are great games it's just that the aesthetic you know in terms of I I shouldn't even say aesthetic the the story and the voice acting and the characters like this **** sucks you know and and that's just always the way I felt about God of War it's what I hate when people like we're so up Sony's ass like have you ever heard me talk about God of War before like that's one of their most popular Fran I hate it that's the thing about it if it's a different kind of Kratos if it is that he's older he's seen things he's if there here my whole problem with Kratos has been what I've talked about in I",
      "start": 1419.04
    },
    {
      "text": "I hate it that's the thing about it if it's a different kind of Kratos if it is that he's older he's seen things he's if there here my whole problem with Kratos has been what I've talked about in I think when I reviewed the collection back in the day is the fact that he's just a terrible character and for for a character to work you need to be able to root for them get attached with them feel with them and Kratos feels nothing he is all anger that is all he's always up here at 10 which means there's no he's just a cartoon he's stupid you know what I mean like there's no characterization to him there's no reason for me to cheer him on there's no reason for me to want him to go out and kill these people I get it that's it's super sad that your family was killed and they're as you killed your family under the power of the Gods their ashes are your skin now that's a cool **** thing I would love some moments of weakness in there I would love you to be sad about it and come down there and",
      "start": 1454.2
    },
    {
      "text": "family under the power of the Gods their ashes are your skin now that's a cool **** thing I would love some moments of weakness in there I would love you to be sad about it and come down there and explore some kind of range right so if it comes out here and like I don't know what what's his motivation going to be to go after the Norse gods that's a cool idea I like and as it just now he's out to eradicate every God every deity ever also a pretty cool idea but I'd love a step forward for Kratos that was always my thing with um the uh ready at dawn games right is that they were always telling like oh well this is about his brother and this is about their relationship with their mother I was like this is cool this is the kind of **** I want and that I remember those were the games that really got me into God of War some people really like those games they were great I loved them but I didn't love Kratos in them I love those games in spite of Kratos God of War I is a great example of",
      "start": 1492.84
    },
    {
      "text": "got me into God of War some people really like those games they were great I loved them but I didn't love Kratos in them I love those games in spite of Kratos God of War I is a great example of it of like God of War I is a spectacle and it's beautiful and it's fun and it's like I just don't I just don't care about Kratos at all at no point do I ever worry about him so like when we get to our ending and it's a cliffhanger it's like I I really don't care it is one of these situations I do believe that we for me there are two major franchises that son has that just don't resonate with me and it's Killzone and it's got a war and Killzone went in the right direction with Liber or not Liberation with with Shadowfall and no with and with uh what's the one on Vita why can't I think of it mercenary mercenary uh liberations the PSP one the those so they started like trending I'm like okay like I actually want to kind of see Killzone and with three and then Ascension three I was like I just",
      "start": 1529.48
    },
    {
      "text": "mercenary uh liberations the PSP one the those so they started like trending I'm like okay like I actually want to kind of see Killzone and with three and then Ascension I really was like I just can't **** do this and Ascension I was like oh no like the multiplay is actually pretty fun but but um this is not why I play games so I'm like they're trending in the other direction so yeah while Killzone has something to prove to me when it inevitably comes back in terms of Ken they sustain what I think shadowfall did really well and I think Shadow Fall is a great game um I know some people don't a lot of people don't agree with that but I think Shadowfall is a great game especially for a launch game and but God of War has so much more to prove to me and I'll play it but I don't care and I would have rather have been I've been way more of course they're gonna work on a s Santa Monica is very cryptic because it appeared that they weren't working",
      "start": 1568.08
    },
    {
      "text": "and I'll play it but I don't care and I would have rather have been I've been way more of course they're gonna work on a s Santa Monica is very cryptic because it appeared that they weren't working on anything yeah but they're clearly working on something and they were working on two games they're a big that's a big **** studio now they're hiring 50 more for another team so you assume that that's the canceled space teams kind of slot to go and work on something new so this God of War game I'm interested I'm I'm intrigued but I I'm I it's clear what I want out of that and I don't know if they'll deliver but the problem is and not the problem I guess is that I was I loved the PSP God of Wars you know what I mean and I don't know if it's because putting them into a small onto a smaller screen changed my expectations of what they were the ability to like stop and go on and you know and like that it makes sense then for how shallow C but when I'm on a big screen I want a bigger bigger",
      "start": 1604.76
    },
    {
      "text": "changed my expectations of what they were the ability to like stop and go on and you know and like that it makes sense then for how shallow C but when I'm on a big screen I want a bigger bigger experience if that makes sense they definitely nail it's it reminds me a lot of Assassin's Creed where they Nail In Assassin's Creed they don't nail the gameplay they nail everything else right like the especially Assassin's Creed 3 is always my example I love how the game looked and it was awesome the game sucked though like who wants to play and with God of War it's such a shame because the gam play is so well it's just nothing about it makes you want to play it good gameplay is at the core of every great game or most great games I mean there are games that don't have great gameplay and we have to make exceptions for those Journey or gone home through four home these are fun games but typically when you're playing an action game you want to play it and they nail the gameplay that's why I play",
      "start": 1639.92
    },
    {
      "text": "make exceptions for those Journey or gone home through four home these are fun games but typically when you're playing an action game you want to play it and they nail the gameplay that's why I play through them even though I don't care about this D yeah I just can't like it just there's too many other games to play that's the problem way too many other games number two all in the VA Evolution Studios the now defun Sony own Studio behind the MotorStorm franchise as well as the PS4 racer Drive Club lives again most of the Team Evolution which was shut down by Sony towards the end of last month will be joining publisher Cod Masters as a fully owned racing developer toiling away on a new IP for the company according to games industry International quote code Masters has stepped in with an unprecedented deal to keep the team together and working on new projects bringing Evolution Studios as a whole into the fold and making it a part of the Cod Masters family most of the staff including",
      "start": 1673.52
    },
    {
      "text": "unprecedented deal to keep the team together and working on new projects bringing Evolution Studios as a whole into the fold and making it a part of the Cod Masters family most of the staff including co-founder Mike Mick Hawking will be joining Cod Masters as a separate team working together from the same offices I have this saying fix it for your notes no one will ever see same offices to produce brand new IP for the British racing specialist previous IP remains in the hands of Sony but hacking and his team will essent continue Evolution Studios work under new ownership end quote so there's a lot of misconceptions about this and I couldn't really find answers although it seems like the games industry International story is the is the The Hub of where all this shit's coming from it seems like they were the ones that had the scoop um Evolution wasn't purchased by Cod Masters there's no Sony there's no money that's changing hands at all they're picking up the people um they're Sony's",
      "start": 1709.16
    },
    {
      "text": "like they were the ones that had the scoop um Evolution wasn't purchased by Cod Masters there's no Sony there's no money that's changing hands at all they're picking up the people um they're Sony's lost all this Talent basically to them and I don't think they can be called Evolution Studios anymore uh and they're not going to be working on the IP they'll be working on PlayStation games still but they'll be working on Xbox games as well so congratulations to them game Cod Masters is well known now for their racing gam and it's a great fit right that's what you that's what Cod Masters does so yeah congratulations to all those folks yeah I'm glad that they landed on their feet it seems like basically almost the entire team's intact so um very smart very shrewd move um shrewd because maybe not though I mean they did kind I mean I don't mean to be rude but they did bungle Drive Club at least certain certain people or certain parts of that studio just don't just don't bring over the online",
      "start": 1748.4
    },
    {
      "text": "though I mean they did kind I mean I don't mean to be rude but they did bungle Drive Club at least certain certain people or certain parts of that studio just don't just don't bring over the online infrastructure folks bring over the people who make the cars look good the end result of Drive Club and the previous games that studio worked on uh are great people love Motor Storm um people love even the games before that and people obviously love Drive Club so um and Sony loved it enough to buy the studio so um so congratulations to those guys a welld deserved reprieve number three PS4 firmware 3.50 is live and you've probably already downloaded it mess with it a bit but there are more tweaks fixes and new additions in the firmware that meets the eye Reddit created a so called Mega thread to compile some of the under the radar additions to PS4 via 3.50 so while we knew you could now appear offline or search communities easier or play music from your USB again unannounced tweaks include",
      "start": 1785.2
    },
    {
      "text": "compile some of the under the radar additions to PS4 via 3.50 so while we knew you could now appear offline or search communities easier or play music from your USB again unannounced tweaks include party member limits from to eight users disabling of screenshot notifications and life from PlayStation tweaks as well the PS4 Reddit has full list if you want to check it out props to the users there for compiling all that so it seems like there's a lot of backend **** that they did not talk about that is fixing I don't know why they would do that it's weird they nerds like us would dig in and get it on their own they need to make enough about it like things that weren't even in the P stink surprises here's a surprise yeah seems a little weird to me yeah when has Sony been normal never number four naughty dog is apparently open to Uncharted continuing not under them but under a different developer in a conversation with Games Radar nauy dogs Neil Druckman answered a question about",
      "start": 1822.84
    },
    {
      "text": "number four Naughty Dog is apparently open to Uncharted continuing not under them but under a different developer in a conversation with Games Radar Naughty Dogs Neil Druckman answered a question about another Studio taking the mantle to which he said quote if they made a great game I'd be excited I'd want to play an Uncharted game I didn't work on excuse me it' be a lot of fun obviously we would have a big part in it as the creators of the franchise but we just want to make sure they get the essence of it right Ellipsis if there's a studio that can do that then great if not then it's okay that this is the last one and quote it's important to note that it's not ultimately up the Naughty Dog what Sony does with that IP um but they will respect naughty dog if they want to continue it what this tells me is this going to be either those two things is a red herring and Drake's dead at the end of Uncharted 4 um or it is it tells us that Drake's alive and well the in the story can continue but",
      "start": 1855.8
    },
    {
      "text": "tells me is this going to be either those two things is a red herring and Drake's dead at the end of Uncharted 4 um or it is it tells us that Drake's alive and well the in the story can continue but you can also tell Back stories as well so of course yeah prequels as they say number five would you care would I mean would you be excited for an Uncharted not not by them yeah because we played a great Uncharted not by them so I I so the proof's already in the pudding for me number five the much anticipated and long in development PS Vita exclusive Severed which we are downloading on our vas now finally has a release date it will launch on the handheld on April 26th the game comes by way of Drinkbox Studios the team behind the mutant blobs games as well as Guacamelee it will cost $14.99 and will be 10% off its opening week if you are a PlayStation Plus user um so that will make make it what 13 or 1 50 1350 something like that I hope it's awesome 1350 everything I've seen or played from",
      "start": 1893.68
    },
    {
      "text": "will be 10% off its opening week if you are a PlayStation Plus user. Um, so that will make make it what, 13 or 150, 1350 something like that. I hope it's awesome. 1350 everything I've seen or played from it I really really enjoy. I hope it last for as long as the game. My suspicion is it's going to be awesome. Now this is where I want to kind of get on my soap boox for a minute here. Soap Box, we we referred to this when we did our let's play of at GDC which is on youtube.com/kindafunnygames. We cut it out so you can look at it. It's actually going to be annotated at the end of this episode of PS I Love You XOXO. Now we don't know if the game's going to be good or bad, we don't, but this is a make or break moment for Vita owners and it really really is. Drinkbox Studios could be doing anything they want. They can work with multiple Publishers. They make Guacamelee. They can be making a sequel which they can cash in on. They're not doing that. They spent two years making a Vita exclusive called Severed.",
      "start": 1934.6
    },
    {
      "text": "they can work with multiple Publishers. They make Guacamelee. They can be making a sequel which they can cash in on. They're not doing that. They spent two years making a Vita exclusive called Severed which is a dungeon role play game, first person role playing game and let's assume we'll find out before the game comes out. We'll be able to talk about it so listen to us again. I'm not telling you just buy it regardless, unseen, no, but if this game is great and it probably will be because everything they made is great based on the Pedigree and you own a Vita and you don't buy this then like really how dare like complain about the the of V games. These guys in 2016 are giving you an exclusive V game for 15 bucks that looks fantastic. We know what they can do. We've played their games. We know exactly what they're capable of and we have to put our money where our mouth is with this game. I'm telling you right now we have to put our money wear on mouth is so we'll check back with you we have to",
      "start": 1974.2
    },
    {
      "text": "what they're capable of and we have to put our money where our mouth is with this game. I'm telling you right now we have to put our money wear on mouth is so we'll check back with you we have to look at the Embargo information and stuff like that when we play it and we be beat we'll have our honest opinions and if the game sucks then we're going to steer away from it but I highly doubt the game's going to suck so we this is a this is an important game for us mhm as V fans and Axium Verge is another important game for us and we already know the game's awesome so you should buy it if you don't own it on V but we must pay attention to this and show them show Sony and show Drinkbox andge and let they may not sell two million copies of game I sell a million copies of game but can can we sell a couple hundred thousand copies of their game can can we make it profitable for them and make it worthwhile for them can we make this 2016's Taco Masters what you're saying yeah exactly so more on that",
      "start": 2018.84
    },
    {
      "text": "hundred thousand copies of their game can can we make it profitable for them and make it worthwhile for them can we make this 2016's Taco Masters what you're saying yeah exactly so more on that in the coming weeks but I wanted to set that seed cut ahead to PS I Love You XOXO episode 33 we're like a it's terrible it's not going to be terrible there's no way we've played it and and we've seen it and it's not going to be terrible so I just wanted to say that because there's so much chitchat about VA this and V that well you're getting one you're getting a **** game from a top tier developer and now it's time to support yeah now it's time to put your **** money where your mouth is don't sit there and be like well I'm sure it'll be free on Playstation Plus eventually I'm sure there'll be a giant not just it's time to go time to move so let's see what happens in the coming weeks we'll have more on that soon number six according to a GDC presentation given by World of Tanks developer War",
      "start": 2055.6
    },
    {
      "text": "giant not just it's time to go time to move so let's see what happens in the coming weeks we'll have more on that soon number six according to a GDC presentation given by World of Tanks developer War gaming there are 36 million active PS4s in the world right now compared to 19 million active Xbox One consoles. This coupled with fresh data from the game industry analyst edar paint a Rosy picture for PlayStation 4 especially when compared to its primary competitor. Edar has PS4 at 36 or 37 million sold at the end of 2015 with about Xbox at about 20 million units. Interestingly Vita is shown at about 11 or 12 million unit sold so um and I'm saying about or approximately because it is bar graphs with increments of five and it is hard to tell or actually 10 I think and it's hard to tell like where it is um and you can see that the numbers aren't equal but it's giving us so like actually edar has Xbox one selling more at the end of 2015 than wargaming has Xbox one selling now but they're",
      "start": 2093.04
    },
    {
      "text": "where it is um and you can see that the numbers aren't equal but it's giving us so like actually edar has Xbox one selling more at the end of 2015 than wargaming has Xbox one selling now but they're calling them active units as opposed to Total console so anyway it gives us an idea that the numbers are about two to one for PS4 Xbox One and we'll have a little bit more on that in a minute stay tuned Ted I think we will I think I wrote In Here didn't I or don't no iess I mean stay tuned there's other things coming there's lot there's a lot in the show outside of just that's not important the news and the no the numbers I'm interested in what you think of this one well we talked about on Colin Greg live but maybe the audience wrote in about it number seven donut Drake will not be making an appearance and Uncharted for at thief's end for those unfamiliar donut Drake was a humorous morbidly obese version of the handsome and fit Nathan Drake and can be found primarily in previous Uncharted",
      "start": 2135.4
    },
    {
      "text": "and Uncharted for at thief's end for those unfamiliar donut Drake was a humorous morbidly obese version of the handsome and fit Nathan Drake and can be found primarily in previous Uncharted multiplayer modes word comes by way of game radar who spoke with Naughty Dog's Neil jman about why this popular skin was removed quote I didn't want to have a laugh at someone's expense I thought we'd mature be matured beyond that we actually had the whole thing modeled and in there but we decided to make the call not to do it we had a big debate about it and kind of approached it from all kinds of angles and decided we weren't comfortable having it in our game end quote no one rode in cuz no one cared this bothers me I know you get real upset about this one yeah you don't believe Neil dman you think he's giving you the L one too no I I it's not that we talked about this I believe Neil dman we know him and I trust him what I'm talking about here is the chilling effect of um making artists skeptical",
      "start": 2176.56
    },
    {
      "text": "giving you the L one too no I I it's not that we talked about this I believe Neil dman we know him and I trust him what I'm talking about here is the chilling effect of um making artists skeptical or timid about the things that they're doing for humor or for anything just to express themselves however they want want to be mean and I think that this is proof that regardless of what Neil jman feels or says because I believe what he says that they don't want to be mean spirited they don't want to do all those kinds of things they mature they grown up that's fine but to me this is an example of what happens to creators mindsets when they're afraid of feedback or they're afraid of negative feedback and they saw this donut tr's a institution in Uncharted and they and they saw this and were like now people are going to get upset about it you know that's that's my whole take on it my thing I I don't agree with you necessarily I I we're both believing Neil but I'm taking the different TCT of",
      "start": 2211.64
    },
    {
      "text": "now people are going to get upset about it you know that's that's my whole take on it my thing I I don't agree with you necessarily I I we're both believing Neil but I'm taking the different TCT of like I don't think it's a chilling effect here as much as it is them being the people who are offended by it this is a dumb joke we used to put in cuz it fat people we're funny or whatever and we're not that anymore that's not who we are we don't want to make that that's not our statement to make we are the artist and that's not the statement we want to make sure they don't have to make any St they want to make but is it not but the question is is that off limits is it off limits to make fun of fat people or obese people we're both overweight yeah what up team fat you I know people say that I'm not but like you know you don't get this **** gut you know I'm 40 pounds heavier than I was in college mhm I just have skinny arms and stuff like that you just you don't see you don't see the",
      "start": 2258.52
    },
    {
      "text": "I'm not but like you know you don't get this **** gut you know I'm 40 pounds heavier than I was in college mhm I just have skinny arms and stuff like that you just you don't see you don't see the middle area yeah yeah yeah um so we're not both spelt individuals yeah um and I'm not saying that I am as fat as donut Drake is and you're not as fat as but I just I'm wondering what the I think there's more to be told from this story not necessarily from N doger Neil dman who I believe about their intention but generally what people talk about when they're afraid of censorship or afraid of complaining about nonsensical **** mhm it's like well then you're just people are timid in gunshot like why can't you make fun of whoever you want why can't you be mean if you want to be mean I'm not saying you should be or have to be but if you want to make a mean spirited thing that should be within the realm of possibility view even if it's just done not necessarily in the mean Spirit but to be",
      "start": 2296.6
    },
    {
      "text": "you should be or have to be but if you want to make a mean spirited thing that should be within the realm of possibility view even if it's just done not necessarily in the mean Spirit but to be funny but it is still mean if that makes sense but the whole point is like what you're saying totally makes sense and if they wanted to be mean and they wanted to make a fat joke and they wanted to do all this they would I think that what it's getting back to is that they don't want to do that I think you look at naughty dog is the people who are waving the flag the games are art we can be give you an experience better than movies can be on the level of books all these different things right and so I don't think Neil Duckman who is somebody I I think of and I I think of for sure and I imagine he thinks of it himself too that he's an artist his team is artists and that's not part of their art they want to make something that can be taken seriously and can stand on its own and can be all these",
      "start": 2338.92
    },
    {
      "text": "thinks of it himself too that he's an artist his team is artists and that's not part of their art they want to make something that can be taken seriously and can stand on its own and can be all these great things and it's a goofy leftover you know it's this heirloom or whatever that's tucked away in their attic not to mention that I've always thought the donut Drake thing was kind of dumb cuz it was always one of those a whole bunch of those unlockables are like you don't unlock so you've beaten the game like Platinum to the game it's like why the **** would I come back to this game I've now I'm usually pretty angry at by the time I Platinum it why would I double back to play as this fat guy or whatever I guess what I'm saying is that I don't want timidity to seep in to the creation of games or anything but and what I'm saying is neither do I I just don't think this is the case I think we're looking at it from we're talking from two two different perspectives I can totally see in",
      "start": 2375.0
    },
    {
      "text": "games or anything but and what I'm saying is neither do I I just don't think this is the case I think we're looking at it from we're talking from two two different perspectives I can totally see in the Uncharted Bullpen The Naughty Dog Bullpen them having conversation and they come through and it's like is that what we are but then to flip it to developer X who's sitting there about to make a game like enter the gungeon or game like whatever the **** it's going to be right and they're like hey here's a great idea let's put a fat guy in the game ha and they all laugh and they go but we shouldn't because then a person X on Twitter is that I totally get right like you need to have a vision and you need to do it and that's where the chilling effect comes into play where it's like that those conversations are happening in developers all the time but I don't think fat donut Drake fits for Uncharted 4 with what naughty dog is in 2016 sure I mean that's that that's possible and I think I'm",
      "start": 2413.16
    },
    {
      "text": "conversations are happening in developers all the time but I don't think fat donut Drake fits for Uncharted 4 with what naughty dog is in 2016 sure I mean that's that that's possible and I think I'm just using them as an example of something else I don't think that it's them that's doing anything wrong I don't think you're doing anything wrong if you self-censor so I guess it's your right to do that yeah I just I just wonder it's like We As Americans get made fun of a lot we you know we make fun of Italian and Irish people I'm Italian and Irish like that's fine with me I guess I just don't want anything to be off limits some of the **** that's said about Americans is super mean-spirited but I don't think that you shouldn't do it some of it's really funny even if it's mean and I'm not saying donut Drake is funny I'm just looking at this situation entirely and being like well this seems to be a product of something greater than this specific game that's all I'm saying and I think that",
      "start": 2450.88
    },
    {
      "text": "donut Drake is funny I'm just looking at this situation entirely and being like well this seems to be a product of something greater than this specific game that's all I'm saying and I think that that is true I don't think that they're necessarily making that decision Neil saying that they're not based on the entire at large kind of situation in the industry but there is a situation at the in the industry there's a situation in the industry I definitely think chilling effects happening I don't think that's what's happening here cuz I mean how long what have we been making Uncharted for 10 years now like what they've been making it for one of the jokes we thought were funny 10 years ago that nowadays I'd be like no that's actually really insens Absol right I'm not saying I'm necessarily right I just want to put it out there okay number eight Sony has revealed the top selling games from the PlayStation Network as always these listings only include digital sales of games and not",
      "start": 2488.36
    },
    {
      "text": "right I just want to put it out there okay number eight Sony has revealed the top selling games from the PlayStation Network as always these listings only include digital sales of games and not applicable retail versions on PS4 the top 10 bestselling games were in order the division salt and Sanctuary rocket League mlb1 16 the show Minecraft EA Sports UFC Hitman Far Cry Primal heavy rain and Sword Art Online re Hollow fragment on PS3 re Hollow fragment no okay on PS3 the top 10 bestselling games were in order Alice madness Returns The Last of Us Uncharted Drake's Fortune Minecraft Uncharted 3 Drake's Deception Uncharted two among Thieves Medal of Honor Frontline JoJo's Bizarre Adventure All-Star Battle Resident Evil 4 HD and Call of Duty Black Ops 3 the top 10 bestselling games on Vita were in order Jack and Daxter collection Assassin's Creed 3 Liberation Digimon story cyber sleuth monster monpiece mamasa rebirth XCOM Enemy Unknown plus Minecraft Breath of Fire 3 super Stardust",
      "start": 2522.6
    },
    {
      "text": "were in order Jack and Daxter collection Assassin's Creed 3 Liberation Digimon story cyber sleuth monster monpiece mamasa rebirth XCOM Enemy Unknown plus Minecraft Breath of Fire 3 super Stardust Delta and Oddworld Strangers Wrath HD and you want to talk about a developer that won't censor themselves whoever made Monster monpiece and the top 10 best-selling PlayStation Classics were in order bully Grand Theft Auto San Andreas Fatal Frame 3 the tormented Resident Evil Resident Evil 3 Nemesis Fatal Frame Crimson butterfly Manhunt Fatal Frame Silent Hill and Mega Man X4 Black Ops 3 Fallout 4 rocket league and Mortal Kombat X dominated the p PS4 DLC charts while Black Ops 3 and Destiny dominated the PS3 DLC charts and it says black oops black oops number nine steal yourselves because the remake of Final Fantasy 7 is coming to be mult is is coming wait that doesn't make any sense there we go steal yourselves because the remake of Final Fantasy 7 is going to be multiple fullsize games",
      "start": 2571.64
    },
    {
      "text": "remake of Final Fantasy 7 is coming to be mult is is coming wait that doesn't make any sense there we go steal yourselves because the remake of Final Fantasy 7 is going to be multiple fullsize games this according to the gamees producer Yoshi Nori katasi who told Game Informer for a Game Spot that the team working on the Remake is using Final Fantasy 13 three game structure as a model quote this reimagined epic will be the next Core Final Fantasy installment or rather installments when the project was first announced people were confused by its multipart nature but the goal is to structure it more like Final Fantasy 13 than an episode series and quote this according to the game inform forer itself so this is not a katasi quote katasi says quote it will essentially be a full-scale game for each part of the multipart series in 13 each installment told the story from a different angle it was kind of like approaching an unknown territory in that sense whereas with Final Fantasy 7 remake",
      "start": 2616.08
    },
    {
      "text": "each part of the multipart series in 13 each installment told the story from a different angle it was kind of like approaching an unknown territory in that sense whereas with Final Fantasy 7 remake we already have a pre-existing story so it wouldn't really make sense if this that isn't encompassed in a multi-part series Ellipsis so if we're just looking at each of these parts one part should be on part with the scale of Final Fantasy of one Final Fantasy 13 game end quote he later went on to say specifically about how the Remake will differ from the original that quote I along with nooran and no jiman who are involved with the Remake we also involved with the original Final Fantasy and when he says this I mean I think he means Final Fantasy 7 we were the people who created it so in that sense we don't think anything is Untouchable that isn't to say we're changing everything okay end quote how do you feel Colin it's terrible absolutely terrible I don't know what they're thinking with",
      "start": 2662.08
    },
    {
      "text": "sense we don't think anything is Untouchable that isn't to say we're changing everything okay end quote how do you feel Colin it's terrible absolutely terrible I don't know what they're thinking with this you this is not going to please people this is not what they wanted when when they asked to remake Final Fantasy 7 this is not what we asked wanted one game they wanted one game we wanted a remake of Final Fantasy 7 yeah not you going back to the **** well and figuring out what you did wrong and fixing it or making it Final Fantasy 13 is not good I'm sorry and like they they now when they say they somebody wrote in on uh the twitch chat right that when they say that they're saying they want it like Final Fantasy 13-2 now that it's like the way the game plays I'm not being clear for listeners and viewers it says the structure specifically that's the word they the structure yeah bad idea we're never going to get those games in any timely fashion either yeah by the time you get Final",
      "start": 2697.36
    },
    {
      "text": "and viewers it says the structure specifically that's the word they the structure yeah bad idea we're never going to get those games in any timely fashion either yeah by the time you get Final Fantasy 7 part one you're still what three four five years out two I don't know what they're thinking with this number 10 the very first official tease of Titanfall 2 has been dropped pardon the pun in the form of a short trailer we know little about it other than that a full review will happen on June 1 this is during E3 and there's animals in it the original Titanfall was only on Xbox One Xbox 360 and PC but publisher EA and developer respawn have already confirmed that the sequel will also come to PlayStation 4 and yes will have the single player campaign the original so sorely lacked number 11 capcom's Yoshi Nori Ono has responded to criticisms surrounding Street Fighter 5 specifically about its lack of of content and the fact that it may have been rushed in order to be entered into a",
      "start": 2740.6
    },
    {
      "text": "11 capcom's Yoshi Nori Ono has responded to criticisms surrounding Street Fighter 5 specifically about its lack of of content and the fact that it may have been rushed in order to be entered into a prolific fighting game tournament in an interview with Game Informer relateded by Gamespot Ono said quote I think it's safe to say that we underestimated the popularity of some of the single player features that said we are excited about the two allnew single player modes character story and survival and we have plans to continue to refine and expand onto those experiences ellipses as we stated in the past Street Fighter 5 is an evolving platform that will continue to get more refined and built upon over time for us this is a marathon and not a Sprint and we appreciate all the words of support as we embark on this journey together end quote and then about the Capcom Pro Tour which is why so here's what he says about this because this the big conspiracy theory about this was that this is why",
      "start": 2779.76
    },
    {
      "text": "we embark on this journey together end quote and then about the Capcom Pro Tour which is why so here's what he says about this because this the big conspiracy theory about this was that this is why the game was delayed or rushed rather it came out probably sooner than it should have and he basically missed it that's true now he says the Capcom Pro Tour wasn't the only reason for why the game was released when it was we understand that if we had more features ready at launch it probably would have been better received by some of our more casual fans who tend to enjoy Street Fighter more via single player content as opposed to competitive play there's a delicate bance between our hardcore and Casual players we understand that the game serves several needs and will continue to work hard to strike that perfect balance so that we can live up to our Street Fighter for All Mission andot Street figh Fall so he says it tacitly that it's not the only reason not the only reason but they",
      "start": 2814.84
    },
    {
      "text": "to strike that perfect balance so that we can live up to our Street Fighter for All Mission andot Street figh Fall so he says it tacitly that it's not the only reason not the only reason but they certainly got tried to get it out in time it seems reading between the lines for the Capcom Pro Tour MH how do you feel about any of that no I don't I don't I don't but I know we have fighting fans out there sure number 12 the prestigious bafta Awards which stands for a British Academy of film and television and cardred last week the awards ceremony Crown Fallout 4 is the best game of 2015 Playstation 4 exclusives bloodborne everybody's got to the Rapture and until dawn also picked up awards for best design for bloodborne audio achievement best music and best performer for Rapture and best original property for unold Dawn other games that won awards that appear on PS4 include Batman Arkham Knight which won best British game and Rocket League which won best Multiplayer and best sports game so",
      "start": 2850.12
    },
    {
      "text": "property for unold Dawn other games that won awards that appear on PS4 include Batman Arkham Knight which won best British game and Rocket League which won best Multiplayer and best sports game so congratulations to all the winners of baa good job guys number 13 the long dormant fear effect franchise which is owned by square enx is officially making a comeback fear effect sedna which is being kickstarted with the blessing of square enx is uh being pitched by French developer Sushi who previously worked with square enx on a smaller title the kickstarter project should be underway by the time you hear this story so head there to support it if you'd like fear effect saw two releases on PS1 the original in 2000 and its sequel in 2001 and a third game on PS2 called Inferno was under development but canceled in 2003 remember when you can get games like year after year after year after year in the same franchise those were easier they were smaller now you're going have to wait sioner five",
      "start": 2888.28
    },
    {
      "text": "but canceled in 2003 remember when you can get games like year after year after year after year in the same franchise those were easier they were smaller now you're going have to wait sioner five six years for the second part of Final Fantasy 7 and now number 14 the wrapup long development side scrolling sequel Rocket Birds evolution is coming to PS4 and Vita on April 6th Don't Starve Shipwrecked is headed for PS4 sometime this spring visual novel psychopath mandatory happiness which takes place based around the anime comes to PS4 inv Vita on September 13th Capcom has delayed its upcoming shooter umbrella core which is coming to PS4 until June 1st square enx has revealed that a new game in the Valkyrie Profile series Valkyrie an anatomia the origin is coming out in Japan this spring the platforms have yet to be revealed the series Heritage is on PlayStation the original came to PS1 in 1999 so we'll see and finally Telltale Games is is acting as publisher for Seven Ways to Die the",
      "start": 2921.68
    },
    {
      "text": "platforms have yet to be revealed the series Heritage is on PlayStation the original came to PS1 in 1999 so we'll see and finally Telltale Games is is acting as publisher for Seven Ways to Die the survival horror game that came to PC in 2013 it will be coming to Playstation 4 in addition to Xbox One and that is all for the news o Colin psychopath is a cool name don't think about the anime but I like the name of the game but it's so far out if I wanted to know what was in mom and grop shops right now where would I go you go to the official list of upcoming PlayStation 4 PlayStation 3 PlayStation beta sometimes PSP software by the Kinda Funny co-founders this is a big this is maybe the biggest week the year in terms of prolific games coming out although that there is not many games coming out okay there's a bigger one we haven't talked about at all and I don't think we're going to talk about big names oh I know what you're going to say Dark Souls 3 comes to PS4 digital and a retail as",
      "start": 2961.28
    },
    {
      "text": "out okay there's a bigger one we haven't talked about at all and I don't think we're going to talk about big names oh I know what you're going to say Dark Souls 3 comes to PS4 digital and a retail as fire as fires fade and the World falls into ruin journey into a universe filled with more colossal enemies and environments players will be immersed into a world of Epic atmosphere and darkness through faster gameplay and Amplified combat intensity Place yourself once more and embrace I'm sorry prepare yourself once more and embrace the darkness pleas do you play you try you do I mean we've had it for a couple weeks I know but you are you going to do anything with I maybe okay you ever going to get back to bloodborne maybe okay too many games B Shock Infinite yes the The Collection I will play The Collection yes Fallout maybe okay Ratchet and Clank comes to PS4 digital and at retail Ratchet and Clank blast on the PS4 for the first time with a new game based on elements from the original",
      "start": 2999.12
    },
    {
      "text": "The Collection yes Fallout maybe okay Ratchet and Clank comes to PS4 digital and at retail Ratchet and Clank blast on the PS4 for the first time with a new game based on elements from the original Ratchet and Clank Ratchet and Clank on PS4 takes a deeper look at the character's origin stories and modernizes the original gameplay featuring several new planets all new bosses new Clank gameplay new flight sequences and much more with completely new visuals constructed with the power of PS4 the power of this little guy risk of rain which looks **** awesome we've had this game for a little while but I've not had a chance to play it comes to PS4 Envy a digital crossby risk of rain is an action platformer with Rog likee elements with permanent death as a primary feature players will have to play their best to get as far as possible fight on a mysterious planet with randomly spawning enemies and bosses either alone or three friends in online co-op with more than 100 items at your disposal",
      "start": 3037.76
    },
    {
      "text": "their best to get as far as possible fight on a mysterious planet with randomly spawning enemies and bosses either alone or three friends in online co-op with more than 100 items at your disposal you must secure the tools you need to find your way back home sounds great Samurai Warriors for Empires comes to PS4 digital this is out on the 11th so this is out by the time you you hear this no matter what time you hear it the latest title in the acclaimed Empire series is here a new intuitive system of political Management in which the best officers can be placed in their most effective position makes its first appearance while Cooperative battles are powered up Genesis mode in which you can create your very own Waring States era allows you more individual customization than ever before great and finally Stories the path of Destinies comes to PS4 digitally it says in stories each choice you make takes Renardo into a unique narrative from tongue and cheek takes on Heroic Adventures to dark",
      "start": 3075.12
    },
    {
      "text": "and finally Stories the path of Destinies comes to PS4 digitally it says in stories each choice you make takes Renardo into a unique narrative from tongue and cheek takes on Heroic Adventures to dark love crafty and scenes story's repertoire is a as diverse as it is action-packed but rhynard's fateful decisions won't always be easy sometimes retrieving a weapon lost at the beginning of time means sacrificing the life of an old friend and that is all she wrote you care about stories no it's been bouncing around for a while but I I don't care no yeah yeah interesting Colin yes time for topic of the shows TOS this one comes from he over at kindafunny.com psq when you get your PS I Love You XOXO questions red it's going to make you feel old col this month will be the fifth anniversary of the great PSN outage looking back how did the outage change things did Sony Wing back your trust or do you think that consumers just forgave and forgot in short now that enough time has passed do you",
      "start": 3110.0
    },
    {
      "text": "the great PSN outage looking back how did the outage change things did Sony Wing back your trust or do you think that consumers just forgave and forgot in short now that enough time has passed do you think the outage had a historical imp had had had the historical impact you thought it would no no I thought it for sure when we were living through the dark times when it was down for pretty much an entire month when they were lying about what was happening and why it was happening all these different things it seemed like that was a black eye that would never fade it seemed like Sony got socked right in the **** face and Xbox would be able to laugh forever and hang their hat on that on the fact of like our network runs and didn't go down and your shit's safe and this is the whole thing but it honestly when it happened was devastating it was **** up but it also really was the first shot in a war of like how many people like that was like that was when everybody was like oh ****",
      "start": 3156.24
    },
    {
      "text": "but it honestly when it happened was devastating it was **** up but it also really was the first shot in a war of like how many people like that was like that was when everybody was like oh **** we're really vulnerable and then what every Christmas after that has been the docs attack or the the D yeah exactly not take everything offline and you can't use anything and like people are buying these systems and plugging them in and they don't work because they can't get online to get the firmware and it's like you see it over and over again so I don't know it was such a crazy holy **** moment that this was happening and that this was going on that Sony wouldn't have an answer or a fix for so long but it was just really I think the first wakeup call to where we were with games in online gaming yeah I I I will agree with you that this didn't have the resonance that it should have had I won't even say that it would have or could have it should have had more of a resonance it didn't and",
      "start": 3201.92
    },
    {
      "text": "yeah I I I will agree with you that this didn't have the resonance that it should have had I won't even say that it would have or could have it should have had more of a resonance it didn't and I remember when we were at IGN and this was all happening I was like **** like this could be so destructive to PlayStation that they might never recover from this that this is going to end them not Sony but and PlayStation's dominance or PlayStation's ability to really resonate with people because they can't be trusted or they couldn't be trusted with exact with the security ofit information where did all this go **** up I really thought it was going to be the end of people putting their credit cards in you know what I mean that it would be I'm going to buy the Amazon Points and put them in there and do it this way why would I ever trust you with that information again my personal data and they do but the thing that kept people coming back is that PlayStation is um it's a great environment",
      "start": 3243.92
    },
    {
      "text": "and do it this way why would I ever trust you with that information again my personal data and they do but the thing that kept people coming back is that PlayStation is um it's a great environment for gaming it's a great environment for exclusives it's an ecosystem that people have been in for a long time people kind of forgive and forget whether or not that's the right to do or not I don't know I don't think that we hold companies accountable as much as we should for huge mistakes and that was a very inconveniencing mistake I remember talking to Bank of America that day um right when this happened I called them and I was like I I needed to like change my debit card number and they were like oh like what happened when they were doing or whatever and I'm like you guys are about to get **** destroyed by calls by the way I'm just like letting you know like it was in the middle of the work day no one had read anything yet I'm like she's like oh I remember being like Oh no um and then",
      "start": 3279.28
    },
    {
      "text": "destroyed by calls by the way I'm just like letting you know like it was in the middle of the work day no one had read anything yet I'm like she's like oh I remember being like Oh no um and then kind of alluding at the end of the call that they were already starting like an influx of calls and I'm like just letting you know like this is this is 80 million people yeah um are affected by this so expect to hear from you know a couple hundred thousand of them probably what's interesting in retrospect is I think in a lot of ways that was the beginning of the one of the big humbling moments to become the PlayStation they are today you know what I mean where we are a company we do make mistakes and here's Cass and here's Shu and here's people here's Mark CER you know what I mean like we aren't just the logo with a million people working it people had to come out front right and stand in front of it and be like hey we **** up you always talk about the bow right at the Japanese press",
      "start": 3315.12
    },
    {
      "text": "just the logo with a million people working it people had to come out front right and stand in front of it and be like hey we **** up you always talk about the bow right at the Japanese press conference when they finally figured out what was happening and what they were going to do and all these different things and how they stayed down for what like 30 seconds 45 seconds or something like that yeah yeah it's a very that's a great people should go look that clip up it's very Japanese in a good way in terms of like you know I don't mean that as an insult I mean that as like a very honor driven really unique sort of situation you would never see in the United States yeah and it was the beginning of them saying we have to have people out in front of these messages we have to have people who we have to be able to admit when we **** up and do these different things and you had seen it before with Shu becoming a phenomenon but it wasn't like where it is now in terms of people getting",
      "start": 3352.8
    },
    {
      "text": "who we have to be able to admit when we **** up and do these different things and you had seen it before with Shu becoming a phenomenon but it wasn't like where it is now in terms of people getting out there you suddenly had personalities that mattered when the stuff happened and when the **** hit the fan you knew who to talk to and then it also did the same thing where we always talk about right of like the PS3 generation starting and Beyond starting that was galvanizing this audience right of like well **** it we're do or die we're here no matter what this is you know we're connected to this brand and we're sit around for every week and **** about how bad it is or whatever this was another one where like locked in where like I don't I'll never forget that night when we came back to do the very Infamous uh the psn's back podcast drunk at which we almost lost right and we came back and it was refreshing the Playstation blog and getting texts from people working on the",
      "start": 3388.52
    },
    {
      "text": "back to do the very Infamous uh the psn's back podcast drunk at which we almost lost right and we came back and it was refreshing the Playstation blog and getting texts from people working on the Playstation blog at the time and like the map slowly lighting up as the PSN like rolled across the country back out to people and I was like that was a huge **** cool moment trophies and stuff yeah exactly it was like this really really weird thing of getting back in the groove with this and you that it was a company that is human run by humans and all these horrible things could happen but I I totally did think that they were **** that like they were going to come back and forever Microsoft would hang their hat on the fact of like Hey we're not that bad to their to their to Microsoft's credit they showed a lot of restraint although I think that it would have backfired if they did that and I think that they know that they're way smarter than Sony with their PR so it's they're just a way",
      "start": 3421.44
    },
    {
      "text": "they showed a lot of restraint although I think that it would have backfired if they did that and I think that they know that they're way smarter than Sony with their PR so it's they're just a way bigger company too and like a way smarter company I think in a lot of ways so I think that they were like just like lay off like they're the ones that always congratulate Sony when they release bloodborne or another exclusive whatever and Sony doesn't really say anything back so it's although Shu does with the personalities do um but yeah it does make me feel old because it doesn't feel like that long ago but no when when I when this one came in from high some I was like no way no way and I I went and looked up the 2011 the return one I was like holy **** does that feel like another lifetime ago but PS3 came back with the strong games too resistance three came out that fall Uncharted came out that fall three sure um and then the the train just kind of kept train kind of left the station",
      "start": 3460.72
    },
    {
      "text": "ago but PS3 came back with the strong games too resistance three came out that fall Uncharted came out that fall three sure um and then the the train just kind of kept train kind of left the station like it was just you know PS3 had a PS3 end ended up selling more than Xbox 360 worldwide so um no so I don't think I think it's an interesting question it's an interesting topic I don't think that it damaged them nearly as much as it could have or should have I will say have you changed he talks about have you forgiven and forgotten kind of thing so the sad thing you still put your credit card in not everywhere but there are certain companies that I trust like it would be like Amazon would it would be a catastrophe if if they were ever hacked yeah and I just trust that that's not going to happen maybe it will I don't know it inevitably will or Bank of America or your bank like Chase or whatever Bank you use it's like I just trust that these guys are running up and up because if they if",
      "start": 3496.48
    },
    {
      "text": "maybe it will I don't know it inevitably will or Bank of America or your bank like Chase or whatever Bank you use it's like I just trust that these guys are running up and up because if they if people can get into those and I've talked to people actually I don't remember I'm really interested in that that site Krebs on security which is like a website that comes up whenever this **** happens like when Ashley Madison was ha like this guy just like is's like an expert in in digital security and stuff and I was just reading that I was talking to someone exactly what we were talking about or how it came up but I was just asking like why are the banks not vulnerable yeah and there are reasons apparently like how like why they're not because they spend so much capital on protecting their servers um as opposed to PlayStation Network which wasn't protected at all so the random number generator that was not random the story is the best like that that ultimate was responsible that was the",
      "start": 3541.16
    },
    {
      "text": "um as opposed to PlayStation Network which wasn't protected at all so the random number generator that was not random the story is the best like that that ultimate was responsible that was the responsibility of like one person or one small group that like totally **** the entire thing up yeah probably same people that made the PSN name **** so they couldn't um **** that up too someone just randomly tweeted at me this weekend that his this is such an old video game thing that I don't know if it's true or not cuz you he his uncle or something work or brother or something works son saying that PSN Nam he's an engineer there saying that PSN n will haveen by the end of next year and I'm like the end of next year that's how far out we are what a **** I guess the end of this year he told him at the end of last year so the end of this year okay okay um that I believe but I belied every show when they talked about it let's just put it in the back of our heads he says it will be free oh",
      "start": 3577.96
    },
    {
      "text": "him at the end of last year so the end of this year okay okay um that I believe but I belied every show when they talked about it let's just put it in the back of our heads he says it will be free oh for as long as they've made people wait **** unsubstantiated nonsense rumor we can believe that Uncle but I did believe all the other **** that was told to me about the PSN name changes that were lies sure Titus tius tiex oh Titus man yeah very nice guy so yeah five years later I can't believe it Heim says P.S a moment of silence to commemorate the fifth anniversary of the great PSN outage you're clicking through the moment of silence that's not it's the opposite of it's like when you're in church and someone's coughing Colin it's trophy time what do you got for me this week what four games we should go over four games with trophies I think rap's a good one to go over how's yeah how is this Platinum Shing up so the so the game was the trophies weren't alive till this weekend so I have",
      "start": 3617.12
    },
    {
      "text": "we should go over four games with trophies I think rap's a good one to go over how's yeah how is this Platinum Shing up so the so the game was the trophies weren't alive till this weekend so I have not even pinged my trophies oh um oh dear but it seems like pretty achievable except for there are a bunch of bronzes for specific things that are going to be annoying I think so um so like you get well I won't even say who the bad guy is although I think you know like complete every Holocaust every Hollow card set is a gold complete the game in challenge mode is a silver collect every gold bolt is a silver acquire every weapon in the game is a silver upgrade every weapon to maximum levels is silver unlock every modification for every weapons is silver upgrade ratchet Health to maximum level is silver acquire every Gadget is silver collect every telepath uh telepathopus brain which is a **** annoying piece of **** thing in the game that's I am there's like 75 of them and I missing one",
      "start": 3664.32
    },
    {
      "text": "silver acquire every Gadget is silver collect every telepath uh telepathopus brain which is a **** annoying piece of **** thing in the game that's I am there's like 75 of them and I missing one and I have no idea where the **** is **** I like I that's probably two or three hours of the game is me just fly around looking for this **** thing I couldn't find it I was driving nuts I probably would have beaten the game like two days before uh win the Gold Cup on both rig uh rig realgar and CBO I have that one that's a silver complete every trespasser puzzle without using Auto hack as a silver and then uh there's a bunch of bronzes and this is where things get a little crazy because it's it's crazy um ride every catwalk without moving in CBO is a bronze um use theatron on every type of enemy like I just where are you going to know how are you going to know you know are there so many that you can't like just there's like 16 you're going to have to just go to the plants and spam",
      "start": 3699.24
    },
    {
      "text": "of enemy like I just where are you going to know how are you going to know you know are there so many that you can't like just there's like 16 you're going to have to just go to the plants and spam these things until it just **** pops sure um destroy 10 inactive warbots inside the quartu facility sheepen a BL helicopter Commander I love the sheat uh defeat four ene 40 enemies while jet packing in gas bar so it's just things you have to just go and knock out if you want and people already have the Platinum the game's not even out yet so it can't be that hard severed trophies are alive y uh severed let me see actually I didn't say about ratchet either so I should go back and and clarify Ratchet and Clank has 30 bronze 14 silver two gold and a platinum uh let's see sever has six bronze 1 Silver Six gold and a platinum and uh there's bronzes that are clearly Story related so remember what your mother taught you is one of them sever 10 enemies fully upgrade one skill tree devour every",
      "start": 3744.68
    },
    {
      "text": "Silver Six gold and a platinum and uh there's bronzes that are clearly Story related so remember what your mother taught you is one of them sever 10 enemies fully upgrade one skill tree devour every buff at least once breach a secret blind barrier breach a secret devour barrier those are all the bronzes and then um silver tropies filt minions sever four enemies in one encounter sever 50 enemies find every secret explore every area to 100% completion these are probably going to be annoying no not well the yeah probably it it reminds me of E I think it was oath of felana was that the one that was on Vita which one was memory of cels where there was a trophy for getting 100% in completion and like the I'm like where did I not go because I didn't walk into some **** corner of the map so it filled in it's like **** this and I feel **** it I'm out um but this one will be different cuz it's first person you see the map I don't think it's going to be that hard like I understand what",
      "start": 3784.48
    },
    {
      "text": "it filled in it's like **** this and I feel **** it I'm out um but this one will be different cuz it's first person you see the map I don't think it's going to be that hard like I understand what you're saying with yeast but I think that like that was too much ring on you whereas this is like turn turn turn go turn turn yeah hopefully hopefully there's a way to see them there is a map in the game so and then the golds are Sil sever 100 enemies fully upgrade all your skills and Equipment defeat The Grow Crow Golem defeat the cryptolith defeat the dragon finish the game after finding all momentos sounds pretty not easy but obtainable obtainable yeah Dead Island retro revenges troes are up this is the game that's supposed to be in the collection um nine bronzes three silver one gold no Platinum complete the final stage in story mode attain five stars on all SP levels complete Marathon mode reach wave 10 in survivor mode complete your first level Etc so it doesn't seem that bad but",
      "start": 3831.28
    },
    {
      "text": "Platinum complete the final stage in story mode attain five stars on all SP levels complete Marathon mode reach wave 10 in survivor mode complete your first level Etc so it doesn't seem that bad but there's no Platinum so you don't really need to even try to get them all and then risk of rain uh troes are alive no Platinum here either um nine bronze six silver zero gold zero Platinum what the **** is this garbage uh this one sound pretty fun though defeat 10 luran uh in one playr survive 40 minutes die 50 times kill a boss with lights out kill the magma worm wandering vagrant and Colossus fail a shrine three times in a row pass a shrine four times in a row find the bloated Survivor find the robot janitor which I want to find collect 15 monster logs Bank 10000 gold unlock a golden chest with the Explorers key collect four key cards drown 10 whals that's what it says I'm not saying **** I'm saying whals whals and deal 5000 damage in one shot those are the trophies there I'm",
      "start": 3871.92
    },
    {
      "text": "chest with the Explorer's key collect four key cards drown 0 whals that's what it says I'm not saying **** I'm saying whals whals and deal 5,000 damage in one shot those are the trophies there I'm looking for for to Risk of Rain on the V. I've had it on PS4 but it wouldn't so when I was trying to play it it would not come on V yet and I emailed Taylor we're the exact same human being and she's like it's not ready for V it's not up for V I got the same thing and I was like oh cool it's for both and I went to put it on this I'm like it was in the library yeah what the **** is this yeah I was like I'll wait so that's it for that cuz that's like that's pretty much the kiss of death for me ever playing your game on a PS4 when it says PS4V I'm like well there you go I'm GNA look now I'm G to continue to put into this I was just in my download list today and I didn't see it but tonight yeah that well yeah tomorrow right so a Verge is on here too I don't know what I'm supposed to do with",
      "start": 3913.4
    },
    {
      "text": "continue to put into this I was just in my download list today and I didn't see it but tonight yeah that well yeah tomorrow right so a Verge is on here too I don't know what I'm supposed to do with myself here because Hitman goes on here too I'm having a good run with VA right now yeah big Fest not so good everything else foul play ninja seni DX is really good it's **** hard which one's ninja it's like the one that's supposed to be like a Game Boy Color Sid scroller oh okay cool it's not hard to play but it's hard if you want any of the trophies and I do want the trophies Colin yes we have a question for trophy time this one comes of course from KindaFunny.com psq where you can go to get your question read just like two rounds left did hello Greg and Colin I have a trophy time question for you do you think that the PlayStation 4 will ever get the trophy progression tracking like Xbox One currently has for its achievements I think that this is a handy system and while not a must",
      "start": 3951.4
    },
    {
      "text": "for you do you think that the PlayStation 4 will ever get the trophy progression tracking like Xbox One currently has for its achievements I think that this is a handy system and while not a must have I think it would be nice hope you have a great day keep **** that chicken two rounds left what is he talking about I don't know if I know what he's talking about I don't so I put on a fake mustache over the weekend some disguises yeah jumped into Quantum Break playing on that their Xbox one in the living room what he's talking about is like in Quantum Break it's you know take out this number of enemies with this power right and when you go to your achievements it'll say for that for that achievement it'll say you have 76 out of 100 and that's for every game that's ubiquitous apparently according to him and I would that's how State of Decay did it that's how everybody else pretty cool I like that that's awesome it's a great idea this is what I'm talking about with the **** things for",
      "start": 3991.52
    },
    {
      "text": "to him and I would that's how State of Decay did it that's how everybody else pretty cool I like that that's awesome it's a great idea this is what I'm talking about with the **** things for Ratchet and Clank that would have been nice yeah exactly when will PlayStation 4 get this never maybe PlayStation 5 is your best bet yeah let's be P let's not even be patient let's just be realistic I understand a lot of you just got here to PlayStation Island we've been we've been rubbing sticks together on PS3 Island I've been yelling at volleyballs in the water from PlayStation Island for years now XMB on PS3 Island we've been hanging out with we're just happy we got trophies period on PlayStation 4 cuz remember when we thought those might not even PlayStation 4 even works exactly it **** has games we can play them good enough by me I got a firmware update once in a while no big deal it's it's great but it's another one of those and this is me Greg Miller who doesn't have a degree in",
      "start": 4035.28
    },
    {
      "text": "has games we can play them good enough by me I got a firmware update once in a while no big deal it's it's great but it's another one of those and this is me Greg Miller who doesn't have a degree in game making it's one of those backend things that developers I think would have to have from the get-go with their SDK like how they work on the PlayStation 4 how you build out your trophies for the PlayStation 4 you'd have to have it in there so it doesn't work now you've seen games in the past very few games you've seen games in the past having an in-game menus and that's basically the same thing except that the PlayStation doesn't know how to read that that's not how it's going to happen so maybe a PlayStation 5 perk I was actually impressed seeing as how since I when I play the Xbox right I'm rarely in I never I'm never in it for the achievements so I'm like whatever I don't care if I get I get them cool that's fun I'm like a normal person it whereas like I'm aycho with the PlayStation",
      "start": 4067.08
    },
    {
      "text": "rarely in I never I'm never in it for the achievements so I'm like whatever I don't care if I get I get them cool that's fun I'm like a normal person it whereas like I'm aycho with the PlayStation stuff when I jumped in the Quantum Break thing they had a whole bunch of cool little **** that I was like oh this would be fun to have cuz I don't know if you know this you don't probably when you look at your Xbox One trophies right or achievements they call them over there I think they came around after trophies though so it's weird um when you jump in kidding I'm kidding everybody calm down Jesus you jump in to look at them right like uh it'll show you like you have you have 80 you've you 80% complete on this game right on full completion and then it'll rank you out of your friends like it'll read your friends list and go there and then that's cool we'll never get that either no and it's like time played it's like the individual trophies will have these not the um overall achievement",
      "start": 4106.28
    },
    {
      "text": "read your friends list and go there and then that's cool we'll never get that either no and it's like time played it's like the individual trophies will have these not the um overall achievement percent they're straight out you and it's like they'll give you little crowns like I had I had a bunch of gold crowns cuz I'm the number one State of Decay friends list player player on my friends list but I had a bronze another one that's really cool they have a whole bunch of little bells and whistles this Xbox man it could be going places we made names on PlayStation Networks 10 years ago we can't even change them so you know we're not getting any of this anytime soon doesn't automatically ping you got to go in there confid the engineering uh acument of of Sony right now but we'll we'll see what they're getting better they're getting better undo undoing illness illnesses of the past basically with this **** oh this username shouldn't infuriates me I know I'm sorry I mean it is what it is",
      "start": 4140.56
    },
    {
      "text": "they're getting better they're getting better undo undoing illness illnesses of the past basically with this **** oh this username shouldn't infuriates me I know I'm sorry I mean it is what it is I have something to make you feel happy I don't even really care at this point cuz my name just says Col Mor already anyway in the PS4 exactly yeah that's the whole thing too I forget I noticed you and I don't know when you did it but you changed your regular icon from the to Mega Man I like that a lot that's good it's cute that's a great shot of Mega Man it is a really good shot on Mega Man yeah people think that I care because of my own username and I do I mean I would I don't know that I I would probably change my name but I actually just care because it's **** stupid yeah that you can't do it I care for all of you put a pin in that because the next topic is a new segment and it has something to do with that but first I need to tell you that trophy time was sponsored by none other than",
      "start": 4176.12
    },
    {
      "text": "it I care for all of you put a pin in that because the next topic is a new segment and it has something to do with that but first I need to tell you that trophy time was sponsored by none other than Loot Crate col yes Loot Crate is a monthly subscription box service for epic geek and gamer items in pop culture gear for less than $0 a month you get 48 items that include licensed gear apparel Collectibles unique one-of aind items and more make sure you head to loot crate.com slps and enter the code PS to save $3 on a new subscription they guarantee more than $40 in value in every crate sometimes even a lot more spring is springing so grab a map your bag of holding and some friends April's theme is Quest we're forming a party to explore everywhere from far off kingdoms to Worlds hidden within worlds with exclusive items from Labyrinth Harry Potter History Channels Vikings which I love questing in and Uncharted for and of course we've got our t-shirt and loot pin to help you equipped for",
      "start": 4212.36
    },
    {
      "text": "worlds with exclusive items from Labyrinth Harry Potter History Channels Vikings which I love questing in and Uncharted for and of course we've got our t-shirt and loot pin to help you equipped for your adventures remember you only have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate and when the cut off happens Jackie T that's it it's over so go to loot crate.com PS and enter the offer code PS to save $3 on your new subscription today is uh Spock versus Mirror Image SP over you missed it Spock versus Mir Spock the great rivalries of all time Batman super Batman Superman and Spock versus miror image Spock whatever the **** his name I know that that's one of the great rivalries of all time up there with ulyses as Grand Robert E Lee go Kan and Abel Batman Superman north of the South and Spock versus me Spock Colin yeah we have a new segment this one's submitted from KindaFunny.com psq you get to kick back because now we turn the show over to Adam",
      "start": 4259.24
    },
    {
      "text": "Superman north of the South and Spock versus me Spock Colin yeah we have a new segment this one's submitted from KindaFunny.com psq you get to kick back because now we turn the show over to Adam Gurnee for his new segment dear shoe head his new segment his new segment dear shoe this is waging the dog other people can do it I don't care anybody can write in first time poster and question an alternate alternative you're given someone that's never posted before his own segment dear Shui submission is it's a letter to Shui anybody can write letters to Shui psq kind ofcom necessarily use them/ psq you go there you leave your message to hey maybe we read it I'm going to take some water here cuz Adam's got a lot to say oh God usually when I try to make them bad I can't make them bad for you they're worse when you don't try dear Shui please please please and please allow us to apply filters and run searches on our PSN downloads list when I go to my download list on the PlayStation store",
      "start": 4311.2
    },
    {
      "text": "they're worse when you don't try dear Shui please please please and please allow us to apply filters and run searches on our PSN downloads list when I go to my download list on the PlayStation store website it now runs 96 pages and contains videos PS1 Classics VA PS3 and PS4 downloads including demos DLC themes avatars and full games if that wasn't bad enough a huge chunk of my download list has now decided that the purchase dates have been lost and always default to the first and current calendar month this means even if I could search through my confirmation emails for a specific item I can no longer guarantee that quickly clicking through the pages and checking the dates will be the way to locate them yes I know that if I know what specific I'm it I'm looking for I can just search for it in the store but the problem is that sometimes store Pages for a game will not recognize you if purchased something and give you a download option whilst the download list will always have a",
      "start": 4359.68
    },
    {
      "text": "for it in the store but the problem is that sometimes store Pages for a game will not recognize you if purchased something and give you a download option whilst the download list will always have a download button if you can find what you're looking for so please Shui ask your database managers to create some basic tools that make our overindulgences more readily accessible yours Adam Gny AKA Yen rug I like this new segment I want to call it dear Shui though I want to call it please Shou you call comma Shou with a request but here's the thing every week we have a new request but the thing is with the even though he doesn't he's not sh Shosid is in charge of all the first party Studios so he has no power anything here the thing about it is that we end I'm with you on that what you're saying but remember we always end I'm saying worse no yeah we do that too but we're always PSN's worst name of the week is always please Shui let us change our names that's why I like the dear Shui and I",
      "start": 4405.28
    },
    {
      "text": "but remember we always end I'm saying worse no yeah we do that too but we're always PSN's worst name of the week is always please Shui let us change our names that's why I like the dear Shui and I I'm with you these these **** Turtles out there watching this show had a turtle audience no there a lot of turtles watching the show uh I thought it was it was he comes here I'm like the ga to add a new segment and first off he he talks about it a dear shoe thing or whatever and it's just like okay and then you read through it I'm like this is good this isn't like a stupid give me more colors for the PS4 this is an actual real thing that you and I would have to deal with a real nerdy PlayStation issue us and the other turtles have to deal with sure I'll out it good job Adam give a round of applause Colin yeah let's check in with the readers hello readers you got a bunch and when I say you knows of Uncharted Four questions you ready yeah C Duffy 44 says Hey GRE and Colin I was fairly",
      "start": 4453.92
    },
    {
      "text": "of applause Colin yeah let's check in with the readers hello readers you got a bunch and when I say you knows of Uncharted Four questions you ready yeah C Duffy 44 says Hey GRE and Colin I was fairly surprised to discover that just this week another 15minute long Uncharted 4 demo was revealed showcasing yet another section of the game this is the third demo of its kind we've seen along with two trailers do you guys think that the developer should hold back a bit to avoid spoiling more the game when it eventually comes out Uncharted 3 for example would have had a greater element of surprise if we hadn't seen epic parts of the game like the boat and plane before its release I'm staying away from the Uncharted Ford demos for now but the temptation to watch more just might be too much for me in the next few weeks I understand that Uncharted is one of PlayStation's B biggest exclusives and that they need to Market it accordingly but surely one trailer in a demo would be enough no cheers",
      "start": 4495.28
    },
    {
      "text": "in the next few weeks I understand that Uncharted is one of PlayStation's B biggest exclusives and that they need to Market it accordingly but surely one trailer in a demo would be enough no cheers Lads Craig from dubland dubland dubland Ireland he probably knows Amy you said Dublin that's what I was asking duin I don't know what that wait what did I say Dublin OH I put a d on Dublin d u b l i n apostrophe D which is Dublin mainstreamed I'm gonna start doing that all right from now on if you're from Dublin you're from Dublin uh yeah they're showing way too much **** they are not showing too much they're fine they've learned man Uncharted 3 was when they **** it up with the subway commercials and the plane exploding and this that and the other and here's the thing the did you you didn't watch our let's play right that demo the demo is totally like here are mechanics of Uncharted okay I'm driving a Jeep all right oh I can Mark people I can you know I can mark them so I see them I",
      "start": 4539.52
    },
    {
      "text": "watch our let's play right that demo the demo is totally like here are mechanics of Uncharted okay I'm driving a Jeep all right oh I can Mark people I can you know I can mark them so I see them I know that you're roing it for me already oh Sully Can Has Wings Sully can fly oh Chloe's back she's from Dublin uh it was all it's all mechanic stuff it's totally not showing you a giant people thats it's not you're not going to like this game then welcome you didn't like metal gear too bad you don't like this game why are they doing this uh so you can see people that's not what Uncharted is Uncharted well Drake has an optic eye now probably does doesn't he H maybe uh they're showing all these mechanic things to get you used to that part they're not showing you the giant epic sex pieces they're not showing you the story pieces they're not showing you I'm fine I'm I actually think they've done a really good job of showing me enough to keep me engaged but not showing me too much I've only seen",
      "start": 4577.16
    },
    {
      "text": "showing you the story pieces they're not showing you I'm fine I'm I actually think they've done a really good job of showing me enough to keep me engaged but not showing me too much I've only seen Elena for a brief instant you telling me come on now come on now Stanley I think they're doing F now Stanley Jericho reference of all time some out there gets it it's only funny to you and I uh I think they're doing a great job of not ruining Uncharted but showing you enough I think that the trailers they've shown the the demo they've shown of well you know here's a little bit of Nate talking and then the one giant we're going through getting chased through the wall things on fire oh my God Elena bam that's the real demo that we've seen the other ones have just been now you can use the hook and you can fall down and you can go into stealth and out of stealth now really only watch like the original thing and that's it like with the hook and I think we're so close you're not going to see much",
      "start": 4619.96
    },
    {
      "text": "you can fall down and you can go into stealth and out of stealth now really only watch like the original thing and that's it like with the hook and I think we're so close you're not going to see much more you will get probably they're already putting out the trailer one trailer's already we're close I mean we're we're like less than a month away from I know it's crazy right I think right it's or something no don't check we we don't have codes they're not going to give us Cod Uncharted a month before it comes up you don't know when they're you don't know what they're going to do two weeks before two week before I would say even maybe less than that maybe the weekend before the weekend before it comes up so not even two weeks it's a very obuse way of saying  that we have so many codes I don't want I I honestly don't even want Uncharted right now please don't give it to me and don't give me Uncharted before the tropies go live because I'm sick of this **** with ring Clank where",
      "start": 4657.28
    },
    {
      "text": "I don't want I I honestly don't even want Uncharted right now please don't give it to me and don't give me Uncharted before the tropies go live because I'm sick of this **** with ring Clank where I have no idea what the **** going on with my trophies collect the treasures kill these I mean could look at PSN profiles I just things that my PS is going to die or something that happened to me remember that happened to me with Rainbow Moon Rainbow Moon with a debug dying and I lost all my **** trophies sure I don't like that **** no I don't like it either Odino writes in and says I've been just finished replaying all of the Uncharted games in preparation for the release of four and it has be wondering I don't think you did Golden Abyss fight for Fortune come on get the **** out of here will Uncharted 4 have a supernatural element like all the previous games I've heard people complain many times that it's becoming predictable at this point but despite that I always find it fun and",
      "start": 4690.76
    },
    {
      "text": "will Uncharted 4 have a supernatural element like all the previous games I've heard people complain many times that it's becoming predictable at this point but despite that I always find it fun and interesting to see what new thing Naughty Dog comes up with for the game would you two be disappointed if you finished Uncharted 4 and there wasn't any kind of Supernatural surprise the multiplayer beta included an item that slowed time which hasn't been in any previous games but naughty dog has been cautious about spoiling things in the beta before making Charlie appear as a villain in the beta to maintain the surprise of when Charter 3 is opening do will it have an a supernatural twist probably I guarantee it will but I that's not a problem I mean these are so modeled after Indiana Jones which also had Supernatural twist so it's not like um that's a problem it's they're still grounded in reality as much as you can be with this kind of game where Drake has murdered 1,500 people at this",
      "start": 4731.96
    },
    {
      "text": "also had Supernatural twist so it's not like um that's a problem it's they're still grounded in reality as much as you can be with this kind of game where Drake has murdered 1,500 people at this point life um but I got to tell you like more I don't want to say this is going to sound so negative and it's not the way I'm saying it but it's just like there are just certain aspects of the gameplay that I'm like actually more concerned about than the story I think the story is going to be great I have no problem with that but it's like the the choice thing this marking enemies thing it's like what tell me that they're going to upgrade guns in this thing I'm going to lose my mind okay UPG no uh I think it'll have a supernatural element a Twist and I and if you're counting Uncharted 3's twist or Supernatural thing then then yeah for sure it will uh but I would you be disappointed if there wasn't one no me neither tell the story you need to tell but yeah but it's it's when you think about it",
      "start": 4770.48
    },
    {
      "text": "Supernatural thing then then yeah for sure it will uh but I would you be disappointed if there wasn't one no me neither tell the story you need to tell but yeah but it's it's when you think about it more there's there's going to there has to be because we if it was just they're on an adventure and there's some bad guys and they killed the bad guys and now it's done it's well I what I got this i got this ink and pot at the end that's what I this was all for the N let's see what the tropies are Sam hit his apartment keys in this n years ago and then they got put in a museum and then that got broken into and they took the n and now I got to go get it yeah and Laura baile Bailey's character wants it too cuz she wants to get in that apartment she left one of her shoes in there just one of them just letting you know Neil I can write the next one Valkyrie X from NJ says Colin you mentioned in the last episode that you you don't think Naughty Dog will show anything at E3 this year but do you",
      "start": 4808.96
    },
    {
      "text": "just letting you know Neil I can write the next one Valkyrie X from NJ says Colin you mentioned in the last episode that you you don't think Naughty Dog will show anything at E3 this year but do you think it's possible that the single player DLC will be revealed there or is it too early since the game comes out in May I think it's too early because as far as they've said they don't even know what it is they don't even know what it is yet and they haven't start working on it so they're probably the game's gold so they're probably tweaking and making a patch now but I I assume the team's probably going to be off for a while so I don't expect that you will see the DLC until the end of the year at the very earliest and by that I mean not out I mean you'll see it at some point the last was left behind was a year right I'm thinking spring 2014 I want to say could be I could be wrong about that I could be wildly off about that but I feel like that's right was it I'll look it up because the",
      "start": 4844.56
    },
    {
      "text": "behind was a year right I'm thinking spring 2014 I want to say could be I could be wrong about that I could be wildly off about that but I feel like that's right was it I'll look it up because the way I would see this playing out is yeah E3 is too quick they don't have any I mean I I definitely think by now they have the idea for what it is Neil Neil and Bruce have kicked around something but I think by E3 you wouldn't have a trailer or anything which means that what PSX PSX you get a trailer timed with the game WS again that's when they do something yeah February 14th 2014 so it was almost a year after yeah so something similar to game came out in June so it's like in same for Uncharted right you go game has its run holiday leadup and then yeah December whatever you show your single player DLC then you release it in the spring give it time to breathe like they you'll see Uncharted 4 at E3 you know like they'll probably have it in a Sizzle reel and stuff like that of course so God",
      "start": 4881.44
    },
    {
      "text": "DLC then you release it in the spring give it time to breathe like they you'll see Uncharted 4 at E3 you know like they'll probably have it in a sizzle reel and stuff like that of course so God success of Uncharted 4 in the bundle hey guys it's me Jackie T Jackie T just just wanted to come out and tell you that Uncharted has been selling really well he gets like the little hook from off stage all right I'll see you guys later uh you want to talk about big franchises on that their PlayStation Colin let's go to Jersey Mike who wrote in at kindafunny.com psq just like you can says hey Greg and Colin longtime listener firsttime writer one of my favorite games on PS3 was Starhawk I was hoping for a sequel to this game but the developer Lightbox Interactive contract with Sony was abruptly cut do you guys know why this happened after only one game PS do you think Sony will hire another Dev to make another Hawk game yeah I was going to say Starhawk is not an original game it's a sequel",
      "start": 4927.8
    },
    {
      "text": "cut do you guys know why this happened after only one game PS do you think Sony will hire another Dev to make another Hawk game yeah I was going to say Starhawk is not an original game it's a sequel itself War yeah um which is the and Warhawk is a remake of an old PlayStation game right so there's a lineage here that I think that I say that because I think there's a lineat that they will be explored again I think Starhawk was just came out in that time 2011 I think 201 when too many games they're putting on an exclusive every month which sounded like a great idea oh clearly this is going to move units this is going to make things happen and no totally overwhelmed and flooded the market yeah I think that it was ultimately a blunder although I would have called it a success at the time um they just were **** out these exclusives that that just they just didn't need to exist so um will they go back to the Haw games I assume so um it seemed to me to be a Socom kind of situation too in",
      "start": 4971.64
    },
    {
      "text": "they just were **** out these exclusives that that just they didn't need to exist so um will they go back to the Haw games I assume so um it seemed to me to be a Socom kind of situation too in the sense of like the people wanted Warhawk mhh and Starhawk is a nice idea to like kind of you know sci-fi it up a little bit but it was also weird it wasn't it was like somewhat of a strategy game on what you dropped and where you bu built it and and it's like no I what I loved about Warhawk and like what I loved about Warhawk from the get-go that was the one of the first games at IGN where I was like we we had the test kits when I first started working there we had like Warhawk Wednesdays or whatever they were you jumped on and played with everybody it was just like it was death match but it was awesome you know what I mean jump in and if I always stayed on the ground Jeff haes always got in a Warhawk and then we just **** went around a wreck shop you know what I mean like that",
      "start": 5009.32
    },
    {
      "text": "but it was awesome you know what I mean jump in and if I always stayed on the ground Jeff haes always got in a Warhawk and then we just **** went around a wreck shop you know what I mean like that was awesome that instant action thank you very much that instant action of jumping in there and doing it it sucks that that moved away a little bit I think that they'll revisit I mean I just think that there are certain things that they're going to revisit and I think that that's one of them I still think Medieval is going to come back um Colony Wars I think should be in play I think Resistance will be back so I think that you just have to give these things time to breathe and time to for the right developer to have the right idea now why do you think the contract was cut was it because it didn't sell and they were like well I don't want to keep investing in this with light box yeah I don't know the nature that they have a multi-game deal with them that they cut they I was just looking at",
      "start": 5048.12
    },
    {
      "text": "sell and they were like well I don't want to keep investing in this with light box yeah I don't know the nature that they have a multi-game deal with them that they cut they I was just looking at Wikipedia and there was a contract yeah I'll read you the synopsis here but it's I don't think I knew that the studio relocated from Salt Lake to Austin in the fall of 2009 on October 17th 201 it was confirmed that Light Box's interactive contract with Sony ended and that Lightbox had laid off 40 employees the day after okay well it ended I mean their contract was up I I I guess what I'm wondering is like did they have a three- game deal with them that they got out of because that doesn't seem like something they would be allowed to do so I don't think that they I think that wording is a little weird it's not like they situation with Giant Sparrow or with that game company like we're getting three games out of you guys right um Edith Finch of course is going to be the second game out",
      "start": 5077.28
    },
    {
      "text": "little weird it's not like they situation with Giant Sparrow or with that game company like we're getting three games out of you guys right um Edith Finch of course is going to be the second game out of Giant Sparrow so I I think that the game was done and they didn't sell well same have with Superbot or some of these other Studios it's just that a lot of these Studios had centralized plans around Sony's funding and when that funding is pulled you're **** I think it's telling too that you know like it ended in what did light box do they moved on to do like iOS and mobile games and stuff you know what I mean like maybe their heart wasn't in consoles anymore and clearly you have to let people go because of the way this all goes and ends up that way that's just the business sadly you have to go and make games for what you believe in and hopefully what you think they believed in that now Colin we're going to get into a question here I don't think we have the answer I don't think I",
      "start": 5109.32
    },
    {
      "text": "have to go and make games for what you believe in and hopefully what you think they believed in that now Colin we're going to get into a question here I don't think we have the answer I don't think I emailed people about the answer but I don't think we'll get answers anytime soon from them but I think we put our heads together we can explain some things okay Tony from the Block writes in and says so I've been listening to you guys for years now you best friends have moved from Arizona nope that's right you best friends have moved from Arizona to New York to AK and back to AZ again you've brought me many laughs even some tears on that last beyond episode you have answered many questions without my asking I even met you guys at the first PSX I asked Colin about that which should not be named but I've searched the web and found nothing so you guys are my last hope I recently pre-ordered my psvr headset I bought two move controllers and have a PS camera too now I also have a gold wireless",
      "start": 5141.0
    },
    {
      "text": "but I've searched the web and found nothing so you guys are my last hope I recently pre-ordered my psvr headset I bought two move controllers and have a PS camera too now I also have a gold wireless headset which I love but I found out that the psvr uses both USB dongles is it possible to use this headset via a USB on the processing unit or maybe a USB hub or am I going to have to plug another wire into the controller to totally connect to the matrix thanks Tony from the Block PS Olivia's juice that's an interesting question I and here's I like it a lot good question of course we can only hypothesis we don't have it we don't know you know what I mean we don't have when they when you go to these demo events you don't have time to **** around with all this **** my my guess would be that similar the the vibe we have floating around in here right you have you already have the surround sound built into the headset you're wearing I imagine that there's a what is it 3.5 mm Jack for",
      "start": 5187.56
    },
    {
      "text": "that similar the the vibe we have floating around in here right you have you already have the surround sound built into the headset you're wearing I imagine that there's a what is it 3.5 mm Jack for regular for earbuds or whatever so I don't think you have to plug anything in your controller I think you're away from you don't have to worry about that and if memory serves correct me if I'm wrong in the comments I never went to the gold Pulse headset right or the gold whatever they call them the gold headset but I had a Pulse headset like that Gen one and there had a Jack in that one for the 3.5 that came with the cable too so theoretically you'd still have you're ready to go with uh cuz I believe the pulse would have that too or the yeah but I think that's saying like what what he's wondering I'm giving no I'm 100% with you sorry I'm giv there definitely a way to hardwire that you're going to be fine is what I'm saying to this extent though no I do not think the processing box has",
      "start": 5235.56
    },
    {
      "text": "I'm giving no I'm 100% with you sorry I'm giv there definitely a way to hardwire that you're going to be fine is what I'm saying to this extent though no I do not think the processing box has USBS of its own and I do think that yeah you're well you're clearly **** with having your two ports on your PS4 taken up however USB hub should work rockband did that on PS3 I don't understand why that wouldn't work here yeah that sucks if that's the solution though I wonder if the solution is simpler and more elegant I wonder I wonder if there's some sort because the headset is so fundamental like the the the headphones are so fundamental to the VR experience I wonder if there's some sort of way for it to read the Bluetooth off of your here's my now like because that is an interesting I would have never even thought of that until the **** thing was in my hands sure you know so that's a really a stupid question or do you use yours yes like once in a blue moon yeah I used to play the",
      "start": 5274.2
    },
    {
      "text": "have never even thought of that until the **** thing was in my hands sure you know so that's a really a stupid question or do you use yours yes like once in a blue moon yeah I used to play the division a bunch just cuz like I didn't want to wake people up yeah um but I don't I typically don't play with headphones see the thing about it is and not granted we can go we're going to have to go through our litany of times using the PlayStation VR usually it's an event usually it's around a million other PlayStation vrs this is a great question Tony because I've never ever thought about the fact that they're putting sh not not shitty but not **** gold headsets on you usually when you go to a Sony event and you play Sony games or Playstation games that's what you pick up they have the headset right there but now it's always been the wired ones it's always been these different ones it's never been I I would think if they had that working they would use it and the fact that they the",
      "start": 5313.96
    },
    {
      "text": "headset right there but now it's always been the wired ones it's always been these different ones it's never been I I would think if they had that working they would use it and the fact that they the argument would be the counter argument to be with like well we don't do here because we have 30 PlayStations and 30 PlayStation vrs there's interference and this wouldn't work you know what I mean but I've never thought about the fact that yeah they're putting on headsets that aren't we'll get an answer for you I I um Al probably knows yeah I hit up Al but we'll see so we'll see I it's just one of those an interesting question very question with the with the Vive having it already having an audio jack on it you imagine that this will have an audio jack on it sucks another Wire yeah I know but it's it's already on your head yeah you can just Loop it over around it's it doesn't matter we'll figure it out excuse me there's a Vive over there look like a gas mask it could be if you want it to",
      "start": 5351.84
    },
    {
      "text": "it's it's already on your head yeah you can just Loop it over around it's it doesn't matter we'll figure it out excuse me there's a Vive over there look like a gas mask it could be if you want it to be it can be whatever you want it to be and when you put on the VR eyes you're in the VR world and everything exists for you col would you like to talk about Sony Bend video chat capabilities free VR games or Horizon Zero Dawn Horizon I knew that was going to be the answer HUD does writes in and says hey guys Jackie D here now that Microsoft has announced the Gears of War 4 Launches on October 11th 2016 what date would you expect Sony to announce the launch of Horizon Zero Dawn if it still launches this year pretty please it will does it make sense to launch an exclusive game head-to-head with Microsoft or should they get as far away as possible HUD does PS will you game with me mark x for yes and O for no oh uh when do you when right now you're Sony you're up there in the big it's got to",
      "start": 5386.52
    },
    {
      "text": "Microsoft or should they get as far away as possible HUD does PS will you game with me mark x for yes and O for no oh uh when do you when right now you're Sony you're up there in the big it's got to be a November game okay I would get out of way gears L years have its time Horizon's new IP you're going to have a lot to prove you're going to need a little more time to prove it in the media they might need more time to finish it shoue told me that the game's coming out this year you know and I know things can change I do believe them I they need a game this fall they better have a **** game this fall who knows what the hell's going on with the Last Guardian that could be a fall game too fall 2004 um but uh yeah I think it's going to come out I think it'll be a November release probably a week or two before Black Friday uh push bundles cut the price of the PS4 do a bunch of **** with that game I think that that game is going to be huge cuz you basically have to give it a month after",
      "start": 5436.96
    },
    {
      "text": "week or two before Black Friday uh push bundles cut the price of the PS4 do a bunch of **** with that game I think that that game is going to be huge cuz you basically have to give it a month after gears like I I do you got to get out of Gears way cuz that's an established franchise it's going to move a gajillion units yeah I mean to be fair Halo didn't I mean I know people contest this but Halo did not sell as well as I think Microsoft so I don't know how well gears is going to do gears is not as resonant but I think gears looks way **** better see that's interesting you say that because I don't I think it resonates more I think there's more PE I I I actually hear people talk about and get excited for Gears you know what I mean I did not hear that for Halo I you and I didn't and not that we're the barometer or anything but this is the game we're stoked to play I talked to other people who weren't stoked to play Halo they're stoked to play this I think this is a different a little",
      "start": 5478.0
    },
    {
      "text": "we're the barometer or anything but this is the game we're stoked to play I talked to other people who weren't stoked to play Halo they're stoked to play this I think this is a different a little bit different and I I don't know why what happened with Halo that it burned into this and I though it was pretty obvious that that was going to happen I mean just no I'm with you I agreed with you when you said that was going to happen that's the thing here is I I feel like there's a different scent on the wind in this one I think people are are are ex exceptional I me if people haven't seen I we don't talk about Xbox games really on here but we did watch the uh The Sounds of Silence for Gears today on Conor Greg live and it's **** cool yeah that game's I think that game's going to be fantastic yeah I'm looking forward to it me too we're going to play it yeah living room we will we only have one Xbox One piz next to our 15 PS4 so we're gonna have to figure that out Derek writes in with the",
      "start": 5514.72
    },
    {
      "text": "yeah I'm looking forward to it me too we're going to play it yeah living room we will we only have one Xbox One piz next to our 15 PS4 so we're gonna have to figure that out Derek writes in with the final question over at kindafunny.com psq and says hey guys tonight I just wanted to play some little game on my PS4 but surprise surprise the network was down so I was locked out of all my PSN games while this doesn't affect me much right now because I can just play disc based games it makes me wonder if the future when almost all games are digital will Sony have to find some way to allow offline access for their games would like to know your opinions Derek Derek 411 turn on your PS4 go into it go over to settings and make this your primary PS4 if you make it your primary PS4 this won't happen to you anymore the problem is that they don't want me and Colin have Colin has a PS4 and I have a PS4 and I name share with him and whatever the hell happens PS3 people do that all the time so",
      "start": 5548.92
    },
    {
      "text": "happen to you anymore the problem is that they don't want me and Colin have Colin has a PS4 and I have a PS4 and I name share with him and whatever the hell happens PS3 people do that all the time so right this is just a security measure to get out that if you only have one PS4 there is no reason to worry about it put it as your primary PS4 and there you go problem solved you never have to worry about it again go live your life in the Galapagos Islands gpos mhm never heard of that place that's where all the turtles live oh didn't surpris gagos no no this is different this is where our turtles live it's right next to V oh the turtles I watch this show yeah exactly good internet on gabos island great internet on silent Colin yeah let me tell you about a best friend I love you in a we call PS I Love This best friend xoxo Go to con funny.com forums submit you or your friend to get some PSN friends this is what nesticle did NES named after the emulator of course yes I use your emulator in high",
      "start": 5591.16
    },
    {
      "text": "This best friend xoxo Go to con funny.com forums submit you or your friend to get some PSN friends this is what nesticle did NES named after the emulator of course yes I use your emulator in high school mag oh nesticle is the best it was awesome right I went there and played Ghostbusters oh my God all right not that I'm saying you should do that no well I mean that was a different at this point yeah I don't know I don't the the emulator thing is a little tough because you can buy a lot of these games now back when we were kids like in the '90s and early 2000s we didn't have Virtual Console we didn't have all these kinds of things the Funko land in your neighborhood didn't have this game I do say if you have no chance of buying the game then I don't and it's old it's really old I don't know that way going anymore I don't know that some getting rich might have an ethical problem but I don't know that really unethical either Nal rides in and says hey Greg Colin in the PS I Love You XOXO",
      "start": 5634.4
    },
    {
      "text": "that way going anymore I don't know that some getting rich might have an ethical problem but I don't know that really unethical either Nal rides in and says hey Greg Colin in the PS I Love You XOXO Community this friend shout out is from my buddy Justin who just recently crossed over from the Nintendo Community into ours I creeped his friends list and saw that he only has four please add him and make him feel welcome his ID is dark lord JD that's all one word dark lord JD and while you're at it why not add a veteran I'm not going to read yours nesticle trying to get trying to get all clever on that definitely don't tell dark lord uh that he should go back and play Splatoon and leave us alone on our Island where were you when we needed you there's no PlayStation 4 Island PlayStation 4 is a moving City in the sky there's all these like laders you just run by and grab it you climb you climb right up to us the PS3 is just like a a **** crater on the ground everybody go on the PSN friend",
      "start": 5675.32
    },
    {
      "text": "moving City in the sky there's all these like laders you just run by and grab it you climb you climb right up to us the PS3 is just like a a **** crater on the ground everybody go on the PSN friend and message dark lord dark lord J welcome him sist in the show game with him so on I'll be quizzing you shortly on Colony Wars very shortly what if he I mean so he's got to go back and get like he's reading go get PS1 got get n Yos too oh my God geez L I wanted to make a PS1 game Colin it's my turn for this week's forgotten PlayStation game I'm picking one that I know is special to you sunflowers sunflowers on V that a great game I finally deleted it cuz i' I've played it I enjoyed it it's a great you know it's a phone game or whatever it's another and you collect this and it's great you have fun it was it it was shockingly special to me I will say because really loved it yeah I don't know I just liked it I like that game no I know I I remember you being all up its ass as you say and then",
      "start": 5717.12
    },
    {
      "text": "fun it was it it was shockingly special to me I will say because really loved it yeah I don't know I just liked it I like that game no I know I I remember you being all up its ass as you say and then I got it and played on a plane ride and I was like this is great and I had it for a long time it's cute it's fun it's simple but it's a good time waster it's probably cheap as hell right now yeah I don't think it was I honestly think it might have been like a couple dollars even when it came out I don't know that it was like much more than that but I have no idea you should obviously look before you buy it no just blindly purchase everything on the store but uh yeah it's it's one of those games that was an iOS game but it doesn't count until it's on Vita it's the same thing with Hitman what is this someone texting you I'm GNA tell you Colin psn's worst name of the week are you correct are you ready I am I correct I don't know are you correct or you ready I'm",
      "start": 5765.56
    },
    {
      "text": "is this someone texting you I'm GNA tell you Colin psn's worst name of the week are you correct are you ready I am I correct I don't know are you correct or you ready I'm correct you're correct but are you ready no okay and the show but are you correct no Joe 6713 which isn't a great **** username either Joe he writes in and says my worst PSN name of the week is two girls Juan cup my brother Juan made his PSN name when he was 15 he thought it would be a funny **** awesome I know he thought it' be a funny play on words since the filters wouldn't catch it it was all fun games until I inherited his PS3 and PSN when he went to college playing online I am constantly mocked for my name and people think that my name is Juan when it's actually Joe I since had to get rid of the account and make a new one since it was so bad this almost killed me since I had been playing on the account for years please let us change our name shui please that's a **** great name",
      "start": 5797.92
    },
    {
      "text": "rid of the account and make a new one since it was so bad this almost killed me since I had been playing on the account for years please let us change our name shui please that's a **** great name when you do allow name changing specifically allow two girls Wan cop to not change his and to make it even better it's two girls but with a gur LZ two girls man that's bad never one cup no that's still great that's a **** funny name that's a great name that's a clever one I like that like Long Dong Silver our old friend he may he rest in peace remember him yeah I remember how I for sending us pictures of his girlfriend on a live stream in the morning list to this I'm sure probably doesn't uh but yeah I actually think your name's worse Joe 6713 so so think about that you think two girls one cup is that bad but whatever so funny that's a really good one I like that Bravo to Juan your brother Juan remember everybody go to kindof funny.com forums PS I Love You board there you can submit",
      "start": 5842.12
    },
    {
      "text": "cup is that bad but whatever so funny that's a really good one I like that Bravo to Juan your brother Juan remember everybody go to kindof funny.com forums PS I Love You board there you can submit your worst PSN name of the week remember you have to know the person or it's yours none of this rocket League **** none of the just random names yeah rocket League was **** up was muddying the well for a while wasn't it it was n Colin yeah in a rare move that was also sponsored are you ready for that I'm sure the sponsor thrilled they love two girls Juan Cup this one is for Armada we can't say cup after Wan cup we both said it weird like Wan cup Wan cup like what is it about the word Juan the noun W that we Armada is the new book from Ernest Klein oh I forgot I had one look at that from Ernest Klein the author of The New York Times bestseller Ready Player one which is being made into a film by Warner Brothers and legendary director Steven Spielberg Armada opens his high school student",
      "start": 5890.52
    },
    {
      "text": "Klein the author of The New York Times bestseller Ready Player One which is being made into a film by Warner Brothers and legendary director Steven Spielberg Armada opens his high school student Zack Lightman glances out his classroom window and spots a UFO at first he thinks he's going crazy a minute later he's sure of it because the ship he's staring at is straight out of a video game he plays every night a hugely popular online flight simulator called Armada get it that's the name of the book that's what's in which Gamers just happen to be protecting Earth from Alien Invasion Zack is sure's lost his mind but what he's seeing is all too real and his skills as well as those million Gamers across the world are going to be needed to save Earth from what's about to befall it now this is where it's interesting sure there's a book it's available now go get it whatever they're doing a contest to celebrate the paperback release of Armada the author and publisher are running a contest prizes",
      "start": 5932.6
    },
    {
      "text": "it's interesting sure there's a book it's available now go get it whatever they're doing a contest to celebrate the paperback release of Armada the author and publisher are running a contest prizes include an Oculus Rift virtual reality headset not a PSVR don't care a Thrustmaster Hoda's Warthog joystick sounds made up Hoda from hodus hodus hodas hodas Hodor hodas hus hodus hus hus the president of the United States joystick and many other Armada prizes such as sign books and posters for more info on how to play and enter visit armad book.com contest thank you Armada Books available now did you read Ready Player One cuz that was a lot CR everybody flipped out about it yeah I don't I don't know that I did I have it I have it on my shelf I don't know if I ever read it ladies and gentlemen this has been PS I Love You XOXO episode 31 thank you for joining us remember peace I love you XOXO posts every Tuesday remember it's kindafunny.com PlayStation podcast so go there subscribe and",
      "start": 5970.96
    },
    {
      "text": "this has been PS I Love You XOXO episode 31 thank you for joining us remember peace I love you XOXO posts every Tuesday remember it's kindafunny.com PlayStation podcast so go there subscribe and listen to the other shows remember it's the number one PlayStation podcast on the internet because of your support and we hope your support will lead you to San Francisco May 8th and 9th for Kinda Funny live 5.0 remember tickets are on sale now kindafunny.com ticks also the show post every Tuesday at 9:00 a.m. but you already knew that you just get it whenever you get it Kelly it's Kelly uh-huh happy anniversary to her as well five years of Kelly I wonder if he's still with Kelly no way not a **** chance in hell even though Zach and Kelly which I remember we were too drunk to pick up on the Saved by the Bell reference as it happened it drun that night I remember that night really well for some reason I don't remember many nights but I remember that one it was lot it was joy we had pure joy",
      "start": 6018.92
    },
    {
      "text": "Saved by the Bell reference as it happened it drun that night I remember that night really well for some reason I don't remember many nights but I remember that one it was lot it was joy we had pure joy flowing through us and a lot of 1st Amendment beer every episode of PS I Love You EXO XO ends in a song in a segment we call singing to Shouei remember if you are one of them Musical you need to go to kindafunny.com PSM give me a YouTube link and an mp3 for your song so I can annotate to your video at the end of our video or put the MP3 on our MP3 Colin you put your mp3 in the MP3 yo how you like MP3 so put your mp3 in the MP3 man Colin yeah this is an old friend of ours life in 4 frames is back if you don't remember life in 4 Fram TW about yesterday it's not a big surprise to me right now well I just don't think you pay attention to anything they were on a bunch of Beyonds played live beyond 300 Sacramento I believe right yes live in 4 frames writes and it says November",
      "start": 6064.92
    },
    {
      "text": "me right now well I just don't think you pay attention to anything they were on a bunch of Beyonds played live beyond 300 Sacramento I believe right yes live in 4 frames writes and it says November parenthesis heartbeats was the one of our first tracks written for our third full-length album Control Plus Z and what became the driving force for everything else to come it captures that specific moment in one's life when everything changes when life turns a person's world upside down it's the moment between death of the death of a former life and the birth of a new one for us this could be considered the pivotal quote unquote plot twist moment of The album's Narrative we've been waiting an incredibly long time to share this music with people and it's the most personal record we've done to date in fact it's a concept record it consists of 1 tracks January to December that will take you on a pretty crazy personal emotional ride album release doesn't have a date yet but we will be",
      "start": 6108.48
    },
    {
      "text": "to date in fact it's a concept record it consists of 1 tracks January to December that will take you on a pretty crazy personal emotional ride album release doesn't have a date yet but we will be preparing at least two more tracks and some exclusively stuff and some exclusive stuff through our mailing list which folks can sign up for on our Facebook page or visit the website life 4 frames.com remember everybody this is Greg the 4 is the number two4 so life in 4 frames.com launching today alongside this track is part one in our four-part video documentary series making control plusz which again can be found on our YouTube page and Facebook page it's got some really fantastic insight into what this process was like for us the last thing we'd like to do is Express the extreme amount of gratitude for the amount of support and love we have received over the years from you guys and the amazing Community you guys have built it is an honor to be part of it seeing people Tweet Tweet videos",
      "start": 6149.56
    },
    {
      "text": "for the amount of support and love we have received over the years from you guys and the amazing Community you guys have built it is an honor to be part of it seeing people Tweet Tweet videos of themselves dancing at their wedding to our music getting messages about how our music has helped them Prevail through Dark Times being a performer at Beyond 300 or even seeing a f even seeing fan-made videos is more meaningful than anything money can buy except maybe for PSVR pre-order but seriously thank you guys from the bottom of our hearts for all the love and support you all make creating music worth it I hope you enjoy the new song PS I Love You XOXO life in 4 frames what a what a gentleman group of gentlemen yeah it's weird because I gentle it gentle company gentle band gentle persons gentle peoples ladies and gentlemen this is life in 4 frames with November parenthesis heartbeats until next time it's been our pleasure to serve you",
      "start": 6191.4
    }
  ]
}
