{
    "id": 1684,
    "video_id": "PTCY2iM7e5M",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Kinda Funny vs. The World (Live Action) - Let's Play Live! Trailer (4K)",
    "description": "Get your tickets at http://RoosterTeethLive.com\n\nUse code FUNNY to show that the Best Friends are better than Achievement Hunter, Funhaus, ScrewAttack, and The Creatures! \n\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\n\n\nWatch the other versions of this video!\nAchievement Hunter: https://youtu.be/s_iXOHVcSU8\nFunhaus: https://youtu.be/pIUj0CpDn7A\nScrewAttack: https://youtu.be/RGmwsiuVGEQ\nThe Creatures: https://youtu.be/l5bHEico7dM\n\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1460998803,
    "duration": 198,
    "transcript_chunks": [
        {
            "text": "where the hell is this Starbucks we've been walking for 45 minutes? Yeah, Nick, I thought you said this was a shortcut. Fantastic. Was it a shortcut or not? Okay, look who it is. Kinda lame. My, well, well, well, if it isn't the Sony **** themselves. Kinda Funny, you **** right off, Creatures. Hey, IGN called, they want to know what it's like taking money from children from your **** up apartment. I do miss the IGN offices. Nick, get back over here. We've taken enough of your ****. Creatures, this ends right here, right now. Let's dance. You want to dance, Greg, cuz I want a Tango. Let's do this. Looks like we got some **** about to fight. Too bad Achievement Hunters here to kill you all. All right, oh, you didn't think you'd have a death battle without ScrewAttack, did you? Of well, would you look at this Funhaus, we got ourselves Little Nerd convi. You boys playing some D and D sucking each other off what a enger. All right, before we begin, let's go over the rules. Rule number one, do not hurt",
            "start": 1.56
        },
        {
            "text": "at this Funhaus, we got ourselves Little Nerd convi. You boys playing some D and D sucking each other off what a enger. All right, before we begin, let's go over the rules. Rule number one, do not hurt anyone's hands. We need them to play video games, of course, and that's it. B it. ScrewAttack sucks great. Oh, ****, it's our mom. No, no. Let's Play Live at the Doe theater in Los Angeles, June 17th at 7:30 p.m. Go to Rooster Teeth live.com and enter code funny.",
            "start": 79.76
        }
    ]
}