{
  "id": 1683,
  "video_id": "UIZyqKSA7Rc",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Laura Bailey",
    "Marisha Ray",
    "Matthew Mercer",
    "Portillo",
    "Travis Willingham"
  ],
  "title": "Critical Role x Kinda Funny: Dungeons & Dragons - The GameOverGreggy Show Ep. 123",
  "description": "The amazing Matthew Mercer, Laura Bailey, Travis Willingham, and Marisha Ray of Critical Role join us to play Dungeons & Dragons. (Released to Patreon Supporters on 04.08.16)\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1460703600,
  "duration": 6474,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Welcome to the GameOverGreggy Show cross Critical Role. I'm one of your hosts, Greg Miller, alongside the rest of the GameOverGreggy Show. Thank you for throwing up the X's. You all do it too. Do it. Hold on, wrong. Is it left over right? Matter do matter? It doesn't matter. Nick, just because if you wanted to thank you for being here with us today, Critical R. This is exciting cuz I'm the only one that's played D and D, so I'm interested to see especially how Greg does the produc SL producer Nick Scarpino. I tip my hat to everyone. Top of the morning. Why are you being so official? I'm supposed to speak a character. We're we don't know what our characters are in the morning to everyone. Ey over here, the one only P one, Tim Gettys. Let Tim host then is good. All the Critical Role folks right here, Matthew Mercer. How are you, Matthew Mercer? I'm doing quite well and happy to be here. You're the DM of Critical Role. We are. I'm the DM of Critical Role. We are the DM for today. Don't SPO that. Don't",
      "start": 36.36
    },
    {
      "text": "here, Matthew Mercer. How are you, Matthew Mercer? I'm doing quite well and happy to be here. You're the DM of Critical Role. We are. I'm the DM of Critical Role. We are the DM for today. Don't SPO that. Don't spoil that part. Let DM no hash. Don't that's going to be a huge mistake, I'm sure. Over there, hi Laura Bailey, how are you? Hey, I'm pretty good. Welcome back to the channel. You've been here before. Oh my gosh, I have. Things are great here. Thanks for having thanks. Damn Travis Willingham, how are you? Bourbon's good. It is really good. We're keep feeding to you for better content now. Don't be afraid of your mic, Travis Willingham. Hi, I'm right here cuz that's Kevin over there. When you see Kevin look at look at exactly when you see him do that or it looks like he's choking something that means to get close to micophone and then rounding out the group, The One and Only Marisha Ray. Hi there. Hey, how are you? I'm sharpening a pencil good. How's that going? Uh great, you know, do you bought some cheap ass pencils?",
      "start": 82.92
    },
    {
      "text": "to micophone and then rounding out the group, The One and Only Marisha Ray. Hi there. Hey, how are you? I'm sharpening a pencil good. How's that going? Uh great, you know, do you bought some cheap ass pencils grey? You know, there's one corner store in our neighborhood. I'm sorry, they didn't have the **** best mechanical pencils. It's not a Staples over there, right? Could work. All right, we'll make these are nice Russian people trying to make it work in America just just pencil. It's good. Don't worry you. We use your Critical Role money to pay for a new table over here. All that D and D Money. Now ladies and gentlemen, you might be saying Greg, you guys don't talk about D and D that much. Why would there suddenly be a Critical Role crossover that much? And the answer of when I say not much, I mean at all. The answer of course is that there's a son of a **** in the audience named Mike Ducker and Mike Ducker went to patreon.com kindafunny submitted his topic when he backed us for the month to get a topic",
      "start": 126.32
    },
    {
      "text": "of course is that there's a son of a **** in the audience named Mike Ducker and Mike Ducker went to patreon.com kindafunny submitted his topic when he backed us for the month to get a topic on the show and his topic goes like this, my topic for this week is a 1-hour show where the four of you play a game of Dungeons and Dragons any rule set with the following characters Greg human fighter named pterodon Master cleft Colin half elf Rogue named Democrat Obama fan Nick halfling Mage named Nick Tim is the dungeon master now that's a great idea Mike trucker but we decided to step it up and not invite Critical Role here and since Tim has no idea how to DM no idea I know how to DM but not this DM oh slide into the DM slide into those DM but this not got gotcha Goa Goa we brought in the Critical Role folks now Travis correct me if I'm wrong Critical Role a very successful DND audio podcast that posts monthly on podcast Services completely wrong sorry what do you completely wrong thank you",
      "start": 163.92
    },
    {
      "text": "role folks now Travis correct me if I'm wrong Critical Role a very successful DND audio podcast that posts monthly on podcast Services completely wrong sorry what do you completely wrong thank you for having twitch.tv/ geek andry critical how long you guys been doing this critical Ro business Jesus just over a year we just celebrated our year anniversary when you started at Mercer did you ever expect it would be as big as it is cuz this thing is legit phenomenon oh God no we have no idea the whole was presented to us as a as a as a business opportunity and we're like uh are people going to watch us just sit at a table and play D and D I guess we'll try apparently the answer is yes how many diesel came V diesel came you guys had Vin Diesel you're part of the family now I feel like I'm like feeling something right now he he was he was a fantastic player mer you got to lean in Kevin's doing the choke the chicken thing you scoot your whole chair in don't be afraid of the chair do this",
      "start": 212.2
    },
    {
      "text": "feeling something right now he he was he was a fantastic player mer you got to lean in Kevin's doing the choke the chicken thing you scoot your whole chair in don't be afraid of the chair do this I'll bring it right here I know that you you don't do microphone stuff really get on a microphone I'm not going to lie yeah you know what get welcome to a show that's run out of a spare bedroom in San Francisco so you don't have to really worry about it too much uh so over a little over a year now how many thousands of people tune in uh we have about 30,000 concurrent Jesus **** Christ actually our first uh episode just hit a million views on YouTube If you we congratulations so it's live on twitch.tv/ ganry what are the days uh every Thursday at 7:00 p.m. Pacific okay and what what's your YouTube roll out schedule uh every following Monday the episodes uh go up on the geek and Sun website through YouTube and they roll the dice and figure out what exactly it all reveals okay I'm now turning",
      "start": 256.88
    },
    {
      "text": "roll out schedule uh every following Monday the episodes uh go up on the geek and Sun website through YouTube and they roll the dice and figure out what exactly it all reveals okay I'm now turning over control of the show to you guys cuz I don't know anything about D I don't know how to play it but I'd like a car this is going to be a **** storm going to be amazing I'm excited you mean you want a car in game yeah sure does that happen a lot you Diesel have a car that's what we need to know dies still had everything what's the Fast and the Furious you know crossover now you've given us the pieces where's the board oh it'll come into play okay just follow this so a couple quick rules before you uh before we jump into this uh every character has your various statistics in their page like their strength dexterity those are already factored into a lot of the rules I've highlighted the elements of your character that are probably the most important okay if I ask you to roll a saving throw",
      "start": 299.48
    },
    {
      "text": "strength dexterity those are already factored into a lot of the rules I've highlighted the elements of your character that are probably the most important okay if I ask you to roll a saving throw yeah you go ahead and I'll tell you like roll a strength saving throw you'll go ahead and roll a D 20 which is a 20 set of dice okay and add whatever the bonus is under the saving throw this guy it's the ball that's the big one a a lot of your roles are going to be with that one okay you will have an armor class there which is your ability to avoid being hit and yeah and uh and there's a should be a weapon with an attack bonus on it and how much damage it deals uh I I figured Colin could help you out if if worse comes to worse that a pretty standard for a lot of D and D Fair okay um he's staring at it like I stare at my taxes exactly this this is very tax like why is there so many dice or Dye is dy there normally are not that many But I me",
      "start": 343.88
    },
    {
      "text": "for a lot of D and D Fair okay um he's staring at it like I stare at my taxes exactly this this is very tax like why is there so many dice or Dye is dy there normally are not that many But I me and Marisha both have a very large hord of dice so that's why there's just a **** ton necess well ultimately the main D that you all want to worry about is this one which is the 20-sided one so the other ones depend on what class you are and what weapon you have depending on what damage you deal l a little dagger will be like a tiny little four-sided D it's a little dagger you're stabbing with if you have like a big old great Axe you're talking a big old 12-sided die Nick the Mage with his big old 12-sided die I don't think Mages use Dy no they do they do just Happ just wave their hand and they win I Won Won just worry about the D 20 for now win and doubt just roll the one that looks like a ball all right so we've already introduced your characters which you're going to be for this this",
      "start": 385.88
    },
    {
      "text": "they win I Won Won just worry about the D 20 for now win and doubt just roll the one that looks like a ball all right so we've already introduced your characters which you're going to be for this this session uh why don't you guys go and introduce what you're playing this did we introduce they talk about they're supposed to be play master master human fighter but you didn't say what class you are yeah human figh human fighter okay yeah uh Democrat Obama fan male heal half elf Rogue nice this is I have to read the whole thing here that's be Nick the Mage male Stout halfling halfling wizard so I'm actually a quarter you marry into it it's an issue and then I'm do I introduce myself now yeah go for it you're the DM I'm the DM AKA fin tofl I'm a barkeep yes we will get I think we just learned a secret we did see I always thought the dungeon master was like God he he just exist did I I thought I just made things up but that's not how this works kind of works that way he also plays every",
      "start": 437.32
    },
    {
      "text": "a secret we did see I always thought the dungeon master was like God he he just exist did I I thought I just made things up but that's not how this works kind of works that way he also plays every character that they encounter that isn't in their actual part I'm all the NPCs oh nice okay I'm dumping my Islanders dice give me some cool quests you're the only one on this team with real Di over there it's all good no worries so Marisha who you playing I'm playing Julian of cord I'm a cleric cleric sorry I'm a paladin she's a cleric drink your bourbon Kentucky all right she's a cleric I'm a paladin there you go there's a difference I am McLaren Von Tas Cobble a fifth level Blood Hunter order of the lyan he waits human oh and dwarf you're also a dwarf no he's human I'm a dwarf you're dwarf Paladin and my name Jester I'm a tling cleric I have horns you guys wait so you do like a do you do a voice the whole time to you you are too buddy oh really oh yeah oh great if you want to oh it's me",
      "start": 488.96
    },
    {
      "text": "and my name Jester I'm a tling cleric I have horns you guys wait so you do like a do you do a voice the whole time to you you are too buddy oh really oh yeah oh great if you want to oh it's me terrible ahead all thank you a real friend I'm so excited you guys so we'll come across things as as they happen wait what Colin's voice I don't you'll find out find out find out so I might not have so bringing us into the world of Dungeons and Dragons welcome all to the moonside lodge the finest Inn and Ale House this side of wild Mount according to the owner fin tofl the muggy summer months have drawn the rather bustling Township of th's C into an air of frustration and what better place to spend it than this fine Pub gathered amongst the drunken jovial air various rep probates and tired work hands day drinking their woes into Oblivion sitting at this singular table stained with wine spatters and sticky Touch of dried Mead lies the band of problem solvers known as what is your team name the",
      "start": 540.84
    },
    {
      "text": "day drinking their woes into Oblivion sitting at this singular table stained with wine spatters and sticky Touch of dried Mead lies the band of problem solvers known as what is your team name the three of you what what are you thinking I think it should probably something that's Kinda Funny in it but I feel like that's like to on the nose how about the American Heroes we're the American Heroes American Heroes that was like a double dare kind of thing like a double dare huddle uh you like to give a brief description of your visual appearance oh yeah red white and blue just Toe to Toe tell mean every one of us we're doing when we open arms we got the Macho Man like strips that hang down Nick's got the red white and blue shades on there too whatever we're talking like deer skin Tass beautiful lot of hides heck yeah lot of all right as you guys have settled in tossing back your various alcoholic Choice emitent uh a resounding slam of metal on wood catches your attention as it cross the",
      "start": 608.8
    },
    {
      "text": "lot of hides heck yeah lot of all right as you guys have settled in tossing back your various alcoholic Choice emitent uh a resounding slam of metal on wood catches your attention as it cross the table from you your vision you see the last Trio you wanted to see your rival troop of mercenaries known as what is your team name guys we're the shits all right wait wait wait which stands for the super high intensity team things are so real right now you guys like talk about this in the car right over they're just smarter than us correct so as they slam down their drinks and sit across from you giving you the evil eye from point to point the silence continues for a brief 30 second period until someone breaks it o Democrat yes Lean Forward on your microphone it's good to see you don't think I uh saw you since the last time we had a bender in this tavern I didn't think you ever wanted to see me again well I don't these are my friends pterodon and Nick hello Nick Nick the m I don't recognize",
      "start": 663.36
    },
    {
      "text": "saw you since the last time we had a bender in this tavern I didn't think you ever wanted to see me again well I don't these are my friends pterodon and Nick hello Nick Nick the m I don't recognize you with your clothes on Jesus I thought we weren't going to talk about that we've heard so many things about you Jesus I thought we weren't going to talk about that terod on you're awfully quiet oh just looking for my car oh you guys brought him again why are you still working with him he's big and strong all right we earn lots of gold with him all right that's true oh just a regular old male human here I really I really wish we got to get you another voice we have to all right I got in the voice got the voice don't wor you're a voice actor now I know I got and I got a deep well to go with don't worry I'm just talking with a slight accent I don't even know what I'm trying to do a a passing bar wench in her later years comes by a handful of Ale flaggin accidentally elbowing pterodon in the",
      "start": 728.32
    },
    {
      "text": "worry I'm just talking with a slight accent I don't even know what I'm trying to do a a passing bar wench in her later years comes by a handful of Ale flaggin accidentally elbowing pterodon in the neck briefly concussing the Adam's apple and upon clearing the the throat seems to have managed a better vocalization going forward hey why you doing that Spiderman like swinging my crays over here I think you need to hit him again bar wench hit them again bar wiench turns around excuse me sir is there a oh I'm sorry I didn't mean to intrude I actually um you see folks Finn over there and she points across the barway to the barkeep Finn who's kind of waving in the distance Say Finn over there is asking to bend your ear a moment if you don't mind he wants to what bend your rud to you have a conversation come people in this city have falling down the train I didn't know what sure fine you both seem ready and able types to do some damage for coin am I correct in this assumption you are yeah",
      "start": 795.32
    },
    {
      "text": "come people in this city have falling down the train I didn't know what sure fine you both seem ready and able types to do some damage for coin am I correct in this assumption you are yeah good yeah Spiderman well looking so go ahead and say hello to him and you keep your neck out of when my elbows move oh no I'm just talking like this okay I have a problem guys hey Finn what up my name is Finn there's these rats and they're really big and they're in the sewers and I'm scared of rats I don't like these rats and my wife is going to leave me because these rats keep having sex and they keep multiplying and they're get they keep getting fatter and fatter because some people keep feeding them and I keep telling them to stop and I need help with you to kill these rats so my wife won't leave me because I don't think I could find someone that loves me as much as you charismatic bar that was a lot of exposition I can keep going I can tell you more about Mr to I think we're going to help you",
      "start": 846.36
    },
    {
      "text": "because I don't think I could find someone that loves me as much as you charismatic bar that was a lot of exposition I can keep going I can tell you more about Mr to I think we're going to help you but for future problems like this you should probably Rite into this traveling entertainment company that they're called Kinda Funny and they do the show called love and sex stuff over on like the Masquerade nights and **** they'll help you with these kind of love SE where could I write into them uh you put it on a scroll on a board at Kinda Funny board at this at this at this moment a giant slamming crashing sound hits as the tavern all of a sudden swings their heads around to see a cloud of dust and rock come exploding out of the roof from The Far Side Of The Tavern keep a boulder about 6 to 7 ft in width com slamming in crashing into the stonework floor breaking it and crushing three or four bar patents before rolling towards the table you are all sitting at I need everyone to make",
      "start": 894.76
    },
    {
      "text": "6 to 7 ft in width com slamming in crashing into the stonework floor breaking it and crushing three or four bar patents before rolling towards the table you are all sitting at I need everyone to make dexterity saving throws right now go you said you had a rat problem not bll the problem this **** natural 20 nice I rolled a two 20 okay fail 14 okay 14 1 20 20 okay 17 for me all right so 17 all of you managed to defitely jump out of the way except for pterodon who unfortunately was seemingly caught off guard by the intense discussion about where to send the various sexual issues one might have on their scroll uh the boulder slams into your chest throwing you back 10 feet against the back end of the tavern wall uh you thank God it wasn't my neck you do suffer Four Points of lending damage from the impact you managed to get away relatively unscathed but it knocked the wind out of you and was mildly embarrassing right here where it say current hit points oh man you got hit so hard it",
      "start": 935.92
    },
    {
      "text": "from the impact you managed to get away relatively unscathed but it knocked the wind out of you and was mildly embarrassing right here where it say current hit points oh man you got hit so hard it looks kind of embarrassing hi guys that was fun word play not Grog what is this Gro you speak of before you can answer she's very popular in traveling masquerade she go well uh as you guys kind of dust yourself off and look around the room you hear the sound of Screams breaking out from the thorough Fair on the outside of the tavern what sounds like heavy footfalls and you see the shadows of people rushing past the entrance just cruising down the pathway right on the outside of the Inn we race out of the town all right we let them go first because then we're like we'll see what's up good job thanks Nate can you cast a healing spell for four points for me no thanks I I don't want to waste it I'm sorry I got to I understand you only got so much is not infinite okay as you guys gingerly make",
      "start": 990.84
    },
    {
      "text": "Nate can you cast a healing spell for four points for me no thanks I I don't want to waste it I'm sorry I got to I understand you only got so much is not infinite okay as you guys gingerly make your way up to the front letting them Cruise out full hearty into the face of what possible danger may be ahead seeing this large looming Shadow just pass over the hole in the roof just slowly moving past you guys glance outside and you can see what appears to be a crushed cart to the left of the tavern with a large another large Boulder that has smashed it you can see people running past and there across the main walkway kind of stepping from between two of the buildings is a large humanoid probably about 12 to 15 ft tall very thick muscular with a layer of heavy set kind of uh physicality about him a long pair of halfhazard uh rags and and and hides around the lower abdomen area a very drawn sinking unintelligent looking face as it drags a club Behind in one hand and the other is carrying a",
      "start": 1035.32
    },
    {
      "text": "him a long pair of halfhazard uh rags and and and hides around the lower abdomen area a very drawn sinking unintelligent looking face as it drags a club Behind in one hand and the other is carrying a current screaming villager who is trying to tear from the grasp you said this was a like a giant this one constitute as a giant oh my God it's Kevin you see the person in the hand going no please let me go please my family um Julian throws her Shield up in front as a defense mechanism and then I'm going to cast command and I'm going to say I you in the name of C drop that woman peasant is she a woman stop talking to me like that I don't like it I'm not amused not wrong I need you to go ahead and make a uh a will or wisdom saving throw for your I was that his name that is a failure shouting out of no you instinctually without even paying attention place the villager on the ground and let them run off and are suddenly like very confused as to why you let that happen why she was so tiny Let",
      "start": 1083.6
    },
    {
      "text": "of no you instinctually without even paying attention place the villager on the ground and let them run off and are suddenly like very confused as to why you let that happen why she was so tiny Let Her Go Let Her Go I already did Nic done I'm enjoying can't let this Beast live though no don't attack no if you attack I'll Attack back right don't hurt me I think we want that though don't we I'm so stupid is command still up how command is just an action it's just one action right yeah ites I don't it doesn't like linger it lasts for a round just one round that was the one thing okay so as the hulking giant I cast Shield of faith on myself okay so you see this shimmering image of divine energy surrounds the exterior of Jester's body offering some level of protection bog is really confused let's see if this giant wants to stay or go and I'll take out my hand crossbow and fire a bolt at it God damn okay go ahead and roll for an attack oh that's good uh 19 hits go ahead and roll damage",
      "start": 1145.64
    },
    {
      "text": "see if this giant wants to stay or go and I'll take out my hand crossbow and fire a bolt at it God damn okay go ahead and roll for an attack oh that's good uh 19 hits go ahead and roll damage yes thank you this well right now he's just rolling how much damage you're going to take you guys walk out and start seeing this giant now letting this person go uh a shadow coming up from behind the Giant and your rival gang currently now opening fire with a crossbow towards the creature six points of damage aing six points busy while they're busy why turn around and say come on you guys you're missing all of the fun I'm helping them I think we should okay all right I mean this isn't the American way do they have a resource we need what the hell is happening yes can I can I are we here on the outside of the right there place your your figures on the map as you're stepping outside of this vicinity here you guys are you guys are in front we're in the back here there you go what am I minusing",
      "start": 1200.08
    },
    {
      "text": "of the right there place your your figures on the map as you're stepping outside of this vicinity here you guys are you guys are in front we're in the back here there you go what am I minusing six from which one uh there' be your hit points right there oh okay cool so you just keep track of that right cool all righty I'm I want to help them you guys can attack them if you want thanks do you want to tackle Bama fan so now officially officially combat has begun I need everyone to roll in initiative so go ahead and roll a D 20 and add your initiative modifier the music got so intense I got a 10 initiative modifier 16 what do I add that to you have a 10 initiative modifier okay I was to say damn all right so we have initiative order we have 20 different that's going to change now though 19 19 all right what do I add this to your initiated mod seven plus your modifier which is here so you have 10 all right so we do we have anyone above a 15 uh yes I have 16 16 all right democr I'm going to",
      "start": 1256.48
    },
    {
      "text": "All right what do I add this to your initiative mod? Seven plus your modifier which is here so you have 10. All right so do we have anyone above a 15? Uh, yes I have 16. 16. All right Democrat, I'm going to call you Dem. Dem, please do. All right, 15 you talk to him like that you're not his friend yet. Address him by his full name. You might not even be living after this round for you too. Do you want to hear it? Stupid voice. Nick turn her into a frog. You're you're a witch. Nick get her wish pass whatever spell turns her into a frog. There you go. All right, all right. Uh, do we have 15 to 10 anybody for initiative? 15 for me. Okay, I have 11. All righty. Oh wow. Okay, so we have Jester, uh, who had 11? I had 11. All right, Pterodon, Pterodon and then uh, 11 for Julian. 11, 10. Okay, Julian. All right and Nick the Mage. All right so and and at the very end we have Bog the Giant and the shadow looming behind it. All right so uh, that would be Toss Cobble you're up first. Toss Cobble says **** this giant I'm",
      "start": 1305.68
    },
    {
      "text": "the Mage. All right so and and at the very end we have Bog the Giant and the shadow looming behind it. All right so uh, that would be Toss Cobble you're up first. Toss Cobble says **** this giant I'm wearing a red cape and I use my hybrid transformation to turn into a werewolf. Like the hit game The Order 1886. You guys all watch as Toss Cobble's form swells with strength the the hair in the body turning into a thick dense dark black fur fangs protruding from the front of the snout as it extends into a wolf-like visage and uh still holding a loft weapon and armor growls out in frustration and anger and you want to do anything else Nick? Yes, with my bonus action I would like to activate my Crimson, right? You watch as uh against blader claws my blade okay you watch as the werewolf now draws forth a long sword and as it does this uh reddish Arcane sigil spins around the blade encasing it in some sort of ice magic just dripping some sort of frost based enchantment power from the outside of the",
      "start": 1357.8
    },
    {
      "text": "a long sword and as it does this uh reddish Arcane sigil spins around the blade encasing it in some sort of ice magic just dripping some sort of frost based enchantment power from the outside of the blade uh and you want to move or you stay there? This stay where I am. All right that finishes uh Toss Cou turn next upep is Democrat Obama fan. I'm silent going to draw my crossbow and shoot. All righty you got a crossbow that's a punk move. A 1. Oh natural 1. Yay there's a 5% chance you will roll that so that's real that's really good. 1 d8 plus four is it so uned by oh right yeah that's right. Okay then add your plus four that seems higher than I would have thought. 3, 6, 7, 8, 9, 10 so 10 damage you take from the crossbow as it slams into the there you go as the bolt just slams in the top of your torso area embeding itself in the chest muscle nice. I can't believe roll the 1. I'll never Happ that was awesome. Uh yeah technically you not you're not hidden from it so be no sneak attack damage but that",
      "start": 1417.88
    },
    {
      "text": "area embeding itself in the chest muscle nice. I can't believe roll the 1. I'll never Happ that was awesome. Uh yeah technically you not you're not hidden from it so be no sneak attack damage but that that still pretty decent. Uh you can do use your bonus action if you want to try and hide. Uh yeah let look you can probably move into the door and then hide in the shadows there next turn. Yeah let me do that. Okay that's not a bad idea. I didn't actually study the guy is a **** so you actually go and roll a stealth check. 16. 16 go ahead and roll a perception go and roll that dice well again that was the little **** there. Okay yeah you get the feeling that you are bog is completely oblivious to your existence. I got that impression even before I ATT this is very true. All right finishing Democrat turn that brings us to Jester. Jester what are you doing? Yes I would like to um use my I would like to use Channel Divinity to cast duplicity so I have a a illusion of myself right next to this idiot",
      "start": 1473.88
    },
    {
      "text": "turn that brings us to Jester. Jester what are you doing? Yes I would like to um use my I would like to use Channel Divinity to cast duplicity so I have a a illusion of myself right next to this idiot giant. All right, all right so we'll go ahead and we'll use this blue dice to correspond as your illusion right and then I'm going to use my bonus action to cast spiritual weapon and it looks like it's coming straight from my other character my my illusion of self. All right so there next to it you watch what looks to be a a duplicate version of Jester's form just appear out of thin air right across in this giant which Spooks you initially and that other image begins to recite an incantation that summons some sort of divine weapon which looks like a giant um foot that kicks him in the crotch. Oh okay go ahead and roll a melee spell attack. A 1. **** are you **** kidding me? We didn't know how important it was last time but now we we're all right now go ahead roll what do we roll what do we do",
      "start": 1518.64
    },
    {
      "text": "go ahead and roll a melee spell attack. A 1. **** are you **** kidding me? We didn't know how important it was last time but now we we're all right now go ahead roll what do we roll what do we do? Uh this would be plus your spell testing so it's 1 d8 * + 38 * will you attack? All right so 15 points of damage. 15 points of damage to you Bog you're going to probably taking a pummeling here looking good and then I'm going to take my um my fake me and move it um around to the back of him smart. Uh-oh I like this is going all right that brings us to uh Tyon has anyone tried to talk to him? Pterodon can we do that now? I'll let you know before I do this. Nick you're the expert got it. I'm good at languages including common dwarvish elfish and orc who you speak so many languages man speak L I'm pretty smart guys not going to lie. I've got a good charming ability I think spell this is about you right now Nick the Mage in case you want me afterward I'm saying if you want to all right fine **** it",
      "start": 1566.56
    },
    {
      "text": "smart guys not going to lie. I've got a good charming ability I think spell this is about you right now Nick the Mage in case you want me afterward I'm saying if you want to all right fine **** it. I'm going to raise up the people's Edge my battle axe. Yes I'm getting I'm getting off the bench here and I'm coming right at B or whatever the **** name is and I'm swinging at his **** face want to talk to you why Strike Up the Band for this you guys are so P you do have two attacks you can attack a second time. All right I'll do that I'll do that. All right, all right you could also try talking to him 15 uh 15 I believe with your bonus will definitely hit so you go ahead and roll damage for the people's Edge finisher. Okay where's no your is diet yeah 1 d8 so good one that looks like a square from the top looks like this eight cider okay four four plus plus five plus five so nine nine points of slashing damage from the people's Edge against Bog. Oh Bog you're not doing so good buddy I know",
      "start": 1628.04
    },
    {
      "text": "from the top looks like this eight cider okay four four plus plus five plus five so nine nine points of slashing damage from the people's Edge against Bog. Oh Bog you're not doing so good buddy I know B doesn't like this talk to me. All right ter Pterodon finishes your turn that brings us to Julian. Oh um do we want to try and talk to these we want to try and talk to him fck kill that Big B baning everywhere right now. All right um okay sorry Bog no **** you I thought you loved me. Oh **** there was a relationship between was as a as a bonus action I'm going to use my vow of imunity against you you're my you're my enemy now sorry and I'm going to run and do my two attacks I can make my my little dwarfish can make it right yeah just barely. All right so you all of a sudden you you feel the mark of the god of cord upon you as you see the clouds darken above your head and as you stare down all you can see around you with shadows surrounding is the singular singular Dwarven form rushing",
      "start": 1681.6
    },
    {
      "text": "mark of the god of cord upon you as you see the clouds darken above your head and as you stare down all you can see around you with shadows surrounding is the singular singular Dwarven form rushing towards you with all the anger of the Gods all the anger of the Gods. Ooh a 19 plus a seven so 6 for my first one and an 18 second one that's really good R you're too stunned by it you're unable to avoid the battle Bog as all of a sudden this dwarf rushes forward slamming into you twice. Um I'm going to do my first one just regular 1 d8 6+ 4 so it's 10 the second one I'm going to go ahead and make it a Divine Smite so this one's going to come for four for eight plus uh 11 plus another four so 15 15 points of damage on that one all righty totally we got him yeah totally in the bag he's ain't looking good I ain't dead yet nope Nick the Mage you're up. Oh God I just want to like throw something at him do you know what I mean like a fireball or a fireball can I throw a fireball on is that how",
      "start": 1742.04
    },
    {
      "text": "good I ain't dead yet nope Nick the Mage you're up. Oh God I just want to like throw something at him do you know what I mean like a fireball or a fireball can I throw a fireball on is that how works yeah we're on the map where you want the fireball to hit i' like to hit close to his left knee okay. All right so what is your strategy his left or us looking at it his left right should I not do that am I going to as Nick the giant form seeming unto by Ser of dangerous Mele attacks decides that perhaps this is a moment for Arcane intellect to really take over you put forth your tiny Mage arm it's not that tiny it's pretty tiny and a uh it's like Trump small of the whole world you unleash a beam of red energy that streaks towards the kneecap of Bog exploding engulfing both the Giant and your form and Julian and Pterodon why Nick I messed up Greg I messed up go ahead and roll 8 D6 damage you're going to kill us",
      "start": 1796.8
    },
    {
      "text": "streaks towards the kneecap of Bog exploding engulfing both the Giant and your form and Julian and Pterodon why Nick I messed up Greg I messed up go ahead and roll 8 D6 damage you're going to kill us all square roll uh where's my regular square yeah the square dice here so eight eight of those together gosh so roll that four times and count no eight times two though but I looked it up Cal hey how's that fireball feel that's six so like and crispy on the outside but warm and gooey on the inside 18 damage 18 damage that's what all right so you take that's all 8 D6 oh no two more I'm sorry I apologize 18 6 11 9 9 Points of fire Dage Mages man I need you to roll roll a dexterity saving throw so roll a D 0 okay and add plus two I got a one oh you roll a one I got a d a so you also take 9 Points of fire damage sorry Greg I mean what is your name Pterodon sorry Pterodon Pterodon about to die use my um I'm going to use my shield Master reaction and see the Blast coming and throw the shield",
      "start": 1856.12
    },
    {
      "text": "of fire damage sorry Greg I mean what is your name Pterodon sorry Pterodon Pterodon about to die use my um I'm going to use my shield Master reaction and see the Blast coming and throw the shield in front oh **** no I as a reaction instead of doing a saving throw I just take no damage no no if if you make the save you take no damage that's how it works yep what Master yeah but you you add your Shield bonus to your dexterity Save which is you should really just do it as SL are you sure you're not saying add add the Shi AC to a deck save cuz that was a different the **** dice um two useless but there were two different ones there was shove Shi so I take so how much do you understand this yeah Fireball was the point cuz if this isn't the point where's the where's consult the what's the book for angrily turning the T of D books where's the feet that's why it was so hard to play when I was a kid cuz they were expensive I them hang on feets here looking for feets it was so fun when I",
      "start": 1932.44
    },
    {
      "text": "book for angrily turning the T of D books where's the feet that's why it was so hard to play when I was a kid cuz they were expensive I them hang on feets here looking for feets it was so fun when I got a new book here here what are the books right there you have a book that's indicated with class you have books with like bestiaries like just enemies if youed to an effect that allows you to make a dexterity saving throw you take only half damage uh to take only half damage you can use your reaction to take no damage if you succeed on a saving throw exactly take half damage so inste 9 fire damage uh you take 14 fire damage. All right, all right so as the blast uh explodes and the smoke eventually Fades you can see the heavily wounded party at the base of the heavily wounded Giant in the middle of th the building behind stat roof now catching on flame yes um that you want to move Nick Nick what have you done excellent Nick the M damn it Nick no I think I'll stay where I'm at I I think",
      "start": 1995.72
    },
    {
      "text": "of th the building behind stat roof now catching on flame yes um that you want to move Nick Nick what have you done excellent Nick the M damn it Nick no I think I'll stay where I'm at I I think they're pretty pissed off at me start cling cuz I think it's really pretty you guys now see after the explosion the shadow behind Bog reveals itself as the explosion suddenly catches his attention as a giant direwolf comes bursting from around the corner. Oh **** I'm going to run in towards Nick the Mage source of the fireball uh what do you want to do y you have you have a bunch of guys in front of you over here can I pick up the boulder we crush the thing and crush them all uh you could if you want to try and throw Boulder you'll be a disadvantage cuz there's people right next to you you might do better to go ahead and try and slam them twice probably I want to slam trog door or whatever Greg's name isodon Master Clon all right go ahead sir it was in that moment they knew they **** up 13 a",
      "start": 2038.24
    },
    {
      "text": "better to go ahead and try and slam them twice probably I want to slam trog door or whatever Greg's name isodon Master Clon all right go ahead sir it was in that moment they knew they **** up 13 a 13 plus eight to hit it's a 1 what's your armor class Pterodon where 19 that is a hit so go ahead and roll damage on that on the 1 Sider uh he's going to roll at oh no no damage you take 15 points of bludgeoning damage **** all right well he so the the damage you guys are counting damage cumulatively right like fire damage all this kind of stuff yeah he's dead oh unconscious unconscious it's negative what what what is the rule you can go into negative you already went unconscious in like the first 30 minutes of the game if you go unconscious you just start making death saving throws every when you fa I don't know anything after version two three years we've been playing with our campaign nobody's really died this has been an episode of The Game Show until no but I'm dead so this seems",
      "start": 2081.08
    },
    {
      "text": "when you fa I don't know anything after version two three years we've been playing with our campaign nobody's really died this has been an episode of The Game Show until no but I'm dead so this seems like a good place for a topic break unconscious not yet you're un how far unconscious are you topic break I'm unconscious how many how many below he's NE four I got Nega four right now no I needed for myself break oh you're fine yeah keeping welcome back everybody to the The GameOverGreggy Show geek and Sun crossover just joining us I'm already unconscious cuz Nick the Mage is a **** God bless you Nick the Mage so glad he did that I will say that the irony is that you wanted to be the heel here and you're the one who ended up make another attack by the way scw oh yeah I'm definitely going to make another attack I came off the Ben from these guys I'm I'm attacking Jester that's no I'm Julian Julian all right go R attack on I can't understand you you don't sound the same attacking to Julian",
      "start": 2129.88
    },
    {
      "text": "another attack I came off the Ben from these guys I'm I'm attacking Jester that's no I'm Julian Julian all right go R attack on I can't understand you you don't sound the same attacking to Julian thank you very much get the all right that's 11 what's your armor class 11 that hits you take 15 points of blending damage from the heavy the heavy Club of Bog the hill giant get bludgeon God damn it Nick is it just going to be me left that's Nick do you have healing spells you revive spells let me see do I a wizard you do not have healing spells these two here have some healing yeah the cleric but I've been talking **** to them this entire timeous can I make my dog do **** uh well I'm about to do that for you right now so the dog that's rushed up to Nick the Mage is going to go ahead and attempt to bite you with its giant snash Dire Wolf CL wolf and rolls is six it misses your small frame is too small and you manag to dodge out of the way unharmed okay you're tiny yeah dim size frame",
      "start": 2183.68
    },
    {
      "text": "attempt to bite you with its giant snash Dire Wolf CL wolf and rolls is six it misses your small frame is too small and you manag to dodge out of the way unharmed okay you're tiny yeah dim size frame tiny frame again again it is if you take an overall average that I am right in the **** middle average how could any woman love it us C you're plenty of women plenty of women have loved me I've had the love of many of a bar made money I would like to rush up to a giant ass damn it with my wherewolf rage and I would like to uh using my dueling style attack can I say wait is that how this works reaction sh it okay and using a dueling strip with my extra attack my long sword and and cut him oh go forward and a 17 17 what's your armor class 13 that does hit yeah and the second one nice killing it today I think I'm unconscious you'll find out you'll find so damage in the first strike okay oh that's 1 + 1 D6 is uh 13 I'm actually roll you take 13 points of damage where are you at now I'm",
      "start": 2240.36
    },
    {
      "text": "it today I think I'm unconscious you'll find out you'll find so damage in the first strike okay oh that's 1 + 1 D6 is uh 13 I'm actually roll you take 13 points of damage where are you at now I'm dead or unconscious if that's you're pretty uh almost you have a little bit little bit of life left the second one is a four plus 7 that's four * oh right plus D6 * definitely dead so eight and six so 14 plus I don't know seven how do you want to do this so you see this Rush this this werewolf Rush towards you uh uh cold energy encased blade streaking in the air and I jump up with my long sword and I plunge it into his throat I thought you were a wolf yeah shut up and I plung it into his throat and I ride his chest all the way down opening up his thorax what happens when you get to the **** you leave that admire and then keep sliding as as you as you feel the life blood draining from your body bag the last thing that at least consoles your end is the fact that you somewhat impressed",
      "start": 2313.16
    },
    {
      "text": "you leave that admire and then keep sliding as as you as you feel the life blood draining from your body bag the last thing that at least consoles your end is the fact that you somewhat impressed this werewolf on the way down at least I died with purpose tell the stories of my goodness tell stories of my all right uh so that that finishes your turn um all right Democrat you're up I'm against the wall I guess right because I'm still within the and there's still the where the uh the direwolf the dir wolf which help your boy out here so I want to turn around I I'll expose myself not like that the I think that's a persuasion role uh all like okay because establish dominance make yourself figer large person all right so uh because it doesn't see you and you're hidden you have an advantage on the attack and so that means is you roll two d 0s and take the higher of the two okay oh nine Nine's The Higher One terrible plus oh three right that hits oh nice oh man that was bad I rolled wait",
      "start": 2374.24
    },
    {
      "text": "on the attack and so that means is you roll two d 0s and take the higher of the two okay oh nine Nine's The Higher One terrible plus oh three right that hits oh nice oh man that was bad I rolled wait I roll did I say I rolled a one you did but wa it not is not a blunder like is it it is if you but with Advantage you take the higher of the two the ones so it doesn't count okay Co so go ahead and roll the sneak attack damage on that what is where is the sneak attack it would it is it plus seven on sneak I'm sorry I can't read these I can't read these oh no wores so I'm I'm just rolling a 1 d8 plus four and then on the very bottom it should say oh sneak attack three oh yeah okay already on a level five it's 3 d6 so eight so 1 Real Americans American I don't know where any my D6 you don't even know your **** group name I'm unconscious I don't even know we're I'm talking from dream state so six was the the sneak attack damage uh plus 1 all right great so 18 18 nice so with",
      "start": 2441.56
    },
    {
      "text": "you don't even know your **** group name I'm unconscious I don't even know we're I'm talking from dream state so six was the the sneak attack damage uh plus 1 all right great so 18 18 nice so with that singular bolt jamming itself into the side of the direwolf's head you can can see it Saks out get trying to thrash about scratching towards the ear where the bolt currently embedded itself in the back of its head uh it's looking pretty hard it's not quite in depth store but it's looking a little rough um Nick tried to talk to it yeah you can attempt to re-hide if you want to yeah I will hide again okay it's right next to you just another Fireball take with me come on okays sure if you are sure but was he impressed that I exposed my I think everyone was fairly impressed you exposed yourself a bold strategy all right Jester you're up it's my turn I skip over to um stupid voice on the ground hey that's me stupid voice KCK him in the kill him I step on him and say oh I think you might be",
      "start": 2499.0
    },
    {
      "text": "a bold strategy all right Jester you're up it's my turn I skip over to um stupid voice on the ground hey that's me stupid voice KCK him in the kill him I step on him and say oh I think you might be unconscious and I cast um spare the dying on him oh you kill him though immediately stabilizes him correct so you are no longer dying you stabilized you're not conscious God **** damn it but you're not dying cool I don't feel like healing you yet see and then um I use my spiritual weapon to turn around still looking like it's coming oh I make my illusion walk over to him too all right so spiritual weapon looks like it's coming from that thing and I oh I feel bad kicking a dog it's a very big wolf yeah very nasty one I raise the foot high in the air and I stomp on him from above all right go ahead and roll for the uh spell attack on that okay it's plus six oh um 1 uh plus six plus six that hits okay cool and then what do I do uh it's the 1 d8 plus three big money nine 11 points of damage",
      "start": 2549.36
    },
    {
      "text": "ahead and roll for the uh spell attack on that okay it's plus six oh um 1 uh plus six plus six that hits okay cool and then what do I do uh it's the 1 d8 plus three big money nine 11 points of damage all righty this time with the uh your sacred weapon this time slamming into the side of the direwolf you can see between the blow from the bolt on the side of its head and the the Divine impact from the spell it's starting to rock its head and you can see its eyes kind of rolling around in its sockets it's a little uh it's it's a little beaten up and trying to get its bearings right now it's not looking too good uh anying gestur turn that brings us to uh Pterodon you are currently unconscious and stabilized just go ahead and roll a D 0 for me sure you died four all right you're fine all right cool I'm going to get a beer Julian you're up anybody anything good thank you well I was going to heal Teragon but he just walked away still here on the ground speaking to you from the dream stage",
      "start": 2614.48
    },
    {
      "text": "cool I'm going to get a beer Julian you're up anybody anything good thank you well I was going to heal Teragon but he just walked away still here on the ground speaking to you from the dream stage all right I'm in the space between space the others Julian Who's down and kind of like shielding from that Fireball looks over and sees trodon ter Pterodon Master cff please show some respect of I hobble over a little bit and I I put my hands on him and I I cast lay on yeah lay on hands like kind of for how many hit points where where you laying your hands um only in the appro are Greg kind of this is Pterodon talking from an unconscious dream state God forbid it's a wet dream for once in Pterodon life I kind of hold his face kind of hold his hold his head and I I heal you for five hit points okay so you're now conscious you come to conscious your eyes come into Focus immediately look up and see uh a a dirt smear Dwarven female face looking at you with a Sly grin my foot is",
      "start": 2665.52
    },
    {
      "text": "hit points okay so you're now conscious you come to conscious your eyes come into Focus immediately look up and see uh a a dirt smear Dwarven female face looking at you with a Sly grin my foot is still on your bur and I punch him in the face I say you're good and I'm punch him in the face okay roll an attack you're going to make him unconscious again I rolled a seven he's prone so you have the advantage on it oh **** 9 + 7 so 15 uh 16 what's your armor class Armor class 19 yeah so you go and you punch but it hits the armor kind of hurts your fingers whatever you you all right I'm here I'm back yeah what's up everybody it's me Tean on Master clap where is the Giant and Julian still he starts crawling away and it's just like **** Nick the Mage it's your all right here we go no okay I'm just a dwarf what you got now can I ask a question before I yes she may is either the scorching Ray or a magic Missile is that going to **** everyone up around me no no they're both very specific to",
      "start": 2726.8
    },
    {
      "text": "a dwarf what you got now can I ask a question before I yes she may is either the scorching Ray or a magic Missile is that going to **** everyone up around me no no they're both very specific to a creature Fireball is the only real dangerous spell you kind of came out of the gate with the uh the spatial awareness but but a hard lesson learned in the best way I want to use something called they call the magic Missile classic yes yes a classic a staple all right that's three missiles at level one so that's three D4 plus three you want to go ahead and get some get some for seted die over there4 another no those are in they hit automatically even have to roll to hit cuz they're that awesome so five and then roll one more here so eight plus three right you said yep 11 11 how do you want to do this so so so that that phrase means you got the final blow on this creature I I want you to describe your epic cinematic destruction of this creature well Matt if you have to know this is what",
      "start": 2784.56
    },
    {
      "text": "this so so so that that phrase means you got the final blow on this creature I I want you to describe your epic cinematic destruction of this creature well Matt if you have to know this is what happened this is for the ladies my accuracy with the magic Missile unparalleled as you all know as you all know straight into his mouth down his dietary track blows out his **** all over the street hits a little bit on top of Teragon mccleon over here damn it so he's just got wolf **** all over his face which actually based on that order gets mostly on pterodon a little bit on Jester a little bit on Julian and a smattering on toss Cobble Dam it apologize matter bro sorry for the wolfes matter you hear a dying giant say from across the Alley's final breath you got smattered bro all righty so you all sit there kind of catching your breath considering this brief scuffle the fact that this giant hand wanded into town and you all look at yourselves surviving and figuring out what is the",
      "start": 2834.48
    },
    {
      "text": "so you all sit there kind of catching your breath considering this brief scuffle the fact that this giant hand wanded into town and you all look at yourselves surviving and figuring out what is the next course of action to take in this endeavor who's the dick **** that launched the fireball I just It Dem Nick what were you thinking or was it clearly I panicked is everyone all right Nick the M has not been in a lot of high every is all right seems like pterodon is hurting pretty bad you know I mean I got one one hit point right now do you want me to heal you love that what will you pay me you have gold what do you got you got some gold you gold you should have at least five hit points up there 160 yeah oh really I should have five well when they brought you back to stabilize you it should have brought you to zero why oh to start from zero stabilized them and brought him to zero zero Z okay right exactly okay so yeah do so should be 39 damage you have uh 160 gold yeah I'm not giving",
      "start": 2894.56
    },
    {
      "text": "have brought you to zero why oh to start from zero stabilized them and brought him to zero zero Z okay right exactly okay so yeah do so should be 39 damage you have uh 160 gold yeah I'm not giving that up don't think at all respect you want to give some of it up though when she says it like that never to you kill him fine stay bleeding out I don't care I'll pay you to heal him what do you want I would like  5 gold please fine even bar namti okay just like a typical French person getting taken advantage of by American heroes and I did you think I'm French wow um and I use my Prayer of Healing on on him and anybody else that's that's hurting actually I use them on anybody that's hurt not you you mother  D plus no you're good I'm good come on really the Mage Nick the Mage didn't take any damage M that's not **** demat Obama F fine as well what the hell there we go that works 13 hit points to got to whoever's hurt technically 13 13 up to six creatures so did you take any damage did you",
      "start": 2949.4
    },
    {
      "text": "M that's not **** demat Obama F fine as well what the hell there we go that works 13 hit points to got to whoever's hurt technically 13 13 up to six creatures so did you take any damage did you take any damage nope no yeah so just the you two you goes all right Democrat Obama fan your generosity is truly legendary thank you should we find where this terrible giant came from yes of course for there's more coin in it for all of us I agree is there you don't know that that's my assumption we just killed one of the guys we get any gold I'm almost dead we didn't get anything wait I thought we were going after giant rats in the sewer oh yeah I assume that guy's dead chilling Finn tol well you wrote his name down I didn't know what I didn't know what was going to be important I thought this was like clue we should talk to Finn we should go in make sure Finn wait wait wait I want to loot the body yeah all right investigation which one the dog with no anus or want which is a horrible image",
      "start": 3018.8
    },
    {
      "text": "like clue we should talk to Finn we should go in make sure Finn wait wait wait I want to loot the body yeah all right investigation which one the dog with no anus or want which is a horrible image by the way I R A it's like a dark and slip and slide out there right now it's just in my werewolf form I'm sniffing The Refuge of the anus are you eating it no maybe checking it out a little nine nine all right as you as you pour through the body of poor bog uh you managed to somebody else roll you find a uh a singular potion uh actually you find on on his person what looks like one of the creatures that bog had eaten and kind of strapped the decaying remnants of this traveler within a part of a package there's mostly broken glass but there is an intact vial that contains a potion of gashes form plus one potion for me gashes form y nice I rolled when you said to roll I I rolled 11 what happened for investigation yeah okay all right so as you both are are angrily searching through you find",
      "start": 3075.92
    },
    {
      "text": "plus one potion for me gashes form y nice I rolled when you said to roll I I rolled 11 what happened for investigation yeah okay all right so as you both are are angrily searching through you find this potion as you go through and find what appears to be a mostly nodon human hand that contains a singular ring awesome the ring is quite shiny and amongst all the rest of the dirty looking interior of this bag it seems to be unscathed by the filth around it hand over the ring pterodon no I'll fight you for I cast charm person on pterodon hey what's up I'm Charming now go ahead and make a a wisdom saving throw five confidence four you're my favorite you are the MVP candidate te it on Master Cliff here reporting from hell so so teod on looking down at your ring you look over and you realize truly your life was saved by this tling woman and all this time through all this these moments of frustration uh you never understood why you didn't just allow yourself to to like her and be a friend it",
      "start": 3134.64
    },
    {
      "text": "your life was saved by this tling woman and all this time through all this these moments of frustration uh you never understood why you didn't just allow yourself to to like her and be a friend it before I don't know I feel like we've always been friends and never realized it before Jester yes that ring is very beautiful would you like it I would love it oh my God here you go thank you so much this has been a pleasure we should hang out sometime we all the time all right I don't like Nick I'll talk to L what is it you also acquired a ring of a ring of the ram ring of the ram I put it on what does it mean all right it has three charges on it you can expend a charge on the ring to uh to cause a uh a spectral Ram head to appear and slam into something within 60 ft of you to do damage and push it back wa okay Jester you look so good in that ring thank you you ever want to you know just try you try it out and ram somebody I'm here I'll let you know if it's of interest to me anytime just",
      "start": 3190.28
    },
    {
      "text": "it back wa okay Jester you look so good in that ring thank you you ever want to you know just try you try it out and ram somebody I'm here I'll let you know if it's of interest to me anytime just let me I'm here it's cool you go talk to your other friends now totally which one would you like me to talk to go talk to that little halfling man all right cool what do you want what do you want me to say to Nick tell him he's very small cute hey Nick what's up like we were just talking over there did you know you're small it's not that I'm small the rest of you are just tall that's what I'm trying to say you're just abnormally **** tall all of you Nick you're unusually small even for a halfing you know I'm a quarter my sheet here hey hey hey whoa TOEFL no yeah no to I'm Finn Finn TOEFL that's me T ey Giant Boulder I'm I'm not the boulder I'm good from the boulder but those giants those giants right forget the rats we're on to bigger things here that Borg **** whatever his name was what",
      "start": 3239.76
    },
    {
      "text": "me T ey Giant Boulder I'm I'm not the boulder I'm good from the boulder but those giants those giants right forget the rats we're on to bigger things here that Borg **** whatever his name was what was my last name B yeah I know he's dead thank God but uh The Troop who brings me the heads of these menacing Giants shall find their pockets 1 000 G wa th000 G so many G's wait so oh but more importantly they're Pro they will prove themselves the better hires for all to know in thun's Crest that sounds like something that you guys might want this interests me yeah I'm so into this if I get the th G I can give it to Jester what do you what would you get for a th000 g i I don't know her love probably I imagine she really respect probably she likes gold is G the gold well Finn GP is gold pie yeah Finn I don't know if I want to work with these this Riff rff to be real I don't I don't care really I just need these Giants to get taken care of you guys couldn't deal with the rats freaking",
      "start": 3292.24
    },
    {
      "text": "yeah Finn I don't know if I want to work with these this Riff rff to be real I don't I don't care really I just need these Giants to get taken care of you guys couldn't deal with the rats freaking Boulders coming and stuff like I feel like we're a pretty good team if if this hling here can control his fiery look you can't his giant fiery balls balls you know I would never never go against you but just remember I mean like Nick the Mage is so small that it's hard for him to see where he's throwing he's so like behind all of us we are we are merely passing through perhaps if we join up this one time we can split the Bounty with these Bumble **** and move on our way quickly forget not that I damaged that Beast you did quite a bit you did these two idiots didn't do anything that's true uh don't forget he was distracted by my body am I right don't forget don't forget that I paid for your body you would pay me back hey who got the bad deal there I'm just saying you're always out here",
      "start": 3347.84
    },
    {
      "text": "uh don't forget he was distracted by my body am I right don't forget don't forget that I paid for your body you would pay me back hey who got the bad deal there I'm just saying you're always out here talking about your Universal OB fan healthare he does have a wolf nose can I use my my um my heightened senses to smell where of this giant hath come from Jesus yes you can uh yeah your your form actually because you've been transformed for about a minute now and your form begins to revert to your human form David Banner exactly but but but your hybrid senses David Banner forgive me but your hybrid senses are raer senses can be used in your regular form as well you yeah Wolverine style you still have a really good sense that's my Logan NOS here we go so go ahead and make what is it it's a perception check with Advantage because oh snap dragon 1  hey there you go plus my what is it nipples and balls it's your perception ni and balls balls MH I should make it survival for this one",
      "start": 3402.48
    },
    {
      "text": "a perception check with Advantage because oh snap dragon 1  hey there you go plus my what is it nipples and balls it's your perception ni and balls balls MH I should make it survival for this one because it would be tracking technically uh 16 okay so as you guys are all having this discussion uh the once werewolf now no longer werewolf uh begins sking across the ground you pick up a trail you now see the giant has waited through the outskirts of this edge of town and after you guys kind of give a little bit of Chase leads outside of the village down into a Ravine and what looks like uh over the hill into a large culous opening in the ground wait he's running he's running off on all fours like a dog no no like a human oh do slow pedal like our our friend David Banner David Banner confused cousin emulates him at every turn David get back in the **** house it doesn't take long before you actually begin to locate the heavy footfall the footprints within the muddy hillsides here of",
      "start": 3453.04
    },
    {
      "text": "cousin emulates him at every turn David get back in the **** house it doesn't take long before you actually begin to locate the heavy footfall the footprints within the muddy hillsides here of the Giant and the creature that you just fought uh leading down into this giant foggy Ravine known as the devil's Basin oh **** oh my go Devil's Basin now real quick I'm throwing up the agreed upon sign before to break us from our RPG Haze and ask you a real question as a human being yes not as pterodon Master cff who's also a human being but well yeah you anyway is there end dungeons dragons do our Quest go on forever uh well there there is an end to this Quest okay cool I'm going to do a topic break here cuz then we have an hour so we can do two 30-minute chunks let's do it done that's it now we're back to the next topic what's up it's us Kinda Funny last time on dungeons it is things got real the Kevin you put a monage here then got on stupid **** and then he died brilliant then I",
      "start": 3506.32
    },
    {
      "text": "we're back to the next topic what's up it's us Kinda Funny last time on dungeons it is things got real the Kevin you put a monage here then got on stupid **** and then he died brilliant then I fell in love you did fall in love's up everybody t on Master CLE here A B move I feel like the fireball was especially big considering Nick's small stature as well it was very impressive cross so small 6 60th 65% off crossover crossover up crossover up uh so as as you guys continue to gather uh in the path of uh toss Cobble who is leading you through the tracks of this giant over the hill down towards the devil's Basin it takes about a good 45 minutes to an hour to reach the edge of the fog bank that covers the entire uh dip of this Ravine at which point the charm person spell wears off and you suddenly feel wait wait what I I don't remember okay Nick come here yeah you **** up I don't understand I like why did I all a sudden like Jester cuz you were thinking with the wrong part of your",
      "start": 3553.68
    },
    {
      "text": "suddenly feel wait wait what I I don't remember okay Nick come here yeah you **** up I don't understand I like why did I all a sudden like Jester cuz you were thinking with the wrong part of your body and you gave her a ring and that ring is going to come back to Ram you up the ass at some point sounds like you're drawing from your own personal experience the Mage wishful thinking perhaps the Mage does not know idiots there's a lot of gold on the line let's go okay let's keep going wait hold on hold on does she did she hear us should I see can I should I keep pretending that I'm I'm in love with her yeah you should keep pretending that you're in love with her I hear everything you God damn it I should have left you unconscious on the ground I want to can I join your team you might have to General principal there's too much talent being wasted over there typical typical Democrat over here just like **** helping somebody who doesn't deserve the help getting back on their feet why we",
      "start": 3609.8
    },
    {
      "text": "General principal there's too much talent being wasted over there typical typical Democrat over here just like **** helping somebody who doesn't deserve the help getting back on their feet why we love you that's why we keep you around Democrat thank you trodon did you want something Julian I I I was going to say I'm I'm tired should we maybe take a short rest how are you doing pterodon this sounds like a trap no we should sleep don't talk to me w woman with your charm smells what what you're okay I don't mind you that much you talk nice Dam nice all right actually short rest isn't a bad idea we can heal up a little bit and you get some things back and you yeah you especially needed pterodon re charge yeah how you doing pterodon I'm fine I just want to make sure salad tosser is in the other tent and I don't have anything happening that's my second cousin removed he is a handful great at parties are you arting take a short rest yeah and I'm going to I'm going to use a couple hit dice",
      "start": 3658.76
    },
    {
      "text": "tent and I don't have anything happening that's my second cousin removed he is a handful great at parties are you arting take a short rest yeah and I'm going to I'm going to use a couple hit dice to heal my so you guys take a short rest here it's about about 30 minutes to an hour rest to go ahead and just recuperate um you will see on your sheets it'll say hit dice it should be like a a a dice roll yeah HD H HD right 51 5 10 so you can you can roll up to that amount to heal yourself while you're resting so so you can take a 10-sided dice which is one of the more like on okay this yeah you can go ahead and roll that a few times and heal yourself up what you roll that's five added up uh yeah they all add up want you can do it four more times gotta I'm caught thank you you add your con modifier to each so it's plus two to each of those roles oh yeah that's right mhm this resting was a good idea Y watching Greg play D and D is amazing there's so many notes yeah is that how you're supposed",
      "start": 3707.16
    },
    {
      "text": "to each so it's plus two to each of those roles oh yeah that's right mhm this resting was a good idea Y watching Greg play D and D is amazing there's so many notes yeah is that how you're supposed to do it the way he rolled his dice thing cuz it was very it look like you were jacking off do it do it again for Daddy there you go one more time I'm sorry like it's still it's still in my head right now you know it has it's a wearing powerful wearing off the lingering effects of Arcana can be confusing I cast thermatology and all he hears around them is just Whispers of Jester Cher cherer that's a 10 that's a 10-year-old not again Z is 10 right wait 001 or 0 I 5957 but you just I was jacking off I was jacking off that was just to bad because you were going to get some great I'm not going to lie service Democrat I won't you abuse the system Democrat to get ahead oddly you won't find any arguments from me oh wow all right I'm only oh no I'm oh Jesus there's a lot of math in this",
      "start": 3760.4
    },
    {
      "text": "going to lie service Democrat I won't you abuse the system Democrat to get ahead oddly you won't find any arguments from me oh wow all right I'm only oh no I'm oh Jesus there's a lot of math in this game it's all right five plus three it's usually addra I have of course there you go it's the the the bourbon short rest it's important for the party to this the bourbon short rest commences I call the party over Julian all of us the whole party yeah everybody cuz everybody's following my my Hound's nose right yep you're you're you're currently leading the tell us what your wolf senses have found a little it's led me to this Misty covered Basin called The Devil's tank what was it called the devil's T devil devil B Devil's Basin the devil's tank thanks does it pick up anything else or it just leads to this Basin and all of a sudden I feel like stopping just like an OB you have to socialist Sanders fan is my cousin I decided to stop outside of the fog because it looks perilous perhaps if",
      "start": 3819.12
    },
    {
      "text": "leads to this Basin and all of a sudden I feel like stopping just like an OB you have to socialist Sanders fan is my cousin I decided to stop outside of the fog because it looks perilous perhaps if anyone wants to prepare themselves before heading into the great unknown now would be a time to do so oh I have a good idea right I'm going to cast pass without a trace on all of us oh **** really all right yeah we all like that so all of you currently as long as she's concentrating you get plus 10 to any stealth checks you make which means if we roll in here super Sly nothing can tectus as long as your stealth rolles are high that's what Nick was looking for let's go with Fireball as as as just finishes casting you look around you and what Shadows there are on the ground begin to coales around your feet and legs and you you look around you and see that your actual lower torso is difficult to see and this amount of fog in surrounding obscured daylight except for a Democrat cuz his lower",
      "start": 3884.08
    },
    {
      "text": "your feet and legs and you you look around you and see that your actual lower torso is difficult to see and this amount of fog in surrounding obscured daylight except for a Democrat cuz his lower torso is just so big there's just so much going on you can see that through the fall I'm jealous of that indeed thank you I'm sure you are little man that's a great point now hold on a second so the fog is enveloping our lower portion is the quarter Mage like completely obscure right you got like eyes up got it's pretty it's it's pretty great in this circumstance just eyes yeah um as you guys begin to Trek down into the devil's Bas Ste you guys pushing into the fog I want you all to make stealth checks R  0 add your stealth skill plus 10 natural  0 oh yay we know that's important 14 natural 14 they call it  4 nice nine plus 10 19 19 all right I have a 16 but where's my where is it Ste plus n so  5  5 nice 10 plus 10 you H  4 oh no I just don't know math that's fine all right you guys Cruise",
      "start": 3935.08
    },
    {
      "text": "call it  4 nice nine plus 10 19 19 all right I have a 16 but where's my where is it Ste plus n so  5  5 nice 10 plus 10 you H  4 oh no I just don't know math that's fine all right you guys Cruise ever so quietly down and as the the basin's bottom drops out into a gradual leveling point you find yourselves surround Ed by uh a series of broken trees pushed and snapped at the center of their trunks you can see ahead what eventually looks like a set of human entrails cast into the branches of a long dead Willow Tree Lord uh not too far from that you come to the base of what looks like a rock cliff or a mountain and a shattered woodb built wagon lies not  0 ft from this Cavern entrance you see partially sunken into the cragmire the uh the wooden uh Wagon Wheels and what pieces of the shattered boards are currently jutting out of the the mud itself um there is the mouth of the cavern seems to have some sort of a uh a a nasty Mossy exterior and it looks almost like a a very very damp casual",
      "start": 3982.48
    },
    {
      "text": "boards are currently jutting out of the the mud itself um there is the mouth of the cavern seems to have some sort of a uh a nasty Mossy exterior and it looks almost like a a very very damp casual water drop from the very outside of the cavern entrance what's it shaped like the entrance could it be like a lion could it be the Cave of Wonders can we make this happen please all of you make a perception check yeah ADV damn right for Mom with my height and senses 18 which is good 15 19 six 16 13 plus adds up 19 11 + 1 1  okay all of you stare at the cavern going it looks just like a cave but you who have the imagination of a child see like that could totally be like a lion face I feel like I've seen this movie before what could possibly go wrong I like this uh before we so um Julian goes up to the edge of the cave and I'm going to do Divine sense and see if I can sense any um you said this is like the devil's hell M it's called Devil's Bas Devil's I'm going to search for fiends I'm",
      "start": 4045.12
    },
    {
      "text": "up to the edge of the cave and I'm going to do Divine Sense and see if I can sense any um you said this is like the devil's hell M it's called Devil's Bas Devil's I'm going to search for fiends I'm going to search for like fiends okay yeah uh as you concentrate at this moment kind of closing your eyes and thinking about it uh no fiends, no celestials, no Fay, no Undead come across your intention which is good welcoming looks good guys let's go yeah I got it I rush ahead of the group and run in I give him a high five on his way in all right so we have Pterodon who's up after Pterodon I'll go behind him Pterodon, Jester I'll go behind Jester all right Pterodon, Jester, and Julian and then and then we we'll take up the rear that makes the most sense and I'll be the final all right great the Caboose all right you guys continue into this Cavern you can feel a a a very gentle warm wind blowing out guys it's really nice in here shut up sodon you're in the back you shut up here we go and you can hear",
      "start": 4106.12
    },
    {
      "text": "right you guys continue into this Cavern you can feel a a a very gentle warm wind blowing out guys it's really nice in here shut up sodon you're in the back you shut up here we go and you can hear the dripping this is my moment you know what I mean like I'm finally going to redeem myself should we we're still steing right yes you are still steing I got my hand on the hilt of the People's Edge I'm ready unleash this battle axe I know we're still waiting as you push further down the cab it begins to descend and turn around on the right and you hear this slight what sound that comes to a halt as it does this sudden globule of some sort of liquid slaps down on top of Pterodon, Julian, and Jester are ping I need you all to make dexterity saving throws oh no what 17 I add to the two yeah yeah I'm getting this game 19 oh that was 16 all right you guys manag to dodge out of the way and what a little bit hits you slides off your armor and slops into the ground before just slowly dissolving okay",
      "start": 4161.6
    },
    {
      "text": "getting this game 19 oh that was 16 all right you guys manag to dodge out of the way and what a little bit hits you slides off your armor and slops into the ground before just slowly dissolving okay uh Jester was not as fortunate as it slops completely over upper torso and you suffer an immediate uh three points of acid damage and it begins to burn into your torso Chester get your clothes off it's the only way Listen to I don't think it's type of thermia super cold in here though Jester as they're as they're discussing you take another three points of acid damage it's still burning through you somebody oh no what okay I'm going to do still see smoke buring up you see some help I'm going to go up and do lay on hands why you touching me um cuz you're close touch me I'm going to do lay on hands I'm going to expend Five Points to try and neutralize the acid help me can I do that okay you heal Five Points oh **** you heal Five Points however this not being a poison or disease effect you",
      "start": 4220.96
    },
    {
      "text": "I'm going to expend Five Points to try and neutralize the acid help me can I do that okay you heal Five Points oh **** you heal Five Points however this not being a poison or disease effect you then suffer another eight points of acid damage as it continues to burn through your body what do you what do you do you guys have anything I'm walking over right now what I'm doing is Tak water on you what I'm doing is taking two of my gold pieces and laying them over your eyes I whisper in your ear I'm sorry I wish I could save you **** B what the **** is happening I don't have anything I can take another two points of acid damage **** can I use my slight of hand and see if um looks like it can I what's his I take myON and see if Pterodon has any um water on him okay as as you oh man I'd love to but I just gave you those coins yeah as you're gra groping them with the coins across your eyes you're suddenly confused as a as the edge of a glass vial is jammed into your mouth go ahead and",
      "start": 4274.2
    },
    {
      "text": "to but I just gave you those coins yeah as you're gra groping them with the coins across your eyes you're suddenly confused as a as the edge of a glass vial is jammed into your mouth go ahead and you heal D4 plus two points of damage as uh Nick the Mage Grace lend you a healing job Nick that Nick Nick fire is acid's enemy Nick I saw you struggle take the cork out of the the potion with your small hands but you got it it's been a long time the has been in there for a long time plus plus two it took a while you get the cork out it's just like an old jar May bur you find water still burning yeah you find water so she she rips the wine skin from the side of your pouch can I can I and I want to pour it on myself and maybe help is there dirt on the ground yeah there's like bits of dirt in broken rock and Shale I kind Julian starts Gathering up the dust you you pour the water on you and it just kind of drips off you take another seven points of acid damage apparently it's very viscous",
      "start": 4330.12
    },
    {
      "text": "broken rock and Shale I kind Julian starts Gathering up the dust you you pour the water on you and it just kind of drips off you take another seven points of acid damage apparently it's very viscous liquid is still clinging to your form okay I Julian gathers like all the dust and starts caking her with dust okay it begins to it begins to congeal around the acid it's still burning slowly start scraping it off uh the stick the the handle of my warpick okay all right effective so uh you guys uh over this next minute you see her scraping it off and you do manage to get the acid off okay she's Louise that was hard the a is no longer burning you is your warpick magical it's I don't know no I can cast magical weapon on it and it can become magical before you as you got guys have a sigh of relief and notice that Jester is no longer burning you smile and you look at your warpick and the handle is gone it is just the head of a warpick now with no actual handle the has dissolved most of the",
      "start": 4377.16
    },
    {
      "text": "and notice that Jester is no longer burning you smile and you look at your warpick and the handle is gone it is just the head of a warpick now with no actual handle the has dissolved most of the weapon it sucks that sucks that does suck what uh you did what you had to do okay Julian don't worry the People's Edge will protect you from here on out I'm at the front of the party everything's chill BT dubs Jester can I get them two gold pieces back they are mine now we just take it as a gift just like you know what I'm saying all right talk to you later 31 yeah it's fine do you need to deal it all do I need to heal well no okay uh as you guys continue to stealthily make your way down this Cavern it curves around in the pitch black you guys are kind of keeping in the shadows you see a faint bit of flickering light in the distance you want to use my whip guys I think it's a shop huh what I think there's a shop up ahead I'm in the lead there's a there's a flicker flickering light over there",
      "start": 4424.92
    },
    {
      "text": "of flickering light in the distance you want to use my whip guys I think it's a shop huh what I think there's a shop up ahead I'm in the lead there's a there's a flicker flickering light over there should we are we stealing still oh yeah we're stealing the **** out of this place I'm going to no yes I am cuz you're in the lead right right don't worry guys I got this I'm going to give him the BL TR this is going better than I'm going to give him the blessing of my God the blessing of the traveler of the trickster and I'm going to that gives you advantage in all your future stealth rols thank you so much all right I knew you loved me with that a faint a faint purplish Divine glow kind of Silhouettes around your form before sifting into your armor you feel your actual body get a little bit colder as the Shadows grow even darker around you I need everyone to make another stealth check as you move forward yes ni this H oh no **** no what is your deal 19 you're cursed is there any",
      "start": 4475.96
    },
    {
      "text": "bit colder as the Shadows grow even darker around you I need everyone to make another stealth check as you move forward yes ni this H oh no **** no what is your deal 19 you're cursed is there any stealth thing I need to add it to okay those are both out both of these **** are out 10 19 11 11 all day today all right so as as you guys come around the corner ever so quietly tiptoeing about you see now this flickering light source is actually a rather decent sized bonfire on the far end into this larger Cavern that opens up probably about a 5t ceiling at its at its apex in the center uh ker uh and you guys hear what sounds like guttural whispering in the distance yes but then it gets really quiet and you can see just framed in the distance around the fire light two large giant type forms that have turned around and are now glaring at the opposite side of the cavern towards where you guys were entering as you all hear the slight jangling sound of metal emanating from the clinking of",
      "start": 4516.08
    },
    {
      "text": "that have turned around and are now glaring at the opposite side of the cavern towards where you guys were entering as you all hear the slight jangling sound of metal emanating from the clinking of Jester's armor she's so clinky guys be easy on her what she just had a whole bunch of acid on her she's seen a lot of things what's wrong with you Pterodon who who enters the cavern it is I Terod on Master Cliff and I'd like to talk to you guys about my Lord and Savior The Traveler tell The Traveler I know a bog b a bog sounds familiar said bog where is bog came to our Fair town where we had a problem with Boulders raining from the sky he said he would save us and I'll tell you guys look he tried he tried really hard and he protected many a human and many a mini manyi manyi little **** tiny people M over there the alcohol sounds like fog the alcohol fog died a hero and we come to pay our respects to you guys and really just help you out all right at this point the two giant forms come",
      "start": 4577.32
    },
    {
      "text": "people M over there the alcohol sounds like fog the alcohol fog died a hero and we come to pay our respects to you guys and really just help you out all right at this point the two giant forms come forward you can see one is uh massive and Rippling in muscles with a head even smaller than bog come stepping forward first as a female giant behind with with more intelligent eyes and expected of the Hill giant species long straggly kind of gray and brown hair OB looks like your type um I need you to make a deception check this is fun big money no way made 16 plus plus Zer plus zero 16 hold that 16 plus I'm this guy okay so uh B hero and the larger female start stepping forward bends down right to your face like glaring at you now and when there's this horrible stench of like decaying veget a and meat just pouring from the outside of her mouth that hits you like a solid wall of hate she says and why did bog die uhoh he sacrificed himself for all of us and all of our people our sheep our",
      "start": 4639.08
    },
    {
      "text": "a and meat just pouring from the outside of her mouth that hits you like a solid wall of hate she says and why did bog die uhoh he sacrificed himself for all of us and all of our people our sheep our cattle yes enough got it on theia you have licking her lips you have C we do we've come to pay our specs and talk to you about a deal a brokerage actually what we like to call it is some kind of honorarium for bog you know what I mean you follow me on this one what is onari I think they want to give us the their their food give us food now and we let leave thank you very much for understanding what we want mhm close your eyes and open in your mouth and we will give you the food we have brought you cuz this was B's final request underneath a boulder he said I want my two friends in the **** fog to taste the Sheep of your people te it on master cleff and I of course am just a weak willed human fighter male so I kneel down and said I understand bog and we have brought you the finest Meats",
      "start": 4704.32
    },
    {
      "text": "fog to taste the Sheep of your people te it on master cleff and I of course am just a weak willed human fighter male so I kneel down and said I understand bog and we have brought you the finest Meats but much like the Masquerade play we've all watched called Hook the food is invisible and you need to open your mouths with your eyes closed for us to give it to you make a persuasion check oh my God I don't know it might be the best **** I've ever heard 15 hold on there's something else I add zero okay Masquerade you can see now uh as this this this this looming angry giant form with this this you know broken and protruding lower jaw with Jagged teeth and the smell pouring into your face kind of glares down at you looks back again at WF the other Giant in the back of the cave and goes we will taste of B's wish closes her eyes and opens her mouth her tongue kind a Laing out and dangling about the size of you yeah Nick Fireball all time this this will be a surprise round for Nick so yeah",
      "start": 4776.6
    },
    {
      "text": "taste of B's wish closes her eyes and opens her mouth her tongue kind a Laing out and dangling about the size of you yeah Nick Fireball all time this this will be a surprise round for Nick so yeah **** brilliant that's amazing I mean absolutely **** brilliant oh jeez oh Jesus yeah dund and wal all right so we have in between them Nick right in the front there we have Greg why this is how B wanted it we don't know that for sure but let's follow through there we go all righty so top of the round at this moment Nick you're going to go ahead and Lop a fireball I feel like that might be a little Fireball where you lobing it where you pointing it towards go back guy back right they all have their mouth one okay to the so she's bent down uh this wa is not this will be your target so yeah go for it but he has his mouth open correct cuz she has the she told him we're going to fulfill log's request oh so he's hungry so so yeah he's closed his eyes as well open just waiting to be fed uhal",
      "start": 4842.4
    },
    {
      "text": "for it but he has his mouth open correct cuz she has the she told him we're going to fulfill log's request oh so he's hungry so so yeah he's closed his eyes as well open just waiting to be fed uhal sure shter sure all right so a fire a fireball come as you bring up your finger you aim directly towards the mouth and let Le let loose this this beam of red energy that slams right in the back of W's mouth w w closes his mouth for a second what's it taste like chicken boom that point it just detonates outward blowing out both cheeks in the sides of W's face the fireball engulfing The Backs side of the female giant uh make a dexterity saving throw you roll 8 D6 damage if you could 8 D6 my God this is amazing big money no amies and then double it right yeah technically Fireball you don't roll to attack so it's not a critical but that is all right so so you with a minus one you succeed so you take half damage she does not yep all right so you take 11 points of fire damage you're going",
      "start": 4913.0
    },
    {
      "text": "attack so it's not a critical but that is all right so so you with a minus one you succeed so you take half damage she does not yep all right so you take 11 points of fire damage you're going Mark that on W what's the female's name again uh you haven't heard her name yet I apologize there we go Mark that all right now battle has initiated guys roll initiative critical roll time is it that time yet it is son of a **** God **** damn it four plus four plus okay so so eight three all right so seven so we have 0 to 15 anyone I've ever rolled in the world uh I have 16 have 16 all right so we have no one else can't I use when he was casting Fireball can I cast something unfortunately no that was a surprise round now the combat's begun all right 16 you said uh was it Democrat yes all right do we all have surprise no that'd be cool no that was the fireball was the surprise around damn it um all right good job 15 to 10 uh 11 same here all right we have 114 Julian and McLaren to",
      "start": 4976.08
    },
    {
      "text": "all right do we all have surprise no that'd be cool no that was the fireball was the surprise around damn it um all right good job 15 to 10 uh 11 same here all right we have 114 Julian and McLaren to Cobble I have no weapon all right uh now's no time for jokes 10 to 5 I have six I have seven seven y he's got six well I just have a giant warpick head now and no hand cross you hand four okay and bringing up the rear is Jester all right first round of combat actually from the the blast of fire blowing behind her this this female Giant's eyes burst open with rage and anger and goes you will pay and become my foood uh she then reaches over grabs this large Club from the ground behind her and is going to rain down onto you with two attacks damn the natural 0 to be clear understand why MOG thought it was so tasty either and a and a 19 what's your armor class Armor class is 19 as well so it just barely hits you so the first hit is a critical you're you're **** dude Maybe not maybe not",
      "start": 5033.04
    },
    {
      "text": "thought it was so tasty either and a and a 19 what's your armor class Armor class is 19 as well so it just barely hits you so the first hit is a critical you're you're **** dude Maybe not maybe not maybe not be positive theame take 5 points of bludgeoning damage from the first hit I'm so impressed and that'll be seven points of Legion damage from the second okay uh at that point she's going to go ahead and step backward this way and try and lure you all deeper into the cavern in doing so uh Pterodon you get attack of opportunity as she's backing away so go ahead and make a free strike towards her can I also use a potion of healing on your turn you can okay thank you very much using this opportunity as she Le us for guard God **** damn it Greg maybe throw it harder Plus next time you get attack bonus should be under the weapon yeah under your weap oh sorry my weapons right here main hand plus plus plus eight okay all right so Plus 8 to 4 it's 1 uh just barely misses W passes by",
      "start": 5101.12
    },
    {
      "text": "get attack bonus should be under the weapon yeah under your weap oh sorry my weapons right here main hand plus plus plus eight okay all right so Plus 8 to 4 it's 1 uh just barely misses W passes by her form untouched way to go Pterodon hey you know what I had a really great idea that worked out really well that was the best of all time they got a whole Fireball on him Fireball Democrat Obama fan your turn a fireball I'm still range so I guess I'll use my uh stay quiet use my crossbow okay uh if you want to go ahead and try and hide first using your bonus action yeah let's do that since there's enough shadow in this Cavern for it sure absolutely one oh so not so much stealth all right and then we'll shoot go for it which one the female or the male uh the female she's already damaged six plus plus is it the one per weapon like yeah so 7 13 13 just tiits go and roll damage nice one8 where is it there it is one oh no Five Points of damage from the crossbow not quite breaking the outer",
      "start": 5156.44
    },
    {
      "text": "plus plus is it the one per weapon like yeah so 7 13 13 just tiits go and roll damage nice one8 where is it there it is one oh no Five Points of damage from the crossbow not quite breaking the outer shell of this tough giant female all right Democrat fan you want to move or you want to stay where you are uh I'll stay where I Amar out of the way better stay white down there stay wide I'm already behind good all right I'm going to First cast bless in there all right all right three targets right um three targets I'm choosing I'm going to choose uh uh Jester let's do Pterodon since he's looking pretty rough and um let's do Democrat all right so every round with this bus spell you can add a D4 to any attack roll or saving throw that you have to make one or the other yeah all right and you want to move you going to stay where you are um and then that was my action right um I'm just going to kind of move back over here great kind of it's one D all right toss Cobble you're up toss cble would",
      "start": 5206.36
    },
    {
      "text": "to move you going to stay where you are um and then that was my action right um I'm just going to kind of move back over here great kind of it's one D all right toss Cobble you're up toss cble would run like to run to the front of the line as far as his 30 speed will carry him that's as far as yeah and as his action he will I will transform into a **** werewolf werewolves in London damn and with his bonus action he will activate that Crimson right **** long the long s all right and with that as the transformation is complete you can see a slight blue glow emanate from the blade in his grasp as ice energy Springs forth in casing the blade all right that ends your turn next up we have wow Thunder you are my beautiful woman that I want to be with me I want to rule the city with you we could be king and queen together I have a plan W not now can eat Intruders they **** stupid romance my plan my plan I like I like the dwarves and the shiny things so I want to pick up her and use her",
      "start": 5275.08
    },
    {
      "text": "be king and queen together I have a plan W not now can eat Intruders they **** stupid romance my plan my plan I like I like the dwarves and the shiny things so I want to pick up her and use her as a weapon to hit her in the head and take her ring not just rude rude why you even see I have a ring on you it's so shiny and I like shiny things all right well go ahead that should have a fider pilot make an Athletics Athletics or acrobatics I'll go Athletics cuz that's better come on oh that 0 damn it can't it was going to be so cool you're going to try again however she does Dodge out of the way cuz that was your first TR okay I'm I'm going to try that again all right go ahead and make another check as you 14 plus AC which is a four so 18 18 the first one you go to move and she just Ducks out of your grasp the second time you reach out and manage to grab her but with that her Dwarven hand so small but so strong peel back your fingers in a very Looney Tunes kind of fashion TWY bird one",
      "start": 5335.0
    },
    {
      "text": "out of your grasp the second time you reach out and manage to grab her but with that her Dwarven hand so small but so strong peel back your fingers in a very Looney Tunes kind of fashion TWY bird one at a time and shoves your grass po the dwarf unscathed by your grip I'm a slippery one so Nimble all right WF that ends your turn uh Nick the Mage all right no big deal hold on top break we return to The GameOverGreggy Show across the finale critical role and Nick the Mage the tiniest little little Mage on the team he's trying though Greg tiny little dig you're so small show me what you have destroy them this music is so good I would like to use something called the Scorching Ray Scorching Ray heck yeah yes dude get into this you get to shoot three Rays you can choose all at one target or at different targets choiceed I ni the Mage I think you need to use this one for this big dog I think might Dent the table Yeah use it on the pad if you want what would you stab your I I hit it but I hit",
      "start": 5396.36
    },
    {
      "text": "targets choiceed I ni the Mage I think you need to use this one for this big dog I think might Dent the table Yeah use it on the pad if you want what would you stab your I I hit it but I hit that the pointy DS Nick what are you aiming them at let's aim them all at the big one all right the wa right there which you can see go for it so go ahead and you roll roll of 3 d 0s sounds like a stupid ass plan Nick the Mage that's a hit 17 second one 1 1 with this plus seven that hits a third time do it that hits all three hits to roll 6 D6 fire damage on you okay where's my other one well he made your D work shut up that's the dice that killed me in in our critical roll game I thought nobody ever died in critical roll wasn't that something you guys said no I died I was just brought back to life oh okay so like Travis though made a big deal in my 19 19 points of fire damage to W Mark that down as these blasts go streaking into the front face and chest area of this giant burning burning the",
      "start": 5456.28
    },
    {
      "text": "oh okay so like Travis though made a big deal in my 19 19 points of fire damage to W Mark that down as these blasts go streaking into the front face and chest area of this giant burning burning the cheek and jowels of w the jws what the **** is a jwel Nick do you want to stay where you guys they wanted to be king and queen they're in love this is what we're doing murdering them front of each other Tak the Roy I understand no one else can understand but yes turn oh sorry I was making a monologue over here I I'm starting to feel bad when we started off in this Quest I was just like you guys a male human fighter just here making his GPS and his gold and living out but then I fell in love with the one and only Jester and it started as a charm spell as most things do you slip somebody something and then it all just happens it all just happens here we are should we try to talk to them again kill them i' like to talk just Jester you understand the connection we have the high fives we've",
      "start": 5508.28
    },
    {
      "text": "and then it all just happens it all just happens here we are should we try to talk to them again kill them I'd like to talk just Jester you understand the connection we have the high fives we've shared the gold I've put over your eyes I know it's wonderful the ring you gave me now kill them you got it your Cru very I'm going to come at him right now of course with the peoples okay are you going towards W or you going toward I'm going towards beron jals all right go for it roll High 17 that's a hit roll again damn it four great give next time can you roll the dice you do have a fighter ability where once per per shortest you can do action Surge and get two additional attacks do action surge sure all right go for it can I also can I also use my potion right now as a bonus action you can yeah and how many points does that re for you right now three six eight points you heal okay I'm plus and you get two more attacks the attempt seven seven plus what you can also add plus eight right 15",
      "start": 5563.6
    },
    {
      "text": "and how many points does that re for you right now three six eight points you heal okay I'm plus and you get two more attacks the attempt seven seven plus what you can also add plus eight right 15 plus seven plus CH to add a sorry I'm sorry if both hands I'm sorry yeah so a third one remember she bued you 11 11 plus yeah that hits they have three attacks go and roll damage three times on W with that other one you're going to use uh you're using both hands I assume right one d10 too much we too much he did good so eight on that one 3 plus 5 that's 3 plus 5 okay so 13 Char Edge 8 plus 5 so so 13 again yep so uh 6 6 damage so damn y'all **** yeah get it get it yes sir and 3+ 8 so 11 another 11 damage on top of that so 37 right 37 points of damage Dam as you go rushing forward screaming Jester out in the middle of the echoing Cavern floor your blade comes down once twice Thrice gashing giant wounds into the front of W the giant **** your J Jester it's your turn oh okay um I'm going",
      "start": 5614.76
    },
    {
      "text": "out in the middle of the echoing Cavern floor your blade comes down once twice Thrice gashing giant wounds into the front of W the giant **** your J Jester it's your turn oh okay um I'm going to use my channel Divinity and call the traveler again and then make duplicity on myself and make my illusion appear between the two of those dicks yeah right there all righty and then I'm going to use my bonus action to cast spiritual weapon again where is spiritual weapon going to drop right in front of the woman The woman there you go how does it sound when it drops ah okay good just like that needed something all right you go and roll for your spiritual weapon attack come on yes that's way better that'll hit go and roll 1d8 plus three okay okay okay come on you mother **** dice Four Points of spiritual damage that's all right that ingester turn to the top it is D's turn dunda having backed up and had this frustration happen is going to rush forward to the werewolf that is rushing toward a",
      "start": 5682.16
    },
    {
      "text": "spiritual damage that's all right that ingester turn to the top it is D's turn dunda having backed up and had this frustration happen is going to rush forward to the werewolf that is rushing toward a bolo tie that tightened around its neck the horrible sacred bolo tie the traveler all right dund angry being choked by this strange mystical neck accessory uh is going to unfurl all of her wrath against this this werewolf form before her toss cobbles who there we go that is a oo 3 to hit that'll hit and a 19 hit that also hits all right so you take a total of 4 points of bludgeoning damage my resilient high this is true so you take 1 points of buing damage total so werewolves man so resilient werewolves man so resilient and she's going to back away you know if you get damage if the if the roll just a little bit seeing you unscathed by you get attack of opportunity on her got that hits go damage oh beautiful this goes first five plus 13 15 15 points of damage the blade streaks across",
      "start": 5740.68
    },
    {
      "text": "roll just a little bit seeing you unscathed by you get attack of opportunity on her got that hits go damage oh beautiful this goes first five plus 13 15 15 points of damage the blade streaks across her front you can see now she's starting to look a little hurt but she's both scared and the fury rising up inside her this is her last stand and she's going to do whatever it takes to survive save W W all right that she loves him so much Democrat what do you got come on Demi I I didn't move I'm still I'm still distance so I guess I'll use a crossbow again okay do you want to roll us another stealth check to see if you can stay hidden sure that' be fantastic go for using your bonus action to hide 0 yeah aome now go ahead and roll your attack crossbow natural 0 natural 0 plus you have Advantage because you're not seeing currently so roll again roll again you to higher the two okay the double natural 0 all right so go go ahead and roll your crossbow bolt damage plus the 3d6 okay it's",
      "start": 5799.72
    },
    {
      "text": "because you're not seeing currently so roll again roll again you to higher the two okay the double natural 0 all right so go go ahead and roll your crossbow bolt damage plus the 3d6 okay it's three times two plus well it's three and then and then roll 3 D6 and then multiply all that times two your D6 well I use my D6 Nick the Mage is going to go potty classic Nick the Mage Nick the Mage just like your small statue your is small but your small hands plus whatever your bonuses for your crossbow uh I plus four plus four all right points of crossbow bolt damage no math you take 4 points of crossbolt damage cool Waf how you looking W not looking good not looking good at all all right ending Democrats turn Julian you're up oh all right oh hello oh hello hello W um I'm going to say W Hi D aren't you tired of being **** whipped by her I am right she's a **** and I like you I like you you dwarf really I like dwarfs well then I like dwarfs a lot move it to me and go what do you want me",
      "start": 5851.0
    },
    {
      "text": "you tired of being **** whipped by her I am right she's a **** and I like you I like you you dwarf really I like dwarfs well then I like dwarfs a lot move it to me and go what do you want me to do to you attack D I cast command you cast command I cast command make it wisdom saving okay I'm kind of into it though yeah okay so make it make disadvantage disant so make it with disadvantage because you're into it okay so so roll again take a lower of the two take the eight it's a failure yeah so is that good with that you're too good for her wolf I know you're too good I know come I'm going to H you **** down who do I need to hit just tell me I'll do it for you I love you I've always loved you Jester you're not Jer the one julul I love julan so much you stay away from Jester you're joining the party with your burnt JS but I won't touch on my woman I gave her a ring and that means something in this Kingdom and with that angrily sing forward and slamming into the side of dunda doing 18",
      "start": 5923.72
    },
    {
      "text": "the party with your burnt JS but I won't touch on my woman I gave her a ring and that means something in this Kingdom and with that angrily sing forward and slamming into the side of dunda doing 18 points of BL damage with a great Club against your once love who you've now discarded for the dwarf momentarily we can rule this city yes we can as as you BL jaop and wolf which which as soon as you bludge as soon as you bludge in D in the face she looks at you what are you doing fool and all the sh the magic Fades from your brain and you realize oh oh I shouldn't have done that that dwarf must have trick me no I'm so confused no I liked the Jord but now she betrayed me who can I love will I ever find love an existential crisis are they giants still up uh both Giants are still up however you did take damage this last round I need you to go ahead and make a a wisdom saving throw as the anger of the werewolf is now Burling up inside you oh **** oh no that is a fail plus plus a saving",
      "start": 5983.08
    },
    {
      "text": "you did take damage this last round I need you to go ahead and make a a wisdom saving throw as the anger of the werewolf is now Burling up inside you oh **** oh no that is a fail plus plus a saving through 15 you succeed you you manage to withstand the blood lust and not go raging and tearing into ter on thank you good big fan of you doing that so what do you want to do uh I Rush at she's on last legs right yeah she's looking pretty rough yeah I would like to give her what for please all right that's a natural 0 oh my God L like the third one I no that's wacky that's so wacky and then add and then add your * wait on so that's 8 * 16 plus uh yeah that's it yeah 16 with that how do you want to do this on dunda oh my God I led you sweep around behind D's legs and slice into her Achilles heel o I like it yeah as you cut across her heels G crumbles to the ground onto her knees and she looks over her shoulder as you're there behind her ready to deal your death blow yeah I sweep",
      "start": 6040.08
    },
    {
      "text": "heel o I like it yeah as you cut across her heels G crumbles to the ground onto her knees and she looks over her shoulder as you're there behind her ready to deal your death blow yeah I sweep around with an Arcy swipe and just open her throat up dunda can't make any actual verbal noise as the blood sprays out of her throat wound she collapses onto the ground into a heap of of twitching muscle and and bulbous flesh uh until she eventually goes still at your feet W suddenly realizing this is not at all what you wanted what now **** W drops to his knees it's your turn W and just screams no my D how will I rule the kingdom without you do you do you continue to fight or are you giving up are you giving up the will to fight what are you do I'm giving up the will I'm just down and I grab my do I have do I have any weapon you you have you have a great club and you have and I Pummel myself to death so I can die with the woman that I love oh my God I don't really about can I use my spiritual",
      "start": 6099.12
    },
    {
      "text": "I have do I have any weapon you you have you have a great club and you have and I Pummel myself to death so I can die with the woman that I love oh my God I don't really about can I use my spiritual weapon to tie the bolo around both their necks together oh okay this gu so cute Romeo and Juliet **** stoss no it takes it takes you good minute like she buing myself in the face all the she like as I scream her name about 30 seconds into it is until eventually Waffs also non-moving form falls to the bottom of the cavern floor them forever now bound together in death Solace and love lost in this Cavern and it was **** worth it a take that **** holy sh you guys holy sh you guys managed to Lop the heads from the corpses and bring them back to the uh the one oh yeah no one has to know that he killed himself we can say we did it guys let's all make an agreement right here right now we did it one each you you bring the heads back to the moonside lodge presenting them to the eager hands of",
      "start": 6151.96
    },
    {
      "text": "killed himself we can say we did it guys let's all make an agreement right here right now we did it one each you you bring the heads back to the moonside lodge presenting them to the eager hands of the of fin toffle the head of the of the tavern what up guys how did that whole giant hunting thing go it went well it went really well very got all right it's unreal now I'm proud of you that's all good thank you Finn but to be real I got a rat problem so I'm going to need all y'all to go kill some rats and with my wife loves me and I need to win her back and with that the traveling Adventures of the shits and the American Heroes this chapter comes to a close thank you guys so much for playing well done no no no deaths no yeah close call no permanent deaths no Perman death there wasn't no deaths W and dunda they died died together that was a lot of fun good game thank you Mike dcker for that topic cuz it made them come over and do this thank you guys for coming and do this than for having",
      "start": 6214.24
    },
    {
      "text": "W and dunda they died died together that was a lot of fun good game thank you Mike dcker for that topic cuz it made them come over and do this thank you guys for coming and do this than for having us serious uh would you how do you think our skills compare with the usual schlubs you play with Ashley Johnson **** amazing you guys picked up pretty quick I had no idea what I was doing but I like making nois tear start I felt it you know I forgot how much I love I used to play D and D so much man it is a fun game just to play with friends it's still if you can the more you can let go the more fun it I think it is AG if you just agreed that we're all going to look like **** then might as well film it so that's my question I mean we have a little bit more time here in the topic so like question is how did this begin how how did how did you know I guess Critical Role begin in terms of becoming a show in getting everybody together and discovering everybody did everybody already like D and D",
      "start": 6272.72
    },
    {
      "text": "is how did this begin how how did how did you know I guess Critical Role begin in terms of becoming a show in getting everybody together and discovering everybody did everybody already like D and D most of us had never played it really to Ms yeah never done it before I I'd played since high school but one of those things expert well expert I was an indoor kid and uh but but I loved it it was such a big part of my my my life and I love the whole communal storytelling and like it was a great way to kind of keep your imagination engaged and uh I had the opportunity to run a one shot for Liam and he invited a bunch of people over who who hadn't really played before and so we got to introduce them for the one game kind of like this we did one shot for one night and we had so much fun we decided to keep doing it as a campaign and then over two years of playing it privately we were asked by Felicia Day to pop possibly bring heard of she's never been to this house she's never called Kevin",
      "start": 6323.08
    },
    {
      "text": "to keep doing it as a campaign and then over two years of playing it privately we were asked by Felicia Day to pop possibly bring heard of she's never been to this house she's never called Kevin disgusting no probably not one day Kevin fingers crossed fingers crossed that's how happened we just she asked we do it we like sure we'll give it a shot and uh it got crazy yeah didn't think it would go anywhere cut to a year later here we are and now you've all quit your day jobs Travis of course worked at a gas station Laura some kind of waitress Barista Starbucks yeah actually took over her job as a waitress my character readed this time around oh that's that's really well thank you all for coming thank you for having us Critical Role every Thursday twitch.tv/ andry 700 p.m. Pacific Time catch it on YouTube every Monday got youtube.com correct and if you didn't know ladies and gentlemen you've been watching The GameOverGreggy Show each and every week shut four sometimes eight best friends",
      "start": 6363.32
    },
    {
      "text": "it on YouTube every Monday got youtube.com correct and if you didn't know ladies and gentlemen you've been watching The GameOverGreggy Show each and every week shut four sometimes eight best friends gather on this table each bring a random topic of discussion for your amusement if you like that head over to patreon.com Kinda Funny and toss us a few bucks to get each and every episode early along with a bunch of cool perks if you have no bucks to toss no big deal head over to youtube.com/ Kinda Funny where post the show topic by topic day by day until the entire thing posts one big free MP3 and video on the following Friday this has been awesome I love you all very much for I just met you but I do love you I love you too thank you thank you Nick I'm sorry you're so small I know is can I ask a stupid can a mage be a normaliz human being yeah oh yeah but when it's you Ducker **** you next time Nick you you could be a Goliath half giant half human but no until next time it's been our",
      "start": 6410.64
    },
    {
      "text": "ask a stupid can a mage be a normaliz human being yeah oh yeah but when it's you Ducker **** you next time Nick you you could be a Goliath half giant half human but no until next time it's been our pleasure to serve you",
      "start": 6453.04
    }
  ]
}
