{
  "id": 1701,
  "video_id": "xrz0sVlrJgY",
  "show_name": "PS I Love You XOXO",
  "hosts": ["Greg Miller", "Colin Moriarty", "Portillo"],
  "title": "Severed Review - PS I Love You XOXO Ep. 33",
  "description": "Greg and Colin can finally talk about Severed! Plus, opinions on Alienation, Axiom Verge Vita, and the Islanders win. (Released 04.26.16)\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://youtu.be/b1i1NuDHI8g\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/kindafunnyvids\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1461682802,
  "duration": 6341,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Welcome to PS I Love You XOXO Episode 33. I'm one of your hosts Greg Miller alongside the pride of Long Island Carl Moriarty. It's good to be here with you today. I'm surprised with the Jets shirt. I thought it would be an Islander shirt. I just picked out whatever was on the top of the shell. That's why I have like 150 t-shirts literally. I like that I have these drawers under my bed that are full of shirts. You don't wear them at all. No I just thought that's what I'm saying. It's like the same 10. You got to go through the goodwill. You got to go to the goodwill. I do that every so often because I like to purge the belongings that I have. I always feel like I have too many things. I don't want a lot of things. I'm definitely due for getting rid of some t-shirts because I have so many that I just never wear. We can get rid of half the things in this house and we both can. I just want to get rid of so much business stuff we totally get rid of. I don't think so. I",
      "start": 0.0
    },
    {
      "text": "I have so many that I just never wear. We can get rid of half the things in this house and we both can. I just want to get rid of so much business stuff we totally get rid of. I don't think so. I don't think so. I tell a prompter why I mix by that. There's a lot of personal items that it's like you really want to move this thing from like place to place as you get older. It's like no not really. But I'm feeling proud of the Islanders of course as a big tweet I think tweeted out our Instagram. I don't know something a picture of me crying on the plane. I think you did both. Yeah. Which was a... They've advanced. They advanced. I really was overcome with emotion. I really was. I was listening around the radio because I have the internet on there but it's not strong enough to stream the games. And just overcome with emotion. I didn't actually see the goal until this morning. It was an amazing goal. John Tavares. Exactly. Overtime goal right? Yeah. You guys were calling out on",
      "start": 51.36
    },
    {
      "text": "the games. And just overcome with emotion. I didn't actually see the goal until this morning. It was an amazing goal. John Tavares. Exactly. Overtime goal right? Yeah. You guys were calling out on the Twitters and whatnot. They asked me to open it up for Collin Rick live. Yeah. I was going to put... I mean it's a beautiful goal. I probably didn't see it. I did not see it. Tavares coming in short side on Luongo. Luongo's low glove side butterfly save off the pad. And then he just takes the puck around. And Luongo's still literally on the southern end and just does a wrap around like NHL 94. Just right in the net. And then back into the glass and everyone swarms him or whatever. And the glass is going crazy. I was so happy. And so the last thing about that game is that he scored 53 seconds to go in regulation to tie it. He's such an amazing... Five goals and four assists in that series. He's a hashtag Collin was right. Because when they picked him up he started saying he was going",
      "start": 87.6
    },
    {
      "text": "to go in regulation to tie it. He's such an amazing... Five goals and four assists in that series. He's a hashtag Collin was right. Because when they picked him up he started saying he was going to be a big deal. Oh my God. I mean he's arguably the greatest player in the NHL and certainly the MVP of that team. The fact that he didn't win that last year I thought was a huge insult. But because that's not who the best player is necessarily. It's who is the most important player to their team. And I just feel like obviously he is. He just put that team on their show. The thing about the thing about that series not that this is a hockey podcast is that the Panthers were a better team almost the entire time. Which is that we got this amazing goaltender from Thomas Grice who's our backup goalie. And he was just absolutely insane. And now they're using terms like the Grice is right and Jesus Grice. Oh good. They're on it. I'm glad. But I did a little thing on the Kinda Funny Twitter",
      "start": 127.64
    },
    {
      "text": "goalie. And he was just absolutely insane. And now they're using terms like the Grice is right and Jesus Grice. Oh good. They're on it. I'm glad. But I did a little thing on the Kinda Funny Twitter account today. I don't know if you saw where Collin and Greg lives is going to be. But did you see it? No. It's a pretty good one. I'm going to show it to you. Lay it on me. Just to celebrate and maybe incognito maybe not so incognito way. I'm sure it was not so incognito. Let's see here. Did you capitalize L.I.? Did you put believe in there? No I didn't do that. But I thought this was a funny little. There was no color. I was going to mean it's timed almost. Is that was at the end when they won? No that was when they won the game five. So they went up three games to two. Everybody went to twitter.com slash kind of pretty good one. Watch it there. A little reaction gift. Collin likes gifts. He's good at them. Collin you had to listen to the game because you're on a flight back from",
      "start": 162.2
    },
    {
      "text": "to twitter.com slash kind of pretty good one. Watch it there. A little reaction gift. Collin likes gifts. He's good at them. Collin you had to listen to the game because you're on a flight back from PAX East. Yeah. Apology writes in to kindafunny.com/psu. Just like you can. You gave the class. This is not planned again. We would never plan this show. Apology writes what was your favorite thing about PAX East? XOXO apology. P.S. If I got to meet up with you guys there I hope it was nice. He wrote it ahead of time. He did meet up with us. He gave us gifts. My gift was a little Kinda Funny locket. Nice. But his original profile pic that I hated him where it's just the mouth guy. Never liked him on the other side. It was the little Kinda Funny logo. What was your favorite part of PAX East? I don't know. I didn't really see any games. So I mean I know none of us. I thought it was just the kind of unique nature of you know a lot of people are you know not a lot of",
      "start": 209.12
    },
    {
      "text": "part of PAX East? I don't know. I didn't really see any games. So I mean I know none of us. I thought it was just the kind of unique nature of you know a lot of people are you know not a lot of people. Some people are kind of wary or mad about the Rooster Teeth collaboration that we're doing in this. This particular show to me showed why it matters and why it's good why it's important and why it resonates with our fans because you know they organized the series of signings for us and stage shows at their booth. As you know at PAX East. I just thought it was kind of like a nice synthesis of like all of their brands. We're not one of their brands per se but the Let's Play kind of brands. It was nice seeing our logo on the floor. So we were selling our merchant. Apparently our merchant sold very well. So you know I was I was I mean that was kind of the takeaway for me was it was kind of cool. I mean the other takeaway to be perfectly honest and I was talking to you guys",
      "start": 242.88
    },
    {
      "text": "sold very well. So you know I was I was I mean that was kind of the takeaway for me was it was kind of cool. I mean the other takeaway to be perfectly honest and I was talking to you guys about this is that I just don't know how many more of these shows I'm gonna actually go to like this really might be the last one for me. So because it's just I also felt that we're crescendoing in such a way and such a great way. That's such an honor to us as we get bigger I guess that I just am not comfortable with it anymore. Like I just I was getting stopped constantly and all that kind of stuff. And I'm totally honored by that. And it's just it's it's kind of it's not embarrassing. It's just like very anxious anxious anxious. Yeah. There's a whole game over. You should talk about. Yeah exactly. So I just so to me it's like I interact with me. I hope everyone soaked it up because I don't think I'm going to any of these anymore. I think it would be funny. I was talking to someone about",
      "start": 279.48
    },
    {
      "text": "So I just so to me it's like I interact with me. I hope everyone soaked it up because I don't think I'm going to any of these anymore. I think it would be funny. I was talking to someone about where I was like it would be funny if it became because I'm already elusive anyway. I like people. I never met you but I met the other three guys. I'm like that's you know it's very nice to meet you obviously. But it would be funny to even rash that up now to the point where like you can't see me unless you got a Kinda Funny live. Like that's literally the only time you're ever going to see me outside of you know outside of these shows where because it's just it's just too much for me. But I know I think you probably feel the same the opposite way because you know you would enjoy it a little bit more. I mean my favorite thing about Pakistan meeting everybody. Thank you all for coming out to the panels to every one of the ones I hosted at the Kinda Funny podcast the Kinda Funny",
      "start": 316.04
    },
    {
      "text": "bit more. I mean my favorite thing about Pakistan meeting everybody. Thank you all for coming out to the panels to every one of the ones I hosted at the Kinda Funny podcast the Kinda Funny party with Hitman folks to coming to the research he signs to come into the rich to booth for the pop up panels. What I love and the reason I go you know Khan always make fun of it and twisted a bit of like I eat up the limelight. What I eat up is getting to see you guys and meet you guys and talk to you guys and let you know that obviously the best friend stuff is in bullshit and getting to talk to you about what you've gotten me through as well as what we've gotten you through. So it's always nice to go out and meet you guys and be a part of that. So that's what I loved about that. Yeah it was apology again. Obviously it was a cool show. Yeah. We met a lot of great you know hundreds of fans that were very friendly very nice people. Yeah. I bailed out of the party a little bit early",
      "start": 342.36
    },
    {
      "text": "was apology again. Obviously it was a cool show. Yeah. We met a lot of great you know hundreds of fans that were very friendly very nice people. Yeah. I bailed out of the party a little bit early too but I think I met almost everyone that was in the signing. Anyway I got a few disappointed that I'm you know but I was like I gotta I gotta get out of here. I went up to the balcony to talk to our friend Riley for a while from Square Enix and then and then I kind of got out of there. I ran into our friends of Filthy Casual and I was leaving there like why are you leaving already? And I was like well it's time for me to go. I can't I've met I've hit my quota of meeting people. I have to go. I don't feel comfortable. So yeah but it was it was a fun show. I assume that'll be my last PAX East but I think that you know obviously being back in Boston too Nick was making fun of me. He's like cause I just went to Northeastern three days in a row just to remember and have like",
      "start": 371.32
    },
    {
      "text": "PAX East but I think that you know obviously being back in Boston too Nick was making fun of me. He's like cause I just went to Northeastern three days in a row just to remember and have like some fun times and I bought a bunch of merchant. We've made fun of you because every time you said it you said I wanted to go there to remember what it was like to be happy. So it's like everything you say is scary. Everything you say scares us. I thought it was a funny kind of thing but like a very like Sardana kind of. Sure. But then in two weeks you're going to email and be like I don't understand why everybody calls me the grump and da da da da. It's like well you keep saying you're not happy and you don't want to leave your room. We're worried about you. I don't but but no I think it was a very you know I've lived I lived in Boston for so long that there's a there's a nostalgic touch to that place. Even if I didn't go to Northeastern just seeing familiar places and",
      "start": 402.48
    },
    {
      "text": "think it was a very you know I've lived I lived in Boston for so long that there's a there's a nostalgic touch to that place. Even if I didn't go to Northeastern just seeing familiar places and especially down by Copley and and you know and Boyle sin and and massive and I don't know it's a you know down Newberry street and stuff. So it's it's being there has like some energy for me. I think I felt the same way last year too. I think I felt that way more this year though. And when I went back to Northeastern specifically I was like on Sunday I went back and I really walked around the first time I went I just went to five guys. The second time I like went to the merch store and bought things and I had to convince them that I was really an alumni because I didn't have my alumni card on me. How'd you convince them? Well they were like I used to be a Burger King here. Yeah. I'm like they were well they were they were friendly. They were just these girls are probably like",
      "start": 436.56
    },
    {
      "text": "card on me. How'd you convince them? Well they were like I used to be a Burger King here. Yeah. I'm like they were well they were they were friendly. They were just these girls are probably like 0 years old or and they were just like uh oh you're you went here. And I'm like yeah you know class 007 or whatever. They're like oh okay we can give you a 10% discount but you just have to tell us like who your commencement speaker was. And I'm like I don't know. It was a hell. Would you know that? Well because we had like some famous commencement speakers but the one thing that I remember about the commencement speaker is that like it was he was like buttressed on both sides by like flanked by both sides by like very famous people. And then we had this like it's like Al Gore or something. Yeah. And I remember like I had this guy and he was it was actually like no offense to him. I don't remember his name. It was like a completely garbage commencement speech. Like I",
      "start": 469.92
    },
    {
      "text": "or something. Yeah. And I remember like I had this guy and he was it was actually like no offense to him. I don't remember his name. It was like a completely garbage commencement speech. Like I remember like I remember even my mom who worked there at the time like w and was at the graduation we graduated in Boston garden wherever the Bruins play in the Celtics play they were she was like that was fucking terrible. Like everyone feels like that was awful. You know? And uh mediocre things. Everybody was like the guy I want you to never lose sight of that. He was this guy that like did this very noble thing of like one laptop per child. Apparently it's called like going to Africa and like impoverished countries and trying to like educate them and give them electronics because that will like help them. How many VITA's did he give out? I don't know. I don't know. VITA wasn't out then. Okay. Uh but I'm assuming he's still doing it. So I'm just like I don't know. It's like and",
      "start": 498.88
    },
    {
      "text": "will like help them. How many VITA's did he give out? I don't know. I don't know. VITA wasn't out then. Okay. Uh but I'm assuming he's still doing it. So I'm just like I don't know. It's like and then I explained to them and I'm like I lived in like all of these different places. If that's convincing you and like all right that's good enough. I'm just getting that guy. Good enough. But the third time I went I texted my mom who again worked there and went there. I was just like I don't know if I can ever come back here again. Like this is like too much. Like I was like so emotional in a way because it's changed so much. It's gotten there. It's so much bigger than even when I was there. Not even 10 years ago. It's new buildings and then new dorms and new you know like the only place I was trying to be like where was I going to put Moriarty hall? You know because if I do make mega rich one day I got to dump got to put it down by the dump. I want to build a new history",
      "start": 531.56
    },
    {
      "text": "place I was trying to be like where was I going to put Moriarty hall? You know because if I do make mega rich one day I got to dump got to put it down by the dump. I want to build a new history building. So it was like so it's like a humanities building and some Moriarty hall is what obviously I would call it. Is it like the painting of you when they come in the portrait painting? I'll be you you with a VITA and a harpoon and one of your collared shirts that yellow and black plaid shirt you wear. Yeah something like that. Yeah something like that. But it was good. I bought like a I bought like a cause like when I used to shop there and get books I had no money. I used to drag my mom there and she'd have to get me a fucking my books. But like I bought like four t-shirts a lacrosse shorts like a nice jacket like a banner like all sorts of just ridiculous. I'm like I don't know. Trust me. You've seen my Mizzou apparel selection. I only have one shirt and I had a",
      "start": 560.72
    },
    {
      "text": "a lacrosse shorts like a nice jacket like a banner like all sorts of just ridiculous. I'm like I don't know. Trust me. You've seen my Mizzou apparel selection. I only have one shirt and I had a sweatshirt but I don't know what happened to it. Okay. It's been a good show. It has been. Ladies and gentlemen before we get in to PS I Love You proper. A lot of housekeeping stuff. If you're listening to this the Tuesday it comes out. I remember we posted every Tuesday 9am Pacific time Wednesday from one to 5pm Pacific time is my birthday stream. We'll be playing games over on twitch.tv/kindafunnygames and hanging out with you into play. Interesting question. My original plan Alienation was to stick with me. Our original plan was to play stories because you can vote on it and people can change out of thing. Then I played a little bit of Alienation today before missions. It's awesome. I mean who could have doubted that? It's the Dead Nation gameplay mixed with Diablo.",
      "start": 594.38
    },
    {
      "text": "and people can change out of thing. Then I played a little bit of Alienation today before missions. It's awesome. I mean who could have doubted that? It's the Dead Nation gameplay mixed with Diablo. It's that's what I was. Like loot. Yes loot and levels and you run up and they have this and there's a boss over there and you run and kill them and you just go through and you get your chest and you do all this stuff. Shocking. Well no shocking is the fact that they finally went that way to being a full blown action RPG. You know what I mean? Because that nation had it where I was like all right cool. Now that you've played through you fought all these enemies now at the end how are you going to spend your thing in between levels? But I always felt that was like this you know jilted system right? Where I'm Dead Nation was maybe maybe a little half cocked in that it was it was a good thing. This feels like it was full blown. They know what they're doing is what? It was a great",
      "start": 629.02
    },
    {
      "text": "system right? Where I'm Dead Nation was maybe maybe a little half cocked in that it was it was a good thing. This feels like it was full blown. They know what they're doing is what? It was a great thing. As far as I understand IGN was severely underrated. As I understand I think when they had a 0 point scale and a seven five pretty much does sum up where it should have been in that time. You know what I mean? For what it was. That was the one score where like it didn't work when it came up. But no the fact that yeah you haven't played you've played it obviously at events and stuff. Yeah. I've just downloaded on my console now. I don't know how much how am I even going to have to play it this week? Cause a lot of people have been texting me like what are you tweeting me? Don't text me. Straight up. Don't text me. All the kids are just straight up texting. Please don't text me. I don't know. I don't know. Maybe you're vulnerable. We'll give you a cell phone number. Feel free",
      "start": 663.96
    },
    {
      "text": "me. Straight up. Don't text me. All the kids are just straight up texting. Please don't text me. I don't know. I don't know. Maybe you're vulnerable. We'll give you a cell phone number. Feel free to text me at your convenience. Zero. Nope. I don't know. Close. I would have no idea how to write anyways. You're downloading. You're not gonna have much time to play this week. I mean I'm downloading. Hopefully maybe I played a little bit tonight but people have been asking me like what do you think of it? What do you think of it? I'm like I just we got the codes late last week. We were already in Boston. I wish I knew I was going to get the code because the code was supposed to come earlier that week. I would have brought my PS4. I told you to. I don't know if the TVs actually would have been it would have been difficult because there were like in these little I don't know if yours was but it was like in this little alcove in the in the there was like nowhere to put even put the",
      "start": 695.08
    },
    {
      "text": "been it would have been difficult because there were like in these little I don't know if yours was but it was like in this little alcove in the in the there was like nowhere to put even put the PS4. You'd have had to have these like really long cords and show up. You would have done ironing board. I had my ironing board underneath my TV. You could have had a PS4 there. No problem. That's a good point. No. Played a bunch of it today. Jumped into a Giant Bomb game for a little bit. That was seamless. It worked. People jumped into my game. I went and turned to private and all this stuff but I'm digging it. Chose to be the guy who zips around. Why can't I remember the last character class? It's not the healer not the tank. The other one saboteur. I'm saboteur. So I'm I'm bending light. I haven't put the points in invisibility yet. I'm putting my points into more health being better with my health. Sword attack slash attack. Does it strike you as a game that must be played with",
      "start": 724.52
    },
    {
      "text": "I haven't put the points in invisibility yet. I'm putting my points into more health being better with my health. Sword attack slash attack. Does it strike you as a game that must be played with others? Not you know not yet. Not at all. When you go in you decide how hard the mission is going to be. I had been doing a middle of the road just normal or whatever. And then the last one I jumped into the hardest one what how hardcore I think it's what's called. I don't know more about it than I do. Well I was looking at the trophies and I was confused because there is a hardcore mode for sure but whatever the primary three levels hardest one is I jumped into and they were harder. And then some other guy jumped into my game and we were running through having an easier time with it. But I'm four missions in there's 0 story missions. I'm four missions into the story missions. Does it have the atmosphere that Dead Nation had? Cause I think that that was one of the things that that",
      "start": 755.22
    },
    {
      "text": "But I'm four missions in there's 0 story missions. I'm four missions into the story missions. Does it have the atmosphere that Dead Nation had? Cause I think that that was one of the things that Dead Nation actually nailed was like it was really ambient. That game was actually like super ambient. I thought yeah. Um and dark and well I think it surprised that's the thing is in the way I don't it looks beautiful. There's one part where you put C4 in the very beginning on one of the doors and it blows up and like the smoke effect. I was like damn that looks fucking awesome. But I'm on a snow planet running around that you know what I mean? Like it's not playing with light and shadow the way it was at least right now is it did with Dead Nation which was a genuinely fucking creepy ass game. Is it it's procedural not in the maps but in the missions. Right. There's some procedural thing in terms of enemies. There's something procedural on it. Like I think the maps are all static",
      "start": 789.22
    },
    {
      "text": "game. Is it it's procedural not in the maps but in the missions. Right. There's some procedural thing in terms of enemies. There's something procedural on it. Like I think the maps are all static but or I could get it vice versa or missions are there. I'm sorry. The maps for sure are static but there's like Hell Divers. I joined Giant Bomb at the end of their mission and I didn't notice anything and it was a mission I already done. But it's a difference in anything so static completely. I don't know. That's what I'm telling you off of that one could have sworn. Maybe I'm wrong. Well I mean you're saying so procedural in terms of where enemy place. Yeah like any place in our missions or someone with our side quests or some like option that could be different. Yeah this is the main mission. We were playing was the one where you like one of the first one. I might actually been mission one because I was trying to do mission two but I jumped on them. I'm excited to play it. I",
      "start": 817.02
    },
    {
      "text": "mission. We were playing was the one where you like one of the first one. I might actually been mission one because I was trying to do mission two but I jumped on them. I'm excited to play it. I think that you know I haven't played. I mean it's a Housemarque thing. You're obviously gonna want to buy and support and Matterfall's still coming, which I like the thing is is that you know they told me, you know our friend Michael over there told me like Matterfall's trailer tells you everything you need to know about what the game is, which I think is like so tantalizing and I think it's going to be a similar Resogun type game. Like a cylinder. Yeah because it looks like how you're flying right, but like you're running or doing something else and things are like coming from the top or whatever. I can't ****. I like they invite they. I like an open invitation to go there. I think literally they told me last time I saw them. You can use our office as your office for as long as you want. I",
      "start": 853.62
    },
    {
      "text": "I can't ****. I like they invite they. I like an open invitation to go there. I think literally they told me last time I saw them. You can use our office as your office for as long as you want. I come and hang out. Sure, and it'll be cool to go there and see what they're working on. We're still very talented. They're awesome. They're amazing studio. The nation's latest one. I think I like. I like a lot about it when I jumped in and it was picking my glass, changing my colors, going out and now playing. You know it's it's hitting on all the things you know my problem with Helldivers was that it ate my **** save all the time. That **** **** **** but it's the same idea where you know you play. I think the I mean it plays better. No offense to our divers. Yeah, you know I mean we enjoyed that game quite a bit more fun to play. So far I like the weapons better so far. I like the way I'm upgrading. I like the pace. I'm upgrading and that was the one thing about Helldivers even in the",
      "start": 889.5
    },
    {
      "text": "that game quite a bit more fun to play. So far I like the weapons better so far. I like the way I'm upgrading. I like the pace. I'm upgrading and that was the one thing about Helldivers even in the beginning. I felt it felt like you were grinding. You were grinding to that next step. Where is this one? I'm you know level four five right now. You know jumping through going doing this points are coming pretty easy right now. Obviously I'll hit that you know curve. I'm looking forward to it. I think that I'll wait till next week to reaffirm the declaration. Once I've played more of the game or any of the game in the retail settings, like we played it quite a bit before it came out, but. They I don't understand why the people don't understand what these guys can do yet. Like it still seems like people don't understand that people still act like their secret. Yeah, like or that they're just not like bonafide. One of the best developers in the world because they are like they absolutely",
      "start": 922.42
    },
    {
      "text": "like people don't understand that people still act like their secret. Yeah, like or that they're just not like bonafide. One of the best developers in the world because they are like they absolutely positively are one of the great developers in the world and on a gameplay level. It seems like an Alienation seems to nail it again. It's like what their games do is that they have a loop. Yeah. And that's like such an important aspect of the game. There seems to be no waste in their games in terms of like what you're going to do. I think Outland's the only difference because Outland is very like it's not linear actually, but there is no upgrading per se. There's like collectibles, but yeah, but with with Stardust and Resogun and and Dead Nation and now with this and all the Stardust I'm talking about, it's it's. There's just a loop like they just understand how to keep you hooked like these games are truly addictive and I don't. I think that's the secret sauce in their games that people",
      "start": 960.02
    },
    {
      "text": "about, it's it's. There's just a loop like they just understand how to keep you hooked like these games are truly addictive and I don't. I think that's the secret sauce in their games that people like there are some games where you're like I just want to get to the next part or you want to get through this to see what you want to see, but there's it seems like in all their games like I like doing it all exactly and I and I just don't know that there's a I hope Alienation is the same way I can't. I can't imagine it's not going to be the same way. Yeah, no, I mean Alienation. It definitely has its hook in me already. That was the big thing. You know, I mean as soon as we had played it like I always say Nick and I played it long, long time ago right into a point where when they came through was it wasn't Michael that came through for GDC this year. Yeah, right. And then he pulled me aside and was like, hey, yeah, can you see you know, watch the demo because we're still sad. It didn't run",
      "start": 999.08
    },
    {
      "text": "it wasn't Michael that came through for GDC this year. Yeah, right. And then he pulled me aside and was like, hey, yeah, can you see you know, watch the demo because we're still sad. It didn't run the way it should have run when you guys played it originally because it was way, you know, it was way not ready for prime time, but they wanted to show it and where it was going and I was like, no, no, I'm like media blackout. I trust you guys. I mean, and so to jump in and have characters running at me and their levels above them and you're blowing them away and your progress is filling. I was like, oh, okay, like I can totally see where this is going to eat away hours and hours of my life. One problem. I looked at that trophy list and I'm like, who's pretty hard. I mean, yeah, exactly. That's the thing. I'm like Nations was hard to remember. But Resogun was pretty easy. Some people thought it was hard, but I played them that game. No problem. It was I think it's just a matter of",
      "start": 1029.9
    },
    {
      "text": "That's the thing. I'm like Nations was hard to remember. But Resogun was pretty easy. Some people thought it was hard, but I played them that game. No problem. It was I think it's just a matter of dedication. Stardust Ultras was really hard, but that's not technically a Housemarque game. It like they produced it, but they didn't make that game. I don't mind a hard trophy list. Dead Nation was fucking hard. So for this to be hard was is no surprise to me. I assume you have to use all the classes and level them all up. Exactly. I'll get them all to level 30, right. And then go through and do all that stuff. So we'll see what happens. Did you have the pleasure of playing anything else this past week? Well, hold on one second. Sorry. So we were in the thing there, birthday stream on Wednesday. I'm sorry. Yeah. I was originally thinking I would do Stories. Now I'm thinking maybe I do Alienation. You do Alienation. I'll play with you. Ooh, happy birthday to me. That way I don't have to",
      "start": 1066.06
    },
    {
      "text": "I'm sorry. Yeah. I was originally thinking I would do Stories. Now I'm thinking maybe I do Alienation. You do Alienation. I'll play with you. Ooh, happy birthday to me. That way I don't have to be in the studio and I can just be in my bedroom and we can be playing again. And you still feel like you don't work. I appreciate that. Okay. We might have to play with like kids and stuff. Your zygers and stuff. Or we could just be you and me. It's just me, me, you got to be a headset then. Why? We can just yell through the well then they can't. We'll drill a little hole in the wall. We'll figure it out. My closet's right there. We'll get the tin cans. We'll have tin cans set up. What? What? Oh, what? The last time we did, you and I did voice chat was this Ghostbusters game. Don't forget. Which is a really long time ago. Like probably five years ago. Yeah that was long time ago. But I think my pulse headset does that. It works. You don't have to have like a connection. Well, I mean you",
      "start": 1101.82
    },
    {
      "text": "is a really long time ago. Like probably five years ago. Yeah that was long time ago. But I think my pulse headset does that. It works. You don't have to have like a connection. Well, I mean you don't have to have like like where's the microphone on it? Oh yeah, the pulse headset has built in. It's like in the thing. Okay. Sony knew what they were doing with that. Shuhei Yoshida designed that himself. Wednesday, one to five Pacific time, twitch.tv/kindafunnygames will be in the birthday stream. Then Friday, a giveaway stream. We do this thing where we give things away. If you're in the twitch chat or a subscriber over on patrion.com/kindafunny at $1 and above, I do believe we'll do that from 1 30 to one 30 on twitch.tv/kindafunnygames. However, in the middle of that at 1pm, Colin starts his AMA where you can go ask on anything over and kindafunny.com/AMA that goes for an hour. You'll be able to post your questions starting a day earlier. And",
      "start": 1135.42
    },
    {
      "text": "of that at 1pm, Colin starts his AMA where you can go ask on anything over and kindafunny.com/AMA that goes for an hour. You'll be able to post your questions starting a day earlier. And then of course, Kinda Funny Live is coming up May 8th and 9th. kindafunny.com/tickets. That's all the pimping I have for the links because if you didn't know, as you know, I'm in this is PS I Love You XOXO it is kindafunny.com's PlayStation podcast. It is the number one PlayStation podcast on the internet and it posts every Tuesday at 9am Pacific time, rain or shine. And actually here's something I want to talk to you about. When is the embargoed for Severed? Is it 6am? It might be 6am. Whatever it is. We're I'm done. I'm over it now. We're talking. No, no, no, no, no, no, no. The topic of the show is Severed. We're reviewing Severed. We're talking about Severed. I'm going to put it up and I was thinking maybe I put it up with the review embargo for Severed. Oh yeah, no",
      "start": 1167.58
    },
    {
      "text": "The topic of the show is Severed. We're reviewing Severed. We're talking about Severed. I'm going to put it up and I was thinking maybe I put it up with the review embargo for Severed. Oh yeah, no, I think it's like 6am. So tomorrow, but you'll get one early when this goes live. Surprise for you. Sorry Alex and our friends at Drinkbox. We're talking about the game now. They know it's over now. They know. And they've been cool too because I had worked at a deal with them to talk about it on the Gamescast, but then we dropped that topic so we never had to work at worry about it. Oh, they made a deal with you, but they wouldn't make a deal with me. Yeah. Surprising how that works. People really like Greg Miller. Some bullshit. South by Southwest. Most of them. Twice. Let's begin the show with what is and forever will be Roper's Report. Time for some singular items on the list, but we never talked about the games we're playing. Don't we do that before the Roper's Report? We do whatever",
      "start": 1210.96
    },
    {
      "text": "what is and forever will be Roper's Report. Time for some singular items on the list, but we never talked about the games we're playing. Don't we do that before the Roper's Report? We do whatever you want. All right, well, let's do it after. We want to talk about the Axiom Verge. Now this is a weird one because Porty left the room and then Alola immediately came in the room. Are they the same dog in disguise? Who will never know? I hope so. What did you? You did brief me with that, but we were in the middle of pimping all the links and stuff on the way to PAX and on the way to bat back to PAX. All I played was that they're actually in version. You like it? It's awesome. Yeah. And I'm I was concerned because I respect it. I liked it. What I saw visually, I know you liked it. I know Nick liked it. Well, Nick loved it. You you were doing the same thing. I was you're waiting for the Vita. Well, I played it for like almost 10 hours on PS4, but I wanted to get the real",
      "start": 1241.76
    },
    {
      "text": "I know Nick liked it. Well, Nick loved it. You you were doing the same thing. I was you're waiting for the Vita. Well, I played it for like almost 10 hours on PS4, but I wanted to get the real experience. Yeah. I just was like, there's other things to play. This is not made for the console. It's made for a handle. Exactly. And the thing is that, you know, for me, like Super Metroid had been such a turnoff to me. You know, I remember when I when we did it, which was weird. I just didn't like it. I felt like I was wasting time in it and I didn't know where to go. And I was like, I'm not enjoying myself. Samus is very big as well. And I wish it's bothersome to me. But anyway, sure. I don't know that I'm sure we'll say that's one of mine just so we can put it in the three four by three perspective in 16 bit games. Sprites got really big. That's just the same thing. The Mega Man X anyway. God loved it. Had a great time with it. It's it's the proper for me pacing and difficulty if",
      "start": 1283.72
    },
    {
      "text": "perspective in 16 bit games. Sprites got really big. That's just the same thing. The Mega Man X anyway. God loved it. Had a great time with it. It's it's the proper for me pacing and difficulty if that makes sense. You know what I mean? I'm not sure it is tough. Yeah, yeah, exactly. No that's the thing. I feel like in a way it's punishing, you know what I mean? This is what we talk about when we talk about classic retro games and putting in quotes here because I'm not throwing all the 16 bit air and I'm not talking on all the eight bit air, but plenty of times you'll talk about how we've set up for the show where you're like, that was the pinnacle. That was the best time for gaming, right? And I'm always like, if that's what gaming was, I don't know if I would have stuck with it because they aged with me into where I wanted him to go. And my concern with this is that it was going to be such a throwback that I wouldn't enjoy it. I feel like it paced really well. I know what even",
      "start": 1313.68
    },
    {
      "text": "they aged with me into where I wanted him to go. And my concern with this is that it was going to be such a throwback that I wouldn't enjoy it. I feel like it paced really well. I know what even though there's all those times of like I have unlocked this new thing and it's like where the fuck do I go? It doesn't let me get far enough off track, right? Like there's you know the one where I finally got the on the way back spoilers not really the like souped up lab coat, right? Where I can just double tap in any direction. And I had been running into walls and seeing that I couldn't like there was like the step up that I needed to get somehow. So I was like ran into one wall ran to the wall the other way. Like all right I have to I have to complete what's ever in this area because I was trying to do the thing where Ooh I got a new power. I'm going to double all the way back and try to find it right. And use it in every other situation. But when the game wouldn't let me",
      "start": 1347.28
    },
    {
      "text": "I was trying to do the thing where Ooh I got a new power. I'm going to double all the way back and try to find it right. And use it in every other situation. But when the game wouldn't let me progress past certain parts to get back to older shit, I was like, Oh, okay, the real thing I need to do is in this room somewhere. This area this map. Yeah. It's I mean to me it's funny you say that because to me the game is completely old. So like that that's that's one of the things that I that gives me a lot of heart because maybe you do have more of a palette for that than you think. Sure. It just needs the games just need to be well made which is why you should play the Castlevania games and all those kinds of things. Now again I've played Symphony of the Night. I like Symphony of the Night. I'm never talking to you in Symphony of the Night. But even the GBA and DS games which I think are phenomenal and and games of that ilk I think even though a lot of people ask like",
      "start": 1380.0
    },
    {
      "text": "of the Night. I'm never talking to you in Symphony of the Night. But even the GBA and DS games which I think are phenomenal and and games of that ilk I think even though a lot of people ask like what's the most recent game? Well Shadow Complex is a good example. What's the most recent game that really nailed that? And I'm like I think it's I think it's that Capcom game not Shinobi. Why is it a Strider? Oh yeah. Which I thought was fucking awesome. It was easy which was a disappointment. Like it's the same problem I had with Shovel Knight but even worse where it was like this is way too fucking easy. And Shovel Knight wasn't way too fucking easy. It was just too easy. Um but like it didn't match the aesthetic and like the design didn't match the difficulty but it was like it kind of nailed what those games were all about which is like backtracking and finding power ups and feeling more powerful and like running into things that were more difficult and more difficult",
      "start": 1412.6
    },
    {
      "text": "it kind of nailed what those games were all about which is like backtracking and finding power ups and feeling more powerful and like running into things that were more difficult and more difficult more difficult. The thing that really impresses me about Axiom Verge and kind of that reinvigorated my love of the game when I was playing it on VX. I played it maybe for five hours. I was messing with other stuff which we'll talk about in a minute but um is this was all done by one person like all of it. And that's like well it's not one of those things where some games are designed or programmed by one person. Remember that's not uncommon especially back in the day but he did everything. So it's not like I did everything but we this guy did the music or I did everything but this guy did the pixel art. Like he did it all. And uh so Tom Happ. So it's it's a really exceptional kind of game. And I was talking to him and and uh you know and you'll get more Axiom Verge you",
      "start": 1447.56
    },
    {
      "text": "guy did the pixel art. Like he did it all. And uh so Tom Happ. So it's it's a really exceptional kind of game. And I was talking to him and and uh you know and you'll get more Axiom Verge you know it's it's take them another decade. Yeah. Like but I'm I'm so excited to hear that you know the game resonated with people cause it really is. It is a masterclass in a way much like Symphony of the Night is. I mean it's not Symphony of the Night but much much not even close. Nothing's like even going to touch that game but I don't imagine but of the Metroidvania non-linear uh there's something special about that. That's like maybe like my favorite kind of game when he really comes down to it. You should play the original Metroid and see what you think of it. Like download on your 3DS and see what you think of it. No I did that a long time ago. Yeah. I was playing it on the train. I remember Rock of Orthodia. That's a fucking hard game. Yeah. That game's fucking obtuse.",
      "start": 1476.44
    },
    {
      "text": "your 3DS and see what you think of it. No I did that a long time ago. Yeah. I was playing it on the train. I remember Rock of Orthodia. That's a fucking hard game. Yeah. That game's fucking obtuse. But see like what I'm talking about with old school games that like annoy me right is when you're just it feels like the enemies are just kicking your fucking teeth in. You know what I mean? Like what the fuck am I supposed to do and dah dah dah dah. And like for Axiom Verge there was a couple of parts where that started to happen but then it was that I felt like I had the real estate on screen. Maybe this is back to what you're talking about with the character size the real estate on screen right? To figure out how to best them. You know what I mean? Like the one for me was spoilers. Not really. It's another this is like crazy but when you go in and you're kind of having that like fever dream and it starts wobbling and you're talking to the voice and you don't know what's real",
      "start": 1511.84
    },
    {
      "text": "Not really. It's another this is like crazy but when you go in and you're kind of having that like fever dream and it starts wobbling and you're talking to the voice and you don't know what's real or whatever and they introduce those flying enemies that are like machines that have the two little guns that track you back and forth or whatever. Like I was there was a good set of like 15 0 minutes of the same section where I was just trying to get to the end to get to wherever the save point was going to be or whatever going to happen next. And those things were beating the fuck out of me and I was getting frustrated frustrated frustrated until I finally you know like kept experimenting kept figuring out what gun works better kept on this. Finally like you realize that like there's all these little shelves there like these little two pixel or not pixel but two block like shelves in the middle of the room that you can use for cover. Right. And then it's like Oh if I",
      "start": 1540.38
    },
    {
      "text": "there's all these little shelves there like these little two pixel or not pixel but two block like shelves in the middle of the room that you can use for cover. Right. And then it's like Oh if I strafe is it the game did the right thing of I ran my head into a wall but I had already played so much that I already knew this solution would be there and then it revealed itself to me in the in the you know what I mean? So that then when you come back outside of the fever dream and those enemies are still there but the blocks aren't I know now to strafe left and right get in front of them stop shoot up run back and forth stuff like that. Yeah but it's definitely I mean it definitely nails design. I think that you know there's a lot of collectibles and guns and it's the it you know it's your point about Super Metroid. Like that is one of the problems with Super Metroid is that the game the the the the sprites are too big. There isn't a lot of room to maneuver. It is",
      "start": 1575.12
    },
    {
      "text": "you know it's your point about Super Metroid. Like that is one of the problems with Super Metroid is that the game the the the the sprites are too big. There isn't a lot of room to maneuver. It is a huge problem. It's the same problem. Mega Man Seven. That was a big problem. People had in that game was there's just not enough room because Mega Man is so much bigger and Samus and and and Super Metroid is so much bigger and like people really look at Super Metroid is like the the masterclass in that kind of game. And it's not like I I just simply the night is better than every there would be no sympathy than I probably without Super Metroid but it is better than Super Metroid in every respect like literally every respect. I like how if there was no Dead Space one there'd be no Dead Space. That's the superior. Yeah sure. So there the one thing I'll say is that there are performance issues on the Vita and I don't think that you I don't think that people are not are not",
      "start": 1604.84
    },
    {
      "text": "dead space. That's the superior. Yeah sure. So there the one thing I'll say is that there are performance issues on the Vita and I don't think that you I don't think that people are not are not necessarily going to notice them unless they played the PS4 version but there are I mean it's they're stuttering. The loads are longer and there's I mean there are issues. The deeper I play into it the more I do have the thing where I like jump in like the screen will freeze for a second. And I'm like you'd notice that. But like you you when we got off the plane I was like I'm having so much fun with this game. You're like yeah but the loads right? And I was like no they don't seem bad to me at all. But you're like no when I go through two months PS4 it's instantaneous. And here it is like black screen for a little bit. Right. Pops in. So I mean there's those little things you might not notice but it is listen it's a fantastic game. Go buy it on Vita go",
      "start": 1637.16
    },
    {
      "text": "And here it is like black screen for a little bit. Right. Pops in. So I mean there's those little things you might not notice but it is listen it's a fantastic game. Go buy it on Vita go support go support Tom Happ. And our friend Dan Edelman who did PR and marketing for the game the one two punch. Tom deserves your support. He's a great man. He's a humble man. You know he's such a nice guy because when I saw him at PAX East he's like one of the only people I saw I like went and sought him out. He gave me a hug and he was selling t-shirts and I was like I want it. Can I get a shirt? And he's like he tried to give it to me. I'm like I just I'm like can I just buy your shirt? And I bought it from him and exact same thing happened to me. I'm like no no no no no. You made a good game. We buy the goddamn show. So it's like he's just a really friendly like I knew Tom three years ago or so and maybe more than that when he was still working on Axiom Verge when I was",
      "start": 1670.4
    },
    {
      "text": "a good game. We buy the goddamn show. So it's like he's just a really friendly like I knew Tom three years ago or so and maybe more than that when he was still working on Axiom Verge when I was like really like really one of the first people not the first person to really like want to write about it and sought it out and talk to him. I think this might even before before Dan was even Dan might've still been in Nintendo. I don't know. I think and Tom was shopping the game around or some you know something was happening and I'm like this game's great. And I was really impressed by Tom about his humility and his down to earth nature. And he is exactly the same way. This is a man who has made a lot of money now on this game. He was like totally fine and set like and he's the same fucking dude you know acts the same dresses the same talks the same treats you exactly the same. And he could be one of these guys that has you know his head so far up his ass like some game",
      "start": 1704.82
    },
    {
      "text": "fucking dude you know acts the same dresses the same talks the same treats you exactly the same. And he could be one of these guys that has you know his head so far up his ass like some game developers that make it big and he and his games better than a lot of those guys' games. And he's not that way. And so I respect that. It's worth noting that our friend Dan Adelman who did you know we also saw a very friendly guy who's worked on he's a total dick. He's the opposite. The yin and yang. Yeah. So he used to work in Nintendo. He's like an indie game evangelist but now he kind of just picks and chooses his game. And he was on our GDC stream. He's representing Chasm as well. Chasm it's fucking awesome. And we're begging them to do a Vita port. And I really do think that's going to happen. So if you want a Vita port make sure to let them know let Dan and the Chasm guys know. And I think a lot of the a lot of or some of whether it's going to happen or not is how Axiom",
      "start": 1737.58
    },
    {
      "text": "to happen. So if you want a Vita port make sure to let them know let Dan and the Chasm guys know. And I think a lot of the a lot of or some of whether it's going to happen or not is how Axiom Verge does on Vita. So definitely send them those numbers. It's like we plan the show sometimes. Nathan Shoket wrote in to kindafunny.com/psq to get his question right in the air. Just like you can. It says hi best friends. I love the Vita and support it the best I can when games come out that I'm excited for. But I was recently thinking about Cross Buy games. I bought Volume, Bastion, and Axiom Verge when they came to PS4 and was excited to learn about the Cross Buy nature of the games. However with the recent talk from you guys parentheses especially our boy Colin M. Concerning supporting Vita by purchasing games I wondered if it hurts Vita when I purchase Cross Buy games as soon as they release. In the cases of Volume, Bastion, and Axiom Verge, I'm unable to buy them on Vita",
      "start": 1779.86
    },
    {
      "text": "Vita by purchasing games I wondered if it hurts Vita when I purchase Cross Buy games as soon as they release. In the cases of Volume, Bastion, and Axiom Verge, I'm unable to buy them on Vita since I already bought them with the Vita version release. Am I hurting the Vita by not waiting? Thanks for all you do. Much love Nathan Shoket. Shout out to Nathan for spelling his last name phonetically. So I nail it. Mr. Shoket. I was going to say I was very impressed that you knew how to say that. You know I wouldn't know how to do that. So this is what we talked about with Shadow or Shovel Knight a week or two ago which is that the numbers from Yacht Club games with the 1 million sold only 4% of them were Vita games 10% of them were PS4 games 1% of them are PS3 games but they're all Cross Buy. So I think that that's the initial way in. In other words through the PSN so you're buying it on PS4 for PS4 we can play it on these other consoles. So I'm not sure that you're hurting them.",
      "start": 1818.9
    },
    {
      "text": "Buy. So I think that that's the initial way in. In other words through the PSN so you're buying it on PS4 for PS4 we can play it on these other consoles. So I'm not sure that you're hurting them. They probably can see trophy pings and numbers in the back end of who's playing these games. So I think that those numbers are more important. It's where you play the game. This was the big thing when Volume came out and Biffle was talking about it. Biffle's talked a lot about sales for it. Definitely there's a you know you get reinvigorated you see those numbers. But then he did I believe in one of the early tweets talk about downloads of the Vita version. It might not be a financial boom they see but they definitely see how many times it's being downloaded to Vita so they can talk internally. Whether you're PlayStation whether you're an indie dev talking to another indie dev. People do know. So I don't think you have to worry about I want to play this game on Vita I'm going to",
      "start": 1857.66
    },
    {
      "text": "Whether you're PlayStation whether you're an indie dev talking to another indie dev. People do know. So I don't think you have to worry about I want to play this game on Vita I'm going to wait. We do it all the time where we get games and we're like all right cool. This is my Vita version. I'm not going to care about it. In the end it all gets tracked right. Did you play anything else other than Axiom Verge? No. For a second when I was frustrated at one part of Axiom Verge just because I was trying to figure out how to get around it I thought about switching over to Saturday Morning RPG. But I hate running two games at once. Yeah. Saturday Morning RPG is not a game you want to just jump into. Yes. It's a little more involved. So I played a few. I want to talk about first of all on PS4 I played Enter the Gungeon for like five six seven hours. I'm telling you dude that game is the bomb. Now it's a good game. I am disappointed that there's not a more controllable hook in",
      "start": 1892.24
    },
    {
      "text": "on PS4 I played Enter the Gungeon for like five six seven hours. I'm telling you dude that game is the bomb. Now it's a good game. I am disappointed that there's not a more controllable hook in the game in terms of you brought up the point of wanting to be like Rogue Legacy. Exactly. Like a Rogue Legacy. You almost don't care about dying because you have this loot and you can buy things and upgrade. I had a shitty run but at least I got some gold and I'm making progress to getting this unlockable. This is way too for me it's good but it would be great if it was more if it emphasized upgrading more. If there was a curve to it. Because now the best you can do and I'm sure maybe this is what you're jumping to is that you come out with that currency I can't remember the name of that you then go in and you can buy and make this gun spawn more likely than not. It's just like well can I have that gun going in? It's a little weird. It's a great game. The game the controls",
      "start": 1919.98
    },
    {
      "text": "that you then go in and you can buy and make this gun spawn more likely than not. It's just like well can I have that gun going in? It's a little weird. It's a great game. The game the controls are great. I think it's funny. I think that the bullets like the enemies are bullets. It's a funny game. I just think it could be way better. If they would have taken that Rogue Legacy dynamic and put it on there I think it would have been fucking phenomenal. But on Vita I messed around a little bit with Assassin's Creed Chronicles. Garbage. I just want to throw that I played it for literally 10 minutes and I'm like this game sucks. Why does it suck? Tell me why. I haven't played it. I don't understand why control it is so heavy and cumbersome to play. Assassin's Creed games in 3D are fast and you're nimble. You're supposed to be I still think that they don't control well but that's the idea is you're like in this it's like plotting and it's like what the fuck? I like sorry. I",
      "start": 1958.34
    },
    {
      "text": "and you're nimble. You're supposed to be I still think that they don't control well but that's the idea is you're like in this it's like plotting and it's like what the fuck? I like sorry. I like this game is fucking sucks. Like I can't it just 10 minutes in. I'm like that's all I can. Nope. And so that's the end of that. And then I played Flame Over which was free a while ago on VI. I played it before. It's good. It's good. It's hard. And I it's a nice idea. I've never played a game like that before. And the reason for that game is that you are a fireman. You're equipped with water and like foam basically extinguishing things with your extinguisher or with your hose. And you have to go back and like read like you know get more water and get more foam for it or whatever. And you're like rescuing people and more people you rescue. The more your time goes up it's very arcadey but it's really fucking hard. And that game suffers from the same thing too where you could only",
      "start": 2002.06
    },
    {
      "text": "like rescuing people and more people you rescue. The more your time goes up it's very arcadey but it's really fucking hard. And that game suffers from the same thing too where you could only spend the currency you have from the previous game. If you have these upgrade tokens too. So all you leave and it's in pounds because it's a British game. So you like leave with thousands of pounds and but you can't spend it. And I'm like I'm like you're not really forgiving. You're not even like easing me into this at all. That was like my one thing. I'm like this is a design flaw at the center of this game but yeah but there's something about it. I played it for a couple hours. I'm like this is interesting. So I played it like Risk of Rain for five minutes and I'm like this is way too small. It's way too small in the beta. I don't know if it improves later or whatever but I'm like I can't I don't really understand what's happening here. So I have to maybe go and queue up on PS4",
      "start": 2043.26
    },
    {
      "text": "small. It's way too small in the beta. I don't know if it improves later or whatever but I'm like I can't I don't really understand what's happening here. So I have to maybe go and queue up on PS4 because I was talking to Gio Corsi about it. By all accounts the game's fantastic. I just don't know that it was maybe right for Vita but maybe the game zooms in later. I don't know. But when I was playing I'm like I can't see anything. I did the exact same thing. I was the night before we left for Pax East. I was like it's either going to be Risk of Rain or Axiom Verge because we already applied them Severed. So it was like I jumped in did Risk of Rain for us. I like I don't know man. And then did a little bit axiom was like Ooh no actually. So then I played Axiom Verge and I was on the way back. I was just listening to the Islanders games. I didn't play anything but yeah. So good time for games right now. Yeah. A lot of good good good smaller games too. I mean the bigger",
      "start": 2070.38
    },
    {
      "text": "on the way back. I was just listening to the Islanders games. I didn't play anything but yeah. So good time for games right now. Yeah. A lot of good good good smaller games too. I mean the bigger games are coming Homefront's coming soon which I'm super excited about Uncharted coming soon which is we might get Uncharted like very soon. We might have been charged by the time of the next episode posts. I would say I don't have my phone with me or I do the normal check. I'm checking a lot today but yeah I think that yeah. Homefront and Uncharted are the big ones for me. I can't. Where's Homefront what's that date? May 11th. I want to say something like it's even that's even a Tuesday. I could just be making that up. Seven eight nine 10th maybe May 10th. Okay. I think that's the date. Was that head to head with Uncharted? Maybe but that game's golden and I thought it would happen. I don't know if I've heard of it already but I don't. So that's the next one but I'm right",
      "start": 2104.1
    },
    {
      "text": "date. Was that head to head with Uncharted? Maybe but that game's golden and I thought it would happen. I don't know if I've heard of it already but I don't. So that's the next one but I'm right now. I just want to get through Alienation. So that's actually very nice. I don't know anything else. What is your plan with Alienation? You think I want to play it all the way through by myself and see what happens with one class are going to use. I'll probably play this tank. I like playing his tanks. Sure. Like I'll fit like the night being a little bit faster. Yeah. Like I like bleeding as like the night with a lot of offense a lot of defense. Maybe he's a little limited in speed and maybe a little limited in maneuvers but moves. But that's how I almost always got you. Anyway that's it. There are 1 items on the list. A baker's dozen. Number one. What? I still hurt. It hurts. It's weird. I have a chest pain too. I wonder if it's empathy or I wonder if I'm actually having a heart",
      "start": 2139.5
    },
    {
      "text": "it. There are 1 items on the list. A baker's dozen. Number one. What? I still hurt. It hurts. It's weird. I have a chest pain too. I wonder if it's empathy or I wonder if I'm actually having a heart attack. I think it's probably empathy. Dan Reichert somehow hurt both of us. Number one consider this an unsubstantiated rumor for now. I'm sorry but well-known industry insider Shinobi 60 tweeted out that Horizon Zero Dawn is getting delayed to early 2017. So he has yet to confirm the rumor. So take it with a grain of salt for now. Now I'm not sure that I believe this. It's not against Shinobi. Shinobi's right about a lot of things and clearly well connected in the Sony ecosystem but Shuei Yoshida did tell me at GDC that the game was coming out this year. So unless something radically changed it's possible. I mean anything can happen. Neil Druckmann lied to my face and then delayed his game. Yeah Neil Druckmann totally lied to our faces. So it's a matter of I don't know where I",
      "start": 2172.42
    },
    {
      "text": "it's possible. I mean anything can happen. Neil Druckmann lied to my face and then delayed his game. Yeah Neil Druckmann totally lied to our faces. So it's a matter of I don't know where I sit with this. I wouldn't be surprised if either thing was true. That's why I made that prediction at the beginning of the year. However over at kindafunny.com/psq FKNDelays writes in. Hey guys with the recent rumor of Horizon Zero Dawn facing a delay out of 2016 I wanted to ask at what point the levels of delay from Sony stopped being acceptable. Personally rant incoming. I'm not fucking fine with this shit anymore. Yeah yeah yeah. Rather delayed than broken slash bad. I know I know. Even though Drive Club was still broken and the order was still bad despite being delayed. Yay. This has gotten to a point where it's simply just pathetic and nothing else anymore. Can Sony fucking hold one fucking release window they give us this generation without delaying their fucking games? For",
      "start": 2213.98
    },
    {
      "text": "has gotten to a point where it's simply just pathetic and nothing else anymore. Can Sony fucking hold one fucking release window they give us this generation without delaying their fucking games? For God's sakes you are the market leader this gen. How about you use some of that cash to try and avoid these delays preemptively by for instance increasing team size early? I know there's still more involved in this but other companies manage to get at least their most important properties out on time. It's just Sony that seems to have a delay rake or delay rate of almost 100 fucking percent with their retail games. This gen aside from MLB, MLB the show props to Sony San Diego and that is fucking unacceptable. Thanks for taking the time to answer my question. FKNDelays. Um a lot of F bombs in there. Yeah. Means person's honest. The study shows that people that curse more are more honest. Okay. Uh I all right so this is an important caveat here. We don't know if this is true.",
      "start": 2259.02
    },
    {
      "text": "F bombs in there. Yeah. Means person's honest. The study shows that people that curse more are more honest. Okay. Uh I all right so this is an important caveat here. We don't know if this is true. Sure. Sony hasn't said anything but I do think that my instincts tell me that they would have said something if it wasn't true. I know that they don't like to respond to rumors and speculation but why not just say the game's coming? Yeah. Um now Shinobi did tweet out that the game is going to look great on PS4K but then said later that that's not what that's not what the delay was because that could be yeah. I mean there's a whole bunch of like butterfly affection worst timing. But yeah every time there's going to be delay now the first thing people are going to do is wave this Neo flag. I'm telling you some of these games through delays will be because of that. Do you think of Horizon delay? That's the reason. Maybe but you would assume that they would have Gorilla would have",
      "start": 2307.06
    },
    {
      "text": "I'm telling you some of these games through delays will be because of that. Do you think of Horizon delay? That's the reason. Maybe but you would assume that they would have Gorilla would have known a long time ago this was happening since their first party. So I don't necessarily know that that's true but I I agree with what he's saying because it is a little out of control now. Like if this is if this is true so if this is true then this is the third year in a row now that the marquee holiday title has been delayed. It's unbelievable. I don't know how you can't ramp up or or Len production you know resources. If you're if this is going to happen and this is announced and it's going to come out in February instead of November or something like that then you know far off out enough can't you get like some of the other studios or second parties to help with assets or whatever you guys need? I know it's harder than that. Production is production but it's just they missed",
      "start": 2345.42
    },
    {
      "text": "can't you get like some of the other studios or second parties to help with assets or whatever you guys need? I know it's harder than that. Production is production but it's just they missed with the order 1886 which was fine because they should have just missed completely. And that game should have never come out at all. They miss with Uncharted twice and then they missed with their madness with Horizon. Let's not also forget that they missed with Infamous Second Son even though they kind of got away with that that was supposed to be a launch title and Drive Club was supposed to be a launch out that was delayed by a year and then still broken. So there are at least that I can think of five first party actually four first party one second party triple a exclusive game for PS4 that has been delayed outside of its window. All of those games were delayed out of the holidays. And this begs the question what are they going to do this fall? The only the only again if",
      "start": 2382.82
    },
    {
      "text": "four that has been delayed outside of its window. All of those games were delayed out of the holidays. And this begs the question what are they going to do this fall? The only the only again if Horizon's delayed then is it The Last Guardian? I still think The Last Guardian is coming out the summer and I I and is it Dead Don't Ride? Well I don't know about that either. Maybe sure. I mean if that would be the if that that's the silver lining right? If this Sony Bend rumor is true at E3 they come out Dead Don't Ride is the game and they put it out in the fall and they've delayed Horizon. Then they got to get the marketing machine going cause that's the that's the harder thing of a cell. Whereas I think Gorilla the makers of Killzone right? Like there's something behind that and they're making this giant open world beautiful game. Like it is a new IP but you know that developer so well. Whereas I feel we always talk about it. Sony Bend is not there yet. Right. They have",
      "start": 2410.5
    },
    {
      "text": "they're making this giant open world beautiful game. Like it is a new IP but you know that developer so well. Whereas I feel we always talk about it. Sony Bend is not there yet. Right. They have been the people who have been doing the Vita game and doing the PSP game. And then Oh yeah. Remember when they did Syphon Filter and like there's a lineage there and a history there but they're not they're on a they're on a huge you know we love them. You watching this podcast listening to this podcast you love them. You understand that Eric Jensen's over there brick by brick building the most amazing game. I'm not convinced they're doing anything over there but he's just playing solitaire on his computer but I don't know how easy that is to get everyone excited about that. They would go over there. Scott Rody and Shuei would go over there to light a fire under the assets if they could find a Bend Oregon but they don't even know that they're knowing you can't even find the way",
      "start": 2456.66
    },
    {
      "text": "go over there. Scott Rody and Shuei would go over there to light a fire under the assets if they could find a Bend Oregon but they don't even know that they're knowing you can't even find the way that circles the plane just circles. But my my instinct is so what my mind's telling me is a one possibility is that Horizon is delayed. Dead Don't Ride was supposed to come out early next year. They realize that Dead Don't Ride maybe is going to be ready first and they just flip them. And so maybe now at E3 they're like Dead Don't Ride is the big marquee title. They say this is coming out. Horizon is delayed until February. This game's coming out in November so don't worry. You're gonna get big triple a games games been incubating for years. And you know so maybe that's what happened. So again this is all speculative but it would be kind of loath of us not to bring up that that's probably the biggest news of the week. Oh sure. Even though a lot of sites aren't writing about it it's",
      "start": 2490.06
    },
    {
      "text": "this is all speculative but it would be kind of loath of us not to bring up that that's probably the biggest news of the week. Oh sure. Even though a lot of sites aren't writing about it it's certainly making the rounds. So you know take it with a grain of salt. Who the hell knows? They might come out and say like no the game's coming out in October. Chances are they're going to break that news tonight or early tomorrow morning or when you're watching it. Number two this is what I have a problem with but again this is one of people are talking about. So in an interview with Game Informer has passed along by Neil Gaff user generic username friend of Kinda Funny Lauren Landing the mastermind behind the Oddworld games briefly recalled a conversation he had with other friend of Kinda Funny Shuei Yoshida president of worldwide studios in which Landing asked about the PlayStation 5 and what it will look like. And you'll see to answer him quote you mean if end quote.",
      "start": 2529.78
    },
    {
      "text": "of funny Shuei Yoshida president of worldwide studios in which Landing asked about the PlayStation 5 and what it will look like. And you'll see to answer him quote you mean if end quote. So basically the the insinuation behind this is there might not be a PlayStation 5 now with the basically all but confirmed PlayStation 4.5 whatever they're going to call it. The Neo. This is an interesting piece of news but I want to reiterate that I don't know that I believe that there's not going to be a PlayStation 5 and I don't know that I don't believe that this isn't Shuei Yoshida being Shuei Yoshida. He's very PR ready. He's very prepared. As I've said in the past on the Games Cast last week I've broken many people and gotten him to say things they said over and over again. I've never gotten him to say anything. I don't even bother anymore. I think we have a kind of a more friendly relationship with it now anywhere where I just know that there's just certain",
      "start": 2560.04
    },
    {
      "text": "over again. I've never gotten him to say anything. I don't even bother anymore. I think we have a kind of a more friendly relationship with it now anywhere where I just know that there's just certain things I'm not going to broach with him. He's not going to talk about them. Right. And then this could easily be the if being weren't if there's a PlayStation 5 not that not I think the people are reading in if there's a PlayStation 4.5 as in Oh my God this is the end. They they're planning and these are the incremental changes. And I think it's more of the idea of like does the market need another PlayStation 5? We're not we're of course prototyping PlayStation 5. Somebody's working on a PlayStation 5 right now but we're not sitting there pouring efforts into it. What what does the market look like in five years? I also just think that it's it's just when when did this conversation happen? Warren Landing's",
      "start": 2599.12
    },
    {
      "text": "into it. What what does the market look like in five years? I also just think that it's it's just when when did this conversation happen? What was the nature of the conversation? Warren Landings obviously telling the truth but I'm what I'm saying is there's a lot here that's missing and having spoken to Shuei Yoshida you and I more than probably almost anyone in the media side in the industry at this point I just know how he interviews and so I just know that there might be way less here than people think. So I just wanted to throw out there. But again I don't make the news. I just talk about it. Speaking of throwing something out there, RSM eight three two wrote in kindafunny.com/PSQ just like you can. It says Colin Greg is the console generation cycle as we know it coming to an end with Lauren Landing recently commenting that Shuei alluded that there may in fact not be a true PS five. I'm now growing more concerned. This has been a fear creeping in my mind",
      "start": 2631.54
    },
    {
      "text": "coming to an end with Lauren Landing recently commenting that Shuei alluded that there may in fact not be a true PS five. I'm now growing more concerned. This has been a fear creeping in my mind since rumors of an Xbox One point five slash PS four point five slash Neo began to surface. It is seeming more and more likely that consoles could be going the way of the phone with incremental upgrades every couple of years. Is this something we should be prepared for akin to the digital only future thoughts PS I love Portillo but you're Kinda Funny I suppose. I mean is the console generation as we know it coming cycle as we know it coming to an end. Yes a hundred percent that I think that was the big thing. I don't like it but I think that's what's happened last year. Last week, right? You and I were going back and forth about Neo right ever and that was the thing you kept saying is like it's been this way forever and it's not and I kept saying welcome to twenty sixteen and like",
      "start": 2666.12
    },
    {
      "text": "You and I were going back and forth about Neo right ever and that was the thing you kept saying is like it's been this way forever and it's not and I kept saying welcome to twenty sixteen and like this could easily be the not the moment but you understand like the part where it we do change drastically and there's always been incremental changes and things different and like there's going to be this that and the other and add ons what you know what I mean but like this could be the big change right now for us and the fact of it. It'd be fascinating and weird. I don't. It's going to change the way. Yes there's going to be a PlayStation Neo. I think there's going to be an Xbox One point five. There's going to be these different systems that pop up and do it and I don't know what that means for the next big number. I think you're always going to have there's going to have to be names and numbers on them though because otherwise it gets confusing. It'd be awesome if PlayStation made",
      "start": 2710.58
    },
    {
      "text": "for the next big number. I think you're always going to have there's going to have to be names and numbers on them though because otherwise it gets confusing. It'd be awesome if PlayStation made PlayStation but that gets super confusing when you do start having things that don't run on the old PlayStation. Yeah I think that you know we I don't want to get too far into this because we talked about this a lot last. I love you single listen to that. I'm sure you're going to also if you'd love to talk more about PlayStation Neo and PlayStation four point five go to kindafunny.com forums slash forums and look at all the questions because people thought I guess we're going to do a four hour podcast today where we went through everyone's theories and opinions and everything else. I'm just tired of talking about it. I am too. And that's the thing is like we need to we need to improve it needs to go. I feel like the PlayStation four point five Neo conversation outside of this or coming",
      "start": 2743.32
    },
    {
      "text": "tired of talking about it. I am too. And that's the thing is like we need to we need to improve it needs to go. I feel like the PlayStation four point five Neo conversation outside of this or coming at it at a new angle because so many people are asking us questions or making statements on things we've already said. I don't know how many times you can say the same thing different ways. There's even a Games Cast topic about it. I feel like this needs to be put on a shelf similar to all the games you refuse to talk about that. Okay until there's something official like we were asking Verge. We weren't going to talk about until actually Verge came out. It's out. So we're talking about it until number nine until there's real news or even just another even though there's another Giant Bomb expose or something that's fine but I don't want to keep fucking talking about the same story with this. Yeah I agree. I mean but to his question yeah I think that's clearly going to happen. Neo is",
      "start": 2775.72
    },
    {
      "text": "or something that's fine but I don't want to keep fucking talking about the same story with this. Yeah I agree. I mean but to his question yeah I think that's clearly going to happen. Neo is real. I mean I mean I don't understand how anyone can think that this is still a rumor at this point and it seems like Xbox is going to do the same thing. Is it the end of this? Yes. I will just reiterate that not only is it going to complicate things on the development side whether it's minor or major that's obvious. I mean that's not even really up for debate. The thing that I'm interested in is how console gamers deal with this because this brings up a systemic and inherent and almost existential question for console gamers which is do we need to play console games anymore? Why not just get a Steam Machine? Like at this point if the console gaming Trump card was was it's stationary nature. Yeah. Might not be the most powerful thing but it's in a predictable thing and we liked",
      "start": 2805.92
    },
    {
      "text": "get a Steam Machine? Like at this point if the console gaming Trump card was was it's stationary nature. Yeah. Might not be the most powerful thing but it's in a predictable thing and we liked that. That's the way we liked. So that's to his point this is going to happen. Whether it resonates or whether they're shooting themselves in the leg for no reason is what I'm super interested in seeing. But we don't have any more information until we do where there's really no reason to talk about it. We could speculate all day but I will say that the PSI of last week was a conversation between you and I. We added Tim to the conversation on Games Cast which I think was a more substantive conversation and where we were especially more. There's a couple more stories in fact. I was able to just I mean I can't speak for you but I was able to think about it a little bit more too. I mean I drew the same conclusions but so you can just go listen to that. If you want to youtube.com slash",
      "start": 2842.52
    },
    {
      "text": "I mean I can't speak for you but I was able to think about it a little bit more too. I mean I drew the same conclusions but so you can just go listen to that. If you want to youtube.com/kindafunnygames or you can just download that Games Cast before we put this one to bed and put it on the shelf that we have more news Vita guy 3 wrote in kindafunny.com/PSQ with the question as well. Will Sony go ahead with new? Do you think they're looking at this at all with this? Is it possible that this cause we talked a little bit about it. We talked a little bit about it with Xbox right? And how they realize they fucked up and dialed back their systems and change things around. You think there's still the train rolls on? Yeah I don't. I'm not looking too in depth at what people are saying about it apart from what people are saying to me about it specifically. I know there's some big Gaff threads of people on one side of the other. I don't think so. I don't think so.",
      "start": 2875.88
    },
    {
      "text": "people are saying about it apart from what people are saying to me about it specifically. I know there's some big Gaff threads of people on one side of the other. I don't think so. I don't think so. Any really cares about any of that. I don't think Sony makes any of its decisions based on Neo Gaff or the Kinda Funny forms or rather something they care about. They do. But yeah right. But in there every day I mean like calls to shoot. Hey I'll be like well Sean Lane get them on. And they're certainly not making decisions based on what we're saying or what you know otherwise we'd have a pat upon our person X is saying out there. So I think that they're going to go ahead with their move because they're obviously financial ramifications and they also have all the information. We don't have any of the information apart from what's been leaked. So no I don't think they're going to stop doing it. I still think that it's clearly happening. I think that kids are going out as far as I",
      "start": 2907.24
    },
    {
      "text": "have any of the information apart from what's been leaked. So no I don't think they're going to stop doing it. I still think that it's clearly happening. I think that kids are going out as far as I understand. And so from rumors that I've been reading more kind of recent rumors. So yeah it's going to happen for the fallout or lack thereof is the more interesting thing about it. And this is going to be this can be this is going to be a dynamic moment one way or the other but I think it could be a substantial moment. Basically either a very I don't think it can be in the middle. I don't think it's just going to be this thing that happens. I think it's either going to be like a very forward thinking like wow this is actually really a great idea or this can be like what are you thinking? Kind of thing that's aborted you know because I do say that you know to the point I made before about resources people that are saying like this is easy to do that's I guess in like",
      "start": 2942.48
    },
    {
      "text": "thinking? Kind of thing that's aborted you know because I do say that you know to the point I made before about resources people that are saying like this is easy to do that's I guess in like reference to harder things to do in game development but it's not something you don't just flip a strip. It's like really one of the most ignorant things I've ever heard in my life. That's not what you I don't make games. I know that's not true. You know you don't just flip a switch and make the frame rate run better on another console. This is another console that they have to think about. So that argument's stupid but whether it's easy or whether it's hard it's just something that developers have to think about and naturally one more. And that's just one thing you have to think about. But the other thing you have to think about is and what I'm super interested in is just the again the marketing aspect of it. And when inevitably a game comes out that runs like complete shit on PS",
      "start": 2973.52
    },
    {
      "text": "the other thing you have to think about is and what I'm super interested in is just the again the marketing aspect of it. And when inevitably a game comes out that runs like complete shit on PS four you know it's like you know what's going to happen. Sure. And it's gonna be like a big game. And that's something I would be very afraid of. And then the delays that might occur from all those kinds of things in the patching and on. It's just going to be it's it's this could be a problem that can spiral out of controller. This can be a problem that just is worth the effort. So we'll have to see how it all plays out. But I don't have anything else to say about this. I mean this is kind of a tired thing at this point. Number three super giant games the developers behind Bastion and Transistor ever revealed their third game. It's called Empire and it's coming to PlayStation four as well as PC in 2017 super giant describes its game as a party based RPG and it made its first public",
      "start": 3009.16
    },
    {
      "text": "ever revealed their third game. It's called Empire and it's coming to PlayStation four as well as PC in 2017 super giant describes its game as a party based RPG and it made its first public appearance of Pax East this past weekend on the game's website. Super giant says quote Empire you lead a band of exiles. There were an ancient competition spread across the vast mystical purgatory and quote it will contain a world map quote action packed confrontations and quote and much more. We really don't know much more about it other than the fact that I'm sure it's going to be great. Yeah. So we'll see what happens. I still have not played Transistor very much. Bastion I played quite a bit but people were putting you know somebody poked super giant about trying to get us over to do the demo station and Greg of course respond. I was like totally. And I was like I can't but they're local. So I just wrote an email him get him up here even as just for the games guys. Yeah. Number",
      "start": 3042.4
    },
    {
      "text": "demo station and Greg of course respond. I was like totally. And I was like I can't but they're local. So I just wrote an email him get him up here even as just for the games guys. Yeah. Number four Mirror's Edge Catalyst. The anticipated sequel to Mirror's Edge has been delayed but only by a couple of weeks developer Dice revealed the news ahead of the launch of its closed beta which is the primary reason for the delay. According to Eric Odo doll the game's design director the delays due to giving the team quote the opportunity and time to address player feedback from the closed beta and quote Mirror's Edge Catalyst will now launch on June 7th in North America and June 9th in Europe. So not a bad delay. And I believe that that is the reason for the delay. Otherwise why would you delay the game two weeks? Number five Atlas is teasing something Persona five related and it's probably the game's release date announcement. The game's official website currently totes a countdown",
      "start": 3076.1
    },
    {
      "text": "delay the game two weeks? Number five Atlas is teasing something Persona five related and it's probably the game's release date announcement. The game's official website currently totes a countdown clock that expires on May 5th Sega and Atlas haven't yet said anything about the countdown clock what the countdown clock signifies. So we'll have to take it with a grain of salt for now. We'll know that it means we'll know what it all means in two episodes of PSI Love You XOXO. So not the next one but the one after that. When you say two sleeps till Christmas exactly Persona five is slated for a 2016 release. Likely this summer. Hell yeah. Number six. It looks like Drive Club is officially coming to PlayStation VR. That's because the ESRB has rated a product titled Drive Club of VR. It was rated as E for everyone. This doesn't come as a huge surprise. This Drive Club has been playable in VR but it does verify that it may be released as a standalone product as opposed to some sort of",
      "start": 3109.7
    },
    {
      "text": "rated as E for everyone. This doesn't come as a huge surprise. This Drive Club has been playable in VR but it does verify that it may be released as a standalone product as opposed to some sort of patch or add on for the original game. Though this hasn't yet been verified by Sony. The bigger question is posed by polygon from which the news was garnered is who made the game with evolution being officially closed down by Sony. The chances are it was done and wrapped up before evolution was shuttered. Though this hasn't been confirmed by Sony either. You simply don't submit until the game's done. So I or near being them. So no surprise. Yeah. Number seven the long awaited and even longer rumored Mafia three finally has a release. I'm excited about this game. Yeah. Yep. The game will launch on PlayStation four and elsewhere on October 7th. Preordering the game can get you some special perks and there will also be limited deluxe and collectors additions available for $80 and $150",
      "start": 3145.14
    },
    {
      "text": "launch on PlayStation four and elsewhere on October 7th. Preordering the game can get you some special perks and there will also be limited deluxe and collectors additions available for $80 and $150 respectively. Number eight Arc Survival of the Fittest. The incredible incredibly popular PC and Xbox One game is finally coming to PlayStation four. It will launch on July 19th. The game is what the developer refers to as a multiplayer online survival arena and they claim it's the first game of its kind on PlayStation four. Game's super fucking popular. It's on booth. Yeah. We had a there's a let's play up on youtube.com/kindafunnygames of Nick and Tim riding a giant beaver and beating the shit out of people in it. This next one is for all the people that told me I was ignoring this game. They're right. We haven't talked much about it. Square Enix is I am Setsuna at JRPG. It's powered heavily by one of square. Salt's most popular products of all time. Chrono Trigger is",
      "start": 3180.62
    },
    {
      "text": "this game. They're right. We haven't talked much about it. Square Enix is I am Setsuna at JRPG. It's powered heavily by one of square. Salt's most popular products of all time. Chrono Trigger is coming to PlayStation four as well as PC on July 19th. The game came to Vita in Japan. However there are currently no plans for square to support the game to Vita in the west. They are apparently listening and I think you can provide them feedback but I wouldn't count on it because remember that the secret amanda game whatever the adventures a man of adventures the matter of the remake of Final Fantasy Adventures which is a second Densetsu game was on Vita in Japan and they've not. Yeah good point. Number ten believe in the Vita Tales of Brazilian the most recent tales game that's slated for release in August in Japan will come to the west in early twenty seventeen. The game is launching on PS three PS four and PC in Japan but we'll skip its release on PlayStation three in the",
      "start": 3214.38
    },
    {
      "text": "for release in August in Japan will come to the west in early twenty seventeen. The game is launching on PS three PS four and PC in Japan but we'll skip its release on PlayStation three in the west. Brazilian is the sixteenth tales game in the franchise. Oof destiny. The best says this tales fan. The last one was disappointed me. I only played for a few hours. I'm like this one's all about making braziers Brazieria Tales of Brazilian. That's brilliant. Number eleven PlayStation Network is getting two factor authentication for obvious security reasons. Sony told GameSpot in a statement that quote in order to further safeguard our users and their accounts we are preparing to offer a two step verification feature. There's no word on when this authentication will be activated. However about time a long time coming. If you ask me Colin I never really thought about it to be honest but you know I don't think about a lot of things. Sure sure. And finally wrap up number twelve shadow",
      "start": 3254.54
    },
    {
      "text": "time a long time coming. If you ask me Colin I never really thought about it to be honest but you know I don't think about a lot of things. Sure sure. And finally wrap up number twelve Shadow Complex Remastered finally has a release date on PlayStation four. It will launch on the console on May third and marks the first time Shadow Complex has ever graced a piece of place. Classic Neo Geo fighting game. The Last Blade Two will come to PS four and Vita on May twenty fourth strategy RPG Grand Kingdom is getting a beta on PlayStation four which will begin on May third. The game is still slated to come to both PS four and Vita in June. JRPG exists. Archive the Other Side comes to PS four and Vita on October eighteenth. The King of Fighters fourteen will come to PlayStation four on August twenty third puzzle platformer in the shadows has been confirmed for release on PlayStation four sometime in twenty seventeen psychological horror game. Never Ending Nightmares comes to PS four on",
      "start": 3293.32
    },
    {
      "text": "twenty third puzzle platformer in the shadows has been confirmed for release on PlayStation four sometime in twenty seventeen psychological horror game. Never Ending Nightmares comes to PS four on May third stealth action game Aragami Aragami and it's not Oregon. It's Aragami Aragami killer is coming to PlayStation four this fall. Local multiplayer centric push me pull you comes to PlayStation four on May third. Fix that rhythm based platformer one forty comes to PS four and Vita this summer and finally side scrolling brawler Dungeon Punks which looks really cool comes to PS four later this year. And that's it for the news. I've been waiting for you to push me pull me for quite some time but it's so far out. If I wanted to know what was in the mom and grop shops both digital and brick and mortar where would I go? The official list of upcoming PlayStation four PlayStation three PlayStation Vita sometimes PSP software by the Kinda Funny co-founders. Dude why are you using",
      "start": 3331.26
    },
    {
      "text": "and mortar where would I go? The official list of upcoming PlayStation four PlayStation three PlayStation Vita sometimes PSP software by the Kinda Funny co-founders. Dude why are you using the smallest? Why I mean like I understand it's from the flight last night. Yeah I just took it with me but I mean like I gotta go from no fill it up again because I'm a little thirsty right now. Okay. Your way. We fill my cup. Okay. It's just like I understand when you bring back the big bottles when he brings back the little bottles but your your your port is your house where you have cups and glasses. They're clean. I wash them myself before the water man comes over and touches me places. He shouldn't touch me. This is my cry for help against the water man. I need your help. Everyone watching but that's what I'm saying. Thanks sir. All right. Nothing like some H two. Oh you know what I'm saying? You love water. All right. Here are the upcoming games. Alien nation comes to",
      "start": 3370.32
    },
    {
      "text": "watching but that's what I'm saying. Thanks sir. All right. Nothing like some H two. Oh you know what I'm saying? You love water. All right. Here are the upcoming games. Alien Nation comes to PlayStation four digitally. Lead your squad elite squad in the fight to save earth from a huge alien invasion in this frantic top down twin stick shooter with hordes of alien creatures swarming across the planet. You'll need to work together with up to three friends to devise tactics and keep each other alive under mounting pressure. Dead Nation meets Diablo. That's all you need to know. I'm going to go with the one that's the most important thing. I'm going to go with the one that's the most important thing. I'm going to go with the one that's the most important thing. I'm going to go with the one that's the most important thing. I'm going to go with the one that's the most important thing. I love the name of this one laying on. Don't even read it. Don't even. I'm not looking. Arcade",
      "start": 3418.52
    },
    {
      "text": "the one that's the most important thing. I'm going to go with the one that's the most important thing. I love the name of this one laying on. Don't even read it. Don't even. I'm not looking. Arcade Archives. Kids Whore Whore. Dice Acoustic comes to PS four digitally. Can't laugh in this current medical condition. Please kids Whore Whore. Dice Acoustic is an action that was released by Nietzsche Boots. Sue 1987 kid who has been drawn into the space time labored from the 3rd century fights to escape from the enemy in order to return to the present day. Players defeat enemies by using items and traps. Now I'm just going to say that this sounds like someone making up just Japanese words that don't exist. Do it again. Kids kids Whore Whore Dice Acoustic send from Nietzsche Boots. Sue. Oh my God. Oh my God. Whore Whore H O R E H O R E whore whore. All right. Battle Worlds Kronos comes to PS four digital battle. Wars Kronos is a turn based strategy game that stays true to its hexagonal",
      "start": 3439.44
    },
    {
      "text": "my God. Oh my God. Whore Whore H O R E H O R E whore whore. All right. Battle Worlds Kronos comes to PS four digital battle. Wars Kronos is a turn based strategy game that stays true to its hexagonal roots inspired by classics like Battle Isle. The planet is once again torn by war for the succession of a new emperor. Its destiny is in your hands. Prepare to fight epic battles against tough AI enemies in three huge campaigns with more than 60 hours of gameplay. Okay. I will game. I'm strangely excited about simply titled the brick breaker comes to PS four digital says brick breaker. The classic arcade game is back with a breathtaking new version. It's explosive gameplay unique and timeless is filled with surprises sharpening reflexes and precision to overcome the hundred different levels that await you collect. The bonuses avoid traps and shoot your way to victory. But breakers are fun. You I love you and I love I really do shatter in case anyone saws our PlayStation three still",
      "start": 3494.68
    },
    {
      "text": "that await you collect. The bonuses avoid traps and shoot your way to victory. But breakers are fun. You I love you and I love I really do shatter in case anyone saws our PlayStation three still the best one for some reason getting released here. No idea why Don Bradman Cricket comes to PS four digital for Danny O'Dwyer cricket as you've never seen it before. I don't think I've ever seen it ever features into futures intuitive controls that allow for a line and length deliveries without pitch markers and realistic shot control and batting. Take a 16 year old aspiring cricketer through the ranks to international glory and career mode. No thanks. But for all of our cricketers out there especially in Europe I'm sure you're going to like that. Jetpack Joyride comes to PS four digital. Join Barry Steak Fries as he breaks into a secret laboratory to commandeer the experimental jet pack from the clutches of science evil doers. Felt like this one came on forever ago but I must be",
      "start": 3532.82
    },
    {
      "text": "Join Barry Steak Fries as he breaks into a secret laboratory to commandeer the experimental jet pack from the clutches of science evil doers. Felt like this one came on forever ago but I must be thinking of the Vita version. The Magic Circle Gold Edition comes to PS four digital. You are the protagonist of an unfinished first person fantasy game trapped in development hell. The designers are godlike but so indecisive that they've given you no powers whatsoever. With the help of a mysterious disembodied voice you must seize the tools of the game development from these unworthy gods and uncover the dark comical story as you go. Now before I was fun before I go on I want to make sure that this is before I say it I want to make sure that this is the game that that I was reading about earlier. Give me just one moment. We're on Kotaku. We're looking for the game. Colin was reading about one moment. Remember you're watching PS I Love You XOXO. I think this is the game Tuesday at nine",
      "start": 3571.76
    },
    {
      "text": "Give me just one moment. We're on Kotaku. We're looking for the game. Colin was reading about one moment. Remember you're watching PS I Love You XOXO. I think this is the game Tuesday at nine a.m. Sometimes. No this is not the game. This is not the game. This is not the game work or flat waving it off. It sounded like it. So the game I was thinking about is called the Like Dumb. We talked about it last week. I think Like Them Battle Mage which is the worst game of the console generation. Technically technically according to Mike Fahey the game runs at like in the teens. Oh wow. In terms of frame rate anyway. So wrong game. Don't Magic Circle Gold Edition not that game but we still don't know anything about it though. Mega Tag Mentioned Blaine plus Neptune versus Zombies was supposed to come to Vita digitally but it's coming out next week or no two weeks from now instead. It's again called Mega Tag Mentioned Blaine plus Neptune versus Zombies. That's another one where they just",
      "start": 3604.96
    },
    {
      "text": "to come to Vita digitally but it's coming out next week or no two weeks from now instead. It's again called Mega Tag Mentioned Blaine plus Neptune versus Zombies. That's another one where they just threw words together. Neo's demo comes to PS port digitally a demo for the new system. Neo no an NIH. This game looks fucking rad. This is the Ani Musha type game coming from Tecmo Co. Okay. Ready to die. Experience an early version of the newest brutal action game from team Ninja and Co. Tecmo games in the age of samurai along alone traveler lands on the shores of Japan. He must fight his way through the vicious warriors and supernatural Yokai that infest the land in order to find that which he seeks. The game looks fucking rad. I'm interested to see if it's any good team Ninja knows what it's doing. Maybe the game you like very much Party Hard comes to PS four digitally and Party Hard. You play as someone who is really tired of the neighbors having loud parties. Instead of calling the",
      "start": 3639.1
    },
    {
      "text": "doing. Maybe the game you like very much Party Hard comes to PS four digitally and Party Hard. You play as someone who is really tired of the neighbors having loud parties. Instead of calling the police you decided to better idea to stop the party yourself. Party Hard has semi semi procedural environments and focus on unique ways of taking people out. And the greatest traditions of sneaking games. The main goal is not to get caught while silently picking off unsuspecting victims one by one. This was an Xbox one game right? This was a PC game and then it went to Xbox one I believe. Yeah but the problem I'll give you this caveat to my recommendation that I loved Party Hard. There is a let's play of Party Hard up on the Kinda Funny YouTube channel there are the Kinda Funny Games one where I drink a beer and Party Hard while playing Party Hard. However this was the steam released version of the game and that one had problems with it. Now granted I was playing it on a PC so of",
      "start": 3675.68
    },
    {
      "text": "where I drink a beer and Party Hard while playing Party Hard. However this was the steam released version of the game and that one had problems with it. Now granted I was playing it on a PC so of course there'd be problems with it and it wouldn't run and I wouldn't be able to advance the game and it would crash and shit like that because of my drivers or my direct X or whatever the fuck's happening but I don't know just putting that out there. Really fun idea really fun to play. Let's see how much were they selling it for. It doesn't say okay there's no prices here. Okay okay. Rocket Birds to Evolution which I feel like has been development for 18 years finally comes to PS four and Vita digital cross by step into the webbed feet of hard boiled chicken. The series undeniably plucky super chicken secret agent and adventure into the game's full story mode campaign. Thanks to return of the evil penguin despot Ill Pazooki. I love that that the penguin despot is like the fucking",
      "start": 3711.52
    },
    {
      "text": "super chicken secret agent and adventure into the game's full story mode campaign. Thanks to return of the evil penguin despot Ill Pazooki. I love that that the penguin despot is like the fucking best character in the game. Hard boiled must hunt down and eliminate him once and for all using jet packs new guns disguises and skills only fit for the bond of super chicken agents. I remember. So the game came to PS three and then it came to Vita later and I remember it being not good half a baked. Yeah I did not enjoy that. It wasn't bad. It just wasn't. It was very much one of those games you'd find in that we're in the five five to six five range. Yeah I think I might've reviewed it. I don't really remember. Severed comes to Vita digitally take control of one armed warrior named Sasha wielding a living sword on her journey through a nightmare world in search of her family. Swipe based touch controls will let you solve puzzles find secrets and do battle with a host of disturbing",
      "start": 3751.48
    },
    {
      "text": "wielding a living sword on her journey through a nightmare world in search of her family. Swipe based touch controls will let you solve puzzles find secrets and do battle with a host of disturbing monsters. We'll talk about that in a minute. We will. I'm tots tots tots stranger of sword city comes to Vita digital and retail after your plane flies the restraint drift and crashes. You awake under an unfamiliar sky. This is sword city a dark fantasy world that combines magic and technology. Explore level up make a perfect team and slay monsters but choose your allies carefully if you want to find a way home. I played a bit of it on Vita not a dungeon role playing it right. And it's but it's super dungeon role playing game where you get into thing you cast your attack and then it's just like all texts at the top saying like Oh you did 39 points of gym but I don't mean cool text perhaps. I'm not you know Dragon Quest. Dragon Quest is literally just like an enemy's there and",
      "start": 3790.2
    },
    {
      "text": "just like all texts at the top saying like Oh you did 39 points of gym but I don't mean cool text perhaps. I'm not you know Dragon Quest. Dragon Quest is literally just like an enemy's there and you're here and like you see a slash and then it's like how much damage is that? I mean even that's the whole thing is like the slash sounds even cooler than this where there's like an animation on screen for a slash but it doesn't the whole thing was just like a Fantasy Star. It lacked impact and everything I was doing in the game. I felt when I was playing it the Sun and Moon comes to PS4 and Vita digital cross by the Sun and Moon is a platformer with a unique mechanic. You can dive into the ground. Momentum is conserved but gravity is reversed letting you fling yourself high into the air or deep beneath the surface. So the trophies leak before they even in the game was even announced. I don't know. I'm kind of interested in it. I got an email our friend Taylor Murphy and see if",
      "start": 3826.84
    },
    {
      "text": "air or deep beneath the surface. So the trophies leak before they even in the game was even announced. I don't know. I'm kind of interested in it. I got an email our friend Taylor Murphy and see if I can get some there's some games I want to play this week. Tales from the Borderlands PS4. I should say from this week from this week Tales from the Borderlands comes to PS4 and PS3 retail in this award winning universe created by Gearbox software experience. The story of Reese and Fiona unwilling partners on a quest for greatness the Hyperion suit and the con artist embark on an adventure to recover cash. They both think is theirs on the unforgiving world of Pandora and that is it for the upcoming games can't recommend Tales. The Borderlands enough everybody I've said it a lot so I won't do it but it totally caught me by surprise last year of being like I don't even care that much about the story in Borderlands. So I would want to play a Telltale game in the Borderlands universe",
      "start": 3859.88
    },
    {
      "text": "do it but it totally caught me by surprise last year of being like I don't even care that much about the story in Borderlands. So I would want to play a Telltale game in the Borderlands universe and then sat down and played it and had a ball on a bad day and then everyone kept me laughing. Everyone the episodes so there you go Colin time for topic of the show tots tots tots. You almost slipped you almost slipped. I heard it now and that wasn't that one. I didn't almost slip on. I usually do almost slip and I think most of the time I honestly slip on it but I didn't slip this time top of the show Severed. We can finally talk about Severed. I fucking loved Severed and I here's what I want to say. I think pound for pound. It might be my favorite video game and I know that's crazy talk. I know it's not as deep as Persona for I didn't. You know I didn't get attached to the characters the way I did there but in terms of every time I turn that on that game on for Severed I enjoyed",
      "start": 3900.36
    },
    {
      "text": "I know it's not as deep as Persona for I didn't. You know I didn't get attached to the characters the way I did there but in terms of every time I turn that on that game on for Severed I enjoyed it and I loved what I was doing and I was excited about what came next. Yeah it's a I wouldn't call it my favorite game on Vita. I would call it one of my favorite games on Vita. Sure I think Guacamelee is a better game now and I know that you and I disagree on this. No I think they're different. I mean they're different and that's what I give Drink Box. It is a lot of credit for but I also am a little confused about sometimes is why they do different things. Guacamelee two was the obvious thing they should have done and they should. They guys I know you listen to the show like we love you very much. You really should make artists. No don't quit. Be artists by making Guacamelee to for God's sake. Um the the thing about uh Severed though was that it's really fantastic. It's a",
      "start": 3938.34
    },
    {
      "text": "you very much. You really should make artists. No don't quit. Be artists by making Guacamelee to for God's sake. Um the the thing about uh Severed though was that it's really fantastic. It's a fantastic game and um while I'd rather play a side scrolling cas Metroidvania type game like Guacamelee as opposed to a first person the RPG like Shadow Gate for instance or like Strangers of Sword City or whatever you know it's a bunch of them on Vita is actually a pretty ripe ripe place for these kinds of games. Yeah. Um but not touch based like Severed is um the games atmospheric the art style is very much like Guacamelee. Um it's it has the same thing that Guacamelee left left me with which is like why isn't this longer? I beat it in seven. I platinumed it in seven and a half hours. Yeah. Um and I platinumed it with no help. I mean like I plotted before the game. Yeah exactly. So like it's like seven and a half hours and I would say an hour and a half or two hours of",
      "start": 3978.96
    },
    {
      "text": "hours. Yeah. Um and I platinumed it with no help. I mean like I plotted before the game. Yeah exactly. So like it's like seven and a half hours and I would say an hour and a half or two hours of that was actually me figuring out like what the fuck I'm supposed to do at certain times. But that's like one of the things I'm talking about with like when I'm talking about the experience for the record my clock said 11 and I don't know if I must have left it running cause that seems longer than I feel like I played it but whatever. 11 was my clock hour. Um but that's what I'm talking about in the way of like that wasn't an organic platinum and I was excited to find it all on my own and do it all on my own. It wasn't I needed a guy. The one thing I'll say is that you know you're playing Severed art that sounds beautiful. You're walking around this dungeon. The way the dungeon and the mat play together is I found myself always looking at the map if that makes sense. Cause I'm you",
      "start": 4023.92
    },
    {
      "text": "Severed art that sounds beautiful. You're walking around this dungeon. The way the dungeon and the mat play together is I found myself always looking at the map if that makes sense. Cause I'm you know I'm just like all right two ups you know one left and then up to this where's that door I haven't gotten to or 90 to go hit this sun thing to make everything into moons. You know what I mean? To be able to get where I'm going to the next part. Uh but it I I I liked it. It was an attainable slash easy platinum right? Right. It wasn't there was that one fight. You knew exactly what I was talking about when I woke up one more thing. What am I doing? No but it was you get these parts and it was you walk off and you fall to your death and you're like okay and you did like three times like I need something else and then to go play the rest of the game and then get that thing and be like all right fuck now I got to go back there. I was excited to backtrack every time I got",
      "start": 4054.92
    },
    {
      "text": "times like I need something else and then to go play the rest of the game and then get that thing and be like all right fuck now I got to go back there. I was excited to backtrack every time I got one of the new things. I immediately ran backwards right? I wanted to go use it on all the different places. I wanted to go find all the secret doors I want and it wasn't even that I again was being like I was being you know beat down by the enemies that I really felt like I needed more health or I needed more mana right? It was just that I wanted it. I wanted to have that cause now I had the ability to go get it. It it it had this spark in it made this spark inside me for exploration in a way that even Alien Nation I'm playing today right? And I beat the first thing and it's like all right cool. Here's the evac point. I'm like I'm going to go wander around a bit. And I went and wandered around and found some more chests and stuff. And then I was like all right this map's",
      "start": 4094.2
    },
    {
      "text": "all right cool. Here's the evac point. I'm like I'm going to go wander around a bit. And I went and wandered around and found some more chests and stuff. And then I was like all right this map's really big. Actually I'm gonna go with the exploration. Whereas this one I wanted like I was jumping you know all over the place going from map to map to map trying to make sure I had everything every time I got a new toy to play with. Yeah. The um I think that the one of the key design tenants of this game that I think is quite nice is it's fair. A lot of these games can be really up to so if you play a lot of old role playing games especially first person role playing games they're really they're really like I don't know how much experience you have with those old games but like I used to play them sometimes when I was a kid and watch other people play them and they were more at home on PC but we had them on any SNES and like they but we we we understood these",
      "start": 4130.8
    },
    {
      "text": "but like I used to play them sometimes when I was a kid and watch other people play them and they were more at home on PC but we had them on any SNES and like they but we we we understood these games. They're really fucking hard. Like these games are really like the epitome of obtuse. Um and this game felt fair to me. Like when there was a place where there was a puzzle that you didn't understand as a question mark on the map you knew you got to go back. Yeah. It shows you where collectibles are on the map. But once you see them see when you can't access them at that time like when you have this certain spells to use you got like an eyeball spell and like a mouth spell you'll see like their icons. People know what I'm talking about when I when they play it you know you didn't go back to those places. So it's like it's one of those games like where if you go through the motions you can probably find everything. There are only a few times where I'm like like um there's",
      "start": 4160.48
    },
    {
      "text": "go back to those places. So it's like it's one of those games like where if you go through the motions you can probably find everything. There are only a few times where I'm like like um there's one part where you have to fight enemies over and over again and you don't really know why you're doing it. Right. I know exactly. And at the end like the treasure room. Yeah. And you can eventually access this room and that's basically not even for any any collectible. That's basically just to fill in your map. Yeah. And but even that right? Like my thought my thought was I was doing it wrong. What am I doing wrong? But then I noticed no they're adding enemies every time. Like something's happening. The enemies are getting harder. Yeah. Um and then there are these like secret rooms too with by the way some amazing music in these secret rooms. Um this great like piano music. Um I think that the one of the one word I would use to describe this game those melancholy. And I",
      "start": 4191.6
    },
    {
      "text": "too with by the way some amazing music in these secret rooms. Um this great like piano music. Um I think that the one of the one word I would use to describe this game those melancholy. And I think that that's like one of the cool things about it is that Guacamelee was a dark game about something sad but it was silly. It was yeah it was lively and jovial. This game is not funny or silly at all. Not at all. And and uh it's dark and it's a and it's fucking serious and dire. Um and it's just sad. The music's sad. The scenery's sad. The NPCs are sad. Your own character Sasha's sad. Um and I like that. Like there's a lot of emotion in this game. I think that was their intent but I don't know for sure. Um so that's the one thing we're not talking about is the touchscreen control. Yeah. So that could be yeah of course. Which is interesting in the way that you know I uh when we talk about the Vita and how I would have made the V that I'm always like I would have dumped",
      "start": 4220.8
    },
    {
      "text": "Yeah. So that could be yeah of course. Which is interesting in the way that you know I uh when we talk about the Vita and how I would have made the V that I'm always like I would have dumped the touchstrings right? Like touchscreen gaming for you and me doesn't really do much for us. And then we've said that over and over again but there are those exceptions and this is an exception for me. And granted I know you could easily anybody who wants to hang that their hater hat on us right? It's the fact that well of course we have an exception. It's on the Vita now. There's plenty of games on Vita that use touch that I think suck dick and don't matter at all. This one I was amazed by how and I've said this since I played it at that first packs right? That I'm amazed at how much fun it is to play and use the touch. Cause it's using it in a way that's making me think about it more than other games where I'm just swiping back and forth or I just draw a line and it's over.",
      "start": 4265.08
    },
    {
      "text": "much fun it is to play and use the touch. Cause it's using it in a way that's making me think about it more than other games where I'm just swiping back and forth or I just draw a line and it's over. This is the I'm using the you know controls to move around the world. I'm exploring the world or whatever cause I'm still using my buttons for that. Then I get into a fight and it is like okay cool. Like I have to manage what's happening on this guy. Switch over to that guy switch that guy knock this down. Now this guy's got a spinning circle around him that I have to smash through. And even when I start into where I'm really doing critical damage and I'm slashing over and over and over again the circle turns the half circle now turns right and blocks it. Otherwise you have to be there's like you learn a strategy for every character and then it's like spinning all the plates at once. Yeah. And I think that the other cool thing about you know is you know I think it's the",
      "start": 4295.08
    },
    {
      "text": "there's like you learn a strategy for every character and then it's like spinning all the plates at once. Yeah. And I think that the other cool thing about you know is you know I think it's the fusion of touch controls with typical controls. You're navigating with the analog sticks which is great. So you move in and look around with the and you can only it's like a Wolfenstein like you can only look left and right. You can't look it up and down. But it's you and I'm talking about Wolfenstein 3d like the old PC where there is no like X axis or no there's no no there's no Y axis. But to me it's it's the fusion of those controls I think is clever. And also the ability to like sever these enemies parts and use them to upgrade your character which I think is really cool. Like it's not very difficult to upgrade your character. A lot of the upgrades I don't think were like super satisfying either but you were just doing it anyway. Your character was getting demonstrably",
      "start": 4330.68
    },
    {
      "text": "it's not very difficult to upgrade your character. A lot of the upgrades I don't think were like super satisfying either but you were just doing it anyway. Your character was getting demonstrably stronger. Right. But I will say again that my one problem my one takeaway with the game and an issue is that I just wish it was bigger and and don't really understand why it wasn't bigger. The studio that I was surprised by how many people had worked on the game actually when I when I when the the name scroll at the end. And I'm not saying that they did the wrong thing whenever this game was in development for a long time but I wanted more I would have liked a 15 hour or 20 hour game but it is a $15 game. So for seven eight 10 hours you're going to get your your money's worth. I want to reiterate what we said many times in the past on the show in the last few weeks. You really need to buy this. You do. And just buy the game. And unless it's a game you are absolutely sure you",
      "start": 4367.8
    },
    {
      "text": "want to reiterate what we said many times in the past on the show in the last few weeks. You really need to buy this. You do. And just buy the game. And unless it's a game you are absolutely sure you won't like but I bet you decide to I mean the quick rest stop on that conversation is the fact that like when I remember you know being such a Drink Box fan and I mean being a Drink Box fan since the first Blobs game when I sat down to play this and I was like Oh it's Oh it's first person dungeon. Ooh. Like I on paper should not enjoy this game. And I really really really love this game. And it's one of those experiences. You know what I mean? Like it is it it I don't know. It struck a chord with me in terms of just everything I want out of a game. And I did not expect it to I thought it would have some of those things. But in the end I didn't care about the perspective. I you know what I mean? This is the first game I have played through where I'm like okay this is the",
      "start": 4405.0
    },
    {
      "text": "thought it would have some of those things. But in the end I didn't care about the perspective. I you know what I mean? This is the first game I have played through where I'm like okay this is the first person dungeon crawler and I'm enjoying the hell out of it. It's a great game. And and and uh I certainly think in the top echelon of Vita games I don't know if it's my favorite video game but I mean I cause I love Velocity and Velocity 2X. I love a Stardust Delta. I still think a great game Uncharted Killzone Freedom Wars. I mean these are games are probably all better. Um but but I but I do and even Guacamelee but I do think that maybe top 10 and I think that that's a pretty substantial thing considering I think Vita does uh libraries very strong a top 10 Vita game is a must own video. Sure. When I think about it when I'm saying that it might be in the running for my favorite video game I'm like this is always the argument used to make when we make top 5",
      "start": 4446.24
    },
    {
      "text": "is a must own video. Sure. When I think about it when I'm saying that it might be in the running for my favorite video game I'm like this is always the argument used to make when we make top 5 list right? Like when we want if we want to sit here and talk about it I'm sure. On paper I think Guacamelee probably is a better game in terms of what it's doing and the amount of things to do but I'm talking about like from start to finish I was enthralled with Severed and I Uncharted. I wasn't at times. The sniper section sucks. I hate this fucking part. This feels like it's going on a little bit too long. What's that? You know what I mean? Like in that same thing with all the other games there I can think of a giant negative. The only negative Severed experience is the one where I was at three in the morning and I couldn't sleep and I'm like why can't I fucking beat this? What is going on with that? That fight is hard. And what it came down to is I wasn't slashing long enough on",
      "start": 4479.76
    },
    {
      "text": "at three in the morning and I couldn't sleep and I'm like why can't I fucking beat this? What is going on with that? That fight is hard. And what it came down to is I wasn't slashing long enough on my screen. I was doing my small ones but I needed to be doing even larger critical slashes than what I was doing. And when I figured that out I beat it like on the third try or whatever but it was still but like that that alone even when I was mad at that one moment I was like wow this isn't like game breaking. It didn't destroy me in a way. I just I do think that the game's strongest suit is not only its gameplay which I think is good. The upgrades upgrading which is nice. The exploration which is great but I think it's ambiences is probably its best feature. And it's just a weird it's a weird game. It's just weird. And I think that that's a that's great. Now I I hope that Drink Box does well with this game. Please go support them and show these guys that you know they",
      "start": 4511.2
    },
    {
      "text": "it's a weird game. It's just weird. And I think that that's a that's great. Now I I hope that Drink Box does well with this game. Please go support them and show these guys that you know they didn't make a mistake port you know bringing a Vita exclusive. I don't think it's gonna be exclusive forever but sure. I think this game can come to PS4. I think it should and will come to PS4. I think you can use the touch pad and they just have to figure it out. The problem. The only thing I can think of with the touch pad right. Would be the fact that the touch pad is so much smaller than when we start talking about like I'm doing little scratch you know what I mean? Like you have to put it on the sticks or something like that. You'd augment right? Like a small slash is just using the pad. Hold down L2 is you know the shoulder buttons to be like a alternate between how like kind of you know Northwest Southwest you know Southeast Northeast with the buttons like the",
      "start": 4551.52
    },
    {
      "text": "pad. Hold down L2 is you know the shoulder buttons to be like a alternate between how like kind of you know Northwest Southwest you know Southeast Northeast with the buttons like the where you're slashing like in the four curtain. Oh I didn't even think of that way. I was just trying to I think the one problem it has is the fact the pad's so small that it's going to be hard to tell between a giant slash and a small slash. It does matter. Yeah it does. I hope they can figure it out because that is the inherent flaw the game in terms of porting it anywhere else but in phones. And I Drink Boxes on a phone developer. So um and I don't think that game is going to do anything on a phone. So you know because it's just so crowded there like I don't think they have the I don't think they have the cash to sell copies of games there. I mean they have a cash with the Vita audience they have a cash with the PlayStation audience. I hope that they're able to figure out how",
      "start": 4582.52
    },
    {
      "text": "think they have the cash to sell copies of games there. I mean they have a cash with the Vita audience they have a cash with the PlayStation audience. I hope that they're able to figure out how to get it off of Vita. Um in the meantime supported on Vita and show them that they didn't make a mistake cause that's going to take time. I want them to make their money back and a hundred percent dudes and great game. They are great dudes friends of ours personal friends of ours. We love them. So I know you guys are listening to this. We appreciate you and congratulations on the game. Um go make Waka mainly to please or just make a longer Severed. It's fine. I'll make another Severed but I don't know how you Severed is definitely a self-contained story which is being artists. What do you want to make Graham? You want to just release one black pixel and just floats around the screen. I'm sure it'll be great. Also shout out while I'm thinking of it to Color Controllers at PAX East",
      "start": 4623.92
    },
    {
      "text": "want to make Graham? You want to just release one black pixel and just floats around the screen. I'm sure it'll be great. Also shout out while I'm thinking of it to Color Controllers at PAX East the dude who runs that came up gave us a customized piece. I love you controller and then Kinda Funny face plate. They're both very nice. Thank you for that. Not available for purchase. He's talked about that. They're just gifts to us but they make other stuff so check them out Colin. Yes trophy time trophy time. All right so there's a we were talking about Alienation. Alienation trophies are up so we can talk about those. Sixteen bronze twelve silver four gold one platinum. Um it seems like it's like complete all story locations complete all individual missions on the different planets. Um kill 0 or more Zenos with a single minor grenade. Zenos I think are the aliens. Yeah they reach level 30 as a bio specialist reach level 30 as a savatory reach level 30 as a tank. Um",
      "start": 4650.44
    },
    {
      "text": "Um kill 0 or more Zenos with a single minor grenade. Zenos I think are the aliens. Yeah they reach level 30 as a bio specialist reach level 30 as a savatory reach level 30 as a tank. Um and then you're gaining access and completing missions. Um so there's the trophies seem to be pretty straightforward. Um the one that's going to be tough is maybe reaching hero level 100. Um someone uh looks like almost has the platinum because the reach hero level according to PSN profile. So this isn't totally everyone that's playing the game. It's just people that are pinging in these servers. Um the only trophy that's missing is reach level 30 with tank. Huh? Every other trophies acquired. So someone's close and that seems to be like a no brainer one but um oh and reach level 30 as a bio specialist. So someone reached a level 100 as a saboteur I guess because that was the only other trophy that saboteurs are cool. That's why I'm one. Hey what up invisible shooting rank source.",
      "start": 4689.8
    },
    {
      "text": "bio specialist. So someone reached a level 100 as a saboteur I guess because that was the only other trophy that saboteurs are cool. That's why I'm one. Hey what up invisible shooting rank source. And then there are trophies for completing all story locations as the different. So so that's cool. Is that there's extra trophy hooks to not only reach those levels we actually have to do all the missions too. Yeah. Um so this seems like this is gonna be a game that is going to um not disappoint in terms of giving you things to do. Um yeah there's definitely work to be done. You'll have a reason to play over and over and gold for I fear everything reach level 30 as any class on hardcore mode which I guess is not available initially. Now see that was the confusion. So the heart when I was talking earlier the hardest difficulty of the first three party hard. Strobe is are up twenty one bronze zero silver zero gold zero platinum. What the fuck fuck you party hard clubber play",
      "start": 4736.44
    },
    {
      "text": "I was talking earlier the hardest difficulty of the first three party hard. Strobe is are up twenty one bronze zero silver zero gold zero platinum. What the fuck fuck you party hard clubber play party hard. One hundred times kill a thousand people use traps. Fifty times hide fifty bodies escape the cops five times die. One hundred times there's a lot jockey is a picture of a horse. Kill fifty people by horse. It's awesome to kill people by the horse. Um complete level with FBI. The trophies called cunning ninja complete level without found a body. So trophies to get there. The Sun and the Moon has trophies on Vita and PS4 seven bronze for silver one gold. The trophies look let's see beat every. Yeah we talked about this actually last week. I think this is the trophies with beating every level basically. Yes. So yeah we did talk about this last week. Battleborn trophies are live thirty eight bronze ten silver two gold and one platinum. Um reach command rank one hundred",
      "start": 4770.64
    },
    {
      "text": "every level basically. Yes. So yeah we did talk about this last week. Battleborn trophies are live thirty eight bronze ten silver two gold and one platinum. Um reach command rank one hundred and earn the Battleborn title is a silver win thirty story missions or versus matches is a goal. So it seems like they are skewing. Um some of the trophies towards story missions or single player mode although there are trophies like tour of duty winning match on each versus map is a silver play at least one match or mission with all twenty five Battleborn. So to play all the characters I don't hate those and she have a gold rating on any story mission as a silver. Um so it seems like there's a lot of challenges. So it says like complete all Benedict or challenges complete all Phoebe or or challenges complete all or Rendell or challenges is a lot of trophies like those um complete the experiment on any difficulty the archive any difficulty. So there's a lot of difficulty and",
      "start": 4811.04
    },
    {
      "text": "or or challenges complete all or Rendell or challenges is a lot of trophies like those um complete the experiment on any difficulty the archive any difficulty. So there's a lot of difficulty and challenge related trophies. I would say more than half of them are related to those all bronzes. Um over at Exo Phase we're not missing any over here. I don't think that I want to talk about anyway on Exo Phase. They do have a few other ones. Brickbreakers trophies are a lot. It looks like Brick Breaker has twenty bronzes um reach the max speed complete twenty levels in arcade mode complete forty levels a hundred levels in arcade mode get three hundred stars overall in arcade mode. So it's going to be a lot of grinding. I think in those kinds of games the Magic Circles trophies are alive. It only has thirteen trophies. Uh looks like let's see one gold three silver and the rest of bronze. Um seems like this is a game that maybe could use a platinum. Some of these are pretty",
      "start": 4847.0
    },
    {
      "text": "alive. It only has thirteen trophies. Uh looks like let's see one gold three silver and the rest of bronze. Um seems like this is a game that maybe could use a platinum. Some of these are pretty obtuse. The active love. This can only be is the trophy description. Master scout embrace the null state. Okay. Quality assurance. Hell hath no fury like a tester scorned leap of faith. The boundaries of the simulation have no hold on you. I don't like trophies like that unless your story related and you can't miss them. Exactly. And just for shits and giggles Mega Tag mentioned Blog Plus Neptune versus Zombies. Trophies are live thirty six trophies. Unclear how they're how they're all broken up. You know what? No I can't even read this. You know what? I can't care. I just can't. All right. That's it for the trophies. Okay. We didn't have any good trophy time questions. Everybody stop asking what like our hardest platinum is we've ever gotten. We've answered that. I'm refusing to ever",
      "start": 4888.44
    },
    {
      "text": "That's it for the trophies. Okay. We didn't have any good trophy time questions. Everybody stop asking what like our hardest platinum is we've ever gotten. We've answered that. I'm refusing to ever answer that question. Just letting you know we love that. We love you. Also no good. Dear shoe. Hey we're already starting with the like the like a no no no. Okay. That's what's going along. Anyway. Have a good one. No I know. I'm just letting you know what's up. I would like to do a piece of housekeeping at the beginning of reader mail. Melatop cocktail a super fly. X X I wrote in the kindafunny.com/PSQ just like you can. It says this isn't really related to the podcast but more about putting up PS I Love You XOXO on Google Play Music podcast section. When is it going to happen? I see the Kinda Funny Games Cast is up there but not PS I Love You XOXO or the GameOverGreggy Show. Thanks guys. Well super fly. I can tell you that Tim submitted all the podcasts for kind of",
      "start": 4937.72
    },
    {
      "text": "I see the Kinda Funny Games Cast is up there but not PS I Love You XOXO or the GameOverGreggy Show. Thanks guys. Well super fly. I can tell you that Tim submitted all the podcasts for Kinda Funny at the exact same time and why only the Games Cast is up right now at the launch of Google Music podcast. We don't know. So it's going to happen hopefully soon maybe by the time you heard it but it's up to Google. Now it's one of those. It's a Google problem. So Google who to talk to you about Google Music problems. Ryan Jamerson wrote wrote in. He said hello Greg and Colin. Hello. It was great meeting you both at PAX East on Sunday. Hope you guys had a great time as well. Congrats on the Islanders wind Colin. Thank you. My question is about PSVR. How PSVR was handled on the expo show floor for those that were not at PAX. PSVR was there to be shown but had a very limited availability. You were required to download the PlayStation experience app. This guy told me the story. Yeah.",
      "start": 4977.72
    },
    {
      "text": "floor for those that were not at PAX. PSVR was there to be shown but had a very limited availability. You were required to download the PlayStation experience app. This guy told me the story. Yeah. Schedule yourself for one of 14 demo titles through each day. Each demo lasted roughly 30 minutes. These times were filled within seconds of being made available at 9 AM every morning. This did not seem to go well right now. The PS experience app. Each demo is rated between right now on the PS experience app. Each demo is rated between two and .5 stars. I assume most of these negative reviews are from people upset that they didn't get a chance to try the demo not to mention the rumors. I was hearing of pink guy being spread around through the VR headsets which could talk. You turned out. Wasn't big guy now. What was it? He had an irritated eye. The kid or destructive. I sorry the destructive. They ran. I ran into them on the floor the next day and he was like I'm he's like you've",
      "start": 5022.84
    },
    {
      "text": "Wasn't big guy now. What was it? He had an irritated eye. The kid or destructive. I sorry the destructive. They ran. I ran into them on the floor the next day and he was like I'm he's like you've heard about me on the internet. I'm like who are you? I'm at the pink guy kid. I'm like you don't have pink eye. This is again it turned out to be pink. I'm like did you correct your story? He's like yeah. I'm like all right. Now my question. Now you go to a doctor before you make a proclamation. Now my question to you is how should this be improved for future events? It is vitally important for the PS VR to be shown to as many people as possible before it launches best by show floors shorter demo times for people to try it out. How to better sanitize the headsets. Would love to hear your thoughts. Thanks again for a great weekend. Ryan Jamerson. I mean to that to that the minute I really realized what I was doing cause I played PS VR a lot now then you didn't think about",
      "start": 5063.16
    },
    {
      "text": "your thoughts. Thanks again for a great weekend. Ryan Jamerson. I mean to that to that the minute I really realized what I was doing cause I played PS VR a lot now then you didn't think about that. I was like literally the first time. No I'm not. Oculus came into IGN and I took my first Oculus demo. It was like I wiped my I was they tried putting my head. I'm like I'm going to wipe this on my shirt. Like what are you doing? You know what I mean? Like Oh blah blah blah. And they haven't usually pretty good at what I've seen at sanitizing alcohol I think whatever but it's it's some sort of disinfectant but yeah. So maybe this wasn't the gentleman that was telling me this because some kid came up to me some guy came up to me at the meet and greet and was telling me how they signed up for it the day before but then they wipe all the times at 9.00 AM. So they like got screwed out of their time. I just don't understand why it's not first come first serve. I mean that's",
      "start": 5098.68
    },
    {
      "text": "signed up for it the day before but then they wipe all the times at 9.00 AM. So they like got screwed out of their time. I just don't understand why it's not first come first serve. I mean that's the way it should be. If you want to play the SVR then get online and wait you know I don't understand the whole I understand you want to like free people up or whatever but this is like this semantics of this is like way too complicated. This is this is more complicated than it's worth. It's going to be I mean we said it so many times it's gonna be a marketing problem for them. Well just before we switch things I actually liked the idea of the app granted. I know it kind of sucks that yeah. Okay. I try to get in and it's in two seconds gone but I also hate the idea of you wasting your packs waiting in line for four hours but whatever it's tomatoes tomatoes however you want to get it is fine. Whatever. Yeah. How to deal with PlayStation VR and getting it out and getting",
      "start": 5133.08
    },
    {
      "text": "your packs waiting in line for four hours but whatever it's tomatoes tomatoes however you want to get it is fine. Whatever. Yeah. How to deal with PlayStation VR and getting it out and getting people's you're getting it in people's hands. I was surprised PlayStation was there. PlayStation is not usually the packs company. You know what I mean? They they don't have something. I think it's because of VR and because of Uncharted you know obviously you know Ratchet had a big presence. Kill Strain was there and even Paragon which they're treating like their own game. Yeah no it was good to see them there. It was good to see them make these steps. And I thought that this is a fine thing but again keep in mind I understand that there's never going to be a time at any trade show at any Best Buy at everyone where everyone who wants to see something gets to see it. So is this a perfect system? No. Is waiting in line for four hours perfect system. No. But what it does is that",
      "start": 5162.12
    },
    {
      "text": "at any Best Buy at everyone where everyone who wants to see something gets to see it. So is this a perfect system? No. Is waiting in line for four hours perfect system. No. But what it does is that you nobody I didn't even know about this cause I wasn't paying attention. So the fact that on the PS experience the demos have two or two point five stars doesn't matter to me. What matters is that my one friend in the group of our friends did get into see it. He came out and he says Job Simulator is awesome. And then that's what you spread like it is that ground along with that fake pink guy along with the guy from destruction careful with that. Oh yeah no no one's playing my PS for a heads up of me. No no you know Kevin's going to get in there and do stuff too. No I don't think so. Balls. Kevin's the last part. I'd rather I'd rather a stranger on the street play my PS VR unit thing. Kind of you're hurting huh? Oh yeah. It's like when I had my my my cancer and I had my nose",
      "start": 5196.68
    },
    {
      "text": "Balls. Kevin's the last part. I'd rather I'd rather a stranger on the street play my PS VR unit thing. Kind of you're hurting huh? Oh yeah. It's like when I had my my my cancer and I had my nose cut open and I couldn't watch Portland because it was making me laugh too hard and I was ripping open my stitches. Yeah I hear you. Yeah. The harder the thing about the ribs good thing. We're not talking about tomato abortions this week or you really would have lost your mind. It would have been the end of it. The good thing about the the bad thing about the ribs is that they're connected to everything and you don't realize that when your ribs and your muscles are functioning fine the rib bones connected to the hip bones. I know but when they're when one of them is out of I'll tell you what whether it's laying down in bed whether it's pooping whether it's walking these things are all connected. What it is is I'm finding the in any once I find the status of my body I'm fine",
      "start": 5233.16
    },
    {
      "text": "what whether it's laying down in bed whether it's pooping whether it's walking these things are all connected. What it is is I'm finding the in any once I find the status of my body I'm fine sitting. This is fine. Did you you might've broken your ribs. Yeah. I looked it up on the doc. No I looked it up online and if it's broken or it's bruised it's the same thing. You can't put them in a cast. Don't wrap them up or your lungs could fill a fluid. So you just gotta let them heal naturally. Anyway I'm not wasting my mind. I'm not wasting my copay going in there to find out that Hey just fucking take it easy. I'm going to do it anyway. You're like you're like you're not going to take it easy. This was the rare example of you not taking it easy. You should just take it easy from going forward. If it gets hurt if it gets worse they said that's when you have to go to the doctor but it's already getting a lot of remind you that's High Route broke his ribs right in front of",
      "start": 5267.72
    },
    {
      "text": "going forward. If it gets hurt if it gets worse they said that's when you have to go to the doctor but it's already getting a lot of remind you that's High Route broke his ribs right in front of me in 2008 when he fell out of a tree. Oh right. Yeah. The Beta Breakers. Yep. And yeah which was an excruciating pain. And it took him like a week to go to the doctor and he found out he was all fucked up but I don't know that. Yeah you're right to that point. But see the thing is like again it's like I can breathe in and out fine but it's like when I when I'm like when I you know try to go crazy and yell or if I'm going to laugh or if I'm going to poop or whatever you know what I mean? Like yeah. Yesterday it hurts to poop because I love pooping. It's like no it was very it was very well you know how I how much I blow my nose and I can't do that even. Well it's like I can do it all but you have to like psych yourself up. Cause like last night so if you don't and",
      "start": 5301.32
    },
    {
      "text": "was very well you know how I how much I blow my nose and I can't do that even. Well it's like I can do it all but you have to like psych yourself up. Cause like last night so if you don't and none of this makes sense to you by the way sorry we did PAX of Mania. We always do at PAX or at PAX East. We always do PAX of Mania PAX Rumble at PAX Prime. And at the end of PAX of Mania Dan or a whole bunch of people dropped elbows on me and I'm pretty sure Dirty Dan Reichert landed right on me and fucked up my ribs. And like I laid there and went fetal position right after his elbow. So I'm pretty sure that uh so I've been in a world of hurt for awhile that I totally did to myself and I don't regret. And I don't blame anybody. It's it's on me. But uh last night we sued Dan Reichert. I probably will. I have some cool things planned out for Prime built around this. But uh when I got home last night went to the bathroom no poop. I didn't know this but this is a",
      "start": 5329.88
    },
    {
      "text": "Dan Reichert. I probably will. I have some cool things planned out for Prime built around this. But uh when I got home last night went to the bathroom no poop. I didn't know this but this is a morning development. And then lay down in bed and put on the West Wing. I'm like I'll watch one West Wing see what's happening with the Bartlett administration. Then on the hot off and I finished on my good. I'm going to go to bed. And I turned I turned off the PlayStation turned off the TV and I rolled over to plug in my phone. I'm like Nope no that's not. I just put the phone in the thing. And then I was like fuck how am I going to sleep? I cause I sleep on my stomach you know head turned or whatever. And I tried to roll it and it's like I'm like Nope I just I just slept. I didn't move. It was like it was like I fell from the air and landed in the bed. Reminds me when I broke my collarbone. Like you don't realize like how much you use it until you until you can't move.",
      "start": 5363.08
    },
    {
      "text": "move. It was like it was like I fell from the air and landed in the bed. Reminds me when I broke my collarbone. Like you don't realize like how much you use it until you until you can't move. Yeah. And without being I remember I couldn't even get in and out of cars whenever my car won't take a month. It was like awful. Yeah. But I was like but the whole thing is with this is just psyching yourself up. You know what I mean? Like today when it was like I got to get out of bed it was just like the you do like you're trying to do it slowly. No you got to do like that. It was like scream and sit up and turn and you're fine. You're out of bed. Yeah. That brings me back man. I remember I remember being so much pain when that happened that I almost I was going to pass out and it and that's why I know it's not broken. I can breathe in. I can breathe deep. I'm not like I remember my dad they gave me codeine when it happened and my dad immediately took it away from me. Like you",
      "start": 5394.28
    },
    {
      "text": "that's why I know it's not broken. I can breathe in. I can breathe deep. I'm not like I remember my dad they gave me codeine when it happened and my dad immediately took it away from me. Like you don't need this. I'm like thanks dad. Thanks for dying over here. A vote of confidence in your son. Colin. Yeah. Emperor Wu wrote in the kindafunny.com/PSQ and says Hey guys what are your favorite games to play dress up in? One of the reasons why I love the Soul slash Bloodborne games is that there are always dozens of clothing. That's what he writes. You can pick and choose pieces from to make your perfect outfit. And I think that having that kind of customization is severely underrated in video games. I feel what jumps to you. You don't care. I don't like that stuff. Why don't you just whatever it is used to fall character out and go yeah. I mean it's just like you tell me your game. I love doing it in like so what I what I think of recently was Division. Division at pretty",
      "start": 5426.76
    },
    {
      "text": "you just whatever it is used to fall character out and go yeah. I mean it's just like you tell me your game. I love doing it in like so what I what I think of recently was Division. Division at pretty much at the end of every night when we'd be winding down or whatever. I'd go into the shop buy some new stuff see what I collected and switch out a new outfit and change it up and I don't know. I don't once I usually pick out characters outfit is what it's said as but I guess like that's a bit of a cop out because usually pick them up for like Mass Effect. You know what I mean like I picked what Commander Shepherds like chill clothes were and this that and the other end fuck with it after that or whatever. Yeah I just I just don't like customization like that. I don't like character creators. The big like Shepherd is is the guy Shepherds you think of for me like that's that's my Shepherd is the the guy with the face. Mine's the little scar who then they just made the look like their",
      "start": 5463.8
    },
    {
      "text": "The big like Shepherd is is the guy Shepherds you think of for me like that's that's my Shepherd is the the guy with the face. Mine's the little scar who then they just made the look like their female which is weird because everybody ended up with that redheaded female before she was even the real fem chef but now she's a real fem chef so great. However underrated game that are in terms of customization was always Hot Shots on Hot Shots Golf on PSP. So amazing I remember railing on tennis for it and then the PlayStation 3 version of Hot Shots Golf for taking that out and even Hot Shots Vita was the same deal because like Hot Shots PSP World Tours right yeah Hot Shot no open T open T one and two you could go through and you could just get all these different pieces and make your own character that was awesome in a hula skirt and you know had the crazy glasses and the coconut bra and like you did all this crazy cool shit with it it was like that that was fun and that was why it mattered to",
      "start": 5498.84
    },
    {
      "text": "that was awesome in a hula skirt and you know had the crazy glasses and the coconut bra and like you did all this crazy cool shit with it it was like that that was fun and that was why it mattered to unlock stuff and when Hot Shots PS three showed up for golf. It was just like oh like I can change the color of these outfits. This is not nearly as cool so I really hope with the PlayStation for one that I'm looking forward to when it finally comes out the yeah that's even coming yeah. It is apparently coming clap hands all over call with Gravity Rush 2 yeah believe that when I see you know I'm saying speaking of believing when I see it glitching toas wrote in the kindafunny.com/p s q and says hey guys while back Twitch announced that we're going to create native apps for the PlayStation Vita. The PlayStation app is obviously the PlayStation for app is obviously out but there's been nowhere in the progress of the Vita version. Do you think this app will ever make it out",
      "start": 5536.04
    },
    {
      "text": "PlayStation Vita. The PlayStation app is obviously the PlayStation for app is obviously out but there's been nowhere in the progress of the Vita version. Do you think this app will ever make it out of production or should I give it my dreams of watching Twitch Twitch streams on my Vita probably abandon all of your hope glitchy toast. You have news on that specifically or just no no. I'm just telling him straight up. That's how it goes. Remember your PSP GPS remember the Vita YouTube app that's now shuttered and you can't even use don't worry about it. It's over. It's just you're not getting any apps like that to your Vita. You got to give up glitchy toast. I'm sorry. I know this is hard to hear but here on Vita Island. We have no room for the bullshit. We got rid of near. We got order to YouTube. We said we don't want them just keep bringing us games. I don't care how old these ports are. Give me the oldest ports. You can give me the oldest port. You won't get me to us from Orky. I",
      "start": 5574.36
    },
    {
      "text": "YouTube. We said we don't want them just keep bringing us games. I don't care how old these ports are. Give me the oldest ports. You can give me the oldest port. You won't get me to us from Orky. I want to port his work whatever the fuck that game is called from 1978. Oh God it hurts so bad. Ah Colin. Yeah. I'm looking for the final question of the show. I'm gonna let you pick business of the video games industry Uncharted for spoilers storytelling and video games business. Sick of talking about Uncharted MWM five four six one says hello Colin and Greg. Hello. Many times in your shows you guys discuss tips and advice you have for individuals who want to do content creation and similar work to what you do. My question is regarding a topic I feel somewhat neglected. What are tips and advice you have in studying and getting into the business of the video games industry? I'm not talking about developing video games the technical aspects of video game creation but the actual",
      "start": 5615.72
    },
    {
      "text": "and advice you have in studying and getting into the business of the video games industry? I'm not talking about developing video games the technical aspects of video game creation but the actual business of the industry. Colin often notes that he thoroughly enjoys the studying the business aspects of the industry. Do you have any resources you can recommend to study the business of video games and an avenue in entering the business side of the industry as a CPA in accounting? I love studying the numbers in various aspects of successful businesses and I hope one day to play a role in the video game creation from a business perspective. Thank you all so much for what you do. I really enjoy the content and wish you the best as you grow Kinda Funny. So he's talking about resources like not college but resources as in like sites and stuff like that. That's what it strikes me as in terms of like where he could go to learn about being on the business side of the video game industry.",
      "start": 5663.64
    },
    {
      "text": "not college but resources as in like sites and stuff like that. That's what it strikes me as in terms of like where he could go to learn about being on the business side of the video game industry. Because he has a CPA in accounting so he's already he's already there. So I think it's yeah he wants to know what to do there. I mean there are websites so like Games Industry and Gamasutra and stuff like there are game politics there are game sites that are like way off the radar that you probably don't read or have ever heard of that deal more in the business and creation side of games as opposed to like they're more for developers or publishers than they are for the consumer or the enthusiast. So I think that you just start there. I also think that a lot of forums kind of get into these things and a lot of people talk about VG charts. Let's remember VG charts numbers are totally fucking made up. What you really need to do is like go to like more you know analysis driven stuff.",
      "start": 5703.0
    },
    {
      "text": "these things and a lot of people talk about VG charts. Let's remember VG charts numbers are totally fucking made up. What you really need to do is like go to like more you know analysis driven stuff. NeoGAF kind of gathers those around sometimes. People like Michael Pachter often talk in EDAR and a lot of these organizations deal more with the business aspects and the ramifications. The difficult thing is that a lot of the publishers and first parties just don't talk about numbers. So a lot of it is hypothetical and that's why VG charts is at the very least interesting. You just can't teach it as treated as scientific evidence. They're basically they basically I think use algorithms. If you're talking to me he's talking a little bit about working on that side. I mean I don't I don't think it's beyond the realm of reason to reach out to people who are at Naughty Dog and not hound them obviously but to talk to an HR department at a Naughty Dog or whatever and how do I get on that side",
      "start": 5745.08
    },
    {
      "text": "think it's beyond the realm of reason to reach out to people who are at Naughty Dog and not hound them obviously but to talk to an HR department at a Naughty Dog or whatever and how do I get on that side because I know at IGN we saw it a couple times where I. G. And fans who didn't want to be I. G. And editorial or whatever would go into other departments of I. G. N. And it was a it was a. Resource for them it made them stand out from the pack that they actually understood what they what the site was and who they were. I assume it would be the same on a development side of video game creation side. If you went to Blizzard or Harmonics or whatever and were like I'd love to be on your business accounting team and I totally get what you do and how it happens. Yeah I think so. I think those are some resources you can preliminarily go to and check out and I want to be clear with the G charts. I don't mind that they exist and people use them as a resource. I just want to make sure that people",
      "start": 5778.44
    },
    {
      "text": "some resources you can preliminarily go to and check out and I want to be clear with the G charts. I don't mind that they exist and people use them as a resource. I just want to make sure that people understand like what I know like off the record what a lot of games are not a lot but like games have sold and their numbers are totally wrong on a lot of those games. So it's it's like you just have to. Take it with a grain of salt. You know it's it's there is like maybe a round kind of ballpark figure but not often right. So just keep that in mind because people throw those numbers around all the time and I'm like guys like that's not that's not possible. These guys numbers have never been announced. There's no way they can possibly know this is true. Colin would you like to find out who you love this week? I guess I have to. PS I Love This Best Friend XOXO is a segment here on PlayStation. I love you XOXO where we give you a best friend a fellow best friend who has a PSN name that",
      "start": 5819.0
    },
    {
      "text": "you love this week? I guess I have to. PS I Love This Best Friend XOXO is a segment here on PlayStation. I love you XOXO where we give you a best friend a fellow best friend who has a PSN name that needs friends needs loving messages. This one is Delarius T who says Hey guys new listener new to the PlayStation family. I recently switched over from Xbox one of the PlayStation four. It was one of the best decisions that I've ever made in my life as a gamer. However the majority of my friends have moved on to other ventures in their lives damn both on a personal level and a gaming level. I only have a few people that I game with now after I got introduced to Kinda Funny. I discovered this wonderful method of acquiring new PSN friends. I like to play Bro Force Rocket League and in the near future No Man's Sky. My PSN name is Delaria or Delarius. It's like hilarious but with a DY in front of it. So I'm sure he's like Dylan. So it's like D Y D Y. Now there's D Y L I R I O U S T.",
      "start": 5854.04
    },
    {
      "text": "near future No Man's Sky. My PSN name is Delaria or Delarius. It's like hilarious but with a DY in front of it. So I'm sure he's like Dylan. So it's like D Y D Y. Now there's D Y L I R I O U S T. Wait but it hilarious. It's isn't it hilarious? H Y L or H. I'm saying what I think. I mean am I getting it wrong? I want it. This is also a bad. It's just just just you know I'm saying it doesn't D Y. I know L I R I O U S T to everyone. It Kinda Funny. Thank you for your hard work and creating countless hours of fantastic entertainment possibly delirious tea. If that's not how you pronounce your name as spoiler alert you have a fucking terrible name. Oh just spoiler alert. If somebody like a moron like Greg Miller can't read it that's a problem. I'm going to jump into the worst name of the week because I feel like we've teased it enough. Now this one comes from Kevin Perez. Of course PSN's worst name of the week is a name that you have that you have that you regret and wish",
      "start": 5899.16
    },
    {
      "text": "of the week because I feel like we've teased it enough. Now this one comes from Kevin Perez. Of course PSN's worst name of the week is a name that you have that you have that you regret and wish you. Hey you should it would let you change. This is a long one pack of lunch. You ready? Yeah. Kevin says Oh how this form reminds me of the dark times in my past. I remember when I attempted to create a unique PSN name it did not go well for me at all. I spent hours contemplating what it should be. Should it be something funny or something clever or perhaps something that just sounded cool after hours of standing in front of the screen attempting names that have already been taken. My mind went to a time. My brother under three 16 found himself in the same situation. My brother had decided to make his live live name and came up with M. I assassin parentheses M. I a parentheses Miami and parentheses assassin. It's a combination of Miami and assassin so it's M. I and then a sass. A is",
      "start": 5947.4
    },
    {
      "text": "to make his live live name and came up with M. I assassin parentheses M. I a parentheses Miami and parentheses assassin. It's a combination of Miami and assassin so it's M. I and then a sass. A is that you know I mean now my brother always complained about the name but I never paid attention to why I quickly learned the reason in my time of me that took this idea and use it for my PSN name. It was a mistake. I play a lot of military shooters so I chat a lot. The Internet can be very cruel. My first game in somebody attempted to say my PSN name and they said verbatim Hey my ass. Wow that's terrible. I did not think anything of it but then they kept coming. It seemed I made a mistake in assuming that people would know that my that I'm Miami assassin. I spent years with that name taking the abuse of people of people calling me my ass until I could not take it anymore. I left behind the account with the PS three and took over a new name of psycho sicko which is the user name I",
      "start": 5986.44
    },
    {
      "text": "the abuse of people of people calling me my ass until I could not take it anymore. I left behind the account with the PS three and took over a new name of psycho sicko which is the user name I use now for most stuff which is also bad. Yeah it's also a S four but I would love to have my old account that I used for so long back shoe. Hey please let me change my name sincerely. Kevin Perez Aka Psycho sicko Aka my ass. Thank you for that. Appreciate that. Thank you for letting us bask in your bad names and your misery. You and delirious tea on a little boat will even be the island time of this week's forgotten PlayStation game. It's my turn to go but instead shipper showed up on kindafunny.com/p s q and left this one for you. Hey guys I'd like to submit Skull Monkeys. The PlayStation one exclusive for the PlayStation forgotten game. When I was young I discovered this game at a video game daycare. He put that in quotes at a video game game daycare. I want to know",
      "start": 6034.92
    },
    {
      "text": "The PlayStation one exclusive for the PlayStation forgotten game. When I was young I discovered this game at a video game daycare. He put that in quotes at a video game game daycare. I want to know that was engrossed by the dark tone clay art style and bizarre world but never played it again. It wasn't till fifteen years later that I found it and how weirdly awesome that game is. Thanks Daniel. I don't what the fuck is a video game daycare? That sounds like don't even answer the question. I want to know mom just drops you off at some weird weirdos house. They video games. You just do that for eight hours and they smoke joints in the side. Sure talk about dank yarn. Thank you are no nugs. You grind out trophies for them that we should open a video. You write out trophies in your mind up the dank yarn of nugs. Is that what you do with the news? I wouldn't know. Do you put them in the suicide hall? I don't know. I don't know anything else about it. Ladies and gentlemen this has been",
      "start": 6087.04
    },
    {
      "text": "the dank yarn of nugs. Is that what you do with the news? I wouldn't know. Do you put them in the suicide hall? I don't know. I don't know anything else about it. Ladies and gentlemen this has been PS I Love You. XOXO episode thirty three. Remember we love you very much. Thank you so much for watching this. We post the show every Tuesday at nine a.m. Pacific time covering all the PlayStation news. You need to know about please go over to kindafunny.com. Subscribe to all the YouTube channels. There's only two of them. I don't say all of them. Just go there. Watch the videos. Listen to the podcasts. Enjoy the content. Watch Colin and Greg live. Come to my birthday stream on Wednesday. If it's not too late already twitch.tv such Kinda Funny games will be playing something on PlayStation from one to five. They'll be the giveaway stream Friday twelve thirty to one thirty and of course Collins. AMA is it kindafunny.com/AMA Friday one to two. What do you like to ask",
      "start": 6124.88
    },
    {
      "text": "from one to five. They'll be the giveaway stream Friday twelve thirty to one thirty and of course Collins. AMA is it kindafunny.com/AMA Friday one to two. What do you like to ask questions about call to call? He said he wouldn't on this show talk about the Neo anymore. I'm gonna take this. Can you bring it in every week? Don't to put it. I just need a new controller. That's fine. Yeah. Didn't you kidnap one of mine? Yeah sure. Can I get that back now? I think I might broken that one too. God damn it. Oh my goodness. Ladies and gentlemen every episode of PSI love you. XOXO ends in a song in a segment we call singing a shoe. Hey this is where one of you insanely talented people go to kindafunny.com/PSM the Mr Music and submit your song. Remember I need an MP three to download so I can put at the end of our MP three and a YouTube link to annotate to at the end of our YouTube. I didn't realize the face buttons were different. Yeah. XOXO. That's smart. I never",
      "start": 6157.96
    },
    {
      "text": "to download so I can put at the end of our MP three and a YouTube link to annotate to at the end of our YouTube. I didn't realize the face buttons were different. Yeah. XOXO. That's smart. I never that's this. I'm telling you man color controllers knows what's up. That's pretty cool. What up? College control. That's pretty cool. I was looking at him like what? Something's wrong. Where's the square and the triangle button? This one comes from Icelando from the band the Oregon Beats. Hey Colin and Greg. Long time. First time stoked to be writing into you guys. First I just wanted to say thank you for all you do. Can't tell you how much I've enjoyed your content over the years and I look forward to much more. My band the Oregon Beats just released a new EP and music video today and I really wanted to share it with you guys. We are a Boston based power pop quartet with heavy eighties rock influences. My little sister and I started out with our first record back in 009 and it",
      "start": 6200.24
    },
    {
      "text": "I really wanted to share it with you guys. We are a Boston based power pop quartet with heavy eighties rock influences. My little sister and I started out with our first record back in 009 and it produced various releases since she is the lead singer slash guitar player and I am the drummer. Prior to this she Noel was in a band called Damone. I said what do you think? The moment I would say who actually had some commercial success relative to movies and video games. Their songs were featured in games like Tony Hawk PS Madden 07 and Rock Band. Recently she even performed on Amplitude as one of the main female vocalists featured in the game. I traveled the world with the band as tour manager and needless to say it was an amazing experience at the time. Since then we've kept ourselves busy musically and creatively. I'm really fortunate to have such a working relationship like this with my sister as we've been able to create a lot of content that I'm proud of. Our EP's title",
      "start": 6235.48
    },
    {
      "text": "busy musically and creatively. I'm really fortunate to have such a working relationship like this with my sister as we've been able to create a lot of content that I'm proud of. Our EP's title track quote only human is a sonic nod to the Foo Fighters and the video was inspired by Kung Fury. This was our first experience shooting a video done 100% on green screen. Also my first experience being turned into a human centarpede centarpede. He's a centaur and then the pea like centipede. All right I hope you guys dig it. Yours truly Ice Lando from the Oregon beats music.com. I did dig it. Here it is everybody. Only human from the Oregon Beats until next time. It's been our pleasure to serve you.",
      "start": 6277.12
    }
  ]
}
