{
    "id": 5002,
    "video_id": "W7QE3fY0oog",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Austin Creed",
        "Kyle Feduniw"
    ],
    "title": "If You Have Amazon Prime, You Have Twitch Prime - Best Kinda Funny Moments Animated",
    "description": "Animated by https://twitter.com/KyleFeduniw Intro by Cameron Kennedy.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\r\n\r\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\r\n\r\nCheck out our store! http://www.kindafunny.com/store\r\n\r\nFollow us on Twitter!\r\nGreg - http://www.twitter.com/GameOverGreggy\r\nTim - http://www.twitter.com/TimGettys\r\nNick - http://www.twitter.com/Nick_Scarpino\r\nKinda Funny - http://www.twitter.com/KindaFunnyVids\r\n\r\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.\r\n\r\nMusic by Tonedeff - http://www.QN5.com",
    "published_at": 1587992415,
    "duration": 76,
    "transcript_chunks": [
        {
            "text": "just because it's more most of our stuff is no I don't let you know you this cuz of course Amazon Prime if you have it and I know you do I know right now Ted you're driving your car and you're like I don't watch it on Twitch I don't need to help them but I know you have Amazon Prime Ted don't make me crawl out of this [ __ ] speaker and get into the passenger seat you don't turn to you and go guess what we're in a bloodless marriage now and I become flies in the car and the whole car is full of flies dad you only does that what you want you don't fall over give me your twitch Prime subscription you son of a [ __ ] remember if you want to be part of the show you can tip us five dollars our above or five hundred bits yes your chip let's subscribe I do I get more flies with the honey if they say you know that's what is vinegar I don't know I don't know the catchphrase okay the Flies won't leave please subscribe I know you got Prime everyone's got it",
            "start": 5.32
        }
    ]
}