{
    "id": 2504,
    "video_id": "ranAwGmRIvI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello",
        "Stu Byus"
    ],
    "title": "Nick's Childhood Best Friend (Special Guest) - The GameOverGreggy Show Ep. 172",
    "description": "Nick's best friend Stuart Byus joins us to discuss cars, Nick stories, and nightly rituals. (Released first to Patreon Supporters on 03.17.17)\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/greggy\n\nCheck out Wheelie Cool Videos: https://www.youtube.com/channel/UC8oap2DZlaSe_NHVb59lPMQ\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1490360829,
    "duration": 6570,
    "transcript_chunks": [
        {
            "text": "This episode of the Game Over Greggy Show is brought to you by Dollar Shave Club. There's no reason to use a cheap disposable razor or pay a ridiculously high price for gimmicky unnecessary nonsense. Make the smarter choice and join Dollar Shave Club. The key to getting a fantastic high-quality shave at an affordable price. And right now, they're giving away a one month trial of any of their razors for $1 with free shipping. How do you know these are good? Tim Getty's been using them. He's trimming up this whole section. Because you might say, \"Tim Gettys has a beard. What's he doing?\" But I guess if you have the beard, you still have to keep it in check. I wouldn't know because I'm like 13 when it comes to facial hair. There's no long-term commitments, no hidden fees, and you cancel whenever you want. Get your $1 trial at dollarshaveclub.com/gregy. That's dollarshaveclub.com/greggy clean. That's not their catchphrase. I just made it up. [Music] What's up everybody? Welcome to the Game",
            "start": 0.08
        },
        {
            "text": "you want. Get your $1 trial at dollarshaveclub.com/gregy. That's dollarshaveclub.com/greggy clean. That's not their catchphrase. I just made it up. [Music] What's up everybody? Welcome to the Game Over Gregy show. And before we go any further, you probably know Colin Morardi has left kind of funny. If you didn't, surprise. We're breaking the news that way. Here's your birthday present. We did a whole We did a Kind of funny morning show explaining all this on March 13th. You can catch it there as a podcast or whatever. there. We said on the next game over Greg show Colin was going to join us do one final episode. Colin has asked to delay it. He's a lot of balls in the air knowing him there's a lot of balls all over the place with him but he's figuring out some things and he wants to come in and do one thing that he would like to think I think being a little bit about the past and what we've done and where he's going on top of that. So that's why he's not here now. Nothing's wrong.",
            "start": 38.56
        },
        {
            "text": "in and do one thing that he would like to think I think being a little bit about the past and what we've done and where he's going on top of that. So that's why he's not here now. Nothing's wrong. Everything's cool. Chill out everybody. I just wanted to be up front and get out of the way. Over here the producer/seducer Nick Scarpino. Hello Greg. Hello. How are you? I am warm. It's nice and warm outside. It's not too hot. It is too hot. It's about 10° too hot. So, you guys don't understand. We'll get to We'll get to the the gentleman sitting over here. You guys understand the virtue of the heat outside. We could barbecue right now. We could drink all night right now. We could just sit outside. It's going to be fantastic. Over there, the pure one Tim Gettys. I'm all hot and sweaty. Let Tim host. Put the fan on. I'm drinking water. It's like styrofoam. It's a whole I hate when the ice does that, right? Change your filters. Yeah. Well, that's a Kevin job. I'm not But that's the thing is",
            "start": 95.2
        },
        {
            "text": "host. Put the fan on. I'm drinking water. It's like styrofoam. It's a whole I hate when the ice does that, right? Change your filters. Yeah. Well, that's a Kevin job. I'm not But that's the thing is like Yeah. When we went out there and we drank the beers during the morning show today, that was a lot of fun. Sure. But then it's like, all right, now it's just too hot in the building. Now I'm just hot. It's just no fun. I'm all sleepy. Yeah. And joining us in a Tim Ash shirt. I love it. Ste, look at them shits. How's it going, guys? Get on that mic, Ste. Now, Steu, you've This is your first appearance on the Game Over Greg Show, but literally every story Nick tells somehow involves you. Buddy Stew. I love it because two of our very close friends, Nick Scarpino and Sean Finnegan, they exclusively describe their friendships with Sean Finnegan's buddy Laney and Nick's buddy Stew where it's like the word buddy is it's it's kind of like those those guys like Mike Pope, you know, where it's",
            "start": 131.52
        },
        {
            "text": "describe their friendships with Sean Finnegan's buddy Laney and Nick's buddy Stew where it's like the word buddy is it's it's kind of like those those guys like Mike Pope, you know, where it's like you got to refer to him the first and last name like they have that thing going, but you are just my buddy Stew. Gotcha. That's right. Nick and I met in uh middle school. Yeah. We've been friends ever since. Ever since seventh grade is what you said earlier. Seventh grade 1962. We'll get to that story. Yeah, that's a fantastic story. One of my favorite stories. I can tell it now or we can wait. I want to get I mean the first thing is obviously you. So in case you didn't know, ladies and gentlemen, this is the game over Greggy show each and every week. Four, sometimes five best friends gather on this table, each bringing a random topic discussion for your amusement. If you like that, head over to patreon.com/kindfunny where you get each and every episode early along with a bunch of exclusive",
            "start": 173.44
        },
        {
            "text": "this table, each bringing a random topic discussion for your amusement. If you like that, head over to patreon.com/kindfunny where you get each and every episode early along with a bunch of exclusive goodies and perks. But if you have no bucks to toss our way, no big deal. Head over to youtube.com/kindfunny where we post the entire show topic by topic, dayby day until it goes up is one big video and MP3. Stu, how the [ __ ] did you meet Nick Scarpino? All right. So Nick and I went to different elementary schools. He went to the rich kid elementary school in the new part of a lot. Explains a lot. The rich kid was the newer elementary school. The richer part of Riverside. So it was a Well, yeah. Um I went to a different school. So we met in Sorry. Don't be afraid of this. Get on this thing. move it with you. Okay. Check one, two, work the shaft. So, we met in middle school where our two elementary schools joined. Uh, now in summer school leading up to middle school, I had a class. I was",
            "start": 211.76
        },
        {
            "text": "move it with you. Okay. Check one, two, work the shaft. So, we met in middle school where our two elementary schools joined. Uh, now in summer school leading up to middle school, I had a class. I was in pre- What were you in? I was in pre-alggebra. Uh, health sciences. So, you weren't being you weren't in trouble. You were just going to school for fun. Pre. No, here's what happened. Summer school is when you you [ __ ] up and you got to take that. Nick and I are both dorks. We were in bands. Summer school for the nerd kids means something different. That's when you get to keep hanging out with your friends. But it ended up being chick crazy. So I was crazy. I was a seventh grade chick crazy. That's right. I was a dork in elementary school. I was a gate geek in the accelerated gifted and talented education. Yeah. They they got rid of that. All the other kids made fun of me. Gate geek. That's what we were. So I had no chance of any girl the whole time I was in elementary school. In",
            "start": 251.12
        },
        {
            "text": "talented education. Yeah. They they got rid of that. All the other kids made fun of me. Gate geek. That's what we were. So I had no chance of any girl the whole time I was in elementary school. In fact, leaving elementary school, we had a dance. This is starting already to explain so much about you. Leaving elementary school, I had to dance. I asked the girl who I had a crush on to dance. She said no. I went home. Didn't dance. You had elementary school dances? Yeah. That sounded crazy. I want to say like Yeah. We didn't have a dance until like seventh grade. There was one girl that had boobs in fifth grade and that was weird. So on that note, I was dating that girl, right? In fifth grade. I was sixth grade going into seventh grade. Okay, that's there was a girl that I was I mean I was sixth grader as well. So we're dating and I was like I'm in love. And what does dating mean to you? In sixth grade up the street for me. The whole point at at when you were in sixth grade for me was to",
            "start": 288.0
        },
        {
            "text": "grader as well. So we're dating and I was like I'm in love. And what does dating mean to you? In sixth grade up the street for me. The whole point at at when you were in sixth grade for me was to try and and figure out how you can make out with this girl. It was just about making that's all like you just we would fantasize about it and you know when you're a kid this is this was the first time I ever had a huge crush on someone. She was smoking hot. She was smiling hot. She is she has stepped off and she got even higher sports illustrated. She did you what's worse about it is we'll we'll we'll tell the aftermath of the story in a second but but so anyway I was dating this girl in sixth grade end of sixth grade and this is great. I had asked her to go out with me, right? Which meant that she was officially my whatever girlfriend was right. When Hold on. When did your elementary school end? Sixth grade is elementary school. Seventh grade is where junior high starts first. Got it. See",
            "start": 328.56
        },
        {
            "text": "she was officially my whatever girlfriend was right. When Hold on. When did your elementary school end? Sixth grade is elementary school. Seventh grade is where junior high starts first. Got it. See for us fifth grade is where elementary school ended. So that's why I'm like there's no dance in fifth grade. Summer school leading into seventh grade. I have a class with his current girlfriend and her other couple friends. Sure. That are also smoking hot. Yeah, they were smoking hot. So, and I'm the new blood. So, here I come. New blood. Dorky little geeky stew. I was like I was 53. I'm 6'3 now. I was 5'3 until I was like um 16. So, I was the short little guy. Very fair skin. They call me Were you pudgy? Were you pudgy like Nick? No, you were real. Not as pudgy as Nick. I was pudgy. But you slipping my shirt off like check it out. Um he did in high school though. We got a little jacked down. We'll get to that later. So, I'm new blood in the um summer school class and they all fawned over",
            "start": 369.76
        },
        {
            "text": "my shirt off like check it out. Um he did in high school though. We got a little jacked down. We'll get to that later. So, I'm new blood in the um summer school class and they all fawned over me, loved me. I couldn't freaking believe it. And all of a sudden, excuse me, Nick's girlfriend wants to go out. Sixth grade me. Yeah. And I'm like, \"Oh, yeah. Let's But she's in a relationship with Nick.\" Yeah. But I don't care whatever that guy stories. He's a jerk. He's this and that. Committed relationship with me. I think we're getting married. We are well on our way to like 2.5 kids and picking fans, the whole thing, right? I don't know. I love this girl. I never met Nick before in my life. So, I'm like, \"Oh, screw him. [ __ ] this guy.\" Yeah. Who is Yeah, I'm I'm your guy. So, I get I can't remember how the bad news was broken to me. Well, first of all, I should say the first time. So, I'm like I'm now with her and then I see Nick like at snack time or something, whatever in summer school.",
            "start": 411.36
        },
        {
            "text": "how the bad news was broken to me. Well, first of all, I should say the first time. So, I'm like I'm now with her and then I see Nick like at snack time or something, whatever in summer school. I'm like, \"Oh, that's your ex-boyfriend. That dude right there. He looks like Steven Sagal.\" He's gonna like, \"Oh my god, don't put that in his head.\" Oh, he does. He did. [ __ ] loved it. I loved it. So, that's that. But at this point, I was taller than Stu, too. Oh, yeah. Cuz like I I think I had a good couple inches on him. I had I definitely had probably like 15 20 pounds on you. Um so I was scared of Nick and then two weeks later she dumped me. Yeah. So let's before we get to that, sorry. We I get the news broken to me. I'm heartbroken. And obviously I How did she break the news? I can't even remember. I just I think it was just like a quick conversation in passing cuz I mean again this love affair had taken place over the span of maybe a month and a half. It wasn't like I had been dating",
            "start": 451.2
        },
        {
            "text": "remember. I just I think it was just like a quick conversation in passing cuz I mean again this love affair had taken place over the span of maybe a month and a half. It wasn't like I had been dating her for years. It was end of sixth grade. I think I like you. We maybe got close to making out. We sat on my lawn for a little bit and then summer school started and all of a sudden it was like I don't like you anymore. I'm going with this guy. Right. And I was like, who the [ __ ] is this blonde [ __ ] and I'm going to kick his ass, right? And all my other friends like you should definitely kick his ass. I'm like, yeah, shadow box. I I don't think I shadow box dead. But actually, at no point at no point at no point in my in this time was I like I'm gonna get into a fight with this guy. I was I was crushed. I was heartbroken. Now, we had this other friend Todd, our buddy Todd, who was my friend. His friend came and he was he was a big same size if not bigger than than he was. He was",
            "start": 490.8
        },
        {
            "text": "I was I was crushed. I was heartbroken. Now, we had this other friend Todd, our buddy Todd, who was my friend. His friend came and he was he was a big same size if not bigger than than he was. He was definitely like I remember him just being ogishly tall and he would just stare at me, right? And he used to wear this gigantic he had this big ass Eagles Philadelphia Eagles like like one of those things you wear to the games. So like starter jacket you could fit like 12 packets. They're like long Oh, like the long winter coat felt inside. So you wear them like hot. So anyway, he looked like Bruce Willis from that [ __ ] Might Shyamalan. Unbreakable. Yeah, unbreakable. And he was terrifying. And I heard like people used to sell rumors about him that he like used to like do crazy [ __ ] like steal Crystal Pepsi. So he would go to like store CVS and he was stealing Crystal Pepsi. I'm like going to kill me and he was like hella mad doggy. Right. So the beginning so I was like I don't like",
            "start": 525.36
        },
        {
            "text": "steal Crystal Pepsi. So he would go to like store CVS and he was stealing Crystal Pepsi. I'm like going to kill me and he was like hella mad doggy. Right. So the beginning so I was like I don't like any of this thing. And then I think it was I think your timing like I think summer school ended. Okay. And when we got back, like when the year started, I found out that she broke up with you, right? And I started dating Spencer. Remember Spencer? [ __ ] Spencer. And Spencer dated her for like two years. Like And Spencer was like this little dude. He was even smarter than both of us. He was fine. And he had this cool Adidas jacket cuz he was a soccer player. And everyone was like, and it like started a whole trend. It started a whole trend of all these people. And I even at a certain point was like, I had to buy one. I got to get one. I got to get one of these [ __ ] jackets. And uh so I I think I can't remember how it worked out, but I think it was Miss Wley's class. Yeah. where we were",
            "start": 561.2
        },
        {
            "text": "like, I had to buy one. I got to get one. I got to get one of these [ __ ] jackets. And uh so I I think I can't remember how it worked out, but I think it was Miss Wley's class. Yeah. where we were sitting around and I was like, \"Hey man, I'm sorry that she broke up with you.\" And you were like, \"I'm really sorry that she broke up with you to date me, but you were also like, but you know, I got st.\" And I was like, and then Todd was like, \"Does anyone want a Crystal Pepsi?\" And and it ended up being like, \"Right, it ended up just we we all three of us became best friends from that point on.\" Like still to this day, like we like we still talk. It's crazy. I've never heard about Todd. I've never heard of Todd. Todd's not one of your best friends. Well, Steu Ryan was in this circle as well. So us Todd and I were really good friends until after high school and then we fell fall you talk to Todd every once in a while. Uh no we've fallen out too a little not for any reason just normal life",
            "start": 598.72
        },
        {
            "text": "So us Todd and I were really good friends until after high school and then we fell fall you talk to Todd every once in a while. Uh no we've fallen out too a little not for any reason just normal life stuff. He finally got he finally got pinched getting another Crystal Pepsi when it came back. It ended up being crazy cuz in that class was Stu Todd and my buddy Ryan who you guys have met all the time. He works at Blizzard now. He's the one that got me the job at IGN. And he's the one that like he I I vibed with him because he was playing the the rootech role playing game. And so we all started doing the thing where like the coolest group of guys seventh grade had ever seen. I didn't play the role playing game. I don't want to make myself sound less cool or more cool by saying I just want to be honest. Sure. All the facts on the table. I appreciate that. Yeah. I I appreciate that. But so also then the other thing that was the uh the kicker for all of us coming together was that we were",
            "start": 633.6
        },
        {
            "text": "be honest. Sure. All the facts on the table. I appreciate that. Yeah. I I appreciate that. But so also then the other thing that was the uh the kicker for all of us coming together was that we were all in band together as well. So I had started playing middle school band and high school band high school band. I started playing fifth grade then sixth grade. Then when I got into seventh grade we started the marching band together. So I was like, I am really glad that I like these guys because they're in every [ __ ] class of mine, including band. And when you're in band, you have band practice and all that stuff. And so like you just all your homies were from band. And you played drum line. Yeah, you were drummer in that as well, right? Did you respect? Did you respect him when he started leading the band? Oh yeah, dude. Nick, you got to We're going to get to that. Nick was I didn't mean to jump around. I didn't mean to jump around. I thought Nick was cool as [ __ ] I still think Nick",
            "start": 671.2
        },
        {
            "text": "leading the band? Oh yeah, dude. Nick, you got to We're going to get to that. Nick was I didn't mean to jump around. I didn't mean to jump around. I thought Nick was cool as [ __ ] I still think Nick was cool as [ __ ] but he was much less cooler than he is now. That's fair. Much less cooler looking, I should say. Like I was pudgy, super pudgy, but I thought he was badass. The shadow boxing, uh, that was for real. I was like his partner. I was like aspiring partner. He'd like come home from karate practice. He like, \"Yo, Ste, come over. I found some new moves. I want to try them out.\" I'm like I'm like, \"All right, cool. Cool. Have some Cokes, have some pepperoni sandwiches, and then go out out on the lawn. The breakfast of champions. Coke and pepperoni sandwiches.\" Stocked stuff. I know. Stocked. And candy, too. Lots of candy. All the candy. The Scarpino family of steak. We just had lunch and and I said, \"Nick, the longer I get to know you, you just get more and more Nick.\" And I",
            "start": 706.24
        },
        {
            "text": "Stocked. And candy, too. Lots of candy. All the candy. The Scarpino family of steak. We just had lunch and and I said, \"Nick, the longer I get to know you, you just get more and more Nick.\" And I love that it works backwards, too, where it's like, \"Okay, cool. We meet someone that knew you since you were 12.\" And you were just somehow even more Nick back then, too. Fully. This is fantastic. We were We were I mean, we weren't like, that's the thing. We never did anything crazy. We weren't like smoking cigarettes, stealing. Ste and I had our first few cigarettes together cuz my brother and his friends used to smoke and so he would let us party and like basically Ste was the other guy that had to clean up the party with me. So Stu would come over and like we would we would hang out with my brother and his friends who we all thought were like these amazing like adults even though they were shout out to Big Matt. Big Matt, you know, we were 13, they're 17 and we thought they were the",
            "start": 743.84
        },
        {
            "text": "my brother and his friends who we all thought were like these amazing like adults even though they were shout out to Big Matt. Big Matt, you know, we were 13, they're 17 and we thought they were the coolest [ __ ] people on the planet and that's why we started smoking cuz they smoked, right? Even though the first time I ordered Swisser sweet cigars did cuz I was a little scared to inhale. So I started out with the cigars. My dad smoked cigars. Felt more comfortable with the cigars. It was I didn't put anything in. I just smoked them. Uh like four 15. That's a good look for a 15year-old walking around. Yeah. Don't try them. No, they're terrible. Very tasty. We did that. Got to get over that bite. Sorry. We did that and we did uh cloves were next. Remember when we went through our cloves phase cuz everyone all the girls liked cloves. So we would be like, \"Oh, let's get past like, you know, we would we would share that and we'd have something to talk about.\" Um and student and I got kind",
            "start": 779.04
        },
        {
            "text": "cuz everyone all the girls liked cloves. So we would be like, \"Oh, let's get past like, you know, we would we would share that and we'd have something to talk about.\" Um and student and I got kind of got the reputation for being like the cloves guys. Well, we were like smokers. They were like, \"Oh, they're smoking like crazy.\" Like in high school it's like the Yeah. That was if you were smoking in high school, like I mean there was no one in my high school that smoked cuz we were a bunch of [ __ ] nerds. So it was just like if you did smoke, you were like, \"Oh shit.\" Like that guy is a [ __ ] badass. Like I don't even want to talk. Those band kids are badass. Yeah. See, I think I think the only reason why Steu and I smoked was to counteract the band. The band, you know, smoking was kind of conceived as cool, which is not, by the way, don't do it. But then band was like, let's just put it right back down to nothing. That's cuz I I went to school with band was the cool kids. Like if you",
            "start": 814.32
        },
        {
            "text": "conceived as cool, which is not, by the way, don't do it. But then band was like, let's just put it right back down to nothing. That's cuz I I went to school with band was the cool kids. Like if you if you were if you were an ROC, you were one of the you were one of the [ __ ] nerds doing ROC. My band was like supporting our country. You're [ __ ] making it. So to put it to put it in context, we went to a a very fascinating high school. It was a John W North High in Riverside, California. And uh uh go Huskys. And we it was a school that had the international baloria program. And what that was, it was like advanced placement uh classes that Stu and I would both take and as well as my other friends Ryan and Clay and Todd. Um all those guys would do that. But we also had it was also kind of um lower like income as well. So we had all these people that were super smart that would come all just for the international balorate. But then we had [ __ ] awesome sports like we would just",
            "start": 850.72
        },
        {
            "text": "of um lower like income as well. So we had all these people that were super smart that would come all just for the international balorate. But then we had [ __ ] awesome sports like we would just dominate the ball in basketball. Baseball was pretty good too. Like um Adam Kennedy who used to play for the Angels used to play on our team. Like he went to school with my brother and we went to school with his brother. Um he pulled the barbell off my chest when I was working out at Roman dying. That was nice. I was like I can't get it. He's like oh let me get that for you. I'm like what's up Adam? Um, yeah. So, thanks for saving my life, dude. So, the cool guys in our high school were the the traditional cool guys, the guys that like jocks. Yeah, the jocks. But the crazy thing was we had all since we had all it was this weird world where like I was in theater and and and and band and they would come to see the shows and they would like they would just like us like they weren't like going",
            "start": 889.76
        },
        {
            "text": "since we had all it was this weird world where like I was in theater and and and and band and they would come to see the shows and they would like they would just like us like they weren't like going out of their way to hang out with us, but we never got picked on. No one ever gave a [ __ ] Like they were like, \"Oh, these guys are just a band.\" It was it was I [ __ ] you not one of the only experiences that I could even imagine where like the football team would like applaud for us when we came off the field and they were like good job guys. That's true cuz we had that good we had the awesome cadence. We had a really good drum line. Oh yeah. And then we would sit up we stand like and they would be like they like you know like that and just go and destroy people on on so it was actually a very positive experience. Yeah. None of the jocks had any problems with us until you try to take one of their girlfriends or something like that. No, he wasn't a jock. He had friends that were jocks",
            "start": 925.2
        },
        {
            "text": "very positive experience. Yeah. None of the jocks had any problems with us until you try to take one of their girlfriends or something like that. No, he wasn't a jock. He had friends that were jocks and that was he a soccer player. All right. Let's uh rewind. Okay, Nick, what happened? So, Ste will attest to this. My freshman year, freshman year band camp, I fell in love with the girl. Freshman year band camp. This one time at band camp. This literally this one time at band camp. We This is the f obviously you're starting high school. This is your first time in high school. This is three weeks before the school starts. We did do summer school. That was that was just for junior high. And so I we start band camp, which traditionally I think was two weeks before the school year was supposed to start, right? And we meet all of the people that are in band. And it was my first time meeting anyone that was like, you know, when you're in eighth grade, you're like, we're the king of [ __ ] And",
            "start": 959.36
        },
        {
            "text": "start, right? And we meet all of the people that are in band. And it was my first time meeting anyone that was like, you know, when you're in eighth grade, you're like, we're the king of [ __ ] And then you go back to freshman being freshman. So there's sophomores, juniors, and seniors. We met a group of sophomore girls that the drill team. The drill team. One of whom I [ __ ] fell in love with. And she was the girl that I had a crush on all throughout high school. And I had a crush on her basically best friend. Yeah. Best friend. And so you're like, it's perfect. And they were we get married together. They're only one year older, but in high school that might as well be like 10 years old. They must they might have Yeah, they were they were so sophisticated and ridiculous. We had no choice. Right. So they were women. You were boys. Definitely. Um and so I I just had this enduring crush for this girl for like three years. And I I managed to date a couple other girls and eventually got",
            "start": 994.88
        },
        {
            "text": "Right. So they were women. You were boys. Definitely. Um and so I I just had this enduring crush for this girl for like three years. And I I managed to date a couple other girls and eventually got got through it because she actually the same time I met her, my other really good friend was there and he ended up dating her. And so I was like, \"Oh, well, I can't like I got to just get over this. I can't engage. I can't engage. I can't I can't pull I can't pull Stew. That's how I know.\" No, Steu knew him. You knew whereas I was like Well, because the girl that he liked um we didn't give a [ __ ] about who she was dating. She and she was like she I mean she was like the it girl. She would date like college dude. Yeah. She was like it didn't matter cuz she was so like she was such a cool like beautiful and she was super flirty. So it was like very misleading. I'm like are you flirting or do you like me or am I but still hung in there whereas I was like I have to bow out because my homie is",
            "start": 1029.12
        },
        {
            "text": "and she was super flirty. So it was like very misleading. I'm like are you flirting or do you like me or am I but still hung in there whereas I was like I have to bow out because my homie is dating this girl and like I can't that's just never going to happen. There's just no way I can make this happen. I did eventually hook up with my crush. You did eventually. You [ __ ] hung in there, sir. And you hooked up with it. It was fantastic. So true. I remember on I remember there was one time when I was like, Stu couldn't accomplish anything because we were on a band. We were on a band trip up to uh Fairfield and I looked over and Stu and this girl that he had a crush on. Stu was like fell asleep on her boob and was like drooling onto her boob and she was just like she was like petting his head and I'm like Steu's going to make out with her. like this fanf going to make out with her. Um, anyway, living vicarious. So, the girl that I liked and I don't think I ever I don't think I ever told",
            "start": 1070.56
        },
        {
            "text": "and I'm like Steu's going to make out with her. like this fanf going to make out with her. Um, anyway, living vicarious. So, the girl that I liked and I don't think I ever I don't think I ever told her that. I I'm pretty sure she knew, but I never had the balls to be like eventually she woke up with my friend and started dating this other guy. And so I was like such an insecure little [ __ ] that I was like I [ __ ] hate this guy because he took the girl that I like and is now like in my brain I'm thinking he's like deflowering her like and like destroying her like he was like your typical soccer jock. Yeah. He had like a a cool lowered like Honda Civic and he was just I had literally this poor guy never talked to me before. Never said anything to me. Didn't know who I was and I was just like you have my eyeire my friend. like you are like I'm I'm like [ __ ] Steve Bushima that Adam Sandler like writing his name down in lipstick on the list for one day like I'm like I'm going to get",
            "start": 1106.0
        },
        {
            "text": "like you have my eyeire my friend. like you are like I'm I'm like [ __ ] Steve Bushima that Adam Sandler like writing his name down in lipstick on the list for one day like I'm like I'm going to get my revenge on you. Um and so I wrote I was like such a [ __ ] idiot in her yearbook going into senior year. It was I was I was a sophomore. She was a junior. We're going into the sen senior year and I said have a great summer. I hope your boyfriend dies. Jesus name. Sorry Nick's a subtle guy. Joking is but like man if he died like oh it sucks. the console and then you know I'd be like let's go out to get some pizza. Let's get married. Um so that night get a call. Oh my god. Hey man, this is so and so. I don't want to mention his name. Um I'm not really cool with that [ __ ] that you wrote in my girlfriend's yearbook. Like I feel like you that's disrespectful and he said it in a much more harsh way but like when you're a kid you hear just like them fighting words. And so I in my infinite",
            "start": 1149.28
        },
        {
            "text": "my girlfriend's yearbook. Like I feel like you that's disrespectful and he said it in a much more harsh way but like when you're a kid you hear just like them fighting words. And so I in my infinite wisdom said something totally Nick did not handle it well. He just one one upped him. I took it up a notch. I double I think I might have actually been there when we were there. Oh no, you hyped each other up. And I was like, who the hell is he talking? Oh, that's that guy. Yeah. And so Nick laid into him. I'm like, all I would have had to say was, \"You know what, dude? You're absolutely right. I apologize.\" Like that was an inappropriate thing to put in someone's yearbook. Like no big deal. Remember that statement, right? Because for the next year, this mad dogging all of a sudden this dude's friends were like, \"The [ __ ] he was like friends with the wrestling.\" One of them was known to carry a gun. This dude carried a gun. Legit. Yeah, dude. I'm telling you, we went to the Hoods high",
            "start": 1193.52
        },
        {
            "text": "friends were like, \"The [ __ ] he was like friends with the wrestling.\" One of them was known to carry a gun. This dude carried a gun. Legit. Yeah, dude. I'm telling you, we went to the Hoods high school. We went to the hood. We did not go to college. I was like, I went from being loved by everyone to all of a sudden having the [ __ ] wrestling team pissed at me and the soccer team pissed at me and like all these and like they would drive by and it was like mad dog and all [ __ ] So one day, and by the way, in amongst this, Ste's like, \"You've got to get over this. Please like, stop talking about it. I don't want to hear about her anymore. Like, you got to get beyond this because it's ruining your [ __ ] life.\" Yeah. And then literally was like, which was funny cuz he eventually got over and started dating this other girl who was a twin and that was just the hottest thing on the planet, which I dated the other twin. Yeah, he did. But like when I hear Kevin and Tim stories of them",
            "start": 1234.4
        },
        {
            "text": "and started dating this other girl who was a twin and that was just the hottest thing on the planet, which I dated the other twin. Yeah, he did. But like when I hear Kevin and Tim stories of them growing up, I'm like, \"You guys were too close.\" Then this right when I cut my Steven Seagal hair and I lost the weight going into my junior year when I got uh when I became drum major. That band camp, I was just sitting down and I was like, \"Yeah, I was looking pretty good. I'd lost some weight. had a lot of had a lot of good juice as uh cool Greg would say going into band camp and this one girl I was just she was sitting there and I always thought she was super cute but I never had the balls to talk to before you finish that before you get into the next girl let's let's I want to talk about the climax of the original girl we're driving I'm driving to school one day and I see this dude's car lowered black Honda Civic wheels exhaust dope as [ __ ] I think it was I think it was silver I want",
            "start": 1268.08
        },
        {
            "text": "climax of the original girl we're driving I'm driving to school one day and I see this dude's car lowered black Honda Civic wheels exhaust dope as [ __ ] I think it was I think it was silver I want to say it was like a dark gray it was black bro okay 95 no 96 pretty fast and furious You had the bottom of the line Civic hatchback, aka sport. Yeah, we call it sport. It had Did it have AC? No. Oh, no. It had AC, but it was a four-cylinder. Okay. So, one option. I'm sorry. It was a four gear. Four speed. Four speed. Thank you. Um, terrible. It was Sky Blue. It was the nerdiest [ __ ] car anyone could ever buy. If I remember from a previous game over Greg show, this is like you like that was like your big You went out and bought it and then like immediately regretted it. Immediately regretted it. And Steu I remember I drove over to Steu's house and Ste went like this. What? Why? Why? Si or EX. You got like the DX. Yeah, Steu got by the way, Steu's driving like a badass Jetta. It was It was",
            "start": 1304.72
        },
        {
            "text": "And Steu I remember I drove over to Steu's house and Ste went like this. What? Why? Why? Si or EX. You got like the DX. Yeah, Steu got by the way, Steu's driving like a badass Jetta. It was It was It was mod. It was cool. It was awesome. Anyway, so I'm driving to school and this guy's like speeding around and I'm like, \"Fuck this guy. Just [ __ ] this guy.\" And I'm like tailgating him, right? And I'm like, \"Ah, [ __ ] this guy. [ __ ] this guy.\" Right. Riding his ass. Well, his car is a sport vehicle with sport suspension, lowered, better tires. My car again, piece of [ __ ] He goes he I'm on his ass and I can't see through his window cuz it's tinted. And he just goes like this. And there's a truck right in front of him. A bus. And I It was It was a truck and then a bus that hit the bus after I hit the person. Right. Right. So yeah, I rear ended this person. Not a person. Some guys in between the bus and Nick and Yeah. I did homicide. Um so I I I unfortunately rear ended this person",
            "start": 1342.24
        },
        {
            "text": "after I hit the person. Right. Right. So yeah, I rear ended this person. Not a person. Some guys in between the bus and Nick and Yeah. I did homicide. Um so I I I unfortunately rear ended this person in front of me. Not Not hard, but hard enough that she hit the p the bus in front of her and I was like, \"This is the worst. What's up?\" Didn't the guy Didn't he turn around? Didn't he didn't he Oh, no. come around your mad dog and friend and honk Yes. at you. He didn't have to do that. Yeah. And so So he really rubbed their own move. Yeah. So I I mean again not not just I He should have done that. Okay. So Nick's not at school. This is before cell phones and texting. So like other people saw this car accident and like told the school like, \"Oh, Nick's not coming to class right now.\" So then he had a crazy accident. I'm like, \"Oh snap.\" So he comes like at lunch. So the rumors start flying. Yeah. Oh no. Nick's pissed, right? Nick's a big dude. He's looking like Steven Seagal. You don't",
            "start": 1382.32
        },
        {
            "text": "he had a crazy accident. I'm like, \"Oh snap.\" So he comes like at lunch. So the rumors start flying. Yeah. Oh no. Nick's pissed, right? Nick's a big dude. He's looking like Steven Seagal. You don't want to mess with him. He shadow boxes. Yeah, he's got Nick and and and this guy got like gotten some beef on the road. There was a [ __ ] There was a thing that happened. Nick's probably going to want to fight this guy. I was thinking the opposite. I'm thinking my mom is [ __ ] livid and my car is in the shop and I don't know how I'm going to get to work like to school and I made I just felt like a [ __ ] idiot, right? So eventually that day and I knew where he was coming from. I don't know why I did this. I just waited for him. And he came out and and I looked at it. It was in front of the band room. Yeah, it was in front of the band room and I had all my guys there. So, I was like king [ __ ] cuz I had like the drum line there and you guys were like dude, Nick's going to kill this guy",
            "start": 1425.92
        },
        {
            "text": "band room. Yeah, it was in front of the band room and I had all my guys there. So, I was like king [ __ ] cuz I had like the drum line there and you guys were like dude, Nick's going to kill this guy and we're going to have so much street credit at this high school. I was just going to jump right on Nick's back and be like, \"Yeah, we So Nick's going to kill this guy.\" By the way, the guy, he was bigger than me. He was taller than me. I've had full confidence that you were going to take him down, bro. You were going to lead in with that step kick that you did and then follow up. I think I by the way knowing what I know now, I would have got my ass kicked because I think if if his friends were wrestlers, they probably they would they would taken the gun in two seconds. Yeah, it would have been wrestlers against banned at that point. It would have been good. Terrible. Um and so he goes to me, he looks at me and he's like, \"We can't fight here. I'm we're going to fight, but we're going to",
            "start": 1467.52
        },
        {
            "text": "wrestlers against banned at that point. It would have been good. Terrible. Um and so he goes to me, he looks at me and he's like, \"We can't fight here. I'm we're going to fight, but we're going to the McDonald's parking lot after school to fight because if we fight off campus, they can't suspend us. Like they won't know about it.\" And I'm like, \"Fuck that because you have no one behind you and I've got 20 dudes behind you.\" So, I'm not thinking they're going to jump in. I'm thinking it's gonna be a fair fight because again, his dudes were like 6'4 [ __ ] wrestlers, like all state 220 wrestlers. I had hit my growth spree, but I still [ __ ] still. Yeah. Yeah, he was tiny. Um, and so I'm like, \"Fuck that. We're doing this right here, right?\" And we get in each other's faces. And I'll never forget this. I'm like, \"I don't know what the fuck.\" I'm like, \"I don't want to fight this guy.\" And I looked in his eyes and I'm like, I don't think he wants to fight me either. But we can't back",
            "start": 1499.68
        },
        {
            "text": "forget this. I'm like, \"I don't know what the fuck.\" I'm like, \"I don't want to fight this guy.\" And I looked in his eyes and I'm like, I don't think he wants to fight me either. But we can't back down now because all of the [ __ ] And like people are coming out of the theater right now to watch this. Shit's [ __ ] crowds forming. And I'm like, I'm going to have to get in a fight right now. This and it's totally my fault. I'm a [ __ ] idiot. And I'll never forget I felt an arm go like this. And I was like, \"Oh, thank God. Salvation.\" It was one of the security guards that pushed us away. We're like, and she was like, it was a female, but she was intimidating. And I was never happier to see her in my entire life. She was like, \"Both of you come with me right now.\" And we go to the um vice principal's office and we were cooled down a little bit and I think it was Mr. Garcia was his name. He's a really cool guy. And he was like, \"Look, dude.\" And he knew me and he knew both of us. He was",
            "start": 1537.12
        },
        {
            "text": "office and we were cooled down a little bit and I think it was Mr. Garcia was his name. He's a really cool guy. And he was like, \"Look, dude.\" And he knew me and he knew both of us. He was like, \"What's wrong with you two? What's going on?\" And he goes, \"Well,\" and the the the boyfriend started laying out all the things that I had done. And I was like, and it finally hit me. I was like, \"I am the bad guy in this. I am the [ __ ] [ __ ] It's not him. All he did was date a girl that he had no idea I even existed. And I am like stalking this guy. Like what a [ __ ] [ __ ] And I was like and I looked and he's like, \"Yeah, I mean, you know, he just wrote this really [ __ ] up thing in my my girlfriend's yearbook.\" And like I don't know. I think this he's just kind of a dick. And and Mr. Garcia looked at me and I'm like, \"You know what? I am kind of a dick.\" And I'm like, \"I'm not even kidding right now, man. I'm really sorry. Like I should not have written that.\" And it escalated and I and",
            "start": 1568.72
        },
        {
            "text": "looked at me and I'm like, \"You know what? I am kind of a dick.\" And I'm like, \"I'm not even kidding right now, man. I'm really sorry. Like I should not have written that.\" And it escalated and I and like I just I didn't know what how to handle it. Like I should have just apologized to you. Yeah. And the guy's like, \"Okay.\" And we shook hands, never talked again. It was that was it. But they were cool. Like there was no animosity. Like friends dropped like tripping on us and like was cool. And that's I mean that could have gone totally different way. Like someone could have gotten really hurt. I could have been stupid. Could have like it was it was just bad. But yeah, that was that was that was a [ __ ] that was the only go wrong. Yeah. The only time in my life I really felt like like there was that like that level of confrontation. And then after that it was, you know, it's exciting that you saw through it. So many people would bite down and continue to be the dick and be the [ __ ]",
            "start": 1609.52
        },
        {
            "text": "was that like that level of confrontation. And then after that it was, you know, it's exciting that you saw through it. So many people would bite down and continue to be the dick and be the [ __ ] Well, I knew there was there was a thing in the back of my brain that was like, no matter how hard and cool you think you are, you know, you can't fight. Like, I'd never been in a fight before. And I'm like, I he's going to move more than the trees to shadow. Yeah. I'm like, this dude's going to kick my [ __ ] ass. Like, there's no way that my my like six months of kung fu is going to really help me. He would had, bro. Yeah, he would have kicked my ass. But, um, let's see. And then a couple months later, you cut your hair. You got a new comp and you like a hot Filipino twin. That's true. It was hot. Okay, you guys. Yeah, that was actually That must have been sophomore and a junior. Dating twins. Yeah. How long did this last? How How close was it when you guys got together? It was very close",
            "start": 1647.52
        },
        {
            "text": "hot. Okay, you guys. Yeah, that was actually That must have been sophomore and a junior. Dating twins. Yeah. How long did this last? How How close was it when you guys got together? It was very close because I feel No, we didn't date at the same time. No, we didn't date at the same time. She was dating. He dated the nice one and I dated the really mean one. Yeah, she was so [ __ ] up. Don't be afraid of it. Carry it with you. Do this. Do this. I can carry it. Yeah, we met. She was She was also on the drill team. The drill team girls were like, \"If you got a drill team girl, you were like the shit.\" And they wore the tight black pants before yoga pants were even a thing. Yeah. So, yeah. No, these So, summer going into I think our junior year, I was sitting at the table and I just remember this really cute girl like laughing at me saying things and her my buddy was dating her sister who was the twin and she was he was just like came up to me afterward was like, \"Dude, you know, she she",
            "start": 1683.92
        },
        {
            "text": "this really cute girl like laughing at me saying things and her my buddy was dating her sister who was the twin and she was he was just like came up to me afterward was like, \"Dude, you know, she she thinks you're funny.\" And I'm like, \"Okay.\" And he goes, \"No, no, no. She she likes you because of that. like this is a thing. She she actually likes you because of your personality and I'm like I don't that's a thing. I don't understand because when you're in high school like your whole surface so surface so I don't understand. It was the first time in my life where I was and she was like you know she was really pretty and really sweet and really nice and so she had dated like guys in my that in my brain were like [ __ ] you know better than better than me in every physical possible way. And so it was very strange cuz I was like it was it was the absolute first time in my life that I realized that I'm like wait a minute someone can like you because of who you are and how you act, not",
            "start": 1720.0
        },
        {
            "text": "And so it was very strange cuz I was like it was it was the absolute first time in my life that I realized that I'm like wait a minute someone can like you because of who you are and how you act, not necessarily what you look like. Um now again I had cut the Steven Seagal hair so the ponytail was gone. Thank god. I can't even picture you without that. I don't even know what it ponytail. That haircut. Yeah. Oh man, it was well parted or what was it? It was like fauxhawked I think. I can't remember. Okay. Fauxhawk spiky push forward. Yeah, it was like the spike push forward thing. when I had a better hairline, so it was it was a lot better than that. Um, but yeah, hold on. So, you're telling me that there's the twins, and one of the twins was dating another one of your friends? Yeah. So, before Stu, they were dating. This is so high school. That's high school. It all sounds so weird and weird, incestuous now, but like I remember high school how it all exactly. Yeah. Across four years,",
            "start": 1760.16
        },
        {
            "text": "Stu, they were dating. This is so high school. That's high school. It all sounds so weird and weird, incestuous now, but like I remember high school how it all exactly. Yeah. Across four years, everything going every which way. Um, yeah. So, I mean, so she dated me and then after she and I broke up because it's high school and that's what happens. Um, our other friends started dating her and then the her sister broke up with her boyfriend and started dating Steu. So, it was literally in our in our group of friends, we had all dated one of the twins. They just that's just the way it goes. Again, not not disparaging them at all. It was it's high school. Like that's just what you did. When I talk about dating, I mean these relationships lasted three months and it was just like we Yeah. I touched a boob and that was pretty and I went on and that was that was pretty much it. Um I was also like I also had a lot more scruples back then than I do now I think cuz I was like I was a virgin",
            "start": 1801.28
        },
        {
            "text": "touched a boob and that was pretty and I went on and that was that was pretty much it. Um I was also like I also had a lot more scruples back then than I do now I think cuz I was like I was a virgin still and like I knew that I didn't like her in that way and she wanted to take the she was like you know confident in herself. She was like I would let's yeah let's let's have sex. And I'm like I don't I'm not I don't love you. Well, I did. I was like, I don't feel that way about you and I feel like it would be a like a bad thing to do if I were to do I felt like I would be taking advantage of you knowing that I don't want to date you anymore. And so I instead of doing that, I took the the high road which was just to break up with her. She was like, \"You're a [ __ ] idiot.\" Whatever. Okay. And then immediately dated my friend and like they they did whatever they were going to do. Yeah. Which was like lots of sex. But lots of sex. And I was like, \"God damn.\" And then he told Nick about it",
            "start": 1842.6
        },
        {
            "text": "then immediately dated my friend and like they they did whatever they were going to do. Yeah. Which was like lots of sex. But lots of sex. And I was like, \"God damn.\" And then he told Nick about it in detail all the time. He was my my other good buddy who Yeah. Yeah. And I was like, \"God damn it. I could have like I but then I I mean I still felt good myself cuz I was like I don't want I didn't I didn't want to take advantage of that. Um and then I and then I fell in love with another girl who was dating who had the boyfriend you tell you wish was dead this time. I know I fell in love with this other girl because of theater when you're in theater like that just the energy of sex like sexual energy in the backstage like right and so I fell in love with this girl. It's true as a theater kid that's true Tim. I remember the first time I remember my freshman year this girl in the play who was a junior or senior whatever I remember her coming back and it was she took off her shirt and her",
            "start": 1879.76
        },
        {
            "text": "that's true Tim. I remember the first time I remember my freshman year this girl in the play who was a junior or senior whatever I remember her coming back and it was she took off her shirt and her pants and she was brought her pants back there and it was like yes what the [ __ ] is happening there's a couple if I would have known about that I would have joined theater I didn't know that it was the only time that happened in my four years of plays but oh no I'll never forget like there's the whatever like being in plays was fun but it was because you got to perform but it was also more fun because you got to be backstage and backstage when the lights were down there was just this like sexual energy and you would just lock eyes with someone and they just make out and Nick's a big really that was not what happened with Nick I remember I I Nick was an aggressive flirt. No, there was just one there was literally just one girl and I remember this one time and like I'm like I'd never really",
            "start": 1914.4
        },
        {
            "text": "was not what happened with Nick I remember I I Nick was an aggressive flirt. No, there was just one there was literally just one girl and I remember this one time and like I'm like I'd never really talked to her before and I just kind of looked at her and she looked at me and I was like and we wouldn't even say anything. We just started making out. I'm like this is the best [ __ ] ever. It is exactly like that. That was a girl that was a couple years older. No, this girl was I think younger than I think she was a year younger. This is the one that I dated then again. Uh, no. Different girl. Different girl. Different girl. Yeah, you're talking about the one that I It doesn't matter. Yeah. Again, very very not a huge high school either, by the way. So, it was like No, actually was quite large. It's It's just funny with the dork ratio to dork and cool with you guys here and the way it all goes. It just sounds worse cuz I think I think about this too. If I remember in junior high when we",
            "start": 1951.68
        },
        {
            "text": "It's It's just funny with the dork ratio to dork and cool with you guys here and the way it all goes. It just sounds worse cuz I think I think about this too. If I remember in junior high when we all started dating, I had a crush on this one girl. She didn't want anything to do with me in that sense. Her friend was like, \"I'll date you.\" And I was like, \"All right, cool.\" So, we started dating, we break up, my friend starts dating the girl I dated, but and then and then another friend started dating the girl I'd always had the crush. And it was just like, oh, my life's so this is so crazy and difficult and it's just like my so-called life. Oh, I'm learning. Oh, yeah. Every time there was a breakup, it was like the worst thing that's ever happened to any of us ever. And then a month later when you found out that someone else liked you, you're like, \"She's the best thing that's ever happened to me. I I can't Who was the other person? Doesn't matter.\" Um, so yeah, the next girl that I",
            "start": 1984.32
        },
        {
            "text": "when you found out that someone else liked you, you're like, \"She's the best thing that's ever happened to me. I I can't Who was the other person? Doesn't matter.\" Um, so yeah, the next girl that I was obsessed with, uh, was my buddy's ex-girlfriend, my really good friend's ex-girlfriend, and he treated her very badly, and she loved him for it, and it was unfortunate and very dysfunctional. And I liked her, she liked him, he liked this other girl, and she liked me. Oh my god. Is everybody at home writing this down and drawing it out? I feel like this weird square of instead of a triangle, it was a square. And so, everyone likes the wrong person. Yeah. And it was like it was just the worst. But again, it's one of those things where you [ __ ] when you're in the middle of it, you just bask in it because you're like, \"Oh, that sweet high school drama [ __ ] where like all I would have like now when I got to like my mid20s and I started dating in San Francisco, I'd be like, \"Hey, how's it",
            "start": 2023.52
        },
        {
            "text": "it because you're like, \"Oh, that sweet high school drama [ __ ] where like all I would have like now when I got to like my mid20s and I started dating in San Francisco, I'd be like, \"Hey, how's it going?\" And they be like, \"I don't like you.\" I'm like, \"Cool, cool. Hey, how's it going? Cool. Hey, how's it?\" Oh, you do? Cool. Let's go out. You know, like it just became so much easier because of all that drama of just being like being able to slough it off and be like, \"This person's just not into me.\" Whatever. Well, that was the thing. you know, when you get to college and when you get out into adulthood about dating, right, is the fact that you never have to see someone again. High school and junior high was always the fact of I'm going to I'm going to obsess and ask you out and if this inevitably goes wrong, I'm with you another at least four years. Well, that's the thing, too, cuz there was like So, there was middle school and at least in my experience, your middle school, you",
            "start": 2060.72
        },
        {
            "text": "inevitably goes wrong, I'm with you another at least four years. Well, that's the thing, too, cuz there was like So, there was middle school and at least in my experience, your middle school, you kind of stick to whoever is in your school, but then once you get to high school, the middle school goes to a bunch of different high schools. So it goes from all right, I know one school worth of people to I know my my high school plus all my friends have friends at the four other public high schools or whatever. And it's like oh then there's those private kids that you know it just keeps on kind of like getting out and then dances become this freaking minefield of like your high school had weird dances. Me? Yeah. Had weird dances. You talking to your microphone? My high school had weird he all the time talking to the microphone. He just leans back off his he had weird dances. What does that mean Kevin? I mean people people No, like your high school didn't like you said people were having",
            "start": 2094.08
        },
        {
            "text": "the time talking to the microphone. He just leans back off his he had weird dances. What does that mean Kevin? I mean people people No, like your high school didn't like you said people were having sex at like on a table. Yeah. Yeah. It's not weird. Oh my friend. You were in high school. Your high school had a blanket. You just put it over you. You have sex. You'd be in the middle of [ __ ] football. You guys had real high schools. Yeah. I did not have these kind of high school. Touch me. It didn't matter where we were at. I was like, \"Let's go. Let's just let it happen.\" Yeah. No, it was high school in San Francisco in in the 2000s was definitely a thing. Yeah. I mean, a lot of my friends that were that were at Kind of Funny Live 2 helping me helping us in some way. They they may or may not have been having sex on tables and it's What does that mean? I need I need more context. They were having sex on the table. That part I got. But I mean like everyone's over at the dance and",
            "start": 2132.8
        },
        {
            "text": "may not have been having sex on tables and it's What does that mean? I need I need more context. They were having sex on the table. That part I got. But I mean like everyone's over at the dance and there's tables surrounding it and some there's just a couple laid out on top of the table. Table in the middle of the dance and they bring in the sacrificial victim. They have to have sex. You have to you two have sex for our pleasure. Freshman. It was it was it was it was a homecoming dance and uh there it was in the courtyard of my school. So there was a bunch of just like like lunch tables. Okay. And bushes. There was a lot of bushes. Uh, and then there's also a lot of construction at my school at the time because it was during that that time where it was just like we need new libraries and the kids are going to learn and all this [ __ ] like it's new science building. Thank god we gave up on that. No, I mean it was like there was definitely there was a moment in time where it was like",
            "start": 2174.0
        },
        {
            "text": "the kids are going to learn and all this [ __ ] like it's new science building. Thank god we gave up on that. No, I mean it was like there was definitely there was a moment in time where it was like there's bungalows everywhere. Like yeah, you're not going to get a [ __ ] real building. You're in a bungalow because the kids come in in a decade. They're going to have a real building. So there's bungalows everywhere. So there's a lot of places to hide even during dances. They weren't really hiding though. Like it was that was one of those one of those decisions I'm like you could have had sex in a lot of different places like they could have went to the science wing and they would have got away with it. Oh no they did not get away with it and they it turned into a real bad thing of indecent exposure and [ __ ] Oh yeah. No, that shit's real. Like you can't just [ __ ] in public. I can't. I mean the thing is you can find a better place in the middle of the You must have been 16 at the",
            "start": 2209.2
        },
        {
            "text": "exposure and [ __ ] Oh yeah. No, that shit's real. Like you can't just [ __ ] in public. I can't. I mean the thing is you can find a better place in the middle of the You must have been 16 at the time. Don't go streaking through the quad into the gymnasium. That doesn't work out. Um, yeah. I don't know. So, that was that's kind of But Steu, by the way, during all this, I don't think you ever like did you have a lot of heartbreak in high school? I don't think you ever did really. Uh, just with that big one crush. The one crush. Yeah. But that was that was about it. Never got over it. Uh, no, I did. I did. But that was the luggage movie. Yeah, that's that's the other thing when you get a little space like even when you got into college, it was just like, oh, what the hell was I thinking in high school, right? And then college, of course, starts its own drama. Um, but it's just a broader drama because you've got like 10,000 people to pick from instead of hundred. Well, the drama becomes",
            "start": 2243.2
        },
        {
            "text": "high school, right? And then college, of course, starts its own drama. Um, but it's just a broader drama because you've got like 10,000 people to pick from instead of hundred. Well, the drama becomes I'm an adult. Yeah, I'm out. I'm out and now I'm an adult and I don't have to wor and like I'm doing adult things and adult decisions and like you're like no. Facebook added a layer though that I don't know if you guys had to deal with. Maybe you did to some extent where it's like you, you know, you go to you have your middle school and high school experiences and they all feel like middle school to me it was only three years. that [ __ ] felt as long as my entire time at IGN, you know, which was five years. It's like things that time felt longer than than nowadays, right? College, by the way, felt like a [ __ ] blink. But, uh, after that, after college, after you're separated from them, there's that moment where everyone starts coming back. And then there's like these like reinvigorated",
            "start": 2286.16
        },
        {
            "text": "felt like a [ __ ] blink. But, uh, after that, after college, after you're separated from them, there's that moment where everyone starts coming back. And then there's like these like reinvigorated like, huh, I think it can work now. moments that you get. And I think the things with Facebook and be able to see people like kind of grow, it's like, \"Oh man, you you and I have a shot now. Where we're at now, now we have have a chance.\" And maybe like when you go back to uh wherever the [ __ ] it is, Missou, whether it's Missou or No, no, no, not so much high school. Yeah, I guess. So, yeah. St. Francis High School. Wheaten, Illinois. Yeah. Yeah. I mean, your high school was weird though cuz it was so small and you guys were you did the whole together. That was the whole thing of like you brought up of like I remember when uh my friend Camps had a girlfriend that went to Wheaten North and then Po got a girlfriend that went to Wheat and North. I'm like you guys are this is a longdistance",
            "start": 2324.8
        },
        {
            "text": "up of like I remember when uh my friend Camps had a girlfriend that went to Wheaten North and then Po got a girlfriend that went to Wheat and North. I'm like you guys are this is a longdistance relationship. How are you guys keeping this going? That's insane. You know what I mean? See, that's so weird to me cuz I we didn't know anyone that that dated people outside of North. Not really. Not like in high school. Yeah. We I had a cousin that went to Polly, which is the which is like our rival, one of our rivals. We had rivals. Everyone again. We were very good at sports. Everyone hated us. Um, but even then I'm like I would I would hang out with her occasionally and her friends, but it just we didn't do that. It just wasn't done. You just I you just never had occasion to meet the other people. Talking about like in Riverside it was like it's an urban sprawl. So you don't really like you're not like they're over there during the football game. We're over here during the football game. We",
            "start": 2359.52
        },
        {
            "text": "Talking about like in Riverside it was like it's an urban sprawl. So you don't really like you're not like they're over there during the football game. We're over here during the football game. We don't mesh. See, San Francisco was so different than that. Like sports was not a thing. Like yeah, okay, we had football teams, but like they weren't the cool kids. Like they were just there doing their thing. So it's like we especially at the school I was in the school I was in it's like they they treated it differently cuz it was like these are the kids that want to do AP classes and like that is the point of it. So they treated it like college like in my high school we would do the whole thing where we sign up for what classes we wanted. We made our own schedules like all of that. So we could make our schedules so that we're only going to school a couple days a week or like make it so that we have packed the day start 700 leave at 4 but like you're banging it all out or have giant lunches",
            "start": 2397.76
        },
        {
            "text": "make our schedules so that we're only going to school a couple days a week or like make it so that we have packed the day start 700 leave at 4 but like you're banging it all out or have giant lunches which is what this [ __ ] did. Um, but anyway, so wait, what's a giant lunch? Like a lunch that lasted like four hours. Gotcha. Thank you. It was fantastic. Uh, so we would do a whole bunch of things, but uh we were allowed to go off campus. And a lot of other schools wouldn't let you do that. So we would just go off be like, \"Hey, our friends are over at Galileo. Let's go hang out with them.\" And we would just go and just meet a whole bunch of people. Gal is another high school, a different high school in the marina. Did you then go into classes and stuff with them? Yeah. We did all types of [ __ ] [ __ ] I don't even I mean the story I always tell this is college, but Alfredo just hung out with me at SF State. Alfredo at no point ever went to SF State. He just hung out with me in all my",
            "start": 2430.96
        },
        {
            "text": "[ __ ] [ __ ] I don't even I mean the story I always tell this is college, but Alfredo just hung out with me at SF State. Alfredo at no point ever went to SF State. He just hung out with me in all my classes to the point that the teacher thought he was there. Gave him a grade at the end of the class. You're kidding. Why did he just go? Alfredo Diaz won San Francisco State's uh Becca Film Festival in 2011 or whatever with me. And he didn't even go to the [ __ ] school, but it says Tim Gettys and Alfredo Diaz. Why not? Why not? Yeah, that's uh that's fascinating to me. You guys, I brought you guys a little What do you got here? Present gift. Okay, Nick, you open it. Oh, thank you. It's heavy. That I've been holding for you for quite a while. Oh my god. Hold on. Oh. Oh, [ __ ] The robot. So, that's I I got that when I was 12 years old and got my tonsils taken out. Um I was given the whole Nintendo gift box. There's more. Gentlemen, now hold on. So, we got one for Rob. Rob can hold that.",
            "start": 2464.64
        },
        {
            "text": "that's I I got that when I was 12 years old and got my tonsils taken out. Um I was given the whole Nintendo gift box. There's more. Gentlemen, now hold on. So, we got one for Rob. Rob can hold that. Can he really? Oh, man. That's awesome. Rob can hold. The old Game Ste jokes are coming true. Oh my god. Thank you, sir. Oh man, I love this. Gentleman Jack was like the Tim Gettys drink. Slide it from the bottom. Oh, slide it from the bottom. Slide it in. There you go, buddy. Perfect. Perfect. Perfect. Makes sense. I love it. We got to rob the robot in bourbons and whisies. Thanks, Kevin. Holy crap. Where did you get this from? So, was I got it when I was 12? Tonsils were out. Oh, wow. Got my tonsils out. I got When I got my tonsils out, I got some Pound Puppies. My god. Pound movie. Makes me cry every time. They brought the pound puppies to the hospital and they told me when I had Nintendo waiting for me when I got home. So I had to like get better and eat my ice cream and nice motivate",
            "start": 2509.84
        },
        {
            "text": "cry every time. They brought the pound puppies to the hospital and they told me when I had Nintendo waiting for me when I got home. So I had to like get better and eat my ice cream and nice motivate you to get out of [ __ ] bed. Yeah. But anything that you eat when you have your tons tastes taken out. It's just like feels like fire. It's like you're eating fire. It's it was hard. But yeah, so I've held that. My mom actually gave away my whole Nintendo set, but because I was like displaying this in various places, I got to keep that. So that's the last remaining part. It does work. You locked out when I got my tonsils out. Little dance. Let me get a drink. Yo, can you slide it? So, see how slow it would be to play with? Cuz now he would like drop the top down and press the button. When I got my tonsils out, Poppy and Grandma came. They gave me uh stuffed uh like long neck dinosaurs that had their like clearly someone from the gift shop downstairs like, \"All right, thanks for I mean I'm",
            "start": 2552.16
        },
        {
            "text": "my tonsils out, Poppy and Grandma came. They gave me uh stuffed uh like long neck dinosaurs that had their like clearly someone from the gift shop downstairs like, \"All right, thanks for I mean I'm glad I'm not dead or whatever.\" Were you big before time? I wasn't. No, that was a very out of touch gift with me. I did not have anything. Yeah. You don't like dinosaurs. You don't like space. You don't like fun clips. Dutch. My question to you. Yes, sir. Is we've heard a lot about Nick Scarpino. Was Matt Scarpino torturing you during this time? Uh, not torturing me. He was he was like my surrogate older brother. Um, so he was Are you Are you an only child or you? No, I have an older sister. Okay. Um Oh, right. You mentioned this earlier. Yeah. Um, but no, he was like he was always coming home from parties telling us crazy sex stories and just like which I I actually tried to remember like a few. I can't they all must have just blown my mind when I was that age. I wasn't able to retain",
            "start": 2597.2
        },
        {
            "text": "from parties telling us crazy sex stories and just like which I I actually tried to remember like a few. I can't they all must have just blown my mind when I was that age. I wasn't able to retain anything. Um, but crazy stuff in the butt and all over sounds like mina sounds like mina. So yeah, so student have an older brother. brother. When we became friends, we were in seventh grade and Matt was in high school at this point, right? And so we followed his shenanigans and his antics all the way through high school when he was in high school all the way to when he was in Sigma out in Cal State. And he just Scarpedo and a frat. It was so hilarious to watch the crazy [ __ ] that they would do. like they would throw parties and it would look like like they would do floor to ceiling like uh uh drop cloths like tarps. So it looked like a kill zone like it looked it looked like a slaughter house like for for a serial killer, right? But they would rage at these parties with people and like it",
            "start": 2636.56
        },
        {
            "text": "drop cloths like tarps. So it looked like a kill zone like it looked it looked like a slaughter house like for for a serial killer, right? But they would rage at these parties with people and like it was I mean I went there to one time with him to because he had to stop by to get something he'd forgotten and I was like I don't understand. It was so Matt Scarpino. There were gigantic trash cans full of ice and beer strategically placed so that you never had to go more than a foot to get a new beer or a new like a new cocktail. Like it was always just perfectly there. Everything was like tarped down so they wouldn't ruin the floors. And like they had the the the pledges would go out to all the neighbors and like just like like smoo them over and like bring them stuff so that they wouldn't complain. And so they had this whole thing down to to a system. And man, they would party. And then but when Stu and I would party a lot with him was when my parents would go out of town to Vegas,",
            "start": 2684.56
        },
        {
            "text": "complain. And so they had this whole thing down to to a system. And man, they would party. And then but when Stu and I would party a lot with him was when my parents would go out of town to Vegas, right? Uh they would do an annual trip to Vegas or Laughlin sometimes, but um they would do this trip with their friends and they would leave us for like four or five days and my mom come over there and live there. Oh yeah. Ste just live there. Like there was one time they did it over they went to New Orleans for for like a week and Stu just lived at my parents house for a week and all we did was sit in we put lawn chairs in the pool with coolers of ice in the pool so that we never had to go inside unless we wanted to play Mario Kart like Mario. It was Mario Kart goes inside then we cool off and we kept it so cold that it would make your nipples hard the second you walked in. Didn't I think I remember this. Didn't they get like the air conditioning bell for It was a good $600 to $700 I think",
            "start": 2721.92
        },
        {
            "text": "we kept it so cold that it would make your nipples hard the second you walked in. Didn't I think I remember this. Didn't they get like the air conditioning bell for It was a good $600 to $700 I think was the air conditioning bell and the hot tub. We were in the hot tub. [ __ ] yeah. And we were just like cuz at night we're like we got to get hot then we got to go in the house to get cold and it was like we just it was just I just remember it was a week long of just people coming into the house and I'm like hey what's up and they would stay and then they would get burned out from the party and they were like I got to go home dude and they would bounce out. Meanwhile my brothers just going every day still a drink a beer in his hand and he's like come on you got to drink more. And so that was that was kind of how we grew up with Matt was he was just he would always just bring the part and no one ever got hurt though. That was the best part. Like, no, he was good. People if you were",
            "start": 2756.56
        },
        {
            "text": "was that was kind of how we grew up with Matt was he was just he would always just bring the part and no one ever got hurt though. That was the best part. Like, no, he was good. People if you were drunk, you stayed. Yeah. Like, you slept you slept on a couch or you slept upstairs. Like, you didn't you didn't drive home. But, uh, it was fun. Yeah. Matt and I had some stuff in common, too. The first time I came over to Nick's house for his birthday party, Matt was playing his drum, his dad's drum set, um, when they had like rotos. It was like like, \"Oh, what? This guy can.\" Um, so right off the bat, I was like, \"Oh, this guy's cool.\" And he was also in the car stuff. Um, he's like stereo. He was told when you got your your subwoofer, my brother had an even bigger subwoofer. I love that. Circuit City and spent lots of money on Circuit City. RIP audio. My brother borrowed $120 for me that I had saved from lunch money in junior high. And he was like, I'll he's like, I'll pay you back. I I",
            "start": 2788.64
        },
        {
            "text": "City and spent lots of money on Circuit City. RIP audio. My brother borrowed $120 for me that I had saved from lunch money in junior high. And he was like, I'll he's like, I'll pay you back. I I promise. And I was like, okay. And I just handed him a giant wad of cash and he immediately went and bought a sound system with his car. He bought an Alpine like he had saved some money, too. He bought Al Alpine CD player and then like all that stuff. Probably spent $1,000 on it. I never saw that money back. Now you still I'm sure it was worth it. Oh my god. I I mean Matt Scarpino is such a treasure just in every sense for sure. But my I just love that like I you know to take him down a notch I love that even then I know him. He must have been like I'm going to make these little [ __ ] think I'm the coolest person they got. Definitely. Definitely. And he did. Oh there's a drum set happens to be just conveniently placed right here. I'm going to [ __ ] play. He's going to rip it from these kids",
            "start": 2824.16
        },
        {
            "text": "coolest person they got. Definitely. Definitely. And he did. Oh there's a drum set happens to be just conveniently placed right here. I'm going to [ __ ] play. He's going to rip it from these kids [ __ ] [ __ ] Yeah. And everybody thought Matt was the coolest too. Oh yeah friends. Yeah. Well, Matt was the reason why I got into theater and his buddy Dave, uh, who was the drum major at North was the reason I got into band and and one wanted to be a drum major because he like I saw him do it. I was like, \"That sounds really cool. Really fun.\" Which Dave was the marching instructor. Both Nick and I won best freshman marchers at band camp. That's right. Because he taught us we we were we were groomed for groomed for uh for high places from the start. Yeah. Yeah. Keep looking at you. I don't know if you want to end this topic or not. Well, that's what Kevin's texting me. You can always just ask Kev. It's fine. This show is the show. I don't think you have to worry too much about it. I",
            "start": 2864.08
        },
        {
            "text": "know if you want to end this topic or not. Well, that's what Kevin's texting me. You can always just ask Kev. It's fine. This show is the show. I don't think you have to worry too much about it. I thought we was just going to do an hour long and break it in half, right? That made sense to me. It'll keep you on your toes. By the way, Kevin, thank you to all the people who supported us on Patreon last month. Yeah, they are. Kevin's been away. They go up. They're going up. Never down. Always never down. So, what what is the next story we need to know? What's the next story we're missing? Cuz that we literally spent 45 minutes being about all the weird incestuous girl relationships you guys had, which is all there is to high school though. at the end of like really is there much more? It's like these guys were [ __ ] friends and there was a lot of girls involved. Right. No, this story I'd actually like to tell a kind of funny story. Okay. If that's okay. Yeah. Cuz it's all also related",
            "start": 2900.96
        },
        {
            "text": "like these guys were [ __ ] friends and there was a lot of girls involved. Right. No, this story I'd actually like to tell a kind of funny story. Okay. If that's okay. Yeah. Cuz it's all also related with Nick, but Nick was telling me about doing the show with this guy named Greg and Tim for years and who was working working at IGN. And Nick and I like we're we're very good friends, but we only see each other like once or twice a year. So every time we do it's like a big download. And Nick's like, I was really proud of him. Moved up to San Francisco, working at IGN, balling. I was doing well with my IT career. So I'm like, you know, and then he starts telling me about this YouTube stuff he's doing. And I'm a I loved YouTube at the time. I'm a big car guy. So I was like, I liked YouTube, but I still didn't really understand what he was doing. And I was like, okay. I supported him, but I was like, I don't really get it. And then, you know, that went on. And then he I found out he was",
            "start": 2937.12
        },
        {
            "text": "but I still didn't really understand what he was doing. And I was like, okay. I supported him, but I was like, I don't really get it. And then, you know, that went on. And then he I found out he was going to quit his job and do it. I was like, dude, what is Nick doing? I'm like, that's kind of crazy, bro. But no healthcare. terrible nok. But uh he seemed really happy and you know Danielle's a smart woman and she supported you. I was like, \"All right, do it, dude. That sounds great.\" So it wasn't until I watched kind of funny live, the first one, where I realized what the hell you guys have done. And I'd like to pat all of you guys on the back. Thank you, Nick. Yeah, give me one minute. Pound it. Um Colin, I was going to say air pat. Um because I couldn't believe and Kev too, bro. Um, the support you guys had from your fans, it just blew me away when you guys had people up on stage and they were talking and like said how much you guys mean to them in their daily lives and like if",
            "start": 2977.2
        },
        {
            "text": "the support you guys had from your fans, it just blew me away when you guys had people up on stage and they were talking and like said how much you guys mean to them in their daily lives and like if they're having a rough day, they can put you and it's just like like I got teeyed. I was like, dude, they are freaking killing it. They have like this awesome subscriber fan best friend, you know, base and it's just like I couldn't believe it. So, like from there on and Nick has been telling me, \"Dude, you you like cars. you're always doing cars stuff and spending money on cars. You should like start a YouTube channel. I was like, haha. And then like would say it multiple times and I would never really click. And then as soon as I saw you guys do that, I'm like, dude, maybe I should do that. Like there's like real content. There's real people out there watching. Like if I could even touch like half or a quarter of the people that you guys are doing, like that would be freaking amazing and",
            "start": 3020.72
        },
        {
            "text": "there's like real content. There's real people out there watching. Like if I could even touch like half or a quarter of the people that you guys are doing, like that would be freaking amazing and such an added benefit to besides doing what you love. So since then, I have started my own YouTube channel. I finally took Nick's advice and um it's a car based car reviews in Southern California like modified car stuff, driving cars. Tell me what it's called. Hold on. Time out. I think this is another easy topic break. Okay, cuz topic number three for this was going to be cars. Okay, so now we're moving into topic number three. Got it. Brought to you by Patreon producer Salem Gollum. All gone. Gone. All gone. If I say it real fast, it doesn't matter if I screw you guys. I thank you for keeping me honest. Salem understands that I'm an idiot and he backs me for some reason. Stu, you're obsessed with cars. What's that all about? I am obsessed with cars. Uh, since I was a kid, I, you know, I",
            "start": 3061.2
        },
        {
            "text": "me honest. Salem understands that I'm an idiot and he backs me for some reason. Stu, you're obsessed with cars. What's that all about? I am obsessed with cars. Uh, since I was a kid, I, you know, I asked my mom to buy me car magazines. Always like cars, always modified my cars. Just been a thing. Kind of superficial, but, you know, I've always liked it and always stayed with me throughout the years except for about like a three-year period where I just drove a stock car. No cars. No cars. I was like, I need a break. But now I'm back. Um, I just love them. So, Volkswagen Audi is kind of what I grew up doing. And like there's a big like a VW Beetle. Volkswagen/ Audi group. Uh like Jetta or GTI's Golf. Got the Golf. Not necessarily a Beetle. Yeah. My dad had a Beetle. It was pretty dope. It was really loud. Never understood why anyone would ever choose that car. Why was it so loud? Engine. Yeah. Every engine was in the [ __ ] uh trunk. I guess you would turn it on and it goes I'm like",
            "start": 3104.32
        },
        {
            "text": "was really loud. Never understood why anyone would ever choose that car. Why was it so loud? Engine. Yeah. Every engine was in the [ __ ] uh trunk. I guess you would turn it on and it goes I'm like this is stupid. It's like a go-kart except it's like ugly and orange. Well, they were they were super easy to like fix. Apparently, the Beatles just weren't that that that complex of a car. So, a lot of people liked them cuz it was like if it broke down, you'd fix them pretty easily or you could do it yourself. Um I we had a couple friends in high schools that had Beatles and it was always and they broke a lot. Yeah, they broke a lot. It was always like fix like they would they would die and then so like does anyone have a paper club? They would fix it with some gum and [ __ ] and go on. Um, I'll never forget though, Steu's dad had a Jetta and this was remember when I had this horrible ugly sky blue hatchback Honda Civic that had four gears and Steu's dad had this dope ass like deep",
            "start": 3144.72
        },
        {
            "text": "Um, I'll never forget though, Steu's dad had a Jetta and this was remember when I had this horrible ugly sky blue hatchback Honda Civic that had four gears and Steu's dad had this dope ass like deep burgundy Jetta. Jetta's cool. It was an 84 Volkswagen Jetta. Not anywhere near as cool as he's making out to see, but Civic probably. I've never associated Jetta's in cool. Like you never see a Jetta in Need for Speed Underground like Well, yeah. But Jesse drove a Jetta in uh in Fast and Furious. Yeah. Yeah, Jesse did. Fair enough. Touche. Touche. Um, you kind of look like Jesse, actually. No. But, uh, but Steu had this car and I was like so jealous because he tinted it out. He, put the CAN&N air filter in it. He like lowered it, did all this stuff. And then if anyone's ever had a Jetta, which is like a pre I don't know how they how good they are now, but a pre-2000 Jetta, they the cars would just systematically start falling apart on you. And I remember there was one time when Steu and I",
            "start": 3181.6
        },
        {
            "text": "is like a pre I don't know how they how good they are now, but a pre-2000 Jetta, they the cars would just systematically start falling apart on you. And I remember there was one time when Steu and I were driving and I was like, \"Steu, that's a stop sign. Stu, you blew through the stop sign.\" And he goes, \"Bro, I can't stop. If I if I stop the car, it'll stall and we'll have to push it and start cruise three. Oh, dude. It wouldn't idle, right? No, it would not. It wasn't the idle ter. This is the thing with cars and stuff and I weren't get to your fancy YouTube channel about fancy cars. But the fact of like what you just said, you know, were Jetta cool. Like I never understood what car was cool. I, you know what I mean? I like cars that had personality, fine, but I was never the car guy. And so I remember the only car I ever thought was cool was this guy Joe I think his name was sat next to me in French class and he had um a Mitsubishi Eclipse that was all black and black on the",
            "start": 3225.84
        },
        {
            "text": "guy. And so I remember the only car I ever thought was cool was this guy Joe I think his name was sat next to me in French class and he had um a Mitsubishi Eclipse that was all black and black on the inside. I'm like that looks like the Batmobile. So that's fine. Sick. It got real ugly after 98 but then but then it came back and I was like man but that was the thing is I drove a Ford Taurus forever and I like that that was the beater I got when I turned 16 and I that car was great cuz it was the perfect car for me and the fact of like it was totally [ __ ] up so nobody really cared what happened to it. Like Po always jokes around about it when he'd come over to get a ride to school. We'd get in there and those Chicago winter mornings, we'd get in there and you turn the car on and then if I I always forget it now, but you could turn the radio on and then the heat. But if you did the heat and then the radio, it would die. You would just kill the [ __ ] I always made jokes that it was",
            "start": 3258.64
        },
        {
            "text": "I I always forget it now, but you could turn the radio on and then the heat. But if you did the heat and then the radio, it would die. You would just kill the [ __ ] I always made jokes that it was Apollo 13 where you're like watching the ampers the amps to see how many amps you have to give on this thing and it's got to be the right sequence of orders. How long did you keep that car? I had that car from high school until I graduated college like 90. eager site not right away. So or 20 2000 to 2005 or six we'll say something like that probably something like that and what happened is I had this taurus that I inherited from my parents that by the time I'm getting rid of it in Missouri the deal was that it ate oil like and my dad is Mr. car Mr. outside guy and he got to the point of just like I don't there's it's not going anywhere. It's just getting eaten by this car. So when you fill up for gas, you need to put a quarter oil in every time. And I was like, okay, cool. And like you did",
            "start": 3296.72
        },
        {
            "text": "I don't there's it's not going anywhere. It's just getting eaten by this car. So when you fill up for gas, you need to put a quarter oil in every time. And I was like, okay, cool. And like you did and it just disappeared. And so finally my mom was getting rid of the the burning it. That's crazy. Yeah. Mom had this 1994 rag top Ford Mustang GT. She loved it. Took such great care of it. Leather interior, tan tan top, like pristine. And she was like finally like you know it was only you know rear wheel drive so it like kicked out all the time in the winter and it was a huge thing. So she was moving over to some similar looking car but much bigger Solaris I think maybe if that makes sense. Toyota Solaris something like that doesn't matter. And so she was going to do that and she called me was like do you want to do you want the Mustang like I'll you know I'll sell you the Must for like a dollar or whatever he was. And I remember to like I was with my ex obviously back then I was just like",
            "start": 3338.88
        },
        {
            "text": "like do you want to do you want the Mustang like I'll you know I'll sell you the Must for like a dollar or whatever he was. And I remember to like I was with my ex obviously back then I was just like do I want it? She's like yeah don't be stupid. That car is way better than your piece of [ __ ] I'm like all right cool. So, I got it. And there's like, you know, again, it's funny with Ste, we're talking about Post so much. My, you know, high school best friend, childhood best friend. Um, he always talks about it being like my, he remembers that car and how my mom took care of it. And then when I picked him up in it at SFO one year when when I had out here, he said it was like Ghostbusters 2. When the Ecto1 comes in, it's like filth fan cucking, kicking out smoke cuz I I would park it and then like tree sap and tar would fall on it and I wouldn't do anything about it. So, like the rag top was ruined. It was so [ __ ] And I had no money cuz I was working at IGN and living in San",
            "start": 3378.72
        },
        {
            "text": "it and then like tree sap and tar would fall on it and I wouldn't do anything about it. So, like the rag top was ruined. It was so [ __ ] And I had no money cuz I was working at IGN and living in San Francisco. I know to put any Doesn't cost that much to watch the car, Greg. Come on, buddy. Well, that's what that's funny that you said cuz I used to treat my cars like [ __ ] Like I I I always had crap in my cars and it wasn't until Stu got a a newer car. He got a I think it was a 95 or 94 96 Jetta. 964 Jetta, right? And it was a [ __ ] cool car, man. Like badass. Black on black leather V6. I had the exhaust. It sounded amazing. It sounded disgusting. And it was a V6. The car maybe weighed like, you know, nothing. Yeah. And so I got in this thing for the first time. I'm like, \"This is [ __ ] awesome.\" And I saw how good Steu kept it. It kept kept his car. And so when it was time for me to get a new car, um, and by that I meant I got I was so embarrassed taking girls out in this car that",
            "start": 3415.92
        },
        {
            "text": "awesome.\" And I saw how good Steu kept it. It kept kept his car. And so when it was time for me to get a new car, um, and by that I meant I got I was so embarrassed taking girls out in this car that I had that I just was like, \"Ma, I need like can I borrow $1,000 so I can just get a new car?\" Um, and I have a I had a job now at that point. So I upgraded to a Jetta VR6. Also, same car, but mine was white. Oh. And I did not realize that the white Jetta was Oh, it wasn't that. It was considered a girl car. So, I was like, \"Way to get a white Jetta, Nick.\" But that [ __ ] was fast and it had dope tan leather interior and I didn't care. And I kept That's when the meticulous Nick started. Oh. Where I was like, I got this thing I'm finally proud of. I'm finally like have a car that I I think it was cool and it was fast as [ __ ] So, I took care of that thing. And that and from that point on, I never put any anything that goes in my car comes out. That's That's my rule. When it goes in, it",
            "start": 3457.76
        },
        {
            "text": "was cool and it was fast as [ __ ] So, I took care of that thing. And that and from that point on, I never put any anything that goes in my car comes out. That's That's my rule. When it goes in, it comes out. That's what's happening. Um, nice. But yeah, I remember writing that down. I've done it before. I left a comic book in the back of the air one day and I noticed the next day it was there. I was like, \"Oh, sorry. I forgot that. I totally forgot.\" What's annoying to me is like when I used to drive around with Tyroo, God bless Tyroo, but Tyru is he doesn't give a [ __ ] about anything. He's kind of absent minded. Cough drops. And he would just I would just be like I would go to clean my car out after Ty we had been caring back and forth for a week and there would just be rappers in every possible pocket like the backseat pocket of the car that no one ever uses. You put like your mom has a map back there. I would reach in and be like, \"Why the [ __ ] are these so many rappers back",
            "start": 3496.8
        },
        {
            "text": "possible pocket like the backseat pocket of the car that no one ever uses. You put like your mom has a map back there. I would reach in and be like, \"Why the [ __ ] are these so many rappers back here?\" Beef jerky rappers. There would be [ __ ] tucked up underneath my [ __ ] the visor. And I pull it down, there would be like the top of a beef jerky rapper. I'm like, Tyson. Um, he he was like, \"Whatever, man.\" Uh, but yeah, it was too It was hilarious cuz I remember when you first got that car, remember the the Laughlin story? We're going out to meet my brother and his then girlfriend in Laughlin, Nevada, and we are traveling faster than the speed of light. very fast because Steu's car was so fast and it was so cool and I was like, \"Yes, drive faster.\" And we got pulled over by an offduty sheriff's officer who was like, \"I have been tailing you guys for 10 minutes to catch up with you. You were driving really fast. Pull over.\" We pull over and Ste's like, \"Fuck.\" And I'm like, \"I know,",
            "start": 3529.36
        },
        {
            "text": "officer who was like, \"I have been tailing you guys for 10 minutes to catch up with you. You were driving really fast. Pull over.\" We pull over and Ste's like, \"Fuck.\" And I'm like, \"I know, man. Just going to get a ticket. Hopefully it isn't that bad.\" Yeah. And the guy walks up there. He's like, \"I can't write you a ticket because I'm a sheriff's officer, not a highway patrol officer, and I don't have my ticket book with me.\" But you see that guy all the way up there? And he pointed to like this little speck about two miles in front of us who happened to be a highway patrol officer that had pulled someone over. He's like, \"I want you guys to pull up next to that guy.\" And he ended up being a really nice guy, though, because we were so courty. The guy who pulled us over was really nice. The guy who we went and had who wrote us the ticket was a jerk. He walked up to the car. He's like, \"Oh, no front plate. Oh, tin windows. Oh, ticket you for that.\" Lowered. Yeah. All this stuff. You",
            "start": 3569.92
        },
        {
            "text": "The guy who we went and had who wrote us the ticket was a jerk. He walked up to the car. He's like, \"Oh, no front plate. Oh, tin windows. Oh, ticket you for that.\" Lowered. Yeah. All this stuff. You got You got Oh, I felt so bad. So, you just drove over there with the other guy on the shoulder like right Yeah. like up the road like a mile. And then he did give us cuz we were going probably double the speed limit where it was completely speed limit back then probably 55 and we were at easily 10500. We're not that old, bro. The speed limits was 65. Was it 65? Yeah. Yeah. Yeah. Yeah. Okay. We weren't texting anybody. Either way it was going Yeah. Either way we were going. At one point I remember looking at the speedometer. I was like that says 100. Like that's we were over 100. The only time I've ever been over Well, there's there's two times. One time I went over 100 was with with my friends in college and this was during like the the WRX STI phase. So they they all had their fancy ass",
            "start": 3601.76
        },
        {
            "text": "I've ever been over Well, there's there's two times. One time I went over 100 was with with my friends in college and this was during like the the WRX STI phase. So they they all had their fancy ass [ __ ] cars that go super fast. So we did like a one of those like drag race style things where we went out and it was just like how fast. No, we weren't racing anybody. It was just like pretending you're racing people. Like let's just go [ __ ] fast. And that was scary as hell. Uh but then the other time was on our our first trip down to LA. We all packed in Alfredo's uh Honda Odyssey. Um, and that thing is a minivan. It is the minivan of champions. And that thing is amazing. And somehow Toyota uh uh Sierra Sierra is the bomb.com. That is the bomb. If I'm not even kidding right now, if I could if I had the space for it to park that [ __ ] thing, I would drive that mini. Is that the Sonar one we had when we went to see Kevin Smith? It's the Cadillac of minivans. But we somehow pushed that",
            "start": 3642.0
        },
        {
            "text": "if I had the space for it to park that [ __ ] thing, I would drive that mini. Is that the Sonar one we had when we went to see Kevin Smith? It's the Cadillac of minivans. But we somehow pushed that thing to 110. Yeah. And was it worth it? No. No. That car is unstable at it. Yeah. No, no, no. But I mean it it felt fun at the time. That was the thing of like the when I the speeding for me and like stuff like that like the my speeding stories all involved the tourists you know I mean I had the Mustang and I drove it on I7 in you know Missouri but that's like [ __ ] stay alive you know what I mean driving on it but like I'll never forget in the tourist when I was coming back from Missou to Chicago and it's a six-hour drive. At some point I was on the road and a cop was in front of me and he was speeding so I was like [ __ ] it I'll just pace this guy right cuz if he's doing he can't get mad at me. And so forever I drove behind him and he would change lanes and I would change lanes and I",
            "start": 3687.52
        },
        {
            "text": "was speeding so I was like [ __ ] it I'll just pace this guy right cuz if he's doing he can't get mad at me. And so forever I drove behind him and he would change lanes and I would change lanes and I was totally just hailing this cop at an excessive speed in the Ford Taurus and finally he just jerks it to the he like went and then he like faded me out and he slams on his things and then I'm like well I can't be matching his speed. I'll just I'll keep fall and I kept slowing like it was just me and him on like I55 I think in Illinois and I kept slowing down. We're doing eventually 20 on the highway with him a little bit in front of me and then and finally he stopped enough to get there and I turned and looked at him and he was screaming through the glass at me just like [ __ ] pointing and screaming like I got the message clear and he just [ __ ] floored it and took off and was just gone. Why did you think that was You didn't even get pulled over. No, didn't even get pulled over for",
            "start": 3725.36
        },
        {
            "text": "screaming like I got the message clear and he just [ __ ] floored it and took off and was just gone. Why did you think that was You didn't even get pulled over. No, didn't even get pulled over for that. Yeah, that's a terrible idea. [ __ ] Yeah. What are you going to do? I think I got one. Yeah, I got another speeding ticket going down to Missou and it was totally the best thing because it was that I was I was 20 at the time and so I couldn't go out to the bars or anything when the other the older antlers would go. And in Illinois at the time, I don't know what it is now, I got the speeding ticket and that meant they took your license and they gave you the ticket and this was now proof of your ticket. And so I got the ticket and I looked at it. I was like, \"Huh?\" And got back to Missou, busted out my checkbook with the carbon paper and made their their uh their three on 83 and 82. And then I just went around to bars and I'm like, \"Oh, that sucks, man.\" And they took my license. Here's",
            "start": 3765.44
        },
        {
            "text": "out my checkbook with the carbon paper and made their their uh their three on 83 and 82. And then I just went around to bars and I'm like, \"Oh, that sucks, man.\" And they took my license. Here's my thing. And they're like, \"Man, Illinois is dumb. There you go. Have a good time at the bar.\" I'm like, \"Thanks. You are a crazy son of a [ __ ] I would never think to do that.\" My paranoid brain would be like, \"They're going to catch you and they're like, they're going to arrest you for fraud.\" Yeah. Like you roll and young. Exactly. You don't know. You don't understand what you're playing with. Things happen. So So Steu, have you gotten all the cars that you want? Like your dream car, did that ever come to fruition? Yeah, I bought my dream car like three times now. It keeps changing though. You know what I mean? It's it's a problem with So, so tell me, you have this YouTube channel. The name is Wheelie Cool Videos. It's Wheelie Cool Videos. I took the word really. Oh, wheelie with my logo",
            "start": 3799.6
        },
        {
            "text": "know what I mean? It's it's a problem with So, so tell me, you have this YouTube channel. The name is Wheelie Cool Videos. It's Wheelie Cool Videos. I took the word really. Oh, wheelie with my logo is sunglasses. I'm sorry. A wheel with the sunglasses on it. Yeah. Animated by Nick Scarpino. Thank you very much. You're welcome for that. Thank you very much for that. Um, so so you do you keep how many cars do you own or is that you keep trading the cars? No. Yeah. Well, I currently own three. Um, okay. I had just had a fourth that we sold, our Volkswagen Euro van camper. You know, the cool one with the pop top and all that stuff. We just sold that. Um, we just bought a house. So, we're like, lick, my wife's making me sell every car. That's not a necessity. Gotcha. But, um, no, so I bought, as far as my dream car question, I bought a Volkswagen R32 in 2008. Swear to God, you just move it around. Okay. Hi. Check. I got a 2008 R32 that I thought was my dream car, but it wasn't. And then I",
            "start": 3836.08
        },
        {
            "text": "as far as my dream car question, I bought a Volkswagen R32 in 2008. Swear to God, you just move it around. Okay. Hi. Check. I got a 2008 R32 that I thought was my dream car, but it wasn't. And then I bought a TTRS Audi in 2012, which was very dream carish. Let's take a second and talk about this. Amazing $70,000 Audi that cost me like $1,000 a month. Stu buys this car and I was like, how [ __ ] like if you know anything about Audi's, like the the RS models of the Audi top horsepower, manual transmission, all-wheel drive. It's like a Subaru STI but like luxury and lighter, tiny, super fast. And I'm like, how fast could it possibly be? It takes me for a ride in this [ __ ] thing. It's It does. What was it? 0 to 60. 60 under four seconds. Under four seconds. Yeah. Yeah. You could launch this thing and just It's so [ __ ] fast that it sucks you into the back of the seat and you're actually you get scared very quickly. And I remember we were up in uh we were up north driving around the",
            "start": 3876.64
        },
        {
            "text": "thing and just It's so [ __ ] fast that it sucks you into the back of the seat and you're actually you get scared very quickly. And I remember we were up in uh we were up north driving around the whining roads in Northern California and I was like I was white knuckling it the entire time. I'm like, \"Ste, you've got to slow down. Like this thing is so [ __ ] fast.\" It is basically all engine with four wheels and like a seat. It's pretty much all it is. But it was so cool. It's a lot of fun. I drove it on the track um on the racetrack where you can do like track days which is awesome because you can like drive 140 150 mph and not worry about speeding tickets and stuff. Um but then I realized, you know, that's a lot of money and uh if I had that extra money, we could be like buy another house or something like more um mature and fiscally responsible. So adult, but actually that's not why the reason I sold it. I found another car which was a 94 Volkswagen Curado. Do you know what that is?",
            "start": 3927.68
        },
        {
            "text": "or something like more um mature and fiscally responsible. So adult, but actually that's not why the reason I sold it. I found another car which was a 94 Volkswagen Curado. Do you know what that is? It's purple little hatchback. It's like a Sorraco in between a Sorco and a GTI. Gotcha. They only made them for 4 years. It's purple though. Purple sounds awesome. Dope. Yeah. Yeah, it's dope. Uh with a VR6 engine. Sounds good. Um so I I sold my TTRS and I bought that car. How fast is that compared to the TTRS? Oh, it's like half as fast. It's more cool cruisy than like super fast. But I learned with my fast TTRS that really having a fast car is fun and all, but how often are you using it? Yeah, how often are you going to so fast that you're going to going to go to jail or get a really big speeding ticket eventually? It's just it's just too fast. And to drive it on the track, it was like almost too nice of a car to drive on the track cuz you feel like you're beating it up. Um or rock",
            "start": 3966.88
        },
        {
            "text": "speeding ticket eventually? It's just it's just too fast. And to drive it on the track, it was like almost too nice of a car to drive on the track cuz you feel like you're beating it up. Um or rock chips. So, you know, rock chips. I don't know about them rock chips. Are you getting the rock chips with your Toyota? Yeah, man. I got my dream car. All you want is obnoxious. When the last time you washed the Prius? I I actually wash it fairly. Do you? Yeah. It's just the problem is everywhere that I've ever lived in the last like [ __ ] ever since I've had a car. Uh it has the problem of the sap and freaking Tell me you got the bright orange color. No, I got I got the obnoxious blue. It is. Yeah, I'm a big fan. If you go to the window and look out, you'll see it right here. How sparkly it is. Is it douchebag blue? Oh, it is. [ __ ] yeah. It's douchebag blue. It is like as douchebag blue as That's how I live my life, though. like a quarter mile douchebag blue. No, it's that blue. It's that",
            "start": 4010.8
        },
        {
            "text": "Is it douchebag blue? Oh, it is. [ __ ] yeah. It's douchebag blue. It is like as douchebag blue as That's how I live my life, though. like a quarter mile douchebag blue. No, it's that blue. It's that blue color but with metallic [ __ ] in it. Yeah. No, it's it's you sporting douchebag blue. What's Oh, no. I had sky blue. That was like your shirt. Oh, yeah. That's definitely douchebag blue. Um but I only had I had a shitty 92 Camry and then a shitty 94 Corolla. And then eventually once I started all this, I was like, I want to get a real car like that doesn't break on me every two seconds. And I'm like, I'm going for the Prius C. And the only car I've wanted since the Prius C has been Bernie's Tesla because that thing's a [ __ ] that's just not like that is a Batmobile. And you get in there and I'm like I feel like this is a good value. It's just a little too expensive. But one day they won't be expensive. Our Uber picked us up for when we were going to Puerto Rico in a Model X. Brand",
            "start": 4050.84
        },
        {
            "text": "and I'm like I feel like this is a good value. It's just a little too expensive. But one day they won't be expensive. Our Uber picked us up for when we were going to Puerto Rico in a Model X. Brand new Model X. Yeah. I'm like, dude, you are just going to thrash this thing. Yeah. Do you see yourself ever getting a Tesla? Uh, no. No. Maybe like as a fourth car or something like that. I'm in California where we can have as many cars as we want. Not like here in San Francisco where every car is going to cost you a million dollars a year just to park it. So then tell tell us about your channel. What are you doing on the channel? I specialize in like modified car reviews. I find all the coolest cars in Southern California, which there's a lot. There's a huge car scene down there. And I hit them up. Normally just slide into their DMs and uh arrange a car shoot. So it's like post pimp my ride. Like you find the guys that went on the exhibit show and then you're like, I want to look at your",
            "start": 4088.56
        },
        {
            "text": "up. Normally just slide into their DMs and uh arrange a car shoot. So it's like post pimp my ride. Like you find the guys that went on the exhibit show and then you're like, I want to look at your car. It's done. Yeah. More like your Let me see. Let me see that PlayStation in the back. Comes out. The screen comes up. Yeah. But they're really all like really nice. Some Ferraris, Porsches, nice like driver's cars that have been like tastefully modded. Sometimes very heavily modded. Um and I get really good audio and video of the cars, nice rolling shots. Um, I try and get really high quality audio and video content of the cars because there's a lot of YouTube car reviews. A lot of car content on YouTube, but very few little of it is high quality. Even like Jay Leno's Garage, which I like that show, but like they're filming in LA. When they go take the car out and do rollers, there's like tons of other cars in the background. It's like dirty shots. It's just not a clean, nice, pretty",
            "start": 4128.4
        },
        {
            "text": "that show, but like they're filming in LA. When they go take the car out and do rollers, there's like tons of other cars in the background. It's like dirty shots. It's just not a clean, nice, pretty shot. You want to focus on the car. I don't want to see the reflection of the camera car in the car I'm shooting. You know, I'm trying to do it um high production value. And you're not a video guy. Like you just grew up around these guys, right? I'm an IT guy and I just uh you know, a little over a year ago decided I'm going to take my passion and start filming some of the stuff that I'm already doing. Um and the most impressive thing to me is that so you do really cool vids. Nick tells me about it. I met you at his bachelor party like years ago and then he's just like, \"Yeah, so we're we're doing this thing where he's he's going to do the really cool vids.\" I'm like, \"I'm sold on the name.\" And I was like, \"Okay, cool. Best of luck.\" But this is during the time when Nick's telling",
            "start": 4172.32
        },
        {
            "text": "we're doing this thing where he's he's going to do the really cool vids.\" I'm like, \"I'm sold on the name.\" And I was like, \"Okay, cool. Best of luck.\" But this is during the time when Nick's telling literally everyone he knows, \"You should make a YouTube channel. You should do this.\" cuz he was just converted. And uh and then so then I'm like, \"All right, cool. Like good.\" You and Matt are two examples where I'm like, \"We'll see how long this lasts.\" Midlife Ballers episode 50 something. And you're like, \"Huh? Holy [ __ ] You're doing you look use that show and you're like, man, Midnight Midlife Vers, shout out to you.\" You how many subscribers you got? Uh like 8,500. Oh, nice. Coming up on 10,000. What's your What are your views average for for your episodes? Uh depends on the car cuz it's all depends on how long. So people, if I'm a if I'm a Porsche guy or something like that, I'm coming to see Porsche stuff. I'm not chicken. So you're getting some good numbers on these. But yeah,",
            "start": 4207.92
        },
        {
            "text": "all depends on how long. So people, if I'm a if I'm a Porsche guy or something like that, I'm coming to see Porsche stuff. I'm not chicken. So you're getting some good numbers on these. But yeah, I just like I'm at 1.1 million total views for the channel um in about a year, which is great. We started off my show more like this podcast trying to emulate you guys. Um but sounds like another show. People don't really I found care who you are and what you have to say until they know who you are. So um I just went with my original focus, which is find cool cars, film them. Uh, I have my buddy Steven Hicks who's a excellent photographer. He comes out with me on the shoots and takes high quality pictures of the car which is awesome because then the owner of the car gets like this takeaway. They can print the images and hang them in their garage or whatever. Um, and just make awesome videos. There's really cool there's really cool guys in, you know, all these guys are really really nice and",
            "start": 4244.24
        },
        {
            "text": "can print the images and hang them in their garage or whatever. Um, and just make awesome videos. There's really cool there's really cool guys in, you know, all these guys are really really nice and humble and they build all these cars and a lot of times they don't get exposure. Maybe they'll get posted in a magazine, maybe not. Um, so my channel gives them opportunity to come on tell us about the car. I get to drive it for an hour, but like I like to have them in the passenger seat so I can interview them and ask them, you know, like about the build and what it's like to own and drive every day. And was it hard? Is that the video then? Like you have like a GoPro or something in there and like I have three GoPros and normally I change them up. So there's like four to six different camera angles, plus we do external rolling shots of the car with like my DSLR and a gimbal. So it's like high quality um nice lenses and stuff. And then I also cut in pictures that my buddy Steven Hicks",
            "start": 4284.4
        },
        {
            "text": "angles, plus we do external rolling shots of the car with like my DSLR and a gimbal. So it's like high quality um nice lenses and stuff. And then I also cut in pictures that my buddy Steven Hicks takes of the cars to keep it, you know, fluid. So you're not like staring at just me talking in the car, which you know is boring. You want to see the car. That's why you're watching the video. And that's what I want to show you. And not just clips like one second, one second like teasers. I want to show you like if you were to see the car on the road like breaking your neck looking at the car. That's what the shots on. Got So when you first started, was it hard to get people to do it? Like was there like you want to come drive my car for an hour? I have a lot of car friends. In fact, that's what I call my subscribers and my audience. Again, you're just ripping everything out to you guys. I I I was touched, you know. So, um my car friends, my viewers, which is a real term, you know, that's",
            "start": 4318.64
        },
        {
            "text": "I call my subscribers and my audience. Again, you're just ripping everything out to you guys. I I I was touched, you know. So, um my car friends, my viewers, which is a real term, you know, that's what I say to my my wife, you know, I have this car friend out. So, but yeah, I I hit my car friends up initially to start out and then um because I'm in the scene and I have a lot of buddies that have cool cars. Um after that, then it would made it easier because I was looked established and like I wasn't just some random guy. Gotcha. People pretty much say yes. I haven't had too much push back and there's such awesome cars in Southern California. Um, like the owner of Momo Steering wheels. Yeah, I'm reviewing his BMW M3 on this Sunday. How'd you hook up with him? Hit him up on his DM. Really? And there people are just so humble and nice. These guys all follow you back. Uh, I don't know. Yeah, to follow me back. I'm not sure. That's crazy. But they let me drive their cars and uh, that's all",
            "start": 4356.72
        },
        {
            "text": "there people are just so humble and nice. These guys all follow you back. Uh, I don't know. Yeah, to follow me back. I'm not sure. That's crazy. But they let me drive their cars and uh, that's all you care. Me out when I do it. Yeah. Yeah. So, it's Have you driven an Ecto1 yet? Are you going to do an ECO one episode? Do an ECTO one episode. Can you hook me up? Where do you have one? No, I That was always Yeah. No, that's one day. One day that'll be thing. Well, come on. Where am I going to park? If you do buy one, can you uh Yeah, you can drive that. Yeah. Yeah. Yeah. So, we we should Can we lock down the Prius C? We should lock down the Prius. I would love to do that. That would be the best thing in the world. I got a super sweet subwoofer in the back. Oh, you got a woofer? Yeah. Oh, so it's modified it. Yeah, it hasn't been modified. Yeah. That's all we need. So loud cuz the channels I've do many stock cars. They're all like modified cars. Um that's I modified my uh my rearview",
            "start": 4398.96
        },
        {
            "text": "so it's modified it. Yeah, it hasn't been modified. Yeah. That's all we need. So loud cuz the channels I've do many stock cars. They're all like modified cars. Um that's I modified my uh my rearview mirror. I got one of them those aftermarket like longer ones with the widescreen the HD mirror. Yeah. Yeah. Nick, how have you tricked out your car? Oh, uh, I haven't. Oh, yeah. What kind of car are you driving? I drive a uh 2005 Honda Accord. Have you even tinted the windows? Oh, god. No. You've been living with that car for like 12 years. No tint. I don't understand. Like, here's the thing. You don't understand tint? You understand heat? I understand all of that, but I live also a I live in San Francisco where this is as hot as it gets for one day. Uh, and B, I am a weird traditionalist when it comes to like modifying things. If I buy something and I like to keep it in that exact shape. I don't want to like like I can't understand like why people would take those amazing like you for",
            "start": 4434.56
        },
        {
            "text": "it comes to like modifying things. If I buy something and I like to keep it in that exact shape. I don't want to like like I can't understand like why people would take those amazing like you for instance your your your Audi TTRS had awesome rims that came with it. You were like these aren't awesome enough. I'm going to get even awesome rims with bigger tires and sell those and get another one then sell those. Exactly. So I feel like there's a part of my brain is it's it's twofold, right? One I like the like when I bought the thing I'm like I want to keep it in the exact shape that I I got it in. right? No reason to change it. And two, I feel like once I would once I do that, once I start down that road, there's no going back because I'm never happy once I start it. You know, you just got to call it like you see. I mean, for me, I was like, \"All right, there's three modifications that need to happen in my car.\" One, I need the the the subwoofer and we're good. Two, I need my my nice",
            "start": 4474.16
        },
        {
            "text": "to call it like you see. I mean, for me, I was like, \"All right, there's three modifications that need to happen in my car.\" One, I need the the the subwoofer and we're good. Two, I need my my nice HD mirror. And three, I accidentally spilled a vanilla latte all over my left door once and that'll never go away. So that's that's my clean. I cleaned the door, but it's in the speaker coil of one of the things. So that it's like it got embedded into the thing. I went in with a toothpick one time. It's just it's You can take that. It'll never go away. I'll fix it one day. But like I you know, that's how I monitor it. You won't though. I won't. No. Again, we're San Francisco. I'm not going to tint. You have sunglasses. Do you have sunglasses? No, I don't. I'm not an [ __ ] when it comes to to all that stuff. I like the music. Like I I'm not doing this to roll around and cruise and [ __ ] be an [ __ ] in my car. I'm doing it because I like how it sounds. So it's like I'm not going to mod my",
            "start": 4511.84
        },
        {
            "text": "that stuff. I like the music. Like I I'm not doing this to roll around and cruise and [ __ ] be an [ __ ] in my car. I'm doing it because I like how it sounds. So it's like I'm not going to mod my [ __ ] so my Prius C looks cool. No, you should worry about cataracts. You're fair skinned. I mean I' sunburned. It's a [ __ ] thing. True. True. True. True. True. You're getting old, buddy. Yeah. I don't know what cataracts are. The thing about the thing about modifying the cars though for me was like I've never had a car that I even give a [ __ ] about modifying. So you had like when you have a $70,000 sport vehicle. Yeah, it's fun to do that with. I'm like slamming out my Honda Accord. That's plenty of people that do, bro. Yeah, but it's like an automatic and like why? Just why? I never saw I never saw the point in it. So, Nick, where do you You've had your car a long time. What's What's your plan for? You just going to run in the ground? Do you have a car you want one day? Yeah. I mean,",
            "start": 4552.08
        },
        {
            "text": "never saw the point in it. So, Nick, where do you You've had your car a long time. What's What's your plan for? You just going to run in the ground? Do you have a car you want one day? Yeah. I mean, I'd love to get a new car one day. It's just the the problem with having a new car in the city is that it's very it's cost prohibitive, but it's also, you know, in Southern California, your car might get dinged when you go to like park it at a shopping mall or something like that, but overall, you're going to park it at a big space and that's pretty much it. Like, no one's bumpers are [ __ ] up in Orange County. I could not handle having any of my cars here. Right. I drove my Volvo up to San Francisco just cuz I didn't want to um expose any of my other vehicles to the harshness that is San Francisco parking. Yeah. I mean, people can't parallel park. They They park by feeling of your bumper, basically. When we came up for your wedding, we were I was parked right outside like the street and",
            "start": 4588.48
        },
        {
            "text": "parking. Yeah. I mean, people can't parallel park. They They park by feeling of your bumper, basically. When we came up for your wedding, we were I was parked right outside like the street and I was like constantly checking on my car and there's people just like parked. They're touching. This is the car. Yeah. With the bumper guards and all that. It's insanity. They don't care. They They actually use the bumper on the car as for what it's for. So, my car has I think 80,000 m on it. It is almost 11 years old at this point and it's still going. I just spent a lot of money to fix it because it unfortunately had a big engine problem. Um and the guy was like, \"Are you sure you want to do this?\" I'm like, I just look, a I don't want a car payment right now cuz there's nothing better than having a car that works and you don't have to worry about a $500 payment a month and b insurance has nothing on it and it's it's already like ex internally it's great ex the exterior is just it looks like",
            "start": 4623.04
        },
        {
            "text": "a car that works and you don't have to worry about a $500 payment a month and b insurance has nothing on it and it's it's already like ex internally it's great ex the exterior is just it looks like the [ __ ] Wolverine attacked it. It's terrible. Um and I just look like that. It would be heartbreaking for me to go through like buy a brand new Audi or something like that and then just see like the bumper systematically over a span of a year just get [ __ ] up because it would be terrible. That makes sense. I'm also just not a car guy so who cares. Yeah. And you're you're with your previous I I am in love. What do you drive with my previous car? Zero. I moved here bike out there. Yeah. Nice. Yeah. I uh when I those quads Yeah. And trust me, today was a great example of how bad the weather's been cuz like like leading I bought the bike uh like September of last year or whatever and rode for a bunch and then like the holidays came so we weren't you know I'm going here this is happening",
            "start": 4655.44
        },
        {
            "text": "been cuz like like leading I bought the bike uh like September of last year or whatever and rode for a bunch and then like the holidays came so we weren't you know I'm going here this is happening but then the weather gets bad and so like I think I rode like three times in February cuz it was so bad and we were on the road so much and then today getting out I was like it was like the hardest ride of my life trying to be able to do it. But no, uh, yeah, when I moved here, I moved here with the Mustang and then eventually was like sold this. But when I moved downtown and Ain was moving downtown, I was like, \"Well, I can walk to work.\" Do you use like Zip Car? Any of those like I use Yeah, I'll do Zip. Yeah. For going somewhere, I Uber all the time, stuff like that. And then, you know, if I need to, if I'm feeling like it, I'll MUN, but for sure like when I moved out when we moved out into the sunset and I was still down there and I rode the MUN every day when we started. Kind of funny.",
            "start": 4692.08
        },
        {
            "text": "need to, if I'm feeling like it, I'll MUN, but for sure like when I moved out when we moved out into the sunset and I was still down there and I rode the MUN every day when we started. Kind of funny. That was the thing of like never again, you know what I mean? cuz we were working from home and then when we came here, the bike offsets it enough. But yeah, no, I I love my Prius Cat, but there was a time like when I didn't when I wasn't able to get a car and it was just like whatever car was literally given to me for free. Uh I was just like, \"All right, what cars do I want?\" All my friends had cool cars and my friends were really into into that whole that scene. Um so they they all had like RSXs and the the STI and all that stuff and they they modified it and did all that. I knew I didn't want any of that, but I was like, I would give anything for a a 98 to 2003 Mustang cuz that shit's [ __ ] dope. A 98 Eclipse or a 2001 Celica was my like cuz there's no blue more obnoxious than my",
            "start": 4727.84
        },
        {
            "text": "want any of that, but I was like, I would give anything for a a 98 to 2003 Mustang cuz that shit's [ __ ] dope. A 98 Eclipse or a 2001 Celica was my like cuz there's no blue more obnoxious than my Prius C blue than the 2001 Celica blue. The word Celica is just obnoxious. Oh, I love the Celica. It looks like the Pokemon Scyther if it was a car. And it's just the [ __ ] best thing ever. It's like that thing. Oh, it's so dope. So [ __ ] dope. I feel like the Prius C is like the less cool version. Like if you took uh the 2001 Celica and just kind of like squished it together. That's what a Prius C is. I've never heard it described that way. Probably never will get there. No, it is if you look at them visually like you can there is like definitely a through line of Toyota being like, \"All right, we're going to have some things and like Yeah. It's like it's it's there. Let me believe. Give me this.\" Guys, let him have it. Fair enough. Do you have a parking space? Like could you have a car",
            "start": 4766.32
        },
        {
            "text": "we're going to have some things and like Yeah. It's like it's it's there. Let me believe. Give me this.\" Guys, let him have it. Fair enough. Do you have a parking space? Like could you have a car if they wanted? No. I mean it would be street parking now. I live in the house with Colin and before that don't have a car. No. No. Colin doesn't have a license. Uh before that a guy named Scott Brammley lived there and Brmley had a truck and he parked the truck. He had an agreement with the landlord to park it in the driveway and he did and then just never moved it for months. So when Brmley left a landlord was like and also no more parking in the driveway for anyone. Yeah. Yeah. Nick. Okay. Yes. What's your topic? Uh I'm fascinated by what you guys do when I can't see you. Uh, so when you go home at night, I want you guys to run me through your nightly rituals. How do you what do you do? What's your go-to meal? How do you decompress? Uh, because most of the time I have such a like problem",
            "start": 4811.36
        },
        {
            "text": "at night, I want you guys to run me through your nightly rituals. How do you what do you do? What's your go-to meal? How do you decompress? Uh, because most of the time I have such a like problem getting to sleep unless I can follow my ritual that I'll just stay up all night in my own head, good and bad, for for whatever reason, just thinking about what's happening tomorrow or the day before. So I'm always fascinated by how other people deal with that. I don't know, Greg, what do you do when you go home? First thing of first is walk porty, of course, right? Got to walk Porty. Got to feed Porty. Give them take the portillo's bowl from Chicago. Give it a little bit of food, maybe half of it on the side there. Take the can of dog food. Now, as you know, they used to sell little Paul Newman's can of dog foods in Andronicos. I did not know that. Then Safeway bought Andronicos. [ __ ] it all up. They only got these giant things now. I keep looking for the smaller cans. Can't you just keep",
            "start": 4850.4
        },
        {
            "text": "can of dog foods in Andronicos. I did not know that. Then Safeway bought Andronicos. [ __ ] it all up. They only got these giant things now. I keep looking for the smaller cans. Can't you just keep half a can and then put like cover it? Well, yeah, of course. But I still feel like I'm I mean Port's a little dog. I'm serving them like maybe, you know, a tablespoon twice a day here, right? You know what I mean? So, which used to be half of a small can, but think about how big that can is. with all the others stacked up. By the time I get to the bottom, that food's been open a while and I feel bad for him. But I'm also like, \"You're a [ __ ] dog. You should look. You should have been born a human.\" You know what I mean? Like, you haven't died yet and you're there. So, I feed him that. Watch him praise him a little bit so he actually eats it and drinks some water. He doesn't die. Then world's my oyster. Depending on the week and what's happening, right? I like, you know, you said, you",
            "start": 4887.52
        },
        {
            "text": "him praise him a little bit so he actually eats it and drinks some water. He doesn't die. Then world's my oyster. Depending on the week and what's happening, right? I like, you know, you said, you know, what do I do? Relax. And catharsis is cooking for me. I love cooking. So, like if I', if I had a chance, if it wasn't like Pax East this week, I've had a chance to plan out my meal schedule. So, I have stuff there to prep. if I know what I'm cook #cooking with greggy. Of course, how can you forget? Instagram.com/gameithggy. Cook all that stuff out and then do the dishes after that. Probably have a beer with it. Chill out. Some point there I'm on the phone with Jen. Of course, she's my girlfriend. I'll talk about her life. I've heard I love her very much. All right. Um and then it's into video games and it's or whatever other responsibility we have to do if it's scheduling a tweet or something like that. And then video games till Porty inevitably is in my [ __ ] face and I'm like, \"Do",
            "start": 4917.92
        },
        {
            "text": "games and it's or whatever other responsibility we have to do if it's scheduling a tweet or something like that. And then video games till Porty inevitably is in my [ __ ] face and I'm like, \"Do you want to go outside?\" And he wags his tail. And I go, \"Do you want you want food?\" And he he really wags his tail and I go, \"No, you're fat. You've already eaten enough food.\" This is fat dog. Yeah, he needs to be told. He could die. He could die. I can't humans can't die from being fat, but dogs can. No. One human being has never done that. Anyways, I yell at him for a long time and then he continues to step up and be in my face and on my chest. And finally, I go, \"Fuck you.\" I get up. I go give him a treat, sit back down, play the game. The next time he does it, we actually go outside. And then it's usually around, we're getting closer to bedtime. Come in, go to bed. I, you know, wash my face, brush my teeth. So, you take a break before in between the media and and going to bed. Well,",
            "start": 4952.8
        },
        {
            "text": "then it's usually around, we're getting closer to bedtime. Come in, go to bed. I, you know, wash my face, brush my teeth. So, you take a break before in between the media and and going to bed. Well, like this is where I get into trouble. This is one of the reasons why I don't like playing video games at night is because it keeps that part of my brain active that if I don't put a period of at least an hour in between doing something that's hand eye coordination and that I will sit up all night thinking about like like the other night I was like, how would I rewrite the original Star Wars trilogy? Like what would I what would a fan of Menace really should that really come? Oh, the prequel trilogy. I was like, \"You're thinking about how you'd rewrite the original. How could I make them better?\" No, no, no. How like like one, two, and three. I'm always like, \"God damn it, they [ __ ] that up so bad. How could I How would I re You rais an interesting point that is of course the Trojan",
            "start": 4988.64
        },
        {
            "text": "No, no, no. How like like one, two, and three. I'm always like, \"God damn it, they [ __ ] that up so bad. How could I How would I re You rais an interesting point that is of course the Trojan horse to all of this.\" And it of course is the phone. Yes. When I go to walk Porty, when I'm playing a video game, when it's a loading screen, it's immediately pop over to Twitter and Instagram. What's happening? Somebody's doing that. So to your thing, there's a break of me playing the game, but I play the game and I take port out and turn on the flashlight of phone and I'm checking red and I'm checking I'm talking to people on Twitter, blah blah blah and then I come in and I'm brushing my teeth and I'm checking my phone doing all that stuff and then you know then I get into bed and all the lights are off and I am staring at my phone doing that and then finally it's always that thing of like oh I'm going to go to bed early tonight. You know what I It's 10:30, 11:00, and then it's midnight.",
            "start": 5027.92
        },
        {
            "text": "are off and I am staring at my phone doing that and then finally it's always that thing of like oh I'm going to go to bed early tonight. You know what I It's 10:30, 11:00, and then it's midnight. You're like, \"Fuck, I got down this rabbit hole.\" And it's like, \"No wonder I'm always tired and I'm not making as much progress in games as I want cuz I'm [ __ ] doing this all the time.\" Right. Right. I mean, it does. I wonder how much of that does wear on you, though. Like, it it is it is like all day long. But not even that. It's the It's that weird part of your brain that goes, \"Hey, check it again. Check it. What's going on? Keep scrolling.\" And like that never shuts off in me now. Like I'm always the other night, I actually like yelled at myself because I had there was a break in between Here's how [ __ ] up this is. I was watching I had I had DVR Paycheck, which is an old Ben Affleck Uma Thurman movie based on a Phil K dick movie. I just was like, I haven't seen it forever. I'm going",
            "start": 5063.04
        },
        {
            "text": "how [ __ ] up this is. I was watching I had I had DVR Paycheck, which is an old Ben Affleck Uma Thurman movie based on a Phil K dick movie. I just was like, I haven't seen it forever. I'm going to watch it. It doesn't hold up as well as it should have, but I still enjoyed it. But it was DVR, so it had commercials, right? And the commercial hit and in between the time that it took me to remember that it was DVR and I could fast forward it, I already had my phone in my hand and I was checking out and I was like, \"What is [ __ ] wrong with me?\" Like, I don't need And from the other room, D's like, \"Let me tell you. Let me make you the list, honey.\" We we've talked about th that so many times on the show, but I I just think that that's just how things are nowadays where it's just like there's so much that happens on your phone where it's not like you're just scrolling through notifications on Twitter or like looking at Instagram pictures. It's like you are doing those things plus looking",
            "start": 5099.28
        },
        {
            "text": "so much that happens on your phone where it's not like you're just scrolling through notifications on Twitter or like looking at Instagram pictures. It's like you are doing those things plus looking at email, plus reading the news, plus looking at uh YouTube videos. It's like there's so much going on there that we did that before. or we just did it on a desktop of a computer or like did it while watching a TV or like it's just we're we're consuming way more types of content on a phone than than we were before. But I feel like it's gotten crazy though to the point where like it's just never done. Like even when we when we grew up in high school there was no cell phones and so like I can't even remember what we did when we went home. I think it was just 5 hours of TV. That was pretty much it. Snacking. But yeah, but even then I don't think I played that I guess I did play games in high school. Yeah, it was like N64 and like PC gaming. So that's I guess all I did. Well, what are you",
            "start": 5133.6
        },
        {
            "text": "it. Snacking. But yeah, but even then I don't think I played that I guess I did play games in high school. Yeah, it was like N64 and like PC gaming. So that's I guess all I did. Well, what are you gonna do? I don't know. Tim, what do you do when you go home? I mean, it's weird for me because I have a new ritual now. Now that you live now with Gia, it's like that it's totally like changing my game up. She cooks food. I've never had home-cooked meals in my life until now. Um, so it's like I've been used to just going out all the time. What's that like? Uh, it's weird. It's different. The other day I got home, my wife like I ordered us food and I was like, \"Oh, I almost cried.\" Oh, yeah. No, whatever. G is great and her cooking is really good. So, I'm like, I'm down with that. It just fundamentally changes like my routine. So, like I I feel kind of like my routine has been betrayed. Well, cuz prior to that, you used to always go out to dinner with Kevin every [ __ ] time. So, my routine,",
            "start": 5168.88
        },
        {
            "text": "changes like my routine. So, like I I feel kind of like my routine has been betrayed. Well, cuz prior to that, you used to always go out to dinner with Kevin every [ __ ] time. So, my routine, if I'm going to like explain it is I'm just not even going to talk about what's going on now with with the Gia situation. Uh, which I love and I'm not talking [ __ ] about. I know she's going to watch this and give me [ __ ] about it. But my routine is we'll go to work. And this is true whether it was IGN, preIGGN, kind of funny. It doesn't matter. Go to work, go through the day, do all the things I need to do, and then meet up with Kevin somehow, go get food somewhere, and take way too long eating it cuz we're just scheming. We're just planning the next thing. We're trying to figure out how to solve a problem we're dealing with. Like, all right, cool, Kevin. You now work at a lotion place. How can we get you working at IGN? Okay, Kevin, I now left IGN. How do we get you to work here? Okay,",
            "start": 5207.68
        },
        {
            "text": "solve a problem we're dealing with. Like, all right, cool, Kevin. You now work at a lotion place. How can we get you working at IGN? Okay, Kevin, I now left IGN. How do we get you to work here? Okay, Kevin, how are we going to get a video screen? You know what I mean? It's just like we just keep kind of like going through and he's like my bounce board for for ideas and like that's when like the real work got done, you know? It's like, all right, cool. I went to to work and got [ __ ] But it's like this is when the strategizing and the like the the real plans are starting to come together. It's like when you you create the the instructions to make the Lego set, right? So, I'm like, \"All right, cool.\" Then I'd go home and try to act on some of those things. go on the computer, start making lists, start hitting people up, start this it's the real the scheming, right? Yeah. Yeah. Um and then jerk it a little bit and then you beat that you beat that thing a little bit. Yeah. And then phone",
            "start": 5251.6
        },
        {
            "text": "start hitting people up, start this it's the real the scheming, right? Yeah. Yeah. Um and then jerk it a little bit and then you beat that you beat that thing a little bit. Yeah. And then phone calls. I'm a phone call guy. So, I'd call whoever it is I need to call to give attention at any given moment, right? I got this friend that's bitching that I haven't talked to him in too long. I got my mom. I got my my girlfriend. I got my my this, my that. Whatever the hell it is. I'm like, \"All right, you get this hour. You get that hour. you. It's like it was like a daily ritual. You get that [ __ ] out of the way. Then I lay down, try to sleep, but I can't sleep cuz I have insomnia. Because I Well, the problem is my entire life scheming and thinking, so I can't turn it off. You're putting the jerk in the wrong spot. Jerk before you go to bed and then you go to bed. The jerk. That's how it works. Now Kevin has feedback on this. He needs it to get the gears [ __ ] moving. You know what I",
            "start": 5288.32
        },
        {
            "text": "jerk in the wrong spot. Jerk before you go to bed and then you go to bed. The jerk. That's how it works. Now Kevin has feedback on this. He needs it to get the gears [ __ ] moving. You know what I mean? Yeah. I got to, you know, it's like I'm I'm one of them like Jerk just keeps me going. Jurg Jerk just gives me life. Jurgen makes me immediately want to sleep. [ __ ] you. No, I mean to be to be honest though, the jerking thing, if anything, it's way more just procrastinate. I don't want to call these people, better jerk off, play with myself. Call people or or it's like I'm doing work on the computer and I'm like, I wonder what's going on on eug.com right now. Like it's that type of thing. It was just like, you know, you're trying to think of other things to do instead of instead of Is it letter U or Y? No, it's YU. For any of the listeners out there, they might be interested. Yeah. And is this amateur or is this I wouldn't go to anyone else that wants to do it. Yeah, it's whatever",
            "start": 5326.16
        },
        {
            "text": "it letter U or Y? No, it's YU. For any of the listeners out there, they might be interested. Yeah. And is this amateur or is this I wouldn't go to anyone else that wants to do it. Yeah, it's whatever whatever you please. Whatever you're into. Um but yeah, it's usually uh a procrastination tool. Masturbation really is almost always when you think about it, you know. But now now it's replayed like now my ritual is all out of whack with that. It's like especially especially if it's a Monday #bachelor Monday. Things are different, you know. So wait, when does Gia go to sleep? Uh depends. the the ritual now is just it's totally [ __ ] Okay. So, she just when she wants because because I haven't had dinner with Kevin in years at this point. I was gonna say, how often do you look outside the house and see Kevin standing there in the rain just pawing at the He's pawing at the window. How long have you lived with Gia? Uh, let's see. 3 months now. I think I'm just pulling that out of my ass. It",
            "start": 5367.04
        },
        {
            "text": "and see Kevin standing there in the rain just pawing at the He's pawing at the window. How long have you lived with Gia? Uh, let's see. 3 months now. I think I'm just pulling that out of my ass. It feels like 3 months. I think it might be a little while. So, you haven't got ritual yet? Since uh December. Since December. Okay. Four months. Great. Yeah. And I mean, we do have ritual. The problem is with our jobs like rituals go out the window. We travel so much. So it's like, okay, cool. Yeah, we do have ritual. Oh, I'm gone forever. Oh [ __ ] now Zelda's here, so I'm playing that. Sorry. Oh [ __ ] Horizon's a thing. I need to I'm going to play this game for 20 hours. Got to leave you alone, babe. Got to do this. Yeah, she's great about that stuff. She likes to read and do all these weird things, so whatever. Drink wine, read. No. Yeah. I mean, Gia has rituals. Give me some G rituals. Left. I mean, it's wine and wine and books and cooking. She really likes to cook. So all of those",
            "start": 5409.68
        },
        {
            "text": "things, so whatever. Drink wine, read. No. Yeah. I mean, Gia has rituals. Give me some G rituals. Left. I mean, it's wine and wine and books and cooking. She really likes to cook. So all of those things, that's Gia. Nice. Yeah. Steve, what's your ritual? So, I think Nick, are you asking for rituals or are you asking how like we decompress before we go to sleep? I I mean either like what what what is your mentality when you go home? Like just walk me through it's 5:00, you come home from work or whatever. So, if I come home from work, my day job it guy, right? I want to hit the YouTube my second job now. So, I'll like start editing. Um which t is a long process, right? You guys know. Yes. Um we've been there once or twice. So, but I just jump on that. Uh, you know, I have dogs also. I have a two miniature dachshunds. Portillo's girlfriend, if he's ever looking for anybody. Yeah, totally. I got two to choose from. Dogs. Um, Pepper and Piper. Piper and Dolores. And Dolores. They're super",
            "start": 5445.92
        },
        {
            "text": "a two miniature dachshunds. Portillo's girlfriend, if he's ever looking for anybody. Yeah, totally. I got two to choose from. Dogs. Um, Pepper and Piper. Piper and Dolores. And Dolores. They're super cute. Pepper and Piper. Dolores. I forgot. I knew why. Piper. Piper. Uh, but yeah. So, I'll do YouTube, do the dog stuff, hang out with Jenny, my wife. Um, she also is not a big cooker. She is excellent at cooking, but doesn't cook regularly where it's like a Yeah. Yeah. So, we'll like get some type of take out most of the time. We've been doing better recently. But as far as like decompressing before I go to bed, like Frasier, watch like Frasier or Seinfeld. Is this on Netflix or is this Netflix or Hul or um Seinfelds has Hulu all has them all. Um we do commercial free Hulu which is fantastic. So there's no commercials. It's worth it. It's so worth it. We have I haven't had TV service for like eight years. But there's still ads in it, right? No tiers. There's two tiers. It's like you can",
            "start": 5487.12
        },
        {
            "text": "So there's no commercials. It's worth it. It's so worth it. We have I haven't had TV service for like eight years. But there's still ads in it, right? No tiers. There's two tiers. It's like you can either pay like the $10 or $13. 13 gets rid of Yeah, I mean, you're right. The last thing I want to say is the ge ritual definitely involves watching a lot more shitty TV than anyone could imagine. But that's for me that's a good shut off is just to like lay in bed and watch it. I'm like, but I do have to like struggle with the phone cuz I'm like checking my YouTube like trying to reply to comments and be active and um but I got to just put that down and just like listen to the the calming Frasier and calling salad and scramble. I was we were talking about Fraser on the show the other day and I'm like you don't realize how formulaic that show is unless you watch like 10 in a row. You're like it's the same [ __ ] episode every time just Fraser does something stupid or Nile. That's why it's",
            "start": 5532.72
        },
        {
            "text": "I'm like you don't realize how formulaic that show is unless you watch like 10 in a row. You're like it's the same [ __ ] episode every time just Fraser does something stupid or Nile. That's why it's easy to go to sleep too cuz it's just like I've seen this before. I don't have to think too hard on this one. But it's true. Like and that's why I don't like playing videos before before I go to bed because I'm always problem solving in that. Whereas in Frraasier they they solve their own stupid ass problems and if you don't if you miss half of it you're like who gives a [ __ ] Like there are times when with Frrazier I'm like did I finish that episode and then I'm like do I give a [ __ ] Do I care? Just go on to the next episode. I'm sure Raz got out of it. Okay. Yeah. Whatever whatever Raj's new relationship tragedy is that Frrazier helped her fix or whatever. Vice versa. Um I'm similar to you guys where like I but I have to be like really cognizant of it. I've been dabbling a little bit",
            "start": 5574.56
        },
        {
            "text": "new relationship tragedy is that Frrazier helped her fix or whatever. Vice versa. Um I'm similar to you guys where like I but I have to be like really cognizant of it. I've been dabbling a little bit in meditation these days to uh like mindfulness exercises um to turn my brain off because recently I've had a lot of problems just staying up till like 1 or 2 or 3 in the morning just staring at the ceiling letting I mean good things and bad things like I'm saying like so my nightly rituals generally if I can uh muster the the the gusto for it I'll go to a workout to some degree maybe it's yoga maybe it's jiu-jitsu maybe it's lifting um sometimes I take the night off but I'll go and then I'll come home usually go out and buy something way too ridiculous ly expensive for dinner cuz we never cook ever. By that point, my wife has already eaten dinner. So, we'll we'll because she comes home way earlier than I do. So, you know, she's off work around 6:00 or 7 sometimes. And I'll come if it's",
            "start": 5606.0
        },
        {
            "text": "ever. By that point, my wife has already eaten dinner. So, we'll we'll because she comes home way earlier than I do. So, you know, she's off work around 6:00 or 7 sometimes. And I'll come if it's after the gym or after jiu-jitsu, it'll be like 8:30, 9:00. I'll eat as soon as fast as I can. So, I'm not eating too late. And then we'll talk for 30 minutes, maybe an hour, hang out, then she goes to bed. I tuck her in, which I like. It's one of my nightly rituals. I get to tuck my wife into bed every night because she goes to bed like 10:00. And then I have basically from 10 to like 1:00 to do whatever I want. Um, jerk it. There will be Oh, yeah. There's definitely some slow jerking happening in there. That's just happening. Like, but that has to be you have to gauge, right? Because sometimes my wife [ __ ] with me and she'll like I'll be like, \"It's been a half hour. She's clearly in deep run.\" Oh, no. The door's open. And she has one more question for me and it's like, you know, like",
            "start": 5644.4
        },
        {
            "text": "my wife [ __ ] with me and she'll like I'll be like, \"It's been a half hour. She's clearly in deep run.\" Oh, no. The door's open. And she has one more question for me and it's like, you know, like like there's there's been a couple times she's like this. It's not warm. Uh, so why is your shirt off? She knows why. She's I mean it's very open with my wife of like what wait you Okay. I know this is slightly different topic but the rituals of of Nick time. Your shirts off. Oh sometimes the shirt question right out of my mouth too. Sometimes the shirt's off. Yeah. Sometimes I walk to the bathroom. You're like I'm going real hard. Oh. Sometimes I'll just be like this. No. What the [ __ ] did I walk into? Jesus. Exactly what you think you walked into, Kev. Here's how it'll work. Sometimes we have a floor to ceiling length mirror in my apartment. Oh god, stop there. It gets better, right? So sometimes I'm just in my boxers because I like to look at myself walk past the mirror. If I've just",
            "start": 5679.68
        },
        {
            "text": "a floor to ceiling length mirror in my apartment. Oh god, stop there. It gets better, right? So sometimes I'm just in my boxers because I like to look at myself walk past the mirror. If I've just worked out, I'll like flex my tricep. Gives me a little ego boost. He's got mad tries. And then also I have radiators in my house. So when my wife will leave the doors closed, it will be 95° in every room. like to the point where so I'll be like I have to take I have to like just be in my boxers right now to cool off and then I'll open the window a little bit and then it'll you know bounce out then it'll bounce out. No, there's no AC in San Francisco just in general. So I love everything about that Nick. But god damn I wish that story ended with sometimes I just like to just watch myself jerk. Oh that's that's only in hotels. Yeah, that's when you when you get into the hotel room you got to break that [ __ ] up. You know you ever break in a new hotel room you're like this I got 20 minutes.",
            "start": 5726.4
        },
        {
            "text": "Oh that's that's only in hotels. Yeah, that's when you when you get into the hotel room you got to break that [ __ ] up. You know you ever break in a new hotel room you're like this I got 20 minutes. You guys uh you guys want me downstairs in 20 minutes and you're just like deploy a ceiling mirror there. Let's just angle that so I can see my own [ __ ] and let's go. Let's just go. You know what I mean? Now, I'm with you with the hotel ritual. Yeah. Usually when you get to a hotel, I'm like, \"Yeah, yeah, why not break that? Let's do I'm not like looking territory.\" He's kind of like a little in the corner. God, make sure this the sheets stick together. Make sure that magazine they have that no one ever looks at is just glued shut. I need to look at that magazine sometimes. You don't look at that [ __ ] magazine. Um no. So like from 10 to to midnight is when I start the decompression process, right? And I love it because I don't have to talk to anyone. Like we spend so much of our day",
            "start": 5765.12
        },
        {
            "text": "at that [ __ ] magazine. Um no. So like from 10 to to midnight is when I start the decompression process, right? And I love it because I don't have to talk to anyone. Like we spend so much of our day talking to people that it's nice to just not say anything for three hours. Sometimes I'll play a game. Uh most of the time I write at least for 30 minutes to an hour every night. I'll just either work on screenplay ideas that I have or anime show or thing just things that like when when it's quiet that I can just focus and and that's I find that very relaxing. Although that that it's a double-edged sword sometimes too because if I if I get on a good thread then I'll be like, \"Oh, that's awesome. something I just wrote for 2 hours and it's time to go to bed. But then I don't really want to do that. I want to like watch TV for at least an hour. So now it's from midnight to 1 and then um but I've learned not to fight it. If you're ever like this is what I do if I'm ever in my own head and",
            "start": 5801.68
        },
        {
            "text": "that. I want to like watch TV for at least an hour. So now it's from midnight to 1 and then um but I've learned not to fight it. If you're ever like this is what I do if I'm ever in my own head and this is a great tool to recommend for everyone is that if you're in bed and you're trying to force yourself to go to sleep, you're not going to go to sleep. So what I do is I change the sit the circumstances. I go off to the couch, get comfortable, turn on Star Trek, the original show, and I'll just watch an episode, and without fail, 30 minutes, right around the time that like Kirk starts trying to like get on whatever girl they've introduced, I'll start falling asleep no matter what. Do you go to the c you go to the bed or you stay on the couch? I usually wait until I I'm I'm barely able to find the PS4 remote. Yeah. And then I hit it, hit it, hit it, and then I'm back to the bed and I'm done. Nice. So, so that's Sorry, go ahead. You go. It's interesting you say that because for me, I",
            "start": 5832.24
        },
        {
            "text": "find the PS4 remote. Yeah. And then I hit it, hit it, hit it, and then I'm back to the bed and I'm done. Nice. So, so that's Sorry, go ahead. You go. It's interesting you say that because for me, I don't give up. When I'm in bed and I can't do it, it's one of those where I like, \"All right, I'm clearly still running off on whatever idea threat I need to do.\" And it'll be that shut my mouth, breathe through my nose, and focus on it and the deep breaths of breathing through my nose or whatever. And that slows me down and gives me something to focus on enough to where then I I start drifting off. So, that's where the mindfulness comes in. So sometimes like lately I've been messing around with just doing like there's an app called Calm where it's just like 5 to 10 minute like uh mindful meditation exercises that you can do and it really works. It's crazy. So Greg you were uh talking that way and I totally instead I thought you said instead of drifting off you said jerking off. I'll be",
            "start": 5869.76
        },
        {
            "text": "exercises that you can do and it really works. It's crazy. So Greg you were uh talking that way and I totally instead I thought you said instead of drifting off you said jerking off. I'll be breathing through my nose jerking off and I'll just drift away. Yeah, totally. Wake up dick in my hand. Anyone ever tried the the counting sheep thing? No. As a kid I was I was like that's some [ __ ] But recently, I've been having a lot of of trouble sleeping just in like I don't know, maybe the last two years. Um, and every single time I try that, it eventually works. Yeah. It just takes a long time. Do you visualize the sheep? Oh, yeah. Totally. You visualize the sheep like the sleep number sheep with like the number on them as they go. No, the thing is they're just sheep. But the best thing is every time it's kind of different. But that's the problem is you need to not let your mind get there because man, I' I've gotten a little too creative. And then then you start thinking about how cool",
            "start": 5905.2
        },
        {
            "text": "every time it's kind of different. But that's the problem is you need to not let your mind get there because man, I' I've gotten a little too creative. And then then you start thinking about how cool these sheep can be and what they're doing. They're not like it like what happens with all are they just walking like there there's so much that goes on you can't let yourself get there you need to just focus on the numbers and that's why what I've started doing is take the sheep out of the equation and just just count and it's like there's been times there's been times I've got literally like I cuz I remember I was like holy [ __ ] I counted up to 1300 something last night and I was like but I don't remember past that so I fell asleep see I feel like that is a level of meditation by the way yeah no totally something to focus on that's what meditation is all The problem is you got to keep the [ __ ] out of it cuz like they distract me. Well, what I like about it is when when I when I'm",
            "start": 5944.96
        },
        {
            "text": "yeah no totally something to focus on that's what meditation is all The problem is you got to keep the [ __ ] out of it cuz like they distract me. Well, what I like about it is when when I when I'm trying to force myself to sleep and it's it it starts to work and I I'm getting and I'm not dreaming but I've gotten onto such a weird random story that I'm telling myself or whatever in there where I'm like, \"Oh man, I was almost there.\" Like that's how close I was cuz I was I was hung up on a but I'm all the way over here talking about X that has nothing to do with anything. I have a dream about Fat Joe then. Jesus. You know, California just recently passed some stuff that would actually help with disconnecting and turning off your brain. Yeah, not for me. You would think, but then that helps me to connect with my cabinet where all the food is and the refrigerator cuz my other problem is night snacking. That's something that I love to do. I [ __ ] love night like cuz I I snack when I'm",
            "start": 5981.6
        },
        {
            "text": "me to connect with my cabinet where all the food is and the refrigerator cuz my other problem is night snacking. That's something that I love to do. I [ __ ] love night like cuz I I snack when I'm bored. Like I use basically food as a tool for every like like unfortunate every Yeah. Oh, I'm super happy about celebrating. I'm going to eat. I'm bummed out. Let's eat. I am I have nothing to do right now. I've got 10 minutes to kill. Let's eat. Like so often times like and sometimes when I'm on like a crazy low carb diet like I will be really hungry and so I'll wake myself up. I'll wake up I've woken up at like 2:00 or 3 in the morning before going like oh [ __ ] I'm really hungry and at that point you have to just go eat something. Um or smoke a cigarette or Yeah. But I don't do that anymore. Thank god. Um but yeah, that used to be the best when I was single. I'd be like I'm up cigarette diet coke right back to bed. Those two do not make you go to bed. I was going to say that doesn't",
            "start": 6019.12
        },
        {
            "text": "Thank god. Um but yeah, that used to be the best when I was single. I'd be like I'm up cigarette diet coke right back to bed. Those two do not make you go to bed. I was going to say that doesn't sound right at all. Stimulants. No, it's it's uh Yeah, but but snacking is the my number one worst thing that I do because I [ __ ] love it. There's nothing that goes better with Netflix than like a giant bowl of like crunchy goldfish. Nick is a snacker. I can attest to Nick as being a snack throughout his life. She is a snacker. The the biggest snacker and she likes to just snack in the most obscene places, namely my car and my bed. And it's bed snacking is unacceptable. It's just unacceptable. She's turning Jen, dude. I know. She's turning Jen. I'm well aware of Jen snacking there and then like yeah we did room service styles come let's eat it in bed. I'm like it's not a thing I do I don't really do that like eating bread like it's all crusty. I know but still like I'm setting a bad",
            "start": 6053.76
        },
        {
            "text": "like yeah we did room service styles come let's eat it in bed. I'm like it's not a thing I do I don't really do that like eating bread like it's all crusty. I know but still like I'm setting a bad precedent. You know what I mean? It's like you let him jump up on your lap. You eat on the bed with the the top with like the the And that's fine in hotel in the bed. But it's weird to eat in my bedroom my my bedroom. You know what I It's happened a few times, whatever, where Colin's entertaining or doing something out there. Like, oh, I want to give him his privacy instead. I'm in there with like at my desk eating like a dinner. I'm like, I just cooked this like steak and this stuff. I'm sitting here like, yeah. And then it's it's it's the whole thing. But like she she has this addiction to to Pringles, specifically the green sour cream onion ones. And that makes sense to me. I get it. Um, it's that and the and the hot Cheetos, which duh. But her [ __ ] thing with the Pringles is and and I",
            "start": 6097.76
        },
        {
            "text": "Pringles, specifically the green sour cream onion ones. And that makes sense to me. I get it. Um, it's that and the and the hot Cheetos, which duh. But her [ __ ] thing with the Pringles is and and I know this just to be true. She she doesn't just want to eat Pringles. She only wants to eat Pringles when there's no Pringles in the house. So, it's like it's one of those things where she starts thinking like, \"What snacks do we got?\" Okay, we got that shitty popcorn that she likes. We got like all these. Yeah. The really white popcorn. White cheddar. Yeah. It's like there's all these things she goes to like I don't want any of that. I want Pringles. What's Tim doing right now? He looks real comfy on that computer chair. Hey Tim, do you want Pringles right now? No, I'm good. I haven't wanted Pringles in 20 years. I don't want Pringles. like, \"Do you want do you want to go get me Pringles?\" I'm like, \"I'll go get you Pringles.\" How close are Pringles to you? Um, about a block and a half",
            "start": 6132.4
        },
        {
            "text": "Pringles in 20 years. I don't want Pringles. like, \"Do you want do you want to go get me Pringles?\" I'm like, \"I'll go get you Pringles.\" How close are Pringles to you? Um, about a block and a half walk. Oh, nice. Which is not too bad. But when it's like, \"Okay.\" But I mean, the thing is like whatever. She expects you to be able to get Pringles. She's never asked me to do something where I've said no. I'm like, \"All right, I I'll given her so much [ __ ] to deal with in my life.\" Kevin Coella being one of those things. Yeah. He's unfortunate. You do. You do. But then you guilt her at the movies and it becomes a whole thing and then we all had to deal with that. She [ __ ] up in the movies. All right, don't [ __ ] turn this around about me. We was talking about this the other day. What What happened with this? It was one of those where like I remember I think Je was like, \"Kevin's kidding, right?\" I'm like, \"Oh, no. He's dead serious. This is a real thing.\" You know, when we're in",
            "start": 6171.12
        },
        {
            "text": "What happened with this? It was one of those where like I remember I think Je was like, \"Kevin's kidding, right?\" I'm like, \"Oh, no. He's dead serious. This is a real thing.\" You know, when we're in group settings and Kevin likes to be like the alpha male like like everyone pay attention to me, right? Yeah. Gio accidentally didn't do that. It wasn't accident. was when we went to see like full on asked me the last movie we went to Logan and you and yeah cuz you and you, me and Jen were at the one end and I was towards the middle and Kevin was over here and Gia was there and Gia asked me a question and then turned around and then immediately turned around and just asked Jen the same question as I was answering it and it was like what the [ __ ] and then she did it again. So, what gets me about Gia and the Pringles is that it's it's never just like if if it was just a minor discomfort to me, I'm like, \"All right, fine. I'll do this.\" But it's always like, \"Okay, it is 9:57.\" And",
            "start": 6209.44
        },
        {
            "text": "me about Gia and the Pringles is that it's it's never just like if if it was just a minor discomfort to me, I'm like, \"All right, fine. I'll do this.\" But it's always like, \"Okay, it is 9:57.\" And Walgreens closes at 10. You want me to run? You want me to never miss out on Pringles? Get a bike. But every single time I go there, the they don't have the sour cream one. I'm like, \"Awesome. Stop asking me for the sour cream one.\" So, now she has this war. She has a [ __ ] war with this Walgreens. How do you not have the green Pringles? Solid point. Solid point. Should they have a suggestion box? But I don't know. They do have a dude that stands outside like whatever. Have you now? Have you thought about getting ahead of this? Secretly ordering a bunch of Pringles and stashing them in a tall drawer she can't get to. You know what? A tall drawer. She's tiny. She's a tiny little girl. Give her to the seat. You know what I haven't thought about? I should probably just That would be the most",
            "start": 6248.64
        },
        {
            "text": "drawer she can't get to. You know what? A tall drawer. She's tiny. She's a tiny little girl. Give her to the seat. You know what I haven't thought about? I should probably just That would be the most baller move is she's like, \"Tam, do you want a prank?\" You're like, \"Boom.\" My computer desk. You pull You pull a rip cord and she's just pelted with green finger. I think you're just You're just counting one small thing. Sure. Which is that? Gia. No, I mean cuz my wife does the exact same thing to me. Mine does the same thing to you. There's just a very nice feeling my wife gets when she asks me to do something for her and I go in. I think that's more important than actually having the thing. The other night I w and I do this now. This is what I do because I I I will I'm I'm with you. I actually wrote it into my marriage vows that I would always go and get my wife frozen yogurt whenever she wanted because we were on this like she loved frozen yogurt from this specific place and it was",
            "start": 6296.0
        },
        {
            "text": "wrote it into my marriage vows that I would always go and get my wife frozen yogurt whenever she wanted because we were on this like she loved frozen yogurt from this specific place and it was only like five blocks away and I'm like no matter when you ask me no matter what's going on I will always get you frozen yogurt. And so man shouldn't have put that in there. But she takes advantage of that vow. She does. But she always gets she's always been home for like two hours before I get home. Right. And no matter what like she's always cozy on the couch. I don't want to disturb her on the couch. But I know now when I walk through the door, I'm going to talk to her for five seconds and I'm gonna act like I'm about to sit down and I'm getting cozy, but my shoes stay on because I know in like last night, perfect example. Hey, I got you some Chinese food. Awesome. Thanks so much. About to take you do the thing with the heel toes on the heel of the shoe. I stopped. I'm like, no, you know",
            "start": 6336.72
        },
        {
            "text": "last night, perfect example. Hey, I got you some Chinese food. Awesome. Thanks so much. About to take you do the thing with the heel toes on the heel of the shoe. I stopped. I'm like, no, you know better than this. And I looked at her and she was like, do we need some dessert tonight? It's always a question. You do. I'm like, you're right. We do need dessert. What? What are you thinking? She's like, I don't know. What do you think? And I'm like, whatever the first thing I'm going to say is wrong, so just get frozen yogurt. No, no, that doesn't sound right. How about we get a couple diet cokes? Like, you want a couple diet cokes, right? I'm like, I sure, I absolutely was. I was just going to go get them. So, I'm going to the store anyway. You read my mind. She's like, I think I want these specific little chocolates that they have at the store. Just the yellow ones. And I hate doing this cuz I have to go to the [ __ ] liquor store. I look at the guy who looks at me and he goes, he just",
            "start": 6371.92
        },
        {
            "text": "specific little chocolates that they have at the store. Just the yellow ones. And I hate doing this cuz I have to go to the [ __ ] liquor store. I look at the guy who looks at me and he goes, he just shakes his head. And I have to [ __ ] le root through all these tiny little chocolates to find these yellow ones that she likes. And then if they don't have them, I have to be like, \"Yo, bro, do you have any? Do you have another box of these?\" And the box, he's opened so many [ __ ] these boxes that it's overflowing with all these little um they're these Ritter Sport chocolates. Okay, they they're European chocolates. They make them in the big bar, but she doesn't want that. She wants the three little tiny ones. And so I've had him open up so many of these big boxes of them that they just pour them on top so I can rip it through. And they're overflowing constantly. And this guy sees me, he just shakes his [ __ ] head. And I'm like, I'm married. What do you want? you. That's what you got",
            "start": 6404.56
        },
        {
            "text": "them on top so I can rip it through. And they're overflowing constantly. And this guy sees me, he just shakes his [ __ ] head. And I'm like, I'm married. What do you want? you. That's what you got to do. You do this for your wife cuz she would do it for me. A That's true. If you didn't know, this has been the Game Over Gregie show each and every week. Four, sometimes five. Best friends gather on this table. Each bring a random topic of discussion for your amusement. If you like that, head over to patreon.com/kindfunn where you can toss us a few bucks and get every episode early along with a bunch of exclusive goodies, perks, and other things. But if you have no bucks to toss, no big deal. Head over to youtube.com/kindfunny where we post the entire show topic by topic day by day until it goes up as one big video and MP3 stew. Yes, you've been a pleasure. Thank you. Thank you for coming by. Been fun too. Thanks for making him the guy he is. Thanks for lunch. No, no problem. No. Uh",
            "start": 6440.72
        },
        {
            "text": "it goes up as one big video and MP3 stew. Yes, you've been a pleasure. Thank you. Thank you for coming by. Been fun too. Thanks for making him the guy he is. Thanks for lunch. No, no problem. No. Uh really cool vids. That's it. That's how they find cool videos. I also have a blog willycoolvideos.com cuz sometimes after the cameras get shut off I remember other things other stories that can't make the cut. I like to keep the videos like 10 minutes. I don't like to go too long. I respect you guys' time. What do you want on Twitter? Willie Vitz. Willy Cool videos. Or actually, it's Willie_cool on Instagram. And I don't I don't want to get crazy here. Let's have a [ __ ] focus. 10,000 subscribers is the goal. You're currently at 8,000 500ish. 500. So, we need 1500 people to subscribe to youtube.com/ really cool videos. If you guys like cars out there, wh e l y. That's right. Gotcha. Just make sure. No, I No, it's fine. cuz you said like really so I wasn't sure. Okay. Uh but yeah, if you",
            "start": 6477.2
        },
        {
            "text": "really cool videos. If you guys like cars out there, wh e l y. That's right. Gotcha. Just make sure. No, I No, it's fine. cuz you said like really so I wasn't sure. Okay. Uh but yeah, if you guys like cars, I promise you I have some ex excellent content on cars. Um high quality video and audio, excellent modified cars, just not your normal stock Porsche. I got the Porsche that the guys put like an extra 30 grand into and dialed it in. All right. Um Well, cool. Dream cars all day. Well, thank you so much, man. Thank you. Until next time, ladies and gentlemen. It's been our pleasure to serve you. Hey, thanks for watching. You can subscribe to the channel here. You can support us on Patreon there. You can go over to kind of funny games, support us there because we put up a whole bunch of other shows and things that distract you. And then you can click on that mystery box. Kevin, what's the mystery box? Playlist. The playlist. It's got a whole bunch of playlist of things we've done",
            "start": 6522.88
        }
    ]
}