{
    "id": 1325,
    "video_id": "kYVoCbPyGgM",
    "show_name": "Gameplay",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "Colin Plays Call of Duty Black Ops 3 - Kinda Funny Plays",
    "description": "Colin tries out some Call of Duty Black Ops 3.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1446728405,
    "duration": 1681,
    "transcript_chunks": [
        {
            "text": "greetings and salutations welcome to Kinda Funny Games My name is Colin Moriarty today I'm Gonna play for you Call of Duty: Black Ops 3 we're going to play the campaign I'm just going to start it out here we'll see what happens uh please pick customize your operative so I'm going to choose my gender I'll play as a man um and then it says select face all right who do I want to play as I like this guy I'm going to play as him uh usually I'd play on Veteran I'm not going to subject you to that for this let's play I'll jump back in and start on Veteran like delete my save later I'm not going to die a billion times and make you go through all this all right so this is my character we're playing on normal difficulty and we're going to jump in now the big thing with this is that you can go as far as I understand um maybe this is not the game I was thinking of where you can go to like any mission in any order maybe it's a different shooter I don't know uh nonetheless I'm going to start from the",
            "start": 0.16
        },
        {
            "text": "I understand um maybe this isn't the game I was thinking of where you can go to like any mission in any order, maybe it's a different shooter, I don't know. Nonetheless, I'm going to start from the beginning and we'll see what happens all right so we're going to watch the intro here. I can't really hear it on this TV because I don't want it to come through the microphone, so I'm going to assume something interesting is being said about stuff. I'll sit back and we'll watch all right, we've seen enough. I want to play \"Things Are Burning\", trucks are burning, everything's burning, very Call of Duty is so far still can't hear anything that's going on on the TV, I know, have no idea what he's saying, I'm going to do this uh options audio no oh no there it is subtitles, this is what I need so I can understand what the hell is being said. We have a fuel Runway NT course for landing to Runway 11 please confirm, oh there's some dead men in the corner, there something nefarious is going on here and I don't",
            "start": 41.16
        },
        {
            "text": "what the hell is being said we have a fuel Runway NT course for landing to Runway 11 please confirm oh there's some dead men in the corner there something nefarious is going on here and I don't like it one bit got we don't want to hire too much we're gonna get loud talking to Kevin in case you're curious confam AC is good down here possible malfunction at your end yeah thank you I'm firing the dead system uhoh oh my God so much drama already in the beginning of this Call of Duty Black Ops 3 campaign all right can I control can I play now fantastic all right who's the enemy you guys are f are you enemies I'm going to assume you're the enemy charge me to tell the very action movish I mean this is why I like this stuff picking up the oh so I found the collectible looks like the earpiece is a collectible that's pretty cool I like Collectibles I'm a huge fan of Collectibles and I'm being dead serious when I say that anything interesting over here like it Hendrick it's one of my guys who's my",
            "start": 144.68
        },
        {
            "text": "that's pretty cool I like Collectibles I'm a huge fan of Collectibles and I'm being dead serious when I say that anything interesting over here like it Hendrick it's one of my guys who's my other guy here Alpha Hendricks all right I don't know I guess these are just random people I can't even aim here so I guess I'm just going to run through an airliner has crashed quite violent Jesus Christ look at this guy hello friend that was a very cool very cocky kind of let's go this way thing he just did with his head I didn't like it all right I feel like I just killed guys with red bra on these are I don't understand who's my friend it's cuz I can't hear anything all right Taylor we're at the security station moving to secure sounds good let's do this let's why can't I shoot anyone you had to kill them both that's a little these guy's like just showing off I don't like that **** I'll kill the alarms on this floor get plugged in and loc Taylor scan for there's more hostages",
            "start": 234.04
        },
        {
            "text": "you had to kill them both that's a little these guys like just showing off I don't like that crap I'll kill the alarms on this floor get plugged in and loc Taylor scan for there's more hostages than just the minister we're going after this guy's getting the **** beat out of him that's not cool The Known Taylor did you know there were other prisoners Jesus guys aren't messing around understood check the next we have our orders man this is crazy that's him Minister he's being taken we have to find out where they're taking Bingo match confirmed moving to secure all right let's do it son of a **** was never funny trust me I am going to the bowels of this compound shot them all on the crotch totally unnecessary grenade all right did I get that guy no a little rusty for sure damn Dam just got **** up who else is around guys are still alive oh that's Hendrick guy's like **** Rambo just jumping around like a maniac I typically don't play nearly this aggressively because I'm",
            "start": 354.24
        },
        {
            "text": "got **** up who else is around guys are still alive oh that's Greg guy's like Rambo just jumping around like a maniac I typically don't play nearly this aggressively because I'm usually in veteran so it's a little interesting for me to play this way I would have died like 17 times already if I did it all right guy up there pop him right in his **** head there we go I think that's everyone gunplay is awesome the guns feel great or the gun I should say I've only used like one of them but I love it that's why I play Call of Duty every year just the campaign I don't play online I've never played one match of Call of Duty online I don't think in my entire life um anything interesting around here to find um guess we'll just breach door uh I just love the Gunplay I think it's just so expertly done in Call of Duty games I know there's different developers and things may have a little bit of a different feel but I do think they're generally master classes and how a",
            "start": 508.2
        },
        {
            "text": "It's just so expertly done in Call of Duty games. I know there's different developers, and things may have a little bit of a different feel, but I do think they're generally master classes on how a shooter should feel, a first-person shooter should feel, and that's why I really enjoy playing. It's like an action movie; it's like spending a weekend with the game, that's what I enjoy doing every year. So Minister S... uh... on what am I supposed to do? What am I supposed to do? I don't understand what you mean for me to do. We're here to extract you. Going to pop this guy in his head one more time. Do as I say, abouten. And Egyptian okay. Oh, there's another collectible. So it seems like the collectibles are all different. I got an Egyptian Army Cap. All right, let's get our friend here, Minister S, out of here. Here this one, get the door. I'll cover. All right, I'll cut the poor bastard down. Anything I find in here doesn't... Can you fight? Always we'll grab a weapon from the locker room up ahead and reprogram it to master.",
            "start": 572.56
        },
        {
            "text": "one get the door I'll cover all right I'll cut the poor bastard down anything I find in here doesn't can you fight always we'll grab a weapon from the locker room up ahead and reprogram it to master sounds like they're finally on to us let's move Taylor package plus one secure and inbound his name is Lieutenant sound familiar get ready to go loud oh those aren't explosive barrels they okay uhoh a little too crazy with it better take cover go prone oh I got a Trophy there I guess cuz I was trying to hide oh that's Hendrick is that everyone this my friend it is okay let's go shotgun oh **** there's a grenade oh God there's a grenade there too it's fun to be able to play the game a little more twitch like and frantically than I'm used to um playing on Veteran there's also the Realistic or mode or whatever the **** it's called and this is a Hardened mode I don't remember really what it's called though um the one where you take one hit and you die that doesn't sound fun to me at all I will",
            "start": 626.68
        },
        {
            "text": "or whatever the **** it's called and this is a Hardpoint mode I don't remember really what it's called though um the one where you take one hit and you die that doesn't sound fun to me at all I will probably not be messing around with that which means I have no chance to play on the game but there's just no prayer of me doing that oops oh guy there **** cool yeah the game really does feel great it's frantic it's it's fun I wish I could hear it a little bit louder and kind of get a little more immersed into it but I'll go back and play it again on my own this is my first time I've even sat down with the game at all and played the campaign I played Zombies depending on when you're watching this uh by the way and I'll reiterate at the end of the video uh I did a vid for Zombies as well may may or may not be up funny little video of me playing it by myself be nice to be able to aim right now Jesus Christ it's like a **** graveyard in here F nice to see you Jacob you too John you look",
            "start": 763.48
        },
        {
            "text": "may or may not be up funny little video of me playing it by myself be nice to be able to aim right now Jesus Christ it's like a graveyard in here F nice to see you Greg you too Colin you look different that that guy from Law & Order you still see Rachel that didn't work out that's petty New Blood going to take care of him as good as you did me that's not fine there's a there's a there's a history here between these two Let's see we have new characters oh stealth camo cool some ammo over here I guess we can fill up thank you it's cool it's the game's like so frantic you almost have to feel bad for developers that make like take spend so much time on these little set pieces that you just run right through basically and you never see them again definitely love put into it for sure oh that's my friend okay I don't want to shoot him sorry Greg I don't know you I don't really know you yet trying to get to know you still No Escape we're going to wreck and Shop over here all",
            "start": 823.48
        },
        {
            "text": "\"Sure, oh that's my friend okay I don't want to shoot him sorry Diaz, I don't know you I don't really know you yet trying to get to know you still No Escape we're going to wreck and shop over here all right whoa okay those are my friends everyone's making me a little nervous here I'm little little trigger oh my god oh jeez cool APC is down these guys red berets are like the hell gas orange eyes you can kind of looking for them although those silver shotgun troopers are a little harder to see and they do quite a bit of damage resupply box I should probably do that one here what is this SP oh oh no no no no no oh there still enemies Al oh he's still alive any collectibles or anything you have to assume there's a collectible in here somewhere he I guess not damn this this opening scene is pretty cool huh look to your right son there you go see we got this guy over here trying to be cute got this guy over here starting to get real see if I can get rid of this guy since he's going to cause\"\n\nI corrected the following errors:\n\n- \"Diaz\" (presumably a reference to the video game character) was left as is, but it could potentially be a phonetic error for \"Diablo\".\n- \"red Berets\" was corrected to \"red berets\", making it lowercase since it's not a proper noun.\n- \"SP\" was left as is, but it could potentially be an abbreviation or acronym that wasn't clear from the context.",
            "start": 906.32
        },
        {
            "text": "cool huh look to your right son there you go see we got this guy over here trying to be cute got this guy over here starting to get real see if I can get rid of this guy since he's going to cause some problems guess not CR do down here kick back on this gun F I wonder if this is like World at War where it's uh you got to kind of Advance or the enemies will spawn in definitely I hate that **** but I don't know if that's necessarily the case here what is this thing that's glowing red it's just attracting my eye I guess it's just nothing all right to this next building where my friends are waiting I've already killed like 100 people I think completely Mass murdering oh creepy cool that's a plant that I'm just aiming at for no reason all right this is pretty cool little gimmick cool now what than oh I shoot missiles oh someone jumped and took that wall right down oh that's my guy okay keep shooting my own dudes heal up real quick neutral okay there's a guy up here that's pissing me off",
            "start": 1059.08
        },
        {
            "text": "than oh I shoot missiles oh someone jumped and took that wall right down oh that's my guy okay keep shooting my own dudes heal up real quick neutral okay there's a guy up here that's pissing me off someone already got him this looks like a place where a gunfight would happen oh my God I probably want to run back here oh this is creepy I don't much care for it my grenade does any damage I need to get the out of here oh I got to go oh maybe I'd stand my ground but that didn't seem like a smart idea not a mission priority it may not be a top priority but there are still people damn it or have you changed so much that you forgotten what that feels like damn there's a history between these two I'm telling you all right change of plan Hendrick your team team we'll escort the minister to the extractor we'll go back and get the hostages more robots worry about them we're built to handle them come on get out of here go take come I got the wheel get on the turret how okay like a GI",
            "start": 1227.32
        },
        {
            "text": "to the extractor we'll go back and get the hostages more robots, about them, we're built to handle them, come on, get out of here, go take, come I got the wheel, get on the turret, how okay like a GI Joe vehicle it's is awesome oh doing quite a bit of damage to these things with my bullets I tell you that they seem's kind of crazy it just like doesn't stop a lot of different stuff in it definitely opens it up with a bang I'll give him that pretty cool barely tell what I'm even shooting at here these robots are creeping me the **** out hey, any minute now get that thing going if you want that'll be really helpful thank you, L of explosions Jesus these guys aren't **** around keep coming these things called accolades I wonder what those are all about oh I just screwed that guy up their guard Tower can we screw that one up do that je this is f hectic all right now we're on a cut scene it looks like we got a little bit of who's shooting at me oh these **** guys defend I have to",
            "start": 1348.96
        },
        {
            "text": "Guard Tower, can we screw that one up? Do that. This is hectic. All right, now we're on a cutscene. It looks like we got a little bit of who's shooting at me. Oh, these guys defend. I have to defend it. All right, we don't really need that. Can I come in? Am I allowed in? Just tell me to defend. Defended. I'd really like to just get in and get the out of here if that's possible. What happened? Can I go? No, no, no. What happened? Help me. Oh my god, did that guy just rip my arm off? Holy Christmas. Oh no, oh my God. Jesus Christ is terrible. All right, I'm dead. I'm dead. I get it. Hey, oh my God, be all right. Hang in there. All right, I think it's a good place to wrap it up. That's Call of Duty: Black Ops 3, the beginning of the campaign by Treyarch. Hope you enjoyed it. Well, let's take a look at this rewards here. This is cool. 161 kills. I'll take it. Leveling up. I like leveling up. Accolades. This is what we were talking about before. Cool. I'm down. I'm digging it. I can't wait to play more of this, thank you.",
            "start": 1479.96
        },
        {
            "text": "Here this is cool 161 kills I'll take it leveling up I like leveling up accolades this is what we were talking about before cool I'm down I'm digging it I can't wait to play more of this thank you for joining us for the let's play of Call of Duty Black Ops 3 available on PS4 Xbox One PC the campaign you can buy it on PS3 and Xbox 360 but you will not get the campaign on those platforms uh thank you for supporting us here at Kinda Funny Games we'll be back for another let's play many more let's plays in the future so keep supporting us if you can we appreciate you very much till next time goodbye",
            "start": 1638.6
        }
    ]
}