{
    "id": 1342,
    "video_id": "p8mzC1PCDgo",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Kojima and Konami Update - Kinda Funny Gamescast Ep. 44 (Pt. 3)",
    "description": "We discuss the current status of Kojima and Konami.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1447250402,
    "duration": 854,
    "transcript_chunks": [
        {
            "text": "Today's sponsor is Loot Crate for less than $20 a month. Loot Crate gives the geek and you a special treat every month. Loot Crate's a subscription box service with $40 worth of geek, gamer, and pop culture gear: Collectibles, apparel, Comics, and More delivered to your mailbox every month. This month they're bringing you A Fight for the Ages: Suit up, choose your allies, and enter the arena for combat; they're ready to stand their ground this month. Exclusive items from Blizzard, Fallout 4, Capcom, sponsor-worthy loot from The Hunger Games, as well as a few more items will help your winners emerge victorious in this box. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate; and when the cut-off happens, that's it—it's over. So go to LootCrate.com/kfam and enter code kfam to save $3 on your new subscription today. The third topic of the day is this whole Konami deal. Oh, let's get right into this: Kotaku says seeing how Konami took Kojima's name off the Phantom Pain's box art.",
            "start": 0.04
        },
        {
            "text": "save $3 on your new subscription today third topic of the day it's this whole konami deal oh let's get right into this Kotaku says seeing how Konami took Kojima's name off the Phantom Pain box art dissolved his studio in Silent Hills it's hard to see him staying on for the uh you know for any of the stuff especially considering the rumors about konami's work environment recently Kojima said what seemed to be his goodbye to the series then Konami confirmed the Konami La Studio has been closed and said when we start development a large scale investment will become necessary in reference to the next Metal Gear Game while the paper reports that Konami is merely examining plans for another Metal Gear Konami previously stated it would continue making more games in the stealth Series so guys what does all this mean for the industry Konami is getting out of AAA games totally yeah we we talked about it that was the thing it seemed that that was the rumor forever right with the rift",
            "start": 36.88
        },
        {
            "text": "So guys, what does all this mean for the industry? Konami is getting out of AAA games totally. Yeah, we talked about it - that was the thing it seemed that that was the rumor forever right with the rift between him and Kojima, the fight over all this stuff, y'know so on and so forth. They released Metal Gear Online four weeks ago, tops. I don't even remember it was October, right? Second week of October, and uh now they're already closing down the studio that made that part - that was the team who were like working on that game. They're gone now. They say that in their press release, of course, that now it's just moving to Japan; people are still working on this game; they'll still support it; it's still coming to PC, you know next year or whatever. It's like okay, we'll see how supported it really is and what that means. But yeah, I think it's all platitudes in the way of Konami acting like they're still going to do it but I don't think they are. This also jumps back to the sales that came out for how",
            "start": 83.48
        },
        {
            "text": "what that means but yeah I think it's all platitudes in the way of Konami acting like they're still going to do it but I don't think they are this also jumps back to the sales that came out for how Metal Gear Solid sold right 5 million units it's like that's a month that's good it's not great it's not the juggernaut numbers and I'm sure the people at Konami who are saying let's get out of the console business we make more money at Pachinko we make more money on these things you know what I mean they're now pointing this and saying see we were right it took him how long to make this game how many millions of dollars and this is what it returns immediately like let's change our focus let's get out of here and let's go this way mhm and that's the thing I'm saying that they need what what's the exact wording here that the for the next scale thing to happen they're going to need a large investment is what they're saying well they're going to I mean they're definitely going to yeah",
            "start": 121.0
        },
        {
            "text": "what's the exact wording here that the for the next scale thing to happen they're going to need a large investment is what they're saying well they're going to I mean they're definitely going to yeah it cost a lot of money to make a game like Metal Gear I mean the the the purported r the rumor about Metal Gear's development was about 80 million which is not out of control for a Triple A game I mean Triple A games go way higher than that um this brought up an interesting question another conversation I was having with some folks on NeoGAF based on a conversation we were having on PS I love you with anecdotal evidence about the way a game makes money and people were talking about well Sony or or Konami grossed whatever $180 million so they're already profitable I'm like that's not how it works um The money a game grosses is irrelevant it's completely **** irrelevant that means that generally means unless there's caveats that the gross at register at retail we sold x amount of",
            "start": 156.92
        },
        {
            "text": "works um Greg the money a game grosses is irrelevant it's completely **** irrelevant that means that generally means unless there's caveats that the gross at retail we sold x amount of copies at $60 and we grossed x amount of money that's irrelevant because it doesn't it doesn't take into account anyone's cut it doesn't take into account taxes it doesn't take into account all this **** by the time the money falls to Konami how much money do they have and Konami is not interested by the way in breaking even they're interested in making money so if if they invested $80 million five years ago then a they're going to need more like a hundred million to break even today because of inflation and then they want to make money on top of that they need to make so they can have capital investment to put into the next game I think Greg's right in the sense and we've talked about this that five million I don't have any Baseline of what my expectation was with Metal Gear Solid to sell",
            "start": 193.8
        },
        {
            "text": "investment to put into the next game I think Greg's right in the sense and we've talked about this that five million I don't have any Baseline of what my expectation was with Metal Gear Solid to sell other than I thought it was going to do better than 5 million in a month now those numbers to me seem soft based on the the incredible um you know pull of the game this game has great gravity to a lot of Hardcore Gamers and those sales don't seem that impressive to me I I I I think F I think most as we were talking to our friends uh you know in the industry about it people would murder for five million sold so I'm not trying to say that that's not like an impressive thing that's a that's a great success for a vast majority of games but for Metal Gear Solid I expected a little bit more and I wonder across excuse exactly and so I wonder if so a like I don't know if it's profitable I really don't because the $80 million rumored cost and I'm not sure if Konami ever said that I mean I've read that before",
            "start": 234.44
        },
        {
            "text": "exuse me and so I wonder if so, a like I don't know if it's profitable I really don't because the $80 million rumored cost and I'm not sure if Konami ever said that I mean I've read that before but let's assume it's $80 million that is the money that it needed to develop the game what about marketing the game how much did that cost and then how much did the studio like or the the publishing apparatus have to pay to just you know like how much does HR cost you over five years how much does does you know having just an HQ dealing with first parties to to to test the games how much did Focus testing cost you how much like the time that it takes to promote the game the time for marketing uh even aside from the cost you know when it's like E3 and stuff there needs to be so much planning and so much stuff that goes into the presentations and the trailers and this and the that in addition to the to like you know traditional marketing of ads commercials and exactly there's just a lot",
            "start": 268.72
        },
        {
            "text": "and so much stuff that goes into the presentations and the trailers and this and the that in addition to the traditional marketing of ads commercials and exactly there's just a lot of things up in the air about what this game cost to make it was in development for a very long time and um so yeah they say that they're interested in doing the next Metal Gear Solid Game and I'm sure that they are interested in that I'm not sure that they're going to pull out of tria development completely but you know maybe not yet maybe I'm sure that seems to be the Desire with some of them is to minimize you know to mitigate risk to make the most amount of money and and you don't mitigate risk when you have tria games because they take huge Investments and you don't get that money back for years so um and you just don't know how it's going to work out plus if I were Konami I'd be very very scared of moving forward Metal Gear without Hideo Kojima not because they can't make a great game or an even",
            "start": 307.0
        },
        {
            "text": "so um and you just don't know how it's going to work out plus if I were Konami I'd be very very scared of moving forward Metal Gear without Hideo Kojima not because they can't make a great game or an even better game without him because they can if they find the right people it's like what does what do your what do the consumers think about that are people going to be there for Metal Gear Solid 6 when you **** all over the guy it seems like the guy that is responsible for the series to begin with and had a very bad tenuous relationship and let's just say that it was all Kojima's fault that's not going to matter to anyone that's not playing in The Press everyone thinks Konami is the evil person that did this and forced out the guy they love right exactly like for all we know Konami could like we might find out when the story start to be told that Kojima was a was a rampant egomaniac and a prima donna and who knows I'm not saying that that's true or that's false I'm just saying we don't",
            "start": 338.88
        },
        {
            "text": "might find out when the story starts to be told that Hideo Kojima was a rampant egomaniac and a prima donna, and who knows, I'm not saying that's true or that's false, I'm just saying we don't know the whole story exactly yet. It's always going to play out against Konami's favor, so they might be looking at being like, \"We just need to.\" There's a lot of questions about this particular situation, and it's not surprising that the LA Studio was shut down. What's surprising to me is that they've not been very good about communicating any of this stuff. I mean, saying Kojima was on vacation when the guy who broke the story is like tweeting out pictures of him at his going-away party is classic, you know? So that's the thing, and that's the whole thing - Konami's been tone deaf on this front the entire way. And so I wonder how much they worry about what the audience thinks of them or whatever you know what I mean, they haven't stopped to",
            "start": 372.76
        },
        {
            "text": "thing is like Konami's been tone deaf on this front the entire way and so I wonder how much they worry about what the audience thinks of them or whatever you know what I mean they haven't stopped to try to clear this up they haven't made it clear what's happening they you know they're only putting out this statement about Hideo Kojima now but as far as we know Hideo Kojima is still on vacation you know I mean there still hasn't been confirmation and he's probably technically on vacation because they're probably paying him during that exactly exactly so it's just all it's all it's all a battle of you know weird words and like what yeah exactly what they mean I don't know I find it so bizarre if you would ask me when I mean when we were talking about Metal Gear and reviewing and doing all that stuff what how this would play out I would have said that like like it was pretty I think the rumors always been December is when Kojima's numbers up right that he can actually be gone and free or whatever",
            "start": 412.16
        },
        {
            "text": "what how this would play out I would have said that like like it was pretty I think the rumors always been December is when Kojima's numbers up right that he can actually be gone and free or whatever I would have said we would hear in December that he was leaving and then the LA Studio would have been closed early 2016 I think it's crazy that it's closed this close to Metal Gear Online you know what I mean well especially to online like to the game releasing I think it's even close that well the game releasing like Metal Gear The Phantom Pain that was all done at Kojima's you know Japan studio so I understand there's nothing there but for online this thing you just put out and now it's like there's no future for that game I don't care what you're saying if it's being they're talking about it being like no we're bringing staff on to the Japan team and they're working on it and it's like no I don't I don't believe that they are I don't believe there will be support for that game from here on",
            "start": 445.56
        },
        {
            "text": "like no we're bringing staff on to the Japan team and they're working on it and it's like no I don't I don't believe that they are I don't believe there will be support for that game from here on out and I don't believe it was a game that was like it h it hasn't turned heads right like we played it here and did whatever and I haven't heard anyone talk about it since then and there's a hardcore following for it sure I'm not saying that but I'm saying mean you're the **** Metal Gear Solid V dude right it's like it didn't hook you in the way that has you playing every day so yeah so what do you with all of this then with with Hideo Kojima on vacation and with him putting out the uh that's so my favorite thing the video that you were in where he kind of was like you know that really that video felt like a wrap up for him you know that was the goodbye to the series and um where where do you guys see it now with it's official that the LA studio shut down Kojima's on vacation when do we hear about",
            "start": 479.72
        },
        {
            "text": "like a wrap up for him you know that was the goodbye to the series and um where do you guys see it now with it's official that the LA studio shut down Kojima's on vacation when do we hear about this stuff do you think it's still December I think December yeah they put it out because you figure that makes sense on a lot of levels first I think it's contractual it would be the reason I've heard why that's like the thing that's been kicked around the rumor forever but on top of that it's just like people are away from the computers the new cycle is very quiet you know what I mean like people at IGN and GameSpot are taking vacation kind of funny he's taking a vacation right so it's like it'll be a press release and it'll be up but will there be videos to react to and outrage to have and all this different stuff and then the real question is when does he talk about it that's what I fascinate me to no end right like if that if it's true that it's December that everything ends for",
            "start": 513.16
        },
        {
            "text": "this different stuff and then the real question is when does he talk about it that's what **fascinates** me to no end right like if that if it's true that it's December that everything ends for him like then what happens next you know what I mean PSX he comes out and announces an exclusive Crash Bandicoot holy **** right Jesus yeah there's there's so the the hanging the hanging Chads as it were for this for this remaining for the like what remains for this story are going to be fascinating in the sense that the story about Kojima is going to be told it's not going to be told by him it's going to be told by you have to assume by he's probably G to be contractually obligated not to talk for a long time yeah you have to assume that it's going to be told by proxies and Anonymous sources and these stories are probably going to start coming out early next year and I I this is a story that must be told and whoever really gets to the bottom in this story is going to have a lot of respect",
            "start": 550.32
        },
        {
            "text": "and these stories are probably going to start coming out early next year and I, I think this is a story that must be told and whoever really gets to the bottom of this story is going to have a lot of respect for me because this is going to be a tough one um to Chase and like I said about The Last Guardian and Te Go and all that kind of stuff this is a story that's probably better known in the Japanese press and because there's a language barrier um we don't, we're not going to get the scoop right away um just like I assume that you know the thing with Yamauchi and all that kind of stuff at Sony was well known in Japanese press like off the record for a long time just like we know a bunch of things off the record about a bunch of things too so it's, it's going to be fascinating what we figure out about that but it's also going to be there's two other things that are going to be really interesting what is Kojima going to do and where is he going to land and I, I am dead set on there being",
            "start": 585.88
        },
        {
            "text": "about that but it's also going to be there's two other things that are going to be really interesting what is Hideo Kojima going to do and where is he going to land and I I am I am dead set on there being a major bidding war and I do not think he's going to go into independent I think he's going to end up with a publisher um because they can fund his games and then Konami is in a lot of trouble because any of the remaining Talent there that's loyal to him he's going to poach them all so um so I'm interested to see like what happens with that and like what the blood bath might be at some of these Studios especially Kojima Productions studio in Japan if he's just like we're take we're all going yeah you know and um and then if Metal Gear Solid costs $80 million and Sony and Activision all these guys are like we'll give you $100 million in four years and just go to do whatever I think that I think that is going to happen I love that because I I love that Hideo Kojima is one of the only people where I don't care what",
            "start": 619.48
        },
        {
            "text": "give you $100 million in four years and just go to do what I think that I think that is going to happen I love that because I I love that Kojima is one of the only people where I don't care what project he's working on him being involved makes me excited about it Silent Hills is a perfect example don't care about that series at all him being attached to that I'm instantly like I'm playing that that sounds great add him to any series that I don't really have an attachment to if he made the next Titanfall I'd be interested in that he makes the next Call of Duty I would care Fallout you know fall whatever it was I would play Fallout you know like I would want to know what that was seem like he got some influence in some open world games uh here's the thing about this with Kojima is we talk about the deficit of trust that Konami is going to have without him and the deficit of um you know like Authority almost over their games without him a me and this is why I think that the Publishers",
            "start": 654.16
        },
        {
            "text": "about the deficit of trust that Kojima is going to have without him and the deficit of um you know like Authority almost over their games without him a me and this is why I think that the Publishers are going are probably already and are going to continue to fall over themselves to get him is the surplus of non like the the the just the the stuff you can't pay for to get along with a game how much will increase the perception of a brand to have Kojima on board how much does it increase the perception of a brand if Sony goes to Kojima and says we want that horror game so here's aund million go get Toro start writing four years you know like what is that like that's what I think that he might want to be independent in a way but when he gets that money when he gets that push and when these and these opportunities and when the Publishers are like getting Kojima on board for us is going to make us very very good just like Konami looks very very bad regardless as I said of what",
            "start": 691.36
        },
        {
            "text": "these and these opportunities and when the publishers are like getting Kojima on board for us is going to make us very, very good just like Konami looks very, very bad regardless as I said of what the reality behind the scenes is it's going to look really good for them I can't wait to see how it all pans out Manami I'd be sitting back waiting because it's going to come for him like you want to be enjoying your vacation no well I would be because I'd probably be Bing paid and just hanging out but I'm sure that his you know it's it's it's what we said a million times with like when Hideo Kojima left Konami I can't imagine the offers that he got you know so it's it's it's worth considering you know that he that he's going to end up in one of these big big places and I would not I still say that it's I still say Sony in my mind is like one of those places where I'm like too obvious you know for them like it's it's too obvious C was over there oh you want to go NX I mean that would be",
            "start": 739.4
        },
        {
            "text": "It's I still say Sony in my mind is like one of those places where I'm like too obvious you know, for them it's too obvious C was over there, oh you want to go NX, I mean that would be a big thing too if Nintendo wanted to throw NX launches with Kojima's new game well that would be possible, Bloodborne 3, Bakyuudo is that we, I don't know the original box, I was interested in an interesting game.",
            "start": 775.88
        },
        {
            "text": "a custom League or join an existing one to play for your share of the billion dollars in prizes up for grabs this year this isn't fantasy as usual this is DraftKings welcome to the big time hurry to DraftKings.com now use promo code KindaFunny and play for free with your first deposit in Sunday's million-dollar fantasy football contest first place takes home a $100,000 and a lifetime of bragging rights and are KindaFunny for free now yes wait what code KindaFunny for KindaFunny now coming through the screen at DraftKings.com that DraftKings.com",
            "start": 814.84
        }
    ]
}