{
    "id": 2509,
    "video_id": "4E-72xECuYE",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "SisQo Has The Best Stories - The GameOverGreggy Show Ep. 173 (Pt. 1)",
    "description": "SisQo is the best.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1490598001,
    "duration": 1939,
    "transcript_chunks": [
        {
            "text": "this episode of the GameOverGreggy Show is brought to you by ProFlowers.com. My mom's birthday is this week and you know what she loves flowers. Lots of people do. I do. Kevin does. I think Cool Greg does. Why don't I get the people in your life some flowers? There's ProFlowers. You go there right now. ProFlowers has a special offer just for our listeners. Get $10 off your purchase of $29 or more. This deal works on bestselling gifts like their 100 blooms bouquet, a dozen red roses, or even their totally unique plant gifts. To snag this great deal, just go to ProFlowers.com and enter the code Greggy at checkout. Tim's ordered Gia ProFlowers before. You know what she said? I don't know. I wasn't there, but I get they're still together, so when they got, I'm sure she liked it. It was probably some like, \"Tim, these flowers are wonderful. Please pour me more wine.\" ProFlowers are guaranteed for seven days or your money back. They have a whole bunch of things that are quality checks. It's great. So go to ProFlowers.",
            "start": 0.24
        },
        {
            "text": "flowers are wonderful. Please pour me more wine. ProFlowers are guaranteed for seven days or your money back. They have a whole bunch of things that are quality checks. It's great. So go to ProFlowers, not bro flowers. ProFlowers.com. Use the offer code Greggy at checkout to get $10 off. What's up, everybody? Welcome to the GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer, seducer, Nick Scarpino. I feel good. Do it again. Producer, seducer, Nick Scarpino. I added some extra ones in there that time too. I appreciate that. No problem. That's what I'm here for. I love you. Love you too. Over there, the pure one, Tim Gettys, and joining him for the first time ever, joining his boys, the Dragon, SisQo. Yeah, I like how he comes with his own nickname already to make one up. Awesome. SisQo, how the hell are you? I'm great. Thank you so much for. I'm great. Thank you for coming too. I'm well. Hang good. All right. Hang. All right. Let's get it popping. Finally, the Dragon has come back to Kinda Funny. It's been",
            "start": 40.0
        },
        {
            "text": "are you? I'm great. Thank you so much for. I'm great. Thank you for coming too. I'm well. Hang good. All right. Hang. All right. Let's get it popping. Finally, the Dragon has come back to Kinda Funny. It's been a long time. You did the E3 with us, Kevin. Did you like that? Did you like that? He's playing with the acoustics, as they say. Yeah, sounds good. Thank you. So you did the E3 show with us years ago, two years ago. Yeah. Then you did Kinda Funny Live too. Yes. But now you're officially on a prop for the first, for the very, very first time. And um, it's uh, kind of ironic, 'cause well, not ironic, but um, I really uh, you know, just kind of just wanted to get in here and you know, be able to do. Well, we'll wait for that, but we didn't get to that part yet. No, no, don't do it. Yeah, yeah, don't worry about it, 'cause you're a real, you're a legit Kinda Funny best, best friend. Absolutely. A lot of people, they don't understand it sometimes and like, how do you know SisQo? I'm like, oh, he likes, he likes Kinda Funny. Yeah, man, I've been",
            "start": 97.8
        },
        {
            "text": "you're a legit Kinda Funny best, best friend. Absolutely. A lot of people, they don't understand it sometimes and like, how do you know SisQo? I'm like, oh, he likes, he likes Kinda Funny. Yeah, man, I've been following you guys ever since um, way back in the day when you were doing uh, Beyond. Yeah. You know, if if memory serves, I think you told me that it was you were stuck in a video game and a friend tipped you off for strategy guides and said, go to IGN. It was, it was my uh, my fiance. Ooh. Yeah, she actually turned me on to you guys um, because uh, I was stuck on some game. It might have been aara time or something, I can't remember. And um, you know, she turned me on to the site and then I just kind of trickled over. I I I would see like um, you know, you guys do like little segments and stuff and I didn't know anything about the whole podcast thing um, but uh, when you would do your segments, I just thought you had like a kind of kind of witty thing. I you would get me to kind of chuckle from time to time, so I",
            "start": 146.24
        },
        {
            "text": "anything about the whole podcast thing um, but uh, when you would do your segments, I just thought you had like a kind of kind of witty thing. I you would get me to kind of chuckle from time to time, so I was just kind of started following you through the site. Yeah. And then, you know, it got to, you know, the Beyond and then that's when I started, you know, meeting everybody. Sure. So it kind of grew to, you know, what we have here. Yeah. So yeah, man, we we were following uh, I was following you, man. Thank you. You're a good man. I was following you long before then. You know, of course, I I remember, I remember the Thong Song. We all. That's what the Ladies say. That's the. If you didn't know, this is the GameOverGreggy Show. Each and every week, four, sometimes five, best friends together on this table, each bring a random topic discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny where you can get each and every episode early along with a bunch of exclusive perks and goodies and things.",
            "start": 188.08
        },
        {
            "text": "topic discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny where you can get each and every episode early along with a bunch of exclusive perks and goodies and things. And Nick will send you some hair sometimes. Yeah, if you want it, I got lots of it. That's what you should start doing for your thing where you trim it and then you you what you. It's gonna be a good one. You do the card, the fan mail, and then you just tape a piece of hair to it. Say nothing and just put Nick exclamation. How about if I do like more of like a glitter bomb, but with my chest hair? Like my shaved off chest hair. Open the envelope, all the chair fall. Not do that, guys. That's no, it won't go up in the air so much. It might, you might inhale some of it and have a part of me inside of you. Have like one of those creepy messages where you like cut like uh letters out. I hope you like this fan mail fan like this hair. If you got no bucks to toss, no big deal. You can head over to YouTube.com/KindaFunny.",
            "start": 226.96
        },
        {
            "text": "one of those creepy messages where you like cut like uh letters out. I hope you like this fan mail fan like this hair. If you got no bucks to toss, no big deal. You can head over to YouTube.com/KindaFunny where we put the show up topic by topic, day by day, until it goes up is one big video in MP3 the following Friday. Tim, yes. What's your topic? SisQo. I thought so. I love this. I want to hear everything. That's the thing. So so obviously we we we know you like, we have a cursory knowledge of you from being from like growing up listening to music. But but having talked to you for the last like two hours, yes, I've learned so many things about you and I just want to go deeper. Deeris, we didn't do Behind the Music yet, but it's coming. Actually, um, well, what do you want to know? Well, the weird thing about it is like, we since we've struck up the friendship where I will text you and you'll call me about video games and we talk, it is that thing of like, sure, I remember Thong Song. I remember Wild Wild West. I",
            "start": 262.08
        },
        {
            "text": "is like, we since we've struck up the friendship where I will text you and you'll call me about video games and we talk, it is that thing of like, sure, I remember Thong Song. I remember Wild Wild West. I remember SisQo and you come in. I like, who does, you know, who doesn't remember these moments? We know that. But it's like, then just in the car, you like, drive, oh yeah, and I used to date Beyoncé. And this and we're all like, huh? And you're like, you're like, hey, I was in this thing and I was in this movie. I was like, what up? We were friends. Okay, I'm here. Let me let me go this way. You have a photo of you and Beyoncé on a red carpet. I missed that. That wasn't that wasn't in my SisQo memory banks. Okay, that was uh, that was the MTV Movie Awards. We hosted that together. But me and me were just like friends. We we were we were on uh tour a lot in the beginning of our career. So, you know, we used to, you know, call each other. I knew her her mom and her sisters and stuff. So we were just friends. We didn't the N sisters.",
            "start": 307.08
        },
        {
            "text": "we were on uh tour a lot in the beginning of our career. So, you know, we used to, you know, call each other. I knew her her mom and her sisters and stuff. So we were just friends. We didn't the N sisters never really went like uh Greg trying to start gossip. I'm not starting anything. I misinterpreted the photo trying having. We look like we were we were, but it was because we generally got along, so that's why we look so comfortable. That's how me and Kevin look. Which by the way, Beyoncé, I don't know her today that she's, you know, married to Jay-Z. Um, and I knew Jay-Z back in the day too. But um, see, that's what I'm talking about when you drop stuff like that. That's the. And you're like, oh, and I was shooting this movie and I met this guy. I'm like, oh yeah, okay. First on-screen kiss was with Mila Kunis. Oh yeah, that now that one's true. That one's all the way. My God, all the way true. And Mila, um, Mila is is is a very, very nice person, man. When we we were shooting the movie Get Over It, um, it was uh myself uh",
            "start": 347.16
        },
        {
            "text": "yeah, that now that one's true. That one's all the way. My God, all the way true. And Mila, um, Mila is is is a very, very nice person, man. When we we were shooting the movie Get Over It, um, it was uh myself uh Colin Hanks, Ben Foster, um, Zoe Saldaña, uh uh um, no big deal. Just one of the Guardians of the Galaxy. It was, but it was uh she was in the first Spider-Man. Um, and she was in it as well. And #SmashTheRun. We tried to get her play Smash Brothers. It never worked out. It turns out there's a different connotation to that. I didn't know. That's a legit Kinda Funny story that I did not know. I am old, man. Um, but no, she was everybody was really cool. Um, especially that that is that funny? It really is. Um, everybody was really cool, but Mila was like espe especially cool, 'cause this was way back in 2001. And we're on the set and um, you know, we just shooting the breeze. You know, was was this when she was doing doing That '70s Show? Do you remember if that was that? Can't remember what right after that or like, I think it was",
            "start": 391.0
        },
        {
            "text": "and um, you know, we just shooting the breeze. You know, was was this when she was doing doing That '70s Show? Do you remember if that was that? Can't remember what right after that or like, I think it was like towards the end. Okay. 'Cause that show was that show was huge. And so she was telling me um, that she was shooting um, she was doing some voiceover work for a new uh cartoon called Family Guy. And I was like, wow, is it cool? Is it funny? She was like, oh yeah, it's really funny. I was like, man, you should give him a ND like, see if I can go, you know, read for or whatever. And she gets me a read um, and so I go to read for uh Brian the Dog um, and apparently, you know, uh Seth uh Seth MacFarlane, the creator, um, apparently he didn't like any of the uh auditions for Brian. And so that's why when you hear Brian the Dog, it's just his like natural voice. That's fascinating. What a different world. SisQo is Brian the Dog and a Family Guy. Yeah, wait, Seth Green's in that show, right? Yeah, he's Chris Green. Who's he? He's Chris.",
            "start": 446.08
        },
        {
            "text": "it's just his like natural voice. That's fascinating. What a different world. SisQo is Brian the Dog and a Family Guy. Yeah, wait, Seth Green's in that show, right? Yeah, he's Chris Green. Who's he? He's Chris. He does Chris Chris. He said he he drew that inspiration from um uh the uh Buffalo Bill from. You can totally see that. That totally makes to sense. Um, wait, so by the way, that Kudos Tunas, because that made me respect her. Like, I I loved her from That '70s Show, but then when she came at with with a Family Guy, I was like, this this girl's awesome. Yeah, she not even the first one. There was there was a different the girl from Mean Girls and she speaks fluent um Russian. Can you imagine that? Like right before a hot kiss scene, like, you know, she's like, like, can you speak Russian? And just that wasn't what she said. I think I might have said a curse word. Offended all three people we have. I know Russian s. That is not what she said. Absolutely. So that sounds amazing. I want to know about the Thong Song. Wait, no.",
            "start": 490.44
        },
        {
            "text": "said I think I might have said a curse word. Offended all three people we have. I know Russian s. That is not what she said. Absolutely. So that sounds amazing. I want to know about the Thong Song. Wait, no. Let's go back though. I want to know, 'cause you you blew my mind earlier when you were like, a lot all this stuff happened to you when you were like 20. Right? So I want to know that was before. Well, you mean when I got into it? When when you when you started to blow up, that was like in your early 20s. So I want to know how you got to that point. Like, walk me through some of the earlier steps that led you to to to to being a Drew Hill timeline. Yeah, give me the timeline. Sure. I I I'll do the quick version. Um, when we were 14 years old, uh, we had gotten signed by a label. And us and Destiny's Child had gotten signed at the same. What were you doing before? So what were you doing before that that got you signed? You guys were performing locally? Like, what was? Um, we were we were only 14 years old, so you",
            "start": 541.24
        },
        {
            "text": "gotten signed at the same. What were you doing before? So what were you doing before that that got you signed? You guys were performing locally? Like, what was? Um, we were we were only 14 years old, so you know, around that time like, Boyz II Men and Jodeci, were they looking to put together kind of another group like that? Nobody was looking for anything. It's just when Boyz II Men started singing, you know, \"How Do I Say Goodbye to Yesterday?\" Fuck yeah. Uh, next thing you know, everybody's like, all all these everybody's trying to form a group and get under a lamppost and sing. Do how do you know? And and so we were, you know, some 14-year-olds that tried to do the same thing. I mean, it was attack of the, you know, boy bands and groups and everybody try to be a group and everybody was trying to be a boy. And so did you guys start performing like like things? We started performing locally. You did the church thing, you were saying too. I was I I only sang uh gospel music um, 'cause I didn't really look at",
            "start": 588.68
        },
        {
            "text": "and so did you guys start performing like like things? We started performing locally. You did the church thing, you were saying too. I was I I only sang uh gospel music um, 'cause I didn't really look at myself as a singer, because I was dancing. I was kind of known to be a dancer before I was known to sing, 'cause I only sang in church. Then one of the members of my group, whom I didn't know could sing, um, actually invited me to be in a group that they had right around when we had just gotten into like high school. And um, and so, you know, we started singing with that group and, you know, we formed a group and then we performed at a talent show. And that's when we met our manager, Kevin Peck. And he had a it was a talent show at um Morgan State College. And he had a group and his group um uh actually won the talent competition. Son of. And we were like uh second place or something. And that day he like fired his group and hired us. And so he piled us in, you know, his uh sexy BMW or something. And he had this like",
            "start": 630.6
        },
        {
            "text": "competition. Son of. And we were like uh second place or something. And that day he like fired his group and hired us. And so he piled us in, you know, his uh sexy BMW or something. And he had this like fly girl with him. And we just, you know, piled our our stinky teen bodies in the back. Oh, it's Smells Like Teen Spirit. He was funky. You know that that funky teen smell. And man, he took us to Burger King, which, you know, back when you 14 years old, like Burger King is like, so you're telling me I can get the value? I don't need to stick to the doll. Burger King, like not McDonald's. This is Burger King. This is a this is a Whopper I'm talking about. I still put, by the way, I still put the Whopper above all of the ID. That was a then. So he goes, he speaks to all of our parents and says he wants to work with us. Um, fast forward like a couple months later, we get an opportunity to sing for a record executive. Um, and they signed us um, way back when we were 14. The name of our group back then was 14 Karat Harmony, 'cause",
            "start": 682.28
        },
        {
            "text": "fast forward like a couple months later, we get an opportunity to sing for a record executive um, and they signed us um, way back when we were 14. The name of our group back then was 14 Karat Harmony, 'cause 'cause we were 14. You see sense. It seems like you're giving yourself a limited window to make it big with that. But yeah, it was, hey, we didn't know. It was 'cause we 'cause I was I've always been in the jewels. So sure. So the 14 Karat Harmony, we got signed. We're sitting in the lobby of this of this record label. Now, I don't want to call the record label out um, because they had us and Destiny's Child before anything. So us and Destiny's are sitting in the lobby. And and granted, I don't know be at this Beyoncé at this moment. Did you know Kelly? Like, what's up? I didn't know any. No, I didn't know any any one of them. They didn't know us, right? And I mean, we just knew. We just saw this hot girl group and we were, you know, the guy group. And yeah, so, you know, boom, we get signed. And what, you know, we got sat on the shelf. They",
            "start": 734.4
        },
        {
            "text": "didn't know us, right? And I mean, we just knew. We just saw this hot girl group and we were, you know, the guy group. And yeah, so, you know, boom, we get signed. And what, you know, we got sat on the shelf. They sat us on the shelf and they sat Destiny's Child on the shelf. So then it took us up. Um, now, needless to say, when I got this uh record deal, I go back to school the next day after we get the record deal, right? Like, fuck you. Fuck you. I never like, I never liked you. Yes, right? You'll see me in the papers. See you at the top. Right? He shows he's 14. He shows up in a Lambo just up. It it was at the end of the year too, right before summer. So I was like, fuck you all. You know what I mean, dude? So we get sat on the shelf. Humble lesson number one. Yep. Um, that that the universe was teaching us. If I wouldn't have said, \"Fuck everybody,\" we might have came out earlier. Don't know. Come back the next year. Hey, Mr. Record Label, what whatever happened to fuck us? I'm like, shut up. You know what I mean? So uh, now I have no choice but to",
            "start": 781.96
        },
        {
            "text": "fuck everybody, we might have came out earlier. Don't know. Come back the next year. Hey, Mr. Record Label, what whatever happened to fuck us? I'm like, shut up. You know what I mean? So uh, now I have no choice but to get my grades up, 'cause I didn't know if we were going to get signed. Um, we do the Apollo. We won the Apollo. Um, and this whole time we're trying to get off of this contract that we signed. We finally get off the contract. We decide that we don't want to sing anymore. We become a gospel group. Um, so I'm working at this place called the Fudgery, where you like uh make fudge and sing songs. It's it's yeah, it does sound funny. Fact that I'm short, it's almost like a Keebler Elf. And I know that feeling making this is so. Is this Baltimore? This is Baltimore. I was going to say, because they do this in St. Louis too, where they got the whole thing. I they flew me there. You might have saw me there. They flew me there, 'cause I uh um we had made I was making so much money at the Fudgery. And um, wait, no, they really flew. I",
            "start": 836.92
        },
        {
            "text": "where they got the whole thing. I they flew me there. You might have saw me there. They flew me there, 'cause I uh um we had made I was making so much money at the Fudgery. And um, wait, no, they really flew. I thought you misunderstood. The Fudgery flew you to. They flew me because they uh we had like a a competition around the whole United States for all the fudges. Okay. And whoever made the most money. It does sound that funny, right? Whoever made the most money, you would get like a bonus check. So you was if you were uh number one, you would get a $50 bonus check. Number two, you would get and so on and so forth. And so I, you know, that extra 50 bucks back in the '80s. I mean, you know, like early like early '90s, that was a lot of money. Yeah. So, you know, I worked really hard to get that extra money. And so we were selling so much uh exponentially more than all the other stores. And they decided to actually fly me um over the summer to different Fudgeries. And every Fudgery I would go to would end up being like number",
            "start": 886.04
        },
        {
            "text": "selling so much uh exponentially more than all the other stores. And they decided to actually fly me um over the summer to different Fudgeries. And every Fudgery I would go to would end up being like number one um in the reg. What would you sing? Anything like uh matter no, like a like instead of saying \"Isn't She Lovely,\" it like is it \"Fudgery Lovely\"? Oh my God. So were you SisQo at the time? Yeah, I mean, when when when did SisQo? I got that name because like, you know, my head is like a kind of wavy or whatever. And you know, being in the inner city, whatever physical attribute you had would be like your like, you know, the dark skinned guy name was Black. You know, the chubby guy they used to call him Gel, 'cause it was like jelly. And they call me SisQo, 'cause it was like, 'cause we didn't really see any other races other than, you know, either black person or white person. So, you know, they was like, \"Hey, SisQo, go get me a taco.\" And I'm like, shut up. 'Cause if you had like, you know, wavy hair, was like, you look like Spanish or Cuban. So that",
            "start": 933.44
        },
        {
            "text": "know either black person or white person. So, you know, they was like, \"Hey, SisQo, go get me a taco.\" And I'm like, shut up. 'Cause if you had like, you know, wavy hair, was like, you look like Spanish or Cuban. So that so the nickname kind of stuck or whatever. And so basically we uh we won Apollo. We were working um, we decided not to sing anymore, 'cause we just got it was just a traumatizing scenario. If you can understand me telling everybody to fuck you and then not getting into the. I could imagine that might little. So lastly, man, um this guy uh that we working with came up. He said, \"Hey, man, can y'all come up to this record label and sing for this one uh last record label?\" We was like, um, you know, we don't do that no more. We a gospel group. He was like, \"I tell you what, you go sing for these guys and if nothing happens, you can go. I don't care. I don't care what you do. You know, I won't bother you again.\" We go up. We sing for this guy. Uh he plays um uh this song called uh \"Tell Me,\" which was our first single. He plays \"Tell Me\" um",
            "start": 987.28
        },
        {
            "text": "go. I don't care. I don't care what you do. You know, I won't bother you again.\" We go up. We sing for this guy. Uh he plays um uh this song called uh \"Tell Me,\" which was our first single. He plays \"Tell Me\" um he stops the uh the recording and we sang it back to him. And like him and his colleagues is like looking around like, \"That was fucking amazing.\" Right? So they go and they take like one of those pieces of yellow uh scrap uh paper. Yeah, like a legal pad. Right? And they basically wrote our contract up on that. Wow. And at the time, um all of the other guys was about to turn 18. And I uh I had already turned 18. Um, so I was the only one that could really sign it without consent. So you signed it with a capital Q in SisQo? No, the rest was history. I had I had to learn that that that came later. We used to practice our signatures though. So that's that's the thing. Practice a signature. It'll it'll prep you for being, you know, a superstar. Um, and uh and so basically we signed that. He said, the guy was like, \"Hey, do you",
            "start": 1033.6
        },
        {
            "text": "our signatures though. So that's that's the thing. Practice a signature. It'll it'll prep you for being, you know, a superstar. Um, and uh and so basically we signed that. He said, the guy was like, \"Hey, do you guys like this song?\" He was like, \"Yeah.\" He said, \"Can you see yourself singing it?\" We was like, \"Yeah.\" He's like, \"Okay, on one condition.\" We was like, \"What?\" He was like, \"You gotta sign to my label.\" So it was like um Fudgery record deal. Fudgery record deal. In the back of your head, you're thinking, oh, those fuckers at that school. That the second time I'm going back to that high school and I'm fuck. It wouldn't even matter, 'cause we would we had just graduated. So it was like, we didn't have to go. I mean, 'cause remember uh when we first got signed, it was when we first started high school. When we got signed again, we all sign. I had to eat humble pie. And that's why today I'm like much more humble, because I I learned at an early age um, you know, and and you know, I think that's just the universe's way of preparing you for",
            "start": 1088.88
        },
        {
            "text": "sign. I had to eat humble pie. And that's why today I'm like much more humble, because I I learned at an early age um, you know, and and you know, I think that's just the universe's way of preparing you for success, because man, it would suck if I was a dick now, you know? So um, anyway, um, so uh he said, \"Do you guys like this song?\" \"Yeah.\" \"You see yourself singing it?\" \"Yeah.\" He's like, \"Okay, one condition. You sign our label.\" So we signed to the label. We recorded it that night for uh for um the Eddie soundtrack with Whoopi Goldberg. Yeah, yeah. And oh my God. Yeah, we got home. And then we had to find a name. Um, so at the time that we got signed, our name was Legacy. But it was another band called Legacy. And also they thought it sounded too much like Jodeci. And they thought that we sounded similar to Jodeci. So that didn't really work. And they was like, \"What's that park that everybody drives around um in the summertime?\" We was like, \"Drew Hill.\" They was like, \"That's your name.\" I was like, \"No, I didn't want it to be Drew Hill, 'cause I\"",
            "start": 1133.32
        },
        {
            "text": "really work and they was like what's that Park that everybody drives around um in the summertime we was like Dru Hill they was like that's your name I was like no I didn't want it to be Dru Hill cuz I hadn't really been anywhere except for Baltimore and the places that the fudgery had flown me um shout out to the fudgery yeah please tell me there's going to be a story in this segment where you go to the fudgery and just buy all the fudge dude honestly we were we were we were about to work together and um recently they've been like some of their clo shops have been closing oh so they should That's The Power of not having SisQo anymore they should have got with me from Jump Street and you know um but uh man we so you know we did that and then a week later um they said that that was going to be our name dude I was almost tears yeah and it just a testament to one of those things where your world is so small um and you don't really realize how um big yet small the world is until you get into",
            "start": 1183.28
        },
        {
            "text": "our name dude I was almost tears yeah and it just a testament to one of those things where your world is so small um and you don't really realize how um big yet small the world is until you get into it and man it was like for us everybody knew what Dru Hill was but we hadn't the world didn't know yet and it ended up you know being you know a cool a cool name it's definitely great so were you worried you were just worried that it was like it was too small-town feeling or that that it just wasn't I thought it was too small-town feeling it's like you know when you're from a small town and you're thinking you're not thinking about the big picture and all you believe is oh my God like really Dru Hill that was the best you can come up with but when you know you're living on the West Coast and you hear Dru Hill you like oh that's **** cool that's a cool call back to where you came from everybody thought that I was Dru and it's a Dru Hill in like a lot of cities too it's one in",
            "start": 1227.68
        },
        {
            "text": "and you hear Dru Hill you like oh that's **** cool that's a cool call back to where you came from everybody thought that I was Dru and it's a Dru Hill in like a lot of cities too it's one in Atlanta and this one and everywhere you go just act like that l park is the same thing where it's like that sounds like thing where I'm like I don't know where it is but any time I see a Lincoln Park I'm like okay it's never the Lincoln Park but but it was really Druid Hill Park okay Druid Hill Park which is um which is funny because we will always just say Dru Hill and um that's you know that's the way we say it in the inner city was the Druid was like left out was just Dru so that's why how we end up uh spending it and it was crazy because one of our guys that was in the group he's like really like a you know like a really you know grew up in the church kind of guy like if you ever saw the uh movie um if you ever saw that movie The Five Heartbeats if you ever saw The Five Heartbeats",
            "start": 1272.52
        },
        {
            "text": "like a you know like a really you know grew up in the church kind of guy like if you ever saw the uh movie um if you ever saw that movie The Five Heartbeats if you ever saw The Five Heartbeats he's the dude choir boy like he's okay he's he was the church guy you know the quintessential Church guy in the Black R&B group this was this guy right gotcha and so everything about the group from day one when we got signed just rubbed his mom wrong and rubbed him wrong and that comes full circle to the story I was telling you earlier I'm sure we'll get to later but man he hated the fact that it was Druid Hill Park because it was a pagan and the Druids he hated the whole Dragon thing because it said that the dragon they call the devil the dragon in in the Bible and and then it's just crazy because then you go around if you guys had been Legacy it probably would have been no it would have been the JY thing because J for him for him it would have been oh I guess oh would have been JY know for",
            "start": 1314.92
        },
        {
            "text": "then you go around if you guys had been Legacy it probably would have been no it would have been the JY thing because J for him for him it would have been oh I guess oh would have been JY know for him man it was his mom always was like wanted him to sing wanted him to sing gospel and so he always kind of felt like he was letting her down so almost it's like even though he was there almost kind of felt like it was pulling teeth like every time we would have to do something it was almost like you had to talk him into doing almost everything that we were doing that we worked so hard to do and it was just it was just weird but you know we got there and a week later uh uh I'm driving my mom's car going to pick her up from work and and then our song comes on the radio and dude I'm like driving and it was like an out-of-body experience and my body my soul came out and sat in the passenger seat while I was driving and I didn't blink the whole time and it was like then when the song went off I",
            "start": 1368.28
        },
        {
            "text": "and it was like an out-of-body experience and my body my soul came out and sat in the passenger seat while I was driving and I didn't blink the whole time and it was like then when the song went off I kind of pulled over put the car in park like yes we made it I mean dude hearing being a musician and hearing your song on the radio it was it it was mind-blowing for one for two uh people kept calling in and was like can you play it again can you play it again and it was like Baltimore's own dude they played that song like 50 times that day and uh then the song just blew up and then it went Platinum and every single that we released commercially um or album from that moment on either went Platinum or Multi-Platinum wow and that's a million for you guys if you want to know what Platinum is it's a million record so or it's getting all the trophies in the PlayStation very similar very similar accomplishment I mean I'm not saying I have a lot of Platinums too I'm just putting that's true I",
            "start": 1411.4
        },
        {
            "text": "it's a million record so or it's getting all the trophies in the PlayStation very similar very similar accomplishment I mean I'm not saying I have a lot of Platinums too I'm just putting that's true I think Colin has more Platinums so then okay so you go from the Dru Hill thing then Thong Song eventually happens no that was a I want to get to the Thong Song I'll get to it I I'll get to it we'll do the quick version so um and that was the quick version I hope it wasn't too long you're doing great don't worry about it everyone's enjoying this Joelle's riveted right now wherever she is so um so then uh fast forward to uh through the first album first album goes Multi-Platinum every single Platinum or Gold um uh we are slowly becoming you know the next Boyz II Men I always say if you take Boyz II Men and Jodeci and mix them together you kind of get our group cuz we kind of had like that kind of street savvy but we had like a pop appeal that was like engaging and I just learned from a lot of the people",
            "start": 1461.96
        },
        {
            "text": "and mix them together you kind of get our group cuz we kind of had like that kind of street savvy but we had like a pop appeal that was like engaging and I just learned from a lot of the people that I met in the industry um kind of the kind of what you kind kind of want to become an icon what does it take to get a star on a Walk of Fame what does it take to get into the Rock and Roll Hall of Fame these were the questions that I would ask uh the people My Heroes who I whom I um were my inspiration to get into the industry and Michael Jackson was the number one inspiration when I was like four years old I saw him do the Moonwalk I said that's what I want to do and so I basically like studied Michael and I was just like what is it that Michael does that nobody does why is he so popular and I realized that he had a it was a it was a he had like three things about himself that distinctively made Michael Michael he had a distinctive look if you was looking like Michael you knew that you",
            "start": 1512.36
        },
        {
            "text": "I realized that he had a it was a it was a he had like three things about himself that distinctively made Michael Michael he had a distinctive look if you was looking like Michael you knew that you were trying to look like Michael he had a distinctive sound like a a couple signature riffs like a he he you know what I mean and then he had the signature move which was the Moonwalk so if you look at my career I got the signature yeah and then I got the Signature Hair and then I got the one-and-a-half which is like my signature move so I was like bam I'm on on the track and then it was ironic but this was ironic Michael Jackson back in 2001 flew me out to meet him and when I met him for one he was much different than you think Michael Jackson would have been yeah his voice was not was this this was 2001 okay this 2001 okay and he uh flew me out to meet him and if you recall that's when I disappeared it was a mic drop moment for me I met the person I was trying to emulate it was just like done",
            "start": 1559.12
        },
        {
            "text": "2001 okay this 2001 okay and he uh flew me out to meet him and if you recall that's when I disappeared it was a mic drop moment for me I met the person I was trying to emulate it was just like done I don't have to achieve anything else the guy that I wanted to be like wanted to meet me I was like dude me just ultimate freaking Usher uh you know Chris Brown we all doing our best Michael Jackson impression and you fly me out to meet you and everybody else got fly to meet you but you want to meet me I was like man I guess I did the best Michael Jackson did you you fly to LA to the to no no he was working with Teddy Riley okay um cuz Teddy Riley did my first single for my uh second album and he flew me out there man it was down in uh Virginia uh Virginia Beach okay and I met Paris his daughter and um Blanket they they were watching uh Bambi and I you know I walked into his trailer and you know uh I was like Hey guys and he was like you know like my dad's Michael Jackson who the hell",
            "start": 1611.76
        },
        {
            "text": "and um Blanket they they were watching uh Bambi and I you know I walked into his trailer and you know uh I was like Hey guys and he was like you know like my dad's Michael Jackson who the hell are you you know how many people walk in here every day and try to distract us from Bambi no no not not in not in this trailer dude this was Michael's personal space man he was in the back of the Winnebago and his kids were in the front of the Winnebago watching Bambi and the lights were D because it was close to their bedtime so then Michael emerges from the back right I would and dude I'm sitting there practicing what I'm going to say to Michael when I meet him none of that came out like he came out I was just like what's up Mike so I gave him a pound and Michael Jackson gives the most hood pound like the what's up my you know what I mean dude and and he was dude he was like solid yeah yeah you would expect Michael to be he gave the impression that he was more delicate human being he was but",
            "start": 1668.88
        },
        {
            "text": "like the what's up my you know what I mean dude and and he was dude he was like solid yeah yeah you would expect Michael to be he gave the impression that he was more delicate human being he was but then when you think about it with all that isolating all that he was like he was very like you couldn't if you tried to move him off balance he seemed like he could flip yeah throw you some Judo stuff like and so I was like dude I was like everybody is trying to be you why would you want to meet me he was like with the voice not well I think he was like well I think his voice was like close to my octave not not as deep but it wasn't as high pitched like that all of that is was for us that was like an act for us part of the Persona yeah that was MJ if you look at his Memoirs he wrote wrote it down that he wanted to change from Michael Jackson to MJ and MJ was the Persona like the the dragon or Sasha Fierce that that Beyoncé does and he was like man I think you're very talented and you're",
            "start": 1723.84
        },
        {
            "text": "down that he wanted to change from Michael Jackson to MJ and MJ was the Persona like the the dragon or Sasha Fierce that that Beyoncé does and he was like man I think you're very talented and you're going to go far into industry and then that was 2001 where literally when I disappeared like then everybody the hell let go go cuz it was it was it was like I was going through some some legal crap with my label and stuff and it just at that moment I had kind of achieved everything I wanted to achieve because prior to that cuz you was asking how we got to the Thong Song prior to that the biggest thing that happened to my group was um when Will Smith asked us to be a part of the Wild Wild West so that was before Thong Song yes oh **** yeah I got my timeline all messed up we were Multi-Platinum my my group and I Dru Hill were Multi-Platinum way before like years before I even did Thong Song and um what happened was we had just came off of a European tour where uh 'N Sync and 98 Degrees were",
            "start": 1786.16
        },
        {
            "text": "my my group and I Dru Hill were Multi-Platinum way before like years before I even did Thong Song and um what happened was we had just came off of a European tour where uh 'N Sync and 98 Degrees were opening for us and right it's crazy right no cuz it's crazy cuz I I ended up opening for them like when they did tell me Nick open for you yeah oh they played us in football too they whipped our ass cuz we was in Germany like playing football and and you know we're you know freaking four black guys so we had on snowsuits and cuz dude it was the snow was hot yo Nick and those guys came outside and like some sweaters and the snow was deep yo they was running through that snow him and his brother y if you could it wasn't 98 Degrees you picture it it was it was **** I had no choice but I wanted to win but it was no it was no way we could match their speed cuz they was running around like in just jeans you're you look like the Michelin Man out there oh my God that's hilarious they they beat us",
            "start": 1830.76
        },
        {
            "text": "win but it was no it was no way we could match their speed cuz they was running around like in just jeans you're you look like the Michelin Man out there oh my God that's hilarious they they beat us horribly anyway um but but every time I've seen those guys since then they've always been so genuine man me and me and uh me and um Joey Fatone used to used to hang out when we was on tour with 'N Sync and man he was just so cool that was my man seem Joey seems like a cool guy he was cool he was cool so uh and then man we was on uh to I was on I was on tour with Backstreet Boys I was I was supposed to be on the 9/11 flight and I'm getting ahead of myself thanks for watching you can subscribe here go to Patreon there check out Kinda Funny Games over there or see a playlist of some stuff Kevin's assembling over there Kevin's weird",
            "start": 1888.4
        }
    ]
}