{
  "id": 2523,
  "video_id": "ASijNE7DyhM",
  "show_name": "Kinda Funny Morning Show",
  "hosts": ["Tim Gettys", "Nick Scarpino", "Kevin Coello"],
  "title": "Wendy's Talking Mad Shit To McDonalds - Kinda Funny Morning Show 03.31.17",
  "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1490990585,
  "duration": 4613,
  "transcript_chunks": [
    {
      "text": "I can already tell Nick today's going to be one of those days that at some point I need to pee. We're going to need a lot of fun clips, so ladies and gentlemen, please send them fun clips to us however you want to do that. You normally your standards for fun clips are at 100%, please drop them to 80% today. You vet these fun clips, please vet them like we would vet U food choices after 5 hours of drinking at a bar. Mhm, okay, does it look like I'm looking at you guys? No, no, how close, how close is it? Uh, you would have to look literally up. Yeah, no more. Well, the thing is, it looks like you're in front of us. You'd have to turn your head around. Now it looks like, now looks like you're looking at us. Yeah, got it. All right, cool, good to know. Yeah, man, what an experience this show is every time. I got a fun clip prepped in here, do you that I cannot wait to watch. I I was late today, I apologize. Thank you so much for getting the stories together and so I didn't get a chance to actually look through",
      "start": 1.93
    },
    {
      "text": "a fun clip prepped in here, do you that I cannot wait to watch. I I was late today, I apologize. Thank you so much for getting the stories together and so I didn't get a chance to actually look through the fun clips that God sent to me on Twitter. Oh yeah, I'll do that as we go in the show, but you know, I feel like everyone's been doing a really good job of setting the fun clips lately. I don't want to ruin the momentum. We don't want to ruin the vibe. Yeah, there's a good vibe happening. This is a good show though, the stories today, some of them, yeah, quite interesting, some very up our alley. All right, good, I like that. So ladies and gentlemen, this is the Kinda Funny Morning Show. Each and every every weekday we get together and talk about all the nerdy news you need to know about. I'm Tim Gettys, this is the producer Seducer Nick Scarpino. I like when you wear me on you. I know I like wearing you on me, it's fun. Um, Andy Cortez, our new editor is on route right now. He is currently in LA around LA. I",
      "start": 61.96
    },
    {
      "text": "is the producer Seducer Nick Scarpino. I like when you wear me on you. I know I like wearing you on me, it's fun. Um, Andy Cortez, our new editor is on route right now. He is currently in LA around LA. I can't wait for Andy to start with us. I think it's going to be a blast. I I love that Kevin's already beginning the Hazing process. What no, single-handedly. I don't know the only one the literally I'm like oh I'm so happy to have Andy here what do we going to do and Kevin's like let's get eight monitors how is that Kevin haing process is like let's be really cool and nice to him give him the best desk ever but like overly nice and overly best desk and to the point where I'm like like I walked in today I'm like oh God that's such an eye sore I hope Andy doesn't like you sat and you were like yeah that's actually kind of no it's dope as **** but it's also like the first thing I see when I walk through the door every day so in reality it's not going to Haze Andy's not going to care it's just more",
      "start": 92.72
    },
    {
      "text": "actually kind of no it's dope as **** but it's also like the first thing I see when I walk through the door every day so in reality it's not going to Haze Andy's not going to care it's just more hazing of the old man Nick so I want to call Andy right now just to get an update on where he's at before I do that yes Kevin bring this up bring this up I don't think that desk is crazy that honestly the fact that I can't fit that in my office is devastates me it devastates me the thing is that's beautiful I I love it for gaming I think it's actually not bad for design it's just the desk space is the issue like he he can't even fit a pen on that damn thing now he can fit plenty of stuff all he has to do is move slide his keyboard up and then he's got plenty of De desk space in front of him the problem is the vi angle I'm mixing this I'm mixing it it's already if the three monitors were like this that'd be fine but there it's like yeah it's creating have to look shoulder that you get you",
      "start": 136.28
    },
    {
      "text": "problem is the vi angle I'm mixing this I'm mixing it it's already if the three monitors were like this that'd be fine but there it's like yeah it's creating have to look shoulder that you get you kind of go into and you have to look left and right it's the most Kevin Coello thing you've ever seen in your life why don't we let why don't we let Andy choose when he gets here that's all I'm saying likes it that's Andy's thing Andy can do what he wants look at me hazing him no cap before we call Andy because I have a feeling he he's with some of our friends in the house that is fun yeah that is Funhaus Funhaus um I want to skip ahead a couple stories okay to talk about a very important story this is real it's happening on April 1st which makes it really sound like it's not real also it alone sounds like it's not real James and Lawrence from Funhaus have been training to become professional wrestlers and are actually doing one of the professional wrestling matches like not the WWE",
      "start": 176.52
    },
    {
      "text": "alone sounds like it's not real James and Lawrence from Funhaus have been training to become professional wrestlers and are actually doing one of the professional wrestling matches like not the WWE **** we're talking the semi an all wrestling match M and they are going out there James's character is like James Angel is his name and uh Lawrence is called the troll keev can you can you click on James' Twitter oh my God they're going full into this they're really in going they're going real real in and then uh can you click on Lawrence's one one word of suggestion for him he should call himself anel James an he's really white so who we got the troll Sakamoto the troll Sakamoto which is amazing and he's just been on Twitter talking **** to everybody in character oh my god this is my favorite thing that's happened so yeah Funhaus the **** best of all time does he have arm yeah yeah okay he certainly does I think it's one of those sleeves that you put on to keep your arm for so",
      "start": 220.16
    },
    {
      "text": "thing that's happened so yeah Funhaus the **** best of all time does he have arm yeah yeah okay he certainly does I think it's one of those sleeves that you put on to keep your arm for so this is a real thing that they're doing and I I'm excited about this cuz you you know it's only a matter of time before Greg Miller gets involved somehow 100% and here's the thing that's going to happen Greg they look like they've trained Lawrence has lost weight and put on muscle for this Greg doesn't train Greg's just going to get hurt again Greg's at that place where well I mean well come on let's go Spade here whenever you put a bunch of that's him training doing his stunt training let's see this can we is this it's just a picture it's just a picture yeah anyway those guys interesting **** I love them so much I I I am baffled and flabbergasted this is a real event Kev can you go back to the event page Yep this is a real thing happening if you are in that area I have no idea where the ****",
      "start": 277.44
    },
    {
      "text": "them so much I I I am baffled and flabbergasted this is a real event Kev can you go back to the event page Yep this is a real thing happening if you are in that area I have no idea where the **** that is more Park California I don't know where more Park is but I'm sure it's not LA but it's around LA I'm sure uh April 1st this is a real thing that's happening and Rooster Teeth is going to be doing some type of shoot there so if you want to be in a Rooster Teeth video this is awesome get hyped get there I'm GNA call Andy James is **** jacked James is **** jacked you know the RO the **** Funhaus guys can suck it Funhaus guys they can suck it D all of them they're all tall they're all goodlook they're all jacked God damn you people what what what genan pool did your parents draw from that my parents just decided to skip that day my parents were like should we hey should we go to the Jee pool today nah let's let's watch Jerry Springer instead how about that and we'll just make",
      "start": 317.32
    },
    {
      "text": "that my parents just decided to skip that day my parents were like should we hey should we go to the Jee pool today nah let's let's watch Jerry Springer instead how about that and we'll just make our own little **** puddle of jeans it would be Nick Scarpino I don't know why you complain so much you got a great body I love it I have the body of someone like James looks like they made James and then the after like the other parts they had the spare parts they they used to make me no look at your hair your hair alone hair is terrible oh your hair is fantastic CU like if they took both of us sliced us into one and then no they took all the good parts with protein power yeah yeah yeah like like vanilla way protein power your call has Andy you **** **** you're out here trying to get to us who knows maybe he'll stay with Funhaus maybe they'll like beat the **** out of oh please my God be hilarious if he was like you know what guys they offered me a job and I decided to stay here",
      "start": 362.08
    },
    {
      "text": "us who knows maybe he'll stay with Funhaus maybe they'll like beat the **** out of oh please my God be hilarious if he was like you know what guys they offered me a job and I decided to stay here I'm already here I just didn't feel like driving the extra six hours yeah and then Kevin just he cuts to Kevin he's just sitting at the desk by himself with a stupid shap monitor stop talking **** about the desk the desk is **** amazing so Nick do you had a a weird experience this morning that I think we should talk about oh with my wife yeah oh yeah oh well that sets it up F uh no I got I was late today I had no good excuse um because I went to get a cup of coffee which is now uh coffee water that's why it looks like I have a vial of piss on my on my desk um and I come out of the coffee shop and I hear my name and I'm like that voice sounds really familiar and I looked up and I saw my wife walking down the street and I got super excited it was like when we were dating I was like oh",
      "start": 403.44
    },
    {
      "text": "shop and I hear my name and I'm like that voice sounds really familiar and I looked up and I saw my wife walking down the street and I got super excited it was like when we were dating I was like oh wow this is like it's exciting I'm seeing you outside of my normal realm of comfort like of where I'm not used to seeing you and we started chatting we just started talking for like way longer than we should have and I looked at my watch I was like I am really late I have to go I'm sorry we'll continue this later so we have plans to watch a movie later hell yeah be what are you going to watch I have no idea whatever we're gonna here's what we're gonna do we're going to go on H like uh on on demand we're gonna blade through whatever is there we're not going to want to watch any of them I'm going to play Zelda and she's going to watch like real housewives above Hills okay that's fun no there's something about that me and J were just talking about this like cuz she ran into one of her friends",
      "start": 447.44
    },
    {
      "text": "to play Zelda and she's going to watch like real housewives above Hills okay that's fun no there's something about that me and J were just talking about this like cuz she ran into one of her friends uh outside of a context that she's used to and it just throws you off it feels so like adventurous you're like oh takes you out of your um it's happened with me and Kevin before in really weird ways where like I'll be out with like a group of friends and I just come across Kevin it's like oh **** Kevin Hey and it's like as if we don't spend 0 hours a day with each other what ends up happening usually is like all right cool now we're with one giant group of friends you know it's it's a fun little yeah I see Paula every once in a while because she walks around my neighborhood because she works there that's really weird that's weird seeing Paula in the wild is like who cuz I don't know if Paula likes me or not and she doesn't she thinks you're creepy I don't have any it's probably all the",
      "start": 479.88
    },
    {
      "text": "there that's really weird that's weird seeing Paula in the wild is like who cuz I don't know if Paula likes me or not and she doesn't she thinks you're creepy I don't have any it's probably all the **** you say about me online there's no one that's around that's telling me yes or no for this but it's just a feeling that I get that she doesn't like me I'm kind of telling you yes it's not like a like a set in stone feeling you know like there's no one actually around here that's like witnessed her talking privately about me saying that I'm creepy or whatever it's just like you know I'm very intuitive well also it's she also she's like he's so old I think it's the Hat it's feeble the Hat old feble hat Paula's hat the sun hat you think it's it's it's one of the many hats yeah she has a lot of hats she's a man of not a man she's a man of any hats she's a woman of many hats man of many hats and a woman of many shoes she L of boots big shoes god so manyo she likes them big shoes SpaceTime",
      "start": 519.48
    },
    {
      "text": "of hats she's a man of not a man she's a man of any hats she's a woman of many hats man of many hats and a woman of many shoes she L of boots big shoes god so manyo she likes them big shoes SpaceTime Dave says uh bombos but I think he meant Bongos or maybe he me bomb go I don't like it zigger uh I never heard of him says Nick is creepy to be fair it is it is fair zigger because I hug you extra long it's cuz I like you most of all Tin Man Tin Man Tin Man is that what you call him all right the the biggest story of the day before we even get into the news here the final call and more already GameOverGreggy show is now live on patreon.com kindafunny you can get it audio video however you want to get it a lot of people have been listening I think it's a very important episode in our history definitely and uh so far people have been really enjoying it it seems to um kind of address the issues that people have been wanting to to hear more about or whatever so I'm I'm excited for for",
      "start": 559.12
    },
    {
      "text": "definitely and uh so far people have been really enjoying it it seems to um kind of address the issues that people have been wanting to to hear more about or whatever so I'm I'm excited for for everyone to hear it make sure you let us know what you think about it yes but of course it'll be going live week so so if you don't feel like backing us at the $4 000 level to hear the exclusive CL episode uh I'm just joking it's for the it's the it's the normal backing we we could have done that though you know it's like we would have been like hey at the $40 000 level you can get this and Colin would be the only person in the world that would be able to buy it's true it's very true Colin's like I got you listen to my own voice got Bros um all right let's see let's get in the news Okay Big K dog talking about start talking about the news uh this morning I woke up lil Gia getting ready to leave she had to Google Map how to get somewhere she pulls up Google Map she goes what the **** is that",
      "start": 612.2
    },
    {
      "text": "talking about start talking about the news uh this morning I woke up lil Gia getting ready to leave she had to Google Map how to get somewhere she pulls up Google Map she goes what the **** is that I'm like I just look at her she goes it's a Pac-Man I'm like no it's a Miss Pacman no way she's like you're a **** nerd do right now pH if you play if you open up your Google Maps right now you can play Pac-Man in your city that's awesome and it's pretty cool um I think this is part of Google's little April fools thing ladies and gentlemen we're about that time oh **** where if you see something that sounds too good to be true it probably is it sucks April Fool Saturday though no it doesn't does that doesn't affect anybody from putting **** out whenever the **** put people starting to put it out today of course they do and Google's always Google kind of just is does the same thing IGN does which is like we're going to use it as an excuse to just do something cool right let's see",
      "start": 660.24
    },
    {
      "text": "put it out today of course they do and Google's always Google kind of just is does the same thing IGN does which is like we're going to use it as an excuse to just do something cool right let's see what what's the top story on IGN right now IGN's fine I I they didn't do anything I mean I know I'm sure they're going do something but like I doubt they're going to do it until April fools itself of course hits but you know what ABS what a anyway the Pacman thing is pretty cool that's awesome yeah last year they was it last year no I guess it was two years ago they did Pokemon which was the kind of initial idea for Pokemon Go didn't they do Pac-Man like the just Pac-Man at one point oh did they yeah cuz I I I think it's the exact same system they're doing now too oh interesting yeah I wonder is there any anything more there Kev in the article let me look nope nothing more that's it moving on Nick on up yes we're now moving on to the most important news story of 2017 so far McDonald's and",
      "start": 703.84
    },
    {
      "text": "is there any anything more there Kev in the article let me look nope nothing more that's it moving on Nick on up yes we're now moving on to the most important news story of 2017 so far McDonald's and Wendy's have beef fresh beef see what I did there yeah you do they do so check this out have you heard about this no yesterday McDonald's tweets out today we've announced that by mid 2018 all Quarter Pounder burgers at the majority of our restaurants will be cooked with fresh beef to which Wendy's replies so you'll still use frozen beef in most of your burgers in all of your restaurants asking for a friend some random person says can you ask them if they still sellic flurries Wendy's response only when the ice cream machine isn't broken wow this is my favorite Wendy's it's lethal more **** going on and they just keep going and Wendy's just keeps coming back and not letting up and **** talking mad **** McDonald's just you know they're just coming in and just like with the facts they oh",
      "start": 744.56
    },
    {
      "text": "going on and they just keep going and Wendy's just keeps coming back and not letting up and **** talking mad **** McDonald's just you know they're just coming in and just like with the facts they oh you know we'll be replacing our current 100% beef patties for a fresh beef and our Quarter Pounder Burgers by mid 2018 and then Wendy's just keeps coming back lay in the smackdown people's tweets it's so good oh my God who the **** is running Wendy's Twitter right now that person sheay are people at Wendy's stoked about this are they like who the **** let that guy get the Twitter I hope he stoked also Wendy's is not that great so I know that's the thing like shut the **** up Wendy's if Carl's Jr. was talking **** I'd be like all right man Carl Jun knows what's up exactly Wendy's sucks they got the frosty though they got the frosty they do got the frosty shout out to the frosty man the frosty is like a very special device for happiness oh God the frosty yeah the Frosty Freeze mhm",
      "start": 806.04
    },
    {
      "text": "they got the frosty though they got the frosty they do got the frosty shout out to the frosty man the frosty is like a very special device for happiness oh God the frosty yeah the Frosty Freeze mhm that thing is just sugar man it's cold sugar that is it tastes like a chocolate marshmallow it's amazing it it does taste like a chocolate marshmallow if you get the chocolate one yeah which you always should you **** crazy man damn are we going to Wendy's today are we going to Wendy's today just for the frosties we're not going to get none of that I don't want lunch there no go to our frosties chick and C what's chick and CPE that's just what it's no it's chicken cpop chick and CP there's no and in there Filipino it's uh I'm not going to another one you all took me to a Hawaiian West yesterday that was like **** amazing I know you're talking hey Nick it was the Hawaiian driving that doesn't have a drive-in it's called Hawaiian Drive-In yeah and there's no Drive-In why would there be a",
      "start": 851.52
    },
    {
      "text": "that was like **** amazing I know you're talking hey Nick it was the Hawaiian driving that doesn't have a drive-in it's called Hawaiian Drive-In yeah and there's no Drive-In why would there be a drive-in doesn't make any sense it's very true I'm the stupid one in this equation absolutely yeah there's no Coupe at chicken Coupe that's true that is that is true now chicken coop is this place that I actually think you'd really like it's like home-cooked American Meals like I don't even like family like home styles it's it's like a high school um cafeteria style you go through and you're like all right I'm going to get the dinner and then you choose your meat so it's like ham it's like Thanksgiving dinner but any day you want it and you get the mashed potatoes you get your veget and you're like you could just go and be like give me a hella hella meat yeah some veggies and call it a day okay I'm in yeah it's let's do it and then we get Frosty freezes afterward Frosty Freeze are we",
      "start": 901.44
    },
    {
      "text": "like you could just go and be like give me a hella hella meat yeah some veggies and call it a day okay I'm in yeah it's let's do it and then we get Frosty freezes afterward Frosty Freeze are we actually doing this I'm really I don't want to go chicken we went there last night damn it we can go there again order something different besides the ham I hate you Kevin I hate you the ridge says or the Raj says do they already drag Andy onto the stream Andy's not here yet he's still in LA being a little butthole surfer a he's having fun down there surfing the buttholes surfing that sweet nasty buttholes next story K all right this is a fun one Nick ready you know that game Rocket League M it just got interesting oh no oh no what this is awesome why not I like how they had to have a dope ass beat it that's all it so yeah it's a 199 DLC pack and you get the the Dodge ice charger as featured in the hit movie Fate of the Furious **** yeah coming out soon in theat the next week oh I'm so",
      "start": 942.64
    },
    {
      "text": "beat it that's all it so yeah it's a 199 DLC pack and you get the the Dodge ice charger as featured in the hit movie Fate of the Furious **** yeah coming out soon in theat the next week oh I'm so excited about two weeks two weeks from now but honestly good for you Rocket League yeah right good for you Jeremy Dunham **** just getting those deals make it **** R Jeremy Dunham good for you brother that makes me it makes me happy too oh what what is happening what is happening oh nothing I'm just uh making noises yeah I'm just making noises that mouth all right let's do one more one more story and then let's read some of them sweet nasty tips you know we don't have any yet and I'm wondering if that's because Mex mx's broken or Kev can you check stream tip please I saw people tip us though earlier we definitely have tips go to stream tip.com okay Lo in well um this new story about the Legend of Zelda now I can tell I'll tell you all about it a patch just went out for Legend of Zelda",
      "start": 1022.48
    },
    {
      "text": "earlier we definitely have tips go to stream tip.com okay Lo in well um this new story about the Legend of Zelda now I can tell I'll tell you all about it a patch just went out for Legend of Zelda the new released 1.1.1 patch for the Legend of Zelda Breath of the Wild seemingly removes or reduces the severity of many of the games dips and frame rate on the Wii U and Switch in both handheld and docked mode Nintendo notes for the 167 megabyte patch simply read adjustments have been made to make for more pleasant gaming experience however players on Twitter Reddit neoa and YouTube have all reported improved performance since installing update anecdotally trouble spots particularly areas with lots of long grass do seem to have received a significant boost although certain areas with particular problems which I won't reveal for fear of spoilers still do suffer from consistent dips frame rare problems were a key concern in otherwise sparkling review of blah blah blah blah blah that's fun yeah",
      "start": 1070.92
    },
    {
      "text": "which I won't reveal for fear of spoilers still do suffer from consistent dips frame rare problems were a key concern in otherwise sparkling review of blah blah blah blah blah that's fun yeah immedi is even better great I mean did you notice any frame rate issues um no not really but I haven't gotten any like the bigger bosses so I mean no not really yeah i' I've gotten to a couple parts where it like chugs just a bit that's never welc to yeah so I get it on like a competitive level but I'm not a competitive Zelda player are there competitive Zelda players I'm sure there are I'm sure I still want to watch one of those like when I finish it I want to go back and watch one of the speedruns they're they're fascinating that's cool cuz I'm like how the **** do you beat this thing in less than an hour they do it that's crazy uh we do have some tips I apologize for earlier uh the nerd pulse says the $5 was worth knowing that you guys would see this fun clip and on the day you need them the",
      "start": 1115.8
    },
    {
      "text": "An hour they do it that's crazy. Uh, we do have some tips. I apologize for earlier. Uh, the Nerd Pulse says the $5 was worth knowing that you guys would see this fun clip and on the day you need them the most. Glad I can bring you this joy. Thank you. We're going to prep them fun clips for later. Hey guys, uh, this is Josh Anderson sending some more KF donations. Firstly, Nick, do you like Fair Sper trailer? I made love you guys. You're the best. Thanks for making me happy. Here's a fun clip. I did like it. Um, it was a long trailer, but I liked I liked what you were going for there. Remember it had to be long though for his class. True, it had to be long for your class. I would uh uh I thought it was good. I'm wondering if you could use music because I think at some point there you could play around with some music with it. I think what up the intensity of it, but I think I thought it was an interesting use of uh recutting Fair Speeler to make like a psychological action lots of gunshots lots of gunshots.",
      "start": 1154.76
    },
    {
      "text": "music with it. I think what up the intensity of it, but I think I thought it was an interesting use of uh recutting Fair Speeler to make like a psychological action lots of gunshots lots of gunshots. Appreciate but thank you for sending that, Josh, and happy hunting on your next one. Happy Hunting. Uh, Chicks 18 says, Hey Taco and Bell, happy **** Friday. We're sipping a Coke and rum. Okay, or R Coke rum. I'm like so what I'm drunk. It's freaky weekend. B bab about to have about to have some fun. Is that a lyric from a song? R Kelly's Ignition Remix. It's the remix to ignition hot and fresh out of the kitchen. Mama roll in that body got every man in here wishing. I he says in the background. Thank you for that. Thank you for that. Chicks 18 Ash rules 901 says thought I would leave your childhood permanently scarred with this fun clip. I was laughing for hours. Well, okay, we'll take that ride with you. Uh, friendly erection says sup guys next time you're in St. Louis Bisbo area you got to let the people know and",
      "start": 1191.76
    },
    {
      "text": "with this fun clip. I was laughing for hours. Well, okay, we'll take that ride with you. Uh, friendly erection says sup guys next time you're in St. Louis Bisbo area you got to let the people know and have a meet up. I know you were down there a few weeks ago and didn't get to see the sites. Uh, the locals know about uh we were only down there for about 4 hours and then we had to go right back on the plane because we were flowing in the first flight in and the last flight out and there's only like two flights. I can't wait for you guys to see that video. It's going to be awesome. Me, Nick Altano, and Scoville riding around in dune buggies. What a disaster. **** acting like **** uh yeah know it's going I don't know they're they're working on it though. I know that they reorganized the the plans for what's the IGN's doing the series The Extreme Gaming challenge where uh you play video games in Extreme Ways. The first episode went live with Nathan Barnett where he was in a jet and the Jet Fighter was",
      "start": 1234.2
    },
    {
      "text": "the IGN's doing the series The Extreme Gaming challenge where uh you play video games in Extreme Ways. The first episode went live with Nathan Barnett where he was in a jet and the Jet Fighter was doing like barrel rolls as he had to play a game and he threw up in the jet so fun sounds fun. Um, the second episode which is not live yet but they shot it and they're working on it and they put out a bunch of behind the scenes stuff it was Alana and Naomi in zero g playing Switch so that's **** awesome. I wish we got to do that one and then we did one us doing playing Ghost Recon while we're on D buggies dune buggies it's fun yeah so look for that soon. Uh, dicks out for py gave us a tip and said Kevin I've been edging slow jerking ever since the last occurrence of Bongos. I need to see that sweet Peruvian belly getting slapped so I can achieve the Ecstasy of sweet release. Kevin there are people in pain right now because you're not giving them Bongos they got that blue Bongo balls you",
      "start": 1274.24
    },
    {
      "text": "sweet Peruvian belly getting slapped so I can achieve the Ecstasy of sweet release. Kevin there are people in pain right now because you're not giving them Bongos they got that blue Bongo balls you understand that Kevin you selfish selfish man you've got what people want give the people what they need. Kevin you know what they need big Kev dog Panzer G says Nick I was watching Midlife Ballers discuss the Colin situation when they said something so funny I fell off the chair laughing comparing Colin to Darren being replaced on B Witch uh mascarino hype about yeah we're not going to replace Colin with anyone. Colin's Irreplaceable he is truly oneof a kind so that's not going to happen but it would be hilarious if he brought in another Colin that looks smly like Colin and was really kogy um we could we could potentially try that I guess that's an option we'll keep in our back pocket though. Uh, last tip for now comes from PL Planet says here's a fun clip I made for all OverWatch fans in the",
      "start": 1318.88
    },
    {
      "text": "could we could potentially try that I guess that's an option we'll keep in our back pocket though. Uh, last tip for now comes from PL Planet says here's a fun clip I made for all OverWatch fans in the chat. I hope you like the Doom soundtrack love you guys keep up the great work. Thank you. Are those all the tips you're seeing those are all the tips I'm seeing okay this here I have two more you want to read them I have to I see him City uh Chris Ransom says what's your advice strategy to take back your fair share of bed from your girl give up you're done yeah you're lost you lost that fight get a bigger bed that won't help you get a king siiz won't help you and here's what you do here's what I do I have a pillow that I hug sometimes cuz I have to put my arms around something and usually my wife doesn't like it so I'll put the pillow in between us so that if the foot hits the pillow that's the buffer now what's funny about this is you might be asking yourself but Nick your wife doesn't like",
      "start": 1363.56
    },
    {
      "text": "doesn't like it so I'll put the pillow in between us so that if the foot hits the pillow that's the buffer now what's funny about this is you might be asking yourself but Nick your wife doesn't like being anywhere near you in the bed that's what the pillow is for oh the pillow was her doing no that's yeah yeah okay got it got it okay that's hilarious yeah because for me I have a strategy which is when I I know that like she's starting to get sleepy like you can see it in her eyes you're like all right so then I start pushing as far over on her side as possible and I cuddle the **** out of her yeah well I'm just like all right you're getting all the cuddles you're getting everything that you want cool good are you asleep I get I wait a little bit more to make sure she's really asleep and then I'm like then I roll over and I have my whole thing then eventually I wake up and she's like like a **** koala jetpack the old cuddle and roll man it works n out of 10 times the old cuddle the",
      "start": 1410.16
    },
    {
      "text": "then I'm like then I roll over and I have my whole thing then eventually I wake up and she's like like a **** koala jetpack the old cuddle and roll man it works n out of 10 times the old cuddle the old cud and roll I want to send some sweet nasty love to someone yeah and I was like I don't know who today and I was roll going through my Twitter Naomi Kyle I haven't seen her in too long spent quality time with her in at least a year she has purple hair now on it's to she does have purple hair so let's let's send Naomi Kyle @ Naomi Kyle on Twitter some sweet nasty love from Tim and Nick as the world is farting outside yeah some is that right in front of us no it's across the street they're like destroying one of the palm trees they're destroying a palm tree like cutting it up and **** whatever it's one of those giant wood chippers okay well you guys about to hear some wood chippers there you go uh Mel Lamo Joey says Hey guys here's a trailer for a short film for my college senior",
      "start": 1454.4
    },
    {
      "text": "whatever it's one of those giant wood chippers okay well you guys about to hear some wood chippers there you go uh Mel Lamo Joey says Hey guys here's a trailer for a short film for my college senior project it'd be awesome if you guys could check it out second trailer comes out this weekend okay cool thank you for that guys very cool a grassas grass ass can you guys do a bit of the subscribers no we're doing those at the end because it kills the moment momentum really so mhm so mhm what do you want to do now you want to read some more news let's go to the news all right there's a movie called Lion King coming out Nick never heard of it it's uh kind of a big deal story for this it is yeah there should be oh **** what yeah it's the wrong link n Go to variety.com this is harder than I thought all right you know what I know the story we don't need to put it up here garbage truck on fire rolls on so we know Donald Glover going to be Simba right yeah we know James drones backa they're",
      "start": 1500.6
    },
    {
      "text": "all right you know what I know the story we don't need to put it up here garbage truck on fire rolls on so we know Donald Glover going to be Simba right yeah we know James drones backa they're talking about Beyonce for Nala oh son of a **** yes that's the gift that keeps on get yes the queen comes to Lion King I'm very excited about got nothing wrong with that so stoked do do you think they're going to write some original music for this like they did Beauty and the Beast because I'd like that if you got Beyonce now you got someone that has range I got to write her a couple songs I can see it yeah like I can imagine that that cuz yeah it's going to be longer than the other movie so it has to be right mm that's awesome and lion could use there's like does donover sing he can yeah can he sing well well I mean yeah I mean he's he he doesn't got vocals you know what I mean like he's not like beon like doing that whole thing but like he definitely sing his last album was all singing",
      "start": 1564.04
    },
    {
      "text": "he sing well well I mean yeah I mean he's he he doesn't got vocals you know what I mean like he's not like beon like doing that whole thing but like he definitely sing his last album was all singing interesting for better or worse but you know fair enough um fair enough yeah then the next story this one this one's about Twitter this happened yesterday okay now on Twitter 140 characters for your replies you may have noticed that if you are on Twitter and you start add like replying to people yeah it's it looks different now you no longer if you've got four people that you're replying to you no longer have to use like a one-word answer yeah because you know it gets so ridiculous when someone's like hey at Nick Greg Tim Kevin Colin cool Greg how are you doing today and by you respond you're like fine that's all the characters you have left yeah yeah they fixed that finally they did fix that it's kind of Genius it's actually good I want to give a shout out to Alex in the the chat saying I",
      "start": 1606.4
    },
    {
      "text": "fine that's all the characters you have left yeah yeah they fixed that finally they did fix that it's kind of Genius it's actually good I want to give a shout out to Alex in the the chat saying I think that with that cast we can safely say that NOS will be scar it's funny because NS has speak with JC it's this whole thing I like that that I wonder if they will cast the scar yeah who will they is the dude that did Scar still alive uh Jeremy Irons is still alive yes but I don't know if they'd recast him it' be awesome if they recast him he's so good cuz he's good yeah the hyenas are going to be interesting well that I mean Whoopi Goldberg's still alive too yeah all of them are still alive we'll see Nathan Lang is still alive for uh uh I think the other guy maybe not be alive but I'm pretty sure Nathan Lang is still alive for tone and Pumba yeah so yeah actually I know Nathan Lang is still alive he was just in the people or OJ Simpson perfect yeah let's just do it again hak gang back",
      "start": 1648.36
    },
    {
      "text": "sure Nathan Lang is still alive for tone and Pumba yeah so yeah actually I know Nathan Lang is still alive he was just in the people or OJ Simpson perfect yeah let's just do it again hak gang back together what a wonderful phrase anyway this Twitter thing this is actually huge for people like us and for I imagine people like you that do a lot of replies on Twitter I do I only reply to people on Twitter I barely true you joing o tweets for me that's why all my Twitter's clean these days we got DJ music DJ Muscle Milk says God Tim you're such a tool bag I'm going to take that as a compliment you are people really like tool but you're a really good like you have a good set of tools I think is what he meant to say you have a very good set of tools in your bag I'm handy dick man I got that good dick thanks DJ Muscle Milk I know that's what you we all know you're not handy as yesterday you were trying to ask us to fix your uh your shower head and you're like what are those things called",
      "start": 1686.52
    },
    {
      "text": "good dick thanks DJ Muscle Milk I know that's what you we all know you're not handy as yesterday you were trying to ask us to fix your uh your shower head and you're like what are those things called that you do uh you ply things off with yeah I was like pliers and you're like yeah do we have any of those in the office like we do did it work oh it **** worked good I po that **** off you bring the tool back uh no because I didn't get my new thing yet and I want I need it for when I get my new shower head hey big cat dog when you're done with that can you um dot by dot the screen over here oh sure grassy ass it wasn't dot by dotted huh no it's not DOT by Dot stretchy stretchy um can you pull up the next news story oh you already did oh you didn't pull it up up though no I certainly did not there's more Twitter stuff Nick damn Twitter making those changes Twitter decided that people don't like eggs no **** these Twitter eggs so they got rid of them and now it looks more like the",
      "start": 1730.8
    },
    {
      "text": "not there's more Twitter stuff Nick damn Twitter making those changes Twitter decided that people don't like eggs no **** these Twitter eggs so they got rid of them and now it looks more like the default Facebook like you don't have a picture here's just a generic blob thing I would say dude but it could be could very and how long it does it looks like a Thum print how long do you think it took them to go back and forth in that where they were like doesn't look like a guy doesn't look like a girl doesn't look like a kid doesn't look like anything this is the most gender race neutral thing you've ever seen in your entire life blob that was probably six months in the making Twitter right there but they did it they did it and they nailed you nailed it whoever designed we won dead the war on Twitter eggs I think it's uh uh Elon Musk I follow him on Twitter and I think his Twitter bio says never argue with the Twitter yep I love that I love that tag a lot of people have that it makes",
      "start": 1775.48
    },
    {
      "text": "on Twitter eggs I think it's uh uh Elon Musk I follow him on Twitter and I think his Twitter bio says never argue with the Twitter yep I love that I love that tag a lot of people have that it makes sense it does make sense eggs also congrats to Space Ax they just relaunched a missile right wasn't that story I want look for that story Kev just said yeah yeah he's like yeah yeah so Nick here's here's a story for you there's a poster release for Kingsmen the Golden Circle coming September  9th  017 how does that make you feel Colin F how is Colin F this I don't know but it looks like he's right there you can see him **** awesome seen the movie Kingsman one is phenomenal um Ian I guess I'm just going to bring him back you think so H spoilers if you haven't seen you haven't figured out by our what we're saying right now Colin F did not make it through the last get shot in the ****",
      "start": 1819.32
    },
    {
      "text": "our what we're saying right now Colin F did not make it through the last get shot in the **** yeah have you did you see I need to watch it everyone's like this is a timov there are two movies that three movies that you need to watch now John Wick you **** up John Wick triple X the newest triple X and you have to watch Kingsman to watch this weekend it's such a good movie I'm going to make a note it's actually I think a better experience than John W so prioritize that over really yeah I I loved Kingsman it's got humor it's got awesome action it's a great concept and it's got your boy Samuel L how did you not I don't know watch everything Sam does isn't he also inlex I actually come to think it I think he's in all three of those movies um I'm joking he's not he's not in John Wick that's Lance reic uh is it on Netflix or anything uh I don't think is on Netflix that you're going to have to rent it on Amazon all right I'm copying this story in because I want to talk about it I just",
      "start": 1867.92
    },
    {
      "text": "Lance reic uh is it on Netflix or anything uh I don't think is on Netflix that you're going to have to rent it on Amazon all right I'm copying this story in because I want to talk about it I just want to read it and I won't read it if we don't do this just I'm copying another story oh okay U my last story I had for the day Hardware maker Mad Catz is finally dead a **** you you might you might know them from their third party controllers you had to play with when your older brother was an **** back in the day yeah um then later you might know them as the guys that revived Rock Band they made all the controllers for that but following a lengthy struggle with financial insolvency gaming peripheral maker Madcast has formally ceased all operation the company's directors and officers have all resigned and its assets will be liquidated the company that spent nearly three decades pumping out PC and console gaming gears no more according to official announcement released today yesterday",
      "start": 1912.0
    },
    {
      "text": "all resigned and its assets will be liquidated the company that spent nearly three decades pumping out PC and console gaming gears no more according to official announcement released today yesterday Mad Catz made a voluntary assignment in bankruptcy which in Canada means the company assigned all of its property to do a trustee in this case Price Waterhouse Coopers which would oversee the liquidation of company Assets in Pay there they're the ones that **** up the Oscars are they oh yeah really oh yeah along with the Canadian filing the San Diego based company also filed for chapter 7even bankruptcy in the US which grants protection in order to facilitate the smooth liquidation of assets ncat has been in money trouble for several years with steadily declining revenues documented in the company's Financial reports last year the company laid off nearly 40% of its Workforce following a major investment in developing peripherals for for harmonics as Rock Band 4 in January shortly after",
      "start": 1962.76
    },
    {
      "text": "company's Financial reports last year the company laid off nearly 40% of its Workforce following a major investment in developing peripherals for for harmonics as Rock Band 4 in January shortly after announcing a new line of Tekken 7 arcade sticks the company received listing deficiency notice from the New York Stock Exchange warning that it would be delisted if its stocks continued to trade at abnormally low rates the company was Dlisted last week as shares dropped to as low as 04 Dam no I guess that would just be 4 cents okay it's still sad that was a weird way to frame that yeah um anyway that's an forun that's that you know Mad Catz probably did wrong you were you were something you were something yeah and I mean I guess I don't have much nice to say based on my experience I don't know that a lot of people do have a lot of nice things to say but you but I mean obviously this sucks to people losing their jobs and all that so I'm sorry for them sorry for the layups guys you'll land",
      "start": 2003.0
    },
    {
      "text": "that a lot of people do have a lot of nice things to say but you but I mean obviously this sucks to people losing their jobs and all that so I'm sorry for them sorry for the layups guys you'll land on your feet all right Nick yes what's your story well my story is unrelated to gaming and or movies but but I think is still fascinating SpaceX makes Aerospace history with successful launch and landing of a used rocket this is by Lauren Grush over on uh The Verge um are you familiar with SpaceX at all yes okay so after more than two years of Landing its Rockets after launch SpaceX finally sent one of its used Falcon 99's back into space the rocket took off from Cape canaval Florida this evening sending a communication satellite into orbit and then landed on one of spacex's drone ships floating in the Atlantic Ocean all this taken out of context sounds terrifying it's actually probably a really good thing do you have it yeah sorry let's take a look at it no no let's take a look at it hold",
      "start": 2050.36
    },
    {
      "text": "in the Atlantic Ocean all this taken out of context sounds terrifying it's actually probably a really good thing do you have it yeah sorry let's take a look at it no no let's take a look at it hold on there it is we'll get there in a second oh my God that's so **** cool wow that's so cool yeah looks like Robotech it was round two for this particular rocket which already launched and landed during a mission in April of last year but the Falcon 99's relaunch marks the first time in orbital rocket has launched to space for a second time SpaceX CEO Elon Musk appeared on the live stream shortly after landing and spoke about the accomplishment it means you can fly and refly an orbital class booster which is the most expensive part of the rocket this is going to be ultimately a huge revolution in space flight he said obviously um they're making huge strides toward privatizing space flight and this is one of those things this is this is the equivalent to uh you know uh putting everyone in a",
      "start": 2090.96
    },
    {
      "text": "in space flight he said obviously um they're making huge strides toward privatizing space flight and this is one of those things this is this is the equivalent to uh you know uh putting everyone in a plane sending the plane over to the east coast everyone gets off and then you throw the plane out right they figured out how to put more people on it and bring the plane back so this a huge step for Aerospace and this is awesome how long do you think until they get the mood lighting that Virgin America has oh man I think that's like maybe that's like 6 months from now okay I think that the landing looks pretty sick it's so **** cool whoa it's so cool what the **** that was what it looks like the beach Oh I thought that was a scene from Rogue One it might be that's cape cape canav looks a lot like look how cool these rockets look those some sick ass Rockets they're dope man they're dope you must doing it hey was this here on purpose yes that's a fun clip for later oh that's cool so",
      "start": 2137.6
    },
    {
      "text": "a lot like look how cool these rockets look those some sick ass Rockets they're dope man they're dope you must doing it hey was this here on purpose yes that's a fun clip for later oh that's cool so anyway uh everyone go over to The Verge and read more more of the story if you want I don't know that much about it but uh but it's very fascinating I think it's awesome space do we have any more tips oh uh let me take a look standby for Titanfall they don't like re up you go to just like two final tips for the day and then we'll call tips how about that one comes from Brandon 8bit gave us a nice tip and says I'm drunk at 5  3:00 a.m. and this is the first time I've managed to capture the Kinda Funny Morning Show uh live **** Australian time zones I'm coming to rub beards at Kinda Funny Live 3 get ready # stay hungry hell we going to stay hungry don't even worry about that Naomi Naomi is getting a lot of sweet nasty love from us so thank you for that she's going to text us in a",
      "start": 2180.6
    },
    {
      "text": "live 3 get ready # stay hungry hell we going to stay hungry don't even worry about that Naomi Naomi is getting a lot of sweet nasty love from us so thank you for that she's going to text us in a minute she just tweeted about it thank you guys no she appreciates it good uh Hey guys says uh fake AZN here's my first tip ever thank you for making is that Arizona Asian Asian Jes you didn't grow up in NorCal I clearly did not I'm sorry no one calls it NorCal I call it NorCal all the time yeah that's because you're from SoCal yeah we hate you guys we're the real Cal and you guys are they don't even have water down there did you know that yeah water together we give don't give a **** dude we buy our water don't give a **** we buy all water in bottled water cuz we're X like that dog first off I just started drinking like did you yeah the bomb uh here's my first tip ever says fake Asian uh thank you for making my workday easy here's a fun clip you don't have to watch the whole thing stop",
      "start": 2225.16
    },
    {
      "text": "I just started drinking like did you yeah the bomb uh here's my first tip ever says fake Asian uh thank you for making my workday easy here's a fun clip you don't have to watch the whole thing stop whenever you want um well thank you for that clip all right no more tips we're calling tips today it's Friday take your money go buy something fun today do something nice for yourself get a Frosty get a **** Frosty today sick burn that unless you're on an all protein diet which case don't get a Frosty today go get a protein shake or something cool like that who whoa you're getting a **** Frosty right no I'm going to do the thing I always do Kevin where you guys are going to get the Frosty and I'm just going to eat some of it and pretend like I didn't eat any of it and then I'm going eat your French fries also when you're not looking so get the cheese fries wherever we go e remember when we used to go to Jenny burger and Greg with those cheese fries and I would just dip my finger in the",
      "start": 2269.36
    },
    {
      "text": "French fries also when you're not looking so get the cheese fries wherever we go e remember when we used to go to Jenny burger and Greg with those cheese fries and I would just dip my finger in the cheese I do and eat it and I'd be like don't look at me let's do the giveaway **** before we start watching some fun clips and going and going from there right y oh my God side note I watched Jim Norton's comedy special last night oh yeah you should watch it really it's **** funny okay he's a he's a sick **** anyway sorry continue the giveaway how do people win do every day we give away a video game to one lucky winner out there there's four ways to win Nick one being the Twitch chat to be a Twitch subscriber which you can do by paying $5 a month on Twitch or if you have an Amazon Prime account you can do your Twitch prime or every month you can use you get one free subscription there's no real concise way to explain that no it's not cuz it's very convolutive that's why we should",
      "start": 2304.68
    },
    {
      "text": "account you can do your Twitch prime or every month you can use you get one free subscription there's no real concise way to explain that no it's not cuz it's very convolutive that's why we should make like an image that when we talk about this every day Kev it goes up so people can see it visualize absolutely let's make a note of that yeah make the image and I'll do something crazy with maybe now that we have Andy we can just tell him to do everything yeah we can well we can ask him he here already no why isn't he here I want Andy here he will already have made the image put he won that's true no um anyways you can do the Twitch Prime thing that I'm sure you know if you've ever watched the show um the other last two ways are support us on patreon.com kind of funny or patreon.com kind of funny games I would recommend supporting on patreon.com kind of funny today because Colin's last Gog is there and you should go check that out it's really good also for you next week though yes we not",
      "start": 2344.04
    },
    {
      "text": "funny games I would recommend supporting on patreon.com kind of funny today because Colin's last Gog is there and you should go check that out it's really good also for you next week though yes we not saying you have to just to clarify just to clarify for everyone this is the normal way we do it uh uh okay all right today we are giving away a bigger one here Battlefield 1 premium pass holy **** on the PlayStation 4 oo doctor stop stop oh doctor Dr. Jones I knew it I knew that's where it was going Dr. Jones the winner is from patreon.com kind of funny and his name is Mike Morrow send an email to this kid Kevin Quello is going to send you an email you're going to get an email from big old ke dog big old ke dog we get that Battlefield Premium pass on PlayStation 5 uh not the last there at work I don't know what the hell that means says the last Gog as a host may show up again as a guest that is right col this is last Colin this is Colin's last official Gog as one of the like the four",
      "start": 2382.16
    },
    {
      "text": "work I don't know what the hell that means says the last Gog as a host may show up again as a guest that is right col this is last Colin this is Colin's last official Gog as one of the like the four Staples at the table cast if you will shall return there's no you can't keep down he's going to do crazy **** we're want to talk to him about it so we'll get him up here of course it involves I guess he's moving to LA so it involves him getting on a a plane which is calling second least favorite thing to do first least favorite thing to do is leave his house yeah so that involves two of his least favorite things leave house drive to airport that's the third and then get on plane he doesn't want to do **** so we'll try to get him up here as much as humanely possible but it's also going to be fun just randomly texting him uh just horrible **** they like show him horrible **** at work but I'm just going to text them yep uh Steven cool says Naomi for Gog we're working on it uh we",
      "start": 2443.64
    },
    {
      "text": "be fun just randomly texting him uh just horrible **** they like show him horrible **** at work but I'm just going to text them yep uh Steven cool says Naomi for Gog we're working on it uh we announced yesterday that Alana Pierce will be on Gamescast sometime next month so that's interesting there's going to be a lot of cool guests coming up we've been been talking to some people we got some cool **** going on I'm excited so get hyped as the get hyped guys get hyped or don't get hyped and just stay relaxed like me Jer one says wait did you guys say he's moving to LA that's what he said in his update video and uh from talking to us he's like yeah he's planning on it there's no like actual date or anything but Colin is planning to be in LA to be more around his political friends he wants uh his fellow pundits I don't know I don't know what I don't know what the name for I know what we do we YouTubers or podcasters I don't know what the the correct name for a YouTuber who is a PO",
      "start": 2479.16
    },
    {
      "text": "uh his fellow pundits I don't know I don't know what I don't know what the name for I know what we do we YouTubers or podcasters I don't know what the the correct name for a YouTuber who is a PO political comment I guess political commentator that'd be the right word right probably because we don't really do we don't really comment on anything important so like you just call us podcast we we do comment on important things hey if you want to know how good the Power Rangers movie is you can go to YouTube / kind of funny right now and see our reacts and surprisingly we recommend it all right what else do we gotes all right let's let's get into some of them fun Clips it's Friday it's Friday got to get down let's go deep into Fun clip I'm excited for this I got one for you I I saw a clip of this come across my Facebook and I was like you know what I want to watch this but there's a problem with Facebook that we kind of talked about yesterday why is it impossible to share a freaking video",
      "start": 2522.48
    },
    {
      "text": "come across my Facebook and I was like you know what I want to watch this but there's a problem with Facebook that we kind of talked about yesterday why is it impossible to share a freaking video off they don't want people off off their thing it's obnoxious I hate it is this no it's not that scroll down bit more down keev is that it wait I want to see this one oh I want to see that one too what is that I don't know no it's not this one are they getting shot at I think they're like musket guns that that sounds terrible don't have the ball in it it's still scary people are weird dude oh **** this is how they re act their Civil War it's not that weird man it's actually a lot cooler than our civil war CU at least they're hitting each other all keep going down keep going down give us a hint keep going I know what I'm looking for keep going going SC scroll go enhance enhance it's not that one what what is yeah let's go and play that let's go ahead and play that you think they lied",
      "start": 2564.2
    },
    {
      "text": "a hint keep going I know what I'm looking for keep going going SC scroll go enhance enhance it's not that one what what is yeah let's go and play that let's go ahead and play that you think they lied and said it was candy is this just a show where people try to eat things Kevin this is the show made for you oh **** what the **** just happened I don't know okay yeah I think one of the things is chocolate Wait full screen so we can actually see what the hell's going  on that's clearly fake that's his paper  lady I look how they pull **** smoke in her face you could really hurt your teeth doing this I like it if it's real they blow smoke on your face stop that was just a plant that was just a PL all right should we move on this is **** amazing yeah oh man who the **** makes all these fake things I wonder if they taste good do you think they taste no they probably taste like waxy **** all right all right this is not the clip I was talking about God bless Japan",
      "start": 2614.04
    },
    {
      "text": "makes all these fake things I wonder if they taste good do you think they taste no they probably taste like waxy **** all right all right this is not the clip I was talking about God bless Japan wait hold on should we see although to be fair I think we found a new source of fun Clips which is just Japanese TV **** amazing the Japanese are the most creative people on the planet man man game show stuff are always crazy remember Most Extreme Elimination Challenge is that where they had to go through little like well it was similar to that yeah so good yeah so that that's the one that's the one all let's see this let me see it so what's the premise here so the premise here is she has to just put her hand in and like I don't know I'm assuming she gets money I've seen American versions of this and it'll be like it's like Fear Factor right but there'll be like maggots and ****  inside oh my God that's **** up man she doesn't know what it is it's just a little PU",
      "start": 2703.0
    },
    {
      "text": "of this and it'll be like it's like Fear Factor right but there'll be like maggots and ****  inside oh my God that's **** up man she doesn't know what it is it's just a little PU    just put your **** hand in the Box lady I say we we just do this game now no Kevin because you put like a blade in there yeah manev put a **** I I have I need you to be afraid Nick that's hella funny cuz it keeps bumping in this **** so it's thumping so she thinks it's alive this is my favorite thing that's ever happened I want to see let's go to the next fun clip wait hold on I want to see if she grabs it well skip forward and see if she actually oh she did it there she goes look at her oh it's a little puppy she's she was not scared for no reason now you learn something about your life next clip you can stop being young uh again we set the bar low today all right I don't know how great is this actually just Michael Jackson's Smooth Criminal I don't know I can't",
      "start": 2740.8
    },
    {
      "text": "about your life next clip you can stop being young uh again we set the bar low today all right I don't know how great is this actually just Michael Jackson's Smooth Criminal I don't know I can't hear it but I know something happens all right well let's see it this video is awesome    wow all right thank you for that good good for them good for them yeah that's totally getting us claimed that's that is a Michael Jackson song sure sure sure let's see this oh this is classic can't hear it mean I don't think you have to it's just this will also just get us claimed oh no we're okay with this one oh no Doofy you **** idiot Goofy helps him though fell into the water dude that that hurt like a **** yeah he would my favorite thing is like you can see Pluto looking at him like oh **** like is he good I like the one of the Chipmunk stop what oh my God all right so these this is uh fireworks in Glasgow okay oh man these videos these are my favorite I fast forwarded the",
      "start": 2812.12
    },
    {
      "text": "like oh **** like is he good I like the one of the Chipmunk stop what oh my God all right so these this is uh fireworks in Glasgow okay oh man these videos these are my favorite I fast forwarded the good stuff thank you oh that's awesome  that is amazing how did they do that that's awesome that is really well done Engineers this is the video that these guys trailers number one I don't know if it's good or not it's 14 seconds so we'll give it a shot who the **** are you why I'm the whz want some candy all right right thank trailer   this weekend all right let's watch trailer two when it comes out or not oh man this Tourette's Guy oh do you not want to see this no no no we're not doing Tourette's if it has real Tourette's we're not it I mean it just has all right that's thing is it used to be really funny when I was like a little kid they didn't realize like this was an actual disease people have yeah that's bad that's bad we got no V on this **** youum enough to buy a new",
      "start": 2884.92
    },
    {
      "text": "it used to be really funny when I was like a little kid they didn't realize like this was an actual disease people have yeah that's bad that's bad we got no V on this **** youum enough to buy a new car this weekend you're a big enough SM to come to Big Bill hell's car bad deal cars at breakdown if you think you're going to find a bargain at Big Bill you can kiss my ass it's our belief that you're such a stupid **** you'll fall for this bullsh I'm done with this next all right get    okay all right the trick is looking at his dark eyes the best part about it is it jumps back this was good that was good thank you for that thank you for that that's all we got That's All She Wrote hold on I got to look for some more fun Clips on yeah go back go on that thatwe lot lemons I'm not going to lie to you oh God said a lot of lemons that I had to take out yeah them slip by sorry about that guys but the bar set low you know someone sent us another one of these clips of",
      "start": 2955.16
    },
    {
      "text": "I'm not going to lie to you oh God said a lot of lemons that I had to take out yeah them slip by sorry about that guys but the bar set low you know someone sent us another one of these clips of uh Japanese people freaking out with teddy bears okay good thank you that's what I wanted more of putting it in the dock I'm going to put in the dock yeah hold on oh this isn't Japanese this is good old American this is someone freaking out here I think he is Japanese but I'm pretty sure he's in America why does it even that matter because the guy this was it my for from my Japanese school girl State Side I don't know what that means doesn't matter a grown man freaks out touching teddy bear he's saying here's an American version got it did you send it to Kev yet I did I sent it to Kev that oh should I do the audio no you need the audio but like skip forward a bit there we go oh my God shut up shut up shut up shut up shut up shut up shut say anything what what what do you think there's going to",
      "start": 3037.44
    },
    {
      "text": "I do the audio no you need the audio but like skip forward a bit there we go oh my God shut up shut up shut up shut up shut up shut up shut say anything what what what do you think there's going to be in there they going crocodile there is going to bite your **** hand off like snakes I've seen ones that have like rats but that they're not going to hurt you what is it's not like like this let's **** with him let's put a scorpion in there now feel like that oh my God Tim this is like you're going to watch hours of this aren't you this is a Tim Getty Style video if I've ever SE the thing is I want to do it with you you want to do it with me yeah no I don't trust Kevin I'll never do this I'll will never be blindfold will never I will never put anything dangerous that will hurt you I don't believe why is it moving oh my God oh my God what is that how many rats do you think this guy had to grab before like they put the fear it feels slimy oh my God tell me it's not a snake oh my God",
      "start": 3094.96
    },
    {
      "text": "believe why is it moving oh my God oh my God what is that how many rats do you think this guy had to grab before like they put the fear it feels slimy oh my God tell me it's not a snake oh my God it's a snake why is it moving all right we're done with this we always got to jump to the end where they're like touching what am I going to do that for why am I going to do that for oh a **** he gives up before he actually grabbed it holy **** we're watching this more fun clips and Route doctor I like it oh yeah I love this video that's amazing all right hold on I got hold on I gotta wait till it starts again this from round of toast says white man can't what I I want to believe cool gy could do this be called upon K could this you see this do this a **** only half of showing but it's a good half whoa no okay that guy's got some **** hops man that by the way will really hurt your knees so be careful people I mean if he if he **** that up he could have like hit his shins on that sh",
      "start": 3151.88
    },
    {
      "text": "half whoa no okay that guy's got some **** hops man that by the way will really hurt your knees so be careful people I mean if he if he **** that up he could have like hit his shins on that sh oh he could have really hurt himself this is why I don't do anything like that look at that yeah Nick that's what oh man yeah this is happening oh this is my new favorite thing this comes from Twitter as well some gold here oh we've done this one before have we yeah oh man I've never seen it this is arguably the best thing ever let's just watch it again this is from Anthony Doio who has the most Italian **** last name ever heard in my entire life mascot versus little kid oh my God I love it oh my God this is not fair because I'm pretty sure in the m in the mascot costumes are adult human beings I I mean it it I think it's from some show oh I see cuz they would not be playing that aggressively were real John Cena that's amazing I love it here and wait while that one's not good we're trying",
      "start": 3214.2
    },
    {
      "text": "I I mean it it I think it's from some show oh I see cuz they would not be playing that aggressively were real John Cena that's amazing I love it here and wait while that one's not good we're trying to find fun on trying find fun ones guys but one of you can do that the other one can interact with Chad that's true why don't you answer some questions in the chat I'm sorry I meant Chad oh Chad no we're in the chat I want to I want to talk to people in the chat someone says mix guy 1 1 says have you seen the one where it's the guy in the radio Studio filling up his mom oh my God no yeah that'll put the fear of God in you yeah that is oh no we call no tips right we're done with tips we're unless there are tips we'll read them we'll check no no I don't see any we're done with no more tips tips steep cool says how far do you guys think you'd get if you made the jump on the pool oh **** two feet from wherever the hell I jumped from not far uh we do have one more tip from FaZe Siro Tom say",
      "start": 3270.8
    },
    {
      "text": "cool says how far do you guys think you'd get if you made the jump on the pool oh **** two feet from wherever the hell I jumped from not far uh we do have one more tip from FaZe Siro Tom say some fun clips for you he gave us a couple thank you oh I already opened those up thank you for the fun Clips thank you for those clips let's see no more one of them was a winner Sympatico 115 says does cool Greg got Hops uh I imagine he would does cool Greg do things like that like you guys aren't a very athletic family but he looks like he play bball brother my brother my brother's played some bball in his does he play bball yeah cool okay cool look at you and Greg are twinsies today oh my God we are Greg Greg is live on a Achievement Hunters podcast off topic if you're RT first M yeah oh man I'm not a subscriber I can't tell I need to get a damn trial of this $ a month I'll do it should we call Greg right now and ask him how off Topic's going no that's too off topic for them not fun today",
      "start": 3337.2
    },
    {
      "text": "not a subscriber I can't tell I need to get a damn trial of this $ a month I'll do it should we call Greg right now and ask him how off Topic's going no that's too off topic for them not fun today go for it call call him Nick whatever I don't even remember anyone's name anymore go get Colin where's he at LA I think is he I don't know proba way he's been fing down there a lot lately no I think although he couldn't come to the barbecue but Wednesday wait What DJ Muscle Milk says I gave you guys a tip and you guys didn't get it that shit's broken and Tim called it and that's why I called him a tool bag I love you Tim huh okay we'll look can you look for that from DJ Muscle Milk yeah I don't see it we don't see it sorry Nick and you're on the off topic podcast I don't any right Greg it's Nick you're on the Kinda Funny Morning Show how are you doing what the **** is still the morning show in San Francisco that's right how's the how's the weather in Austin these days Tim was wondering",
      "start": 3386.72
    },
    {
      "text": "you're on the Kinda Funny Morning Show how are you doing what the **** is still the morning show in San Francisco that's right how's the how's the weather in Austin these days Tim was wondering warm hi Nick it's Jack from from Hunter hey Jack how's it going good to see you going well are we are we cross pollinating podcast we're we're cross streaming right now we're crossing the streams which I think is a good thing to do I can't remember if that movie was told what the movie told gonna end soon then you go to twitch.tv so it's kind of funny we're also going to end soon no you go.com kf3 you'll be there you're gonna come you're come watch Wonder with me hang on we.com okay thanks guys bye bye love you bye our lives are so **** weird that we can call someone in Austin Texas who's also doing a live show ah technology oh oh man oh wow wow my Pence really does look like Swamp Thing holy **** I'm retweeting that all right we're doing them three three or three uh see three and three",
      "start": 3442.72
    },
    {
      "text": "doing a live show ah technology oh oh man oh wow wow my Pence really does look like Swamp Thing holy **** I'm retweeting that all right we're doing them three three or three uh see three and three we're going to take I do need someone to do me a favor and at some point I don't know when off Topic goes live I imagine it'll go live in the next two days sure I want you to do a super cut of both sides of that conversation that's fantastic yeah we should that be fun we should definitely do that um mixed guy 1 1 says yo Tim can you pimp out Lucy Camp her new track the heart Never Dies is so good yes yes we can yes we can um let's see how we can do that Kev y can you there's a link to the SoundCloud I think yeah if you look on tones there's a link to the SoundCloud her Twitter yeah her Twitter that's who we need to send some sweet nasty love to oh yeah Lucy can you put a a link to her Twitter in the chat give me a second I'm try to find it this this imager says deer gets small taste of",
      "start": 3496.36
    },
    {
      "text": "that's who we need to send some sweet nasty love to oh yeah Lucy can you put a a link to her Twitter in the chat give me a second I'm try to find it this this imager says deer gets small taste of Freedom oh no oh no oh oh what's happening oh he got caught in the gate yeah that's not good I don't like it he's gone oh what he's got a little scat time oh and then he got stuck you **** idiot you **** idiot actually that is **** idiot deer let's get that in there deers are stupid they're like giant rats but first off Lucy Camp she's an upand cominging artist from San Jose California she's fantastic uh she's one of ton def's new new uh artist on the quintic label anyways her new song just came out yesterday and it's great and we all helped make the music video which is coming out soon I edited it Nick was assistant director yeah just I just helped prod um it was shot by Sean Finigan and uh everyone helped out Kevin was there that's when he ran to the wall Michael Ransky was there was",
      "start": 3553.8
    },
    {
      "text": "it Nick was assistant director yeah just I just helped prod um it was shot by Sean Finigan and uh everyone helped out Kevin was there that's when he ran to the wall Michael Ransky was there was there that's when remember when Kevin was decided to throw uh something into a mirror and we weren't filming you can pause the song Kev sorry there you go I actually should really like the song It's a dope song uh but anyways you you guys should check it out and please send Lucy Camp some sweet nasty love her Twitter is Lucy Camp XO XO yeah XO Lucy Camp XO XOXO no just one just one XEL Kevin bring up that bring up that picture I just I just put in there give me two seconds **** stupid deer did he like stretch the bars oh yeah I saw thisum stupid what did he do like how are those bars I guess someone must have pried them open and he had to try to get through no he just did this and then kept trying he's like wait wait which way am I I gotta go back in I forgot my phone all right we're doing",
      "start": 3604.88
    },
    {
      "text": "must have pried them open and he had to try to get through no he just did this and then kept trying he's like wait wait which way am I I gotta go back in I forgot my phone all right we're doing the old three and three here um how says when someone says XOXO I still think about Gossip Girl me too too fair enough I like that we just cross the streams we should cross the streams more we should cross streams more often that was fun need an excuse I'm going to put epic trampoline fail in there while Tim's looking for another one we'll see if this is good or not that oh man there was some some good ones here Big Richie 7 says what happened to the Beat Cop Let's Play where Nick and Greg dressed up we're still working on it it's coming uh it's going to it's coming out I don't I don't remember when but Greg's working on it yeah we filmed a bunch that day I don't know I don't know how we him out wait play that again no no why did his his pant came off okay do it wait Did you play it for them no why",
      "start": 3663.24
    },
    {
      "text": "Greg's working on it yeah we filmed a bunch that day I don't know I don't know how we him out wait play that again no no why did his his pant came off okay do it wait Did you play it for them no why it's you got nudity it's got got it's on YouTube that's true it is on YouTube but I feel like oh they tried to censor it but you can still see put in the chat put it in the chat so people can see yeah but don't put it on Twitch that's got a Chan I can see his nutsack right yeah there's definitely if you try there's some dick that's some big bits and pieces right there um Fernando PR says Tim the early Games Cast is about E3 predictions but will you be making a sequel to that closer to E3 maybe we get a cool Nintendo Direct in April or May that may change predictions absolutely the week 43 we we're going to bet on things it's going to be fun uh Greg and I will be involved at the very least okay we might get these guys involved too Andy might be involved and",
      "start": 3712.04
    },
    {
      "text": "absolutely the week 43 we we're going to bet on things it's going to be fun uh Greg and I will be involved at the very least okay we might get these guys involved too Andy might be involved and whoever else we have on at the time but I'm down for you need me for uh John Vream says was watching Off Topic totally forgot the Morning Show was on that must have been funny all right let's look got nothing else Nar Hill 60 says sarcastically it's funny when you guys laugh at **** that we can't see well here's the thing we we understand that but there's the vetting process where we don't want to get banned and kicked off **** so when it's like **** we can't do then we just put in the chat like we so hopefully that's that's also let's be more careful of what we put that seems like it's already vetted Nick well I don't betet things I just give them to you just saw the video I thought it was funny you notice the man's balls I didn't see the guy's balls I just saw his butt I was like the",
      "start": 3774.48
    },
    {
      "text": "vetted Nick well I don't betet things I just give them to you just saw the video I thought it was funny you notice the man's balls I didn't see the guy's balls I just saw his butt I was like the butt's fine but I didn't see that there was a freeze frame of his nuts as n sack his n from Aliens rbj 79 says Tim have you listen to Logic's first song off his new album yet yes I have everybody should pre-order Everybody album's named Everybody song's also Everybody anyway super tight song like it a lot um there's been a lot of good music dropping man it's it's a little unfair Camp **** came out yesterday this a new **** linguist EP or something being announced today or coming out today who the **** knows uh Logic has his song and pre-order for his album and uh Kendrick Lamar has been **** killing it the past week good time to be a hip-hop fan there you go um I just got into Kid Ink there you go Kid Ink I hate you so goddamn much um we're in sub only chat I yesterday and I was",
      "start": 3832.4
    },
    {
      "text": "**** killing it the past week good time to be a hip-hop fan there you go um I just got into Kid Ink there you go Kid Ink I hate you so goddamn much um we're in sub only chat I yesterday and I was listening to NS but it was only the first um five songs that Spotify recommends for you and cuz I was like I don't know the albums like I'm just going to look look listen to the top hits but my Spotify in that gym over there on on the 4-hour it's like a cave so it just it just loaded up all the rest but it wouldn't load any other songs so I had to listen to the same like five NOS songs for like an hour that's hilarious it was funny the so we're in sub only chat now the LG 59 says what's happening to the Animated Series now that Colin's gone it's trudging along nothing really changes from it with the the plan that we had to finish out the season and bonus episode all of them um most of them almost all of the rest of them are written uh and Colin has agreed to just come up and do the V for",
      "start": 3875.88
    },
    {
      "text": "the the plan that we had to finish out the season and bonus episode all of them um most of them almost all of the rest of them are written uh and Colin has agreed to just come up and do the V for whenever he can so um it's all going to be the same Deadwood 1887 says hey Nick and Tim are you going to watch the new season of Attack on Titan hell yes we're trying to figure out if we're going to do a watch alongs or not depend on schedules and stuff so stay tuned Shyra says can you give away E3 tickets Please I want to go what that's my Attack on Titans oh okay yeah it's good thank you uh we don't we don't have I don't think we have access to that yeah they don't really like us could whatever cool idea though it is a great idea Mattman 94 says someone needs to explain to Tim that it's on YouTube isn't a valid excuse to show nudity on Twitch I understand that but we play things how we have them with The annotation that was clearly covering the guy's dick but it was a see-through annotation",
      "start": 3921.56
    },
    {
      "text": "isn't a valid excuse to show nudity on Twitch I understand that but we play things how we have them with The annotation that was clearly covering the guy's dick but it was a see-through annotation yes it was you it dick it was a censored dick and the thing is this everyone has one let's just stop talking about it how's that everyone has a dick in balls everyone has one so why you know SC boy 74 Jesus Christ where we wasn't scad boy that's not his name it's St Killa boy okay 74 SCA boy scad boy says Hey says Hey anyone under the age of 4 team in the Bay Area that wants to hang out tonight a Kinda Funny Easy Allies crossover question mark I'd love to and we'll figure it out I'm sure at some point I want to talk those guys are we in sub Bing mode yet I'm going to put us in sub Bing mode King FR no we're we're done yeah we're done King franchise 88 says hey Tim I saw Greg mention a new shirt on on Off Topic can you tell me more I don't know what the **** he's talking about Greg doesn't",
      "start": 3971.68
    },
    {
      "text": "FR no we're we're done yeah we're done King franchise 88 says hey Tim I saw Greg mention a new shirt on on Off Topic can you tell me more I don't know what the **** he's talking about Greg doesn't know about our merchandise talking about don't know **** all right I mean I guess we're done let's just read the subs all right if I read your name hold on no I'm not watching this someone just sent me Michael John Wick is Michael Jackson it's too long too long am I not hearing this no that was pretty amazing um everyone in the chat can watch it if I read your name your sub or resub and we we greatly appreciate that thank you so much again not to drive this home but we have to because Amazon does not like people uh notes not like to make things easy if you are an Amazon Prime member you get one free Twitch Prime sub we'd like that to be us but you have to resub every month which we know is annoying uh if you don't want to do that no big deal you can watch all content here for free um but",
      "start": 4027.08
    },
    {
      "text": "free Twitch Prime sub we'd like that to be us but you have to resub every month which we know is annoying uh if you don't want to do that no big deal you can watch all content here for free um but we appreciate our subs just like we appreciate Bamus Prime 86 subscribed again to say thank you well we thank you too uh Glotin what up with it I subscribed for seven months uh Nitron says Tim can you stroke Nick's beard thanks go ahead while I still read Eddie the king 90 says love this you have to struck my beard oh does have to he you don't have to I do but but see when Nimron used this he used an exclamation mark at the end of it not a question mark so that means it's an affirmative statement Tim can you stroke Nick's beard thanks done that's how it works uh Ad of the king 90 says love the stream King Maxi one says hi going to be a beautiful weekend in the Bay Area hyp Brian Sansy Neo J says keep up the insanity that is Kinda Funny Games we will Spooner 150 Aon ptis says in three",
      "start": 4078.2
    },
    {
      "text": "stream King Maxi one says hi going to be a beautiful weekend in the Bay Area hyp Brian Sansy Neo J says keep up the insanity that is Kinda Funny Games we will Spooner 150 Aon ptis says in three months it'll be two years it'll also be RTX coincidence we think not oh wow are you showing this can you please pull it up you got to show this dog well I would that's why I'm talking to you this is amazing someone took hot dogs and made them Disney Princesses Dragon 46 says 6 months in no regrets this is awesome these These are hilarious they nailed it they really did nail it is that cheese is all edible what's what's wait what's go back up to uhas so we have that there is an onion a red onion on her neck cheese a little bit of mustard and what I believe is ketchup on the top maybe barbecue sauce there's no way to confirm that' be bold for a hot dog but I could support barbec sa here I actually think it might be barbecue sauce because we can see the face has been drawn in with what clearly",
      "start": 4128.0
    },
    {
      "text": "there's no way to confirm that' be bold for a hot dog but I could support barbec sa here I actually think it might be barbecue sauce because we can see the face has been drawn in with what clearly looks like ketchup yeah no I see what you're saying here and then mustard on cheese yeah yeah uh not I think that that's the **** that comes off Corn's husk that that looks like a Corn's husk could be a sprout also but I think now that I'm looking at a little closer yeah you're right it's the corn husk so this one is less edible because it's also the peel of the onion you can still eat it but it's going to go through you and take everything with it sure sure M and then I believe this is the last one that's very edible yeah that's very edible yeah great excellent really nail the facial features on this really nailed it uh back to Subs the Caleb was subscribe for 8 months Murphy B Jangles just subscribed FZero uh J Lazro 1993 ack 86 is two months away from Kinda Funny Live 3 You Beautiful",
      "start": 4182.56
    },
    {
      "text": "on this really nailed it uh back to Subs the Caleb was subscribe for 8 months Murphy B Jangles just subscribed FZero uh J Lazro 1993 ack 86 is two months away from Kinda Funny Live 3 You Beautiful bastards that just gave me anxiety because we have a lot of planning to do still uh Brandon 8 bit says just ate the entire mini bar at my hotel now I'm drunk watching Kinda Funny at 510 a.m. I love you guys in this sweet nasty way coming to you from Ozum Australia see you at C Life 3 you handsome **** we'll see you there my friend Eggman 90 says Super 7 can you boys say some British stuff for me it sounds funny cheeky Nando scr okay he wants to say these uh I'll say this one you say that one and then we'll just go from there say like try your hardest with the accent JK nand I think he wants he wants to say it an American accent so that we sound like **** idiots because he's like you British accent so much better than American accent chy Nando scan hob knockers Jeremy Corbin Liverpool",
      "start": 4219.12
    },
    {
      "text": "he wants to say it an American accent so that we sound like **** idiots because he's like you British accent so much better than American accent chy Nando scan hob knockers Jeremy Corbin Liverpool Football Club yeah so there you go that's how those are supposed to be you're welcome if you now see the problem is we just ruined it for you my friend cuz now you're going to hear all your stupid friends saying those the wrong way and you're going to think **** Tim and Nick were right it's going to ruin England for you forever you're going to come to America you're going have to come to the good oldfashioned United States America uh where we have the Donald as our **** president so good for us uh Neo J says a I missed hearing my name well Neo J we're here for you there you go Neo J SF Giants fan 08 just subscribed Stephen cool too palton 81 says hey can you give me your best Gus impression from Psych Kev give me the one damn that's messed up not even close that was **** spoton",
      "start": 4270.24
    },
    {
      "text": "Giants fan 08 just subscribed Stephen cool too palton 81 says hey can you give me your best Gus impression from Psych Kev give me the one damn that's messed up not even close that was **** spoton not even close ask the chat give it to me again you heard about Pluto that's messed up it got better I didn't think it could I built the Eiffel Tower then I painted it blue Come On Son I PT yeah spicy TI uh Sandom Alec cool to13 Obi bong Obi boing uh BG 580 says 8 months next month the baby comes name him Nick uh I monly Rick Ricky says I'm only Ricky thank you I'm only Ricky says thinking about going to Kinda Funny Live 3 and probably go alone but it took but I look forward to meeting the best friends and having an awesome time do it going to be worth it it's going to a lot the whole point of this is that it's it's it's for everyone to come and actually see each other in person so you're going a",
      "start": 4308.4
    },
    {
      "text": "is that it's it's it's for everyone to come and actually see each other in person so you're going a ton of people we get this question all the time I don't know anyone should I come you're going to know a **** ton of people after the weekend yeah you're going to have a whole bunch of new best friends people you talk to forever you're going to watch Zer try to **** open up a painting it's going to be great it's going to be great you can get your ticket at kindof funny.com KFL 3 Kev yo I put one more thing I want to show there to close out the show after he's done uh Cas casual gaming uh G3 Tam Frosty uh oh get them Frosty per per Vince is subscribed uh Matt Schwab D what is this let we see it I want to watch it **** dude raccoons are so smart they're dangerous yeah what he do this is like Zelda this is like a level in Zelda oh you dumb **** like he puts his hand out like poor little guy I watch I want to watch it one more time look at his hand look at his little hand he had oh",
      "start": 4371.44
    },
    {
      "text": "like Zelda this is like a level in Zelda oh you dumb **** like he puts his hand out like poor little guy I watch I want to watch it one more time look at his hand look at his little hand he had oh no he had it he had it well he's dead now just like people uh D says subscribe for 3 months says thanks for all the laughs and please send some love to a fellow sub Belmont 83 whose dog passed away last week oh Belmont 83 we're thinking about you sorry dogs remember the family they're humans too unlike cats who are the devil spawn and should all be burned in fiery hell it's true it's true uh J Mill 113 oh sorry 11138 says you survived the crazy month of March guys and we are all still here with you you are all awesome and a shout out again from Upen to Gia Upen thank you for that I don't know if they say that I think they do I don't think Gia does I have heard Gia be like I'm like hey G what's going on she goes you Sigma blade ACC say you guys love you guys he'll call One Last Time H call",
      "start": 4414.44
    },
    {
      "text": "if they say that I think they do I don't think Gia does I have heard Gia be like I'm like hey G what's going on she goes you Sigma blade ACC say you guys love you guys he'll call One Last Time H call uh King Diaz 89 what you do it like this right that's how col wants it no they want like this oh only we can censor these things yeah well we're live so so it's fun King Diaz 89 is subscribed XX Stargazer 3 rxx is subscribed for 6 months uh edu 010000 says it's about family and hitting that sub button appreciate that everyone Deadwood 1887 word word says love you guys xtall 84 says sucking that dick sucking that dick molt Jason says all about this dog and pony show appreciate that okay uh new guys 87 new guys 87 sorry news guy 87 says yay yay yay uh Dre Day 36 says yo yo back Rob 5987 says where's Chad **** he's right there but he's too far I can't get him command comrade says happy eight months also a full baby love Colin's last Gog can't wait to see what Colin and Kinda Funny does",
      "start": 4469.76
    },
    {
      "text": "Chad **** he's right there but he's too far I can't get him command comrade says happy eight months also a full baby love Colin's last Gog can't wait to see what Colin and Kinda Funny does us as well uh Sneil 03 says keep **** that chick gentleman chicken gentlemen we do we will uh Frank the Tank 83 says 7 months is still going strong love you guys we appreciate that my friend uh AKA D3 Mi i i k says ha Colin I'm sure it's something but I don't want to look I can't I can't something milk oh AK AKA Dem Mick it doesn't matter and our final subscriber for today is deep uncore 3zz who subscribed for 7even months says which Patreon is the call an episode on that is our our Patreon Prime it's Kinda Funny patreon.com Kinda Funny cuz it's GameOverGreggy Show yeah it's GameOverGreggy Show mhm thank you all of course for subscribing we love you very much even if you don't subscribe thank you so much for",
      "start": 4529.68
    },
    {
      "text": "show mhm thank you all of course for subscribing we love you very much even if you don't subscribe thank you so much for being here with us or if you're watching on YouTube thank you so much for watching on YouTube make sure you hit that subscribe button on YouTube why not Tim it's been a wonderful day it has let's go get some **** frost frosties Kevin cut the feed",
      "start": 4581.12
    }
  ]
}
