{
    "id": 2461,
    "video_id": "kur4E2q2XeI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What Scarred You As A Child? - The GameOverGreggy Show Ep. 170 (Pt. 2)",
    "description": "What scarred us as children?\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1488873604,
    "duration": 1319,
    "transcript_chunks": [
        {
            "text": "Joey, yes, what's your topic? So I want to talk about what scarred you as a child. Oh man, okay. So this all started, I know, right? Who has the laundry list? I know one of you do. All this um this all started as a conversation um on Facebook of what I think it was what horror movie scared you as a child. So I immediately responded with The Blair Witch Project because so here's the deal. Say how old are we? I'm 38. Calm down. Um so my family really likes horror movies and so I grew up watching stuff way earlier than I probably should have. Sorry. Um and so my mom took me to go see Blair Witch in theaters. I was probably like 9 or 10. Wow, in theaters. Okay, yeah. So at this point my dad was on a business trip so it was just my mom and I. Oh jeez. And so we went and saw it. Terrifying. It was super scary when it came out and as a kid not not okay real quick to dial this back especi for you as a kid but then even I was in high school and I remember we my friends had caught the Sci-Fi special about the Blair",
            "start": 2.85
        },
        {
            "text": "came out and as a kid not not okay real quick to dial this back especi for you as a kid but then even I was in high school and I remember we my friends had caught the Sci-Fi special about the Blair Witch that totally frame this thing as this is real footage we found. Yeah, this was before found footage was a genre. They totally I don't I think they started it not even jump started okay just making sure and it was that thing where there was a legit argument of like is this real like nobody knew what the **** was happening for a while and then Heather or whoever from it showed up in a Steak and Shake Comer like oh no this is **** fake **** but like at the time I remember being in high school going to see it and it was like what the **** did we you know what I mean like and it was only showing in like the small Indie movie theaters which we didn't know about cuz the internet wasn't a real thing at some I actually had a screener of that movie like someone brought a VHS tape over and",
            "start": 64.68
        },
        {
            "text": "showing in like the small Indie movie theaters which we didn't know about cuz the internet wasn't a real thing at some I actually had a screener of that movie like someone brought a VHS tape over and we watched it at my house when my parents were out of town. We were throwing a party and someone's like I got this awesome like thing is totally real and I was like but I was I was not a child at this point I think I was 15 so I'm like it's not that scary I'm going to go drink more um pretty that when uh no as far when I think of horror movies that scarred me I think of like the classics like she's not down their story I have a story I apologize we were jumping off in the fact to set it up for young people like Tim that this was a thing where we didn't know it was real or fake at the time yes it was so we saw it we went home at the I was like oh yeah Dad's not home we can have a slumber party so I'm sleeping in my parents room all of a sudden a car alarm goes off and it's going off forever",
            "start": 101.88
        },
        {
            "text": "was so we saw it we went home at the I was like oh yeah Dad's not home we can have a slumber party so I'm sleeping in my parents room all of a sudden a car alarm goes off and it's going off forever and we're like that's so weird and like weren really T of things either the witch drove here so it's going off forever and my mom's like super pissed so she goes out uh to the front windows and looks and it's coming from AR car and arar doesn't have an alarm so she's like uh-oh this is not good so I'm like in bed with the dogs like I'm not going out there um so she went out and she unlocks the car and the car horn is like stuck and it's just blaring and she's like I what the hell is this so she like pounds on it and tries to get it to be unstuck and like eventually like it unsticks and it's all silent and then she looks up and in our neighbor's house she can just see like the lit end of a cigarette um and there was just some guy like they had rented a bunch of rooms out to random people um",
            "start": 133.72
        },
        {
            "text": "silent and then she looks up and in our neighbor's house she can just see like the lit end of a cigarette um and there was just some guy like they had rented a bunch of rooms out to random people um so he was just there smoking a cigarette didn't say anything didn't offer to help how close was how close next door oh so and like your houses are close Clos okay it's like in San Francisco so it's **** okay **** and just like my mom like just sneaks back inside like what the **** is going on and of course it's like when my dad's out of town nothing we're all just there and it only H it didn't ever happen again or maybe it happened one other time but what are the odds that that happens the night scary movie and terrifying so I've never really recovered from that wow yeah that'll do it that'll do it for sure yeah now you were SC scar SC scarred oh yeah I mean what movie a lot of movies scarred me when I was younger but the the classics like the Friday Friday the 13th um I'm sorry",
            "start": 183.16
        },
        {
            "text": "that'll do it for sure yeah now you were SC scar SC scarred oh yeah I mean what movie a lot of movies scarred me when I was younger but the the classics like the Friday Friday the 13th um I'm sorry Nightmare in Elm Street uh was the one that that scarred the **** out of me so that that series all the way up to three and then I was like I think I'm done with this I don't need to watch these anymore cuz they were really scary when you were a kid and I think I was like I must have been like four or five when I saw those so yay mom thanks for letting me see that stream is kind of on another level though it's freaky when it comes to those things cuz like made you scared to go to sleep yeah exactly and like there it was some real **** up the guy was a rapist yeah like that it was a way darker more **** up thing than than yeah child rapist than even the uh like Friday 13th or whatever it's like that's a bit more of a Monster yeah like Halloween you know that type of stuff I just",
            "start": 220.28
        },
        {
            "text": "darker more **** up thing than than yeah child rapist than even the uh like Friday 13th or whatever it's like that's a bit more of a Monster yeah like Halloween you know that type of stuff I just recently went back and watched Friday the 13th because I had never seen it before the original one with Mrs. Vorhees with uh yeah Mrs. Vorhees and um I forget who there's a couple oh uh uh Kevin Bacon's in it too which is weird I was like I didn't know Kevin Bacon was in Friday the 13th um wow it's there's two parts that are actually kind of scary the rest of it so bad it's so terrible that I can't believe anyone was ever like this is a good film but what are you going to do um I was more scarred actually emotionally by like nonh horror films I was more scarred by things like I saw RoboCop in the theaters and I was like I it was what it was the first time in my entire life I'm like I legitimately should not be watching this movie The Very like the first you guys remember the first scene where",
            "start": 258.24
        },
        {
            "text": "theaters and I was like I it was what it was the first time in my entire life I'm like I legitimately should not be watching this movie The Very like the first you guys remember the first scene where it gets Blown Away piece by P and he's like and the guy's like like making fun of him they laugh and I'm like that's so **** up and I like looked I was like I'm like why why am I in this why am I watching this and then the part at the end like **** stabs him in the neck and then blood gushes onto his face and I'm like all right this is going to be one that I talked to a therapist one day about it's terrible but yeah I'm with you the horror movies were never the thing for me it was always the other **** like there's this movie called The Witches and there's a scene in wit the kid gets turned into like a little where the kids are getting turned into mice Houston they like they drink this like this potion thing and they **** violently transform into mice and it is just it's the most",
            "start": 297.52
        },
        {
            "text": "into like a little where the kids are getting turned into mice Houston they like they drink this like this potion thing and they **** violently transform into mice and it is just it's the most **** up thing Kevin if you could try to it's on Netflix it's on Netflix it's I mean Amazon Prime could not I could not get over yeah this is the scene which is scary scene is what it's listed as on YouTube this does look familiar yeah scroll forward it's when they go into the the auditorium and they're giv the panel this one of and they take the **** kid up and use him as an example I do remember this Angelica Houston is that hurting all right go for it here we go you're listening at home Angelica Houston kind of looks like Mrs. Adams She is you can't hear no she looks like I said I'm trying to describe it for people watching at home when the sound when they start happening you need to hear the sound there's a fat kid who looks like me without GL okay this is scary well now he's not even there",
            "start": 337.68
        },
        {
            "text": "it for people watching at home when the sound when they start happening you need to hear the sound there's a fat kid who looks like me without GL okay this is scary well now he's not even there he is now he's reacting all the witches are laughing I is this a witch convention yeah yeah great they can hear it I'm sure that's really conveying the story to them oh I'm sure it is this kid spitting out smoke right now Green Smoke uh yeah sh yeah that's I'm I'm all just laughing I totally forgot about this movie yeah cuz they're all witches right oh wow well **** yeah this movie terrified me it was like this and like um Time Bandits movies like that we were like this is just really twisted **** well the thing is the 80s everything was practical so it's all **** weird ass puppets and **** so it made everything way real like polter guys go to horror movies there was so much **** in that movie that like was all practical effects like there's that guy's face that like explodes in itter",
            "start": 383.36
        },
        {
            "text": "so it made everything way real like polter guys go to horror movies there was so much **** in that movie that like was all practical effects like there's that guy's face that like explodes in itter guys I don't remember that I remember the kid with his BRAC is coming to life and like mother getting put on ceil stop motion is also yeah that's really creepy inherently creepy so oh man but yeah The Witches was the thing that I was like **** my life there's a lot of other things that like traumatized me and like scarred me like Mufasa's death like are you **** kidding me it's not his death it's Simba being down there being like Dad no **** you stop I'm teing up right now I can't hand this **** guys in World of Color at Disneyland every time they **** do it the Music Stops and they dad like **** you guys you know how to right in the fields you get me I know man I know hey Tim what about it oh it it was it was scary I did not like it I feel like we watched that too young that",
            "start": 433.84
        },
        {
            "text": "dad like **** you guys you know how to right in the fields you get me I know man I know hey Tim what about it oh it it was it was scary I did not like it I feel like we watched that too young that and Silence in the Lambs Sil the ls still terrifying that's definitely one that got me and I was older when I saw that movie as well that's one of those you're like okay that's freaky there's also uh in Pee-wee's Big Adventure Large March large March terrifying what the hell you know you're just **** movie that yeah that was really I was like that did not need to be in this movie at all that was terrible oh my God for me it jumps to mind into the movie horror movie vein of The Gate you remember this it's like the parents go away and they leave the older sister creatur yeah little creatures but what I always suck like the house is like the gateway to Hell or whatever all this **** happens but the creatures are creepy enough but then what H though there's this the kid grabs something and",
            "start": 477.6
        },
        {
            "text": "what I always suck like the house is like the gateway to Hell or whatever all this **** happens but the creatures are creepy enough but then what H though there's this the kid grabs something and gets an eyeball in the middle of his hand and so like while this is happening he takes a piece of broken glass and slams it into the eye and blood gushes at like that was like h no thank you I can't **** deal with that uh every time I went to Aunt Bonnie and Uncle Jerome's they had the Thriller VHS that was Thriller Then followed by like a 20- minute behind the scenes with uh uh I was going to say Max Landis John Landis Max's dad him walking through with Michael and all stuff and the zombies you know just chilling out and dancing and talking to be normal people and it was one of those things of it was I would ride out watching Thriller and being terrified to then get to that to like have like the fear ratcheted down like they're normal people they're real like the kid you know them coming",
            "start": 524.84
        },
        {
            "text": "it was I would ride out watching Thriller and being terrified to then get to that to like have like the fear ratcheted down like they're normal people they're real like the kid you know them coming out of the Grave was all these like practical facts and stuff which was awesome but it never failed and then when I would watch Thriller and be **** freaked out oh because at the end when she's got nowhere left to run and they all come in around her hands out like the zombies that's when I'm like well that's that's what was crazy about it was like it was those things in when you were a kid that just kind of proved to you that it didn't always have to be a happy ending like with Thriller the reason why that was so freaky is remember the end of it is he turns back and looks at the camera and he's got like the cat eyes whatever they are like like oh he's going to kill her he's going to kill her just see you next Wednesday it's the same with like did you guys ever see Time Bandits I don't",
            "start": 561.12
        },
        {
            "text": "he's got like the cat eyes whatever they are like like oh he's going to kill her he's going to kill her just see you next Wednesday it's the same with like did you guys ever see Time Bandits I don't know I I'm probably I remember doe Time Bandit is a it's a Terry Gilliam movie I believe and it was like this really weird British film about a kid who like goes on this crazy adventure with these with these yeah it's very strange but at the end of it his like house blows up and his parents turn into like lobsters and that's just the end of it and the kids just like the kid just staring there like standing there was like where are your parents and he's like where are my par looks and they're like lobsters and it's like this kid's totally **** and I was I'm a kid watching this and I'm like oh my God like this poor kid like what's going to happen Mona was in it yeah it was weird it was one of those this was like during that time period where like they didn't mind making movies like this with",
            "start": 596.12
        },
        {
            "text": "God like this poor kid like what's going to happen Mona was in it yeah it was weird it was one of those this was like during that time period where like they didn't mind making movies like this with the dark **** yeah where you're like this is terrifying and this is not art this is just **** up Muppets like this Labyrinth Never Ending Story all of those Never Ending Story **** me up too that was y hor the quicks or mud or whatever it is yeah yeah that was one um I've said it before in the show so I'll keep it short but Harry and Henderson's like when I'm the first movie I ever cried out where I'm just sitting there watching it and when John uh Lithgow Lithgow slaps some he's like I don't love you go into the woods I burst into tears or whatever I like and then I mean then uh going to sleepovers at friends houses we'd always watch horror movies and I was always into it and fine but Amityville Horror like freaked me the **** out of like being afraid of a house and like ghosts on",
            "start": 638.04
        },
        {
            "text": "sleepovers at friends houses we'd always watch horror movies and I was always into it and fine but Amityville Horror like freaked me the **** out of like being afraid of a house and like ghosts on that level and I'll never forget like holding it together enough not enjoy being feeling sick watching the movie at Mike Mike Bo's house and then it's summertime and going home you know days whatever weeks later and riding my bike up to the garage and going to put in the code to get in and looking through the window and seeing two green eyes looking back like the but they were the garage door being reflected off of a thing back to the light but it looked just like when scariest scene in am a hor for me is when the girl's talking to the window and the mom and this is the originally before the mom comes up she's like who are you talking to I'm talking to Jody where's jod now she outside the window they look over and it's I think two red eyes like looking back or whatever and it's like that's",
            "start": 677.04
        },
        {
            "text": "comes up she's like who are you talking to I'm talking to Jody where's jod now she outside the window they look over and it's I think two red eyes like looking back or whatever and it's like that's **** hell freaking Beetlejuice just in general oh really **** I mean little kid so there was so much **** that happened to that I'm like no be is kind of a **** up movie it's a super **** up movie entirely first first I'm sorry the first movie I ever went to with my mom that I'm like cognizant of I vaguely remember going to a Bambi but I was such a Ghostbusters fan that any movie that had a ghost vibe to it all I was like I'm like this is I remember going there and I made my own Tobin spirit gu out of cardboard and I cut the Beetle Juice ad out of the paper and put it in there and stuff and I went there I was totally enjoying it but it was like i' had been so skewed by Ghostbusters that we had an answer to this sorry we had an answer to this let's just it'll be okay let's just",
            "start": 714.36
        },
        {
            "text": "stuff and I went there I was totally enjoying it but it was like i' had been so skewed by Ghostbusters that we had an answer to this sorry we had an answer to this let's just go back let's not that back for 15 seconds you made your own Tobin spirit guide and in that Tobin spirit guide you decided to put an ad for Beetle Juice well it's cuz from the newspaper they had the Beetlejuice thing so if I'm listing who all the ghosts are that I know Beetle Juice has been discovered he need to who else was in your your your spirit guide I it was Slimer of course come on I think it was you know I'm buying the real Ghostbusters figures I'm cutting them off the back of the box putting them in the and stuff like that so I had a pretty robust Spirit guy going you have this uh I don't know be great Boll for the that'd be awesome documentary well when you go to when you get over to big old Greg Miller's attic you're going to have all sorts of **** to go through and dig",
            "start": 755.24
        },
        {
            "text": "uh I don't know be great Boll for the that'd be awesome documentary well when you go to when you get over to big old Greg Miller's attic you're going to have all sorts of **** to go through and dig through and find it can't wait let's do that trip soon sure sure soon the smoke monster in Fern Gully **** that guy Fern Gully in general well Fern Gully is another one of those things where it's like it's all fun it's all cool except it's not at all and it's horrifying is that the one with like the mud Monsters the smoke monster maybe okay that's yeah it's like oh God that **** was no it's thinly veiled as some child like well it's just in a different you know setting Avatar way scarier it was **** way scarier kids movies man they didn't give a **** Return to Oz didn't give a **** the wheel dud that what's her name the girl from The Craft right when she was young oh I don't even know oh **** it is is that Angelica Houston too no no or she just the witches no she's just",
            "start": 790.52
        },
        {
            "text": "the wheel dud that what's her name the girl from The Craft right when she was young oh I don't even know oh **** it is is that Angelica Houston too no no or she just the witches no she's just witches and he was right she was Morticia Addams in the Addams family as well um I I didn't I I stumbled into that one I was just saying she looked like Morticia Addams you're like well the yeah I got to look this character up I'm sorry I gota look yeah Return to Oz was **** up I mean even as a premise it's just like all right so remember Dorothy from Wizard of Oz yeah she's **** up and when she came back it wasn't all good they were like you're **** up I don't know return o return o was a I I'm just going to say late 1980s movie I want to say 86 something that 1985 is when to come out so Dorothy went back or she' already come back no it's after Oz and uh so she's in a it opens with her getting electroshock therapy to like fix her from being from all her **** up visions of telling stories about",
            "start": 833.8
        },
        {
            "text": "back or she' already come back no it's after Oz and uh so she's in a it opens with her getting electroshock therapy to like fix her from being from all her **** up visions of telling stories about the Scarecrow and Tin Man and whatever and this is still a kids movie yeah and then a storm happens and it's not a tornado it's just a **** storm and she ends up in going back to Oz and like she the Scarecrow is like the king or some **** I don't even remember uh but like things are really really bad and it's super dark and there's a lot of weird clamation **** and there's these like guys that have wheels as their hands and feet horrifying and their heads like turn all the way around which is never good and then Osma is the queen of the whole of the queen of Oz and she her head comes off so she just has this hallway of a bunch of heads that she can take different faces and put on the whole thing's **** terrifying what a dope ass movie I didn't know this movie I I just remember the",
            "start": 879.8
        },
        {
            "text": "so she just has this hallway of a bunch of heads that she can take different faces and put on the whole thing's **** terrifying what a dope ass movie I didn't know this movie I I just remember the Whiz Oh The Whiz is **** **** dope yeah all right Michael Jackson yeah **** yeah I me watching that that didn't scar me at all that was awesome that was a good uh I got scarred of course by Pirates of the Caribbean we've talked about that before Oh The Ride got over that r no not the Johnny Deb movie well yeah I went I conquered it what last year after VidCon or something I don't even remember um there I once got scared on a big slide that was that one got me at a fair you know how they have the big slides those ones you okay you right all right yeah they have the big SL you ever been on those big slides where you have you like ride the sack down like go like this Bless you that's freaky that can be freaky cuz you might the whole thing is I went down on the potato sack thing and it was one of",
            "start": 921.68
        },
        {
            "text": "slides where you have you like ride the sack down like go like this Bless you that's freaky that can be freaky cuz you might the whole thing is I went down on the potato sack thing and it was one of those where I wasn't tall enough and my the guy was like a come on some Carney was just like yeah come on up my parents like yeah he can take this and I went down the big slide and I hit the ground and just burst into tears it was just terrifying for you start they started learning yeah they started learning that of course I was scarred by this is documented in the Patreon exclusive that I'm sure oh it's well whatever the Patreon exclusive episode with my mom where I was so afraid of throwing up that I would carry a bowl around with me in case I threw up and then if I they took the bowl away from me I would get so ratcheted up that I'd throw up so it's like a self-fulfilling throw up bll prophecy God your mom is a saint they put up a lot that is ridiculous my God my God it's the same thing",
            "start": 963.96
        },
        {
            "text": "me I would get so ratcheted up that I'd throw up so it's like a self-fulfilling throw up bll prophecy God your mom is a saint they put up a lot that is ridiculous my God my God it's the same thing of like when I go out to eat with my dad like I knew or go out to eat in general it'd be that thing of on the way back home for a ride that would probably never be more than 20 minutes or whatever I would get so worried that I'd have to poop that I'd have to poop and then they'd have to pull over and like I could poop somewhere and it was always that thing of like I was terrified of doing it cuz I didn't want to inconvenience anybody you know what I mean like like you know pooping my dad's a good dad but I mean he had a little bit shorter fuse I think than my mom did on some of this **** was like really ah Jesus **** Christ F damn man you got to go for the house that is so funny uh the thing that I'm referencing here is one of the list videos I made at IGN was the 13 most traumatizing",
            "start": 999.0
        },
        {
            "text": "like really ah Jesus **** Christ F damn man you got to go for the house that is so funny. Uh, the thing that I'm referencing here is one of the list videos I made at IGN was the 13 most traumatizing moments in kids movies. Yeah, so go watch that because I go in depth on on most of the things I'm talking about here, but I want to give two more shout outs. One to Who Framed Roger Rabbit, the end of it, did he talk like this? Yeah, yeah, and he get **** rolled over by the steamroller, like his **** eyes pop. How about the dip in general where they just throw these poor cartoon animals, they like burns them to death, like acid, like melts them. But the the last thing, Kevin, I need you to pull up a YouTube video here, dip search for Watership Down. Oh ****, this is the most **** up kids movie in existence. You think you've seen bad, if you haven't seen this, you ain't seen **** **** mice. It's no, well, it's a bunch of little animals like rabbits and like it's kind of like a an anal Animal Farm style",
            "start": 1038.0
        },
        {
            "text": "you think you've seen bad, if you haven't seen this, you ain't seen **** **** mice. It's no, well, it's a bunch of little animals like rabbits and like it's kind of like a an anal Animal Farm style story where it's like a more adult thing. Yes, uh, very famous. Yeah, exactly, but it's it's one of those things where it's like they use animals to tell the kids the the story, but uh, try to find like the fight scene sh violence, yeah, that'll be good. I remember this Watership Down, this **** is so **** up. We looking at a black screen. This is Watership Down, if you're listening to the MP3, we thank you. It says one of the bloodiest skip forward, Kev. Oh, now we're ski for I don't know it's going to say most graphic films here we go. Rabbits are fighting, rabbits are **** up and fighting. Holy ****, it looks like bicca rabbits are bleeding. There's a dog here, rabbits are getting **** up. These rabbits are getting oh my God, there's a cat attacking a rabbit. There's some **** deer over here he",
            "start": 1078.88
        },
        {
            "text": "it looks like bicca rabbits are bleeding. There's a dog here, rabbits are getting **** up. These rabbits are getting oh my God, there's a cat attacking a rabbit. There's some **** deer over here he probably needs to get **** no that's a rabbit. He's okay. This is is a rabbit who got shot with an arrow looks like he's slowly dying. **** it's gr he's really hurt. He's dying bad. Uh, there's ghosts inside of him. There's rabbit ghosts. He might be sperm. I can't ladies and gentlemen, the Jour the Jour is it a sperm trying to escape? No, I think they're just they're just normal rabbits trying to escape, but they all went in the hole at the same time. What the **** really that was real. I thought that was some kind of drug sequence no damn why would they show what is this movie about are they getting attacked by other rabbits? Yeah, dude, it's it's so crazy man. It's rity rabbit Society rity here we go we got some kind of infection of trees oh I don't know what the hell is happen that's a fox that's",
            "start": 1123.28
        },
        {
            "text": "attacked by other rabbits? Yeah, dude, it's it's so crazy man. It's rity rabbit Society rity here we go we got some kind of infection of trees oh I don't know what the hell is happen that's a fox that's another thing I'm dead all right we get it these things suck and they're they're terrifying but yeah what the hell that's a kids movie kids shouldn't be watching sorry you're talking about gangs no I'm saying it's it's like about a couple different like a rabbit one rabbit Gang has to move into the territory of another what they represent you know real people not rabbits right right yeah kids kids are dumb and they can't handle that **** can't handle that **** I'm a dumb kid though you are a dumb kid still yeah no thank you something else yeah ET terrifying really yeah the part where they come in and they're all in their hazmat suits and they go take him and then he's like in the water and he's all like weird and gray yeah I also remember being at Universal Studios and riding the ET",
            "start": 1165.44
        },
        {
            "text": "come in and they're all in their hazmat suits and they go take him and then he's like in the water and he's all like weird and gray yeah I also remember being at Universal Studios and riding the ET ride and like getting this giant scratch on my leg and yeah I know scarred me for Life clear Su I know get in Disneyland passes right now Universal I don't know anything about um but yeah has Disney not bought ET yet not yet not yet it's out of the way though then we get a yearly ET movie that's what the world needs ET yeah I wonder if there's been an ET there has to have been I mean I don't think I I don't think there has been either ET is one of those weird franchises where it's like how did that not have an animated series and uh like no there was an animated one oh there was yeah yeah something happened for sure there's been more though so I feel like he was a bit more right right yeah I guess you're right I don't know but that was back in the day where I think and this is obviously",
            "start": 1216.4
        },
        {
            "text": "happened for sure there's been more though so I feel like he was a bit more right right yeah I guess you're right I don't know but that was back in the day where I think and this is obviously don't bite my face off I know there's a million examples of the opposite that was back in the day where I feel like the 80s were let's make a cool movie all right we made a cool movie let's make something else let's not **** squize Goonies to death but I feel like then the '90s were about making cartoons Bas was like the Beetlejuice cartoon Back to the Future yeah exactly so there was an ET cartoon I can guarantee that that makes sense Kevin can you double check me on that that there's an ET cartoon on it thanks big guy yeah so we just stall in or we going to move on to the next topic it's fine you ready for the next topic yeah what's up everybody we finally made endslates you can click here to subscribe to youtube.com/ kindof funny you can click here to subscribe to youtube.com/ kindof funny",
            "start": 1256.96
        },
        {
            "text": "ready for the next topic yeah what's up everybody we finally made endslates you can click here to subscribe to youtube.com/ kindof funny you can click here to subscribe to youtube.com/ kind of funny games you can click here to go visit our Patreon page or you can click here to watch a best of playlist I have 8 seconds left so ham a lama ding dong how do you like it I like",
            "start": 1296.88
        }
    ]
}