{
    "id": 2466,
    "video_id": "LhvynsNX8os",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Xbox Game Pass Could Be A Game Changer - Kinda Funny Gamescast Ep. 110 (Pt. 3)",
    "description": "We think the Xbox Games Pass could be a game changer.\n\nThanks to Mack Weldon for sponsoring this episode. Go to mackweldon.com and use promo code: gamescast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1488978001,
    "duration": 1211,
    "transcript_chunks": [
        {
            "text": "this episode of kind of funny games cast is brought to you by Mac Welden. Mac Welden believes in smart design, premium fabrics, and simple shopping. They got socks, shirts, undershirts, hoodies, sweatpants, and the most comfortable underwear my tush has ever had the pleasure of meeting. Most importantly, they're all about comfort, so if you don't like your first pair, you can keep it and then they'll still refund you, no questions asked. Here's one of the coolest things, they have a line of silver underwear and shirts that are naturally antimicrobial. That's a fancy word that means it eliminates odor, so it'll probably help people like I'm not going to name any names like Kevin or anything, but it'd probably help him. It's good for working out, going to work, going on dates, you know, I'm not really sure there's any situation they aren't great for, at least any situation that requires wearing underwear, you know, you feel me talking about sex. Go to mackweldon.com and get 20% off using promo code",
            "start": 0.08
        },
        {
            "text": "there's any situation they aren't great for, at least any situation that requires wearing underwear, you know, you feel me talking about sex. Go to mackweldon.com and get 20% off using promo code gamescast. All right, Greg. Yeah, third topic of the day, I want to talk about some Xbox. X gonna give it to you. X not that X different Bill Gates box gonna give it to you. You know what I mean? The box box going going give it to you. I specifically want to talk about the Xbox Game Pass. Sure. So this is another thing where we're talking about, you know, Gamescast can kind of get weird in terms of this is old news is essentially, but we're going somewhere with it that's not just let's explain the games exactly, but I do want Game Pass, I do want to explain it to you because there there's a l I want every have the same base of knowledge before we talk about stuff. So let's get off let's get off right here. I'd love to get off right now. Let's do it. Xbox Game Pass is a Netflix likee subscription service for",
            "start": 35.52
        },
        {
            "text": "the same base of knowledge before we talk about stuff. So let's get off let's get off right here. I'd love to get off right now. Let's do it. Xbox Game Pass is a Netflix like subscription service for Xbox One that gives members access to a catalog of free Xbox One and 360 games. Gamespot talk to Aaron Greenberg, we're friends with Aaron Greenberg, like that guy I like that guy we have him back soon we should games with gold and Xbox Game Pass are two different Services offerings with unique benefits. A Microsoft representative said in a statement to Kotaku games with gold is an benefit specific to Xbox Live Gold members that rewards players with two to four free games each month to enjoy whereas Xbox Games Pass is a subscription based service that gives you unlimited access to over 100 Xbox One and 360 back compatible games for Xbox One for $10 a month. Xbox Live Gold is not required for Xbox Game Pass however Xbox Live Gold is required for multiplayer games that are part of the Xbox game",
            "start": 87.08
        },
        {
            "text": "and 360 back compatible games for Xbox One for $10 a month. Xbox Live Gold is not required for Xbox Game Pass however Xbox Live Gold is required for multiplayer games that are part of the Xbox Game Pass category. Makes sense? Yeah the Microsoft spokesperson also clarified the Xbox Game Pass catalog will update every month only quote unquote sometimes will games be removed so very similar to Netflix sure where every month something something leaving something's coming yeah yeah something's always you'll be able to play all the games in the library for as long as you remain a subscriber if you cancel your subscription or a game is removed save data is stored to your account so you can pick it up where you left off in the future should you decide to resubscribe or buy a game. Xbox Games Pass is currently available on Xbox One for people in the Xbox Insider program for testing with the limited selection of titles before it's public rollout that is slated for sometime this spring so soon sure",
            "start": 131.32
        },
        {
            "text": "currently available on Xbox One for people in the Xbox Insider program for testing with the limited selection of titles before it's public rollout that is slated for sometime this spring so soon sure when asked if Microsoft would let uh users purchase an Xbox Game Pass membership membership and gift it to a friend Greenberg said this is not a confirmed feature but he does like the idea Greenberg also confirmed that Xbox Game Pass will only have a month-by-month subscription option available price to $10 no other random ass hour by I'll buy for anything like that cuz that would be stupid PS now hey now hey now hey now dream additionally Greenberg said that Xbox Game Pass can be shared as part of Xbox One's Home Sharing policy great awesome sounds good there's more than 100 games available and the the first 10 announced so far we got Fable 3 Gears of War ultimate Halo 5 Lego Batman Mad Max Mega Man Legacy Collection NBA sorry game of the decade Mad Max is going to game of the right next",
            "start": 173.36
        },
        {
            "text": "the the first 10 announced so far we got Fable 3 Gears of War ultimate Halo 5 Lego Batman Mad Max Mega Man Legacy Collection NBA sorry game of the decade Mad Max is going to game of the right next to Mega Man Legacy Collection wow uh Payday 2 wait it Colin build this SRO 4 Soulcalibur 2 which I'm really confused about was Soulcalibur 2 re-released on Xbox One in like some type of what be 360 well I mean so Soulcalibur 2 came out on Xbox okay right I don't I'm not seriously I go I gloss over when the fighting game started Soulcalibur 2 is the one that was Xbox GameCube PS2 whereas haachi link and spawn okay so I'm just I don't this seems weird to me that that game out stands out to yeah cuz that's an Xbox game maybe it was re-released somehow on 360 or Xbox One like I I don't know weird let me know someone tweeted me I want will Tekken Tag Tournament 2 is the last one okay so like that's a that's a lineup of just 10 of the 100 that they're they're coming out with like so this isn't",
            "start": 218.96
        },
        {
            "text": "let me know someone tweeted me I want will Tekken Tag Tournament 2 is the last one okay so like that's a that's a lineup of just 10 of the 100 that they're they're coming out with like so this isn't some **** Halo 5 Gears of War like these are the games Mad Ma and Mad Max yes so other cool things are uh that are different than PlayStation Now is on box if you like the game you can get a discount to buy it yeah so right that's a fun thing PlayStation now it's you play it and then you got to exactly you're the full price um playst now has a variety of different options to to pay you can rent a game for 4 hours for $1.99 or you can get a one-month membership for $20 or a three-month membership for 45 sure so already like the clear winner in pricing I mean like the Xbox you want to run through the tail of tape a little bit longer I'm just I want to get through the very little bit of just the differences cuz want to put that on this table uh and then Xbox is Xbox One and Xbox 360 games",
            "start": 271.96
        },
        {
            "text": "the tail of tape a little bit longer I'm just I want to get through the very little bit of just the differences cuz want to put that on this table uh and then Xbox is Xbox One and Xbox 360 games whereas PlayStation now at least currently is only PS3 PS3 and uh the biggest difference is PlayStation Now streaming which creates issues Xbox Game Pass you download the game that I mean that's that is the back breaker for me and that's I mean that's what they LED with talking about it and I think that is the really big holy **** that's a way bigger difference is the fact that yeah like PlayStation Now to me and it's one of those where I sit there and I am often like man I'd love to play Catherine or I'd love to do this I'm like I want to break out the PS3 I often go oh what about PlayStation now and I'm like yeah but the latency you know what I mean no matter what you're streaming a game and like I me I'm sure it's gotten better whatever blah I played it at when they launched it and it was",
            "start": 323.56
        },
        {
            "text": "and I'm like yeah but the latency you know what I mean no matter what you're streaming a game and like I me I'm sure it's gotten better whatever blah I played it at when they launched it and it was just like that thing of like okay well no it's not you know it's not precise and that's the kind of **** I can't deal with like when you know when you sit down to play a game and you know something's wrong with the input on the TV that laty it I'm just do it to be like no no no you download it I'm like well yes why if you're if you're not a I don't I don't mean it in a negative sense like you're a cheap ass gamer or a penny pitching gamer but if you're a gamer on a budget and you're like yeah I want to play other stuff and I want to play Mad Max and I want to play Halo and I want to play these 360 games I have no idea why you wouldn't do this like this is I think Head and Shoulders a better program than PlayStation now and it's funny the journey PlayStation now has been on of like we talk",
            "start": 369.0
        },
        {
            "text": "360 games I have no idea why you wouldn't do this like this is I think Head and Shoulders a better program than PlayStation now and it's funny the journey PlayStation now has been on of like we talk about it you know on PS I Love You or when we talk about this subject of just the fact that Colin and I were like they bought Guai boom huge announcement this is going to change everything and they blah they don't have to worry about anything and then they Morphin this PlayStation Now service that I you don't hear anybody super excited about that you don't see anybody really working with and it's like okay well then it's really just an answer an answer to backwards compatibility which Microsoft came out at that E3 was like nope here you go we're making our games backwards compatible you can play your 360 games on Xbox One and it's like oh **** and it's like well it's PlayStation's answer to but and it's like well now we're putting Xbox One games on here too like it's a cool program it's",
            "start": 407.96
        },
        {
            "text": "your 360 games on Xbox One and it's like oh **** and it's like well it's PlayStation's answer to but and it's like well now we're putting Xbox One games on here too like it's a cool program it's and like when you and it's the Netflix of video games which we've talked about with so many times why is why doesn't Nintendo do that with virtual console and that's the thing is like with the Virtual Console still kind of on the hush hush uh from Nintendo it's like I wonder if there's a possibility of them going this route I don't think they're going to end up doing it and I don't even necessarily think it makes sense uh for them to do it we do know that their uh online service will include the free download whatever so that that **** is super weird and whatever uh but it's like that that could work in a ecosystem like this Xbox Game Pass thing it's like so there is the possibility still of that of that being the case uh this news to me when I first heard it I was a little confused by it",
            "start": 446.56
        },
        {
            "text": "work in a ecosystem like this Xbox Game Pass thing it's like so there is the possibility still of that of that being the case uh this news to me when I first heard it I was a little confused by it and like didn't really understand who the the target audience was sure as I read more about it and trying to figure out I'm like you're right it this is the type of thing of like why wouldn't you do this if you are a average gamer for me here's the thing about this $10 a month for access to all that **** is huge we you know we always talk about how privileged we are and we get all these free games and literally anything's in email away we want what I what this is to me is a far better version but I will never ever ever forget the first summer vacation where Blockbuster Video instituted their game pass and I forgot I think it was I paid 20 bucks or maybe it was 10 bucks a month or whatever and I got unlimited game rentals one out at a time and I remember that the thing I did was like okay",
            "start": 488.2
        },
        {
            "text": "game pass and I forgot I think it was I paid 20 bucks or maybe it was 10 bucks a month or whatever and I got unlimited game rentals one out at a time and I remember that the thing I did was like okay cool I just I had uh it was PlayStation times right that makes sense well doesn't matter but I think it was cuz I played Britney's dance beat I remember that being one of the ones but that was the thing of like what I did is I went in there and I was like all right cool every game I'm I'm going to play every game in Blockbuster and I went to the game section and I grabbed that first a game are you took it out and can't and that's how I played it got when I'm into bees there's Britney's dance beat all right cool and it was like it would be like you know I do it was like a way to break up the monotony of like the job I had or whatever and like you know it summer break and so and I was playing other things I wanted to play but you you remember how Summers used to be like now there now",
            "start": 529.24
        },
        {
            "text": "the monotony of like the job I had or whatever and like you know it summer break and so and I was playing other things I wanted to play but you you remember how Summers used to be like now there now there's games all the time but there was a time where it was like there was like a **** six-month period where there was like nothing happening like you're waiting till fall and that's it so it was like I had all this time and I wanted to play **** so I just went through and played everything and that's what this is too and that's how I see it working right and the fact of like you are a gamer who can't afford to get every AAA game can't afford to get everything I'm sure you missed a lot of stuff in the 360 area that's **** awesome so yeah why wouldn't you go ahead and okay cool let's do this 10 bucks and just try it and again it's monthly so you don't have to worry about it you don't have to thing and that's the thing with PlayStation Now where it's like okay cool like PlayStation",
            "start": 569.96
        },
        {
            "text": "this 10 bucks and just try it and again it's monthly so you don't have to worry about it you don't have to thing and that's the thing with PlayStation Now where it's like okay cool like PlayStation Now fine and it's whatever it's there if you really need it but the latency and then only PS3 and it's more expensive and like why the **** would you do that like Xbox this is a really good service it's a really cool thing now to your point about Nintendo in the Virtual Console I'm with you that number one I don't think it'll happen and number two I don't think it needs to happen because what I again we I was like we talk about this in the previous show we talked about this in previous topic where is somebody without the Nostalgia for Nintendo I'm I still have never played oh Jesus I for I've never beaten Super Mario 2 or three I'm sure the list goes on like that no cuz I just I missed them right so I've seen him and I've played him but it's like if I'm actually going to have this system",
            "start": 606.12
        },
        {
            "text": "never beaten Super Mario 2 or three I'm sure the list goes on like that no cuz I just I missed them right so I've seen him and I've played him but it's like if I'm actually going to have this system with me of course I'm going to buy him and put him on there and I'll **** do it you know but that's the thing I'll buy them I I'm totally fine to give you the five bucks for Super Mario 3 I know it's amazing I know it's try I mean you are in the minority in that in well that's there are many many many many people out there that have bought Mario 3 10 times ex and that's my but that's my point for why they don't need to do it is the fact that I've never done it I love this system sure here's my money and I think there are in the same breath there's people like you who are like I bought it a million times this is my system that's with me all the time I'll buy it again exactly and I don't think you're going to be there like I've put in too much money it's almost a",
            "start": 643.92
        },
        {
            "text": "are like I bought it a million times this is my system that's with me all the time I'll buy it again exactly and I don't think you're going to be there like I've put in too much money it's almost a source of Pride when you talk to people about how many versions of what this they' bought yeah it's it's interesting I I think that this Xbox Game Pass is going to be good for the industry overall if it works correctly because it is we are moving towards this kind of uh choose what you want type of situation where it's like you are now going to play games if people are going to buy this for $10 and play games that they would have never played otherwise and I think that's important because you talk to Nick who watches all this **** on Netflix you about Amazon Prime uh video when you're watching you would have never watched otherwise so that that alone is cool just the discovery aspect of it all 100% you're right on that in the fact they're going to go out and discover and stuff it's great",
            "start": 682.4
        },
        {
            "text": "you would have never watched otherwise so that that alone is cool just the discovery aspect of it all 100% you're right on that in the fact they're going to go out and discover and stuff it's great on the level that this is what we talk about where you know is competition good for everything competition is great for everything right Xbox is behind PlayStation they need to figure out how to get in front of PlayStation they're going to make these moves which then puts pressure on PlayStation on Nintendo to follow suit to come up with an answer to figure this out and then on top of this this is a question from either this show or P I Love You where somebody was like I feel bad about renting games and like cuz I do game Fly and I do this and the developer doesn't get money like we're okay guess what everybody we are to the point that Xbox and PlayStation and Nintendo can sit there and be like all right cool no more game flies no more local mom and pop shops not that's a real thing but",
            "start": 719.6
        },
        {
            "text": "guess what everybody we are to the point that Xbox and PlayStation and Nintendo can sit there and be like all right cool no more game flies no more local mom and pop shops not that's a real thing but like we can do this on our own and cut the developers a better deal and do it all digitally and not have to worry about it and it's also then getting what we always want that digital future to happen where now all of a sudden consumers want more digital stuff because they're consuming more digital stuff they understand how digital Works they're putting more pressure on cable companies to make the internet better we're doing that you know what I mean like yeah and I mean there's a lot of I I was reading an article today that uh was associating the Xbox Game Pass announcement with uh the GameStop stock dropping dramatically and like I I think that's a little bit just coincidental but I mean who knows you know like this is the type of uh just another hit on that nail in the coffin for for",
            "start": 758.36
        },
        {
            "text": "stock dropping dramatically and like I I think that's a little bit just coincidental but I mean who knows you know like this is the type of uh just another hit on that nail in the coffin for for that that type of for you know physic I didn't realize GameStop's a stock drop that's interesting yeah I mean I I I would if I cared more that'd be a stock I think I would pick up because I bet they're looking at this in the same way of like well that's an interesting way to keep this going you know what I mean we try they know we'll try to sell used digital Goods like that doesn't work but getting the GameStop app onto Nintendo onto Xbox onto PlayStation that is the digital game Fly and figuring that out that's something there too that's huge I mean yeah but like it's great that it's Xbox doing it there's an Xbox app that you can get on your Xbox to play these games ex I'm excited to see what it does for the industry I'm excited to see at E3 and E3 is probably not the place Sony would talk",
            "start": 795.32
        },
        {
            "text": "it there's an Xbox app that you can get on your Xbox to play these games ex I'm excited to see what it does for the industry I'm excited to see at E3 and E3 is probably not the place Sony would talk about it would probably just be a blog post or its own separate thing but uh what does this mean for PlayStation now will PlayStation get PS4 games as well yeah uh will they change their pricing structure because I think a big thing for going for Xbox Game Pass is $10 a month there's no **** around there's no tears and this this yeah I mean we are getting a point now like all right cool there's Xbox live there Xbox games fast and there's Xbox games with gold and there's PlayStation now there's PlayStation view PlayStation Plus play all it's like okay there's there is a lot of stuff going on that gets confusing even for people in the know ear today when we were talking about this topic like it's like Okay cool so let's talk about it from this perspective and it's like we need to brush up",
            "start": 836.76
        },
        {
            "text": "that gets confusing even for people in the know ear today when we were talking about this topic like it's like Okay cool so let's talk about it from this perspective and it's like we need to brush up on play you're like what is happen like I haven't thought about PlayStation now in **** forever let me go look you brought up a point earlier in this topic where you're like um that you don't hear anyone talking about PlayStation now or whatever I wonder if people are like I wonder if we are not the audience I don't think anyone we surround ourselves with are the audience for people that would use PlayStation now I wonder if people are actually interested in it I wonder if it is working for Sony and it's one of those things that I don't think we'll ever know yeah because son doesn't released numbers like that well I mean the thing with PlayStation now that I thought was the they're getting ready to do something and it's evident by the fact right that they turned off V support they",
            "start": 878.28
        },
        {
            "text": "numbers like that well I mean the thing with PlayStation now that I thought was the they're getting ready to do something and it's evident by the fact right that they turned off V support they turned off PS3 support they turned off all these different support Windows so it's PC it's PlayStation 4 so you assume that they can optimize the they can optimize the infrastructure they can make the store look pretty it sounds like the move you make right not right before but maybe six months before a few months you know coming into E3 where you're like okay cool we did all that to do this PlayStation Now is better than ever and here's what it is yeah man it's going to be an interesting E3 I can't wait till we start getting a little closer and we can start doing like prediction topics and things like that because we're going into to a year where we have a brand new piece of Hardware that just launched with the switch and Nintendo **** has to at this point make some power moves sure uh in",
            "start": 915.6
        },
        {
            "text": "like that because we're going into to a year where we have a brand new piece of Hardware that just launched with the switch and Nintendo **** has to at this point make some power moves sure uh in addition to that we got PlayStation coming off year dreams one and two yeah where it's like what like how are they going to top what they did last year I think it's impossible but **** it I'm asking for your dreams 3 sure and then there's Xbox with Scorpio and who the **** else knows what they have up their their sleeve like this this is an E3 unlike any we've seen in years yeah and I like that the last couple years have always had some weird little thing about them that keeps it interesting like will they show the PlayStation 4 Pro and it's like No And it's like oh Xbox showed theirs like no one expected that uh so it's cool to to go into it now and I I wonder if we're going to get a lot more announcements like this because for Xbox them coming out two years ago with the backwards",
            "start": 952.44
        },
        {
            "text": "no one expected that uh so it's cool to to go into it now and I I wonder if we're going to get a lot more announcements like this because for Xbox them coming out two years ago with the backwards compatibility uh new that's right two years ago it was our first time it's kind of funny yeah that's what won them E3 in critics eyes and wonder if there's going to be more announcements and there is room for PlayStation to talk about PlayStation now at their conference um and the new version of whatever it looks like and is but yeah it's an exciting time and I do think that this is the type of news that I immediately write off because I'm not interested yeah I'm like I'm not going to do this I don't care whatever but I think when I think deeper about how much it's going to affect the majority of people out there I think this is going to be huge for Xbox and it is going to shift the industry the will it be huge for Xbox is a huge question mark for me I hope it shifts the industry but it is",
            "start": 998.8
        },
        {
            "text": "of people out there I think this is going to be huge for Xbox and it is going to shift the industry the will it be huge for Xbox is a huge question mark for me I hope it shifts the industry but it is that thing that PlayStation does have a strangle hold right they are so far ahead and this isn't an I mean if this I feel like if the roles were reversed not even the I don't mean like placements if PlayStation right now announced we're doing away with PlayStation now instead this is PlayStation then and it's that you download the games and you have 10 bucks you get all these games right I feel like the place would go insane because and this is never a knock I don't mean it like a knock I feel like the PlayStation gamer is the gamer we think of the gamer who is I want to know the lineage of everything I want to have a breath of knowledge about everything they're the best friends you know what I mean whereas I think this is something we were talking about Colin and I recently that Xbox",
            "start": 1040.76
        },
        {
            "text": "everything I want to have a breath of knowledge about everything they're the best friends you know what I mean whereas I think this is something we were talking about Colin and I recently that Xbox lost its way this generation because it banked on the people who loved Gears and loved Halo and loved Sports and Call of Duty and I'm not again I'm not cuz obviously I enjoy some of those games a more juvenile audience they thought would be here too and I do think in a way the audience grew up and like when PlayStation came out it was like games games games games games this is what we're talking about you're Gamers we're all Gamers maybe they just maybe it just peeled away at the time something the mainstream I think Xbox lost their step there so I I think backwards compatibility is awesome and it won it in the eyes of the critics right I don't know how much that mattered to everybody it seems like it matters a lot and again this is all very just but I mean I I'm on the kind of funny",
            "start": 1089.32
        },
        {
            "text": "and it won it in the eyes of the critics right I don't know how much that mattered to everybody it seems like it matters a lot and again this is all very just but I mean I I'm on the Kinda Funny Facebook group every day and like I see what people are talking about and the backward compatibility Xbox seems like a big deal great that's that's good that's good knowledge that I have that I haven't heard about and that's the thing is like that's awesome and I want that to matter and I love this program I want this to matter I Xbox is doing some awesome stuff I want them to continue to be awes I think that it's also great timing with Scorpio because I I even though Xbox is losing now they have a chance at not losing and I think that it is moves like this that are going to put them in a better position that's actually a great point that I didn't **** think about it at all this matters so much with Scorpio because when it comes out immediately here's a library you didn't buy an Xbox One",
            "start": 1130.56
        },
        {
            "text": "position that's actually a great point that I didn't **** think about it at all this matters so much with Scorpio because when it comes out immediately here's a library you didn't buy an Xbox One no big deal when you come here here's Gear great point that I didn't even think about the fact of like yeah when they get to announce that yeah Scorpio comes with for 10 bucks 00 games yeah right yeah and then that it's going to be an interesting time play Quantum Break everybody hope you enjoyed that Kinda Funny Gamescast if you did you can make sure you to subscribe here to Kinda Funny Games and if you want content that's not games Rel you go here subscribe to Kinda Funny and if you want to support us and you know help us make cooler stuff Patreon it's right there doing cool stuff I love you see you guys next week",
            "start": 1166.64
        }
    ]
}