{
    "id": 2456,
    "video_id": "uIAWckNwDBI",
    "show_name": "Colin Was Right",
    "hosts": [
        "Colin Moriarty",
        "Jason Schreier"
    ],
    "title": "Jason Schreier x Colin Moriarty - A Conversation With Colin Was Right",
    "description": "Kotaku's Jason Schreier joins Colin for a lengthy conversation about the state of games journalism, the pursuit of real stories to tell, and much, much more.",
    "published_at": 1488830404,
    "duration": 6249,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations. Welcome to A Conversation With Colin Was Right. My name is Colin Morardi. This is Kotaku's Jason Shrier. Hello. One of my very favorite people in the industry. We've only met I think twice in person until now. So this will be our third time. But uh we have we've we've long corresponded on the social media etc. The tweets tweets the direct messages. And I've been long been a big fan of what you do. So I appreciate you coming in to talk to us. I am a big fan of kind of funny. You guys have this this setup is incredible. I love it. This studio is so cool. Thank you. So I wanted to take advantage. You obviously work out of New York City which is where I wish I worked out of. And uh you were here for GDC so I had to take advantage of this opportunity that you're in San Francisco. Get together. Um you are of course the I was looking at your news editor at Kataku but I'm surprised you're not running that whole thing at this point. I I wouldn't no Stephen Sel",
            "start": 3.84
        },
        {
            "text": "in San Francisco. Get together. Um you are of course the I was looking at your news editor at Kataku but I'm surprised you're not running that whole thing at this point. I I wouldn't no Stephen Sel. Stephen is the best possible manager. He's the best boss I've ever had. He's the best possible editor-in chief of Kotaku. Like trust me he he does so much **** behind the scenes that like Oh am I allowed to curse him? Yeah. Yes. Oh my god he he does so much behind the scenes that keeps this place running. It's incredible. He's the most talented person I know. Well shout out to you Mr. Tootill. We'll have you on the show hopefully one day as well. Uh I wanted to have you on. So I want to explain this to to the audience real quick about what this is. For the audience that's been with us since before we were even kind of funny when when it was just basically Greg Miller's YouTube channel back in 01 or 013 whatever it was the very first show we ever did was called A Conversation",
            "start": 38.16
        },
        {
            "text": "since before we were even kind of funny when when it was just basically Greg Miller's YouTube channel back in 01 or 013 whatever it was the very first show we ever did was called A Conversation With Colin which was a stupid show that we used to do about all manner of topics. I wanted to call this A Conversation With Colin Was Right because I wanted to tie in the old show with the new show. Um Colin Was Right is doing really well and you people out there seem to like it. What do you mean by you people? You people. And uh I specifically want this interview series to be about something a kernel of of truth or untruth or whatever it might be within one of the episodes. This is going to be all untruth. Yeah. All it's all **** up. The reason I wanted to have you on is specifically because you inspired episode 6 which was GameStop's slow demise in the all digital future. And in that we don't we'll talk a little bit about GameStop I'm sure but I wanted more Jason to the the nugget",
            "start": 73.52
        },
        {
            "text": "you inspired episode 6 which was GameStop's slow demise in the all digital future. And in that we don't we'll talk a little bit about GameStop I'm sure but I wanted more Jason to the the nugget to be uh games journalism specifically because as we say on our shows and and as our our viewers all know we really talk up what you do at Kotaku uh what guys like Patrick Klepic do. Um and there really only are a few functioning working journalists really in the gaming industry in my in my mind that I'm seeing do real digging and real investigative stuff and really breaking stories and not just regurgitating the same **** that the PR people tell you. And so that's why we respect you so much and our audience respects you so much. Um and so I want to talk a little bit about that about the state of journalism. Let's talk about it. Let's do it. Let's talk about journalism. So first of all let's let's you know let's pate your ego a little bit because can this just be an hour of that?",
            "start": 105.36
        },
        {
            "text": "state of journalism. Let's talk about it. Let's do it. Let's talk about journalism. So first of all let's let's you know let's pate your ego a little bit because can this just be an hour of that? Yeah of course. It could be whatever you know that fantastic. Really congratulations because you are doing God's work over there. If more people treated and and this is this is what I said all the time. more people treated the the medium the way you treat the medium in terms of treating it seriously and breaking stories and talking about things that matter and not just looking at your inbox every day and saying like oh I got a press release in here is gaming would be much further off so congratulations on that because you are in my mind the leader of your field in that regard it is I think that the reason that you don't see a lot of it is because it's very tough to make money doing journalism true and uh there isn't a lot of money going around at news organizations We're fortunate to be a",
            "start": 141.6
        },
        {
            "text": "the reason that you don't see a lot of it is because it's very tough to make money doing journalism true and uh there isn't a lot of money going around at news organizations We're fortunate to be a lean staff that pays people well and treats us pretty well. So we are able to do some things that uh maybe other people don't have the resources to do. But yeah I'm proud of a lot of the work we do. Uh I think we we wind up pissing off a lot of people which I think is an important part of journalism. I don't think you're doing journalism unless you're pissing some people off. Um but uh yeah thank you. And I I appreciate you guys always being so complimentary of Kotaku and what we do there. And it it's nice to see people getting it which is cool. Yeah I mean I do get it because you know for most of our audience knows I was I was at IGN for many years and I was a senior editor there and I did a lot of the similar stuff that you did because I enjoyed it and it was and and to the to",
            "start": 183.76
        },
        {
            "text": "for most of our audience knows I was I was at IGN for many years and I was a senior editor there and I did a lot of the similar stuff that you did because I enjoyed it and it was and and to the to what you're saying the credit goes to the people at Jen because they certainly weren't making any money when I went to Naughty Dog for a week and wrote the history of Naughty Dog or whatever but it was a prestige piece and it was something that was important and they knew that. So they you know as I said before they must have lost a ton of money on that but but they let me do it. And uh when I left IGN um I was sad to see that uh not not not to build myself up I guess but it's like it's like a pie chart where there's only a hand Matt Leone for instance or or you know like we said Patrick Austin Walker guys that are like really doing some digging. I I pulled myself out of that because I couldn't do it anymore. And I found I I was sad to see that it just kind of collapsed in on itself.",
            "start": 223.52
        },
        {
            "text": "Austin Walker guys that are like really doing some digging. I I pulled myself out of that because I couldn't do it anymore. And I found I I was sad to see that it just kind of collapsed in on itself. There wasn't someone else in there that that went in there. And so that's why I love reading some of this some of this great stuff that you're doing. And and a good segue to by the way because you're doing uh you're releasing a book I wanted to make sure to get the name right. Blood, Sweat, and Pixels. Blood, Sweat, and Pixels. Yes it will be out in September. September. Very excited about that. Yeah September 5th. You can uh pre-order it right now and you will get the GameStop exclusive DLC of a book a special book jacket with uh with my picture on it. No it's uh it's cool. It's a book of behind-the-scenes stories about how video games were made. And uh it's interesting. Well so so we will I'm sure get into this a lot but there are different types of digging or",
            "start": 260.88
        },
        {
            "text": "cool. It's a book of behind-the-scenes stories about how video games were made. And uh it's interesting. Well so so we will I'm sure get into this a lot but there are different types of digging or journalism right? And uh a lot of the stuff I've become known for is the quoteunquote scoops where I'm telling people about something before it's official or before it's announced or whatever. Um this is a different type of thing. And this is actually the stuff that I care way more about. Like it's fun to be like the first news organization and the first reporter to break the news that uh No Man's Sky was delayed or whatever. But uh that sort of thing is kind of you're going to find it out anyway. The work that I prefer to do is stuff that you would not find out if not for the work that I am doing and giving you. So telling stories about behind the scenes stories whether it's something that a company wants you to know or something that a company doesn't want you to know. Um and this book",
            "start": 296.72
        },
        {
            "text": "doing and giving you. So telling stories about behind the scenes stories whether it's something that a company wants you to know or something that a company doesn't want you to know. Um and this book has both. So this book has 10 different stories about 10 different games. Uh some of them uh you will know some of them you might not know. There's some are smaller some are bigger. Um Uncharted 4 is in there. Destiny is in there. Star Wars 1313 is in there. Uh a whole bunch of stories. You can see them all. They're actually all on the cover. So if you Google Blood, Sweat, and Pixels you will see the full list of games. Um and yeah it was cool. I I Some of them were based on me going to the studio and talking to the developers and getting like official access. Some of them are based on me talking to people more off the record uh such as Destiny because Bungie wanted nothing to do with this. Um I bet. And uh yeah it's cool. I think it came out well. I hope that people enjoy it",
            "start": 338.88
        },
        {
            "text": "me talking to people more off the record uh such as Destiny because Bungie wanted nothing to do with this. Um I bet. And uh yeah it's cool. I think it came out well. I hope that people enjoy it when it comes out September 5th. Pre-order now. Yeah. Um and yeah I I hope that people dig it. I will have to get you a copy. Please do. Please do. I would I would love to read. I love uh that the uh the library of gaming books has grown actually pretty significantly in the last 5 years. I've I've I've often talked about how uh like Fire in the Valley and and kind of more PCcentric books were really the main stays for many years. Masters of Doom. The Masters of Doom which is awesome. Um and uh you know uh even Game Over obviously is an amazing book etc. and so on but the the now the catalog is growing and I and I and I love that. I'm so glad that you're contributing to that. Uh one of the major things that I'm curious about is I I think a good jumping off point to the conversation",
            "start": 375.44
        },
        {
            "text": "is growing and I and I and I love that. I'm so glad that you're contributing to that. Uh one of the major things that I'm curious about is I I think a good jumping off point to the conversation itself is what is the state of games journalism right now? As someone who does it are you as dismayed as I am? Because when I go on these sites I'm like what the **** is any of this **** Like I I like why does anyone care about all this all clickbait and all that kind of stuff? And yes it goes into the economics and not everyone's as blessed as we are kind of funny to have to be largely fanfunded through Patreon. So I understand that we can kind of skirt that issue a little bit. We're not really worried about how many views our videos do because it doesn't matter right? Um but uh are you as dismayed as I am? Well I don't know. I mean there there are a lot of this is a nuance topic and there are a lot of different layers to this question right? So when I go on my RSS feed every",
            "start": 415.68
        },
        {
            "text": "as dismayed as I am? Well I don't know. I mean there there are a lot of this is a nuance topic and there are a lot of different layers to this question right? So when I go on my RSS feed every day and I see headlines I'm sure sometimes I'm dismayed sometimes I'm like we can do better than that. But it's also I'm so proud of so much of the work that we do um that it's hard to be that dismayed because I'm just happy with like hey we are running all this awesome stuff every day in Kotaku like from freelance pieces to our reviews to our stories about gaming culture and like all these stories that that we're kind of I like to think pushing ground on stuff about sex and drugs and YouTubers and stuff that your average gaming site wouldn't have covered four years ago that we were covering and now more gaming sites are covering that sort of thing. So um we're now we're we're trying to push be the vanguard in other ways but yeah I'm proud of that. Um there are definitely things that",
            "start": 448.64
        },
        {
            "text": "now more gaming sites are covering that sort of thing. So um we're now we're we're trying to push be the vanguard in other ways but yeah I'm proud of that. Um there are definitely things that make me raise an eyebrow on gaming sites. There definitely things that that uh I am uh I don't I wouldn't say dismayed just because I feel like if other people are doing a crappy job at something we can just do it better. So So it gives you a competitive edge. Exactly. And and I I like that we I like it when I feel like we are the best at something. And then sometimes I see our competitors and our colleagues at other sites doing things really well and I'm like \"Wow we want to compete with them.\" Like I see what Patrick my former co-workers doing over at Waypoint and I'm like \"Wow he's doing some really cool cultural stories that I wish we had on Kotaku and that helps push us to do better.\" And I see some cool features on other sites and um yeah I don't know. I wouldn't say dismayed",
            "start": 491.44
        },
        {
            "text": "some really cool cultural stories that I wish we had on Kotaku and that helps push us to do better.\" And I see some cool features on other sites and um yeah I don't know. I wouldn't say dismayed is the right word. They're definitely there's definitely stuff that makes me roll my eyes. Um that's a good way of putting it. Yeah I'm not I I would say that no gaming sites don't really dismay me. I think some stuff on YouTube gets me dismayed because I think that the way that some YouTubers kind of try to position their audiences against sites like Kotaku gets me dismayed and how YouTubers just uh I don't want to generalize but there's some YouTubers who uh see themselves as the opposition force to the press and they see it as being in their best interest to be so independent uh and like like the I don't know alternative voice like uh to the traditional gaming press where they just want to **** on sites like Kotaku all the time um often for unjustified reasons and it's always hard to",
            "start": 532.32
        },
        {
            "text": "the I don't know alternative voice like uh to the traditional gaming press where they just want to **** on sites like Kotaku all the time um often for unjustified reasons and it's always hard to really properly respond to a YouTube video a because they don't really follow any journalistic standards of like contacting people for comment and get making sure they have all their facts straight. You a YouTube video could have all sorts of like be riddled with inaccuracies and there's no way to really respond to that because you can't quote parts of text unless you sit there and transcribe it all. Um you you have to like make another video that like cuts out their footage. Uh I remember there was one YouTuber I think it was someone part of the FaZe Clan who made this entire 0-minute video trashing us based on an article that didn't actually exist. It was one of those fake Photoshops that someone made um with uh uh like some fake article about I don't even remember what it was but a",
            "start": 574.0
        },
        {
            "text": "trashing us based on an article that didn't actually exist. It was one of those fake Photoshops that someone made um with uh uh like some fake article about I don't even remember what it was but a lot of people on 4chan have been making all these fake Kotaku articles that they thought was funny. I guess in some ways they are funny but when when a YouTuber is like and this YouTube video has 500 000 views and it's like what can we do about that when this YouTuber is so dumb that they don't even realize that they're responding and trashing a fake article. That sort of thing dismays me more than like if IGN ran something about a fake article it would be pulled right away because everyone would call them out and it would be very clear and they have like for all a lot of people trash IGN and GameSpot and Kotaku but all these sites have specific standards editorial standards that they stick to where if something is wrong they will correct it. If something is uh needs to be pulled they",
            "start": 614.08
        },
        {
            "text": "GameSpot and Kotaku but all these sites have specific standards editorial standards that they stick to where if something is wrong they will correct it. If something is uh needs to be pulled they will note they will run a note saying as much. If something is incorrect they will fix it in the ma a matter of minutes. As opposed to YouTube where when you're kind of an independent uh uh operator and you were talking about news it doesn't really matter if it's fake because no one holds you accountable and no one cares. Like even uh the bigname YouTube shows I see all the time. Sometimes I see them talking about articles that I wrote and getting basic facts wrong and just nobody cares. It's like not even a thing. Facts don't matter. Yeah. It's Well yeah. I mean that seems to be a general vibe out there. It's the alternative fact. Exactly. What an an amazing term that is. Uh I agree with you which is why I've been trying to you know cuz I don't we are on YouTube but I don't really",
            "start": 655.84
        },
        {
            "text": "vibe out there. It's the alternative fact. Exactly. What an an amazing term that is. Uh I agree with you which is why I've been trying to you know cuz I don't we are on YouTube but I don't really consider myself a YouTuber. That's not my heritage. Uh I'm learning how to edit videos. I'm learning how to do these things myself and and I've been sitting in front of a camera for a long time but not not to the extent we do it now. And that's what I've been trying to do with Colin Was Right was to inject a little bit of like research and originality and like something that has like standards. I was even playing around with the idea of doing endnotes in the in the uh u in like the description until I realized like no one no one reads this **** and it's it's not serving anyone. So I try to get the the quotes just right. I try to site my sources. Um it's kind of funny you say that though because I think it goes there is seems to be an inherent uh the distrust goes both ways. I think in some",
            "start": 696.64
        },
        {
            "text": "the the quotes just right. I try to site my sources. Um it's kind of funny you say that though because I think it goes there is seems to be an inherent uh the distrust goes both ways. I think in some way the example I use is that I wrote I did I did a piece uh that a lot of people saw about Donald Trump and his his possible effects on the gaming industry. Um and I I went to a bunch of sources and talked to people anonymously about um the state of specifically about tariffs and where games are manufactured and how this might be affected and and how the pricing structures work and stuff like that. Like really kind of deep journalism that if I wrote it on IGN would have been picked up by everybody. Uh and when I Googled the next week I'm like I wonder if anyone like cited this at all because a lot of like Polygon did their own piece that had nothing to do with mine and no one else was really talking about it. And I'm like it's it to me I'm like I get that distrust but I'm trying to",
            "start": 732.0
        },
        {
            "text": "a lot of like Polygon did their own piece that had nothing to do with mine and no one else was really talking about it. And I'm like it's it to me I'm like I get that distrust but I'm trying to inject a little bit of change there. But then I look at sites that I'm like but this is actually real news and really important and you're not writing about it because it's not a top 10 list. That's an interesting Well I think the main reason for that just speaking as someone who reads has to read the news every day and handle like cultivate what appears on our website or part of what appears on our website um is that nobody has time to sit down and watch a 0-minute video and it's much easier to scan an article for news than it is to watch a video. Like it's just I mean some people bless them have the bandwidth to be able to do that. But in in a fast-paced world where I have to get up and be checking Twitter and like checking for news constantly it's very difficult for me to actually the",
            "start": 769.04
        },
        {
            "text": "have the bandwidth to be able to do that. But in in a fast-paced world where I have to get up and be checking Twitter and like checking for news constantly it's very difficult for me to actually the other day I watched a Game Explained 90minute video of an analysis of the 3minut Super Mario Odyssey trailer. And I think that was the longest video I've ever watched on YouTube. I was I was inexplicably gripped by that. But usually I just don't have time to watch entire YouTube videos which is just I don't know just the nature of the work. I I definitely think that uh something we talk about often is that how much news we must be missing in that world but it's just a a resource problem of bandwidth problem. Yeah absolutely. And I can relate to that because even when I was even when I would do interviews uh at IGN like when I did the history not like I had 30 hours of interviews and I'm like I'm not transcribing this like I know you send it out to someone to do it and so I I I think",
            "start": 802.8
        },
        {
            "text": "do interviews uh at IGN like when I did the history not like I had 30 hours of interviews and I'm like I'm not transcribing this like I know you send it out to someone to do it and so I I I think you're right there but I but I guess the point is I'm there are certain people I'm not the only one that are trying to inject some reasonable nature of checks and balances in terms of the way we do news and YouTube because I think that it's important. I agree with you. I think it's super important to not get things wrong. Um I've gotten things wrong in the past on podcast or something. I think that's different. But when you're doing like an edited researched piece um like I used to do with IGN then you got to get it right and you got to quick fix those things quickly. So that's funny that people are making things about articles that aren't even real. It is. Yeah. I mean that's the type of stuff you see on there. And now you see all this drama with PewDiePie and um he's kind of setting",
            "start": 842.08
        },
        {
            "text": "are making things about articles that aren't even real. It is. Yeah. I mean that's the type of stuff you see on there. And now you see all this drama with PewDiePie and um he's kind of setting himself up as this antagonist to the news and there are all sorts of weird ethical questions going on now because he is sending his legion of millions of followers at these Wall Street Journal reporters. And I don't really want to get into the weeds on who did what and whether the Wall Street Journal did something wrong whether who when they contact him for comment on both sides. Well it is but I think it's different because PewDiePie has a legion of people who can do some nasty things if he sends. And like I saw him screen capping Wall Street Journal reporters tweets and stuff and immediately like the Wall Street Journal reporters had to lock their Twitter accounts because they were getting harassed so much. And having been the subject of of uh certain Twitter groups harassment I know",
            "start": 877.76
        },
        {
            "text": "like the Wall Street Journal reporters had to lock their Twitter accounts because they were getting harassed so much. And having been the subject of of uh certain Twitter groups harassment I know what that's like and it's terrible. It's not fun. And PewDiePie I mean he doesn't really have to be in that same position where he's like like a a he he is a celebrity making millions of dollars and he is not he he needs to be well I don't want to tell them what to do but like when you have that kind of audience I think there's a certain level of responsibility that comes with it. And I I'm I think that we have on YouTube a lot of people who don't really see that responsibility or like grew up not really learning how to deal with that and not knowing how to handle that fame and that e-celebrity uh mentality. It's really bizarre wild west of a world right now. Yeah absolutely. I agree. And then and I don't like the the uh I don't even know what what the word is but the sending of",
            "start": 917.2
        },
        {
            "text": "celebrity uh mentality. It's really bizarre wild west of a world right now. Yeah, absolutely. I agree. And then and I don't like the the uh I don't even know what what the word is, but the sending of your legions of people against it is it's scary. And the other aspect of it is uh something that we haven't touched upon yet is the idea of YouTubers doing coverage and also getting paid by the companies they cover, which is something very unsavory. Very unsavory. And it still happens all the time. And there's still all these influencer events where companies like Activision will be like, \"Hey, we're going to pay for you guys to stay in this hotel and play Destiny.\" And maybe you have to disclose it. Maybe you can put it in the in the description of your video. A tiny little thing. Yeah. And it's it's a very bizarre world. Like PewDiePie, for example, I remember he got a copy of South Park: The Stick of Truth and was like playing through the whole thing before it came out and it wasn't",
            "start": 961.28
        },
        {
            "text": "it's it's a very bizarre world. Like PewDiePie, for example, I remember he got a copy of South Park: The Stick of Truth and was like playing through the whole thing before it came out and it wasn't really clear whether they were paying him or just giving him early access to the game. And there are all sorts of weird ethical questions involving all of this stuff that I think that uh YouTubers are not properly equipped to deal with. Um at an editorial organization like Kotaku, we run advertisements and I'm sure they're game advertisements uh all the time on our site, but those are all handled by the business people and editorial is just a separate entity entirely as opposed to on YouTube where the editorial people, the people making the videos are also the people reading the ads, which is something you guys, I'm sure, have to deal with all the time. And it's when you start running game ads and you have to talk about games uh in a sponsored fashion while also talking about your real",
            "start": 999.12
        },
        {
            "text": "is something you guys, I'm sure, have to deal with all the time. And it's when you start running game ads and you have to talk about games uh in a sponsored fashion while also talking about your real opinions on games, you enter all sorts of weird murky gray territory. It's it's a brave new world that we're living in. It is. And you'll be pleased to know, uh well I guess to back up, we've tried to I I think again it comes from where we come from because we did have that wall between at IGN between you know everyone always says we like every wall they say to unourred things but I was there for almost 10 years and nothing unourred ever happened. We had no idea what the **** they were doing over at sales and we didn't care. Um but uh and I'm sure many things I wrote actually probably pissed them off and no one said anything to me. I just kept writing. Um but I think because we come from that place we try to overexlain and I think it probably actually comes off as annoying sometimes in",
            "start": 1035.84
        },
        {
            "text": "them off and no one said anything to me. I just kept writing. Um but I think because we come from that place we try to overexlain and I think it probably actually comes off as annoying sometimes in the audience cuz it's like I did a Bloodstained uh let's play for instance and I was like well EGA, I'm friendly with EGA and he was actually like they like launched that game from my they were all sitting around my kitchen table launching that game the day before and uh you know and I I did their their live stream and all that kind of stuff. I'm like, you should know that. And I'll explain. People probably are tired of hearing that every time I talk about Blessing, but but I want to let them know. It's important. Yeah. Yeah. Yeah. And and I think the other thing I think you'll be pleased about uh that you guys don't get on the media side, but we get more on the YouTuber side is certain publishers um are now sending us guidelines in our review guides. For instance, Sony is one of them. Um",
            "start": 1073.52
        },
        {
            "text": "uh that you guys don't get on the media side, but we get more on the YouTuber side is certain publishers um are now sending us guidelines in our review guides. For instance, Sony is one of them. Um that's like you must say uh that we sent you this game on YouTube. Interesting. Which is good. And we are obviously very pleased to do that. So when we have Horizon or Uncharted or Ratchet or something, it's like this game was provided for us for coverage, which I think is probably like you said taken for granted on the media side. I think everyone knows that we used to I used to get a million packages of course. Uh but it's not so taken for granted in this wild west. It's interesting. Well, so I'm thinking more of like a company like Sony actually paying for coverage, paying for we want you to run this 10-minute preview. Like there are all sorts of stories. I I ran one um I think it was last year. I someone contacted me. I guess they didn't realize they were talking to Kotaku, but I went",
            "start": 1106.64
        },
        {
            "text": "run this 10-minute preview. Like there are all sorts of stories. I I ran one um I think it was last year. I someone contacted me. I guess they didn't realize they were talking to Kotaku, but I went back and forth with them and they're like, \"Hey, we we want to sp do a YouTube sponsorship, whatever. Here are the brands.\" I remember this. Yes. Yes, I remember the story. And so, what was the game? Um, no, I I don't even remember. I would be comfortable saying cuz we put it on Kataku article, man. I I would have to look it up. I'm I'm trying to remember. It was some It was not something huge. Um, but it was some game and they had very specific guidelines for like you cannot mention this, this, and this. You have to be positive in your coverage. And it was very very specific about what you can and can't say. You have to throw in these phrases about the game. Um, and then you could find on YouTube if you go look up the article. Man, I wish I remember what the game was. Um, but it's about",
            "start": 1142.48
        },
        {
            "text": "and can't say. You have to throw in these phrases about the game. Um, and then you could find on YouTube if you go look up the article. Man, I wish I remember what the game was. Um, but it's about the the article on Kotaku is called something about like the shady side of YouTube disclosures or whatever, like what it's like to participate in YouTube ad deal. Um, and if you go on YouTube, you can find people saying these phrases like with no irony whatsoever or just like like this game is really the the bee's knees or whatever it was. Um, which is hilarious. But yeah, that's the type of thing I'm talking about more than like like it doesn't matter if someone a company sends you an early game, that's something that you need to do in order to cover that game in a timely fashion. That's not something that is going to affect you in uh uh any sort of uh uh like affect your objectivity or your your ability to look at a game without feeling pressured by the company financially. But if you're a",
            "start": 1180.32
        },
        {
            "text": "that is going to affect you in uh uh any sort of uh uh like affect your objectivity or your your ability to look at a game without feeling pressured by the company financially. But if you're a YouTuber and you have some deal with Blizzard to cover Starcraft, that means you just psychologically, even subconsciously, you might think to yourself, hey, if I say something too negative, they might not want to participate in another deal with me, so maybe I shouldn't do that. And not having that wall is is just it changes things in a big way. I have never once thought about the companies that advertise on Kotaku because I don't even know what companies advertise on Kaku and it it just doesn't affect me. I get my paycheck no matter what. But if I had to think in my head, oh, Sony is running this advertisement on Kotaku, and if Sony doesn't like fund advertisements for the next quarter, then I might not get paid as much, then that would change the way I did things entirely, which is something",
            "start": 1216.88
        },
        {
            "text": "advertisement on Kotaku, and if Sony doesn't like fund advertisements for the next quarter, then I might not get paid as much, then that would change the way I did things entirely, which is something that YouTubers actually have to think about. Yeah, absolutely. And I think that I think that the key word here is like maybe it's just like you have scruples or you don't. Like um one of the things that I've always respected about Kotaku and have come to kind of ardent defense of the site is um over time is that it you I have watched you guys hurt yourselves with with other companies to tell the truth and it bothers me when when people are like but these guys don't do journalism but actually this site is one of the only ones actually doing real journalism and here's a few examples of how they've destroyed relationships whether ephemerally or permanently with other publishers. I remember of course a long time ago PlayStation Home, but more recently with Sony with the with all that kind of",
            "start": 1259.36
        },
        {
            "text": "destroyed relationships whether ephemerally or permanently with other publishers. I remember of course a long time ago PlayStation Home, but more recently with Sony with the with all that kind of stuff and how they were so upset about that, but more recently I mean you guys a great example Jason is when you guys wrote very candidly I think it was actually Steven wrote candly about Ubisoft and the relationship you guys had with them and how because of your ass your annual Assassin's Creed leak that they basically just don't you persona to them and I'm like to me not anymore though they have started to treat us like like be adults about the relationship because to their credit I'm happy to hear that unlike Bethesda but yeah Well, I want to get to that in a minute as well because because I'm curious the wider Bethesda as a strategy I think is interesting to discuss. But with this particular thing, Jason, I was I looked at the story and I'm like, see, like they are they are getting",
            "start": 1297.44
        },
        {
            "text": "I'm curious the wider Bethesda as a strategy I think is interesting to discuss. But with this particular thing, Jason, I was I looked at the story and I'm like, see, like they are they are getting injured because they're telling you things that that the publishers don't want you to know yet whether or not it's important or not. They're they're leaking Assassin's Creed games. And I'm like, to me, again, the alternate or alternative news are just bizarre reactions to the same thing. I look at that and I'm like, well, this is clear evidence, guys, that that they don't care that they they're doing what's right. And then other people look at that and they're like, \"Fuck them, Ubisoft.\" Almost rooting for the publisher. Almost being like, \"Uh, we have to protect Ubisoft's marketing plans to the tea.\" And I'm like, \"But what the fuck?\" It that was so weird to me to to see. It's bizarre. It's bizarre. Well, so so we should talk about leaks just as an idea because there's a lot of interesting",
            "start": 1332.4
        },
        {
            "text": "tea.\" And I'm like, \"But what the fuck?\" It that was so weird to me to to see. It's bizarre. It's bizarre. Well, so so we should talk about leaks just as an idea because there's a lot of interesting things to unfold there. And it's something that we still talk about to this day. Like I don't know what the right answer is when it comes to covering something that people send. Like I'm always inclined to be like, \"Hey, if I know something, I want to talk about it. I want to tell people about it. I believe that that the public should have as much information as possible and it is my job to report information. But there's certainly always a question of news value. Like if I know, for example, that the new Far Cry is set wherever it is set, um is that really newsworthy? Is that really something that people need to know right now? Or should I wait until I know some piece of pivotal information that it'll turn in that will turn it into more of a news story like the Far the next Far Cry is",
            "start": 1366.0
        },
        {
            "text": "that people need to know right now? Or should I wait until I know some piece of pivotal information that it'll turn in that will turn it into more of a news story like the Far the next Far Cry is actually an online only game or something? I it's um but so so there's always like an interesting territory like for example uh I actually so Shadow of War just got announced the new Shadow of Mordor game and I had heard all about that a couple months ago and just it didn't feel newsworthy to me to be like the next Shadow of Mortar game is called Shadow of War. I think I off-handedly mentioned it on a podcast and people brought it up the other day because I was like oh Shadow of War. Um, but it's not something that I was going to do a Kotaku story on because if you saw a headline that was like the next Shadow of Mordor game is called Shadow of War, it's like who cares? It's just a name of a game and it's not that interesting. We'll let them have their reveal. But if I found out that the next",
            "start": 1404.8
        },
        {
            "text": "next Shadow of Mordor game is called Shadow of War, it's like who cares? It's just a name of a game and it's not that interesting. We'll let them have their reveal. But if I found out that the next Shadow of Mortar game was free to play or something that was like real news, something that people would really uh uh find newsworthy and be of the public interest to know, I think that would be a different story. But then there's also an argument to be made and something I think about all the time is like if I know something I should be telling people. If I know the next Shadow of Mord game is called Shadow of War, that's I should be telling people that. Um, so that's always that's like a conversation that Stephen and I have all the time uh about when people tell us stuff and what we should report, what we shouldn't report. It's always an interesting thing. I think that type of information, the stuff that you're going to find out anyway, is always it's fun, but it's always less le it's",
            "start": 1443.52
        },
        {
            "text": "report, what we shouldn't report. It's always an interesting thing. I think that type of information, the stuff that you're going to find out anyway, is always it's fun, but it's always less le it's something I care about way less than stuff like here's the story behind a game that you wouldn't know about unless we told you. Here's why Destiny turned out the way that it did. Here is uh the what's going on at GameStop now with all these employees doing having to do all these shitty things because of their new terrible corrupt uh company practices. Um not corrupt, but horrible company practices. Um, so yeah, it's always like an interesting balancing act and it's always an interesting conversation about whether we should leak something like that or report on a leak. Some people always say like, \"Oh, Jason, you leak this thing.\" But important distinction, I don't leak anything. People leak things to me and I report on them. Um, so that said, long-winded way of getting to the Ubisoft",
            "start": 1479.6
        },
        {
            "text": "like, \"Oh, Jason, you leak this thing.\" But important distinction, I don't leak anything. People leak things to me and I report on them. Um, so that said, long-winded way of getting to the Ubisoft thing. Uh, the Ubisoft conversation has always been interesting because every year the new Assassin's Creed pops up in our inbox and every year it's important for us to tell that story in some way. like we find some way to well we don't try what happens is if someone sends me something Stephen and I talk about it for a long time we figure out is this newsworthy is this something we need to be reporting on right so I believe the last one was Syndicate right that was the last one uh it was called Victory when it was sent to me and someone sent me a trailer and Steve and I had a long conversation about it ultimately we decided because Unity and just come out and the context of this was like Unity is busted and broken uh people hardcore Assassin's Creed fans deserve to know what's coming next",
            "start": 1520.08
        },
        {
            "text": "about it ultimately we decided because Unity and just come out and the context of this was like Unity is busted and broken uh people hardcore Assassin's Creed fans deserve to know what's coming next deserve to know that there's a new Assassin's Creed game coming. Here's what it looks like. Here's what it is. We ultimately decided to go with that. Uh for Ubisoft, that was the last straw for a while and they decided to blacklist us as a result of that. But um the the act of reporting on it and what we chose to report on was something that we saw as newsworthy. Here is where the series is going. People deserve to know that. Um we didn't post the whole trailer because we didn't we felt like that would be too much. We decided to post just a few screenshots of the trailer. Uh and we we try to do it in as responsible a way as we can while still giving the information that people deserve to know. Um by the way none of this would be relevant if the industry wasn't so obsessed with",
            "start": 1558.8
        },
        {
            "text": "try to do it in as responsible a way as we can while still giving the information that people deserve to know. Um by the way none of this would be relevant if the industry wasn't so obsessed with secrecy and uh nonsensical uh uh practices where like somehow Marvel gets away with talking about what they're making in 2020 but the video game industry cannot, which I've always found absurd. Um but yeah and Ubisoft was not happy with that. Although recently they've been a lot more chill and they decided to start working with us again which has been very good. Um and it's nice to see them not being babies uh about it. And actually to to their credit they've had a good sense of humor about it. They made some jokes about uh video game reporters leaking stuff in Watch Dogs, too. Uh and I always appreciate it when a company like if I I don't mind taking flak when if we're doing stuff that pisses you off like revealing information. Feel free to come back at us with Easter eggs in your",
            "start": 1600.48
        },
        {
            "text": "always appreciate it when a company like if I I don't mind taking flak when if we're doing stuff that pisses you off like revealing information. Feel free to come back at us with Easter eggs in your games about press sneak **** or whatever. Yeah, I love that. That that's totally warranted. And that's from that's from uh Arcane from Arcane from Prey, which they didn't that was the whole thing because that was like Pete Hines, Bethesda's marketing guy, coming out and saying, \"No, there Arcane isn't making Prey.\" Uh well, should I start that? Should I tell that whole story? I think it's a fantastic story. By the way, Pete Hines was just here a few weeks ago, so you can see his different perspectives on gaming and watching those. Did you Did you ask him about Blacklist Kaka? Uh no. We I didn't I didn't we didn't get that. Actually, the entire original podcast we recorded for the first time ever since Greg and I started doing Podcast Beyond, we lost the entire show. Pete Hines had to",
            "start": 1646.4
        },
        {
            "text": "I didn't we didn't get that. Actually, the entire original podcast we recorded for the first time ever since Greg and I started doing Podcast Beyond, we lost the entire show. Pete Hines had to come back and re-record with Greg, which was nice to do. But anyway, go on. I think this is I think this is a great story. Well, so okay, so uh Bethesda, it happened to be that in 2013 there were a lot of Bethesda stories that just happened to come up on Kotaku. Um I think the original so at first in the beginning of 2013, the first story I was really investigating that year was Aliens Colonial Marines and trying to figure out what happened there. And so I wound up reporting that story about how Time Gate, this studio, uh I think they're in Canada or we're in Canada. They wound up making the entire game for Gearbox and Gearbox had to come and and take it and throw out what they did. And long story short, it was it was story. And then after that was published someone came to me and said",
            "start": 1682.8
        },
        {
            "text": "entire game for Gearbox and Gearbox had to come and and take it and throw out what they did. And long story short, it was it was story. And then after that was published someone came to me and said, \"Hey, there are all these interesting connections between Aliens Colonial Marines and the new Doom game, which has been in development hell for a long time.\" And so I wound up digging into that and the connections there were kind of tenuous, but I did wind up writing a story about what had happened to Doom and how it had been rebooted several times. And this was 2013, so it was well before or it was just after they had rebooted what would become this version of Doom, the one that was turned out to be great inexplicably after all that. Um but anyway, so we ran that story and gave Bethesda a chance to comment as always and they commented. And then a month after that I happened to get a message from uh someone who was connected to Arcane who was like, \"People there just found out they're",
            "start": 1717.2
        },
        {
            "text": "chance to comment as always and they commented. And then a month after that I happened to get a message from uh someone who was connected to Arcane who was like, \"People there just found out they're working on Prey, which is this game that had this long history of uh being developed by the studio called Human Head.\" And then there was all sorts of drama there between Prey, uh Human Head and Bethesda. And uh Human Head claiming that Bethesda mistreated them and didn't pay milestones and was trying to buy them out. Um and so Prey 2 was had been cancelled there and Bethesda was being quiet about it and they were quietly trying to shop it around to other studios. Uh and Arcane it wound up after trying to go they tried to find another home for it uh outside of Bethesda and weren't able to make that work and then they wound up going to Arcane. And the way it was presented at Arcane was we have to call this Prey. Uh I think they called it Prey 2 at the time before they decided to just",
            "start": 1752.8
        },
        {
            "text": "make that work and then they wound up going to Arcane. And the way it was presented at Arcane was we have to call this Prey. Uh I think they called it Prey 2 at the time before they decided to just call it Prey. Uh but we have to call this Prey 2, but we want it to be a System Shock successor. Like this will be the real System Shock 3. that's what it really is going to be. Uh and some people over there I guess were upset about it. Came to me we reported on it. That was in May of 2013. And then after that uh I think it was Rock Paper Shotgun spoke to Raphael Colantonio who's the guy in charge of Arcane Austin. And he Rock Paper Shotgun was like, \"So, what's with you guys and Prey?\" And Raph Colantonio was like, \"No, we're not working on that.\" So at that point I was pissed off because they were outwardly denying this thing that I knew was true which is like **** all over my reporting and making me seem like a liar or like bad at my job. And so it wound up happening that",
            "start": 1791.2
        },
        {
            "text": "they were outwardly denying this thing that I knew was true which is like **** all over my reporting and making me seem like a liar or like bad at my job. And so it wound up happening that someone sent me some emails that he had sent to to the studio saying, \"Hey guys, we're working on Prey. We're working on Prey 2.\" Uh and then one of those emails was uh after I reported in May that they were working on Prey 2. It was now that the press sneak **** have found out about this they're going to be asking us questions. So I thought that was pretty funny. And we wound up posting those and that pissed off Bethesda even more. So now at that point it was Doom and then that and then later in the year there was more uh and this is some more interesting behind the scenes stuff because it's like so so the uh there was an ARG called the Survivor 2299 or something and it turned out to be fake right? But at the time everyone was like, \"Oh, is this Fallout 4? Is this Fallout 4?\" because",
            "start": 1830.72
        },
        {
            "text": "like so so the uh there was an ARG called the Survivor 2299 or something and it turned out to be fake right? But at the time everyone was like, \"Oh, is this Fallout 4? Is this Fallout 4?\" because everyone knew that Bethesda was working on Fallout 4 but they hadn't announced it yet. Um and when that thing turned out to be fake after like weeks of sites covering it and everyone being like, \"Oh my god, this is Fallout 4. This is Fallout 4.\" Uh people were freaking out and people were upset. And then someone at around the same time wound up sending me some casting documents uh from Fallout 4. And so we were like, \"Hey, there's a lot of newsworthiness here to be like Bethesda really is making Fallout 4.\" Uh so I had about 10 pages of casting documents. I w up posting two of those. The ones without the spoilers. Uh we some of those casting pages were like the this is spoilers for the first 30 minutes of Fallout 4 but those were like uh uh the main character's husband or wife dies and",
            "start": 1871.2
        },
        {
            "text": "without the spoilers. Uh we some of those casting pages were like the this is spoilers for the first 30 minutes of Fallout 4 but those were like uh uh the main character's husband or wife dies and his child is kidnapped which is what happens at the beginning of the game. We chose not to report that because we don't want to spoil the story of a game. We just want to tell people that it exists. And our story was like hey, Fallout 4 is exists. It's being worked on right now. We'll find out about later. Uh turns out that ARG thing was fake, but the game is really happening. So if your if your hopes were crushed after it turned out that Survivor 99 99 site was fake, now you can find some soulless in the fact that it really exists. Um, so that was the whole context of that in in a vacuum. If someone just sent us Fallout 4 info, we might not necessarily have posted it because it's like everyone knows they're working on Fallout 4, but because of the context there, we posted anyway. Long",
            "start": 1913.6
        },
        {
            "text": "If someone just sent us Fallout 4 info, we might not necessarily have posted it because it's like everyone knows they're working on Fallout 4, but because of the context there, we posted anyway. Long story short, after that, Bethesda just cut off contact entirely. It's interesting. They'll never actually admit that they blacklisted us. That's why I'm always curious if if P9 will ever say anything, if anyone ever will ask him about it, um because they refuse to acknowledge it. So, they just don't respond to our emails. They just don't send us anything. They don't invite us to anything. We're just totally cut off context since 2013 as a result of um and I see their perspective. I think what they saw was uh those three things, the Doom thing, the Prey thing, and the Fallout thing all happening within a year. Uh so, they saw it as us like targeting them maybe. uh even though all three of the stories were totally separate and all came out of different reporting uh uh like different",
            "start": 1951.6
        },
        {
            "text": "happening within a year. Uh so, they saw it as us like targeting them maybe. uh even though all three of the stories were totally separate and all came out of different reporting uh uh like different events entirely. Uh so they probably for whatever reason they decided to blacklist us. I think they were also upset because when I was trying to confirm that the casting documents were real, the Fallout casting documents that I want to posting, I sent it to someone, another developer who I guess maybe they thought was like a competitor to them. So they thought maybe I was sharing it uh with their competition to like give competition an unfair advantage even though I was just trying to make sure it was real. Um which is something I do anytime I find something out. I talked to a lot of people about it. Um so yeah. So so at the end of the day they decided to blacklist us. They decided you're not going to we're not going to deal with Kotaku anymore. In some ways, it's relief because we don't",
            "start": 1991.04
        },
        {
            "text": "it. Um so yeah. So so at the end of the day they decided to blacklist us. They decided you're not going to we're not going to deal with Kataku anymore. In some ways, it's relief because we don't have to worry about sticking to embargos and getting early copies and dealing with the sort of uh uh games industry nonsense that sometimes you have to deal with with companies. Some companies are better than others, as you guys know quite well. Um, but yeah, it's nice in some ways. The worst part, I think, is just not being able to get them to comment on anything. Like I think that there are news stories where they we everyone would benefit more if Bethesda commented on them in some way. Um whether it's some game being broken or like cheaters in a game or whatever else. Um I think it's to their detriment that they're not commenting to Kotaku on things like that. But uh as far the review copies, whatever. We can buy games and review them later. Well, that's the thing I was saying was no",
            "start": 2035.52
        },
        {
            "text": "detriment that they're not commenting to Kotaku on things like that. But uh as far the review copies, whatever. We can buy games and review them later. Well, that's the thing I was saying was no disrespect to Bethesda cuz I I don't I don't have any beef with them at all. that their their new review policy means that you not having communication with them is the end result is still you're going to get the game at the same time as anyone to go buy. So yeah, so they're not giving review copies to anyone anymore ever. Is that their they're no more. I mean they started that with Doom and then they did that with Doom 2. Yeah, I guess some YouTubers got to access it. We didn't. But I guess uh you know they know they can't control you, right? Yeah. Well, that's exactly right. And and I think so I'm just I'm just saying, you know, all things being equal, that's not a terrible outcome for you guys considering your new policies across the board. Well, I think all the time about what it would be",
            "start": 2079.36
        },
        {
            "text": "just I'm just saying, you know, all things being equal, that's not a terrible outcome for you guys considering your new policies across the board. Well, I think all the time about what it would be like if no companies gave us access to anything. And I I don't think that like I I don't envision a Kotaku without access would lose much traffic or lose many viewers, lose many readers. Well, because you guys have emphasized so smartly post-release content, right? Post- release content. Exactly. That's been a big part of our philosophy since 2013 2014. So, this has been our big thing is like we prefer to cover games once they're in the wild and once people are really talking about them. Zelda, for example, I'm playing now. My god, that game is so good. It is incredible. I'm excited to play it. I got my pre-order reluctantly. My Switch is over there if you want to check it out. I'd love to. I'd love to. So, so it's this is an incredible game. Kirk and I have been talking about Kirk",
            "start": 2114.8
        },
        {
            "text": "play it. I got my pre-order reluctantly. My Switch is over there if you want to check it out. I'd love to. I'd love to. So, so it's this is an incredible game. Kirk and I have been talking about Kirk Hamilton, my co-worker, have I have been talking about it non-stop. We briefly considered skipping all of GDC and just staying in the hotel room and playing Zelda. But uh so I've reviewed this game and it's an interesting game to review. But the thing I'm most excited about is when it's in the wild and people are playing it and discovering secrets and doing incredible things with the game that I had never even envisioned or thought about doing. Uh because that's the most exciting thing about a game like this coming out. And you see this all the time with all these interesting stories that come out of what people are doing in Destiny. For example, the most interesting Destiny stories all came out after it came out. like the the arc of destiny from when it came out to when it kind of",
            "start": 2151.6
        },
        {
            "text": "come out of what people are doing in Destiny. For example, the most interesting Destiny stories all came out after it came out. like the the arc of destiny from when it came out to when it kind of redeemed itself with Taken King to cutting out Peter Dinklage to uh Rise of Iron last year and now like this malayise period where Destiny 2 isn't out yet and everyone wants to know when it's coming and there's an entire story to that game or many many stories to that game that couldn't have happened before it came out. Before it came out it was all fluff previews about like look how incredible this game is going to be. But now that it's in the wild and it's really this big uh it's both incredible and a disaster and it it has all these good and back holiday qualities and people are doing so many interesting things with it. It's so much more interesting than it ever was before it came out. Absolutely. Uh it it's it's cool to see or it's cool I guess I' I I've known it being in the industry",
            "start": 2187.76
        },
        {
            "text": "interesting things with it. It's so much more interesting than it ever was before it came out. Absolutely. Uh it it's it's cool to see or it's cool I guess I' I I've known it being in the industry for so long, but it's cool to show uh a level of dynamics to the industry that a lot of people don't see that there's a lot of things going on behind the scenes that there's a lot of choices being made. Um, I'm interested in your in your, you know, you kind of had brought it up earlier, maybe not so not so literally, but like your take on anonymous sources and stuff like that. For instance, um, Greg and I often tell people that they can read into like if they were smart, they can read into the things we already know based on our reactions to them before they're known widely and that um, I don't really feel like it's my job, I think similar to you, to just people chirp in my ear all the time. I know a ton of things, but but is it newsworthy and is it as important as you were saying? And also",
            "start": 2228.0
        },
        {
            "text": "really feel like it's my job, I think similar to you, to just people chirp in my ear all the time. I know a ton of things, but but is it newsworthy and is it as important as you were saying? And also the reliance on at least when I was at IGN when someone said tell me like uh well I remember actually we were concurrently writing I think it was you and I were concurrently writing things about PS4 about Orbits back in the day and we're confirming things basically in our stories that the other person would then use to confirm a new thing that would bring the story to the next level more in in a collaborative kind of thing that that wasn't really meant to be that way. Remember you guys leaked the controller and then I was like I talked to my people. I was like that controller is real. Then you wrote that then you had more information then I'm like that's good. I'm going to work on that and so it was very collaborative and I like that. I miss that time. Me too. But um uh but I've also I",
            "start": 2262.88
        },
        {
            "text": "you wrote that then you had more information then I'm like that's good. I'm going to work on that and so it was very collaborative and I like that. I miss that time. Me too. But um uh but I've also I also feel like I I like people knowing that you you again the word scruples and that you you double and triple check. I never wrote anything at IGN or talk about things publicly if I didn't know them from more than one source unless it was something that was like so definitive or I'm like you know this person obviously knows and wouldn't lie to me about this. But when someone texts me and is like they're layoffs at the studio and I'm like oh that's interesting and I'll find three people that can confirm that for me and it's important to have those kinds of scruples and and I appreciate that. But how do you feel about the kind of attack on anonymous sources? Cuz this was another thing that was strange to me. Um the idea that a person can go forward and say like this person says this is",
            "start": 2296.0
        },
        {
            "text": "But how do you feel about the kind of attack on anonymous sources? Cuz this was another thing that was strange to me. Um the idea that a person can go forward and say like this person says this is true. You can trust me because of my body of work. I'm not going to reveal that person. It seems to me the insinuation is that the only way a story can ever be written again is if a person puts his name in it. Um well where where where are you seeing this attack on Oh I mean I see it I see it all the time not only with politics but with games journalism just in terms of um you know like a a site like Politico might be attacked because they wrote uh you know to anonymous staffers at the house tell us this thing. And I'm like but that's how news is always broken. Read the Wall Street Journal. Okay. Politics is a totally different entity because in politics the people leaking stuff are often uh people with weird agendas where they're leaking things intentionally and there's all",
            "start": 2328.48
        },
        {
            "text": "Journal. Okay. Politics is a totally different entity because in politics the people leaking stuff are often uh people with weird agendas where they're leaking things intentionally and there's all sorts of leaking for like leaking is used as a strategy in politics in a way that doesn't really happen in games despite the constant conspiracy theories about Ubisoft intentionally leaking Assassin's Creed every year or whatever. Um which is nonsense and never actually happens. What is the strategy behind that? Right. There is a strategy behind it. It's nonsense. Um in games that doesn't really happen. And and in political journalism, I think as a reporter, I mean, I've never covered politics, but I think as a reporter, you have to be a lot more careful about the motives of your sources. Often times when I'm talking to someone who is giving me information, I am also asking about their motives. And often it's because they think something is cool or because they disagree with the amount of",
            "start": 2366.32
        },
        {
            "text": "times when I'm talking to someone who is giving me information, I am also asking about their motives. And often it's because they think something is cool or because they disagree with the amount of secrecy in the industry and they believe that more people should know about things. Um you'd be surprised how often it's like, \"Hey, I'm working on this thing. It's really cool. I want it to be out there.\" and that's why they come to me. Uh but again, that's a different type of story than layoffs. Layoffs, you don't really need a motive. It's just they want that information out there because it's it's necessary for people to know and for people to know that people are looking for jobs. And um with other stuff, with stuff that's more like Krytek, uh I don't know if you remember when Krytek was not paying anymore, which is still happening, by the way. I um sadly, I I literally just got an email today or yesterday from someone else who's like, \"Yep, still not paying.\" Why do people even",
            "start": 2401.76
        },
        {
            "text": "was not paying anymore, which is still happening, by the way. I um sadly, I I literally just got an email today or yesterday from someone else who's like, \"Yep, still not paying.\" Why do people even stay there? That doesn't even matter. It's well I mean it's it's not so easy to find another job, especially if you're in Frankfurt, Germany, where there aren't ton of gaming companies, right? Um so something like that is like really like I don't need to know your your I don't need to question your motives if you're telling me you haven't been paid. Like I know that you want that information out there because you want to publicly pressure your company. If you work at GameStop and you feel terrible about this circle of life practice and you come to me, I don't need to know your motives. Um all that said, I think using anonymous sources is an interesting practice. I think that a lot of times it's going to depend on the journalist and the amount of trust they've cultivated with their",
            "start": 2439.04
        },
        {
            "text": "Um all that said, I think using anonymous sources is an interesting practice. I think that a lot of times it's going to depend on the journalist and the amount of trust they've cultivated with their audience. In gaming, it's really interesting because uh not a lot of people do that sort of reporting. And I think that uh there are a lot of gaming websites that always post stuff based on anonymous sources that are anonymous to the writers of those articles as well. Where it's like often times around E3, you'll see random no-name websites, not like the professional organizations like IGN and GameSpot, but smaller websites uh that sometimes get picked up by IGN and GameStop uh are just like here's a list of bullet points of what we're going to see at Sony's conference this year. and it's almost always nonsense and it's based on anonymous sources, but it's based on some random Gmail account that emailed the author of the article. So, it's not based on sources who the writer is keeping",
            "start": 2474.16
        },
        {
            "text": "almost always nonsense and it's based on anonymous sources, but it's based on some random Gmail account that emailed the author of the article. So, it's not based on sources who the writer is keeping anonymous. And I think that's an important difference uh in in the type of anonymous you're giving. So, when I talk to someone, there have been rare cases where I've run stuff based on someone who wouldn't tell me who they were, but that's very very rare. More often, it's someone who I'm keeping anonymous, but I know who they are. Right. Exactly. That's that's my situation. That's a different answer. So uh I also think that there comes a point where like as a journalist you have to cultivate all this trust and trust can be broken very easily. Um I try to make it clear when I screw something up uh that I screw something up and tell everybody that and be as transparent as possible about that because I believe that's the best way to make sure that people know that I'm being honest and open",
            "start": 2517.44
        },
        {
            "text": "uh that I screw something up and tell everybody that and be as transparent as possible about that because I believe that's the best way to make sure that people know that I'm being honest and open with them. So when I make a mistake, when I get something wrong, I try to be as open as possible about that. But a lot of times I think people have grown to trust that most of the time I'm going to be right when I report something based on anonymous sources because I do my due diligence. Um it's been interesting because with Destiny, for example, Destiny is one of my big beats. It's one of the games that I cover most often. Uh last year, January of last year, I reported that Destiny 2 had been delayed out of 2016. And immediately all the big Destiny YouTubers were like, \"What is this nonsense?\" Like someone was like, \"Uh my uncle's friend told me that Destiny 2 is getting delayed.\" And there's a lot of skepticism. And then of course the next year, Activision or the next month, Activision",
            "start": 2556.16
        },
        {
            "text": "Like someone was like, \"Uh my uncle's friend told me that Destiny 2 is getting delayed.\" And there's a lot of skepticism. And then of course the next year, Activision or the next month, Activision had their financial call and was like, \"Destiny 2 is coming in 2017 instead of 2016.\" And everyone was like, \"Oh okay. Jason Jason knows what he's talking about. He's not going to publish this stuff without any base whatsoever.\" And that said, there have also been times when I screw up. Recently, I I wrote something about Destiny that I don't want to get into because it was wrong and or Bungie said it was wrong and they came out and denied it. And so uh I had to be as transparent as possible and be like, \"Hey, Bungie says this is wrong. I'm going to take crap for it. I have to admit to it.\" Um those if that happened often, I might lose my credibility as a reporter. So it's something I have to be super careful about. and anyone who's trying to report uh that might be another reason",
            "start": 2597.92
        },
        {
            "text": "Um those if that happened often, I might lose my credibility as a reporter. So it's something I have to be super careful about. and anyone who's trying to report uh that might be another reason that you don't see a lot of reporting for like this because there's a lot of risk to reporting on information that isn't coming from a press release that's coming from people who are just talking. Um things can change, things might not be 100% accurate. Things might be like someone heard it from a friend of a friend and it's sometimes you might be talking to two people or getting their information from the same source. So you think that your information is double source but it's really like all coming from one person and that one person could be wrong. So there are a lot of weird It's a lot of work. I I it is and and and you are you are so above and beyond what I was even doing in the sense that um well first of all I never really thought about the idea when I talk about anonymous sources. I",
            "start": 2635.68
        },
        {
            "text": "I I it is and and and you are you are so above and beyond what I was even doing in the sense that um well first of all I never really thought about the idea when I talk about anonymous sources. I always thought it was kind of I in my own mind I always was like well inherently I know who the source is. But it is interesting like the cold war deadrop mentality of like well I don't even know who gave me this crap briefcase and I never I never had that situation. Deepthroatgmail.com. Yeah. Exactly. Exactly. Um but uh it is interesting that um the the industry is still so nent and so the the press is even more embionic than obviously what the New York Times or the Wall Street Journal does in political coverage since the 1780s in the United States and another world. Yeah. Yeah. Exactly. So it is it is maturing and and not just that but gaming press started with magazines that were paid for by the company like Nintendo Power run by Nintendo. Yeah. Um Yeah. And it's so funny about the",
            "start": 2675.92
        },
        {
            "text": "So it is it is maturing and and not just that but gaming press started with magazines that were paid for by the company like Nintendo Power run by Nintendo. Yeah. Um Yeah. And it's so funny about the anonymous sources thing. I never really thought about that when I'm saying that. And I'm like I'm wondering now if if people are understand every every year at E3 I actually I do a lot of stories in Kentucky that are like this is how you can tell a rumor is fake or like look at this fake this is where this fake rumor came from cuz I find that stuff really fascinating and every year like I remember I I don't really want to pick on small sites because they're small sites and uh whatever. I mean I'd rather pick on sites like GameStop GameSpot for covering those sites. um uh uh punch parallel I would say parallel but uh yeah so so um you see sites with like these bullet point lists of like here like Sony is going to announce this game and it's big and beautiful and it's like full of all these",
            "start": 2713.44
        },
        {
            "text": "say parallel but uh yeah so so um you see sites with like these bullet point lists of like here like Sony is going to announce this game and it's big and beautiful and it's like full of all these adjectives and hyperbole and if you stop for a second and thought hey wait a minute how would this person even have all this information or like doesn't it sound too good to be true often times the rumors that are fake are the ones that sound too good to be true um for example before the Switch launch there was like a 4chan post that had all these uh game titles that seemed realistic and didn't seem too good to be true. It wasn't like Metroid Prime 4, Pikmin World, whatever. It was all real like like snipper clips or like one two Switch. And people are like \"Wait a minute. I I saw that and I was like the reason that I know this must be true is because it's not hyperbole at all. It's like what Nintendo would actually announce. And who would make up a game called Snipper Glass? But anyway so",
            "start": 2749.76
        },
        {
            "text": "like the reason that I know this must be true is because it's not hyperbole at all. It's like what Nintendo would actually announce. And who would make up a game called Snipper Glass? But anyway so so that's the type of thing where it's like if someone comes out and is like \"Here's Gorilla's new IP. it's incredibly looking incredible looking and then here's like uh Killzone 5 and here's Uncharted 7 and whatever. If it's like this list of uh fantasies and it's clearly fantasies then it's probably fake. And so that stuff is coming I think. I mean I can't say for sure but uh most of the time it's coming from people who the authors of these small sites might be young they might be in college they might be uh not have a lot of experience and so they just read a list that seems credible from some anonymous email account and then post it. Um I have definitely I've talked to some I remember talking to the owner of a Nintendo fan site once that ran this rumor. I think it was",
            "start": 2790.0
        },
        {
            "text": "credible from some anonymous email account and then post it. Um I have definitely I've talked to some I remember talking to the owner of a Nintendo fan site once that ran this rumor. I think it was called Nintendo Fusion and it got picked up by some big gaming sites cuz sometimes big gaming sites are their news departments are run by freelancers or like people who don't uh uh who have quotas of articles they have to fill. So they just find whatever's on the internet and take it. Um so this Nintendo Fusion thing went around and I talked to the guy who ran it in the first place and he was like \"Oh yeah this just came from an anonymous email account.\" I was like \"Dude yeah that's not that's not uh that's not good enough right? It's it's\" And obviously turned out to be fake. Yeah. And it's those are the cases where and I think that sort of stuff happening all the time tends to bring down people's trust of anonymous sources in the first place. uh because they don't they they don't",
            "start": 2830.8
        },
        {
            "text": "it's those are the cases where and I think that sort of stuff happening all the time tends to bring down people's trust of anonymous sources in the first place. uh because they don't they they don't know the difference between my anonymous sources your anonymous sources and nintendofanboy.com's anonymous sources. That's a really great point. Uh that I think is a a fair point that scores more points I think for the side that's dubious of of all these things. Um it's funny too and I I that information I've learned in the past that I've not necessarily written about but I knew um from people that know things that would absolutely know things. And to your point and things end up changing and things end up being wrong right? Um and uh uh a good example um is Days Gone which I knew about for a long time. It had a totally different name forever. And when it was announced I was like \"What?\" Yeah. You know like like how did you not know that? But but actually the the description of",
            "start": 2870.4
        },
        {
            "text": "for a long time. It had a totally different name forever. And when it was announced I was like \"What?\" Yeah. You know like like how did you not know that? But but actually the the description of the game was perfect from two and a half years ago. Um the the one uh interesting well there's a lot of interesting things. We're I could talk about this **** all day. It's good to have you here. Um one of the uh interesting kind of components uh of this too is um is this idea of clickbait. And I'm curious like what you think of that because um in my mind uh it's obviously valuable economically to these sites to do it. But doesn't it kind of We're talking about trust. We're talking about building a cadence with an audience. Sure. Isn't it kind of like cutting off your nose to spite your face in a way? Well how would you define clickbait? First of all uh it's a good I can give you my definition. Yeah please do. Well cuz I think that people use the word clickbait to mean things that",
            "start": 2915.44
        },
        {
            "text": "in a way? Well how would you define clickbait? First of all uh it's a good I can give you my definition. Yeah please do. Well cuz I think that people use the word clickbait to mean things that they do not like. And I hate that because I don't think that's what clickbait mean. I think clickbait is something where you see a headline and then the article uh attached to the headline doesn't deliver on the headline's promise. So if if I ran a headline saying uh Red Dead Redemption 2 is coming in October and then the article itself said uh when is Red Dead Redemption 2 coming? We don't know. That would be clickbait because it's the definition of like me presenting something and then not delivering on it. But I think people use the word clickbait to describe things that uh they just don't like. And I think at Kotaku we use a lot of grabby headlines. Headlines that are meant to grab people's attention like uh uh I don't know I can't think of any on the top of my head but stuff that is",
            "start": 2958.96
        },
        {
            "text": "like. And I think at Kotaku we use a lot of grabby headlines. Headlines that are meant to grab people's attention like uh uh I don't know I can't think of any on the top of my head but stuff that is like like uh uh we want people to click. We are not going to tell you not to click on our articles. We want you to see something on your Twitter feed or your Facebook feed and click on it. um people as long as it delivers as long as our article delivers on the promise of the headline then I don't see it as clickbait because if you see something that's like I don't know the top 10 uh Mass Effect characters who like to **** uh people would say oh that's such clickbait but I don't think that's clickbait if you you see it and the article is the top 10 characters Mass Effect characters that like to **** then then you are clicking something and you're not being baited it's like okay you might feel compelled to click on that but that just means it's something you might find interesting well",
            "start": 2997.36
        },
        {
            "text": "to **** then then you are clicking something and you're not being baited it's like okay you might feel compelled to click on that but that just means it's something you might find interesting well it That is an interesting point Jason and a fantastic point because I think I do use it more pjoratively in the sense that um you know I read some big gaming websites or some it's in sports it's in politics it's whatever ESPN does it where I'm like what is the value of this? That's and I guess that is though a subjective. Well that's the thing. Your your problem might be with the value of a post and you might be like why does uh this IGN need to run this the list of the top 10 Mass Effect characters you like to **** But that's a different question and that's not clickbait. that's like I don't want this kind and and to me it's like that to me is very uh uh I don't know it's it's kind of a a pointless complaint because it's like if you don't like something don't click on it. Like I",
            "start": 3038.24
        },
        {
            "text": "I don't want this kind and and to me it's like that to me is very uh uh I don't know it's it's kind of a a pointless complaint because it's like if you don't like something don't click on it. Like I think that that the internet is so full of stuff that I don't really have the bandwidth to like be looking for things to get mad about and then click on them because I want to get mad about them. If I see a headline that says the top 10 Mass Effect characters who like to **** I might be interested in that. But if I'm not interested in it I just won't click it. Like there's no reason to get angry over that or or even think about it more than a second. I think I think what would encapsulate because I agree. I don't know that I' I've been angry sometimes. I guess I angered at a lot of things. You read my Twitter account but but I guess what it encapsulates is my fear that um well we were talking before about the again the cadence and kind of this this body of work that you put out there",
            "start": 3074.8
        },
        {
            "text": "You read my Twitter account but but I guess what it encapsulates is my fear that um well we were talking before about the again the cadence and kind of this this body of work that you put out there um as an individual but but organizations also put out that body of work. if you if you can't you know there are certain websites I just can't go to anymore because I'm like what is I can't rely on you guys to tell me anything I need to know like why why is you know I'm a normal video game player I guess I'm not so normal been in the industry for a long time but I'm a normal consumer of gaming content gaming media video games themselves and I go to these places and I'm like I can't rely on you to to tell me the things I really need to know what makes you think that you can't rely on because well we're talking about timing right so if you're if you're looking at if I have 10 minutes and I'm scrolling through GameSpot's newsfeed for instance um and I'm seeing 0 stories that are pointing",
            "start": 3113.92
        },
        {
            "text": "well we're talking about timing right so if you're if you're looking at if I have 10 minutes and I'm scrolling through GameSpot's newsfeed for instance um and I'm seeing 0 stories that are pointing towards old news or deals of the day that they're clearly getting Amazon revenue from or all these kinds of things. Good way to make money that is but uh and I see one story worth clicking in there then I'm like but this is a kind of a waste of my time. And so I I keep that in my mind and I'm like so maybe it's not you're right in the sense that I'm using a loose definition of clickbait but maybe I'm more worried about Well I definitely am more worried about um the the the resonance of this stuff because we we re I personally rely on certain websites to tell me what's going on but I also rely on them to keep everything on the up and up as things get slowly metered away from them and towards the Wild West we began the conversation with. And if no one can trust them and find what",
            "start": 3150.0
        },
        {
            "text": "also rely on them to keep everything on the up and up as things get slowly metered away from them and towards the Wild West we began the conversation with. And if no one can trust them and find what they're looking for then they're going to think it doesn't exist. And then the only solution is what we don't want which is which is wild west YouTube **** or whatever where no one's accountable. So I think it's a more it's a it's it's not the the clearest it's a very nebulous uh kind of discussion that we're having I think. But but I think that that fear is felt by a lot of people because I can't like when I go to the Ringer for instance which a **** phenomenal website right? Or Grantland back in the day phenomenal website. I can rely on them every day to deliver something thoughtprovoking. I don't have to scroll for I don't know. You really like Boogie Cousins fanfiction. And there are things there I don't like at all. Well it reminds me of old Grantland stuff where I was",
            "start": 3185.12
        },
        {
            "text": "I don't have to scroll for I don't know. You really like Boogie Cousins fanfiction. And there are things there I don't like at all. Well it reminds me of old Grantland stuff where I was like \"This shit's funny about the uh the marriage piece like the mar the marriage announcements in the New York Times.\" Very funny. Not for me but high culture and interesting right? Sure. Sure. That's a great one. I love the Ringer. I I go that's one of my go-to websites for sure. Yeah. So like I rely on them but when I when I go to uh well partner side of yours like Deadspin or whatever which I think is kind of devolving more into like well there's some interesting stuff. I used to love Dead Spin some interesting stuff but then it gets very political and all this kind of stuff. I'm like but I can't rely on you anymore. And I feel like I need someone to rely I need the right. That's why I rely on you. I rely on Clpic. I rely you know there's no gaming website that can be that one thing",
            "start": 3219.2
        },
        {
            "text": "I can't rely on you anymore. And I feel like I need someone to rely I need the right. That's why I rely on you. I rely on Clpic. I rely you know there's no gaming website that can be that one thing for everyone because gaming has proliferated so much that it's so so many different factions. And I was just talking about this at dinner last night because uh uh our sister sites like uh uh IO 9 for example they know that every single week people are going to be talking about Game of Thrones for example and they can do all these recaps and they know that's the go-to place for Game of Thrones stuff. But in gaming there's so many different like games that people play. Like you might have a subset of readers who play nothing but League of Legends every day. You might have a subset of readers who are looking forward to Horizon and Zelda and single player experiences. You might have people who just play Rocket League. Um there's so many different communities and it's very difficult for a",
            "start": 3249.12
        },
        {
            "text": "who are looking forward to Horizon and Zelda and single player experiences. You might have people who just play Rocket League. Um there's so many different communities and it's very difficult for a general gaming site to be able to cover all those communities because there are interesting things happens. I mean there's Hearthstone news every single day but you won't find every gaming site covering that Hearthstone news because it's impossible and it's most gaming sites are not equipped for that. And if you're a Hearthstone player you might just have to go to the Hearthstone Reddit and that's where you get all your reliable information. So it really there's so many different interests that it's really hard to do that. Um I think our general MO on Kotaku is be interesting. Find the interesting stories. Don't cover things that aren't interesting. Uh for example we don't spend a lot of time like looking at Phil Spencer's Twitter feed and covering the things that he says. Um because",
            "start": 3286.08
        },
        {
            "text": "stories. Don't cover things that aren't interesting. Uh for example we don't spend a lot of time like looking at Phil Spencer's Twitter feed and covering the things that he says. Um because that's not interesting. And it's not interesting when a game developer says \"Oh Scorpio is going to be the coolest thing ever. It's going to be the best best system ever.\" or someone says PS4 Pro is going to be super powerful one day. Whatever they people say we uh try to just focus on things we find interesting. And sometimes people might call that clickbait because we might be covering sex uh in gaming. We might be covering the way that YouTubers do things or uh uh PewDiePie for example. A lot of people don't like that coverage. Uh if we find it interesting it's going to go on the site though. And and our goal is to make a front page that at least if you you might not find I don't expect every Kotaku reader to find every story every headline on the front page interesting. But if as long",
            "start": 3326.16
        },
        {
            "text": "And and our goal is to make a front page that at least if you you might not find I don't expect every Kotaku reader to find every story every headline on the front page interesting. But if as long as they're seeing it and finding most stories or like a good chunk of stories that they find interesting then I consider us to be doing our jobs. I don't consider Kotaku to be the place to go to if you want every piece of granular gaming news which I know is what some people are looking for but we're just not interested in being that. Like if you want every piece of every time developer says something if you want to see that just go to Neogaf or like Reddit our games or something. I find Neogaf to be the most valuable. They hate it but I find it I mean I find it to be the most valuable. Uh it's really good at aggregating news and they often have news faster than most gaming sites because it's so easy for someone there. Well because first of all they have thousands of people can create",
            "start": 3364.72
        },
        {
            "text": "it's really good at aggregating news and they often have news faster than most gaming sites because it's so easy for someone there. Well because first of all they have thousands of people can create threads there but also because someone there could just quick click post thread post something immediately it's up there as opposed to working for a gaming site where it's a whole process. CMS write a bunch of paragraphs go to the CMS get an image write a headline go through editorial uh uh guidelines and etc. etc. So uh but also Neo goth like you'll find stuff that we would never cover on Kotaku because it's so granular and only interesting to a very specific subset of hardcore gamers as opposed to more general interest stuff more stuff that has interesting conflict interesting drama interesting ideas interesting stories. Um so yeah uh as far as like finding one gaming website that is just like going to provide you with all the information you need to know I don't",
            "start": 3402.72
        },
        {
            "text": "drama interesting ideas interesting stories. Um so yeah uh as far as like finding one gaming website that is just like going to provide you with all the information you need to know I don't think we're in that world anymore. I don't think there is any website that will I mean look at like even GameSpot now. Even Game Informer uh the magazine's website is covering movie stuff and entertainment general general entertainment stuff because they know that their readers are are coming to them for stuff that goes broader than gaming and they're interested in writing about geek culture. Yeah the ven diagram there is is is it is interesting. It's not it's funny because Kotaku I remember in 01 when I first started Kotaku we got a lot of flack from readers who were like stick to gaming news whenever we would cover if we were like hey uh this the new Star Wars movie is is really interesting or whatever. No I guess then there weren't a new Star Wars movie but whatever it was like a",
            "start": 3444.0
        },
        {
            "text": "news whenever we would cover if we were like hey uh this the new Star Wars movie is is really interesting or whatever. No I guess then there weren't a new Star Wars movie but whatever it was like a comic or something like Evan Narcissist or from work wrote about comics all the time. Um now that doesn't happen but I think we kind of pioneered that and now you see every gaming site. So there's no more there's no such thing as a gaming site anymore that just covers video games. Like there's always every gaming site now covers gaming culture sometimes TV movies etc. etc. Um and it's funny we've actually pulled back on our non-gaming coverage in some ways while other sites have doubled down on it and are covering movies all the time now. So it's funny to see that uh uh transformation and the landscape has just changed so much since even since when you guys left. It's just been it's changing so drastically every month and every week the way the gaming news is is handled. Um and I",
            "start": 3486.8
        },
        {
            "text": "and the landscape has just changed so much since even since when you guys left. It's just been it's changing so drastically every month and every week the way the gaming news is is handled. Um and I don't really think it serves readers to to be a website that is like covering every single granular thing that you see on the PlayStation blog or whatever. Like I let PlayStation handle that. It's people always used to say um I remember when YouTubers first started popping up or like when sites like Sony started the PlayStation blog and Ubisoft started the Ubisoft blog or whatever. People said \"Oh now gaming sites are screwed because those site those companies can just cut out the middleman.\" But it's like if you're just a middleman then you're not doing your job as a journalist or as a gaming outlet in the first place. Like you need to be providing value to readers that means telling interesting stories. And just a net result of that is that not everybody who reads Kotaku is going to",
            "start": 3525.92
        },
        {
            "text": "outlet in the first place. Like you need to be providing value to readers that means telling interesting stories. And just a net result of that is that not everybody who reads Kotaku is going to like every story on Kotaku. That's inevitable. That's I mean I don't but I but I don't and I I work for this site. Like I don't love every site every story. I love every story you write Jason. I I don't know. You should look through my body of work cuz I I think a lot of people know me for some things but I've written all sorts of dumb **** on. I've written all sorts of like like sometimes I will just post YouTube videos. Sometimes I will just post like dumb headlines with with silly things on them. Uh part of our big thing is we like to experiment and push the boundaries. And I think some people uh uh in the conservative world of gaming news are like like oh I don't want to see that. Like look away. And I don't mean conservative as in politically conservative. I mean conservative as in",
            "start": 3568.32
        },
        {
            "text": "uh uh in the conservative world of gaming news are like like oh I don't want to see that. Like look away. And I don't mean conservative as in politically conservative. I mean conservative as in like the way it used to be done. Yeah. Yeah. Yes. Exactly. I and I I agree with you and I I think you've hit on an interesting point because you and I are both sports fans as well. And I think it's the way these sites uh like ESPN deal with verticals and then the verticals underneath those verticals and so on and so forth. And you can't get too granular. I think that they did a nice job there with being like well there's just a Jets blog and we're both Jets fans. Well so so with Dead Spin in particular I wanted to bring up one point. So that has been interesting because when Gawker uh uh died when when we sold the company and we had to kill Gawker.com I think there's a lot of political stuff that our writers at the company wanted to do and it didn't have a home anymore. So it kind of uh",
            "start": 3603.68
        },
        {
            "text": "when when we sold the company and we had to kill Gawker.com I think there's a lot of political stuff that our writers at the company wanted to do and it didn't have a home anymore. So it kind of uh spread out among Gizmodo and Jezebel and Dead Spin. So I think you're seeing a lot more of that at Despin. Uh until they find another home or maybe because I mean I love Dead Spin to death. I think they're a fantastic website. I see what you're saying. Like I if you go to Dead Spin and you're like I just want a sports website or like I just want that that Dead Spin sensibility but I don't want them to talk about politics. I I can see why you would be upset but it's also the way I see it is like the if the people who run a site want to write about something they care about then they're totally entitled to do that. That's true. I mean I I think it's totally tangential. We don't have to get down it but I think the interesting thing I saw with Dead Spin that was kind of not my last",
            "start": 3637.12
        },
        {
            "text": "totally entitled to do that. That's true. I mean I I think it's totally tangential. We don't have to get down it but I think the interesting thing I saw with Dead Spin that was kind of not my last straw but I was just kind of like what are you guys doing? Was that the the whole Ted Cruz thing on the on the on Twitter that went on and I don't like Ted Cruz at all. Uh and uh you know I'm a conservative but I don't I don't like uh yeah and whatever. He totally blew them up and like actually won that argument and I tweeted out I'm like that I never liked Ted Cruz until right now because you guys are just so **** smug. Um it was really funny. But um we're running late. Do you have a little bit more time? Yeah of course dude. I could spend here I could I could stay here all afternoon. We could do a 4-hour show. Let's do it. Let's **** do it. Uh I I I feel like having you here only to talk about the procedural **** is is is fascinating for me and I think for a lot of our",
            "start": 3678.08
        },
        {
            "text": "We could do a 4-hour show. Let's do it. Let's **** do it. Uh I I I feel like having you here only to talk about the procedural **** is is is fascinating for me and I think for a lot of our audience but you're one of the great minds in the industry too. And I want to pick your brain about Keep going. Yeah. Yeah. You love it. You're getting you love this. I want to just pick your brain about like how you think some people are doing or some companies or some Sure. Yeah. Hit me. So So how's Sony doing? It seems like they're in great shape right now. Yeah I mean I It's incredible that you still can't change your PSN name. Yes I know. I'm morardi-N. So incred. That's funny. Um it's incredible that they just like destroyed the Vita which is a system that you and I both love. Um man and just the way that they mistreated that system is just such a shame. Oh did you do you want me to **** on all these companies? Cuz I totally I want you to give me I mean I want you The PS4 is in",
            "start": 3712.72
        },
        {
            "text": "just the way that they mistreated that system is just such a shame. Oh did you do you want me to **** on all these companies? Cuz I totally I want you to give me I mean I want you The PS4 is in great shape. The PS4 is in fine shape. Uh no. You say whatever you want about any of the companies. No one shits on Sony more than I do. If anyone listens to the PS I Love You knows. Uh I can't win. I can't win by the way with anyone because either I'm a fanboy or I hate them too much. Um yeah. So PS4 is in good shape. What do you think about the Pro? Um I have no interest in that. I think that I I was actually on my podcast Kadaka Splitcreen. Go pre-order now. Subscribe. Subscribe now. Um you uh uh Kirk and I Kirk my co-host and I were doing predictions for 017. And one of mine is that uh Sony will find some killer app that is like makes the PS4 finally worth owning. Whether it's like it could be like Red Dead 2 runs at 30 frames per second on the PS4 but 60 on the PS4 Pro. But",
            "start": 3755.12
        },
        {
            "text": "uh Sony will find some killer app that is like makes the PS4 finally worth owning. Whether it's like it could be like Red Dead 2 runs at 30 frames per second on the PS4 but 60 on the PS4 Pro. But so far we haven't seen anything that has justified like I don't have one because I see no reason to buy one yet. I'm looking for for a reason to buy one. Um it's funny that you bring up Sony and the PS4 and all that stuff because I just uh tweeted I don't know if you saw this last week I got into like a Twitter war with the Microsoft fanboys because I tweeted oh the people that have the things in their Scorpio symbol on their name because I tweeted that uh PS4 is in so much better shape than or Sony is in so much better shape than Microsoft is and Microsoft needs to do something drastically uh with Scorpio because if they just sell Scorpio as the most powerful console ever and they don't have the software or the games or the interesting ideas to support that they're just going going to",
            "start": 3793.28
        },
        {
            "text": "Uh with Scorpio because if they just sell Scorpio as the most powerful console ever and they don't have the software or the games or the interesting ideas to support that they're just going going to be a mess and that system is not going to do anything. Um and then immediately like all the Xbox fans jumped to me. I had to block a lot of people on Twitter. Uh I blocked a lot of people with I actually remember retweeting your thing saying if you need a list of people to block or like you I blocked so many of them as well. Oh my god it's incredible. And I'm not not saying that Sony fanboys anyone who's like loyal to a billion dollar corporation is just terrible. Like if you feel the need to defend Oh man. Um but then one of them tweeted at Phil Spencer and he like responded because I don't know why he responds to all those fanboys. It just seems like a bad idea. Anyway long story short gives them power. Yeah. Yeah. Um the PS4 is in so much better shape and it's such a dominant",
            "start": 3833.12
        },
        {
            "text": "don't know why he responds to all those fanboys. It just seems like a bad idea. Anyway long story short gives them power. Yeah. Yeah. Um the PS4 is in so much better shape and it's such a dominant like if you look at the spring between Horizon, Neo, um what else? Persona. Yeah man. Persona. And the the lineup on the PS4 is just blowing uh Microsoft. Especially if you're into Japanese games it's just the PS4 is just the as well really which I think Japanese support a huge pillar of YPS sports and just Microsoft just does not have that at all. Um they've tried I do give them credit not so much with Scalebound which seemed like an aborted kind of thing but back in the Xbox 360 era they certainly did try. Lost Odyssey was really cool. Dragon. Yeah. Um they tried didn't work. Uh but it I don't know. It's Sony Sony's in good shape with the PS4. I wish that they had treated the Vita better. I wish they hadn't done that **** proprietary memory card thing which is Do you think",
            "start": 3873.92
        },
        {
            "text": "but it I don't know. It's Sony Sony's in good shape with the PS4. I wish that they had treated the Vita better. I wish they hadn't done that **** proprietary memory card thing which is Do you think that they'll do another one? I I I keep saying this. I'm interested I'm interested in what you think of this cuz I keep saying this. People think I'm crazy. I'm like if there's a company nuts enough to do it again it's Sony and obviously they're R&D and they're figuring things out and things leak about how they're looking at you know a new one or whatever. And I'm like that's not I don't think that means anything. I'm not that's not surprising to me that they have engineers tinkering. Um but my argument is this and Greg doesn't agree but I'm interested what you think. Let's assume Switch let's assume 3DS continues to proliferate. It's about 60 million units or whatever. Let's continue 18 more months to that. Plus the Switch is even though they keep calling it a console it's",
            "start": 3917.68
        },
        {
            "text": "let's assume 3DS continues to proliferate. It's about 60 million units or whatever. Let's continue 18 more months to that. Plus the Switch is even though they keep calling it a console it's really a handheld. Yeah. and Sony getting lots of indies as was just announced today as today which is great. Um I can't imagine a a corporation that was in that space that played in that space successfully with the PSP to the tune of 80 million units Vita 14 million maybe. So definitely a drop off. I can't imagine them seeding that entire ground to their competitor without fighting. Like why would you just leave? It's like having a hill that you're standing on just be like we're just going to walk away and you can have it as opposed to like why don't you fight? Well I think they I don't know based on their comments comments from Shuhei Yoshida and other executives at Sony it seems like they blame mobile phones for the Vita not doing well which I think is kind of a wrong argument. Uh I think they",
            "start": 3952.64
        },
        {
            "text": "their comments comments from Shuhei Yoshida and other executives at Sony it seems like they blame mobile phones for the Vita not doing well which I think is kind of a wrong argument. Uh I think they they should blame themselves. Um yeah you I remember you were talking about my p the piece that I wrote uh about that. But um yeah so so I don't know. I I really couldn't tell you. It's so hard to predict where what they would do or where they would go. Now if you asked me gun to my head like \"Do you think Sony will do another Vita?\" I would say no just because the Vita was such a massive failure to the point where they can't even mention it at press conferences anymore because it's a joke. It's an embarrassment to them. Um so I can't see them. I mean they definitely wouldn't I don't know. I It's so hard to say. Uh it depends how phone games do. It depends what kind of integration they can do with the PS4. Uh if they found some way to make it so you could take PS4 games on the go",
            "start": 3988.64
        },
        {
            "text": "I It's so hard to say. Uh it depends how phone games do. It depends what kind of integration they can do with the PS4. Uh if they found some way to make it so you could take PS4 games on the go anywhere that would be really interesting. That would be awesome. Um I don't know. There are a lot of possibilities there. I I don't see it happening anytime soon. Maybe in 5 10 years they'll try something completely different. Maybe we'll they'll find some way to do it that uh uh isn't like the whole console gaming on the go thing the way that the Vita was where it's actually just shitty versions of console games um like Resistance or whatever, Call of Duty. So yeah. Uh I don't same studio responsible. I don't think so. I don't think anytime soon. That's my guess and I have no inside information on this. I'm just guessing. I would guess not anytime soon. Yeah I think I think that they'll have to watch the market and see and respond and I think they'll be ready to respond in either direction",
            "start": 4028.08
        },
        {
            "text": "on this. I'm just guessing. I would guess not anytime soon. Yeah I think I think that they'll have to watch the market and see and respond and I think they'll be ready to respond in either direction if they want to. It dep and also if Switch is like a massive success you could see Sony and Microsoft and other companies trying to copy that like what they what happened with Wii and PlayStation Move and connect and so it really depends. the the industry moves in such uh uh trend chasing ways that whatever the new trend is whatever next big trend like I wouldn't be surprised to see Sony trying to make their own version of Pokémon Go for example. Um that's the new trend that I think we're going to see a lot of people try to chase this year. Uh so yeah it really depends how invisible go. Yeah invisible go. Yeah that'll that'll really take off. Uh I it was funny. I remember when it was Sony Cambridge I think was when they still existed and we're tweeting out uh we had an AR monster",
            "start": 4070.4
        },
        {
            "text": "Yeah invisible go. Yeah that'll that'll really take off. Uh I it was funny. I remember when it was Sony Cambridge I think was when they still existed and we're tweeting out uh we had an AR monster hunting game on PSP or whatever. Yeah. No one no one cares. Um well you brought up Switch. I'm I'm curious what you think about the prospects of Switch cuz to me I mean first of all I I I can't imagine this thing is going to succeed. Like I just don't see it. I I don't I I it's not like this anti Nintendo thing. I'm actually a huge old school Nintendo fanboy as a lot of people know. But I also look at the trends and and if you remove the Wii as the anomaly every console has sold worse than the last one. The NES would if you remove the Wii is the bestselling Nintendo console. NES second you know N64 third GameCube fourth Wii U fifth. So like if you remove that Wii anomaly which was an anomaly with a poor attach rate poor software sales. Do you I I I think that it's a success for",
            "start": 4109.76
        },
        {
            "text": "know N64 third GameCube fourth Wii U fifth. So like if you remove that Wii anomaly which was an anomaly with a poor attach rate poor software sales. Do you I I I think that it's a success for them if it passes Wii U's numbers. Like I I don't I don't I can't imagine it's going to do much more than that. Yeah I don't know. That's so interesting because the NES Classic was such a massive like unexpected success for them. Um I wish that the Switch Well so the hardware itself is it feels very much like uh the first iteration of what will be improved upon because it's it's it's got so many small problems that are just really annoying. The kickstand is really bad and there are all sorts of weird configuration issues and like there's a left Joy-Con thing. Yeah. Which I'm scared of cuz I didn't order my controller so Man you got to get one of the Pro Controllers. That's the best way to play it. I'm hoping that by the time this episode airs I'm hoping that the uh they will have said",
            "start": 4146.16
        },
        {
            "text": "didn't order my controller so Man you got to get one of the Pro Controllers. That's the best way to play it. I'm hoping that by the time this episode airs I'm hoping that the uh they will have said something or found some way to patch and fix the left con the left Joy-Con controller problems. But yeah I can't even play it with the Joy-Cons on my when it's in TV mode because my left one keeps disconnecting from the thing. That's ridiculous. Um so it's got a lot of problems issue. They're going to be in a lot of trouble. Oh my god that would be like the new Red Ring of Death. But Zelda might be the best Zelda game they've ever made. it it's one of the I think it's going to go down as an all-time classic uh on the level of Ocarina of Time this uh Breath of the Wild. So that and like a new Mario game and Splatoon and all these other games I think that is what could make the big difference uh to a point where well it's also the type of thing where the Wii U was such a disaster in so",
            "start": 4187.84
        },
        {
            "text": "Mario game and Splatoon and all these other games I think that is what could make the big difference uh to a point where well it's also the type of thing where the Wii U was such a disaster in so many ways. Like I don't know if you've ever gone back and looked at the Wii U commercials or the Wii U announcement. So in 2011 when they announced the Wii U at E3 uh they played this video that was showing off the controller of the Wii U and they kept saying the new controller and it never actually made it clear in this video that it was a new console. So nobody knew. And from even today if you go up to someone on the street and you're like or go up to someone who's like casually interested in games and you say \"Do you did you ever were you ever interested in a Wii U?\" They would be like \"You mean the Wii?\" They would be like \"Is that a Wii accessory?\" But the Switch is just marketed so much better and has such an easier to understand concept that I think it it's got appeal beyond",
            "start": 4223.52
        },
        {
            "text": "\"You mean the Wii?\" They would be like \"Is that a Wii accessory?\" But the Switch is just marketed so much better and has such an easier to understand concept that I think it it's got appeal beyond uh the Wii U what the Wii U ever had. Um just the fact that it's called the Switch which is a cool name. Just the fact that it it's got this easy selling point which you can just put it into the dock and take it out and play games on the go. Um the fact that you can play games anywhere. All those uh points uh selling points are really appealing to people and I think it could do better than the Wii U did just because of that. I don't know if it'll sell 100 million units but uh I think it'll do better than the Wii U at least. Uh yeah my my my conundrum is this with it. It has a big It's gonna have a big 3D Mario game which we're really excited. I'm a little freaked out by the 3D Mario games. It it just looks the him next to the real person. It was like super funny. It's like that",
            "start": 4266.32
        },
        {
            "text": "gonna have a big 3D Mario game which we're really excited. I'm a little freaked out by the 3D Mario games. It it just looks the him next to the real person. It was like super funny. It's like that Simpsons episode where Homer is like standing among the real people. Yeah it's really funny. Like I I it was a little unsettling. Uh but uh my my conundrum is this. Are these when we talk about Smash Brothers when we talk about Mario Kart when we talk about Splatoon when we talk about Zelda we talk about Mario. Is it just the same 10 million people you're talking about? In other words like is it is it it's not we brought up a Venn diagram before. It's just a circle because when I look at the Wii U I'm like well by all Wii U had everything. It you know uh it just didn't have a 3D Mario game basically. But it's not like that. You know everyone's like \"Mario Kart sold 8 million units.\" I'm like \"Yeah everyone that owned a Wii U had Mario Kart.\" But the Wii U wasn't like an",
            "start": 4307.44
        },
        {
            "text": "Mario game basically. But it's not like that. You know everyone's like \"Mario Kart sold 8 million units.\" I'm like \"Yeah everyone that owned a Wii U had Mario Kart.\" But the Wii U wasn't like an appealing console to own. Like if you did you own a Wii U? Uh Greg owns one. I never bought one. if you like it's not fun to use. It's not you have to pick up the controller and like figure out if the controller is charged and plug that in and the controller feels like this big like unwieldy piece of plastic and it gets sticky and like the dusty on the screen and then you have to figure out if the Wii U sensor is on top and it's just like there's nothing fun about it in a in an way that I think and the Switch I think has uh a lot more of that uh it feels more fun to use in a way that the Wii U wasn't. like you you can play with the Joy-Cons you can take them up and down and it's like you don't have to worry about multiple controllers. You just take this one thing and you put it in the",
            "start": 4341.52
        },
        {
            "text": "U wasn't. like you you can play with the Joy-Cons you can take them up and down and it's like you don't have to worry about multiple controllers. You just take this one thing and you put it in the dock and then you can either take out the things or like use your Pro Controller or whatever. It's a lot more uh uh streamlined. It's a lot more convenient. The menus are sleeker and quicker than the Wii Us where the Wii U's menus just took like 10 seconds to load. Um it's just a better system all around. I think from what I've seen so far uh the Wii U just had so many issues and and as to your point about whether it's the same people. Look at Pokémon Go. I mean Pokémon Go was a cultural phenomenon not just among Pokémon fans but among random people. My girlfriend played it. Exactly. It's like people even if you didn't grow up playing Pokémon you knew what Pikachu was and you could recognize some of these Pokemon. So I think there's a a large demographic especially of younger",
            "start": 4379.44
        },
        {
            "text": "It's like people even if you didn't grow up playing Pokémon you knew what Pikachu was and you could recognize some of these Pokemon. So I think there's a a large demographic especially of younger people who may be interested in the Switch may see the new Zelda or the New Super Mario or some of their other favorite games Stardew Valley or something like that on the Switch and be like \"Hey I want one of these things.\" Um especially if they can get Minecraft on there uh games like that games that have that kind of uh uh widespread appeal. And the fact that it will be able to play games that aren't typically portable like Skyrim and let you play them on the go I think is a really big selling point. Imagine if you had Skyrim on your Vita. That would be fantastic right? So this is going to be out there a lot of the the best comparison is like this is going to be the Vita except with Nintendo games and with actual support and it it does have you do have to have memory cards",
            "start": 4416.48
        },
        {
            "text": "is going to be out there a lot of the the best comparison is like this is going to be the Vita except with Nintendo games and with actual support and it it does have you do have to have memory cards which is annoying but they won't be $100 memory cards. So this is like if anything I think this could be like the Vita except with actual mass appeal which I think is really cool. Uh I think it has potential. But then again uh I'm a very bad prognosticator. I thought the Wii U was going to do well too. So who knows? I don't know anything. I I I think the gap between Zelda and Mario can be injurious. Uh and but I think the big trump could be if they you know this rumored Pokemon game like a real solid Pokemon game I think will sell many millions of units. So um yeah we I'm going to wait and see. Uh I I want them to do Well that's the thing is like I hate when people are like \"Well you're so negative about X Y or Z.\" I'm like but just calling it like I see it. I want",
            "start": 4454.32
        },
        {
            "text": "to wait and see. Uh I I want them to do Well that's the thing is like I hate when people are like \"Well you're so negative about X Y or Z.\" I'm like but just calling it like I see it. I want every like I think a healthy gaming industry means that we're in great shape. So one if someone's struggling it's the same thing with Microsoft where getting out sold more than two to one. I don't look at that as a positive. First of all I don't own stock in **** any of these. I don't care you know? Like everyone's like \"Oh play must be excited.\" Do I care? Yeah. And it's like so so Microsoft just announced this like monthly subscription program. I'm sure I saw that. Which is **** great. Which is incredible. And it's like that's the type of thing you do when you're on the ropes. And I would like to see them force Sony to have to make their own version. Like if Microsoft caught up and Sony was like \"Oh **** like the Xbox One is catching up to the PS4.\" Then Sony would have to",
            "start": 4499.28
        },
        {
            "text": "I would like to see them force Sony to have to make their own version. Like if Microsoft caught up and Sony was like \"Oh **** like the Xbox One is catching up to the PS4.\" Then Sony would have to stop like just sitting back and coasting on their own success and start making their own innovations and letting people change PSN names. I know. Can you imagine the day when we I did get a Greg and I did get a uh uh two pieces of information over the last year that uh about name changing right? Someone sent us an hour long conference call that someone recorded like a visual conference call where they're like \"We're working on it.\" Uh and they were going to roll it out at some point. I'm sure they are. Apparently from what I understand it's a massively complicated issue because the way they they develop it. Imagine. I mean the fact that they haven't done it till now to me signals that it's a very complicated. I think it has literally something to do with the fact that like uh you know",
            "start": 4532.64
        },
        {
            "text": "they develop it. Imagine. I mean the fact that they haven't done it till now to me signals that it's a very complicated. I think it has literally something to do with the fact that like uh you know if your name is Jason Shrier for instance on on PSN like everything just points to Jason Trier not a unique ID code that so then it breaks leaderboards. It breaks everything like for and I think I think I as far as I understand I think what they're going to do is basically just say like this is the cut off. Like everything is going to be broken if you go back and play Super Stardust on PS3. Yeah the leaderboard is going to be **** up. Like we have to you know. Yeah. I mean whatever. As long as they maintain the PS4 stuff like so 2013 and forward then people won't care that much. Might might be some complaints but whatever. The other good news was in the Unreal Engine 4 or whatever notes they were saying like you have to start dealing with PSN IDs with this different integer",
            "start": 4568.32
        },
        {
            "text": "Might might be some complaints but whatever. The other good news was in the Unreal Engine 4 or whatever notes they were saying like you have to start dealing with PSN IDs with this different integer and so like now I think Sony's now communicating to the engine creators as well. There we go. So so we'll see what happens. Uh I heard from source that I don't know if it's reliable or not that maybe summer but we'll see. We'll see. I' I've literally heard for years it would be. I think it would be better for PSX but but uh they won't even talk about Vita like you said at E3 so we'll see. Yeah man. Um what do you think of We brought up Microsoft a little bit but um and I've actually really kind of dug some of the innovations they've done with uh I think backwards compatibility was awesome feature that I'm so frustrated Sony won't do because of their investment obviously in Gai and stuff like that PlayStation Now. Uh I think this announcement today very EA access like program that",
            "start": 4602.08
        },
        {
            "text": "feature that I'm so frustrated Sony won't do because of their investment obviously in Gai and stuff like that PlayStation Now. Uh I think this announcement today very EA access like program that they're going to do with games is really awesome. Um I like their I like just little things like the controller suite making your own custom controllers. They're doing a lot of things but they're struggling optically compared to PS4. Where do you like do you see Scorpio if it's just an iterative console maybe have a little bit more power than than PS4 Pro? Do you see them kind of trucking along? Because when I think about their catalog of games coming up it's pretty st it's pretty like not it's just I don't want to be a dick. I don't want to come sound like fanboy but it's just not good. It really isn't. And also I mean just the stories I've heard about like what it's like to work with them as an independent developer under them as a publisher it just sounds like a nightmare. It",
            "start": 4638.64
        },
        {
            "text": "It really isn't. And also I mean just the stories I've heard about like what it's like to work with them as an independent developer under them as a publisher it just sounds like a nightmare. It sounds like they cuz they're such a big company and they have just by nature they're so unorganized. And by big I mean I think Microsoft employs 100000 people or something like that. So this is a company with so many different branches and so many different middle managers with their own like ideas and their own visions and their own egos etc. etc. So it seems like it's a nightmare to make games with them. Um which as a result means they don't have a lot of first-party games. And you saw with Scalebound like they're dropping like flies. Phantom Dust dropping like flies. Um so at this point unless they have some deck of surprises in the works that they're going to announce alongside Scorpio I don't see that system doing well unless they find some great way to innovate. I think",
            "start": 4672.48
        },
        {
            "text": "point unless they have some deck of surprises in the works that they're going to announce alongside Scorpio I don't see that system doing well unless they find some great way to innovate. I think what they should do is work with Valve to create a Steam Machine that they release and find some way to make money off of it the way that they never could on the Windows Store. Um and because Valve Cachine just never worked. Uh it was just a disaster marketing wise and nobody knew what a C machine was. But mostly I think because Valve wouldn't do it themselves right? Because they wouldn't do their own version and they would Why would anyone believe in it if you won't even build your own? Exactly. And they're just like open garden mentality. It had a lot of problems. that I think Microsoft is perfectly positioned to make a living room PC that feels like a console but has the kind of flexibility of a computer which I think would be the incred like an incredible system and a way to",
            "start": 4711.6
        },
        {
            "text": "is perfectly positioned to make a living room PC that feels like a console but has the kind of flexibility of a computer which I think would be the incred like an incredible system and a way to distinguish Scorpio from the pack. Like I think if they're if Phil Spencer and crew really think that just selling it as the most powerful console ever with like Halo 6 and Gears of War 5 and whatever they're just going to be in the same place they are now. Nobody is cares that much that they would buy a $500 console unless there's a killer app that they really need on it. Um just having the most powerful console ever isn't going to do anything for them which is uh agree. Yeah I I I'm pessimistic. I would like to see them come out and be like \"Hey we have all these awesome games that are coming to Scorpio as well but I just don't see it right now.\" And yeah like you said their lineup is just meager. It's pretty dismal. I mean that's that that's actually well people would have seen it",
            "start": 4749.6
        },
        {
            "text": "to Scorpio as well but I just don't see it right now.\" And yeah, like you said, their lineup is just meager. It's pretty dismal. I mean that's that that's actually well people would have seen it by now but the Colin Was Right this week is about uh last week I did Xbox One and how I'm I'm hopeful that they they can do something but this one's about how PS4 really is dominating and specifically how poor the first party lineup was for the first 18 months or two years from first and second party and how the seeds have been sewn in such a way that man they just have such a dominant lineup of games coming out over the next three years. It's really really insane. I mean to the clip of three massive AAA exclusives a year just from first party. Not to mention, like you said, the Neos of the world that they're identifying or the Personas that for some reason Microsoft's not securing on their console even though it's published by a third party. Like it doesn't especially because they're in bed",
            "start": 4791.92
        },
        {
            "text": "that they're identifying or the Personas that for some reason Microsoft's not securing on their console even though it's published by a third party. Like it doesn't especially because they're in bed with that third party and with another game in Halo Wars. So it doesn't really make any sense. The interesting thing about E3 to me with Microsoft is that there's mixed canaries in mixed coal mines because when they pushed up their E3 conference, I was like, that's a **** aggressive move because now they're trying to get away from Sony. uh this idea that they can have a long, 4-hour period for people to celebrate what they're talking about as opposed to being basically eclipsed within the next few hours by Ubisoft and then so on and then and then Sony but then you see the E3 leaked floor plans and they've just abandoned their massive space and they have a booth the size of Ubisoft's uh while Sony and Nintendo are dominating West Hall. They're like are those are those final? Are you",
            "start": 4825.68
        },
        {
            "text": "plans and they've just abandoned their massive space and they have a booth the size of Ubisoft's uh while Sony and Nintendo are dominating West Hall. They're like are those are those final? Are you sure those are like final? I mean I saw I mean they they I saw them on GAF and stuff like that. I I didn't I've not done any digging of them on my own, but I assume that they wouldn't uh they didn't come from somewhere random. Um it seems like they have a small space and so I'm like this doesn't vibe with with a with a company that wants to show some hardware that wants to get people circulating through a large booth with lots of offerings unless they want to do their own thing, which is possible too like a very EA like thing, right? But also, if I if I were Microsoft and I wanted to do like a make a big splash on Scorpio, I would just do something in May that is that beats E3 and then use E3. I see. I see. I see. I see. So, you're not saying uh I thought you meant like EA is kind of was",
            "start": 4859.36
        },
        {
            "text": "a make a big splash on Scorpio, I would just do something in May that is that beats E3 and then use E3. I see. I see. I see. I see. So, you're not saying uh I thought you meant like EA is kind of was doing their own thing at preempt it, right? Yeah. I mean, that's what that's what they should do if they really want to make a splash. I mean, yeah. Otherwise, they're just going to get lost among the throng. But that's what you see. That's what they did with Xbox One and that's what Sony did with PS4 is just announce it at a at an event before and then talk about it. Uh yeah, you need they need a dedicated event for that thing if they really want to make a splash with it with the announcement and talk about cool stuff, show games running on it and then talk about it more like do the whole price and launch date at E3. That seems like the way to go uh if they really want to get people talking about it for a while. Do you feel like it's a mistake that they're putting all their games on",
            "start": 4899.36
        },
        {
            "text": "price and launch date at E3. That seems like the way to go uh if they really want to get people talking about it for a while. Do you feel like it's a mistake that they're putting all their games on PC? Cuz I feel like this is a massive wonder. I I I don't I understand that they're getting from from an Xbox sales perspective. Exactly. If if you care about pushing hardware, right then why like because Horizon, Bloodborne, on you're not going to play them on PC, right? That's why you buy a PS4, but if I had, you know, I look at some of these games, I'm like, I would have liked to play Quantum Break. I would I actually own an Xbox One, but I would I like to play Quantum Break or I'd like to play Crackdown 3, but I just put it on my laptop. Well, so the funny thing is from a gamer's perspective, that is fantastic. against like you don't need to buy an Xbox One because you can get a PC and a PS4 and then a Nintendo console and you can play anything. But from a uh uh Microsoft like wanting",
            "start": 4935.52
        },
        {
            "text": "that is fantastic. against like you don't need to buy an Xbox One because you can get a PC and a PS4 and then a Nintendo console and you can play anything. But from a uh uh Microsoft like wanting to sell Xbox's uh perspective, it just seems like uh yeah, terrible move because there's no such thing as an Xbox exclusive anymore. It's like an Xbox and PC exclusive. But then the flip side of that is that if they're making money selling games on the Windows Store and selling and they're making more money off software than they are off hardware, then it makes sense as a move. So if they don't care as much about selling Xboxes. So it really depends like what their grander motive is. Um but it's interesting. It's interesting to see and look at the console wars and and look at how angry people get on Twitter. It's it's very entertaining. It's uh Yeah, it is. It is interesting. I've been I've been told, by the way, we have to record game regular show in a little while. Right, Kevin? Yeah. Well",
            "start": 4970.32
        },
        {
            "text": "on Twitter. It's it's very entertaining. It's uh Yeah, it is. It is interesting. I've been I've been told, by the way, we have to record Game Regular Show in a little while. Right, Kevin? Yeah. Well, we we'll wrap it up. I I don't want to take too much more of Jason's time. Uh I told you I'm here for 4 hours. I'm waiting for more filading. That's what I'm here for. I'm going to fade him. Everyone look away. Well, all right. Let's Let's talk a little bit about uh Kevin, give me like a five-minute warning if we really have a hard wrap-up. Okay. Well, let's talk about the Jets quarterbacks. Okay. Well, we can do that. I I my I wore this I wore this for uh flashing you guys. I feel like that's too depressing. I feel like the fact that the best case scenario is Mike Glennon is like the most depressing thing. Terrible. And the worst case scenario is Cutler. Yeah. Um, all right. Let's wrap up with a few other We talked a little about Ubisoft and Bethesda. I'm kind of curious about your your",
            "start": 5013.44
        },
        {
            "text": "depressing thing. Terrible. And the worst case scenario is Cutler. Yeah. Um, all right. Let's wrap up with a few other We talked a little about Ubisoft and Bethesda. I'm kind of curious about your your thoughts on Activision. I was really interested. Um, not that they've ever released like a massive amount of games uh a year, but uh they they used to release many more, but really only two games this year, but they're both huge. Um, what do you think their future is? Because these guys really do seem to be stuck on the and I say this with all due respect as a huge Call of Duty fan. I play Call of Duty every year. um they really seem to be stuck on like we are going to we are going to run this into the ground. So you're going to either take it or leave it but we are running this game into the ground and obviously they're selling enormous amounts of copies every year. They have a flying **** right now. They Call of Duty Infinite Warfare was the bestselling game of 16. Do you think that's",
            "start": 5047.76
        },
        {
            "text": "ground and obviously they're selling enormous amounts of copies every year. They have a flying **** right now. They Call of Duty Infinite Warfare was the bestselling game of 16. Do you think that's going to blow up in their face eventually? Cuz to me it's I actually really had a lot of respect for what Ubisoft did. As much respect as you have for a publisher I guess. Uh yeah being like all right like we get it. Yeah. we're going to go away for a little while. We're not We know we can probably sell five million units of another Assassin's Creed game, but we can sell 15 million and we don't have to be as crazy as Rockstar is where they're like, we're just not going to do anything. So, I'm curious about what you The main motivation for Ubisoft pulling out of a year of Assassin's Creed was Unity and just that shipping broken and them wanting to avoid that. And then Syndicate sales were really disappointing for them as a result of Unity um because nobody wanted to get burned again. So, I",
            "start": 5086.8
        },
        {
            "text": "and just that shipping broken and them wanting to avoid that. And then Syndicate sales were really disappointing for them as a result of Unity um because nobody wanted to get burned again. So, I think that was the main reason that they skipped a year. Um, cuz that decision was made after Unity. It wasn't made like right because that that sort of thing takes a long time to develop. Um, that said, with Call of Duty, I there haven't been any real disasters. I mean, some people hated Infinite Warfare because they didn't like the setting or whatever. They and the multiplayer Jon Snow was terrible. Um, but uh that doesn't mean that Call of Duty is in a bad place necessarily. And I think that all they have to do is come out and be like, \"Hey, here's another World War II game. Here's another like or like something some other war that like doesn't get covered as often or whatever um to bring Call of Duty fans back into people buzzing about the series again.\" So I I don't think that series is",
            "start": 5120.32
        },
        {
            "text": "or like something some other war that like doesn't get covered as often or whatever um to bring Call of Duty fans back into people buzzing about the series again.\" So I I don't think that series is in a bad place right now. Um from a customer's perspective, it's kind of like why am I buying the $6 game every year? So I I I get that. But also Call of Duty fans don't really care. Call of Duty fans get so excited about the new Call of Duty every year that they've become just part like accustomed to the ritual the way Madden fans are accustomed to just buying a new $60 Madden game every year. And I I almost feel like as someone who plays a lot of games, I feel kind of detached from the perspective of someone who just plays Call of Duty every year. Um I do have some friends who are more casual gamers and are more like, \"Hey, I'm going to buy the new Call of Duty this year.\" And it's always interesting to hear their perspectives because they don't care. they don't pay attention to, they",
            "start": 5164.96
        },
        {
            "text": "gamers and are more like, \"Hey, I'm going to buy the new Call of Duty this year.\" And it's always interesting to hear their perspectives because they don't care. they don't pay attention to, they don't even know what Activision is. Like they don't care that a new Call of Duty is coming out every year because they just buy it and that's what they want to play. Um they don't pay attention to the industry or like industry trends or anything like that. So it's it's interesting to see. Um I do think that uh a large part of Activision's business is Blizzard and their just string of ridiculous successes like Overwatch. It wasn't just a success, it was like a cultural phenomenon. Yeah, it really is amazing how how big that game is. It's really incredible. Bigger than I ever would have imagined. Yeah. Bigger than anyone thought. Uh and the fact that Activision and Blizzard are the same company. The fact that they that Activision has this other enormous amount of revenue helps support them. Um",
            "start": 5207.2
        },
        {
            "text": "Bigger than anyone thought. Uh and the fact that Activision and Blizzard are the same company. The fact that they that Activision has this other enormous amount of revenue helps support them. Um they did just lay off a bunch of people near their latest financial call. I think in preparation for like a slower year of releases. It is interesting. They've kind of pulled out of the license game business, which I think is probably better for everyone cuz who really needs another crappy license whatever game? Especially when you have guys like Marvel with Square Enix and all them doing and trying to do ambitious things, right? Well, we'll see about doing it right. Hopefully doing it right. Um hopefully doing it differently. Yeah. Doing it doing it in an ambitious way. Um so so who needs licensed movie games? I don't really feel the the anything missing there. And then we'll see how Destiny 2 turns out. We'll see if that is is is as much of a mess as Destiny 1 was when it first launched.",
            "start": 5245.36
        },
        {
            "text": "movie games? I don't really feel the the anything missing there. And then we'll see how Destiny 2 turns out. We'll see if that is is is as much of a mess as Destiny 1 was when it first launched. Yeah I I suspect that that excitement will be very high for Destiny 2. Oh my god, the amount of people who just ask me every day for information about Destiny 2. I have no information about Destiny 2. Stop. Has nothing to say. So leave him alone. I cannot comment on that. Uh and rumors and speculation at the moment. So uh that game I think is going to be enormous. Like that I think might rival Red Dead Redemption 2 as biggest theme of the year. A dynamic fall with that with those two games. It's going to be crazy. You actually I I I hear a lot of like people not wanting any part of that release window. Like look at Shadow of War August. They for reason. Brilliant. Brilliant place to put that game. I when I saw that release date cuz I uh obviously leaked on Target and then the next morning I",
            "start": 5285.6
        },
        {
            "text": "window. Like look at Shadow of War August. They for reason. Brilliant. Brilliant place to put that game. I when I saw that release date cuz I uh obviously leaked on Target and then the next morning I woke up and it was real. I don't know if they pushed their plans up or they were just that was the intent. No, they were always going to announce the answer. Um so uh that's why my assumption I'm like I don't know that you can work that quickly but uh well that's why Target leaked it cuz they were preparing pre-order. Exactly. Um but I was like I love that release date. What a great release date. And I I I kept saying that I feel like Sony will release a first party game like maybe Days Gone or something in that window. But then the more I think about it like why why would you? Especially cuz I kind of feel like Rockstar I wouldn't be shocked if there was some sort of you know going back to the Agent **** and all that kind of stuff like nebulous things like business deals gone ary that",
            "start": 5325.68
        },
        {
            "text": "I kind of feel like Rockstar I wouldn't be shocked if there was some sort of you know going back to the Agent **** and all that kind of stuff like nebulous things like business deals gone ary that I feel like Rockstar I feel like Red Dead Redemption 2 is going to be a PlayStation well the persistent rumor that I kept hearing was that it was supposed to be announced at E3 of last Sony's conference but like I don't know something about that doesn't feel right and it feels like one of those rumors that maybe just was wrong because Rockstar's way of announcing it was so specific with the Twitter images and the teaser trailer and all that stuff that I don't know. I don't know. I don't know if there's any grass in that. I heard it from a like I think I said on one of our shows I heard it from someone who's very reliable that that was true. But I agree with you that I'm always a little dubious to that kind of stuff because I know that everyone assumes that Sony's always like you can like",
            "start": 5356.0
        },
        {
            "text": "someone who's very reliable that that was true. But I agree with you that I'm always a little dubious to that kind of stuff because I know that everyone assumes that Sony's always like you can like Sony watches Microsoft press conference in the morning and then they change things and my sources there are like that's not even really possible. We've already rehearsed this. It's all um but the weird thing the harbinger of that was that the Days Gone thing at the end I was like this is totally supposed to be here. Um and I think it has something to do with the fact that that shooting happened. Um at least the rumor is that the shooting happened and therefore they didn't want to have USA Today and Wall Street Journal talking about how someone's walking into a saloon shooting everyone up. But that wasn't even the trailer. Then the trailer they showed had had no shooting in it. It was just like like landscapes of of Red Dead. So that to me like put all the cold water on that rumor",
            "start": 5393.04
        },
        {
            "text": "But that wasn't even the trailer. Then the trailer they showed had had no shooting in it. It was just like like landscapes of of Red Dead. So that to me like put all the cold water on that rumor because that if they were meant to show that teaser trailer, then nobody would have said anything about the shooting cuz it had no shooting. Yeah I don't know that that I I'm skeptical that that was true even though I also heard it at floating around at E3. Yeah. Yeah. Who the **** knows where these things where the provenence of this **** even is. Um what do you what is your take on uh on on Square Enix right now? I I feel like I'm really interested in them. I feel like they have a very strong Japanese kind of development. I think Final Fantasy 15 I mean I played it for 10 hours. I wasn't really into it. It's not really my kind of game. Um but I've always been really impressed with their uh kind of this very slow build and this backd door development to making actually like a very",
            "start": 5425.76
        },
        {
            "text": "really into it. It's not really my kind of game. Um but I've always been really impressed with their uh kind of this very slow build and this backd door development to making actually like a very western focused kind of studio family um with with Hitman with Tomb Raider and with all these kind of things. I feel like they're in great health and I feel like but then you have things like I am Setsuna which I **** loved and all these other things. They just hired Hideo Baba which was crazy from Namgo studio which I was kind of heartbroken about because I love Tales but the new Tales is probably the best one. Yeah Brazer is great. I'm 30 hours in I had to had nothing to do with that. Yeah. And I had to That's true. And he did have something to do with his sister which I was really kind of warm up. Um it's good to talk to someone that knows what the **** they're talking about this. Everyone looks at me like I faces when I games that I don't like to play when my fiance is in the room",
            "start": 5462.56
        },
        {
            "text": "warm up. Um it's good to talk to someone that knows what the **** they're talking about this. Everyone looks at me like I faces when I games that I don't like to play when my fiance is in the room cuz she's like she's like, \"What what is the main character wearing?\" Yeah. She's like, \"Why is Yeah. Why does this cat have a hat on and a magic book?\" Um but uh what are your feelings on them? Cuz I feel like they're in great shape. I mean I I do think that their Japanese development seems to be wanting um in the sense that I feel like Final Fantasy 15 had a very bright burn in originally, but when I saw the breakdown, which I think is cool that MPD is doing by platform now every month and and seeing Tales of Berseria ahead of Final Fantasy 15 even though the game came out a couple months ago that surprised me um and showed a little bit of weakness I think in sales uh long-term sales as opposed to like Final Fantasy 7 which is maybe not a great example but that came at a burn of",
            "start": 5495.04
        },
        {
            "text": "that surprised me um and showed a little bit of weakness I think in sales uh long-term sales as opposed to like Final Fantasy 7 which is maybe not a great example but that came at a burn of several years because it was a cultural phenomenon as opposed to this when everyone's like, \"Oh, just it's out now. Right. Um it's almost like they removed this albatross by releasing it and maybe now they can be free to do other although that they have Tabata and Crew still working on more and more content for that game which is kind of crazy at this point. Seems like two different companies to me sometimes when I look at when I look at the Japanese stuff and I'm like why are you announc Final Fantasy 7 everyone's like oh Final Fantasy 7 R is going to come out. I'm like no it's not. It's like nowhere near being released 3 is like nose. It is crazy. It is very like counterproductive to do that. I don't know. I I think they just see it as like we want people loving Square Annex again and so we",
            "start": 5530.8
        },
        {
            "text": "near being released 3 is like nose. It is crazy. It is very like counterproductive to do that. I don't know. I I think they just see it as like we want people loving Square Enix again and so we have to talk about this stuff and and not realizing that it really makes people aggravated. But then again, like part of me is like, hey, this is what I want. I want more companies talking about things and not keeping them secret and pretending that they're like like NSA secrets. So like if you want to announce Kingdom Hearts 3 and then everyone can know that this is coming in, 019 or whatever, then that's great. That's better for everyone. Um but you're right, it is like two different companies. you have the IDO side and then the uh the Square Enixing side and like um I think that we're going to see a lot more of Tomb Raider. Uh I think that series is doing really well for really awesome games. I think we're going to see a lot less of DSX. We're not going to see much more of that. And",
            "start": 5564.16
        },
        {
            "text": "to see a lot more of Tomb Raider. Uh I think that series is doing really well for really awesome games. I think we're going to see a lot less of DSX. We're not going to see much more of that. And that last one flopped. Not a bad game. Our own Nick Scarpino played and loved it, but but it didn't sell. Yeah. And I heard that they canled a sequel that they were planning to make for it. Um much to the dismay of some people who work in Idis Montreal. And so those guys are working on uh a Guardians of the Galaxy game in addition to the new Tomb Raider, Shadow of the Tomb Raider, and which is the one that leaked on the Montreal subway, which one that leaked on the subway, which is hilarious. Man, I feel so bad for whoever was sitting there with the subway uh with this PowerPoint presentation or whatever opening. Um and Crystal Dynamics obviously. Yeah they seem to have a pretty strong group. They have that like mobile department that's making the Go games, which is which are really cool.",
            "start": 5604.32
        },
        {
            "text": "whatever opening. Um and Crystal Dynamics obviously. Yeah they seem to have a pretty strong group. They have that like mobile department that's making the Go games, which is which are really cool. Yeah they're great especially on VA. Yeah there you go. Um and Hitman was like our one of our games of the year and came out of nowhere to become this incredible uh shocked by how much I liked it. Like they're not my kind of game. I hate see like our episodic games. I **** hate them. Um it doesn't feel like an episodic game. But people kept coming to me Jason over and over again being like, \"You have to play this game.\" And I'm like I'm like fine. So I I went and downloaded just the Paris map. I think it was free or something at some point before I went to Square and got a full code and I was like wow this is really really interesting. Now I've only played it for 15 hours. I have to move on. As you know it's always you always have to move on. But the funny thing about that game and",
            "start": 5642.4
        },
        {
            "text": "I was like wow this is really really interesting. Now I've only played it for 15 hours. I have to move on. As you know it's always you always have to move on. But the funny thing about that game and as I've told some of the audience is my girlfriend um getting more into games not not a gamer by any stretch imagine. She's an ER nurse never touched a video game at all before we started dating. Obsessed with Hitman. Like I I find her at 4 in the morning playing Hitman on and I'm like, \"Okay, so we have a little strange this very hardcore game with with stat progression and all that.\" I'm like, \"You understand?\" So funny. Great. That's so funny. Um that's cool though. All right. So we touched on Square, we touched on Ubisoft, we touched on Activision, and we touched on uh the first parties, THQ. We talk we talk about THQ there. THQ Nordic or whatever the **** they're called now. What the hell was that all about? When I when I saw that announcement when Nordic Games obviously got a ton",
            "start": 5677.68
        },
        {
            "text": "THQ. We talk we talk about THQ there. THQ Nordic or whatever the **** they're called now. What the hell was that all about? When I when I saw that announcement when Nordic Games obviously got a ton of THQ's IP and then Darksiders etc. and then also got the name which I thought they would just throw away. I'm like what are you? When we were at GameStop Expo I was like what in the **** Well you saw this big banner. Like why would you want to associate yourself with that name? It's like you're killing yourself. Yeah. It's like someone coming out of me like we want to be Circuit City. Like we we're to a failed brand. Yeah. It's so interesting. So such a bizarre decision. Those guys seem like nice guys than Nordic guys. But I don't understand that at all. I don't either. And especially with the numbers. I I can't remember the name. I want to say it was something like they said they had like 16 games in development or something. You have more games in devel You have two twice as",
            "start": 5715.84
        },
        {
            "text": "with the numbers. I I can't remember the name. I want to say it was something like they said they had like 16 games in development or something. You have more games in devel You have two twice as many games in development as Sony. Yeah. Did you see they're making like a PS4 Xbox One version of Locks Quest? That DS game? I did see that. That's so such an interesting game. I um weird move. Let's get That's going to sell like 0 copies. Yeah I guess I guess I I feel like maybe they're trying to with Dark Ciders with some of the other IPO. I feel like they're trying to start up a um well similar to what I think Deep Silver strategy is which is to like have just this hardcore uh association where it's like well these guys don't publish games to make money. And for some reason that means something to me. What you know Deep Silver like getting in bed with Mighty Number Nine like had like oh god and that Homefront game which was **** awful. Um but they they seem to like don't",
            "start": 5755.12
        },
        {
            "text": "something to me. What you know Deep Silver like getting in bed with Mighty Number Nine like had like oh god and that Homefront game which was **** awful. Um but they they seem to like don't really take any dings for it because at least they try as opposed to like the very cold Activision that's like we're going to go for the sure thing only. And I feel like for hardcore audiences that's that must resonate because otherwise I don't really understand some of these decisions. I don't know about that. I feel like now if I see a Deep Silver game I'm going to be like \"Wait a minute.\" And think think twice before buying a Deep Silver game or like looking at a Deep I'll tell you that my my opinion of them has changed a little bit just just specifically with Mighty and and Homefront because those games were so bad. No one wanted to like Mighty Number Nine more than Homefront Homefront had such a troubled development. Kitech UK and those guys like not getting and becoming Juster. Yeah",
            "start": 5789.68
        },
        {
            "text": "those games were so bad. No one wanted to like Mighty Number Nine more than Homefront Homefront had such a troubled development. Kitech UK and those guys like not getting and becoming Juster. Yeah that that game went through some some serious hell. So I feel I feel for them. But yeah but that game is terrible. And Mighty Number Nine I I feel less sympathy for because that just seems like a a guy in a studio that just make terrible terrible decisions about everything. Like uh the whole what was it called? Red Ash. right after the the anime and the game kind of combination they were doing. Yeah. I it's interesting cuz Inafune I mean I'm a huge classic Mega Man fan. Um and Inafune is one of my heroes in the industry and it's so sad to watch someone you love and you know personally to some some extent. I just can't defend it at all anymore. Especially especially with with uh Mighty which was so **** bad. Like I I just can't I can't overstate how bad it was. It's really and and especially",
            "start": 5823.36
        },
        {
            "text": "extent. I just can't defend it at all anymore. Especially especially with with uh Mighty which was so **** bad. Like I I just can't I can't overstate how bad it was. It's really and and especially coming from Indie which is a great studio like it's a weird dynamic there. I kind of feel bad for him um in a sense but it is his own doing. I mean like you know they tried Soul Sacrifice and all these other things but I mean maybe it's true like uh Kameha says that he's a businessman not a not a game creator. Yeah. And I I was maybe the credit for other people like who you never know. Japanese culture Japanese development uh is just so like kept kept so vague and kept so secretive that oftentimes it feels like there are a lot of invisible people at Japanese companies who don't get the credit of the Miyamoto and the Inafune of the world and it feels like I bet there's a ton of talented people who just like are doing most of the work behind the scenes while these aur take the credit. Um",
            "start": 5869.04
        },
        {
            "text": "of the Miyamoto and the Inafune of the world and it feels like I bet there's a ton of talented people who just like are doing most of the work behind the scenes while these aur take the credit. Um funny story for you by the way. So in my book Blood, Sweat, and Pixels pre-order now. Um there's a chapter on Shovel Knight. And so you are mentioned because we talk about how uh when they launched the Kickstarter they timed it. So like you guys would write an IGN article because they found you uh on GameFAQs like writing Mega Man stuff which I thought was really funny. But that game I think makes up for Mighty Number Nine sucking because that game is so incredible. It's immaculate. Um so that that's like the the Mega Man sequel that that we needed is that. That's so fantastic. What a fantastic game. I'm so frustrated that they won't make a sequel. So I played some of the Spectre uh Spectre Knight stuff which is really cool. Really. And it's coming to Switch I think on",
            "start": 5913.68
        },
        {
            "text": "What a fantastic game. I'm so frustrated that they won't make a sequel. So I played some of the Spectre uh Spectre Knight stuff which is really cool. Really. And it's coming to Switch I think on Friday. It's coming. Yeah it's a launch day. Yeah I'm much happier. I played the Spectre stuff which I liked a lot more than the plague knight uh which didn't feel right to me. Yeah something about it was the bouncing and yeah not great mechanics but with all due respect to them cuz I emailed them once in a while. was like \"Can you just **** get like just enough already with the original shovel now? Let's move on.\" Well that's an interesting theme in this chapter of the book uh pre-order now. Um which is like how do you you commit to all these things during Kickstarter and you get so excited about them? And something about Kickstarter development is so interesting because you're making all these promises and stretch goals and then you're kind of stuck to them. And it's like",
            "start": 5956.24
        },
        {
            "text": "so excited about them? And something about Kickstarter development is so interesting because you're making all these promises and stretch goals and then you're kind of stuck to them. And it's like the these guys they didn't want to do it halfass. They wanted to put their all into each of these campaigns but they wound up working on Shovel Knight for 3 years like longer than they thought they ever would. which which would thank God and I I know it worked out for them so well. I know that they're rolling in it now and it's amazing. My my most amazing thing cuz I remember I remember when we were corresponding before they announced the game and they sent me the art and all this kind of stuff and I'm like you guys can't find anyone to fun like it's almost impossible to me especially now with hindsight of having played it and loved it and platinum it and all that kind of stuff where I'm like you guys couldn't find anyone to fund this like I came al so so actually this is discussed in the",
            "start": 5990.08
        },
        {
            "text": "hindsight of having played it and loved it and platinum it and all that kind of stuff where I'm like you guys couldn't find anyone to fund this like I came al so so actually this is discussed in the book which which you will have to read pre-order now um which uh it it uh I will definitely read it. They part of what they did was like since they had all worked at Way Forward uh which is this kind of indie developer that works on a lot of licensed games before they uh quit to make Yach Club and start Shovel Knight. They had made all these games that they put a lot of interesting things in and effort in that nobody bought. And they saw it as like hey we want to make this game. We know how to make this platforming game but we also want to do the marketing ourselves because we believe that we can like create this icon shovel night and get it out to people and can and start a conversation with people and convince people that it's worth getting. So they're like \"Well we could go to like",
            "start": 6022.32
        },
        {
            "text": "can like create this icon shovel night and get it out to people and can and start a conversation with people and convince people that it's worth getting. So they're like \"Well we could go to like Majesco or some publisher like that but instead we want to do a Kickstarter where we can be doing updates and talking to the community and like building this fan base and doing everything ourselves.\" So I think that was the biggest thing for them. Yeah. And it's also like with Kickstarter you own all the rights to it. So when they license out Shovel Knight merchandise they don't have to go through Majesco. Yeah they made the right choice. I think we could all say although the less intuitive one which I think makes them so smart. And you're right like way their their heritage way forward was the reason why I believed in them so much because even like Blood Rain Betrayal and some of these games a lot of people didn't play. I'm like well Blood Rain was clearly supposed to be a",
            "start": 6061.2
        },
        {
            "text": "was the reason why I believed in them so much because even like Blood Rain Betrayal and some of these games a lot of people didn't play. I'm like well Blood Rain was clearly supposed to be a Castlevania game at some point. Uh these games are so **** good and and the new Shantae I mean Way forward still doing their thing. The new Shant really great game. Um yeah. The other funny thing about the Shovel Knight guys is that they they have this like flat structure where the four co-owners are all identical. I don't know if you guys have like a similar thing but they don't have a CEO. So when they make hires or they make decisions they all have to agree on something. Uh so they were telling me they interviewed this QA person or they were trying to find a QA person and so they would do interviews and everybody at the company would be in on the interview. So it would be like this poor interviewee talking to 10 people at once asking them questions. Oh my god it seems scary. It",
            "start": 6094.32
        },
        {
            "text": "do interviews and everybody at the company would be in on the interview. So it would be like this poor interviewee talking to 10 people at once asking them questions. Oh my god it seems scary. It does. It does seem scary. I have to admit I I've admitted this before because I started freelancing for IGN when I was 18 and then they offered me a job when I was and then I worked there until I was 30 and then we quit and did this. I've never been in a job interview before. Never even really had a real resume except for like the one time they're like \"We need a resume because Fox needs it for their files or whatever.\" I'm like \"All right I'll see what I can do.\" I think my mom wrote it. Wow. Um All right Jason let's call it there. All right. Uh I want to get this out one more time because it's called Blood, Sweat, and Pixels. It's a new book. and Pixel published by Harper Collins great publisher. Uh September 5th September 5th 2017. Pre-order at book sellers of your choice.",
            "start": 6129.44
        },
        {
            "text": "it's called Blood, Sweat, and Pixels. It's a new book. and Pixel published by Harper Collins great publisher. Uh September 5th September 5th 2017. Pre-order at book sellers of your choice. Books sellers of your choice. You can also find me at kotaku.com obviously and our podcast is Kotaku Splitscreen. We are doing GDC specials all week. So come check those out. Awesome. Well it was good for you to be here. Thank you so much for making time. Thank you for having me Colin. It's for all of kinda funny support over the years. It's much appreciated. And it's cool. It's cool to see like an independent uh what do you call yourselves? like a media organization or Yeah I always say I own a video production company. I never It's cool. It's really cool to see what you guys growing and expanding and getting this crazy ass studio. It's really cool. It's cool to see. Thank you so much. Congratulations on Thank you. And congratulations to you too. You're welcome with us anytime. All",
            "start": 6164.8
        },
        {
            "text": "expanding and getting this crazy ass studio. It's really cool. It's cool to see. Thank you so much. Congratulations on Thank you. And congratulations to you too. You're welcome with us anytime. All right. Next time. Next time to promote the book and tell people to pre-order some more. Yes. Well when when **** I mean if you're if you're are you going to do any sort of tour? TBD. We'll see. We'll talk about it. If you do and you come to San Francisco absolutely. We'll dedicate an entire episode to the games. We will discuss. Awesome. Please do. Please do. All right. Thank you so much for joining us out there. Hope you enjoyed the conversation. Go find Jason's book. Go find Jason. Go follow him on Twitter. Uh and remember the episode of Colin Was Right that uh inspired this particular conversation with Colin Was Right. We didn't even talk about GameStop. Oh it doesn't matter. Was was GameStop's slow demise in the all digital future. So check that out and also check out the",
            "start": 6202.56
        },
        {
            "text": "conversation with Colin Was Right. We didn't even talk about GameStop. Oh it doesn't matter. Was was GameStop's slow demise in the all digital future. So check that out and also check out the original reporting Jason did that inspired that uh that video as well. All right. Uh till next time we love you. Bye.",
            "start": 6235.68
        }
    ]
}