{
  "id": 2510,
  "video_id": "w6lW_sWmOuE",
  "show_name": "Gamescast",
  "hosts": [],
  "title": "All The Games Coming Out Before E3 - Kinda Funny Gamescast Ep. 113 (Pt. 1)",
  "description": "We predict how all the games coming out before E3 will fare.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
  "published_at": 1490617803,
  "duration": 1473,
  "transcript_chunks": [
    {
      "text": "This episode of Kind of Funny Games Cast is brought to you by Blue Apron. Now Blue Apron, obviously you've talked a lot about them before. You know, GameOverGreggy himself, Greg Miller, big fan of his show on Instagram, Cooking with Greggy. You can find one of the little hash tags and stuff. He's a big fan of cooking stuff. Blue Apron's been really helpful with that because here's the deal, they send you a little recipe sheet, all the things that you need. You can make each meal within 40 minutes or less. Tell me that's not a good deal, Kevin. It's a great deal. It is, it is. So here's the deal, they are the number one fresh ingredient in recipe delivery service in the entire country. It is their goal to make incredible home cooking accessible to everybody, that includes me and I can't cook. I haven't used it yet personally, but that's just because I'm just really not into cooking stuff. But Greg, Greg's been loving it. Kevin, have you used this? No, I haven't been. Tommy once again, oh yeah, ha. If she wanted to get it you",
      "start": 0.0
    },
    {
      "text": "but that's just because I'm just really not into cooking stuff. But Greg, Greg's been loving it. Kevin, have you used this? No, I haven't been. Tommy once again, oh yeah, ha. If she wanted to get it you can tell her she can check out this week's menu, get her first free first three meals for free with free shipping, but going to Blue Apron calm / Gamecast. No S, there, Gamecast. Okay, literally every time she asks I'm like, let's do that. Okay, good. Maybe do it. You'll love how good it feels and tastes to cook. Use your Blue Infant. Remember again, Blue Apron calm / Gamecast, first three meals free, free shipping. We'll get Paula's review soon and we'll let you know. Until next time, Blue Apron, a better way to cook. What's up guys, welcome to the first ever episode 113 of the Kind of Funny Games Cast. As always, I'm some Yeti joined by one-half the coolest using video games, Greg Miller. Hey, what's up? Really? I need to figure out what to do with that and yeah, yeah, I don't know and I don't wanna R.I.P. the colon.",
      "start": 40.29
    },
    {
      "text": "I'm some Yeti joined by one-half the coolest using video games, Greg Miller. Hey, what's up? Really? I need to figure out what to do with that and yeah, yeah, I don't know and I don't wanna R.I.P. the colon will always be second half. Yeah, you know, yes, I go ahead. He's like when you when not me of course because I'm going to do I'm a manly man but like when you have like you know in grade school like when the girls had their best friends forever and they'd have little hearts. Oh yeah, there's a lot of things not that I ever had one of those don't worry I didn't have that penguin that would turned out to be a girl's toy it but it's like one of those things like that's what would this is you know I mean I but I know your friend yeah yeah it was maybe for the guests you should like have like a second thing on a hey all right no I've never had get here before well you know I figured I'd bring some over seemed like a good time for a now drink you dark for me hurts my head that's why I'm a new me my",
      "start": 103.62
    },
    {
      "text": "thing on a hey all right no I've never had get here before well you know I figured I'd bring some over seemed like a good time for a now drink you dark for me hurts my head that's why I'm a new me my apology well if you didn't salt your heritage no problem okay oh there's a lot of you never had one either Kevin taste sensation damn it Kevin I love this **** show well that's what it was no I got get it again it's before Ginny's even get in before have you grab some that getting skinny I can't say it whatever I've had that **** before and it's great especially the pizza but is now I think it's the Amalfi yeah it's a show your time you can show Kevin lutely I sandwiches today all you can give you the green apple pie on the way out get the **** always exchanges it for a blueberry blow pop and then his entire mouth teeth and tongue are blue but now it's just I'd be annoyed if you drank some Guinness you shits a real dark oh really I oh yeah oh yeah you got those Guinness that is",
      "start": 141.24
    },
    {
      "text": "pop and then his entire mouth teeth and tongue are blue but now it's just I'd be annoyed if you drank some Guinness you shits a real dark oh really I oh yeah oh yeah you got those Guinness that is excited so Danny you were joining us again on the Kind of Funny Games cuz you're one of our earliest guests sure really going back going back to the old days of the oldies ago back when I worked at Gamestop oh yeah it was a long long time ago and I mean if you he'll clip though right oh yeah a game of a great mother might have been on a game cast as well and it is okay the reason to dollars as I remember doing the intro insane the coolest using video games and I included you as well I get the honorable mention that you are also want to be able to do thanks I stand by that means a lot from somebody wearing a Saved by the Bell church yes it is anyone who knows cool in 2017 Jinora anything you gotta keep a genuine like the open it was giving me **** for it yeah I think and Nick give ****",
      "start": 186.93
    },
    {
      "text": "wearing a Saved by the Bell church yes it is anyone who knows cool in 2017 Jinora anything you gotta keep a genuine like the open it was giving me **** for it yeah I think and Nick give **** but it's the type of thing where he's like I'm only given chick is like I actually respected father he's not sure if he's supposed to like it or not so he's like judging me like he'll make fun of me to see if it's cool right um and say I know y'all you only do with this what was that cuz i was gonna say Kevin's been playing fans fast and loose with the cutaways and the weird things here he thinks I'm but we're not gonna know it earlier today I actually pulled the Dalton the knob down what's wrong with your meds today oh this is having every day not lollipop did you buy that lollipop down in Dolores Park either let me talk a lot of cow what let me see the cut you just did no I'm just saying the Knobloch yeah okay do a little floor yeah I like that right not bar here's a question I had from",
      "start": 229.13
    },
    {
      "text": "Park either let me talk a lot of cow what let me see the cut you just did no I'm just saying the Knobloch yeah okay do a little floor yeah I like that right not bar here's a question I had from the wood that came up on the morning show today and it's not an insult for you hmm is this is this a fashion choice or a function choice leaving it open this is a depression choice okay that's what I was saying well no no because it's a 90 style with the shirt yeah but I'm saying like when I would leave my button-downs open growing up because i was sat i didn't want to sure to be tightened oh how rotunda same reason i do to this day yeah yeah no it's not that I get ya a faction he doesn't think it's no it's a puzzle that's something to do this you carious it works well great now I get it away from the the fact that I'm fat buddy or not this is not at this now where we going right now I feel like anybody we just we blue tongue shame Kevin Nick you came here you use it to be a gimmick Kevin's",
      "start": 266.93
    },
    {
      "text": "the the fact that I'm fat buddy or not this is not at this now where we going right now I feel like anybody we just we blue tongue shame Kevin Nick you came here you use it to be a gimmick Kevin's Mike have a turn on the camera in let Nick speak in there with you may command this is playing great for the podcast like they love it if you that doesn't play nickname your ghost doesn't play oh she's like clipping out to how long your tongue is not blue so was on Kevin is own place and gentlemen this is the kind of any games cast you sure every week we get together talk about video games sometimes I'm blowing on a cookie monster yeah yeah you can get it early at patreon.com flash kind of funny games or you can get it wait at youtube.com/kindafunnygames either way we appreciate you and all the things that you do for the community just like our producer for the week Salem Ghanim Alghanim round of applause Salem the homie yeah not a perfect name yeah first name Salem last name wig",
      "start": 318.05
    },
    {
      "text": "all the things that you do for the community just like our producer for the week Salem Ghanim Alghanim round of applause Salem the homie yeah not a perfect name yeah first name Salem last name wig on I'll got him yes that is the only thing I know costume yeah he's been doing it for a while too yeah since Steven insular what's fun like oh **** i left even Reddit card on yeah for like seven months like this explains a little bit crazy you're good man though ever in your good women to anybody else you want to support do you ever dizzy Salem witch trials mission info oh yeah yeah the moments like a deathclaw yeah yeah I was pretty fun cool golf Regan so first I look at the day I want to talk about the game of 2017 leading up to E3 so because here's the deal i want to set the stage here it's mid march i didn't time of this recording good rib banger of a shock oh my god name you so I we know of course we got Zelda of course we got Horizon right and like those alone you could just be like",
      "start": 369.26
    },
    {
      "text": "mid march i didn't time of this recording good rib banger of a shock oh my god name you so I we know of course we got Zelda of course we got Horizon right and like those alone you could just be like I could yeah but evidently had a great year go back to bed before that Resident Evil 7 yep that way better than anyone expected for sure we got Neil coming out of **** nowhere what else we got Nearer comet ah yeah year yeah and yes dipper clips imma give a shadow specifics what sheriff is a good video game the **** loves ya right around the time of this posting Snake Pass I mean we're no I'm not saying we're grasping at straws we're bringing a little games now what we're showing us but assignment 9 01 09 the one I already talked about the next time I going here was that I'm not none of I don't know about you none of us were I'm into it and I enjoyed it but not have to go play it the final version and over ever but for honor sold really well oh yeah no streaking violence so we really well",
      "start": 420.44
    },
    {
      "text": "know about you none of us were I'm into it and I enjoyed it but not have to go play it the final version and over ever but for honor sold really well oh yeah no streaking violence so we really well yeah yeah yeahs killing women with you can see the wildlands like whatever but like for honor was like oh god like this I'll then **** fun that's the primary what the wildlands is fun but it's fun in spite of it trying to be serious Jeremy yeah i mean been telling me all of it ready to play it we had we played we played together and it was it was alright it was fun but i was a man would you behind a vision I'm mm-hmm Mass Effect yeah yeah the first dodd of the year and even then who woulda thought it would be like six games better than Mass Effect like i'll be well yeah that's the thing is like why haven't we seen anything from this game this seems weird and then I did right and I was like God but it's actually when I put the PC build ok icon father who dis is not coming that's why I",
      "start": 463.85
    },
    {
      "text": "like why haven't we seen anything from this game this seems weird and then I did right and I was like God but it's actually when I put the PC build ok icon father who dis is not coming that's why I loved one when Andy and this without a year ago at this point she just tweeted out he's like no one else starting to get worried about Mass Effect Andromeda and at that point it was like no yeah you know what's funny about Mass Effect right what amenities like 76 now you're an immediate yeah it really is like the animation suck in like it doesn't look like next-gen Massa funny like it reminds me a lot of now not in terms of review scores it reminds me a lot of the reception to fall it forward away for a meditation exactly and we're like oh it's it's it's fault sorry but better but like okay and this is like immigrant that I don't think a drama is necessarily better than the other ones but it is oh it's more Mass Effect all right but I didn't push the bar didn't reinvent the wheel all over",
      "start": 506.96
    },
    {
      "text": "this is like immigrant that I don't think a drama is necessarily better than the other ones but it is oh it's more Mass Effect all right but I didn't push the bar didn't reinvent the wheel all over again like what I say is I always say it's the same argument Collinwood make about Fallout 4 compared to the Witcher and Dying Light or whatever of like white this was a game clearly made in the vacuum where they went away and they worked on and they came back like it well **** this world is whole games changed yep yes not like putting that next to Horizon next to Zelda like this isn't simple yeah anyway it's just been crazy so again Verizon Zelda those are the obvious big once we got Near and Neo or two other examples of just like PS4 being **** awesome terms of notices but just in terms of quality games coming out so now in between the mid march time frame again three so hungry we're talking June 10 right I think that's the the date that sounds about right round there the first second",
      "start": 547.19
    },
    {
      "text": "quality games coming out so now in between the mid march time frame again three so hungry we're talking June 10 right I think that's the the date that sounds about right round there the first second week of June Kevin give me a check on E3 or IV way bigger here I think you're right i think i might be alone it depends hey Kyle literally called out the fact that you screwed me out of the Nintendo World Championship in topic number four we should record a lot of order and here you are here you are coming in now with it I did not say that is your championship later don't put it in front of me okay it's okay we can it's about kind of sign up on its own money yeah it's not like a girdle for a baby hey there's not really a right there we're there ah Joong star comedy doing to our team okay E3 this year there we go Myra garbage so yeah the press coverage didn't self-starter lounge in town I'm gonna get the room I'm a fell over good stay so I get a list of about ten games with dates you",
      "start": 583.46
    },
    {
      "text": "E3 this year there we go Myra garbage so yeah the press coverage didn't self-starter lounge in town I'm gonna get the room I'm a fell over good stay so I get a list of about ten games with dates you better start with the biggest one Persona 5 oh yes April for coming up quick quick quick so where do we where do we stand on this what do we think that it's going to do for the industry what what Metacritic is it going to kind of saw we're doing like a quick crazy we don't need to get to Krystle Beck's there's no anything official I do i do want to do a Metacritic topic coming up where we guess the rest of the year what's guard and start putting bets down I want to look back later and ok and see where we're at a Persona 5 is going to do incredibly well it's going to do incredibly well I'm basing that on the fact that I've I played I've you know only played a few hours of it like I said I seven played more since then this is next topics what we're playing I think I'll save some thought",
      "start": 631.92
    },
    {
      "text": "basing that on the fact that I've I played I've you know only played a few hours of it like I said I seven played more since then this is next topics what we're playing I think I'll save some thought though but I already done my preview or whatever first few hours of Persona 5 it's living it's what I expected from a Persona that super exciting it's super stylized what I think what the reason I think it's going to deliver beyond that even in terms of the score is the fact that i saw you know Polygon's article in Kotaku article and the fact that they keep coming of now I'm 65 hours into the game just that in the other United mean like the game clearly is delivering what people want and I still think that this is the breakout Persona game yeah where is in the same way I we always talk about Uncharted 2 Uncharted one where Uncharted one came out and if you had a PlayStation you're like oh this is great but a lot of people who have PS3s so what you heard was you buy PS3 in those the",
      "start": 677.19
    },
    {
      "text": "Uncharted 2 Uncharted one where Uncharted one came out and if you had a PlayStation you're like oh this is great but a lot of people who have PS3s so what you heard was you buy PS3 in those the years between Uncharted one and two you hear about in Chardon but don't necessarily go back and play it when a charter to came out everyone's like I'm on board for this I heard it's awesome yeah and it's the same thing I think we saw with Persona of you know I my first personas Persona 3 because Jeff Haynes when we were on the PlayStation even IGN was like you have to play the something over this is awesome and then for came out but came out weird it was like right after three or I got it right after three and I didn't get into because no one's jumping to another one and then that was fine but that was a super nerdy I'm in the Japanese role-playing I know about this where is when then there's you know Persona 3 says edition on PSP more people were hip to it and then Persona 4 Golden was is",
      "start": 718.11
    },
    {
      "text": "that was a super nerdy I'm in the Japanese role-playing I know about this where is when then there's you know Persona 3 says edition on PSP more people were hip to it and then Persona 4 Golden was is like an industry changer right like you talk to something about hey man the Vita there's no games lowell and rose again it was just my Persona machine so even if you didn't have a vida you know how many people play Persona 4 Golden and they're like it's amazing you know how great Yosuke is and Andrea and all the stuff and i think that's what's going to happen for some of 5 it's going to land it's going to be exclusive to the biggest consult in the land and everything like what we I would place dish for of course I want to play us yeah I like I'm coming from the perspective of somebody who's never played one of these games but has like vicariously enjoyed that series through various websites like playthroughs like Giant Bomb did play through let's play streams like I haven't I have seen people",
      "start": 753.21
    },
    {
      "text": "played one of these games but has like vicariously enjoyed that series through various websites like playthroughs like Giant Bomb did play through let's play streams like I haven't I have seen people pay through those games but it's never really been the right time for me to get in and I think that's exactly what's happening I was like this is you know it's almost like it's Witcher 3 moment right we're like it's been in the public discourse for a good while now and it's coming out I'm crucially what you just said it's coming out on the console that is the one that people seem to I mean it's the one in the ascendancy the one with a lot of games come out of give a **** everything this year's in particular yeah Sony's having a **** riot and I think it's the it's the game that like has been enough talk about it and if it has all those positive reviews in the same way that CD Projekt were writing on our wave right up to and what's your take a match if it comes down to reviewing well I",
      "start": 793.47
    },
    {
      "text": "enough talk about it and if it has all those positive reviews in the same way that CD Projekt were writing on our wave right up to and what's your take a match if it comes down to reviewing well I think that's going to knock over a lot of people who are sort of in the May because of this one thinking about it yeah and I think it's going to feel an interesting gap in the fact that it's coming out this close to Mass Effect mass spec Mac next thing was ok cool oh my god I have so many games a plan where I've just got the Horizon I'm super in his L then here's Mass Effect right now Mass Effect has been in one of the games of like you can put you might you might yeah yeah I mean icing on others as a final series I'm like people who are like that was like forward I'm holding up maybe they're gun shy to it maybe gonna jump in not enjoy it and now for someone's going to land there and Persona is going to be that thing I think that is like you want style you want substance you want story we're",
      "start": 832.35
    },
    {
      "text": "shy to it maybe gonna jump in not enjoy it and now for someone's going to land there and Persona is going to be that thing I think that is like you want style you want substance you want story we're putting all the hooks into you and getting you this way I mean it's crazy because you know this is a game that when you know everyone thought it was coming in 2015 and whatever then it did into great doctor late and all that stuff and when it's targeting delayed even more it was just like oh man you really not coming out Valentine's Day like **** serious and now that's gonna be vegetable what happened I should put on if it came out at that time it would have been eaten alive but now it's coming upset the best time is one of them I think it would have a month after switch launching now which is the perfect amount of time for people to be quote unquote done with Zelda by the point otherwise i can stop playing this is my number one priority here I'll show you here doing a shrine here or",
      "start": 870.28
    },
    {
      "text": "is the perfect amount of time for people to be quote unquote done with Zelda by the point otherwise i can stop playing this is my number one priority here I'll show you here doing a shrine here or there yeah he's done with the main I'm not like three or four other really big PS4 games that came out in the past couple of months like what's coming at around though so how do i go to a window that's okay we can all agree Persona 5 is going to kill it's going to get great reviews i mean they are getting reviewed in Japan's like we already have a standard there Yooka-Laylee is the only real thing of consequence that I'm seeing in early April but April 11 obviously very different audience very different type of game I don't know the MSRP of Yooka-Laylee can you look that up guy want to say 40 bucks I'm just putting my prediction there because I think we'd ever let's play we talk about our what Nick and I dare less my god i did that you can I Lee's a really hard read i I'm even seeing at a GDC emceeing",
      "start": 905.38
    },
    {
      "text": "putting my prediction there because I think we'd ever let's play we talk about our what Nick and I dare less my god i did that you can I Lee's a really hard read i I'm even seeing at a GDC emceeing up and packs as well with like a relatively strong presence 40 buck much work thanks I'm sorry the best a business I'm sorry yeah like I can't tell I'm like you know it had a Kickstarter and it's had a long story and it looks really polished but it's just like where what is the market for 3D platforming games I feel like this happens every like two years where another one of these comes out and we're like trying to see if it's going to kick off and then I just don't know there is that fondness for it there's that you reminiscing of playing yeah like that and i think that's this is you know in the same way almost as they say way off in the same way everyone here at this table and people have left this table have been able to find a life on Patreon right like sure i am super into this niche",
      "start": 946.51
    },
    {
      "text": "the same way almost as they say way off in the same way everyone here at this table and people have left this table have been able to find a life on Patreon right like sure i am super into this niche content and I will support it that's what kicks are obviously has been for video games and that's what it's going to be for Yooka-Laylee I don't think Yooka-Laylee is going to move the needle and a major way anyway I be gettin personas where anybody's way because for me I was like when they announced I was like oh cool a spiritual successor to Banjo-Kazooie or whenever I was like I was never super into those games but maybe the time is in similar to I feel like music games where like Rock Band 4 camera like in the tiger like maybe it's time for that to come back and then we're like no not really I'm like when I wash Yooka-Laylee and we did though Nick showed me let's play footage and stuff and he when I saw today the devs at Alamo Drafthouse I was like oh this games cool and it's cute it's got a",
      "start": 989.8
    },
    {
      "text": "I'm like when I wash Yooka-Laylee and we did though Nick showed me let's play footage and stuff and he when I saw today the devs at Alamo Drafthouse I was like oh this games cool and it's cute it's got a substance to it but like that like the worst popping up scaling I'm not feeling this I don't see where I'm playing this is I'm on playing some ice cream my big-screen TV even on my switch i feel like i don't know if i play it there for me that that's why i think it's right at home it's the switch and unfortunately it's not coming out April eminence which I don't leave this an actual date for that yet I just know it sure because this totally is the throwback like oh I'm on a plane which going to play something and I have it there I you were saying that like it is such a weird kind of niche of life who is the audience for this game and if I go do we really need 3D platformers my problem is even within 3D platformers there is a divide between the Mario 64 and the Banjo and the rare games the",
      "start": 1023.17
    },
    {
      "text": "who is the audience for this game and if I go do we really need 3D platformers my problem is even within 3D platformers there is a divide between the Mario 64 and the Banjo and the Rare games the Donkey Kong 64 that type of stuff and I never really liked that side I never really liked the collectathon super open worldly the 3D platformers and that's what this totally is a spiritual successor to I so it's like if it was a bit more of just like a an actual platform like a more of a spiral stop sign or more of a even Ratchet and Clank like a digression Clank had its moment and I'm like going success with Jack exactly remember stuff where those are so good and I loved when the Ratchet Crane came out last year and it was fantastic the ukulele thing for me where I'm like I might I'll give it a shot because even though I don't really love and have them installed for the Banjo type games like I feel like it is coming at a good time for me in terms of having the Switch and where I'll be out",
      "start": 1062.2
    },
    {
      "text": "a shot because even though I don't really love and have them installed for the Banjo type games like I feel like it is coming at a good time for me in terms of having the Switch and where I'll be out with that but I want to have like Marty sleeve on the show him cuz he lobster yeah so like I think that this game might speak to him with a little but no totally like that that's the thing that there's an audience for it my analog for a personal thing is like when and I was you know you're growing up playing games right or whatever like I love Jackie extra you know I loved Rash and Clank whatever white-trash and click later on I should say and but I remember always think Sly Cooper Cooper I wash bag man Sly Cooper is a game I want to lighten but I just didn't I can tell I don't want to play and when they put out the collection I played it no like oh well now of course I'm **** Mr. Infamous I love Sucker Punch let's go back and see what I didn't see before and I started about this like",
      "start": 1106.75
    },
    {
      "text": "and when they put out the collection I played it no like oh well now of course I'm **** Mr. Infamous I love Sucker Punch let's go back and see what I didn't see before and I started about this like no and I maybe it's because it is dated let's try the names out or Sanzaru game that I was mispronounced Sanzaru let's play their you know their fly for whatever these right huh and I put that in and I was just like no this just isn't for me and I like the devs and I like is what it's that's one of those games you step back and I'm like I can see the quality and appreciate it but this is where I get something that's just not a game for me yes yeah I'm most interested in when you brought the music game thing and there's a time for music games going back I don't think this ukulele is the question of is it time for 3D platformers to come back of it in the answer's no I think it's good for ukulele because otherwise it would have been buried like the one on saving grace is that at least it's",
      "start": 1148.56
    },
    {
      "text": "of is it time for 3D platformers to come back of it in the answer's no I think it's good for ukulele because otherwise it would have been buried like the one on saving grace is that at least it's coming out in a window where it's Italy warmth and Mario's at the end of the end of the year right ah with ukulele I think it's more similar to why does he look so questions about my cuz we've been burned so many times by Nintendo and gaming video games in general don't take everything you hear just like to bible truth Tim memo I I get that but I just like I'd you both have mentioned in the last couple days like that Mario Odyssey like will see you as I said it's a **** wuss which event when they first announced I was playing with you guys doubted us but I thought Moorea was gonna be launched tiles I'm yeah from everything I've heard Mario is so close to being done if it's not already finished now seeing that trailer I was like all right this game is done yeah deal I had a feeling the only",
      "start": 1186.09
    },
    {
      "text": "I'm yeah from everything I've heard Mario is so close to being done if it's not already finished now seeing that trailer I was like all right this game is done yeah deal I had a feeling the only they haven't done is records orchestral soundtrack because listen committee **** Nintendo like they usually show the trailers with shitty music and then they later record a like after last thing I think they're at that stuff I just go talk video games in general we just all been burned so many times and I'm not to mention Zelda right leg or Nintendo or Zelda can't move in grand American some point it does become talked over you but I mean yeah they're coming in hot on the silicon soul like they're still adding in the online stuff like like a lot of stuff that was suppose we all launches got pushed out we're eventually going to get you know Mario Kart that looks come along it just all seems to be quite like wanna be surprised it's like when people say redhead covere it's like you know there",
      "start": 1221.22
    },
    {
      "text": "out we're eventually going to get you know Mario Kart that looks come along it just all seems to be quite like wanna be surprised it's like when people say redhead covere it's like you know there is a universe with all happened and I saw its money I might they didn't hit it with five pretty **** right Grand Theft Auto 5 got pushed yeah I don't see Mariana to get but I hope it does but that's that's a separate X my point was I think this is more of a Shovel Knight situation with ukulele where it is it it could be at least word it is going to a very specific crowd that could potentially love the game but that's a question of the quality of the game is it just a spiritual I accessor or is it adding on to what it is because your double night is not just a spiritual successor to retro platformer games it is it adds to them and it modernizes them and Shovel Knight to me is like a perfect game because it not only gave me more of what I've remembered from playing the games but it it I felt",
      "start": 1259.05
    },
    {
      "text": "games it is it adds to them and it modernizes them and Shovel Knight to me is like a perfect game because it not only gave me more of what I've remembered from playing the games but it it I felt good now not just like oh this share like it used to feel it's like oh no this feels how it should feel this feels how I want to remember this game and it doesn't look like you ladies doing that but I think that that's what it would have to do to kind of have its own niche be success yes I would break it as in a way because like it has like this three year long narrative right like people know about it so then it gets an endorsement in the form of you reviews and people saying it's good then that will you know push it into a bigger owning yeah cuz again shall we might have similar thing where it was just like it had bit what I think doing no Shovel Knight I want about it but well that's here though but but Shovel Knight was nothing Shovel Knight is a Miss a no Shovel Knight so what I was",
      "start": 1299.99
    },
    {
      "text": "it was just like it had bit what I think doing no Shovel Knight I want about it but well that's here though but but Shovel Knight was nothing Shovel Knight is a Miss a no Shovel Knight so what I was nothing until it came out like Shovel Knight was a Kickstarter right it had a trailer then I was like this looks cool and all they got the guy that verts doing music from OC remix or from VG mix and all stuff he's great cool and that was it's a very underground **** but it took people I Colin being like no this is worth looking at yeah I mean when I was a saying that we're not hearing that already ukulele ukulele previewed fine people ago I a throwback but it wasn't like beat down your door holy **** **** are you seeing that that's what I mean that's what Shovel Knight was that's what Rocket League was right what other games did Colin always the same kind of like you know I mean like touch that Colin's right we'll see I don't think the ukuleles going to do it but the fact I do you",
      "start": 1340.76
    },
    {
      "text": "Rocket League was right what other games did Colin always the same kind of like you know I mean like touch that Colin's right we'll see I don't think the ukuleles going to do it but the fact I do you think the show tonight on popular after it came out not before I came out I don't one that I think there was really great buzz behind it and I'm not because I'm joking around calling on the early bird side of all that stuff but there were other people that I saw and we're moving that thing you know I mean I remember when they we brought it to the Oscar in a column brought it to the office and when I he was there Vince was there people are standing up gather around like holy **** this is awesome yeah I think we're now at the stage where like unless you have that type of game that is breaking through that people are like being evangelist for like there's too many very good games coming out right now like if you're not in that realm then you're you're **** done the dosage I'm like",
      "start": 1378.98
    },
    {
      "text": "through that people are like being evangelist for like there's too many very good games coming out right now like if you're not in that realm then you're you're **** done the dosage I'm like we'll have to say with this one but it is strange that this is a game to send it so many different I'm so many show floors I'm gonna have enough conversation right so and I also think it is one of those games that is just the narratives going on too long as somebody not connected to it I remember when the Kickstarter came and it's not formal rare guys to making this game see me calmo kicks artists you're like **** awesome and then here we aren't like I still know and then when I was walking draft up I'm like how does the first time I'm really seeing this game right I'm like I guess my personal interest doesn't yeah it is the same thing but no one's grabbing me by dude you gotta look at this game like they do with Near you know me for a more recent example yeah dude you gotta **** check out",
      "start": 1412.02
    },
    {
      "text": "doesn't yeah it is the same thing but no one's grabbing me by dude you gotta look at this game like they do with Near you know me for a more recent example yeah dude you gotta **** check out yep hope you enjoyed that episode of Kinda Funny Gamescast for more Kinda Funny Games content click right there to subscribe for more just fun content like the Morning Show click right there to subscribe to Kinda Funny or support us on Patreon here or check out some videos there give a little ago and it",
      "start": 1447.72
    }
  ]
}
