{
  "id": 2455,
  "video_id": "x-nBrqHbeRM",
  "show_name": "Kinda Funny Morning Show",
  "hosts": ["Greg Miller", "Nick Scarpino", "Kevin Coello"],
  "title": "Nintendo World Championship Controversy - Kinda Funny Morning Show 03.03.17",
  "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1488575058,
  "duration": 4487,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Welcome to the Kinda Funny Morning Show for March 3rd 017. That's right Nintendo Switch Day. I'm one of your hosts Greg Miller alongside the producer/seducer Nick Scarpino. I'm sorry Greg. I don't know who you're talking about. So this is always the problem with how we do all of our content here. Sometimes we get ahead of ourselves and we make things and then Nick forgets because he's old. No I don't forget. I just want He forgets that there is the respect that I have so rightfully earned through my hard work, my training, my perseverance, and my extreme acumen when it comes to video gaming. Okay he's not wrong this time. Like it I am the champion. He chose yoga. You will call me the champion. You will refer to me as either champion, Lord, our savior, or champ for short if you're if you don't feel like saying all of the allowables. Now here's the problem. Wednesday Nick comes in here, sits down like the punk ass **** he is and I I put on",
      "start": 1.67
    },
    {
      "text": "or champ for short if you're if you don't feel like saying all of the allowables. Now here's the problem. Wednesday Nick comes in here, sits down like the punk ass **** he is and I I put on the the Kinda Funny Nintendo World Championship and I say, \"I am the champion. No one has ever been able to step up and battle me to actually challenge me. So I'm going to start making challenges like the hardcore belt put on anywhere. I say, \"Nick, do you want to play me?\" You say, \"Yeah, we put on One, Two, Switch.\" I'm pretty sure I said no. We put on One, Two, Switch. I said, \"You get to pick the game.\" You pick the yoga game. You beat me for the belt. Fair and square. Fair and square. No one's arguing that. But then you said you give me a rematch on Thursday. Then I show up to do the show on Thursday. Lo and behold, you did some backroom dealing. You did the show with Tim. It just ended up being it was going to be a long day for me. I needed to conserve some energy for our Logan",
      "start": 61.6
    },
    {
      "text": "show on Thursday. Lo and behold, you did some backroom dealing. You did the show with Tim. It just ended up being it was going to be a long day for me. I needed to conserve some energy for our Logan review, our reacts, which is now live. You guys can go check out. Uh so look, man. I mean, this is just this is strategy. This is just what happens, you know. Well, you're here now. Mike, you're here now. The big man's here. Let me start loosening up. The thing about it is this, though. The belt is not here. Unfortunately, what the **** The belt is out for cleaning. It had some schmutz on it. And as you know, with uh with Nintendo World Championship uh rules, the belt and the champion have to be in the same room at the same time for it to be contested. Sure. Yeah. No, 100%. That is unfortunate. I have had we're just getting it back in right now. The belt will be back here on Monday. Certainly before PAX East, if not before PAX East. At least a little bit after PAX East. The belt will be",
      "start": 101.52
    },
    {
      "text": "I have had we're just getting it back in right now. The belt will be back here on Monday. Certainly before PAX East, if not before PAX East. At least a little bit after PAX East. The belt will be back. You're the biggest son of a **** I've ever met. We're not doing this show next week. God damn it. God damn it, Nick. It's an Sorry. God damn it, Lord and Savior. Thank you. Thank you. Thank you. I'm noticing my hair. Kevin, you're the one. I got it cut this morning. It is especially shellac. It's got It's definitely got some It's got It's got like a It's got like a **** It's like a one of those rock legend. I think I'm just going to mess it up a little bit. Pull it down a little bit here cuz I feel like it needs to just have a little bit more of a hang. There you go. That's better. The guy that does my hair I think is pretty stone, but he's very very um he's very very good at what he does. Yo, dude. All the girls in the place love him cuz like he's leaving and I I had to break the",
      "start": 138.24
    },
    {
      "text": "guy that does my hair I think is pretty stone, but he's very very um he's very very good at what he does. Yo, dude. All the girls in the place love him cuz like he's leaving and I I had to break the news. I guess he had gave it to me to break the news to the front desk girls and I was like, \"Yeah, I guess he's going into Santa Cruz.\" like, \"He's leaving.\" And I was like, \"Is that bad?\" They're like, \"That's very bad.\" Yeah. Are you still going to go to that barber shop now? Yeah. I have another guy that I go to. I I go back and I have two really strong guys there. This guy I like because he does the the the the fade a little bit better. The other guy I like cuz he does the beard better. So that's, you know, six to one half the other. Now, here's what I'm going to do, champ. Yeah. I'm going to help you out. You You're doing this thing where you roll the sleeves. This one's This one's getting loose on you. This one's getting real loose on you. Also, I haven't done arms in forever, so",
      "start": 180.24
    },
    {
      "text": "to help you out. You You're doing this thing where you roll the sleeves. This one's This one's getting loose on you. This one's getting real loose on you. Also, I haven't done arms in forever, so it's like useless to roll this around. What do you mean? Look at how great it looks. Yeah. All right. Get it. Get it. If you didn't know, ladies and gentlemen, this is the Kinda Funny Morning Show. Each and every weekday here on twitch.tv/kindafunny games. We come to you with the nerdy news you need to know about before jump in the chat to answer your questions, comments, and concerns. In between those two segments, I reach the internet. Grab a video game, toss it out to one of you. It's easy to win. Be in the chat like you are right now. or if you're watching on YouTube or a podcast service around the globe as you now can since the show goes up later as podcast and a YouTube video, you can win by being a Twitch sub, which is free if you're an Amazon Prime sub. You can give us your Twitch",
      "start": 213.12
    },
    {
      "text": "the globe as you now can since the show goes up later as podcast and a YouTube video, you can win by being a Twitch sub, which is free if you're an Amazon Prime sub. You can give us your Twitch Prime sub or supporting us on patreon.com/kindfunny or kind of funny games. Um a lot of people are saying in the chat that they're wondering how long my unprecedented reign as champion can go on for uh because they say I am quote avoiding matches. That is not what is happening here. Okay that is fake news. What is happening here is the belt is out for some alterations and for some cleaning and it will be back within one to two months. Okay but in that time it's unfortunate we can play. It just won't count as an official course. Of course, Kinda Funny World Championship. It just won't count unfortunately. I see what you're This is not my I didn't write these rules. This is you're playing. In fact, point of clarification, nobody wrote these rules, right? Well, we're making fun. So here's the",
      "start": 249.6
    },
    {
      "text": "I see what you're This is not my I didn't write these rules. This is you're playing. In fact, point of clarification, nobody wrote these rules, right? Well, we're making fun. So here's the only upsetting thing about it. Yeah. Anytime you want to put me in the frame of the camera, Kevin, while I talk would be awesome. I know it's they call that the champ cam. Give me the champ cam one more time, Kevin. If you want to give him champ cam and put my me as a lower third, I'm fine with that. That's how it's got to be. That's how it's got to be. I understand. My only problem now is that's clearly you've done it. You've I've had this struggling federation, the Kinda Funny Nintendo World Championship forever and all I've had is some **** jobber named Tim Gettys. Thank you very much, Kevin. A little smaller, please. A little smaller, please. A little smaller, please, Kevin. All I've ever had is this jobber, Tim Gettys, can you go on that? There it is. That's great right there. Thank you.",
      "start": 290.48
    },
    {
      "text": "little smaller, please. A little smaller, please. A little smaller, please, Kevin. All I've ever had is this jobber, Tim Gettys, can you go on that? There it is. That's great right there. Thank you. No. Get out of it. Get out of my way. Sorry. I apologize. Tim Gettys. We've been going down. No one's ever cared. It's been a blood bath. I I **** work him over every time. Destroy him. He destroyed him. When you won, I thought the gimmick, the angle we were going to take is that we're united in our hate for Tim and we would mock him for being the shortest Kinda Funny Nintendo World Champion of all time. But now you flipped it. Now you flipped it. Now you are asking for the real Neil Holyfield here. You are an angry little man. I'm going to have to take you down. If I can somehow keep this belt until Kinda Funny Life 3, then we can have a showdown. But that's a little ways away. June 30th. My question is, yeah. Will you be a man and accept the challenge right now for PAX East at the",
      "start": 334.24
    },
    {
      "text": "belt until Kinda Funny Life 3, then we can have a showdown. But that's a little ways away. June 30th. My question is, yeah. Will you be a man and accept the challenge right now for PAX East at the panel 8:30 in the Dragon? Absolutely not. Commit to that. I cannot I I will say this. Um maybe if the belt is back from cleaning by then and uh if uh if the alterations that I've done to the belt, if it fits me, then yeah, we can go. That's what you're doing. That's the alteration. You're bl you're letting the belt out all the way so we us grown men can actually wear it cuz we're far too I put it on yesterday. I was like, \"Ooh, almost.\" You're like, \"Does that fit you?\" And you're like, \"No.\" Like, \"No.\" It's like made for like a 10-year-old. It's definitely a toy belt. Toy belt. All right. Fine. I accept the challenge. PAX East. East. I'm going to I'm not 017 Dragonfly Theater. 8:30 p.m. Okay. All right. There we go. I'm going to be drunk, so it'll be It'll all work out just fine. Now",
      "start": 375.2
    },
    {
      "text": "I accept the challenge. PAX East. East. I'm going to I'm not 017 Dragonfly Theater. 8:30 p.m. Okay. All right. There we go. I'm going to be drunk, so it'll be It'll all work out just fine. Now here's my next question. As the show continues, Colin, come here for a second. Come here, you beautiful son of like this ethereal being that just comes into our life, does these amazing interviews, and then just leaves. That's what he does. He's got We got him on the hook though today. He's got one in the afternoon, too, so he can't get away. Come here. Come here. Where you been on my hook? Come on. Come here, B. How you been? Give him a hug. Come here. Give him a **** hug. That's what I like to say. Kids miss you out there. They miss you out there. Now here's what I heard. I heard a rumor today. You **** sexy Italian sausage. You know what I'm saying? Irish potato. You know what I mean? What I heard was Come on. Stay on camera. Don't be running away from it. What I heard today is that",
      "start": 416.4
    },
    {
      "text": "You **** sexy Italian sausage. You know what I'm saying? Irish potato. You know what I mean? What I heard was Come on. Stay on camera. Don't be running away from it. What I heard today is that your Switch pre-order isn't coming today. Is that correct? Yeah. Tomorrow. Do you want mine? No, it's okay. I'll uh I think it's all come to the office tomorrow or something. Well, I hope so, but I mean I just want What if we're not here? I mean, we're here for the photo shoot thing. Uh no, it's I mean Okay. I'm just trying to help. I I still have to get through the side quest I didn't do in Horizon. And we got Wildland stuff. I'll just play that. All right. Give me a check. Thank you. I was going to order beeps in a while. Anyone's interested. I promise Kevin a pizza today. Can we sway you a pizza? What kind of pizza? Any kind you want. I want a good place for me to stand. Yeah. I want some crispy pepperoni on this thing. I want some crispy pepperoni on this thing. Where are you getting it",
      "start": 453.92
    },
    {
      "text": "What kind of pizza? Any kind you want. I want a good place for me to stand. Yeah. I want some crispy pepperoni on this thing. I want some crispy pepperoni on this thing. Where are you getting it from? I don't know. I've left that up to Kevin. He was trying to find a round table. He said we could just We could just Is this Is this a better That's great. That's perfect. That's exactly what you want. I uh I feel like we could uh get uh just get beeps and put it on a pizza. Wow. Okay. Beeps pizza. We can do both. We got all that Patreon money coming through. I'm fine with pizza. All right, cool. I just have Mike Bethle coming in at once, so I need Oh, yeah. We're call Mike Bethle and see if he's cool with pizza. Yeah, Mike Mithla loves pizza. British. He is British. Very British, actually, too. Um a couple people are saying, \"Wouldn't it be a shame if Nick missed his flight to PAX, don't pull this **** Scorpino. Get your ass to that panel.\" I will make every possible uh attempt to get",
      "start": 489.92
    },
    {
      "text": "Um a couple people are saying, \"Wouldn't it be a shame if Nick missed his flight to PAX, don't pull this **** Scorpino. Get your ass to that panel.\" I will make every possible uh attempt to get to that panel on time. I cannot control the traffic to that panel. You can't. You're in the same Uber as me. You're on the same flight as me. where I'm staying. Maybe our hotel rooms are separate. I put you in an Airbnb. I am in a hotel. That's That's a good point. See, I don't know. I don't know what's I don't know what's going to happen here. I don't know what's going to happen here. We'll see. We're We're going to try. We're going to We're going to commit to this fully at approximately about 80%. Okay. Now, Tim, of course, wanted to have a number one contender match. I don't know if we have to do that ahead of time if we I think you need to because here's the deal. I beat you so decisively. That's not true. That it's not fair to just give you a rematch. You got to work your way back up",
      "start": 527.44
    },
    {
      "text": "to do that ahead of time if we I think you need to because here's the deal. I beat you so decisively. That's not true. That it's not fair to just give you a rematch. You got to work your way back up the ranks. That's true, man. You got to start with Kevin. Whoever wins out of Kevin are saying cool gets it very decisively. He beat me decisively. A lot of people are saying it. It went to game three. Which means at one point we were tied. That's not decisive. I understand that. But people are still saying it. So that statement is still true. There's people I I haven't seen the word decisive come up. But there's a paraphrase in there somewhere like um someone says super cool Tony says, \"Geez, I'm hungry now.\" That's clearly a nod to there's lots of victory that I uh uh uh dealt out to you. Nick, you're making an excellent point last week. You're making an excellent point. You know, it's like when Conor McGregor fights people, it's just not fair for the other person. It's not your fault.",
      "start": 570.08
    },
    {
      "text": "you're making an excellent point last week. You're making an excellent point. You know, it's like when Conor McGregor fights people, it's just not fair for the other person. It's not your fault. You just didn't Oh now here you go. Here is a good point that you don't even This is something that's lost as we talk about your win, your victory, Lord and Savior, is that Iceman 333933 says game one Greg wasn't on his toes. So technically disqualified. That's fair. That's fair. Also, you didn't understand that sentence at all. I did. I definitely did. But here's the deal. Also, that game, you don't need to do any of those poses. All you have to do is hold that **** thing steady. That's all it works. But we want But I didn't realize that until because you didn't tell me that because what you like to do is throw me into the deep end with Z. I'm never First time playing the Switch. Knocked it out of the **** park. Champ Cam. You did. I'm working on something, bud. Oh god. Thank you. It's",
      "start": 611.44
    },
    {
      "text": "like to do is throw me into the deep end with Z. I'm never First time playing the Switch. Knocked it out of the **** park. Champ Cam. You did. I'm working on something, bud. Oh god. Thank you. It's nothing, dude. Sure. It is nothing. Don't Don't forget that you work hard on whatever you're working hard on, but you got to work on getting a pizza, too. Oh, do you want me to do that now? I was going to wait till 30. Can the chat remind us at 30? Hey, at 11:30, can the chat remind us that we need to order a pizza? I'll I'll type a reminder in. Thank you. Nick's making a Mooot reminder in there. There it is. There it is. That's exactly Thank you. Yeah, there you go. Thank you everybody for the that. Uh can we You want me to go into the things and stuff then, Kev, while you do your thing? Yeah. Yeah. Yeah. Go for it. Go Uh ladies and gentlemen, let's get through some of the reminders and announcements here. Number one, Kinda Funny Live 3 tickets are on sale. They are selling",
      "start": 650.48
    },
    {
      "text": "thing? Yeah. Yeah. Yeah. Go for it. Go Uh ladies and gentlemen, let's get through some of the reminders and announcements here. Number one, Kinda Funny Live 3 tickets are on sale. They are selling incredibly well. Thank you all for your support. That doesn't happen. You need me to lean into it? Okay, we got to go. We got to go a little less with the Iris. That's what I'm telling you. No, I think I think I just I tell you what, man. You lose the Kinda Funny Nintendo World Championship. They don't even care to put your camera in focus anymore. Like you have a camera at all. Uh you can do this at your **** desk. Just June 3rd, Kinda Funny Live 3 here in San Francisco. Day two, the VIP day. Tickets are on sale. VIPs are sold out. You can still come to Kinda Funny Live 3 Saturday, June 3rd. Come have fun with us. Uh next one. Springs to life, I believe, from the Games Cast. That's early now for Patreon supporters. No, that doesn't make sense. Maybe it's just from a G. I don't",
      "start": 687.2
    },
    {
      "text": "June 3rd. Come have fun with us. Uh next one. Springs to life, I believe, from the Games Cast. That's early now for Patreon supporters. No, that doesn't make sense. Maybe it's just from a G. I don't know. Joey Noel did her job because at one point I yelled, \"Hey, Joey Noel, set up a Horizon Zero Dawn photo contest.\" That's real. It's up on the forums right now. I believe the short link is kindafunny.com I shut my email photocontest or something like that. Hold on, I'll tell you two seconds. Probably by the time I load the email, the chat will be able to tell me. But I tweeted it so you can just go to my Twitter, too. Basically, the idea is everybody's playing Horizon Zero Dawn. Go take photo mode photos like I did because I love it. And then uh you can put them up here. Your best three. And there you go. No, this is the badges. I don't know. Joey emails me a lot because she's really good at her job. Yeah. But then it just kind of becomes white noise. God. I know. Just starts",
      "start": 726.32
    },
    {
      "text": "three. And there you go. No, this is the badges. I don't know. Joey emails me a lot because she's really good at her job. Yeah. But then it just kind of becomes white noise. God. I know. Just starts talking. You're like, \"Oh my god, dude. Just do it. Just do it. I don't care what it is.\" Horizon contest. Horizon contest. Four parts. It'll come out. Ricky put out the wrong one. Earlier Horizon Contest is what you're looking for. Uh anyways, go there. You can do that. You have quite some time. It's I think we're talking about the 13th week we got back. No, you're just now champ Lord Savior. You're not You're just doing that. You're just shoving some. I don't know. Horizon contrast. That's what it is, right? I just like that quite a bit. I just saw a fade. What is Kevin doing over there with the fades? Nothing. Nothing. Okay, great. Keeping the **** And then a shout out cuz uh shout out to the team here right now. Our Logan review is live. YouTube.com/kindfunny. You can see it right",
      "start": 769.68
    },
    {
      "text": "the fades? Nothing. Nothing. Okay, great. Keeping the **** And then a shout out cuz uh shout out to the team here right now. Our Logan review is live. YouTube.com/kindfunny. You can see it right there. You go watch it there. kindafunny.com for short. Shout out of course to us for working late. Congratulations to us. Cheers. Cheers to that. And then a real cheers to Kevin for staying here super super super super **** late to get this live last night. Thank you. Woke up this morning cuz I would have told you just to go home, but I know you wouldn't listen. No. Like I tried to take I tried to take it home last night too to do it. You weren't going to have it. So you stayed here with broken ass internet. Yeah. I don't know what the hell's going on. Be **** fun. And so then you got this. By the way, the internet seems to be weird here. So if we ever just drop out, **** see you later. We're eating pizza. Uh but great job Kevin. Thank you for getting that left. No worries. Uh just",
      "start": 810.8
    },
    {
      "text": "By the way, the internet seems to be weird here. So if we ever just drop out, **** see you later. We're eating pizza. Uh but great job Kevin. Thank you for getting that left. No worries. Uh just a a slight reminder. If the internet drops out, we are still recording here. You need a professional. So don't leave. Don't just drop off. Well, I mean, close the show out and then we can post it on podcast. Here's a question. YouTube and podcast services. I have a question about drugs. Yeah. I wonder who I could ask. Hey, Nick. Um if I was to drop acid during the show, how how fast does that work? I'm pretty sure it comes on pretty quickly. Yeah. Did you do that? Is that the guy you expected? That would be funny if like we went off the air and I was like, \"Fuck it. I just dropped acid.\" Guys, we're clearly not going to do anything for the rest of the day except for those 10 let's plays we had and the Lizard King. So go watch the Logan review. Yes. Remember the Logan review starts",
      "start": 849.2
    },
    {
      "text": "Guys, we're clearly not going to do anything for the rest of the day except for those 10 let's plays we had and the Lizard King. So go watch the Logan review. Yes. Remember the Logan review starts spoilerfree. And when we're we say, \"All right, now we're going to do spoilers.\" We do spoilers. So even if you haven't watched it, you can watch it for opinions. And if you have watched Logan, you can jump in, get the whole experience. In short, though, Logan great. Logan's awesome. Loved it. Loved it. Yeah. If you I highly recommend watching it before you watch our reacts always u just to see if you agree or disagree with us. But I liked it a lot. I think it's I think it's definitely worth going to see in theaters. As always, I highly recommend you just go to like the Apple store and put Kinda Funny videos on every device there so they just get all the views. Oh man, you know what's funny? They love that. Oh they Oh yeah totally. They really love it. They don't care about it. They",
      "start": 888.8
    },
    {
      "text": "of funny videos on every device there so they just get all the views. Oh man, you know what's funny? They love that. Oh they Oh yeah totally. They really love it. They don't care about it. They they catch you usually about the third device and kick you and kick you out. No, they don't. Ask you to leave. But I think it's fun. Also, right next to that tab, open up X videos. Um what are we talking about today? We're talking about the news. Great. First story, Kevin. Oh you abandoned his post again. Do we talk about Did you I I put it in red to pimp it out. Yeah I I talked I talked about in the very beginning. Remember when I went through Remember of course if you have Amazon Prime you have Twitch Prime. You have a free subscription. Go and give it to us if you don't mind. No big deal. If you don't want to give it to us I'm fine with that. It's cool. We get it. Yeah it's **** **** up but whatever. Uh it's fine. You want to bang other people? Whoa. Bang other people. Bang",
      "start": 926.24
    },
    {
      "text": "If you don't want to give it to us I'm fine with that. It's cool. We get it. Yeah it's **** **** up but whatever. Uh it's fine. You want to bang other people? Whoa. Bang other people. Bang other people. It's fine. Maybe I'll see other people, too. Maybe I can get laid. Can you? No you could. No. Yeah you could. I don't have it anymore, man. I don't think I ever had it. Yeah you do. I got a moment and it was gone. You know what I mean? I think it's because when you when you when you get married, you lose all that testosterone cuz you don't need it anymore. Your wife doesn't need you to be a man anymore. You're just basically a really warm pillow at that point. Sure. That you can choose to snuggle up to not. What up Rob? How you living? Good. Are you allowed to come on live things or is that probably a bad look for you? Probably a bad look for you. There's a guy named Rob here. Don't worry about it. Come on and just tell us one thing that you would never say live. Not don't",
      "start": 963.68
    },
    {
      "text": "Or is that probably a bad look for you? Probably a bad look for you. There's a guy named Rob here. Don't worry about it. Come on and just tell us one thing that you would never say live. Not don't do that. Get do one fireable offense please for us today. Uh and if you're wondering is it Rob Thomas from Mashbox 0? It is. It is. It's real. I must be lonely. Oh my god. This is what they call padding time when your producer comes. I know. Hey there's Kevin's back. All right. Oh yeah. Hey one day I'm going to one day I'm going to remember at the end of a show to ask what was what was so important in the middle of the show. It's private stuff. Damn it. I want to know. Oh here's the biggest question. **** I forgot all about this. So Kevin here today walks into the back talking to Jean Viv Stone who's buming around back there and says, \"Or maybe it was even to you. I forget. Do you know my house could be on fire right now?\" And then I hear him say, \"The deal is that Paula called",
      "start": 999.12
    },
    {
      "text": "Viv Stone who's buming around back there and says, \"Or maybe it was even to you. I forget. Do you know my house could be on fire right now?\" And then I hear him say, \"The deal is that Paula called him swearing she left her curling or flattening iron on.\" Kevin saying, \"I swear you didn't.\" And then Kevin ran home to check if it was actually on. I need to know Kevin. I'm on pins and needles. Was it on? Oh no. Ma'am, my house burnt down. So was it on or was it not on? So did you you tell Paula never doubt me? Uh no. I said it. Uh our house is not burning. Here's exactly. Would you like me to have Would you like me to have everybody tweet at Paula, don't doubt Kevin? No. Definitely not. Here's exactly. First off, tweet Apollo. Give her some sweet tweet nasty love today because here's exactly how that conversation went. Baby, it's not on. It's definitely not on. It's definitely not on. Checks it whether or not it's on. Calls her back. I was right. You should always porcelain sinks",
      "start": 1049.68
    },
    {
      "text": "exactly how that conversation went. Baby, it's not on. It's definitely not on. It's definitely not on. Checks it whether or not it's on. Calls her back. I was right. You should always porcelain sinks melted. Yeah. Yeah. It's like it definitely wasn't on. I told you. I told you. Never doubt me. Wear the dress I put out for you. Wear the dress I put out for you. I'm just saying. You know me well. There's a little bit of a emotional abuse happen. All right. First real story over at Techno Buffalo. This comes from Joey Davidson who for some reason there Oh that doesn't look like now. Kevin, did you highlight that or is that blue behind that? No that's that's just how it is. That's not on mine. So it's white on white Nintendo Switch screen scratched by Doc Dawn the the screen protector. Now uh I did my own pet peeve here where I didn't link over to Gixel, sorry, or Gixel everybody, which is a dumb name. The fine folks at Gixle, Rolling Stones relatively fresh gaming outlet, have",
      "start": 1090.08
    },
    {
      "text": "Now uh I did my own pet peeve here where I didn't link over to Gixel, sorry, or Gixel everybody, which is a dumb name. The fine folks at Gixle, Rolling Stones relatively fresh gaming outlet, have reported a problem that virtually all Nintendo Switch owners will face. Here the systems dock scratches the screen. Here's the word from them. We've been super careful with our Switch since it arrived over a week ago and we've been keeping it nestled comfortably in one of Miguel's giant woolen socks whenever we transport it. Unfortunately, after only a week of daily use it's already getting a heavy collection of little scratches on the bottom hand corner as you can see in this photo. Then they show the photo. Scroll down. Oh that's nasty. Hold on. That is That is That's not a screen. I thought that is an entirely overblown statement. And I feel like don't get me wrong if I I we've been putting my thing in and out a few days here, right? Nice transition Kev. We've been putting this",
      "start": 1131.92
    },
    {
      "text": "that is an entirely overblown statement. And I feel like don't get me wrong if I I we've been putting my thing in and out a few days here, right? Nice transition Kev. We've been putting this thing out a few days here or whatever. I have I checked this morning. No scratches on either my side. Even if I did and this is just Greg Miller. I'm fine with those scratches. Yeah you don't care about those. It isn't on the screen. It's on the What do you call that? The bezel there. Yeah the Yeah the bezel. Um I I feel like they could have maybe to alleviate that put a little bit of some sort of soft material in the That's the bigger thing is like if it's a real problem that everyone is facing totally like what the **** Nintendo but it's not enough for me to be like oh cuz I hate screen protectors. I got that don't do a screen protector. Don't be that guy. I got the case from Nintendo and it came with a screen protector. I was like no I'm not putting this **** on there. I don't care.",
      "start": 1168.8
    },
    {
      "text": "I got that don't do a screen protector. Don't be that guy. I got the case from Nintendo and it came with a screen protector. I was like no I'm not putting this **** on there. I don't care. I don't have a screen protector on this bad boy and I have a giant scratch in the center and you know what? I never see it. Yeah. You you really scratched that? Oh that's why you scratched it like week one of getting the phone. Yeah it was like but it was that thing we were in here. It was the same thing. We went and saw a movie and we sat down. I put it down. I'm like, \"What the fuck?\" And I looked at this thing and I had this scratch in there but the way the screen works when it's on you don't see it. Oh yeah. You got a lot of scratches on this thing. Well I have a lot of tiny ones but then I have this weird like curly key one in there. That's crazy. It kind of looks like a fossil fossilized like pubic hair. It does look like a fossilized pubic hair. Um Yeah that would drive me nuts. But",
      "start": 1204.88
    },
    {
      "text": "have this weird like curly key one in there. That's crazy. It kind of looks like a fossil fossilized like pubic hair. It does look like a fossilized pubic hair. Um Yeah that would drive me nuts. But but it's like and that's what I was really terrified but like really like you don't see it. No I have a bunch I mean my phone is like 5 years old and I have a ton of scratches on it. That's just the way it goes. Yeah it's going to happen. FYI this is a piece of technology that you interact with on a daily basis and you're going to be putting it in and out of cases. You're going to be bringing it in and out of planes. It's going to happen. The the question is to what extent will it happen? How quickly and how how quickly? How how much can people live with that? Yeah. Well I mean I know that would bug the **** out of me if that that to me is a design flaw with I agree. Again don't get me wrong. If it turns out that Yes this is the thing. It's totally design flaw. I'm not giving",
      "start": 1232.8
    },
    {
      "text": "that would bug the **** out of me if that that to me is a design flaw with I agree. Again don't get me wrong. If it turns out that Yes this is the thing. It's totally design flaw. I'm not giving Nintendo the out. Headline wise though I thought it was going to be this like you put it in. I was like, \"Fuck.\" See what they like. Okay. The screen. Don't dock your Nintendo Switch. Um but screen protectors suck. Yeah. Don't do that. They're like condoms. Yeah. Don't use them 100%. Or always use them. I have it on good authority from Jeff Canata. It's really hard to get a woman pregnant. It's true. He said there's only a two weeks. Rob's shaking his head. No. No. Rob said two tries. Oh **** Well really sperm. We have We have Do you trust Rob Thomas from Mashbox 0 or do you trust trust Jeff Canada? Anthony Carbon's lackey. Is that what he called? No we loved it. We He's excited. He's on Game Over Show. It was great. What the **** was that? I don't know. Kevin's doing something.",
      "start": 1263.6
    },
    {
      "text": "Jeff Canada? Anthony Carbon's lackey. Is that what he called? No we loved it. We He's excited. He's on Game Over Show. It was great. What the **** was that? I don't know. Kevin's doing something. Kevin is up to shenanigans over there with all the screens. Rob Thomas used to wear like those necklaces. He wore like puka shell. Don't they doesn't he still? Who knows what Rob Thomas? What the **** is Rob Thomas doing right now? What is he doing? Two chicks same time. Cocaine can't get him pregnant. It's hard to do apparently unless you're Rob Thomas. That's the funny thing. The more girls you do at the same time apparently the less percentage there is a percentage of you getting one of them pregnant. I think that's how math works. Well yeah. I mean like that's then it's Russian roulette. It's like you're spinning in the chamber. Yeah. You don't know which one it's going to be. Can't get them all pregnant. Yeah cuz you only have you can only do it once, right? And every week.",
      "start": 1305.36
    },
    {
      "text": "It's like you're spinning in the chamber. Yeah. You don't know which one it's going to be. Can't get them all pregnant. Yeah cuz you only have you can only do it once, right? And every week. That's what my wife tells me. This is just not fun. Oh my god. Next story comes from bungee.net chat. I know a lot of you play Destiny. I want your opinions in the chat to populate as I read this. Uh they talked about the road ahead here for this is from the Destiny team talking about the final expansion and Destiny. Hey everyone, we're planning to reveal the final live event for Destiny 1 era. the Destiny 1 era Wednesday. We're calling it Age of Triumph and we intend for it to be fun and memorable celebration that will bring the first major chapter of our Destiny adventures to a fitting close. We'll look back upon the three incredible years we've shared as a community and look ahead to some final challenges and rewards that await you in the weeks ahead. But first we want to answer some",
      "start": 1336.8
    },
    {
      "text": "We'll look back upon the three incredible years we've shared as a community and look ahead to some final challenges and rewards that await you in the weeks ahead. But first we want to answer some important questions you've been asking about Destiny's first full sequel. Sequels represent the start of a new adventure for every player with new worlds to explore, new stories to tell, new powers to acquire and new loot to earn and much more. This led us to the decision that that would enable us to serve both the game and the player's best interests. Destiny 1 powers, possessions, and Eververse related items and currency will not carry forward. They will however remain accessible to you in Destiny 1. We know that just we know that just like us you have grown fond of the guardians you've created. So we do plan to preserve your character personalization. We are going to recognize the dedication and passion you've shown for this world. Specifically the class, race, gender, face, hair",
      "start": 1375.2
    },
    {
      "text": "So we do plan to preserve your character personalization. We are going to recognize the dedication and passion you've shown for this world. Specifically the class, race, gender, face, hair and marking selections for all characters that have achieved level 0 and completed the Black Guardian sto Black Garden story mission will carry forward. We also plan to award those veteran accounts with honors that reflect your Destiny 1 accomplishments. We believe this is the best path forward. It allows us to introduce the major achievements and improvements that all of us expect from a sequel ensuring it will be the best game we can create unencumbered by the past. We're looking forward to sharing more details with you later this year on how to like blah blah blah. So basically there's the thing. You put all this stuff in to Destiny. Yep. Now it doesn't carry over. Yeah. Do you care chat? And I'm looking through here. Uh yes they do. Just spoilers. There's a few people that have some",
      "start": 1418.64
    },
    {
      "text": "You put all this stuff in to Destiny. Yep. Now it doesn't carry over. Yeah. Do you care chat? And I'm looking through here. Uh yes they do. Just spoilers. There's a few people that have some choice words for this. I that when I read it I was like, \"Oh fuck.\" Okay. Like I can totally see why people are going to be mad about this. I as somebody who is not the biggest Destiny guy I you know played through the original portion of the game beat that. Um I don't know what level that got me to or whatever. I think it was like I think it was level 30. Was that a 5 0 whatever in the middle that you stopped playing at? And then you you came back and you used the thing and you got to play more of the thing. Whatever. I was never that guy down that rabbit hole. This makes sense to me. You get to carry over the look of your character. Great. You know what I mean? like I don't mind jump. Don't you want to get in there and start fresh and welcome new players and do all these different",
      "start": 1457.44
    },
    {
      "text": "get to carry over the look of your character. Great. You know what I mean? like I don't mind jump. Don't you want to get in there and start fresh and welcome new players and do all these different things? A lot of people are saying now. I think there was just a few a few bad eggs in the chat but a couple people were saying, \"Yeah it's a nice fresh start. They want to do it.\" It's just like uh starting your drug addiction all over again. Exactly. You know it's great. Yeah. It's fantastic. Yeah. Okay. Well good. And I'm glad everybody's not too freaked out because that was the thing. I was worried about it. You have to have that reset eventually though, right? To get that like to resto the fires of the passion for whatever you're doing. For me it's the is the at the fact of if you're bringing over your character why is it on champ still? Why isn't it? I was playing with it. Let me see it Kevin. Oh jeez. **** god. It's not big enough. Oh it's perfect. That's perfect. Is it",
      "start": 1496.08
    },
    {
      "text": "bringing over your character why is it on champ still? Why isn't it? I was playing with it. Let me see it Kevin. Oh jeez. **** god. It's not big enough. Oh it's perfect. That's perfect. Is it whenever you transition into the champ cam you're going to get that? Give it uh give me a transition over to Greg. See if there's a No there's nothing here. Oh can you have a little stinky like garbage pail coming through? Can it was made. Could it play the W loser? Oh we have fun. **** him up Alf. Indeed HK. No it makes sense to me. I I think you want people able to jump in there. You want him all star from the base. You want I I think the fact that you get to carry over your look is the most impressive. And here's what I was thinking. Yeah Rob Thomas you might be able to help me cuz he he definitely can't in Mass Effect. It's I didn't carry over all my It's not like I came in a souped-up Shepherd. I had to restart kind of, right? Well and two they like rip you apart and Right.",
      "start": 1529.28
    },
    {
      "text": "he he definitely can't in Mass Effect. It's I didn't carry over all my It's not like I came in a souped-up Shepherd. I had to restart kind of, right? Well and two they like rip you apart and Right. That Yeah. Exactly. Exactly. Exactly. There was some benefit though from beating one to go and going going into two. I'm sure there's a benefit. There's benefits here too. There's going to be markings and I'm sure items and Ingrams and all this dumb **** that when you turn it on it's like, \"Hey thanks for doing everything being Alfredo and being crazy.\" I don't think it's like It's just like, \"All right cool. You look the same. Enjoy it.\" Like I I just don't think they want you to come in and be like, \"All right cool. You're already level 55000.\" Yeah. Yeah. So **** off everybody. Uh Kevin the chat is starting to scream pizza as well. I actually just started looking. Good job Kev Dog. Rob you up for some pizza? We're going to order some pizza. Crispy pepperonis. Oh yeah.",
      "start": 1571.28
    },
    {
      "text": "Uh Kevin the chat is starting to scream pizza as well. I actually just started looking. Good job Kev Dog. Rob you up for some pizza? We're going to order some pizza. Crispy pepperonis. Oh yeah. Of course it's going to be wings. Oh **** Have you ever had Goat Hill Pizza? It's awesome. Yeah let's get that. Cool. Awesome. Packages came where they I'll go check. Thank you. A lot of things happening over here. It's a big day. Kinda Funny. Are you getting up? Then I'll read some tips. How about that? Can you put down like what you want for the pizzas or should I open crispy pepperoni? Okay. Can you Can you actually look it up cuz there's a lot of options. Let's go. Oh no. He wants us while Buffalo chicken goes crazy. So you're asking the people who are hosting the show to stop hosting and look up. I mean it's just not that hard I think to figure out what I want crispy pepperoni pizza. Look at it. Well do they have pepperoni? Crispy pepperoni pizza. What does that mean? I",
      "start": 1603.04
    },
    {
      "text": "and look up. I mean it's just not that hard I think to figure out what I want crispy pepperoni pizza. Look at it. Well do they have pepperoni? Crispy pepperoni pizza. What does that mean? I mean I want these pepperonis like like they're barely pepperoni like they're little tiny like boy nipples. Oh we got some packages. Got some Switches. Got some Pro Controllers. Are you Are you looking up stuff? Yeah I'm looking at the tips. No. Get a pepperoni pizza pie. Jean V st. Are you fine with crispy pepperoni pizza? Yeah. All right cool. Come give me a back while we open this. Business. She was going to go to a business meeting and then just decided to work from here. Business meeting out. Yeah. Okay. So I'm getting pizza too. Oh yeah. Yeah. Do you What do you want? What pizza wise do you want? Kevin wants everybody to go look at the pizza menus. No it's fine. No one of those for me for Christ's sake. Is that mine? No these are both for me. Damn it Amazon. You failed me for",
      "start": 1642.4
    },
    {
      "text": "do you want? Kevin wants everybody to go look at the pizza menus. No it's fine. No one of those for me for Christ's sake. Is that mine? No these are both for me. Damn it Amazon. You failed me for the last time. No they haven't. And And again it's not they failed you. It's the people who dropped it. It's my pro controller. It's Oh I didn't get my **** package cuz Amazon's failed me. They failed me. Do you have Prime? Do you know if you have Amazon Prime you have Twitch Prime and get a free sub. Have you given that to us yet? Get Have I g Oh I have not. I should. I don't either. We have so much fun. It's my Switch. Yeah. What is it? What is it? My Switch. Oh it's your Switch. What switches do we have here? Well this is the office. You can It's the office Switch cuz I'm going to use it Nick. Nintendo sent us a two switches. Tim and I had ordered our switches, right? So now my Switch I want I want a Switch here so I no longer have to bring the dock back and forth. That's",
      "start": 1689.12
    },
    {
      "text": "to use it Nick. Nintendo sent us a two switches. Tim and I had ordered our switches, right? So now my Switch I want I want a Switch here so I no longer have to bring the dock back and forth. That's smart cuz then we just bring the switch. You can buy a dock too, right? Yeah you can. Yeah I don't think you can right now. Oxim was telling me happy to have a pro controller. Finally man they're boxes. Even I don't ever play. I just want This is hotness, right? This is all the hotness. Look at how good that is. Always been great about their like just everything you got to interact with. It's pretty. Of course. Should I read the tips or you want to read the tips? You go ahead and read the tips. All right. Tips. Can I get a champ cam? Yes. All right. You need to honor. You need to the former champ. Anner. What the **** was He's trying to slow it down. Oh you can slow it. I thought it was just like chugging like a running on the V out here. Tomato_net says, \"Taking a break from the",
      "start": 1736.88
    },
    {
      "text": "champ. Anner. What the **** was He's trying to slow it down. Oh you can slow it. I thought it was just like chugging like a running on the V out here. Tomato_net says, \"Taking a break from the sweet Switch action to catch my first live show. Love you guys. Here's a tip and a clip to celebrate.\" Kevin you will vet that. Brandon Smith says, \"Hey guys wondering if I could get a shout out to my best friend Devin. We're both huge fans. Also hope you enjoy this fun clip.\" Shout out to Devin. Hey Devin I'm sorry. Hey Devin it's me Greg. Former Kinda Funny Nintendo World Champion. Just wanted to say here on Champ Cam shout out. You can't get if you want to. Yes. Thank you Kevin. I'm sorry. I just I didn't have the words just I was so angry. No I'm fine because that's what Champion does. Champion deals with adversity properly and gets through. It's not how **** fast you get up. It's how fast you get knocked down and get back up. Yo the video this guy sent was stupid. Okay.",
      "start": 1774.24
    },
    {
      "text": "does. Champion deals with adversity properly and gets through. It's not how **** fast you get up. It's how fast you get knocked down and get back up. Yo the video this guy sent was stupid. Okay. Well you suck. The Andy Prince says, \"Happy Friday family. Be safe and have a good weekend.\" Well thank you for that sir. SNS Chalmer's 34 says, \"Finally landed a job and wanted to spread the love. If this fun clip doesn't make you laugh Lola can execute me on the spot.\" Well that might happen anyway because Lola has become very totalitarian these days but but Kevin will will vet that clip and if it's not feel like you just feel the bullet going into the back of your ear. Damn she uses a you know what I mean? She comes up doesn't make a lot of noise doesn't exit rattles around the brain just scrambles it. So even if you live you're just like Wolverine in the Hit Wolverine movie. The Wolverine Origins. X-Men Origins. Yeah X-Men Origins Wolverine Guinness 516 says",
      "start": 1815.92
    },
    {
      "text": "the brain just scrambles it. So even if you live you're just like Wolverine in the Hit Wolverine movie. The Wolverine Origins. X-Men Origins. Yeah X-Men Origins Wolverine Guinness 516 says, \"Leaving my good vibe tax. Brought my Kinda Funny Life free VIP tickets Wednesday.\" Thank you sir. Uh my housemate lucked out and found a Switch Zelda last night and I just found out that I'm going to be an uncle. Life is great. Holy **** That's fantastic. Good job knocking up your sister. Jesus. Oh Lord. How do you know it wasn't me? Mr. Falconard said, \"Greg KFL3 you've taken out Alex, Trevor, and Cameron and FaceTimed three moms.\" Yeah. You stand there victorious when out of nowhere a tarantula falls out of the from the rafters and the waterman appears behind you. What do you do I guess is what he's trying to say. I fall to my back. Nick bongos the tarantula off of me. I then spring back up kicking the water man in the face who drops his water. His mask falls off. It was Col Mori",
      "start": 1856.48
    },
    {
      "text": "is what he's trying to say. I fall to my back. Nick bongos the tarantula off of me. I then spring back up kicking the water man in the face who drops his water. His mask falls off. It was Col Mori Arti all the time. Oh **** I then stone cold stunner Col Morardi. FaceTime Betty Anne. Turns out though she doesn't answer. She's in the room. She gores me like Rhino through a table. She stands up. She's now the Universal Kinda Funny wrestling champion. Now the big question I have for this and hopefully Colin can hear me because I I'll just raise my voice a little bit is what what do you think Betty's wearing when she does this? Kinda Funny t-shirt and jeans. All right. All right. All right. Wait got a couple more tips. Josh Anderson says, \"Hi Greg and Nick. First off it's amazing when Tim and Greg remember me from RTX Sydney. Always makes my day. Thank you guys for being awesome. Love you guys.\" Here's a fun clip for the fun clip section. Captain of a snack sinking ship says",
      "start": 1899.44
    },
    {
      "text": "when Tim and Greg remember me from RTX Sydney. Always makes my day. Thank you guys for being awesome. Love you guys.\" Here's a fun clip for the fun clip section. Captain of a snack sinking ship says, \"Okay we put there.\" Sorry you spelled it out. You literally spelled it out for me on that one. I **** that up. Nick your hair is on fleek. Love you guys so much. Here's an 11second clip guaranteed to make you laugh if it doesn't ban me. Kevin yeah ban his ass. That was garbage. You banned. Kevin are you at Ewok? He says question mark. And I feel like Kevin maybe you're just uh angry about the last comment. Julio has given us fun. Clip says, \"You guys are great. Keep it up.\" Uh Rodrik first says, \"Love you guys and all you do. So sad VIP tickets are sold out. Thank you for keeping me sane while I prepare for my finals. One more week of torture before my trip to the gallows. Uh there are plenty of general admission tickets there and I'm sure you'll have a fun time uh in that",
      "start": 1939.76
    },
    {
      "text": "me sane while I prepare for my finals. One more week of torture before my trip to the gallows. Uh there are plenty of general admission tickets there and I'm sure you'll have a fun time uh in that area.\" Keep in mind too when I start hospitalizing fans at the VIP we'll probably start lighting standing room only in. Oh, yeah. If Greg kills 50 to 60% of the VIP people you're welcome in the balcony. You go out there. We We need it for the pictures. It has to look good even though it's not lit up there and you can't see people. Uh, Shredberg says, \"Finish Horizon Zero Dawn. It's a good game but it's not a good Horizon game. The open world just wasn't as good as the past games like Forza of Horizon especially Horizon.\" Okay, he had me. He had me. I was like, \"What?\" Good prequel. You got me. Good prequel, though. You got me for a second. I was like, I'm reading this wrong again. This is just me not reading this correctly. And then I got through the joke and realized he was",
      "start": 1979.36
    },
    {
      "text": "You got me. Good prequel, though. You got me for a second. I was like, I'm reading this wrong again. This is just me not reading this correctly. And then I got through the joke and realized he was making He was making it funny. Greg is making it funny. Kevin, have pizza pieces been ordered? No, I'm on that. I was **** checking the Kevin order. It ain't about who's right and wrong. It's about who's fighting Wong. Freddy Wong sucks. Let's fight Wong. Jimmy Wong. Freddy Wong. Jimmy Wong. Better. Jimmy Wong. Better. Jimmy Wong. Younger. Oh my god. I feel like you're dark. You're in darkness. It's this side of I'm really tan. So, it's very strange. Um, hey guys. I got tan cam. Give me the tan cam. Kev, this one. This guy, put on the one cam. Kev, can you give him a loser cam? Kev, thank you. Wow. Wow. When I click cut, it just cuts. But when I do this, yeah, they get the cham cam. I'm cham cam. No, that's cam. I love it every time. Uh, last few tips is uh from Frto says, \"Hey guys",
      "start": 2014.64
    },
    {
      "text": "you. Wow. Wow. When I click cut, it just cuts. But when I do this, yeah, they get the cham cam. I'm cham cam. No, that's cam. I love it every time. Uh, last few tips is uh from Frto says, \"Hey guys, there's a fun clip for this wonderful show on Twitch day. Love you guys.\" Uh, is today the day everyone gets their Switch off? Okay, that makes sense. Adrian A has given us a tip and a nice tip. It says, \"Happy Switch launch day, guys.\" Spoiler. Hey, Adrian. Uh, spoiler, it's a busy day and with not a ton of Switch playing happening. See you guys in Boston next week. We will see you, sir. You will. That's Mr. Amazon. That is Mr. Amazon. We call him Mr. Amazon. Call him Big I call him Big Time. You call him Big Time Amazon. Big time Adrian. Big time nature. Uh, Shredberg finished Horizon. It's a good game, but not a good Horizon game. It double tipped. We double tipped on. I'm sorry about that. Sorry about that. And raise night. We'll take your money though. Love you guys doing what you're",
      "start": 2064.88
    },
    {
      "text": "a good game, but not a good Horizon game. It double tipped. We double tipped on. I'm sorry about that. Sorry about that. And raise night. We'll take your money though. Love you guys doing what you're doing. Also a fun clip. Here it is. Boom. Cool. Uh, before we get into those fun tips, before we get back into that, let's keep going through the news over at Kotaku Steven Totello, friend of the show. Despite Avatar news, Ubisoft says Division franchise will be supported long term. I missed this Avatar news, so I'm bringing it up to everybody else. On Tuesday, Ubisoft said its Swedish game studio, Massive, will lead the development of a game set in the world of James Cameron's Avatar. That left some people, including us, wondering what that meant for the future of The Division. The 016 Massive LE co-op thirdp person shooter that got its last announced expansion also on Tuesday. Not to worry, Ubisoft says Avatar's development has no impact on the team working on The Division or on our",
      "start": 2114.32
    },
    {
      "text": "LE co-op thirdp person shooter that got its last announced expansion also on Tuesday. Not to worry, Ubisoft says Avatar's development has no impact on the team working on The Division or on our plans to continually support and update the game and brand for the long term. A Ubisoft rep told Kotaku, \"We're proud of what the team has accomplished with The Division, thankful for our community's dedication, and looking forward to sharing more about what's coming next for the game very soon.\" The rep noted that the Avatar game is a new project with its own dedicated team. Interesting. Could they be lying? Is the Division **** I sincerely doubt it. Division sold really well. I think everybody's gonna be fine. Rob, you've played The Division once or twice. Well, now if I start saying that though, then they're gonna track down what who this is. They'll figure out it's not Rob Thomas. Are you scared, Rob? You think they can do it? I think they'll be fine. There's plenty of developers in that",
      "start": 2150.64
    },
    {
      "text": "then they're gonna track down what who this is. They'll figure out it's not Rob Thomas. Are you scared, Rob? You think they can do it? I think they'll be fine. There's plenty of developers in that umbrella. It wasn't just Massive. Sure. So, but when I write my angry letters, I write them just to massive, you know, on Reddit, right? As somebody who's on the Reddit, the division all the time on Twitter. Next story is over at Reuters. Another Ubisoft one. This one applying to Wildlands, which Kevin and I are very excited about. Uh, hold on. Next. Yep. Okay. Sorry. No, it's fine, buddy. Don't worry about it. You're ordering pizzas. You're important. Uh, Bolivia complains to France about its portrayal in a video game. The Bolivian government has filed a formal complaint with the French French embassy about a video game produced by a French company that portrays the South American country as an area controlled by drug traffickers. authorities said the game Tom Clancy's Ghost Recon Wildlands",
      "start": 2193.12
    },
    {
      "text": "about a video game produced by a French company that portrays the South American country as an area controlled by drug traffickers. authorities said the game Tom Clancy's Ghost Recon Wildlands was produced by France-based Ubisoft Entertainment SA and is set to be officially launched next week. The game's beta version has already been downloaded six downloaded by 6.8 million users according to Ubisoft. Speaking to reporters on Wednesday, Interior Minister Carlos Romero said Bolivia had delivered a letter to the French ambassador and asked that the French government intervene, adding that Bolivia reserve the right to take legal action. Quote, \"We have the standing to do it. take legal action, but at first we prefer to go the route of diplomatic negotiation, Romero said. In the video game, according to a synopsis, a Mexican drug cartel controls Bolivia and has turned it into a violent, archaic narco state. Bolivia is the world's third largest producer of cocoa leaves used to manufacture",
      "start": 2234.16
    },
    {
      "text": "to a synopsis, a Mexican drug cartel controls Bolivia and has turned it into a violent, archaic narco state. Bolivia is the world's third largest producer of cocoa leaves used to manufacture cocaine behind Colombia and Peru. Yeah. In a statement to Reuters on Thursday, Ubisoft said the game is quote, \"a work of fiction and that Bolivia was chosen as the background for the game because of its magnific magnificent landscapes and rich culture and also all the cocaine.\" Quote, \"While the game's premise imagines a different reality than the one that exists in Bolivia today, we do hope that the in-game world comes close to representing the country's beautiful topography \" Ubisoft said. The French embassy in La Paz did not immediately respond to a written request for comment on Thursday. Bolivia, stop being a bunch of **** babies. Stop being a **** baby. Good **** god. This is as bad as when the when Brazil **** wrote into the Simpsons cuz they didn't like their portrayal. Shut the",
      "start": 2276.8
    },
    {
      "text": "stop being a bunch of **** babies. Stop being a **** baby. Good **** god. This is as bad as when the when Brazil **** wrote into the Simpsons cuz they didn't like their portrayal. Shut the **** up. It's a video game. You think I like seeing the US of A? Yeah. The best country in the world infested with division people. I got burning people in the streets cuz there's a thing here. Kevin, give me the one. Give me the champ. Give champ. Every **** disaster movie features the town we live in getting utterly destroyed. The **** Golden Gate Bridge always gets destroyed. You think I'm offended? No, because it's kind of cool. I get to go over it. It's not destroyed. Guess why? It's **** fantasy. Get over yourself. Kevin and Jam Cam. Thank you. I'm upset. Do we want to do I'm upset with Bolivia. Let me finish my Bolivia thing. Two extra large. That sounds about We have a lot of people here, but yeah, that sounds about right, right? Yeah, I was thinking so. Do they have wings?",
      "start": 2317.84
    },
    {
      "text": "with Bolivia. Let me finish my Bolivia thing. Two extra large. That sounds about We have a lot of people here, but yeah, that sounds about right, right? Yeah, I was thinking so. Do they have wings? Yeah, they do. Goat Hills got wings. You got to It's in salads and other stuff. I haven't had a good Goatill in a long time. I'm going to get the pork pie and uh just the pepperoni one. They got wings. All right, we're in. That's happening. Uh important to point out, Bolivia, a bunch of babies. Yeah. Also important to point out Tuesday we're doing a wildland stream. Big cab dog and meging me 11 to 5 playing with subs and get information over on the kinda funny forums. I'm sure there's anything. Yeah. Looking forward to it cuz no one's here. It's just us. Two kids hanging out playing video games. This is what I love about you. I would have just not done anything. You're going to play a 5 hour long stream. Well, my thing is I want to play this game. Yeah. And I got Zelda here. You do have",
      "start": 2371.12
    },
    {
      "text": "This is what I love about you. I would have just not done anything. You're going to play a 5 hour long stream. Well, my thing is I want to play this game. Yeah. And I got Zelda here. You do have Zelda as soon as we get back from PAX. Mass Effectin could hit me at any time, right? I like this is like I think Tuesday's honestly probably wild ends day. Are you done with Horizon? Oh yeah, platinum. Jesus Christ. How much time did that take you? 50 hours. Game clock said 50 hours. You're really good at games. No, thank you. You are. It's It's not the Nintendo world games, but you're really good at other games. PlayStation mostly only. I guess VA games, but I wouldn't know cuz I don't interact with that. You wanted a VA and you never got one. I did. Now and now you want a Switch. It's time to get one. I should get a Switch because I feel like they're going to support that. Um, what you should probably do is buy Tim's pre-order. Does Tim I thought does he already have one? Oh, yeah. Right.",
      "start": 2414.24
    },
    {
      "text": "get one. I should get a Switch because I feel like they're going to support that. Um, what you should probably do is buy Tim's pre-order. Does Tim I thought does he already have one? Oh, yeah. Right. We have the ones from Nintendo, right? So then I'm fine leaving mine here as the company Nintendo or Nintendo Switch. I don't think we need two. So I don't know what we I don't know. I'll ask him about it. I'm sure in Tim Getty's world he needs it for some reason. That's a great point. Tim Getty's Gettys World, but I'll ask him about it. All right, here we go. Hold on. I'm also just probably going to borrow this one when we forget that it's a system that's happening. And just I'm fine with you taking it. I just want the doctor to sit here. You can't play on your TV. I'll just play here. You can buy an SF doctor. As soon as we can buy an individual doc, that's fine. Your friend. Why won't you help? You on the phone with the pizza people and you're yelling about that. Do you need my card?",
      "start": 2455.12
    },
    {
      "text": "can buy an SF doctor. As soon as we can buy an individual doc, that's fine. Your friend. Why won't you help? You on the phone with the pizza people and you're yelling about that. Do you need my card? Yeah, cuz I want to take it. Are you going to give me a Caesar salad? No. Do you want a Caesar salad? Get that. I was going to walk. Get him a Caesar salad. He's the champ. How long is it going to take to get Take care of the Lord and Savior? Caesar salad champ, man. It's me. Give me a chicken Caesar salad. Chicken Caesar. Chicken Caesar salad. Chick on Pimp and Penguin 96 says, \"Hey guys, today is a good day. Midterms are done. Horizon is here and my girlfriend is now.\" Don't worry about it. I'll get my own **** Girlfriend is now the producer of our college's new channel. I'm now ordering a producer seducer shirt. How's your day going? My day is going really well. With the exception that this man's a coward and has the belt out for cleaning. The belt has never been cleaned. You can",
      "start": 2488.16
    },
    {
      "text": "a producer seducer shirt. How's your day going? My day is going really well. With the exception that this man's a coward and has the belt out for cleaning. The belt has never been cleaned. You can tell. You look at it and you can tell that it's never been cleaned. Now, what kind of champion would I be if I wore a belt that didn't shine? You know what I mean? Shine bright like a diamond. Like a diamond. The flannel death gave a tip and said, \"Hey guys, last tip for a while. Saving to move from New York to Colorado. Greg Jen works at Square Annex. Any chance of a one-on-one about her job or for a Games cast?\" Uh, congratulations on the move. Totally save your money. Uh, and no, I don't think we're ever going to do I don't think we'll do a one-on-one about her job for the games she has. That seems like too there's conflict of interest in there. I wouldn't be on it. If she ever wants to one v one me for GameOverGreggy about how great I am. That's fair. I'll interview you one day. You",
      "start": 2527.84
    },
    {
      "text": "seems like too there's conflict of interest in there. I wouldn't be on it. If she ever wants to one v one me for GameOverGreggy about how great I am. That's fair. I'll interview you one day. You will? Yeah. You ever been interviewed? Yeah, once or twice. Once by that was pretty much it. Yeah. Yeah. Yeah. It's pretty fun. I'll interview you one day. I love the Nick Scarpo interview. I'm going to throw you some curve balls, though. I'm not going to lie. Here's what we do. We cancel Tim and Colin's tickets to PAX East. It's just you and me. It's you and me. We do the we do the thing and then we sat down. We sit down. We do a one-on-one interview. Remember also there's a there's a 50% possibility that my plane I won't be able to make it. I am on the same plane as you. I am sure you make it take off. The plane didn't take off. Well, there was ice on the runway unfortunately here in San Francisco leaving here to get to Boston. There was ice storm. Um crazy. I need a haircut. You going to",
      "start": 2571.04
    },
    {
      "text": "take off. The plane didn't take off. Well, there was ice on the runway unfortunately here in San Francisco leaving here to get to Boston. There was ice storm. Um crazy. I need a haircut. You going to get one? I also don't like how I look in that shirt. I like how you look in that shirt. I had a suit on. Jen pointed out that it had like a grease stain on it and now I'm wearing this thing. I don't know what it Oh, no. They would if it was, you know, the old doughnut glaze, we would have known that pretty quick. You know what I'm saying? Is that what we call Kevin's sperm? Yeah, the donut glaze. We call the go. Someone hit me up today on Instagram. Talk to your microphone. What they say on Instagram? I said talk to your microphone. And what did they say on Instagram? They were apologizing. They were apologizing to you on Instagram about what? Uh, they were like, I just had the same thing happen to me that happened to you that one time. What is happening over there? It's taking you I see",
      "start": 2605.2
    },
    {
      "text": "were apologizing to you on Instagram about what? Uh, they were like, I just had the same thing happen to me that happened to you that one time. What is happening over there? It's taking you I see you trying to get Kev Cam working. Oh god, it just Oh, it doesn't want to work. Okay, it doesn't matter. Oh, there it is. There it is. Uh, yeah. She was like, \"Hey, sorry.\" That same thing like I I noticed something dry on my shirt and I was like, \"What the hell is this?\" Same thing happened to me. It was come. Yeah, it was come. I saw on Reddit a few weeks ago there was a photo of a guy in a similar situation. Somebody took from behind and it was like when you're in a hurry and you grab your com shirt and it was all disgusting on his arm. I mean, in a in a pinch, what are you going to use, Rob? Now, Rob Thomas, you've had sex with so many different people after Matchbox 20 concerts. You're going to tell me you haven't once grabbed a shirt. Sock. A sock. Socks. I don't like you guys are",
      "start": 2641.6
    },
    {
      "text": "Rob? Now, Rob Thomas, you've had sex with so many different people after Matchbox 20 concerts. You're going to tell me you haven't once grabbed a shirt. Sock. A sock. Socks. I don't like you guys are disgusting. Here's what you do. Come on. Depending on throw that away. Yeah. Depending on where it is. Watch the socks. You just roll over onto the floor and rub like the dog does when it's when it's ass is itchy. And then you just want to come sock back in your drawer. Right. Same. Never made that mistake. Okay. Yeah. Yeah, cuz you pick you pull it out like 4 days later and it just like stand up. It's like stands up on its own. It's like a piece of cardboard. Yeah, it's disgusting. Now, Matt man 974 in the chat says, \"Stop using shirts as comrades.\" I mean, that's one way to live, but again, that's a terrible way to live. I don't want to live like that. I want to live in a world where I can't use my own shirt to wipe up my own spooge. Over at IGN.com. Stick with me. Alex Gillado. Y Alex",
      "start": 2679.12
    },
    {
      "text": "that's a terrible way to live. I don't want to live like that. I want to live in a world where I can't use my own shirt to wipe up my own spooge. Over at IGN.com. Stick with me. Alex Gillado. Y Alex Gil Yadav says Suda 51 reveals Fire Pro Wrestling Series will return. **** yes. So excited. That's the wrong story. Spike Chunoff has announced the longrunning Fire Pro Wrestling Series will return this year with Firepro Wrestling World. Suda 51 made the announcement and showed his support for the new entry via a quick video where he speaks about how the Fire Pro Wrestling Series gave him his first start in video games. However, Suda 51 won't be involved with the development of Firepro Wrestling. instead saying he'll be rooting for Firepro from the sidelines. The new game in the series is coming to PlayStation 4 and will arrive for PC and Steam early access sometime in the second quarter of 2017. Firepro Wrestling World will retain the same customization and grappling focused fighting",
      "start": 2716.8
    },
    {
      "text": "coming to PlayStation 4 and will arrive for PC and Steam early access sometime in the second quarter of 2017. Firepro Wrestling World will retain the same customization and grappling focused fighting system the series is known for and will offer the ability to customize every aspect of the match from your wrestler to the ring itself. Here's where you're going to get interesting, right? Yeah. Yeah, I'm going. There will be a variety of modes including deathmatch, steel cage, barbed wire, or landmines, MMA rules, and no holds barred gruesome fighting. All right. As well as some online as online play that includes hermits, leagues, and exhibition. This excites me. **** yes. **** yes. Fire pros. Cool. Was this Was this a thing for you when you were growing up? Uh, no. Actually, I missed it and it was like PS where I picked it up, I think. Started playing or whatever. And I reviewed it once for IGN and it it's always been cool. It's something I want to see them iterate on and keep",
      "start": 2763.28
    },
    {
      "text": "it and it was like PS where I picked it up, I think. Started playing or whatever. And I reviewed it once for IGN and it it's always been cool. It's something I want to see them iterate on and keep doing. And they also, you know, they need it just needs to be here. We need it. Somebody's got to challenge THQ in their **** Well, it's happening. Oh, I'm sorry. K. How would I know? It's the exact same **** thing. Make them better. Final story, also from IGN.com, Alex Osborne says, \"No Man's Sky developer announces funding initiative for Hello Labs.\" No Man's Sky developer Hello Games has launched a new initiative called Hello Labs, which will support other small developers who are creating games that use procedural regeneration or are experimental focused. Studio founder Shawn Murray shared the news today during his session at GDC titled building worlds using maths. Hello Labs will provide funding and support to one or two projects at a time. And Murray confirmed that one project is",
      "start": 2802.96
    },
    {
      "text": "the news today during his session at GDC titled building worlds using maths. Hello Labs will provide funding and support to one or two projects at a time. And Murray confirmed that one project is already in active development. During the talk, Murray briefly mentioned what? It's better out than in, Kevin. No, keep it in. No. What did you want me to do, Kevin? Not for Kevin. You know why people come here? For the camaraderie. For the friendship. Come stands for the snakes. Why are you holding that? I do it all the time. It's If there's something You think that's why it makes that ringing noise? If there's something dingling between my legs, between my thighs, I'm going to grab it. You know what I'm saying? You know what I'm talking about, right? That like really weird. It's not because of that. Really? I guarantee it's not because of that. Could be. It isn't though. Remember when you broke the other thing? The microphone I spilled the water all over. Yeah. Yeah. Yeah. During the talk",
      "start": 2843.12
    },
    {
      "text": "that. Really? I guarantee it's not because of that. Could be. It isn't though. Remember when you broke the other thing? The microphone I spilled the water all over. Yeah. Yeah. Yeah. During the talk, Murray briefly mentioned that he's been what he's been up to at Hello Game saying he's been busy quote he's been he's been quote busy working on a current update for No Man's Sky. He also took a minute to reflect on the game saying, \"Whoa, IGN's got a head up here that popped it all the way out saying No Man's Sky started as a hobby to me and in some ways it still is.\" That's not a good quote. You don't want to say that when you're when No Man's Sky has been in so much hot water. It's it's a hobby to me and in some way on the side don't really game that everybody's really mad at you about. Sean, no. No. Interesting announcement. Uh court of public opinion still I think pretty negative on Hello Games. Hello Labs is an interesting move. Go get them. Go do your thing. I still like No Man",
      "start": 2885.76
    },
    {
      "text": "Sean, no. No. Interesting announcement. Uh court of public opinion still I think pretty negative on Hello Games. Hello Labs is an interesting move. Go get them. Go do your thing. I still like No Man's Sky for what it was. Kev, you like No Man's Sky for what it was? Yep. Thanks, Kev. Dynamite dropping. Dynamite dropping. I think Colin had a couple choice words earlier, but I'm not quite sure what he just said about that. He actually said he loved it. Yeah, I think he said he really liked it. You platted it, Robbed did it. Did you enjoy it or was he just like, \"Okay, enjoyed it for what it was that have expectations.\" Nailed it. Nailed it. As if people should have listened to us earlier on when we were saying, \"No, stop. Stop getting it's not that. It's not that. Don't say it's that.\" Ladies and gentlemen, this is the Kinda Funny Morning Show each and every weekday here on twitch.tv/confames. We run you through the nerdy news you need to know about before jumping into the chat to answer",
      "start": 2922.64
    },
    {
      "text": "gentlemen, this is the Kinda Funny Morning Show each and every weekday here on twitch.tv/confames. We run you through the nerdy news you need to know about before jumping into the chat to answer your questions, comments, and concerns. But in between those two segments, I reach into the internet, grab a video game, and give it to one of you. How do you win the video game? It's simple. Be in the Twitch chat like so many of you are right now. Know your parents. No, the brothers have never won a game from us. Uh, be in the chat like so many of you are right now. Or if you're watching later on or just want three other ways to win, you if you're one of the YouTube people or the podcast people cuz they're great people or just another Twitch person. You can be a Twitch sub. Remember Twitch subs here get automatically entered to win the game. Don't have to be here. Plus get the Logan next to your name, the cool emotes, private chat time with us. One day you play multiplayer games like me and",
      "start": 2963.04
    },
    {
      "text": "here get automatically entered to win the game. Don't have to be here. Plus get the Logan next to your name the cool emotes private chat time with us. One day you play multiplayer games like me and Big Dog are playing this very weekend or no Tuesday. Not weekend. Two weeks ahead. Got to play this weekend. We can't stream it. I think this weekend I just play together. Oh friends. How But how far do we want to get ahead of everybody too? That's the other thing. Is that a bad thing? I don't know. I don't That's the whole thing is I'm not really sure how it's going to work in terms of like people coming together. Cuz when I shot someone in the face they acted like I shot someone in the face. You know what I mean? In Division I didn't feel that way. I see what you're saying. All right. Cool. Cool. Cool. I'm down to play a little bit. Whatever. It's up to you. Downloading right now. Oh **** Nice. Okay. Um you got Oh she adree for Twitch too. Good job. You can also go to",
      "start": 2998.88
    },
    {
      "text": "right. Cool. Cool. Cool. I'm down to play a little bit. Whatever. It's up to you. Downloading right now. Oh **** Nice. Okay. Um you got Oh she adree for Twitch too. Good job. You can also go to Patreon.com/confunn or Kinda Funny Games. Support us at the $ or above level. You are a winner entered to win. Plus you get bonus episodes. Every bonus episode we've ever done plus any other goodie you get free perk. Uh I did I got ahead of the game today. I got in early so I did the random number generator there. We're giving out Warhammer Quest on Xbox One. It's going random number generator said to a Patreon supporter it is Carl Taylor who I've already emailed the code. Congratulations Mr. Taylor. Way to just take all the excitement out of that one huh? What do you mean? You got to do the Boo Boom. People are like \"Oh is it going to be me? Is it going to be?\" He's like \"I already emailed the dude. He already knows about it. And we cares. We're ahead of the game. Let's eat",
      "start": 3031.52
    },
    {
      "text": "to do the Boo Boom. People are like \"Oh is it going to be me? Is it going to be?\" He's like \"I already emailed the dude. He already knows about it. And we cares. We're ahead of the game. Let's eat pizza and play beat cup. Yeah beat cup today. Oh. Uh no new tips have come in. So we're calling tips which is great. We can then run through. Are there any fun clips that were past mustard? Yeah it was uh Let's watch some fun clips. Give me the clips. Give me the clip. Give me the clips. Give me the clip. Are you sure there's no more? What? I mean based on MXY do you want me to jump into the other thing? Last one on MX. What's the plan of death? Plal death was last month. We're good. We're good. Okay. See what this is. Oh you didn't check seconds. I'm going to give just throw it in. Just give it to us. Just let's see what happens. What's the worst that happens? It's an unfun clip and somebody bans themselves. Ready? Ready. I'm ready. Ready. Doors open this Friday. So come on.",
      "start": 3071.36
    },
    {
      "text": "Just give it to us. Just let's see what happens. What's the worst that happens? It's an unfun clip and somebody bans themselves. Ready? Ready. I'm ready. Ready. Doors open this Friday. So come on. Time for the barbecue. I got sound. You got sound. Oh **** That was dumb. That was dumb. Not even worth my time to get sound. **** you kid who put that in. All right. Ready? Break your Switch. Are you ready? Yeah. This is clearly a muted YouTube video. Does that matter? Oh **** Don't **** around on roofs people. That was awesome. Can I say it again please? Yeah absolutely. That's See again good definition of a fun clip. It's short. Oh that's sad. I love how much Kevin takes pleasure in seeing other people suffer. It's fun. Nick you ready? Go for it. Go full. Coach of the year. two. Damn. Okay. I don't think that's a legal move. The kid double dribble though. I mean yeah there's there was I think there was there's a pretty big travel right at the offset.",
      "start": 3112.8
    },
    {
      "text": "year. two. Damn. Okay. I don't think that's a legal move. The kid double dribble though. I mean yeah there's there was I think there was there's a pretty big travel right at the offset. I think I feel like he think that kid thinks he's playing football and everyone else playing basketball. They got to be think that huh? Uh that's it. Everything else was trash and you should try hard and you should rethink your Don't be a bunch of idiots and submit bad fun clips. Submit good fun clips like the shampoo prank. Those are great fun clips. I watch those new way I'm just bikinis right? Yeah that's it. Hard bodies and bikinis. My two favorite things. Hard bodies and bikinis. Dudes too. There's some hard body dudes. Oh look at that. We got it. I look at abs all day on a guy or a girl or a dog. Who is to you? And I think I know the answer but who to you is the most handsome man? The most handsome man? Yeah. **** that's a tough one. I would say like one of the best looking",
      "start": 3168.56
    },
    {
      "text": "girl or a dog. Who is to you? And I think I know the answer but who to you is the most handsome man? The most handsome man? Yeah. **** that's a tough one. I would say like one of the best looking dudes. There's like a there's a top five list for me. I would say like I'll go with Daniel Craig's up there. Okay. Not best looking but he just has the sexy vibe. Now is that because of your obsession with Bond? Yeah 100%. Uh I also like Idris Elba. I think he's a very good-looking human being. Um Hugh Jackman's up there. Chris Hemsworth's up there. See I thought Hemsworth is what you'd leave finish but Ryan Gosling was I'm sorry. Where's my Where's my brain? Ryan Gosling is the best looking man on the planet. Okay cool. He's the sexiest human being on the planet. Does Does it make you sexually confused when you realize how much he looks like Mark Ryan Sally? No it just makes you want to bang Mark Ryan Sally. Gotcha. Just making sure. Just making sure. He knows it. It's a",
      "start": 3222.96
    },
    {
      "text": "make you sexually confused when you realize how much he looks like Mark Ryan Sally? No it just makes you want to bang Mark Ryan Sally. Gotcha. Just making sure. Just making sure. He knows it. It's a compliment Kev. It's 017. You can walk up to anybody on the street and say \"Hey I want to bang you.\" And they're like \"Oh thank you for that.\" They have to. And they have to say yes. No no no no. It's a thank you for that compliment. Um Tourette's Monkey says \"Greg tag team for Nintendo World Championship. Tag Team for Nintendo Championship. Nick and Tim versus Greg and Alf.\" Well for the tag team we don't have like a Sony tag team. We don't have enough people for tag teams. You know what I mean? Like this doesn't make any sense. I think we have exactly enough people for tag teams. There are four of you guys. That's two tags. Well you you're five. And then yeah if there's if there's two teams I'm like the ref or like the dude shouting things. You are the most biased.",
      "start": 3268.56
    },
    {
      "text": "teams. There are four of you guys. That's two tags. Well you you're five. And then yeah if there's if there's two teams I'm like the ref or like the dude shouting things. You are the most biased. Tim's going to win whatever he's on. If you're the ref. You always say that but that's never been true. That hurts my feelings. I don't want Tim to win. Do you want to talk about how Gia broke your heart last night at Logan? No. Okay **** Jesus. What? She knows what she **** did. What did she do? I don't want to talk about it Nick. Princess Daisy 3 says \"Nick how's your eye zombie viewing go?\" No joke Rob Thomas from Matchbox 20 is in the season finale. Fun fact the heady zombie showrunner is also named Rob Thomas. So they went all out with the joke. They really did. They really did. It's good. I love I Zombie. It's so It's super fun. You guys should definitely check it out. I haven't watched I think I got halfway through season two and I've stopped because I got",
      "start": 3306.24
    },
    {
      "text": "They really did. It's good. I love I Zombie. It's so It's super fun. You guys should definitely check it out. I haven't watched I think I got halfway through season two and I've stopped because I got life more you know Netflix got in the way but uh I'll go back to it. It's like it's like I got life more. Netflix got in the way. I mean who are we kidding? I'm not I don't have a **** life. It's clearly I'm watching The People versus OJ Simpson. Um so good. So **** good. Uh he did it. What's that? I 100% think he did it. Yes. After you watch If you Does anyone think he didn't do it anymore? Where's the blood though? What's that? Nothing. It was everywhere. The blood was everywhere at both in the Bronco. You know what I mean? Not on him. Not on him. He washed him. Wait. What? Yeah he showered. You guys can't get blood off showering. Come on. That's why he wore the gloves for it. That's why he had those iceoners. It's on you for life. He had iceers. Plus this was in the 90s",
      "start": 3352.08
    },
    {
      "text": "he showered. You guys can't get blood off showering. Come on. That's why he wore the gloves for it. That's why he had those iceoners. It's on you for life. He had iceers. Plus this was in the 90s man. They didn't have any technology back then. They didn't even know what blood was. That's the funny thing. Yeah. When they like in in the thing where they like laugh DNA out of the room at first you're like \"Jesus **** Christ.\" Yeah. That was brutal. And then the guy goes over and like shakes like \"Is he **** shaking everyone's hand?\" Yeah. Yeah. Cuz he was all rattled. Uh feel like we're going somewhere with that and then we got So it's just whatever. So it's fine. Yeah. I don't know. Uh Taylor CF says \"Nick did you hear about the Ferguson fighting game?\" I did not hear about that. Is that the big Is that the headliner for No for UFC this weekend? No it's Woodley and uh and Thompson. Gotcha. Somebody asked that earlier. I didn't understand the question. I thought they were",
      "start": 3390.72
    },
    {
      "text": "Is that the big Is that the headliner for No for UFC this weekend? No it's Woodley and uh and Thompson. Gotcha. Somebody asked that earlier. I didn't understand the question. I thought they were talking about Woody Harelson. Who do you have in the fight this weekend? I don't I don't have a stake in it actually. I'm not really familiar with a lot of these guys. Um Oh it's in the Nurameov fight. That sucks. I can never say that guy's last name. Nurmega. Nurmega Medov versus Tony Ferguson. That got cancelceled. **** **** That's not good. Frog and Bullfish 89 has breaking alert here. Greg Switch issue alert Dbrand a device skinning company just tweeted that their skins mess up the coating on the Switch. The when the skin is peeled off it removes some of the paint on the Joy-Cons as well as the Switch so people don't skin your Switch. Oh my god this this brand I've never heard of is crippling switches. See this is Don't put stupid things on your consoles. See this? Toasty",
      "start": 3424.0
    },
    {
      "text": "as well as the Switch so people don't skin your Switch. Oh my god this this brand I've never heard of is crippling switches. See this is Don't put stupid things on your consoles. See this? Toasty stickers. Cool things. This is a **** huge problem. So PSN magazine. Yeah back in the day. Oh right right right. Yeah put it on your PS4. Here's the new Sky Cam. Yeah. Let me see this **** Looks like Johnny 5. It really does. It does look like no disassemble. So apparently uh the person that was supposed to fight Ferguson could be Nuramed off was taken to the hospital due to weight cutting issues. This is a big problem. Like people when they have to cut weight they have to they'll have to dehydrate themselves so badly. So I wonder what this is. I have to read the rest of this article but that sucks. What happened? Oh they're not doing the thing this Friday. No the fight's still going. But uh but one of the fighters had to drop out due to some some issues. Had to be",
      "start": 3466.48
    },
    {
      "text": "article but that sucks. What happened? Oh they're not doing the thing this Friday. No the fight's still going. But uh but one of the fighters had to drop out due to some some issues. Had to be hospitalized. This sound like a fun fight. Now Captain Gech 36 has a really interesting question. Are you are you can are you go ahead. Okay cool. Give it to me. Greg would you guys stay on the air in live broadcast through another 911 like Howard Stern? I didn't realize Howard Stern did that back in the day. Um I think we would. Why wouldn't we? I I see the change over here would be I think the fact that we our stupid show we'd be able to watch live. You know what I mean? Yeah. And and it's one of those two I don't know I mean this is a very weird question right like I feel if Colin was if it's a 9 if it's in New York again Colin is going to leave the show to call friends and family or whatever but if it's just like me and Nick are like all a sudden stop a plane's hit another building or",
      "start": 3509.6
    },
    {
      "text": "a 9 if it's in New York again Colin is going to leave the show to call friends and family or whatever but if it's just like me and Nick are like all a sudden stop a plane's hit another building or something. You know what I Like if we didn't know that immediately meant bells and whistles you you'd guys be updating. We'd check over and stuff. I don't think I think if I as I mean as a dumb college student as **** what the hell's happening? I don't know. It's all minute to minute changing of whatever it was a real 911 like I don't think we would know what was happening until we were well into already watching what's happening. Right. Right. Right. Right. I know. I feel like I'd call my wife and my family make sure they're okay. See that's the thing. Yeah. And that's if it was in San Francisco like no we'd all be like if it's in Chicago no I'm off the but it's like it's happening in Timbuktu I don't know do I know Timbuktu can I help Timbuktu is Timbuk real place fun didn't know",
      "start": 3551.84
    },
    {
      "text": "Francisco like no we'd all be like if it's in Chicago no I'm off the but it's like it's happening in Timbuktu I don't know do I know Timbuktu can I help Timbuktu is Timbuk real place fun didn't know that I'm pretty sure u 815 says Kinda Funny reacts terrorist attack **** Jesus Christ it's it's funny cuz we're joking around about it really chillax bear's looking on about it. Well if you don't joke about it they win. I don't I don't know man. There's like a polite way around it. Is there a polite way to I don't know man. I'm excited about this pizza. And I'm going to get in a sub only here in a second. I'll do it for you. Okay. Big Bear Monty says \"Greg any chance of an oration for Peeps Oreos? I feel like the ship sailed. They're already out there. If you want opinions on them they're out there. Plus that show is just a **** to do. Not enough people watch it. There's no return on the investment that I put into it. I'd rather play more Zelda than talk about that to you.",
      "start": 3586.24
    },
    {
      "text": "they're out there. Plus that show is just a **** to do. Not enough people watch it. There's no return on the investment that I put into it. I'd rather play more Zelda than talk about that to you. I'd rather sit here with Nick and argue about why he's not giving me a One Two Switch reboot. Now interesting. Interesting. I never thought of this angle which I'm sure I'll utilize in my future to retain my tile longer. NS7_optics says \"Nick I don't think you can make weight for your next tile defense and that's postponed.\" You're right. I mean that's a that's a big problem. They take away your title if you're under like if you're not in the right way. You vacate the title if you are the one who violates it that way. No. No. They just postpone it and given given IBJJ. I don't know if that's I don't know if that's true. I don't Yeah. No I think that's uh But the thing is this it has to be a catchweight fight. Okay. Right. You're you clearly outweigh me by a good 400 lb. Two to 300",
      "start": 3636.64
    },
    {
      "text": "I don't know if that's true. I don't Yeah. No I think that's uh But the thing is this it has to be a catchweight fight. Okay. Right. You're you clearly outweigh me by a good 400 lb. Two to 300 lb. We have to meet in the middle someplace. So if you can't get down to 190 then you can't we can't fight each other. Okay. I like where your head's at. Nick he'll lose the weight. Yeah. You know I will. Will you in a week? That a week? That's not even I'm like just dead on the plane. Like I'm like I got him. **** yoga. Yeah. Yeah. Exactly. I mean here's music. Uh 60s to 90s. Greg do you think that No Man's Sky deserved to win the Innovation Award at the Game Developers Choice Awards? Uh I didn't I don't know what it was up against. Uh probably not but again I don't know what it was up against. I feel like that's not a great thing to say. It didn't really innovate. It was a fun game for what it was but again I don't know. That's a question I don't have the things for. And then HD",
      "start": 3676.4
    },
    {
      "text": "against. I feel like that's not a great thing to say. It didn't really innovate. It was a fun game for what it was but again I don't know. That's a question I don't have the things for. And then HD Gil Thunder. Greg what are your thoughts on Final Fantasy 15? We talked about it a long time ago. I like the fighting system and then I just fell out of it. So yep. That's the end of that. Here's my other question for you. Lay the other question on me. Is this about cutting weight again? What is our No. No. What is our policy on drug use? Like are we allowed to do you can do all the steroids you want to get to do this for Kinda Funny? So you're saying you have to do steroids. If you're not doing steroids I don't think you have to. That's not the requirement of it. Well I mean if everyone else is doing it you're going to do you might as well just have to do it right? So I got you. Yeah you want to be there. That's sound logic right there guys. If you even want to participate",
      "start": 3720.56
    },
    {
      "text": "else is doing it you're going to do you might as well just have to do it right? So I got you. Yeah you want to be there. That's sound logic right there guys. If you even want to participate you're going to have to do the steroids. All right. Well I mean that's the thing. It's like a ladder match. It's a steroids match. Take your pants down. Both these guys have been doing steroids for two years now. They get the fight. I'm going shoot this needle. Don't cough in your hand Nick. Says peanut 04 3. Yeah I'm retiving back to him. Tell him go **** himself. I said don't tell him what to do. Abnj77 says \"How does the Pro Controller feel?\" It's always weird to try to **** around with the controller when there's no game to play. Sticks feel a bit loose but I'm sure they work in right now. It's not set up. Oh actually yeah. Go get me my Go get me my uh Switch. Please figure out why you're not lit. Guess Oh you figured out why I'm not lit. Well I mean we're trying to flag",
      "start": 3754.88
    },
    {
      "text": "now. It's not set up. Oh actually yeah. Go get me my Go get me my uh Switch. Please figure out why you're not lit. Guess Oh you figured out why I'm not lit. Well I mean we're trying to flag off for reflections against the screen back there but it's not working. Like it's just not worth it because when you lean back it's not that just drops. Nick just be cool. This light right here is being blocked right? Yeah. Can you charge off a PC or was that one of the things we heard out we couldn't do? I don't want it. You don't want the hug? I don't want the hug. Since when do you want hugs? Who hurt you? Are we still on? Yeah we still on right now. We're definitely still on. You're still dark. Oh it's char leaning back. Did you **** Super entertaining show. Every time we do this City of Stars. Why people watch this is why people watch apparently. I think people like the intro of the show. I feel like there's just an aspect of the show that people watch because it's some in",
      "start": 3793.68
    },
    {
      "text": "City of Stars. Why people watch this is why people watch apparently. I think people like the intro of the show. I feel like there's just an aspect of the show that people watch because it's some in somehow some small way makes them feel better about themselves. Like no matter how bad their day is going at least it's not getting this bad. Look at Look at Greg right now. He's already played with this thing. How can you be still excited? Oh I got to you. Oh to pair this controller I got to use the USB dock. Oh no. I can do the wireless. Close this screen and select change grip order. On the next screen hold the same button. Change grip order. Do that. War_d1 says \"Nick any movement on getting on JRE?\" No. No. What's JRE? Joe Rogan Experience. Oh. Um no. Have you tried? Have you talked to him? No. Never tried. You got the balls of fury guy to respond to your record? I do. I do got the balls of fur guy. super well. No I don't know. I just uh that do go still going. Still going.",
      "start": 3852.8
    },
    {
      "text": "to him? No. Never tried. You got the balls of fury guy to respond to your record? I do. I do got the balls of fur guy. super well. No I don't know. I just uh that do go still going. Still going. We're still talking back and forth trying to figure out a date. Um yeah nothing nothing to report on that just yet. I think I got to charge it first. Uh the awkward Dragon 9 says \"This is the Kinda Funny evening show here in the UK.\" O Kevin Kevin I'm sorry. Uh it's supposed to be evening in the UK. Can we change to the evening uh level? No we cannot. Can we change to the evening level? Literally nothing we can do. There's nothing we can do right now. No I'm sorry. I'd want to change it. I'd love to do that for you Nick. I would love to. What are you What are you doing right now? Final question from sub only. Harry picking seven. Who would win in a fight? Fist fight Colin or Kevin? Now are there rules to this engagement? We said rules about drug abuse. I So is it bare knuckle? We",
      "start": 3898.56
    },
    {
      "text": "from sub only. Harry picking seven. Who would win in a fight? Fist fight Colin or Kevin? Now are there rules to this engagement? We said rules about drug abuse. I So is it bare knuckle? We have to do this. Or I think it's the fight. Kevin grabs him like an alligator and takes him to the ground. Is that okay? That's okay. In a fist fight is it? I'm just I was asking to see what the chat Yeah it's street play. There's no rules. I I'm just tossing out there. That's the only Yeah. Yeah. Oh yeah. Totally. Totally. Totally. Kev I'm assuming you say you win. I have input. Call him already here. He's got input. Has the No. Go turn on little turn on the Kev cam for him Kev. Or tell him how to stop installing that thing over there right now. He's got his hood up. Call him Art. He's ready. He just came out of an intense training. Go on Colin. Tell him. Tell him who's going to win. Colin who would win in a fist fight you or Kevin? He just kissed me which So the thing about it is that",
      "start": 3935.92
    },
    {
      "text": "just came out of an intense training. Go on Colin. Tell him. Tell him who's going to win. Colin who would win in a fist fight you or Kevin? He just kissed me which So the thing about it is that I feel like Kevin might have the advantage. Kevin's obviously a very strong stout young man. He's younger than you. Uh he's younger than me. Eats. He eats a lot more calories than you. The thing that I'm concerned about is that carb loading for this entire life. As we've we've already established you know deep inside of him because his grandfather was a Nazi officer. he has you know Nazism in him and obviously we wiped the Nazis out in less than a year when we invaded Normandy obviously in June 44. By April 45 it was already over now. Now we were in North Africa and we were in southern you know by the time and so what I'm wondering is if he has just loser jeans in them in other words like when it come you know because the Nazis had loser jeans in them. So what I'm wondering is I if",
      "start": 3988.48
    },
    {
      "text": "you know by the time and so what I'm wondering is if he has just loser jeans in them in other words like when it come you know because the Nazis had loser jeans in them. So what I'm wondering is I if you know my my pure American blood running through my veins from you know I had you know I didn't have any Nazi family you know n I had only family that were only fighting in the American mil last I checked you're half Irish half Italian they've never lost a war no well I mean an ironic twist of fate I am half Italian and the Italians lost to the Americans grandfather who was Italian defeated the and it gets very complicated but what I'm saying is that courarssing through my veins means there's no Nazism. And this is one of those things where do you understand Kevin? Is that a reasonable kind of No no no. He says that's not a reasonable kind. But now the counterargument is that Kevin looks like Mick Foley. He is dressed shirt on. I even I even understand that reference. He's just",
      "start": 4027.68
    },
    {
      "text": "Kind of no no no. He says that's not a reasonable kind. But now the counterargument is that Kevin looks like Mick Foley. He is dressed shirt on. I even I even understand that reference. He's just McFoley. And not only that he has just decided to forego his responsibilities on the show this morning to play with a new camera that came in. You guys You guys got it. You guys got What do you want me to do? I I asked you to change the background for a funny joke for our friends over the UK. And again, maybe your Nazi isn't coming out. You don't like the UK. Maybe that's what's happening. Maybe that's what's happening. Kevin, don't do that to the UK. Kev, which hand was it again? No, don't do that. We're not allowed. They tried to take PewDiePie out. Another $0 million next year. Ladies and gentlemen, wait, real quick. Just want to Don't try to wrap it up. I'm not done. Sorry, sir. Yeah. What I wanted to say to Kevin's credit was this that in fact Kevin would destroy me in a fight and",
      "start": 4069.84
    },
    {
      "text": "gentlemen, wait, real quick. Just want to Don't try to wrap it up. I'm not done. Sorry, sir. Yeah. What I wanted to say to Kevin's credit was this that in fact Kevin would destroy me in a fight and it wouldn't be pretty, but I would do my best. Yeah. And I would certainly I wouldn't I would certainly not go down without a fight. I've been I've gotten the **** kicked out of me in the past when I was younger. Yeah. But I never went down like a **** I always tried my hardest and then I had a concussion and it was really bad and I got beat up by a bunch of people. All right. Like a **** Bye. Ladies and gentlemen, this has been the Kinda Funny Morning Show. Remember, each and every weekday here on twitch.tv/kindafunny games. We come to you with the nerdy news you need to know about before jump into the chat to answer your questions, comments, and concerns. And each day giving away a video game. How do you win the video game? It's simple. Be in the Twitch chat like so many of you",
      "start": 4115.6
    },
    {
      "text": "jump into the chat to answer your questions, comments, and concerns. And each day giving away a video game. How do you win the video game? It's simple. Be in the Twitch chat like so many of you are right now. Or if you want three other ways to win, or you are one of the people watching on YouTube later, or listening to the podcast later, you can support us by be being a Twitch subscriber, which gets you Yeah. the logo. It gets you the emotes. It gets you the private chat time. It gets you to play games with us like Kevin and I are doing on Tuesday with Wildlands. Bolivia, stop being **** babies. Um, whose babies? Bolivia. The entire country. Remember? Oh, they're making a game set here that doesn't make us look good. Bonjour. What do they speak in Bolivian? Bolivian. Spanish. Bolivian. What's Bolivian for? Hello, Kev. Oi. Oi. It's me and Bolivia, Governor. We sure are a bunch of **** They 100% speak Spanish. Literally, everyone knows that right now, Nick. Come on. Well, Bolivia is",
      "start": 4154.56
    },
    {
      "text": "Bolivian for? Hello, Kev. Oi. Oi. It's me and Bolivia, Governor. We sure are a bunch of **** They 100% speak Spanish. Literally, everyone knows that right now, Nick. Come on. Well, Bolivia is Central America. Yeah. Yeah. Okay. I get confused when we get to South America. Speak Portuguese in South America, right? I mean, you can get it on podcast services around the globe. You can support us on Patreon to win the game. It's all out there. A lot of stuff. Let's go through some people speak Spanish. Okay. Ketwa, too, though. Do you want to read the subs, Nick, or do you want me to read the subs? It gets complicated with All right. I will. Gio dude. I like my women like I like my golf scores in the 80s with a slight handicap. Jesus **** wet that slap. Genius envy. NX finally gave it to us. Uh the king, you know who tries or tries. Yeah, tries cur tries. What? Try KK Stir. Uh god damn it, guys. Sir Dana Karen CDBD3 agent. No. A great beard. Hey guys, game design class has whooped my",
      "start": 4202.56
    },
    {
      "text": "us. Uh the king, you know who tries or tries. Yeah, tries cur tries. What? Try KK Stir. Uh god damn it, guys. Sir Dana Karen CDBD3 agent. No. A great beard. Hey guys, game design class has whooped my ass. The rock himself. What? I don't know. Hey guys, game classes. Whoop. I No, I know this pain better than anybody. Whooping on my asterisk. The rock himself. I could use some words of encouragement. **** just do it. You can do it. Think of it this way for me. If the people who made Life of Black Tiger or whatever can **** make games, you can make games. Badger O City Boos. Ye man powder SW air can't be shown. Greg, I sent Colin a Mora T mug last December. Do you know if he got it? Colin, did you get that mug? Morate Morardi, but it's like Mora is Mor. Yeah, he got it. It was on the kitchen table for him. He says, \"Thank you.\" Uh, the awkward dragon won. Remember, you don't need to send us anything. We're not. We We appreciate your love and support and your money. You don't need to",
      "start": 4246.24
    },
    {
      "text": "table for him. He says, \"Thank you.\" Uh, the awkward dragon won. Remember, you don't need to send us anything. We're not. We We appreciate your love and support and your money. You don't need to send us things cuz then we forget to tell you. The awkward dragon one jaw lop beyond bongos Kevin DPDT uh literal zero TV pack 5 0 war_D1 sheepard 1985 ship shape 1 hitman x187xn77 carous in the house Mr. Von Penguin uh XTN Death Melmo Bradley Rodrigo uh Fra toe Young To M1 TZK1 Lord Vage Belmont 83 Nick should retire undefeated with the Nintendo World Championship. No, he should not. He's already He shook on it. If he doesn't defend it at Pax East, he can't do that. It's a possibility that there will be a press conference happening before next week announcing my retirement. It's also a possibility that there's a press conference in that like that gets announced last week whatever announcing that I got popped for steroids and that I have to wait another six months before I'm allowed to fight",
      "start": 4316.24
    },
    {
      "text": "that there's a press conference in that like that gets announced last week whatever announcing that I got popped for steroids and that I have to wait another six months before I'm allowed to fight again. You can you're allowed to fight an interim title match but I you have to give me the shot when I come back. That's how it works. Okay. Okay. Yeah. Darth Soral. What are we on steroids again? Pokedude 97. I don't know. Are we on steroids? But we do 97 says, \"Yo, Greg and Nick, I got my Montando Switch last night. Everything is a lot similar than I expect.\" Outlaw 8179. Nick looking on point. Enjoy your weekend, boys. Thank you. Darth Talent good work. Keep up the bongos. The Pixel King 1, PNW, Phenom, SFX, Nudy Fox, a cast 679, uh, Garbyas, PSN 7 pretty much, but you put an I in there. Doc Online, ABist. Pew pew. Bye, mom. Need games. Jack Kruba show me that love and smile.",
      "start": 4381.6
    },
    {
      "text": "Online, ABist. Pew pew. Bye, mom. Need games. Jack Kruba show me that love and smile. Donno Beats and Stokesberry. Hope you guys have a nice weekend. See you all. Kind of funny life three. Hashtag bongos. And Darkkey 89. Three months of free money given to the crew. Thank you for your Amazon Prime subscription. Liebo 7. Happy Switch Day. And the final one, Robot Boy 8. Six months on Switch release day hype. Keep **** that chicken. We got you. Champ, play us out. Boom.",
      "start": 4432.32
    }
  ]
}
