{
    "id": 2026,
    "video_id": "aQtc1tVYnuI",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What Would We Want From A New Vita? - Kinda Funny Gamescast Ep. 84 (Pt. 1)",
    "description": "We discuss what we would want from a new Vita.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1473080400,
    "duration": 1834,
    "transcript_chunks": [
        {
            "text": "What's up guys welcome to the first ever episode 84 of the Kinda Funny Gamescast as always I'm Tim Gettys joined by the coolest dudes in video games Colin Moriarty and Greg Miller hello hello hello it's good to be wearing the same shirt I why did you immediately want to bring attention to it immediately I couldn't let the people have to I didn't expect it I definitely didn't expect it from you you don't wear t-shirts often I don't let alone the Kinda Funny t-shirt I packed all my shirts for packs we're about to go to Packs which at this point this only helps you if you're getting it on Patreon yeah whatever you should check us out we're doing a bunch of cool stuff and I'm hosting a panel I'm a little bit scared about it but you're going to be great South Park you're going to kill it um yeah so I had to wear this because everything else is currently being laundered oh see I packed I I not to say I don't like this",
            "start": 0.13
        },
        {
            "text": "it but you're going to be great South Park you're going to kill it um yeah so I had to wear this because everything else is currently being laundered oh see I packed I I not to say I don't like this shirt but I packed all my my favorite Kinda Funny shirts yeah my my San Francisco bridge one PS I Love You I want to do this producer Seducer team fat I feel you so this is like the one that's like this an everyday Kinda Funny shirt this isn't a special occasion Kinda Funny shirt I can wear this whenever I want to wear it if everyone else wanted to wear it where could they get it they get it at K of funny.com store it's true it's very true what about you Colin what shirt you wear shirt uh I'm wearing a Louis and Clark shirt I'm just laughing because Greg just had like a blunder and then sat back and actually just shook his head in the in the uh in the negative um no I'm wearing my usual po provision sweatshirt that I wear every day I like the sweatshirt But Eric Castro made it",
            "start": 52.36
        },
        {
            "text": "Sat back and actually just shook his head in the negative. I'm wearing my usual provision sweatshirt, which I wear every day. I like the sweatshirt, but Eric Masterson makes it in black if you get him to do that. It's a black sweatshirt with gray on it. Oh, I would select the pink one, but can I buy this online? No, this is only for people who work there or me. Well, I'm sure I can get one probably. You having fun there, Kev? Doesn't Kevin have a lot of fun switching? This is the Gamescast every week. We get together to talk about video games and all the things we love about them. You can get it early on Patreon.com/KindaFunnyGames or you can get it late on YouTube.com/KindaFunnyGames either way, we love you a lot, especially Greg. Right, I love everybody. That's my whole shtick. I do know what else you love - the Patreon users who submit topics and stuff just like Min-Chung says this.",
            "start": 91.24
        },
        {
            "text": "Right, I love everybody, you know that, that's my whole shtick. I do you know what else you love? What's that? The Patreon users that submit topics and stuff just like Min-Chung says this month's topic is simple: You guys are in charge of the PlayStation Vita 2. What would you do in terms of hardware, software, UI, price, games lineup, etc.? See I like this; the thing I like too because we're timing it this episode's going to be going live the week before the PlayStation meeting, so this is our final kind of chance to talk about this thing that's probably not going to happen. Remember on September 7th you can go to twitch.tv/kindafunnygames and watch our pre- and post-shows all about the PlayStation meeting, and of course watch it while we do the meeting itself; we'll talk over it. Oh wait, so this goes live for Patreon before Patreon the week before for normal users Monday before this will be the Monday two days before I was to say come watch all our content there don't worry.",
            "start": 139.56
        },
        {
            "text": "so this goes live for patreon before patreOn the week before for normal users Monday before this will be the Monday two days before I was to say come watch all our content there don't worry about exced coming up coming up soon what I like about Ming's question here is the fact that it's deeper than what we usually get once in a while con I'll talk about PlayStation I think on the last PS I love you we did actually what we' want what we'd want out of a v 2 but we never go into UI software we always get hung up on the machine I still think that's where I start right now where I start Tim mhm well actually you know what I'm going to start with a little history lesson go for it great go for it PlayStation Vita objectively the best piece of Hardware that's ever been released in the video game landscape but the problem with it is that it's A Tale of Two Sony's it's still very much the PlayStation 3 Sony and it's still very much the PlayStation 4 Sony PlayStation 4 Sony of course came",
            "start": 184.48
        },
        {
            "text": "game landscape but the problem with it is that it's A Tale of Two Sonys it's still very much the PlayStation 3 Sony and it's still very much the PlayStation 4 Sony PlayStation 4 Sony of course came out kicked everybody in the teeth admitted they had **** up last generation and said they were going to fix it this time around right Mark Cerny comes out it's a powerful PC it'll be easy to Port your games it's not the cell processor we're here about games we're here about games we want to talk to Gamers we want Gamers to buy this system this is a machine for the hardcore gamer they never say hardcore but that's what they're striving right the the people that are starting to feel left behind whether it be mobile gaming whether it be whatever the Wii 's trying to do whether it be if you remember what Xbox one was saying they were going to do that they were going to TV TV Xbox Xbox TV TV TV Call of Duty they came out and said all the right things PlayStation 3 of course was them saying",
            "start": 222.28
        },
        {
            "text": "what Xbox one was saying they were going to do that they were going to TV TV Xbox Xbox TV TV TV Call of Duty they came out and said all the right things PlayStation 3 of course was them saying all the wrong things for a long long time and not really really understanding the market getting it on track in the end but still never really recovering right PlayStation Vita is right in the middle there where I think that if PlayStation Vita hadn't happened uh the way it happened with PlayStation 3 on the market and that's Sony if they would have waited and launched it after PlayStation 4 we would have seen a device that's the device I'm going to pitch you which is here's the handheld for the hardcore gamer The Gamer The Gamer The Gamer it's about games it's going to be easy to Port your stuff it's as powerful as a PS3 hopefully it's somewhere closer to a PlayStation 4 but whatever is actually technically relevant right it is a boutique item we aren't expecting to sell it a lot we want",
            "start": 259.52
        },
        {
            "text": "It's as powerful as a PS3, hopefully it's somewhere closer to a PlayStation for but whatever is actually technically relevant right. It is a boutique item; we aren't expecting to sell it a lot. We want this to get into your hands so that you, the person who loves video games, can play high-quality video games wherever you are on the road have that PlayStation experience, it. You look at this device; I think it looks a lot like the PlayStation Vita is right now except that it has two triggers. I and Colin disagree on this all the time. I say there's no touch of any kind because I think touch does hearken back to we're chasing the mobile market, we're chasing the casual gamer. This can be something for anybody. This is a device that we know we're not making the biggest margins on; we know we're not going to sell 15 million units on. We're giving you this device that we want you to do cuz then it's going to be the one where if it came out now or they made one now what they should rely on is that hey, play.",
            "start": 294.96
        },
        {
            "text": "We're giving you this device that we want you to do cuz then it's going to be the one where if it came out now or they made one now what they should rely on is that hey play your PlayStation 4 games anywhere with remote play and they tried a little bit with PlayStation Vita but it's always been so weird and pigeon hold in and all right cool like H you got to use the back touch for R2 and L2 and that never works right or swipe over here for a grenade and stuff like that L3 R3 exactly boil the dual shock down into an actual handheld and that's all it is and maybe it is chunky or maybe we get the form factor to where it looks more like a dual shock with a screen in the middle or something to that effect but that's what I would want out of a PlayStation Vita 2 I would want them to be the Sony that came out in that February event and say here is a device that is designed for you for you for you the person who's watching this we want to give you this",
            "start": 330.72
        },
        {
            "text": "We want them to be the Sony that came out in that February event and say here is a device that is designed for you, for you, for me, for you, the person who's watching this. We want it to give you this handheld and we want it to speak to you as a gamer, not worry about all right cool. And there are going to be iOS ports and this, that, and the other. I want it to be a real machine. Mhm. I agree with some of what Greg says, but I don't agree with all of it. I mean, the touchscreen thing is just a fundamental disagreement that he and I have about... um, I think yeah, you could say this is this this this quartz uh mobile gaming. To me, I say that's how we interact with devices so like the interface of the Vita itself makes like with the bubbles and stuff, I think it's fine, like I I think you can make something cooler. I'm not intelligent enough in design to know what would be um but but I say that only in the sense of that the touchscreen having a tactile",
            "start": 369.52
        },
        {
            "text": "fine like I think you can make something cooler I'm not intelligent enough in design to know what it would be um but but I say that only in the sense of that the touchscreen having a tactile screen is not that expensive in 2016 2017 at all um and even if you're just interfacing with the machine and not with games I think it's totally worth having it because that's the way we play with those devices I think it would I think it honestly would feel very old if you couldn't touch that screen I think that would be weird um but that aside I think one of the major things from a technical standpoint we've talked about this in the past I think is that to Greg's point of multiple Sony's is that there's no there's not been any synchronicity between Sony devices in a long time and it's been a huge problem for them so like uh PSP predated um PS3 and any interactivity between those two devices was really like not USB stuff yeah like not really that important um PS3 came out",
            "start": 411.16
        },
        {
            "text": "been a huge problem for them so like uh PSP predated um uh PS3 and any interactivity between those two devices was really like not USB stuff yeah like not really that important um PS3 came out and kind of caught fire later on meanwhile V was um really designed to work with PS4 but they couldn't say that yet and so they had this weird kind of internet space like Greg was saying where it's like well PS3 is doing fine we can't talk about the PS4 yet the Vita seems like it was made without the PS3 in mind but really it's made with the next console in mind we can't talk about it and that caused a lot of messaging problems it's the same kind of thing we saw with the light bar on the controller for the PS4 where like why does this exist and like well it's for the camera and all that I'm like but who cares and it's like oh it's for VR that's why you just couldn't say it yet like it's totally for VR and totally for the interactivity of VR so they have this synchronicity",
            "start": 447.44
        },
        {
            "text": "all that I'm like but who cares and it's like oh it's for VR that's why you just couldn't say it yet like it's totally for VR and totally for the interactivity of VR so they have this synchronicity problem with their devices and now that PlayStation 4 is doing really well uh to have a device that is more powerful than PS3 if uh components allowed and the price point can be below $300 which I think would have to be um you could have a boutique device a niche device like uh GameOverGreggy was saying um that I think could cater uh to um the hardcore gamer like he was saying as well but I think because all the stars align better for Sony now that they could probably sell twice as many of them as they sold uh Vita if a very specific thing of uh very specific things go in in in order they're not going to sell 50 million units or even 40 million units of a handheld ever again Nintendo even struggle struggling to like really hit and reach those numbers they have but um you know PSP was somewhere around",
            "start": 489.96
        },
        {
            "text": "sell 50 million units or even 40 million units of a handheld ever again Nintendo, even struggle to hit and reach those numbers, they have, but um you know PSP was somewhere around 80 million, DS was over 150 million or something like that it's like these are insane numbers that are never going to be reached again in the handheld market so as long as the expectations are calibrated downward then I really think the thing that's going to sell this is what we were talking about on uh on the reacts video that we did for PS4 slim is that I think they have to get developers on board and the way to do that is to say like the risk reward here is just lower and so you can make money it reminds me of going to a GDC talk I went to with DrinkBox Studios some years ago where they were like we put a game on mobile now with SE after launching it on Vita but they're like we really not comfortable doing that and I'm",
            "start": 531.36
        },
        {
            "text": "We discuss what we would want from a new Vita. DrinkBox Studios some years ago, where they were like, \"We put a game on mobile now with SE after launching it on Vita.\" But they're like, \"We really aren't comfortable doing that,\" and I'm paraphrasing because it's easier to find our games here and we make more money. Even though the investment is higher to make a game on Vita, um, people notice that and people buy games; the attach rate is high. So did Guacamelee come to iOS? I thought it did, but I don't know for sure. Sever makes sense on iOS, um, and I think it's probably fully playable there. I wouldn't be surprised by that. The thing they have to say is you know stat I was reading some stats lately; the last year handheld traditional handheld gaming only accounted for 3% of the market but this was only done on the back of what 40 or 50 or 60 million devices, it's an impressive amount of money made on a small amount of devices when you compare it to the quarter of the uh.",
            "start": 574.64
        },
        {
            "text": "the market but this was only done on the back of what 40 or 50 or 60 million devices it's an impressive amount of money made on a small amount of devices when you compare it to the quarter of the uh industry's gross revenue uh that is garnered from mobile across nearly three billion devices with an average price point of a game or an app at 50 cents with most of the stuff being free and with 58% of the AUD or uh 58% of Revenue accounted for with 1% of the audience that's those kinds of Statistics scare the **** out of game developers and to because they realize that a no one's like no one's really paying for their games 58% of revenue from 1% of the audience is not a viable solution for a more traditional space and 50 cent average being brought down heavily by free games means that money can't be made even if your game is niche uh and people are downloading it at 50 cents or a dollar or $2 there's no money to be made there it's not possible to turn things around so",
            "start": 612.48
        },
        {
            "text": "money can't be made even if your game is niche uh and people are downloading it at 50 cents or a dollar or $2 there's no money to be made there it's not possible to turn things around so go to developers and be like we want your games on this device and yes you may only sell a 100,000 copies or 50,000 copies of a game at $10 but isn't that not a lot better than having your game downloaded half a million times with 1% of the audience giving you maybe a couple dollars each you know like they have to make this pitch and Sony I think did make this pitch with the Vita a little bit and it did Garner games and games do sell well on Vita um not all of them but some of them so I think that that's the big strategic thing that they have to do is to say this might not make intuitive sense because of the volume but this makes intuitive sense for revenue and this makes intuitive sense if you want to make core games for core gamers and want to get noticed really nurture that catalog of games",
            "start": 656.4
        },
        {
            "text": "of the volume but this makes intuitive sense for revenue and this makes intuitive sense if you want to make core games for core gamers and want to get noticed really nurture that catalog of games and make sure and I think they've done actually a really nice job of that on Vita um there's garbage on Vita but there's actually a really good catalog of games on Vita if you and and they're not that hard to find so make those cases to developers um I think the tech is less important but but but but you know two triggers and all that kind of stuff I think is has to happen at clickable analog one by adding those I feel like you open the door to again have a mark sty presentation of we realized we made some errors with Vita originally this is going to be so much easier to port your games over indie every indie game that comes out it shouldn't be that the VA version now gets canceled whatever because no you just have to bring over the PlayStation 4 version and do some voodoo to it because I'm",
            "start": 696.12
        },
        {
            "text": "every indie game that comes out it shouldn't be that the VA version now gets canceled whatever because no you just have to bring over the PlayStation 4 version and do some Voodoo to it because I'm sure for these indies that aren't as powerful obviously and I hit the port button I just I I just do I I just do feel like you know Greg said you know they're only going to sell you know the expectations of 15 million I don't think that Sony should do it if that's what their expectations are they have to aim higher than that like whether or not it's possible I don't know but one last Fay into the uh into the market with a goal of 25 million I think is is not unreasonable considering what Nintendo's doing on the backs of their IP but also on the backs of some third party games that if they could just like people really enjoy some of this stuff the uh the level five games for instance uh like Professor Layton uh Square Enix is is is producing a lot of good content there um they're getting",
            "start": 733.92
        },
        {
            "text": "just like people really enjoy some of this stuff the uh the level five games for instance uh like Professor Layton uh Square Enix is is is producing a lot of good content there um they're getting some great Japanese games from other from you know uh from other developers and publishers as well if Sony can just nurture that make the connectivity between uh Vita and PS4 and Neo very seamless not only with remote play but perhaps with some uh emphasis on some sort of crossplay functionality well that I mean I I think that they just have to check a lot of boxes if they could check all those boxes successfully if there are 15 boxes and they can get 12 of them checked I think that I I don't think it's that crazy because I I I just it might seem unintuitive but you just have to set your expectations lower not everything has to sell like a PS4 you know like sure and I really still feel like they haven't probably lost money on Vita like and so I I think that Sony's a big Corporation and they had",
            "start": 770.68
        },
        {
            "text": "lower not everything has to sell like a PS4 you know like sure and I really still feel like they haven't probably lost money on Vita like and so I I think that Sony's a big Corporation and they had a write down on Vita for sure and they stopped reporting those numbers but I don't I don't know that with the burn of 10 15 20,000 of these being sold every week in Japan for instance with games still being released there and this thing just sitting there not doing anything with it like it's a burn you know like yeah slow bur you're going to make your money back in the long run but I mean that's the thing of what we're talking about is if they put out another one I don't think you call it V 2 I think give it another name and you focus on PlayStation 4 talking about the Vita in particular being a device out of time and out of sync with the company is the interface I hate the bubbles I think the they're fine don't get me wrong for what they do but it's a weird system that a weird interface",
            "start": 808.96
        },
        {
            "text": "a device out of time and out of sync with the company is the interface I hate the bubbles I think they're fine don't get me wrong for what they do but it's a weird system that a weird interface that isn't PlayStation in any respect and it was one of those things when we originally got it we were like oh interesting is this a hint of what PlayStation no you get PlayStation 4 and it's I think it's clear that they were like we're not bringing the XMB over to PlayStation 4 so don't do what we did on the PS3 and PSP which made sense it was awesome because it was easy transfer files and stuff in between but we don't know what the PlayStation 4 interface is going to be yet so you can't do that either so it became all right we'll do this touch bubbly thing that originally you didn't even have the ability to control with any of the real buttons you had to touch and do all these different things making it feel like this device that wasn't built for gamers and so that's the whole thing is",
            "start": 843.8
        },
        {
            "text": "the ability to control with any of the real buttons you had to touch and do all these different things making it feel like this device that wasn't built for gamers and so that's the whole thing is you put out whatever you call the next handheld Vita 2, which is not what you call but we'll code name it, and you make it look like LiveArea - it's the exact same idea, exact same stuff happening on it, same thing where you go over you know you go one to the left or whatever and you see what your friends are doing and how that's going then the store is always up there and you're same same everything just to get in there and be like okay this is what this device is and this is how it communicates and when I plug it into the PlayStation 4 the PlayStation 4 recognizes it which is out of control insane that when you plug the Vita into the PlayStation 4 it just goes this device is not supported yeah it's like are you kidding me that was like CU like granted we were moving in all sorts of uh ways a",
            "start": 877.28
        },
        {
            "text": "when you plug the Vita into the PlayStation 4 it just goes this device is not supported yeah it's like are you **** kidding me that was like CU like granted we were moving in all sorts of uh ways a normal consumer doesn't but it was so much easier to download games to the PlayStation 3 and plug in your Vita and for them over and the Vita, I like even with like photos the way you can uh screen cap and then plug it into your computer and your computer's like okay cool you want to drag these into your photos I'm like yes this is perfect this is great why is it such a chore to make this understand what's happening on the PlayStation 4 yeah I for me I've been thinking a lot about this a couple days ago me and Greg were talking on Colin Moriarty's live stream, I guess it was yesterday uh about what it would be called like what's the best title for it and I was saying I think it should just be PlayStation Portable and call it a day but I was like is there something better to do because I think port is a bit of",
            "start": 912.28
        },
        {
            "text": "like what's the best title for it and I was saying I think it should just be PlayStation Portable and call it a day but I was like is there something better to do because I think port is a bit of an outdated thing we're talking about the V being stuck in a in a time that doesn't really exist anymore and it was in the middle of the the things I think that the idea of a portable system is very close to being outdated when when we have mobile existing forever and that we have what we think the NX is going to be um I think that the idea of a portable is kind of a bad direction to go and that's why I think that if Vita 2 or PlayStation Portable 3 whatever the hell it's called is like a real thing I think it needs to be radically different actually targeted towards the the hardcore gamers but thinking of instead of making just another thing that's like oh it's a portable system take that out of totally out of your mind think of it more as a system that you can play outside of your house",
            "start": 951.68
        },
        {
            "text": "thinking of instead of making just another thing that's like oh it's a portable system take that out of totally out of your mind think of it more as a system that you can play outside of your house yeah so it's like even if it is chunkier it does have the the shoulder buttons and the analogues and everything's proper right but I think that uh a unique way to do that would be instead of having the the next Vita being a system have it being a platform even if it is what PlayStation Now could turn into or whatever the hell you want to call play they have PlayStation Plus PlayStation Now play they add all these things but like uh PlayStation something that what if it was an app on a phone that you can get on iOS or on Google Play and use a DualShock 4 you know and like I don't know the technical Wizardry around that but if they figured out Remote Play and that was it it's just it is the experience of playing PlayStation games whether it's PS1 Classics PS2 Classics um games like PSN games",
            "start": 993.68
        },
        {
            "text": "Wizardry around that, but if they figured out Remote Play and that was it, it's just the experience of playing PlayStation games, whether it's PS1 Classics, PS2 Classics, um, games like PSN games or whatever. Like it always blew my mind that PS3 PSN games and PS4 PSN games can't play nice, and I get it's the API and all that stuff, but um, I think the idea of just figuring out a way to make the DualShock 4... that is it. People have screens everywhere, you know? You can if you can just instantly connect it, I think they're taking steps towards that. We saw with the PC connector, so you can connect your DualShock to a computer and play games using Remote Play or whatever, like that's a step towards what I'm talking about 100%. Um, the idea of there isn't a different piece of hardware for the portable gaming experience in 2016, but going off the NX model of what we think it is... of being this, it is just whether it's a console system or a portable system. The idea is you can play wherever you",
            "start": 1037.92
        },
        {
            "text": "gaming experience in 2016 but going off the NX model of what we think it is, of being this, it is just whether it's a console system or a portable system, the idea is you can play wherever you want or connect it to your TV and I think that obviously connecting it to your TV that's a PlayStation 4 right yeah um but connecting it anywhere else I think it could be an app and I you know a lot of the like iPads these days phones these days uh Android phones they're powerful you know they can play a lot of these games and uh you look at Vita, the specs eventually get outdated you know whereas these phones are constantly being updated and yeah it does create a scenario where certain phones and certain things won't be able to play but I mean that's I think easy to remedy with just being like all right well then either upgrade your phone or don't play those games you know play the games that are available no that's an interesting move I mean we've always talked about it in",
            "start": 1082.92
        },
        {
            "text": "right well then either upgrade your phone or don't play those games you know, play the games that are available. No, that's an interesting move. I mean we've always talked about it in the months prior of like, was Guilty (Guilty) huge mistake for PlayStation to buy and now that we're getting to this PC thing, it's like oh this makes more sense of what they were doing where they're going and that does make sense too. I don't think we're there yet, I think you get another device before you get that and like again with the device if I was going to put it out like an easy way to get everybody super excited just from the get-go, it's like here's Vita 2, we've not calling it that here, we're just fixing all our mistakes. Da d d d da this thing can play all of your your this get where it would get really weird not all of them because it'd be confusing but stick with me all of your downloadable PlayStation 3 games, right, your Journey's these different things, not of course you can download anything so not",
            "start": 1126.96
        },
        {
            "text": "Weird, not all of them because it'd be confusing, but stick with me. All your downloadable PlayStation 3 games, right? Your Journey's these different things, not of course you can download anything so not downloading Fallout 3 or whatever I'm playing, but there'd be that uh every PlayStation 2 classic we've re-released with trophies that's enabled from day one, all the PS1 Classics that for some reason would even bring over they're here like and and I think that is in addition to that just that's take the DualShock 4 put a screen in the middle of it let it do all those things and then you can use it as a PS4 controller if you want to play those PS4 games or the Remote Play right, and the Remote Play has its limitations but that's cuz that's just where we're at, you're not going to be playing PS games on the wherever the hell so I think that there's a lot of different options and I think that you know they know this like I'm sure that PlayStation knows what NX is up to you know what I mean.",
            "start": 1163.96
        },
        {
            "text": "We discuss what we would want from a new Vita. I think there's a lot of different options, and I'm sure PlayStation knows what Nintendo Switch is up to, you know what I mean, and I'm sure they're trying to remedy that in other ways. I'd be shocked if they actually come out with another thing that looks like the Vita, yeah. Just because I personally feel like that's just a really outdated move; it'll do fine, you know, it'll do I don't think it'll lose money but I think it'll be another thing of just you know it'll get them enough revenue for it to be worth it, but at this point I think that it's not uh a good call to put out things that are just going to be there like we already have VR, that's going to hit, you know what I mean, like that focus on stuff instead of just putting out more things because then then uh press conferences get more and more convoluted and then people are like eventually next year if there is",
            "start": 1198.88
        },
        {
            "text": "I mean, like that focus on stuff instead of just putting out more things because then the press conferences get more and more convoluted, and then people are like, \"Eventually next year if there is another Vita announced, they need to focus on PS4 titles, the portable titles, and VR titles,\" and it's like, \"Where do they do all that stuff?\" And don't forget trying to explain the Neo. Oh yeah, and all that. So, yeah, I mean it gets complicated, it's muddied and muddled. Um, but I think what Sony needs to realize, and I think what's really important and what's integral is they should not seed this hill, and I don't mean \"cede\" this hill of handheld gaming to Nintendo. Nintendo is in trouble; they're on the ropes, and they have to like push them, you know, like someone needs to challenge them. The idea of what the NX sounds like it's going to be is cool, and I'm",
            "start": 1241.36
        },
        {
            "text": "but as a manufacturer of hardware, they certainly are and push them, you know, like someone needs to challenge them. The idea of what the NX sounds like it's going to be is cool and I'm interested in it, so fight with them like that's what they've done with VR; they were really at the tip of the spear of VR, was a bold move, and I think it's going to pay off for them ultimately. Um, it might take time, and it might come outside of gaming, it might come from some other part of Sony, but being on VR and making sure that they have a proprietary piece of hardware there, I think is very smart. And with NX, you know, doing something which I think is interesting, which is like a u this console and handheld experience. Don't let them get away with it. Like I agree with you that they must know, and I'm sure everyone knows what everyone's doing at the top, so at least force them to make moves that you know force your competitors to make moves",
            "start": 1283.8
        },
        {
            "text": "that they must know, and I'm sure everyone knows what everyone's doing um at the top and so at least like force them to make moves that you know force your competitors to make moves that would defend their position because if NX is is uh you know uncontested in this like particular space I'm not saying that they need to make a hybrid console because that's not what they're going to make but uh the handheld space if it's uncontested that's boring like and that's not and that's not really good for the gamer like Nintendo is in a corner and uh so they they're kind like they have like I said they have something to prove they have to uh figure things out and I I think the NX is probably going to be pretty cool but or at least I hope I don't know why I feel that way because you know they haven't released any hardware that's that's uh super compelling but the rumors do sound awesome and so um so I really want to see like what that's all about uh and I think Sony kind of challenging",
            "start": 1320.8
        },
        {
            "text": "They haven't released any hardware that's that's super compelling, but the rumors do sound awesome and so um so I really want to see like what that's all about uh and I think Sony kind of challenging them and using some of this war chest that they're slowly accumulating again um on the back of PlayStation 4 success it would be smart to invest in other places but at the same time a company as big as Sony that does things other than gaming unlike Nintendo really um if they're looking at profit margins that are small like it might not be worth it for them to do it but I've said it over and over again and I believe that they're crazy enough to do it and and uh I disagree with you I think that I think that you will get a handheld that like is um maybe a little chunkier or something like that but it will be a very much a handheld and uh if it happens at all um but I don't know you know I have a vision in my head of something like a little bigger than Vita, I've always had that Vision I don't",
            "start": 1359.6
        },
        {
            "text": "it will be a very much a handheld and uh if it happens at all um but I don't know you know I have a vision in my head of something like a little bigger than Vita I've always had that Vision I don't know you know if that's if that's the case but um as long as it you know but again it's all these little boxes another box that they have to check is like marketing and not not marketing to Gamers but making sure that they're not laughed out of the room when they announce it I think that's a huge thing that they have to figure out too like it's going to be when NGP was announced it was everyone's like of course you're going to release another one we've known that for a long time it was rumors circulating about that for forever uh in 2016 2017 2018 if you're going to announce a new handheld like you have to make sure that there's a Castlevania: Aria of Sorrow art style you have to make sure that the that I've been waiting for you to comment on this for so long the thing I love about the art",
            "start": 1398.4
        },
        {
            "text": "you have to make sure that there's a uh this Castlevania art style, you have to make sure that the uh that uh I've been waiting for you to comment on this for so long, the thing I love about the art on so we block so much of it, it just looks like Colin's go now it doesn't but it before when Colin looked straight at the camera, it looks like he's just in front of like a jet bridge, like he's about to say goodbye and then walk up the stairs under a little plane and take off, yeah yeah that's an iconic Castlevania scene anyway so I I I I would not be surprised, not I don't think you'll see it necessary, that's my question real quick before we go let's let's really put our thoughts into a time capsule, is it getting announced to place, is there going to be a handheld, neither I don't think so I would love that but I don't think so this is something you announced in Japan, there's too much to announce you can't come out and be like cool here's the PS3 or PS4 slim sorry it's been leaked here's the Neo.",
            "start": 1435.24
        },
        {
            "text": "that but I don't think so this is something you announced in Japan there's too much to announce you can't come out and be like cool here's the PS3 or PS4 slim sorry it's been leaked here's the Neo here's more with VR maybe I'd assume but like they need hey VR don't forget is a month away pretty much like we need to talk about that a bit Yeah I think that you announce the NGP you announce uh VA successor in the safety of the Japanese market like I I I think that you do that and that saves you a lot of trouble I would be shocked if they announced that in the west I mean it will come out in the west if if it's released but I I'd be shocked if they they made that like you know a specific sticking point for them my favorite thing about the PlayStation meetings or whatever is the the hype intro video oh Sony does so good it's so good I can't wait to see what they do with this because it's about to be the hottest so I went to Twitter and I asked people what they wanted from the Vita 2 Jason",
            "start": 1471.92
        },
        {
            "text": "What Would We Want From A New Vita? - Kinda Funny Gamescast Ep. 84 (Pt. 1)\n\nvideo oh Sony does so good it's so good I can't wait to see what they do with this because it's about to be the hottest so I went to Twitter and I asked people what they wanted from the Vita 2 Jason Das says he has a long list there was a photo that he did cuz he he didn't want to use no 40 characters oh he has 10 things that he wants SD memory card expandable yes we didn't talk about that yet none of the propery mem I agree two built-in storage he says 32 GB I think that that's should be standard these days of at least some built-in storage uh a centered front face camera really do we need this like what um remove back touch and reduce touch area okay yes yeah back touch needs to go yeah they paint themselves into a corner with that dual trigger shoulder buttons yep yeah that's an obvious one L3 R3 oh sure ability to live stream on Twitch longer battery life that's I mean that's software the battery life not but the twitch thing is like then 10 just games games games games",
            "start": 1511.76
        },
        {
            "text": "an obvious one L3 R3 oh sure ability to live stream on Twitch longer battery life that's I mean that's software the battery life not but the twitch thing is like then 10 just games games games games games games games games yeah he's he's hit on some of it I think that like you remove like I'm not I want whatever the storage solution is it has to be like I'm not convinced that it needs internal storage if if if it will make the the unit cheaper and if you can use purle if you're just using SD cards you get off amaz I wouldn't care if that's the case I think that it needs to come bundled with some SD card even if it's small it it be four gigs in order for this to succeed like they need to not have the problem that they had last time like when Vita was announced as the Vita not the NGP everyone was just like what the **** is this because of the name and because the memory cards and all that like that's when the bad news came well yeah well no no the memory card stuff came after",
            "start": 1561.04
        },
        {
            "text": "We discuss what we would want from a new Vita. was just like, what the **** is this because of the name and because the memory cards and all that, like that's when the bad news came. Well, yeah, well no, no, the memory card stuff came after when they were at E3 in 2011 and we were all like, \"What's awesome,\" and then it was, yeah, one PSN per thing you had to use our **** memory cards, super expensive. And I think that now they would need to remedy all of that, but again, cuz they have to come out hat in hand and be like, \"Hey, we made a lot of mistakes, and we're not going to do that again.\" You don't only say that by the way; you have to say you believe in the device. Like, V is a fantastic device, but we did make a series of errors that we're correcting with whatever the **** it's gonna be cool. Casey Weaver says just make it a PS4 controller with the screen in it, done. I agree with that. Um, Andrew Garcia very similar thing to me here - an amazing battery life, two shoulder buttons, regular memory cards, or just an extra",
            "start": 1601.0
        },
        {
            "text": "it a PS4 controller with the screen in it done I agree with that um Tim Gettys very similar thing to me here an amazing battery life two shoulder buttons regular memory cards or just an extra micro SD slot to add uh Bluetooth so that my PS4 controller can just attach to it I don't care if it's the size of an iPad Pro I just want regular buttons to use absolutely uh Mark Trembly says AAA exclusive titles and more focus on crossplay and save specifically with sports games yeah um there's a lot of hate out there hate hate hate Lon Ecott saying I'd rather they just not be a Vita 2 and our boy Trevor Starky current Vita just plus extra shoulder buttons minus the back touch and with a light bar so it can work as a PSVR controller uh William Ramos says just give me back those big beautiful black PSP buttons don't need those hard candy baby Vita buttons that's what you're always saying Tim is that one of your alt accounts agree with you it is William Ramos Willi R that's where you send",
            "start": 1636.88
        },
        {
            "text": "black PSP buttons don't need those hard candy baby Vita buttons, that's what you're always saying Tim. Is that one of your alt accounts? Agree with you it is. William Ramos, Willi R, that's where you send your nudes from, like Jimmy Champ says more FPS games and more original Square JRPGs in the West. I'm am Zuna would have been great. Danny Rosan says support from Sony would be nice, more AAA games to return to a Sony handheld such as GTA. That's the thing that's a huge point too is they have got to commit with internal resources. They did for a minute, they got scared off very quickly and I still think and I and it makes sense why they were scared off because like well the timing of this isn't very good. We have you all need to make PS4 games and and you know Bend is really the last one that's going to come out with a PS4 game so um they have to commit resources significant resources and money and money to third parties if they want m for instance to speak to the Madden on PS4 then that's going",
            "start": 1691.0
        },
        {
            "text": "to come out with a PS4 game so um they have to commit resources significant resources and money and money to third parties if they want m for instance to speak to the Madden on PS4 then that's going to cost them money not EA yeah so um I agree you know and and they've they abandoned the Vita and and even with MLB The Show and stuff like they stopped doing it it's like what you what are you guys doing um but it's a numbers game and bean counter somewhere I have to figure out that these things these things don't make sense Dan Wilkinson says Simplicity don't put the pressure on it being a Home console like experience let it be a sibling rather than an extension Shane F says HDMI out so I can play my video games a big screen when I'm not outside I think that's a no-brainer at this point and the frustrating thing always was that the Vita devkits have HDMI out so like why that wasn't even a thing to begin with is a little weird a mystery report of the original Vita Matthew E. Remis says",
            "start": 1729.6
        },
        {
            "text": "the frustrating thing always was that the Vita devkits have HDMI out so like why that wasn't even a thing to begin with is a little weird a mystery report of the original Vita Matthew C. Richter says something interesting I don't care for this but allow download of iOS and Android games to help sell units okay that just doesn't work that way I know it doesn't but you know yeah and if people have their phones they have their phones you know like yeah you maybe you can get in the uh the Sony Xperia Play Store whatever the hell's going on over there then to end this topic out there was a back and forth that I need to call people out on cuz it was awesome Joe Lapalante says I don't want a Vita 2 I want a PSP 2 no back touch internal memory better OS to which Brandon Farve responds **** you Joe you wouldn't buy it anyway to which Joe responds I'd buy it day one like it did my V not my fault it didn't have games that I cared to play Brendan responds yeah it is thank nailed him all right guys",
            "start": 1771.0
        }
    ]
}