{
    "id": 2068,
    "video_id": "QDN3QhQHIqo",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Million Dollars But and Showering - The GameOverGreggy Show Ep. 146",
    "description": "We play Million Dollars But, talk about Back to the Future, discuss shower routines, and bring up friendships we've had to end. (Released to Patreon Supporters 09.16.16)\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1474641011,
    "duration": 5436,
    "transcript_chunks": [
        {
            "text": "guys you don't need to choose between price and quality to get an amazing and affordable shave DollarShaveClub.com is the answer to prove how amazing their shave really is right now they are going to give you the first month free to join the club DollarShaveClub.com delivers amazing razors right to Tim Gettys' door that's right Tim Gettys uses them are you saying you're better than Tim Gettys I don't believe it don't make me curse at you I don't want to you can get those razors for a third of the price of what the greedy razor corporations want see why 3 million members like Tim Gettys love DollarShaveClub they're so confident in the quality of all of their products now you can get your first month of the club for free just pay shipping after that it's just a few bucks a month no long-term commitment no hidden fees go to DollarShaveClub.com gregy that's DollarShaveClub.com gregy don't you want to look like Tim Gettys I sure do below the waist what's up everybody Welcome to the",
            "start": 0.28
        },
        {
            "text": "no hidden fees go to Dollar Shave Club.com GameOverGreggy that's dollarshaveclub.com GameOverGreggy don't you want to look like Tim Gettys I sure do below the waist what's up everybody Welcome to The GameOverGreggy Show I'm one of your hosts Greg Miller alongside the producer SL Seducer Nick Scarpino hello now you're breaking the internet like Kim K did my girl Kim K what is this shirt it's just a shirt it's not heather gray it's black it's not a it's not one of ours every once every six to seven months I I'm like I want a little touch of color in my just a little touch do for stand up and then give me like put your put one leg on the chair cuz your whole outfit Captain are these chinos you're wearing these are they are not Chino not the Chino's brand but they are J.Crew P I was about to say is that a J.Crew shirt no look look at this it's just a shirt look at him he got the blue shirt now don't go away from the light come into the light come here come back back it up back it no that's not",
            "start": 42.52
        },
        {
            "text": "that a J.Crew shirt no look, look at this, it's just a shirt, look at him, he got the blue shirt now don't go away from the light come into the light come here come back back it up back it no that's not what we want Nick that's I can't see the outfit at all I just see your hand I don't see anything now you're going the wrong way well we got these like white pants on, got some gray pants, some wear pants W look at you, you wear pants all the time and I like that, I appreciate that it's just who pic no uh what's happening is uh I'm going on vacation uh in a couple weeks my wife and I are going on a little adventure and uh we're going to go to London first for a couple days and then we're going to go to Morocco oh um yeah this is one of those yeah it's very interesting it's going to be not a relaxing vacation it's going to be you're going to have a great time oh I'm going to have a great time we're doing like crazy stuff I mean in a bad way I think it's an interesting what does crazy stuff",
            "start": 127.08
        },
        {
            "text": "vacation it's going to be you're going to have a great time oh I'm going to have a great time we're doing like crazy stuff I mean in a bad way I think it's an interesting what does crazy stuff constitute uh glamping we're going to glamp what is glamping glam camping what is that glamorous camping well you go you just you pay and they drive you out to the middle of the desert and you you sleep in a nice tent and you feel like you're camping but you're not really deserts in London no I mean it won't be in London per se although we might camp in London no um yeah we've got uh we're not going to camp in L definitely not camping L um God is that that laugh just grades on you is it coming through I hope you wake up in a fever dream in Morocco in the Moroccan desert here in that laugh cackling in the desert will they have scorpions there so we'll see what happens um so stuff like that we're going to do probably ride a camel I would imagine a camel ride a camel okay and then we're",
            "start": 165.52
        },
        {
            "text": "in the desert will they have scorpions there so we'll see what happens um so stuff like that we're going to do probably ride a camel I would imagine a camel ride a camel okay and then we're going to Tech they are renting it yeah when they ride it du going bizarre you need to see the things we're going to Fez we're going to um uh I forget the other two places we're going to Morocco oh that's awesome I forgot I forgot the London part I saw on the thing you were going to vacation totally forgot that you were going to London yeah originally um yeah we we were going to only stay in London for one night and I'm like well if we're going over there might as well acclimate to the time zone degree and then stay a couple days and I'm just going to run around and pretend like I'm Harry Potter I'm going to try to get tickets to The Cursed Child but I doubt it's going to be possible you have to pay through the nose probably probably you'll have to pay at least $100 a ticket that's only what $84",
            "start": 206.32
        },
        {
            "text": "to try to get tickets to Harry Potter and the Cursed Child but I doubt it's going to be possible you have to pay through the nose probably probably you'll have to pay at least $100 a ticket that's only what $84 now that's like probably $130 or so yeah yeah I don't know anymore over here the New York Jets it's back football's back they're either 1-0 or 0-1 by the way if you're a Patreon well no they play Thursday so they'll they'll either be 2-0 0-2 or 1-1 that's it there's only three options they could possibly be my guess 1-1 okay lost to the Bengals beat the Bills and that's the pure one Tim Gettys that's the most this seems like a classic Tim shirt I I feel like I haven't seen this one in a while it's been a while it's been out of rotation been trying to bring it back Cowboy Tim shirt the cowboy Tim shirt this is the shirt I was wearing the night that I met Gia your girlfriend what was that just why are you so afraid of the",
            "start": 240.12
        },
        {
            "text": "of rotation been trying to bring it back Cowboy Tim shirt the cowboy Tim Gettys shirt this is the shirt I was wearing the night that I met Gia your girlfriend what was that just why are you so afraid of the wide Kevin just leave it in the wide more Kevin I know you can hear me leave it in the wi if you didn't know this is The GameOverGreggy Show each and every week four sometimes five best friends GA on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com kind of funny where you can toss this a few bucks and get each and every episode early along with a bunch of exclusive perks and other goodies if you have no bucks to toss no big deal head over to youtube.com/ kindof funny where we post the entire show topic by topic day by day until goes up his one big MP3 in video for your viewing SL listening pleasure you going to drink my beer now I'm just smelling up when you get back on the beer train I've never been on the beer train you uh",
            "start": 277.84
        },
        {
            "text": "up his one big MP3 in video for your viewing pleasure you going to drink my beer now I'm just smelling up when you get back on the beer train I've never been on the beer train uh, Kor's light over ice that was there was a moment there was a like a month of my life where I thought that was funny to do and then I realized that beer is disgusting and that no one should drink it because it's poison that goes into your body and comes out of your anus having so many wet poops lately yeah you gotta stop wet pooping got them wet poops got them wet poop Tim what's your topic so my topic is this little game called Million Dollars But you can find it over on RoosterTeeth.com store I assume this was crowdfunded recently uh to the tune of over a million dollars without a butt but what's your butt Greg my butt is to be 1,000% clear they're not paying us to play it no they didn't order us to play it their teeth isn't infringing on your kind of funny content we just enjoy it and we are on",
            "start": 321.24
        },
        {
            "text": "your butt Greg my butt is to be 1,000% clear they're not paying us to play it no they didn't order us to play it, teeth isn't infringing on your Kinda Funny content we just enjoy it and we are on Million Dollars But about the show coming up we are which will be live as the time you see this if you're not a Patreon user at the time we're recording this right now is September 8th on a Thursday and uh oh actually holy **** this episode's going up way later right yeah because we're doing the GameStop thing in check out youtube.com/rooster teeth or roost.com the latest episode of Million Dollars But features me and Greg and one Jeff Rubin doing the actual show so this is a card game based off the show where in the show you say it's you get a million dollars but and you give some weird scenario and people talk it out and there's dramatic reenactments of it and it's really funny I think it's one of the best shows R does one of the best shows on the internet period I'm happy we got to be a part of",
            "start": 366.0
        },
        {
            "text": "people talk it out and there's dramatic reenactments of it and it's really funny I think is one of the best shows R does one of the best shows on the internet period I'm happy we got to be a part of it our episode's fantastic joined up with let's play they said oh we love to get you on rre content what do you want to be on and I said I need to be on million dollars but because it is my favorite R show and I said always open that wasn't the thing that didn't exist then I just want to be surrounded by those women and hang out with them in their cool set I'm a little I'm a little have you seen you've seen it you've showed me I mean I've seen a bit of it it's really cool I'm jealous I love the intro to that show it's a dope intro it reminds me the 90s it's amazing 90s anyway million dollars but is fantastic so this's this card game they put it out they kickstarted it did Super well people really loved it their goal was $10,000 they end up getting over a million so",
            "start": 409.12
        },
        {
            "text": "dollars but is fantastic so this's this card game they put it out they kickstarted it did Super well people really loved it their goal was $10,000 they end up getting over a million so that's really cool I have not been to a convention since this has been out that I haven't seen so many people just playing at every Starbucks every everything like this is the new Cards Against Humanity I was going to say to boil it down it's like Cards Against Humanity right the rules I wanted to play with you guys explain the rules to us I've never actually played the card game so we'll see how this I SW we did at some point was it just me by myself it might have just been you I just sat in my room with Portillo dealing cards so if only we had a camera that was hung above the desk so we could actually see this card game it's going to be great all time setup each player takes four black trigger cards and four gold rule rule cards okay sure all right together these make scenarios now pick a",
            "start": 444.96
        },
        {
            "text": "actually see this card game it's going to be great all time setup each player takes four black trigger cards and four gold rule rule cards okay sure all right together these make scenarios now pick a judge the person carrying whatever they they're trying to make jokes and they're not funny come on try harder guys one players hand a full scenario which is a trigger plus rule face down to the judge two one at a time the judge reads the scenarios out loud three players attempt to glorify or downplay the scenarios four the judge picks the scenario they absolutely would not do they wouldn't do look like Apples to Apples like in some sort of way Like Cards Against Humanity yeah okay yeah I I don't think I've ever even played it's all the same thing but but there is a difference here where this does require at least some form of skill because Apples to Apples too is a copy of Cards Against Humanity, isn't it the super adult version or whatever that's the whole point I see yeah yeah yeah I",
            "start": 483.44
        },
        {
            "text": "does require at least some form of skill because Cards Against Humanity is a copy of Apples to Apples too, isn't it? The super adult version or whatever - that's the whole point. I see, yeah, yeah, yeah. I think I have played that. No one has original ideas anymore; it's okay. No, I know. It's all... this is of course a copy off of Poker. True, uh. The judge picks the scenario they absolutely would not do, and this is the winner - the winner of the round becomes the new judge. Players then draw back up to four of each card type. Okay, so we take four; we always have four in our hand of each card type. Yes, gotcha. Easy done. Let's do it. The winner is the first player to win five rounds. All right, okay, okay. I say, do we get Kevin involved in this? Cuz who's going to who's going to switch the wrong camera? What the... what is going on? I'm getting so small; is this I don't know. All right, F. We'll do it without him. I was just going to say he could be the judge, but I guess we switch judges that doesn't",
            "start": 529.16
        },
        {
            "text": "what the **** what is going on I'm getting small is this I don't know all right F we'll do it without him I was just going to say he could be the judge but I guess we switch judges that doesn't matter play do you want to run back and forth with cards all night long no all right cool we're just going to do the four of us I guess technically if you wanted to shrink us and then just leave it like that that would work what do you do when Kevin wants to because you shrunk us like Mike TV got shrunk and then sent over the waves he's like I'm so small that's that was the joke Kevin I don't know what you're bringing to the table your own weird psychosis all right no here you go I'm going to pick you up oh sorry thank you so uh when we lay the cards down gentlemen I believe the focal plane is the actual table okay so we flip them here judge flips flip them there yeah you put up here though there's too much depth to fill in I camera so we need to judge",
            "start": 571.56
        },
        {
            "text": "I believe the focal plane is actually the table, okay? So we flip them here. The judge flips them there. Yeah, you put up here though. There's too much depth to fill in the camera so we need to... We need to judge this. Who wants to be the judge of the first round? I'll judge the first round, okay? You can't judge right? Actually, I guess you could. We'll let Kevin judge round one. Kevin could judge all the rounds, that's no... I don't like that because the whole point is he could just keep things that you know what makes him laugh and that's how it works. Alright, fine. That's why the judge has to switch. But for round one, Kevin gets a judge. You guys, I hate you all equally now. You're trying to find the one that you think the judge who is now Greg... No, no, the judge for number one is going to be Nick. Right? Kevin would least like okay, least, least the one that he would not choose. Okay, yeah. The one he thinks we're picking what's the worst scenario for Kevin? Koella. There's sadly I don't have a",
            "start": 632.08
        },
        {
            "text": "card right Kevin would like least okay least least the one that he would not choose okay yeah the one he thinks we're picking what is the worst scenario for Kevin Koeller there's sadly I don't have a million dollars but you have to shower can you guys stop telling people I stink cuz they always they always give me hugs and they're like oh you smell really good and it's like those Liars it's cuz they're giving you hugs at the beginning of the day nope that's not even true a little bit that's not even true a little bit put him face down they would smell an old shoe look at you I'm swi rotating everything around wait Kevin doesn't know who's doing what this you're trying to give you're really quite quick at it so it's not well you know I mean look at Kev Kev all I'm trying to do is dup Kevin it's very simple my god it worked ready Kevin you're the judge what's up I'm going to flip them for you ready so Kevin a million dollars but put you up top okay come top right there we go look at",
            "start": 674.68
        },
        {
            "text": "It's very simple, my god, it worked. Ready, Kevin, you're the judge. What's up? I'm going to flip them for you ready. So, Kevin, a million dollars but put you up top okay come top right there we go. Look at that. You, a million dollars but, Kevin. You become the number one suspect in a murder case. Okay, a million... I'm sorry, a million dollars but. Aill, there's more to it. A million dollars but, a random kid claims you are their parent and violently cries when you try to deny it anytime you see a child. So, you see a kid, and I'm assuming that kid then claims you are their parent, violently cries whenever you try to deny it. That's pretty good. A million dollars but there's a 10% chance the water in your next shower will be diarrhea instead. Oh my god, when someone corrects you, uh-oh. Oh, Kevin, you get corrected all the time. A million dollars but everyone on Earth gets superpowers except you now okay before you answer sounds like marble we're we're supposed to discuss these I mean",
            "start": 719.8
        },
        {
            "text": "oh Kevin, you get corrected all the time. A million dollars but everyone on Earth gets superpowers except you now okay? Before you answer, it sounds like \"Marble\" we're supposed to discuss these. I mean, for honestly knowing Kevin, I would say the one he won't pick is \"A Million Dollars But...\" Everyone on Earth gets superpowers except you because he has the biggest fear of being left out. Yeah, he has a lot of anxiety about this. I feel like this is actually probably just happening right now if I'm being honest. Don't push out of the frame. I apologize. So this one I feel like \"A Million Dollars But...\" You become the number one suspect in it's 100% possible that there's a couple girls from the mall that this one might be um to be to before we jump around for the murder suspect case thing here. Remember, of course Kevin is a minority so the justice system is already stacked against him. Yeah, so that is pretty bad. Kevin, you want to be there? That is pretty bad already. Might as well be OJ Simpson.",
            "start": 781.16
        },
        {
            "text": "Kevin is a minority so the justice system is already stacked against him, yeah, so that is pretty bad. Kevin, you want to be there, that is pretty bad already. Might as well be OJ Simpson. Might as well, the kid crying, I mean whatever had so many so many things wrong with a random. I'm sorry, I was like he got off a random kid claims you are their parent and violently cries when you try to deny it again. That might be happening on any given day with Kevin. Not with Kevin, no. Kevin, no one has ever claimed that he had any illegitimate children yet. Yeah, I out every time. The thing is, he's young, so he probably didn't start having sex about five six years ago at this point. The kids have just learned language and now they're going to start looking for him actively searching for him on the internet. And then again when someone corrects you there's a 10% chance the water in your shower will be diarrhea, and we all correct the **** out of Kevin. Oh yeah, but Kevin's usually right when I",
            "start": 826.48
        },
        {
            "text": "internet and then again when someone corrects you there's a 10% chance the water in your shower will be diarrhea and we all correct the **** out of Kevin oh yeah but Kevin's usually right when I correct him so I don't think that that doesn't matter it didn't say right or wrong yeah that's true that's how correcting works though I don't know when you get corrected a lot but that's only a 10% chance the 10% chance of diarrhea also also here's the thing guys I turn the water on and I stand out there for a minute and I think if it was diarrhea I'd be like nope not going in there yeah that's that's an easy one for nope not going to do that well you also there's there's a hot smell factor too that you would you appreciate and they like that does not smell like water me I feel like it'd be pretty clear if it was diarrhea or water coming through but then that's still filling your shower with diarrhea it wouldn't be clear diarrhea is not clear but it's brownish yellow but you still need to",
            "start": 868.44
        },
        {
            "text": "clear if it was diarrhea or water coming through but then that's still filling your shower with diarrhea it wouldn't be clear diarrhea is not clear but it's brownish yellow but you still need to clean the diarrhea from the shower Kevin pick one what's the one what's the worst what what wouldn't you do for a million dollars which one of these would I not do for a million dollars what's the one let's go let's go through all of them which ones would you do would you become the number one suspect in Murder oh yeah yeah yeah cuz like okay I'm a suspect yeah a million dollars you can get out of that you get a million dollar you spend $200,000 tell that to Richard Jewell I don't know who tell to OJ Simpson remember Richard Jewel I do think he was found the he found the bomb and he was like oh hey bomb everybody like you're an actual hero wait a second no you did the bomb and he's like no I didn't Richard Jewell I had to go in deep into my database I was",
            "start": 906.72
        },
        {
            "text": "he found the bomb and he was like oh hey bomb everybody like you're an actual hero wait a second no you did it and he's like no I didn't Richard Jewell I had to go in deep into my database I was like Richard Je I never je I never forget a fat man Kevin would you do a million dollars but a random kid claims you are their parent and violently cries when you try to deny it anytime you see a child yeah I'm fine with that really that's a bad one I don't deal with that many kids just think about how many kids you see ceremon we're getting smoothies these children there's so many children they're all screaming that you are their father that's **** funny you Kevin wouldn't care he would post a Snapchat video every time like one of you kids Snapchat video look at him look at him crying **** a million dollars but there's a 10% chance the water in your next shower will be diarrhea instead when someone corrects you again I turn on the water and I look I do that now a million dollars but",
            "start": 944.8
        },
        {
            "text": "a Million Dollars But there's a 10% chance the water in your next shower will be diarrhea instead when someone corrects you again I turn on the water and I look I do that now a Million Dollars But everyone on Earth gets superpowers except you yeah **** that **** all right that's the one who said this one Damn Scarpino you smart me the diarrhea one was mine you outsmarted me absolutely one point to Scar give keep him aside there so I I don't like the way is this the way they read them on the show no the show is just you pitching your thing to it I'm reading them like Cards Against Humanity there's a dot dot dot I'm feeling am I doing it right dot dot dot so I'm filling in what the yellow card is and then reading the rest I don't like it cards against human usually just that blank because they make perfect sense if you read them in sequential order like you get a Million Dollars But anytime you see a child oh okay I see I'll read them that way the next time that makes sense you're",
            "start": 989.68
        },
        {
            "text": "They make perfect sense if you read them in sequential order like you get a million dollars but anytime you see a child, oh okay, I see, I'll read them that way the next time, that makes sense. You're right, she's bothering me a million dollars but when someone corrects you, okay cool, I was doing it I'm trained for the Cards Against Humanity way where there's a blank line answer is I'm sure fine instructions whoa you're right it reads fine Jesus so D we need we need for Nick. Nick Greg thank you come on Nick Jesus Christ use your hands what's wrong with your hands what's wrong with yours big deal weed hands thank you d weed hands all right so now my you wait no Nick you're the judge now so you're not playing anything we're making scenarios for Nick now Nick F time while we look but then so is Kevin just not playing this type correct yeah yeah okay I can pick one for Nick come over here quickly and do do these I mean Kev this is going to be a long topic already we don't what then we should have.",
            "start": 1033.32
        },
        {
            "text": "just not playing this type correct yeah yeah okay I can pick one for Nick come over here quickly and do do these I mean Kevin this is going to be a long topic already we don't know what then we should have Kevin judge oh my God we can have Kevin judge oh my God whoa still on whoops we're in the Marching Man ding ding ding there we go oh boy I'll tell you this game is fun perplexing all right come on all right you're the judge now so you get to flip him no no great you should still flip them the camera's above you okay did the camera move I don't remember putting a motorized mechanism on the camera all right so Nick you're judging you ready go for it ready A Million Dollars But when you walk up a staircase you have to tell a mother that her baby is ugly oh okay okay I would do that for free A Million Dollars But when you climax yeah you must try to convince someone that you were in the Twin Towers on 9/11 wow that's a that's a rough one that's a hard one A Million Dollars But when",
            "start": 1077.72
        },
        {
            "text": "a million dollars but when you climax, yeah, you must try to convince someone that you were in the Twin Towers on 9/11. Wow, that's a tough one. That's a hard one. A million dollars but when you lose a sock, you must roam the streets doing out vigilante justice. Oh, that would just be a good stress relief. Uh, I'm going to go with the middle one here, the 9/11 one. Yeah, that's million dollars but when you climax, you must try to convince someone because it only happens arguably once a week, but that would still be 52 times a year that I have to tell someone I'm in... oh, oh, I forgot. I'm sorry. It's not sex. Yeah, that'd be twice a day there you go at least two times a day I have to do that. That would just be putting him out. I would get nothing done. Sure, nothing done. I would be spending at least easy to find people to convince yeah that would be the worst but it would be I would just default to Colin over and over again he like Nick for love of God I know you weren't there in New York",
            "start": 1144.28
        },
        {
            "text": "Easy to find people to convince yeah that would be the worst but it would be I would just default to Colin over and over again he's like Nick for love of God I know you weren't there living in New York been in the Twin Towers so one day he's almost got it that's me so I get the point you get the point but yeah the mother and the baby thing big deal I don't care yeah I don't pass that many mothers in the hallway you just call Eric Hart every time you put on your wife yeah she's got a baby right you've got one of those ugly babies all my friends have babies now and then told you would You'd go do vigilante justice on your I would do that just because it's a good stress that was my I just thought that was funny good I like it a lot all right now I am the judge now you are the judge now you are the judge now I've got to pass Nick one wasn't I I mean I have to rebuild my deck no matter what so just did it to stay relevant here wait am I I thought we only supposed to carry five at",
            "start": 1192.24
        },
        {
            "text": "you are the judge now i got to pass nicki nick one wasn't i i mean i have to rebuild my deck no matter what so just did it to stay relevant here wait am i i thought we only supposed to carry five at a time four i already have you did it last round oh right that confusing that could have just been still i don't need any more c extra card stop handing me cards yeah i don't know what all right i'm now the judge so play as you see fit i'm going to shut my ass see what put where you mixing them up yep good okay all right a million dollars but whenever someone greets you the nazis burn down your house god that is great a million dollar but every time you see someone naked the building you're in catches on fire that would suck there's a trend here a million dollars but when you hear a dog bark flying monkeys appear and beat the **** out of you ho **** **** we got ourselves a so choice up here none of these are you guys stepped it up a little i mean you got portillo",
            "start": 1225.2
        },
        {
            "text": "hear a dog bark flying monkeys appear and beat the **** out of you ho **** **** we got ourselves a so Choice up here none of these are you guys stepped it up a little I mean you got Portillo that's the problem he then it's like try to imagine you're seeing someone naked you're trying to get it on and there's a fire that's not gonna bode well well I mean all right the middle one's no one's ever gonna see you naked so the million one the middle one you can probably just discard with time every time I see someone naked I'm peeping Tom on all over the place you just cover your eyes and see I immediately I immediately thought you were to have like I immediately jump to a romantic moment so you're just going to see someone naked see it all the time every day it's we are we do live in San Francisco there a lot of naked old that's true guess you can't avoid that but in that if I'm seeing I'm outside I'm not in a building that's that's the way around it right the building I'm in catches",
            "start": 1299.08
        },
        {
            "text": "Greg Miller there, a lot of naked old men. That's true, guess you can't avoid that. But in that if I'm seeing I'm outside, I'm not in a building, that's the way around it right? The building I'm in catches on fire, if it's sexy times, I just go have sex in places I don't like. I don't, I don't think that that's going to you know be an easy conversation to have, be like hey honey, the first time I burn down someone else's house, it's a pretty easy conversation. Let's go hey we've fallen in love and this is the rest of our lives and let's go burn down a Subway. I do like I like where you think I like where you think I don't know Jesus but then the first one I mean the Illinois Nazis are specific, I hate Illinois Nazis, but how often does someone greet you well multiple times here I me figure it out people would figure out every time he goes to a meet and greet oh **** **** and that's your thing, that is your you can never go to another meet and greet because your house be although yeah no that would suck.",
            "start": 1338.16
        },
        {
            "text": "out every time he goes to a meet and greet oh **** **** and that's your thing that is your you can never go to another meet and greet because your house be although yeah no that would suck you should constantly be rebuilding your house and constantly I me think about people in the streets hello yeah how you doing Joe and our neighborhood happens all the time I walk in Easy Money you're telling me Sam's not gonna say hi to me yeah **** you're right you're right but my dog barks all the time I know that's but you could they beat thetically could theoretically crush his little voice box if you wanted to or get him one of those little cers that like when he barks that's I mean you you've turned me around on it that's right not the crushing the voice box but you're right I or you can have it you can have it taken out yeah you can they can cut his vocal cords hor yeah but how often do you hear **** you hearg all the time think besides your guys's house can't do it it's not really",
            "start": 1378.76
        },
        {
            "text": "it you can have it taken out yeah you can they can cut his vocal cords hor yeah but how often do you hear **** you hearg all the time think besides your guys's house can't do it it's not really dogs barking around me in the streets you hear I don't hear in the streets you don't live in the streets like I do stre but there also monkeys like how much damage could flying monkeys did you ever listen to that 911 call that one monkey eating the girl's face yeah no thank you I mean they're not killing me they're beating me real bad yeah they're just beating the **** out of you I'll come back around I got it I this is the one I wouldn't do I feel like you would let your house get burned down by Nazis every time anyone said hello to I'm going to get out I'm not going to see people I'm not going to see people is going to be the thing I will be walking around in some kind of Pope mobile that keeps people from greeting you think that I will have a security detail that surrounds it's less",
            "start": 1420.48
        },
        {
            "text": "going to see people is going to be the thing I will be walking around in some kind of Pope mobile that keeps people from greeting you think that I will have a security detail that surrounds it's less likely that people are going to say hello to you on a daily basis than you hearing a dog bark yeah because again it's not I mean like you guys are my friends you wouldn't do it you don't want Nazis involved in your life trust me all right I've watched Orange is the New Black you don't want them involved in your life and so then it just becomes of how do I spend the million dollars and this is where the show comes in where they do all the little Shenanigans if I have a security detail with the circle around me explaining what's like keeping people away from me like the President how many times does Barack Obama get greeted every day not that many there's a lot of steps to get to Barack Obama I'm going that every time he walks anywhere he's the President of the United States but I have",
            "start": 1462.12
        },
        {
            "text": "does Barack Obama get greeted every day not that many there's a lot of steps to get to Barack Obama I'm going that every time he walks anywhere he's the President of the United States but I have a million dollars now that I can invest in Chick-fil-A and make the money work for me yeah I'm I'm sticking I'm taking the dog one got it damn it you know my greatest fears are Porta Potties I know that's what I was thinking the worst thing of my life just happened Pepsi liked my tweet who here it comes about no taxation might be the first person recorded history to ask can I get a Pepsi they're stoked about that of course they like your tweet no one's tweeting about Pepsi it's probably the first tweet that's come through the Pepsi Twitter account I wonder how many people buy Coke compared to Pepsi I mean probably a I bet most people just don't give a **** 10 I I bet people just buy whichever is cheaper in this case so we have an extra one I need one yeah I need a",
            "start": 1496.8
        },
        {
            "text": "buy Coke compared to Pepsi, I mean probably a I bet most people just don't give a ****. I bet people just buy whichever is cheaper. In this case, so we have an extra one, I need one, yeah, I need a black card as well, please wait. So these are extra, he's the judge, no, but I still need to recoup, he still needs to recoup, I need a black card, here you go, thank you, these are extra, Tim, if you want to reuse them later because you gave us okay, pow, all right, I'll shut my ass, I'm I'm praying as well. So we should just play to two or we still trying to go to five, doesn't matter whatever you want, oh you're not done, I feel like how long we been going Kev 26 minutes, two, two, all right, first to two, okay thanks, K, you can open your eyes, C Mor already, I'm going to start you off on the flip side here. Right, a million dollars but whenever you're hungry uhoh you forget who you are for 24 hours, holy Jesus, I'll never know like 50 First Dates suck, a million dollars but every time you hear the national anthem, oh no",
            "start": 1536.0
        },
        {
            "text": "dollars but whenever you're hungry uh oh you forget who you are for 24 hours holy Jesus I'll never know like Fifty First Dates suck a million dollars but every time you hear the national anthem oh no you become a totally out of control compulsive Gambler that's avoidable a million dollars but you have to become a sex therapist for your parents yikes yikes uh I mean The Gambler one I don't think that's that's fine it's between my parents have been divorced for a long time but that means be a sex therapist for their individual that's true but at the same time yeah you know so that's rough but I feel like this one is just untenable like this isn't I have to pick this one simply as that as not happening simply because that's impossible die yeah yeah you would never know who you were no no so this is the one I choose not to do two points to Nick and we're done and we're done Kevin's in the  one more one round for fun all right is Kevin pooping again enough I don't know what's",
            "start": 1592.92
        },
        {
            "text": "this is the one I choose not to do two points to Nick and we're done and we're done Kevin's in the  ****  **** one more one round for fun all right is Kevin pooping again enough I don't know what's going on is everybody does are you do you have the diarrhea poops no I don't know what's going on I think I'm just eating too much truth be told I already have enough no one's listening do you want another one just take another one so now this is we're playing for you you're playing you're picking second place I guess oh okay I'm not playing second ver same ass the first yatsi I'm G close I'll close my eyes okay I like this one all right all right mix them up mix them up mix them up all right here we go ready yep go for it Million Dollars But whenever you misspell something oh Jesus oh Jesus God this is it I have to take this one your upper lip smells like hot trash oh well that's not too I mean that's not too far from Norm  normally  Million Dollars But every time you brush your",
            "start": 1650.76
        },
        {
            "text": "oh Jesus God this is it I have to take this one your upper lip smells like hot trash oh well that's not too I mean that's not too far from normally million dollars but every time you brush your teeth your mouth disappears for a day okay okay million dollar butt every time you see a red car you have to smell a stranger's ass a tough one that is a tough one this is a Sophie's Choice the toothbrush you can get around you mouthwash then when it gets to the point you have to brush you just make sure you've eaten a bunch that day you got nothing to going to chill out play video games watch movies um hot trash or SMI the hot trash is like it's going to be bad but like I don't think you get to do you get to explain to the stranger what you're about yeah that's the thing for me the hot trash I think that would actually inevitably help me in life cuz I'm such a poor speller right now that's not going help you I'm such a poor speller that it would force me to",
            "start": 1716.44
        },
        {
            "text": "the thing for me the hot trash I think that would actually inevitably help me in life cuz I'm such a poor speller right now that's not going help you I'm such a poor speller that it would force me to be a better spell fix if every single time I misspelled something or there was a a grammar an error in grammar I would adding different things smell like hot TR I mean I would I would use that I would probably use this as a teaching tool this I could get around smelling that's a hard thing too go smelling A stranger's ass I'd love asses I love asses you love a good **** you're always telling me I do love a good **** I'm going to pick I mean how many times do I see a red car every day probably once a day maybe twice a day more than that right you drive I guess I drive I'd have to pick this one yeah that was big Greg Miller that big Greg I didn't have any good yellow cards cuz I had to spell and I was like oh that's Nick for sure oh wow you want to have one off you want just do",
            "start": 1768.4
        },
        {
            "text": "this one yeah that was big Greg Miller that big Greg I didn't have any good yellow cards cuz I had to spell and I was like oh that's Nick for sure oh wow you want to have one off you want just do a one-on-one yeah but judge by committee yeah there's three of them they'll pick okay okay you guys I like this I like this this is f you want new B give me everything we're we're starting from scr oh okay I had some really good ones well you're **** now well I'm an **** whoa bye call here you go I'm done good show everybody all better this is killing your your OCD isn't it you can't do it go we go some of them are upside down too Tim talk a little bit terrible I'm very excited about this I want to see what y'all **** come up with I expect nothing but greatness I'm now awaiting it I like this game there's different ways to wait to play too so we were playing by the million dollars but basic setups but there's also house rules one's called Cash amidst Insanity ones you bet your ass",
            "start": 1808.64
        },
        {
            "text": "game there's different ways to wait to play too so we were playing by the million dollars but basic setups but there's also house rules one's called Cash Amidst Insanity ones you bet your ass like they have different variations and stuff so you don't need to go as long or you can play a bit more rapid fire and you can play smaller groups a one of your quote col knows what I'm talking about col you remember the Wonder years yeah Kevin Arnold how how you feel feeling nick uh hold on got some gems in there yeah all right all right mixing them up all right don't look Tim you're you're one of the judges you were looking right at him yeah I the judge all right you guys got to vote now you ready Kevin you ready I'm judging two yeah it's you three you got to vote a million dollars but whenever you use the word yes you ejaculate cheese doodle dust ah but does it feel good and yeah you're ejaculation maybe on the way out yeah it would be rough it would be like scratching you're real scratchy",
            "start": 1860.12
        },
        {
            "text": "you use the word yes you ejaculate cheese doodle dust ah but does it feel good and yeah you're ejaculation maybe on the way out yeah it would be rough it would be like scratching your real scratchy Dusty we'll say it's a fine powder cuz cheese doodle not that bad you could also taste it look off how is it not that bad am I thinking I'm thinking like Cheetos right that Cheetos Cheetos yeah that Cheeto dust it's a fine powder it's like it's like sand think about all the sand you don't like that it's that like hot Cheetos maybe it is maybe it's it's various you think about all the Sandy on your e Jesus Christ I put I packed that in there I know how you guys like that Star Wars movie you're out there you're out there humping that thing like that **** thing chasing the millennium it gets everywhere million dollars but whenever you watch a video you get pregnant oh oh **** no Junior straight up Junior scenario is what we got going on here that to me that's a straight up no on that",
            "start": 1909.72
        },
        {
            "text": "everywhere Million Dollars But whenever you watch a video you get pregnant oh oh **** no Junior straight up Junior scenario is what we got going on here that to me that's a straight up no on that one I would not do that not physically possible for you to get pregnant you're a man it happened on Arnold Schwarzenegger and the Terminator (Junior) that's it doesn't say unless you're a man unless you're a woman it's true it's saying you get pregnant period it's true he has to have a C-section every time not down that's I mean the ejaculation I'm kind of enticed by pregnant the pregnancy you could just keep a standing order of morning after pill and just keep taking that I don't think that's how that's deliver it to you in bulk from Amazon probably not also that doesn't work for men neither does pregnancy but world thank you for that insight though there does pregnancy uh I will go I would rather not do the pregnant one assuming that a man could get pregnant I would want to do that one okay so you're voting this",
            "start": 1957.08
        },
        {
            "text": "you for that insight though there does pregnancy uh I will go I would rather not do the pregnant one assuming that a man could get pregnant I would want to do that one okay so you're voting this yep Tim pregnant yeah Kevin yeah I don't want that pregnant Greg Miller is the winner goddamn Greg Miller is the million made the monster won you've made another monster out of him yet again can I have your cards yeah Nick I haven't won anything in quite some time so it feels good to be back on track you're back on track you know it's more Awards Nick yes what's your topic my topic comes from Patreon Back on episode 107 The Back to the Future documentary was discussed who submitted this this is submitted by Christopher Ball thank you Christopher Ball for supporting us over on patreon.com Kinda Funny get your topic right on the show everyone said they would like to revisit this once everyone has watched it I would like to revisit the topic as I am watching the documentary right now what is",
            "start": 2000.12
        },
        {
            "text": "We play Million Dollars But, talk about Back to the Future, discuss shower routines, and bring up friendships we've had to end. (Released to Patreon Supporters 09.16.16)\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\n\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.\n\nfunny get your topic right on the show everyone said they would like to revisit this once everyone has watched it I would like to revisit the topic as I am watching the documentary right now what is everyones thoughts on this classic uh now this was I think it was called back in time was the name of the documentary the one on Netflix I talked about you went and watched it you talked about it we went and watched it nobody else watched it I didn't do the required reading on this this is a topic from a while ago so um cuz I don't know what we're on now but 107 107 right Kevin 14 1456 I I want to get your impressions of it too were opening this up to Back to the Future correct we talk about movie Back to the Future dont worry I didnt think that documentary was that great no thats the thing either I didnt hate it but it was very much one of those documentaries of like hey heres what its like to be a Back to the Future fan like I readed the DeLorean and all this stuff its like all",
            "start": 2040.4
        },
        {
            "text": "either I didn't hate it but it was very much one of those documentaries of like hey here's what it's like to be a Back to the Future fan like I readed the DeLorean and all this stuff it's like all right cool and like I wanted more like on the Back to the Future Blu-rays there's a great behind the scenes documentary with all the Eric Stoltz footage and all this different stuff like that's what I want the kind of back but this is about fans I can't knock it for that I think it it knew what it was about but it was what I wanted yeah again that was that was exactly my perception as well which was it was a similar to uh uh the Ghostbusters documentary that we watched I think you're in I in ghost heads ghost heads yeah which was I went in expecting it to be a pretty like a documentary about Ghostbusters um and it was more about the fans of Ghostbusters which was you know it's still a good documentary but it's just not what I wanted necessarily um but yeah but I guess the broader question then",
            "start": 2081.2
        },
        {
            "text": "Um, and it was more about the fans of Ghostbusters, which was, you know, it's still a good documentary, but it's just not what I wanted necessarily. Um, but yeah, but I guess the broader question then is let's just talk about Back to the Future for a little while. Absolutely, a perfect fantastic movie. Uh-huh. Period. Saying perfect trilogy that's crazy... Talk that I can't believe you just came out of your goddamn mouth. Well, so here, the reason I say that is like, you know, no but yes, I two and three obviously have their faults, but I think in terms of one being just a great movie right, I'm happy that two and three happened and I think that they do tell a cool story and they continued it in a way that was very interesting. Three was radically different than two, two very similar to one but in a cool way, and I added a whole bunch more, it was the same thing but more, and I thought that was awesome. Uh, I don't think all three movies are equal, but I think when you look at them as a whole it's",
            "start": 2113.44
        },
        {
            "text": "Cool way, and I added a whole bunch more. It was the same thing but more, and I thought that was awesome. Uh, I don't think all three movies are equal, but I think when you look at them as a whole, it's it's a really like cool bit of 80s movies, you know. Like I think that it kind of uh set a standard for what trilogies are in that era. Okay, question: did you like Back to the Future? The cartoon was unaware of this, but there was a Back to the Future cartoon. Oh my God, was there a Back to the Future cartoon? You just keep going back and completely **** up the time. No, it was basically Doc Brown, well, it was you know Doc Brown and Clara, and then the two kids were living in modern times with Marty there as their like friend, neighbor, whatever. And then Doc kept making weird inventions, and they do this... There was one where he made him like he made this like prototype thing that would make you a really good baseball player, and Marty put it on, then he got on a team, and then it broke, and he had to deal with that Rookie of the Year.",
            "start": 2158.16
        },
        {
            "text": "like he made this prototype thing that would make you a really good baseball player and Marty put it on then he got on a team and then it broke and he had to deal with that Rookie of the Year syndrome you know happens every year, that love rookie the year, Rookie of the Year great film too, good movie too, but Back to the Future one, great and it's one of those I think underappreciated by me growing up cuz growing up I have no frame of reference for what you know the 50s should be like so I'm watching that movie and I'm like I I was so excited for Back to the Future too cuz the future is so much more exciting to me than the past was in time and so to get there and but then you know grow up rewatch it learn the movie is fantastic, that that screenplay in movies you know taught in classes and stuff in terms of like being perfect in terms of how a movie should be and what it should actually achieve awesome mhm yeah there are only a couple things that stand out that you can even try to",
            "start": 2201.0
        },
        {
            "text": "and stuff in terms of being perfect, how a movie should be and what it should actually achieve. Awesome, mhm, yeah, there are only a couple things that stand out that you can even try to criticize the Back to the Future series on, um, and they're not really even worth talking about but I will talk about them right now. He, what is this relationship Marty has with Doc? Yeah, you don't think about that often, you don't think about that often, but it starts with Marty being in Doc's house in the morning, yeah, he swings by, he wants to use the amplifier, why not swings by just came by his house unannounced. A key is not there, does he have a toothbrush at Doc's house? No, this is some popping off. They share how they learn this - Bob Gale has talked about this and I think Gus in other interviews too when you lay it out like yeah why are they friends what are they doing why would this old man befriend this numbskull high school kid",
            "start": 2234.96
        },
        {
            "text": "interviews too when you lay it out like yeah why are they friends what are they doing why would this old man be what point did did this old man decide to befriend this Doc Brown high school kid yeah who has no discernable talents for science whatsoever you know what I mean and then he goes hey I'm going to make this time machine that I'm sure will work let's call Marty the 16-year-old idiot kid how video yeah I guess so that was a big deal back then it wasn't like it is now where we get all video CU my dad had a video camera that was hit me keep punching me right keep punching me right in the flu shot I don't mind glad you got that flu shot still have the bandaid in your pocket um no it's a different one do you want this one in my pocket too how many shots did you get can I flick it eat it eat it eat it cut my nails today oh I I hate when you have I did too I did mine yesterday we're all syn up yesterday I cut mine yesterday I cut mine this we're on the same cycle um yeah I mean",
            "start": 2275.88
        },
        {
            "text": "eat it eat it eat it cut my nails today oh I I hate when you have I did too I did mine yesterday we're all on the same cycle um yeah I mean that's the thing everyone always talks about how great Back to the Future is and I will admit that it is probably one of the best movies ever made if not one of the best trilogies ever completed but there are some interesting plot holes in it namely also his dad sees an alien standing above his bed and the next day is totally okay with that and he's like I saw Darth Vader great he was in a sci-fi movie wouldn't that freak you the hell out though especially in the 1950s not knowing what the internet is not knowing what any of this stuff is never having seen Star Wars little crazy **** is all I'm saying again it did motivate him it did I guess he was into it it'd be like if somebody came into my room dressed as a superhero right and you know I was like do this I'm like oh man okay would you",
            "start": 2317.48
        },
        {
            "text": "Again, it did it motivated him. It did. I guess he was into it. It'd be like if somebody came into my room dressed as a superhero, right? And you know, I was like, \"Do this.\" I'm like, \"Oh man, okay?\" Would you no, no. But as a kid, you know. See that's the thing is as a kid looking at the trilogies when I first saw the movies all three of them were already out so I watched them pretty much back to back to back at Kevin's house it was fantastic the first one ending and saying \"to be continued\" that was like mind-blowing when that DeLorean car like flew off, get the hell out of here there's more of this like that is. And I at that point I thought every movie was like that you know a little interesting piece of trivia on that one theatrical cut you're in the theater it ends there's no \"to be continued\" it was that it did so well they tacked that on for the VHS and all that stuff. I didn't know that and they totally recast the original girlfriend and brought in Elisabeth Shue. Oh right, they",
            "start": 2360.84
        },
        {
            "text": "was that it did so well they tacked that on for the VHS and all that chest I didn't know that and they totally canned the original uh girlfriend and brought in Elizabeth's shoe oh right they didn't can her she quit decided didn't they also shatton oh I I see what you're saying but before they even released the film then they already had a different Marty too and then oh yeah well the mar yeah they shot like a good portion of that's so incredible yeah so so weird a weird thing must been so expensive Kevin why would you cut to that shot stay in the wide I I think that the the two franchises are very similar when you look at Back to the Future and Ninja Turtles the three movies that came out in the the 9s in the sense that you know the first one is the best then the second one came out and it's the favorite and then the third one came out and people like want to pretend didn't happen but the growing up watching those I I definitely had that feeling of Back to Future to I",
            "start": 2398.0
        },
        {
            "text": "came out and it's the favorite and then the third one came out and people like want to pretend didn't happen but the growing up watching those I I definitely had that feeling of Back to the Future to I would fight to the death is better than one oh yeah and Secret of the Ooze I would fight to the death is better than the first one but then it's like then when you watch later you're like well I'm absolutely wrong the sequence in TMNT2 where they're fighting over the Ooze Pile in that like in that Lobby is awesome I'll give him that the opening they jump off they freeze and say Turt that was I was so excited but no the first one's better would it surprise any of you uh to know that just yesterday I listened to the Go Ninja Go by Vanilla Ice good no no it would not surprise me I went on a weird weird went to a weird place Journey yesterday on the way home and I was like I'm in a great mood I'm goingon to listen to some vanilla ice he's coming back and at one point",
            "start": 2438.64
        },
        {
            "text": "me, I went on a weird trip yesterday on the way home and I was like I'm in a great mood I'm going to listen to some Vanilla Ice - he's coming back. At one point, Vanilla Ice in his seminal song \"Ice Ice Baby\" says \"I'm gonna grab my nine.\" I don't think that really happened; I don't think he ever did grab his gun. I don't think any violence went down that required him to grab a nine, unless it was a nine iron on the links. Do you think we can get Vanilla Ice on this show? I guarantee we could get him on this show. Let's do it. I don't think we could, but he had a rap rock album in the late '90s - yeah, \"Too Cold\" - that he remade \"Ice Baby,\" renamed it to \"I\". May or may not have downloaded a few of those songs off Napster back in the day. Mhm, what blew my mind about Back to the Future, the original growing up... yeah, it's because I was a dumb kid, of course - is that I couldn't wrap my head around how they took these old actors and actresses and made them look",
            "start": 2479.56
        },
        {
            "text": "mind about Back to the Future, the original growing up, yeah, it's cuz I was a dumb kid of course is that I couldn't wrap my head around how they took these old actors and actresses and made them look young because when you're a kid you take everything at face value so I'm watching it and I'm watching the 1985 part with Michael J. Fox and Lorraine and George and they're old people, I'm like oh okay and then when they went back to the back in time and they were young I was like how are they doing this what do they up to never thought they were taking young actors and actresses aging them look old so I I don't want to be the contrarian here but I will uh Back to the Future is a great movie I think apart from the apart from the uh the you know the fact that it's literally impossible to go back in time uh and would cause all sorts of problems that aside it's a movie we we can enjoy it right you can go forward in time you can't go back in time the uh the movie's creepy as hell and uh like",
            "start": 2520.16
        },
        {
            "text": "in time uh and would cause all sorts of problems that aside it's a movie we can enjoy it right you can go forward in time you can't go back in time the uh the movie's creepy as hell and uh really creepy one of the creepiest mainstream plots in a movie I can ever like I could possibly like I can't get past that I'm going be honest with you right now if your mom was that hot I can't I can't no I can't I I don't it's so it's too disgusting and unfathomable I want is that him trying to **** his mom it's his mom trying to **** him which is different the plot would have been real really weird to have sex with me all right I I probably would have done it I'm sorry Tim what if Tim's hot mom wanted SE if any of your hot moms when I was like your hot mom yeah it is joke so like that that always really irked me about the story where I'm like this is just the doc's like so the time travel thing I'm like all right fine the doctor's relationship with Marty is like that's weird but",
            "start": 2563.36
        },
        {
            "text": "that always really irked me about the story where I'm like this is just the doc's like so the time travel thing I'm like all right fine the doctor's relationship with Marty is like that's weird but it's fine the the the acting's all awesome there's a great actor in This Michael J. Fox is a **** G you know uh he has a **** G and like that movie is really a great movie but the plot always really annoyed me and I'm like it's kind of similar to Ghostbusters in a way and I hate that like **** on both these movies CU I know Greg loves them I'm not **** them I think they're both great movies where I'm like I don't I I understand why people think they're great I don't understand why people think they're like you know when I think of the 80s I think of like The Breakfast Club I think of sure catty Shack I think of like all these you know back to school and like all these like to me it's more about it's about two things about real comedies which apparently yeah it's about I love D",
            "start": 2609.8
        },
        {
            "text": "of course catty Shakes I think of like all these you know back to school and like all these like to me it's more about it's about two things about real comedies which apparently yeah it's about I love D it's it's the 80s about two things to me with movies and and maybe it's just the way I connected I connected these movies maybe it's because I also have older siblings so I kind of adapted their taste in movies it's like the Brat Pack stuff is the 80s to me I love those movies you know all the way up to like St. Elmo's Fire and stuff like that I think those movies are awesome you know and um so that's one thing and then like real like stupid comedies I think are like you know part of that as well and so I go I go to that and yeah Robby Dangerfield obviously a huge part of that I never like go to these um and I the movies I even love from the 80s like Batman or something like that '89 I love that movie I wouldn't put in the top Pantheon I never really",
            "start": 2647.84
        },
        {
            "text": "of that I never liked going to these um and I love the movies I even loved from the 80s like Batman or something like that '89 I love that movie I wouldn't put in the top Pantheon I never really had this jumbled kind of Pantheon of 80s films because I have such an admiration for Nostalgia from these movies I watched them through a lens of like I was a very young kid and for some, some were not even born yet um and I like that and I don't get nostalgic Vibes off of these other ones like Ghostbusters or Back to the Future the film and so like yeah so like I don't think to me the best 80s movies is is um maybe something like Dead Poets Society or uh like an or or you know Breakfast Club or something like that where I'm like you know so that's kind of more what resonates with me so I'm not saying those movies are bad I'm not saying those movies are anything less than great you know when you're like what's a great movie it's Back to the Future a great movie of course",
            "start": 2688.6
        },
        {
            "text": "saying those movies are bad I'm not saying those movies are anything less than great you know when you when you're like what's a great M it's Back to the Future, a great movie of course an absolutely great movie but the plot bothered me and I don't really consider it in that in that particular bit I think I do think a lot of that has to do with the way I look at '80s movies you know which is from a much more like very specific nostalgic lens you know so like I look at The Breakfast Club's like School scenario like realistic scenario is like way cooler and way more immersive than John Hughes' movie right when that was I mean it's a lot of people argue that it's Timeless and I will be that on in that camp as well that's an evergreen movie but predominantly it was about John Hughes making a commentary about what it was to be a teen in that era of the 80s very reflective so there's there's a lot of nostalgia baked into that right is that it was it was a sign of its time like it was that movie has",
            "start": 2731.28
        },
        {
            "text": "about what it was to be a teen in that era of the 80s, very reflective, so there's a lot of nostalgia baked into that. Right, is that it was it was a sign of its time? Like, it was that movie has been remade multiple times, but you have to really rely heavily on the circumstances of... well, I guess not necessarily for The Breakfast Club. I guess that is kind of evergreen. I take that back; Ferris Bueller is a little bit more of the times, but for The Breakfast Club, I don't know, maybe you both those movies I think are there you're because as a kid you can... you can uh, but take drop in either of those, you can, but but I'm going to take back what I just said because I I do feel like I feel like if you watch The Breakfast Club right now and and you took out their phones, you that's a good point actually. But if you if you took out the costumes and say they weren't allowed to be on their phone, that would be just as relevant now; everything they say would be just as",
            "start": 2764.96
        },
        {
            "text": "that's a good point actually but if you if you took out the costumes and say they weren't allowed to be on their phone that would be a just just as relevant now everything they say would be just as relevant now was because it was about angst and it was about in ex feeling accepted things like that so um for me Back to the Future holds a special place though because of the sheer creativity that went into that film and that's one of those things where there are very few films today and uh that I watch and think I want more of that right and that's probably a sign just that that there's just so much out there that you're never really bored but when I was a kid it was like you'd see that and then there would be this long ocean of nothing in between like you know a Back to the Future and another movie that was of that caliber and so to me like I always that's one of those where you you watched it at the end you're like God I just wish there was like one more minute of this right or",
            "start": 2804.68
        },
        {
            "text": "another movie that was of that caliber and so to me like I always thought that's one of those where you watch it at the end you're like God I just wish there was like one more minute of this right or or or we could watch another one and then it's slow you want to get to Back to the Future 2 and then you're like God damn it my only other recourse now is Back to the Future 3 which we all can agree is not the best in the trilogy um but I'm going to watch it anyway because you know it's more of these characters that I love it's more of this time traveling gimmick I mean I think with movies something that I've always found uh in the films that I put in the upper tier is that they follow rules really well they set up rules to what their world is and they they stick to it and I think that you know Back to the Future kind of did that it made us really think about time travel like it was definitely the thing that got me thinking about if we were to go back in time how would",
            "start": 2845.68
        },
        {
            "text": "I think that you know Back to the Future kind of did that it made us really think about time travel like it was definitely the thing that got me thinking about if we were to go back in time how would that affect things and like that first time I had that conversation in my head uh it reminds me of Inception a lot where it's like that movie gave us something to think about and think about the rules that that movie has to fit in it's like we want more now Inception I think it's a good thing we don't get more but with Back to the Future I think that that movie ending and then yeah going going to the Future in the second one going to the past in the third one that all made sense because that it wasn't serious you know what I mean it is still very comedic and like kind of when you moved to two and you changed the tone of the movie and you changed exactly you you amped everything up in a way right who the characters were put made them over the top the same thing we talk about in Negative I",
            "start": 2880.92
        },
        {
            "text": "and you changed the tone of the movie and you changed exactly what you amplified everything up in a way, right? who were the characters made them over the top, same thing we talk about in negative I think with like an Eric Cartman or Homer Simpson that got dumber and dumber, Doc got crazier and crazier, and Marty got more and more lost in his whole \"Back to the Future\" thing and all that jazz but as you amp that up you still keep the touchstones of the universe right like when we did I was talking about that when I knew how great Lego Dimensions was right when they came through into the Twitch stream with us and they debuted the Back to the Future content and you kind of forget about like how much you know Hill Valley and stuff so to be in 85 Hill Valley and go to the Future Hill Valley and go to the Past Hill Valley and be in like these three scenarios where it's always based like you're talking about like storytelling beats right and how they drive stuff home like that the clock tower",
            "start": 2918.92
        },
        {
            "text": "go to the Past Hill Valley and be in like these three scenarios where it's always based like you're talking about like storytelling beats right and how they drive stuff home like that the clock tower being there and Doc being there and all these like you know exactly and the manure and all these different like gags that are in a way lazy that it's always kind of the same movie but also endearing in the same way of like this and Back to the Future the original right they do that in such a condensed thing where you know you're talking about it being a Nostalgia part to then this Fantastical part of like that whole first part of that movie of Marty and Jennifer and she's going to babysit and she writes on the flyer like her number the number for the place she'll be babysitting at you and I love you and like that's that part where it's still grounded in reality where you understand like oh young love being in high school that kind of thing and then toss on the Fantastical Adventure but",
            "start": 2953.48
        },
        {
            "text": "love you and like that's that part where it's still grounded in reality where you understand like oh young love being in high school that kind of thing and then toss on The Fantastical Adventure but then even that that like that's where like you know like I feel like movies nowadays right I forget what we're talking if it was Independence Day or if it was Suicide Squad when I leaned over I'm like that's gonna be important later on they treat the audience like a bunch of idiots right and just pound them over the head with the information of like this is what you'll need to save the world eventually this is what it's going to be all about whereas Back to the Future is a movie I feel like where she writes it down and you crumple up the flyer and put it in your pocket and and watching Back to the Future for the first time not now with everything we know you don't stop to think of like oh that lightning strike on the clock tower is going to be critical to this entire story yeah it was a very",
            "start": 2989.76
        },
        {
            "text": "Back to the Future for the first time, not now with everything we know, you don't stop to think of like oh that lightning strike on the clock tower is going to be critical to this entire story. Yeah, it was a very cleverly set up device to help move that story along, which was and very well done and very subtle. I mean by the time they got to two, they it was it was you could you could tell that they they made a very conscious effort to be like yo we're we're going to do these callbacks, it's going to be really really fun because it is going to have that sort of that sort of playful nature to it. Like we know this is a little bit more on the nose, we've already used the clock tower but we've seen it now and let's use it in a different way and I think they did that really well. Um also the second one had hover boards of course which was when I a kid unless you got power I was terrified of hover boards cuz everyone wanted one and I didn't like physical exertion and I thought to myself if",
            "start": 3020.84
        },
        {
            "text": "one had hoverboards of course which was when I was a kid unless you got power I was terrified of hoverboards cuz everyone wanted one and I didn't like physical exertion and I thought to myself if everyone gets a hoverboard I'll have to get a hoverboard and then I'll have to do something and I don't want to have to do anything rollerbladed for approximately two months threw him out after you could have just watched Jaws 3D and been fine that's true or Rocky uh whatever was well that was so weird when the Cubs almost won the World Series he that that's what happened back in the future and then that almost happened last year speaking of that in Back to the Future in 1985 the Olympics are in Los Angeles and now that's actually happening oh that's crazy here's the big question for you Tim yeah I'm going to you because you're a red-blooded male you're wearing your Bandit shirt MH you got the lumberjack beard mhm hypothetically you break up a fight you open a door you're naked",
            "start": 3056.68
        },
        {
            "text": "I'm going to ask you because you're a red-blooded male, you're wearing your Back to the Future shirt. MH, you got the lumberjack beard. Mhm, hypothetically, you break up a... you open a door, you're in Narnia, your next what you already do that? The Narnia door, no, you open up a car door. Car door, find who will be your future wife. Okay, being sexually assaulted by someone, God, you knock that guy the **** out. You think you think 30 years later you're going to let that guy... you're going to want to be around that guy? Let him work on your car. No, yeah, no. I'm saying there's some there are some very very big problems, yeah, with this film. Big problem, but it's a movie and that, but like that's the thing is you're right it was a different time. I understand too that's it's a funny joke. Let's not let's not lament on the fact that Doc Brown was working for terrorists at the very beginning of... back then we didn't think they could do anything. Yeah, I mean back then terrorists were just you know a was just a buzz word.",
            "start": 3097.28
        },
        {
            "text": "that Doc uh was working for terrorists at the very beginning of Back to the Future. We didn't think they could do anything, yeah. I mean back then, terrorists were just a buzzword, yeah. He stole plutonium; he was supposed to make them a bomb, a nuclear bomb, and he just thought it was okay to be like that for weapon-grade plutonium. Well, that's the other thing too: I love watching how long you've watched Back to the Future, but I love like the Libyans in that movie, yeah. They slam into like a photo booth, like those things that used to develop photos; they're not dead, no, they're coming back. You jump into the future and leave them in the photo booth, and Marty comes back, and Doc opens the vest, and everything, yeah. I'm like, Libyans are getting out of that booth any second now, pissed off with their AK-47s, still. And if not, they're probably going to try for you again. Now, I granted you've mastered time, Space-Time travel at this point, but if you ****",
            "start": 3144.28
        },
        {
            "text": "of that booth any second now pissed off with their AK still and if not they're probably going to try for you again now I granted you've mastered time, SpaceTime travel at this point but if you **** up once those Libyans are not going to forget they're not going to forget. Libyan terrorists have only gotten stronger in the last four years, they're the worst, they're the worst Colin yes what's your topic specifically two questions how often and then what is your ritual now I asked the how often because I was I I stumbled across some weeks ago what I would term a disturbing topic on our Facebook group look at me Kevin well I didn't look at you no Tim did Tim did Tim looked at Kevin uh no no in this place and uh people were like how often do you shower and I without even looking I just wrote I'm like two times a day like two times a day right like get all the back at least once a day but often two times a day not always often and then I was disturbed because in this in this thing",
            "start": 3181.6
        },
        {
            "text": "wrote I'm like two times a day, like get all clean at least once a day, but often two times a day not always. Often, then I was disturbed because in this thing there was a dis really strange amount of people saying once every other day and I'm like that's disgusting now stink maybe not in 1850 maybe not even in 1930 would have been disgusting but this is 2016 yeah 2016. Now you know teach your own if you don't want to shower, you know sometimes people just lounge around over the weekend they don't shower from Friday night to Sunday whatever it's like that's fine but like people were making arguments being like because the argument was like my child doesn't want to shower every day or bathe every day or something like who cares what your child wants you're the parent so like they were saying when you're younger I guess you don't have to and and I don't remember, I feel like I bathed every day when I was a kid",
            "start": 3233.88
        },
        {
            "text": "**** cares what your child wants you're the parent so like they were saying when you're younger I guess you don't have to and and I don't remember I I feel like I bathed every day when I was a kid but um people were making an argument for adults and I'm like if you get up on a Monday morning and shower go to work come home go to work on Tuesday come home and then shower on Wednesday that's weird I agree and I want to see if you guys agree with that premise sorry but then I also want to see if what what your particular rituals are because shower rituals are a personal kind of thing but I also feel like I don't know about you guys but I do the same exact thing in the shower at sequence me too every time I'm in it oh every time yeah so I'm curious this day first Yeah Tim how often are you showering how often once a day for sure I would prefer twice a day but I don't got time for that I used to why were you grinning and looking at Kevin how often is he shower so Kevin Kevin this has\n\nCorrected changes:\n\n- \"bathed\" (correct spelling)\n- \"Kevin\" (proper noun, capitalized)\n- No other corrections needed.",
            "start": 3280.44
        },
        {
            "text": "showering how often once a day for sure I would prefer twice a day but I don't got time for that I used to why were you grinning and looking at Greg how often is he showers so Greg this has been an issue in me and Greg's life since the day I was a little kid sure but now it's worse I mean no one holds him accountable he would just not shower just straight up like you know what I like B until someone forces me to shower I'm not doing it and I'm like I love it I love showering fun it's great it's all warm it's amazing but yeah Greg not down with the showering and then it wasn't until Paula God bless her heart forced him to be on some form of routine a lie when did you when did you get on when did you get on a schedule for showering I mean to be real I don't think he's on a schedule now I've seen grown woman Paula talk to grown man Greg and say you need to shower she says that all the time it's upsetting",
            "start": 3320.76
        },
        {
            "text": "I don't think he's on a schedule now, I've seen Grown Woman Paula talk to grown man Kevin and say \"you need to shower\", she says that all the time it's upsetting. To be fair, I am covered in sweat a lot of the time, that's why you should shower. What point are you making? Cuz sweat after a couple days makes stinky no no but I shower every morning and it sucks, I hate it. Why ha it how do you hate showering? You swim like a dolphin, like a dolphin in water. I got to get up, I got to go into the shower... towel. You don't enjoy the hot water just weird. Shower in hot water he doesn't do well with hot water. Oh my god, does well with hot water, hot tubs he likes gets all weird it gets me really like, like I start sweating. It overheats you don't turn up that hot, that I mean I got to keep the water hot but not hot. But you shower once a day yeah I shower once a day every morning and Nick you shower once a day yeah at least once a day yeah because I",
            "start": 3364.28
        },
        {
            "text": "that hot that I mean I I got to keep the water hot but not hot but you shower once a day yeah I shower once a day every morning and Nick you shower once a day yeah at least once a day yeah because I I suffer from dry skin I I got to give a real talk shout out though like I shower once a day I used to shower twice a day but like they will be days like shout out to those like do **** and holy crap if I'm busy doing something if I'm editing videos and stuff all night I am not showering and that's a problem when you put this much hair product it's the thing about it is and I'm know I'm not trying to be too judgy even though I am is that you know there there are days like that right but my day does not begin in a real way until I'm in a shower shower like but other so what I'm saying is that's a lost day what's weird about that day is gone is the fact that you'll shower at like 11:30 sometimes and then shower again in the morning that's the one that will get me yeah yeah oh yeah shower",
            "start": 3413.84
        },
        {
            "text": "a lost day what's weird about that day is gone is the fact that you'll shower at like 11:30 sometimes and then shower again in the morning that's the one that will get me yeah yeah oh yeah shower at night because I like cuz sometimes I can't get into my bed if like all right so I always shower in the morning always and and then at night if I feel like either I'm bored or I just feel like shower cuz it's **** fun or I like was sweaty or I did something that day then I shower again cuz I can't get into my bed knowing that there's some sort of filth on me sure like Clementine method exactly it's just it's just I gave up on that a long time ago it's just common sense my bed's just nasty so cool with by the way my mom not even my mom actually she kind of left me alone but everyone else around me used to give me a lot of **** for how often and how long I shower and everyone always makes like masturbation jokes I have never touched myself in the shower touched yourself I mean I've never I have never",
            "start": 3455.76
        },
        {
            "text": "give me a lot of **** for how often and how long I shower and everyone always makes like masturbation jokes I have never touched myself in the shower touched yourself I mean I've never I have never ejaculated in the shower unless someone else was in there with me sure you know I mean that's that's I did a lot of exploration is no I've never been a shower masturbator either oh I mean I don't that's not where I Look to masturbate but when you're a young man exploring his body for the first time that's the one of the only times you can get you feel like you get away with the exploratory nature of uh of Discovery that's it each each and every I I think it's a write a passage for most for most kids to uh to understand and the uh the cause and effect of the shampoo Master this is where it's like I felt like a for some of this was Deja Vu this is just the 2016 shower conversation some of this has been talked about we talked no we've talked about masturbating in the shower in shampoo I",
            "start": 3496.92
        },
        {
            "text": "like I felt like a for some of this was Deja Vu this is just the 2016 shower conversation some of this has been talked about we talked no we've talked about masturbating in the shower in shampoo I brought about Colin Moriarty yeah and I you when you said I have a thing I do being in the shower was the top then you said I have a thing to do that I've heard it granted you and I spend 20 hours a day together so this has been split into two topics one was peeing the shower and one was Nick's uh hair ritual so that's don't get me wrong I think we're treading new ground I have a whole new shower regimen I've been using lately I'm I can't change my shower regimen in fact if I ever if I do something out of order I have to start again now because that's just a little bit of my my OCD at work but what I do is I get in the shower and I brush my teeth that's weird love brushing my teeth in the shower I'm with you I'm not against you let the water soak over you and you just spend a few minutes",
            "start": 3540.76
        },
        {
            "text": "do is I get in the shower and I brush my teeth that's weird, love brushing my teeth in the shower, I'm with you. I'm not against you, let the water soak over you and you just spend a few minutes and you brush your teeth in the shower, I love it. Are you talking into a microphone or are you just talking? We already know you're against anything that has to do with a shower - is there soap and water involved? No thank you, I'm Pig Pen 2016. Do you have to trick him into the shower, spray all over you're going to get on this like \"oh, get that\" and then it closes in on him and starts showering. So I have brushes, I have two different rituals - the primary shower is the morning shower, the evening shower is different. All right, so the primary shower: get in, brush your teeth, and then I take the shower, you know, poof. And I like using bar soap; love bar soap, specifically Dove for Men or Irish Spring, Irish Spring, and they have the Irish Spring from... and I you know I get it all foam and then I",
            "start": 3580.96
        },
        {
            "text": "know poof and I I like using bar soap love bar soap, specifically uh Dove for men or Irish Spring, Irish Spring, and they have the Irish Spring from uh and I you know I get it all foam and then I start with my neck, I avoid my face and my hair, sorry, the neck work my way down the body all the way down exactly and then I wash my hair yeah and then I take the bar of soap again and this time I get spots that I feel like I didn't get adequately with uh with the well we're going to get to that cuz I cuz I have a thing that I've added on in adendum recently okay uh that I was comfortable adding on to the process I to say you did change see we I clean like my behind, my ears like my ears I get a little finger in the belly button Kevin yeah uh and then I wash like my face and then I wash all of that off now the addendum was the secondary shower if I feel like I didn't do that much but I feel like I need the shower I get in the shower I brush my teeth right and then I just take a bar of",
            "start": 3627.0
        },
        {
            "text": "of that off now the addendum was the secondary shower if I feel like I didn't do that much but I feel like I need the shower I get in the shower I brush my teeth right and then I just take a bar of soap and I just wash my armpits and my crotch in my ass and that's it because of the dryness of doing it twice in a day so you don't want to touch the face again you don't want to maybe go on the arms and all that kind of stuff but then I took that and then I added it to the primary shower after washing my face I let everything drip off or whatever and then I'm like I'm not clean enough in these in these primary stink areas this is the primary Stinky Pinky so then I have to go back with the bar soap do all that then I wash all that off then I get out of there so that is the process by which the shower is taken once a day the beginning and the end and that's why I feel like the secondary shower even like the 11:30 hour and and the rare tertiary shower by",
            "start": 3675.96
        },
        {
            "text": "so that is the process by which the shower is taken once a day, the beginning and the end, and that's why I feel like the secondary shower, even like the 11:30 hour, and and the rare tertiary shower by the way, which happens once the Blue Moon, I feel like that doesn't really count in that regard because I'm basically just getting myself wet exactly. I got to get wet, wet, and I got to just let it all kind of mhm sure, sure, sure you know so that's the process, so yeah what I've I mean my thing has been standard for a while, get in there, get wet, shampoo right away, conditioner twice a week. I used to do it every day Fran Mirabella nearly had a heart attack when I told him that he said no, you do it, you do it every other day tox twice a week and I'm like well I'll take your ha conditioner or shampoo conditioner shampoo every day conditioner twice a week whenever you when I feel like it let it let it happen right then it's the bar soap Dove unscented all over all over all over all over all over to do",
            "start": 3716.32
        },
        {
            "text": "shampoo every day conditioner twice a week whenever you when I feel like it let it let it happen right then it's the bar soap Dove unscented all over all over all over all over all over to do this thing right put it down why unscented I didn't like the scented ones for a while I want and here stick with me because we're about to get to a little bit of that all right down then the new thing I've added is the loofa stick now I had the poof on the stick for a long time still have it in there it's just chilling out getting moldy I'm sure but now I got the loofah hey I stole a piece of coral reef and I shoved it on a stick and it's ready to go because for some reason I started getting the back knee and I started getting the little little butt knee too and I was like that's not normal and I've been using a different bar soap so I moved the unscented to see if that was getting me but I still getting it plus the bar soap I know I'm missing key areas and the loofa clear the poof",
            "start": 3760.16
        },
        {
            "text": "I've been using a different bar soap so I moved the unscented to see if that was getting me but I still get it plus the bar soap I know I'm missing key areas and the loofah clear the poof loofah wasn't working do you put the do you put the loofah in your ass sometimes no I'll get to the ass in a second I'll get to the ass in a second then I take down the coral reef one here right I got this Neutrogena body clear stuff put it on there you always rub it you want it to get sudsy it doesn't the soap isn't here to play around it's here to kill the soap then I can do this and do this R then I take I take it like this I palm it from behind obviously the coral part and I go on the cheeks I go on the back of the cheeks here right there right there I feel you I'll tell you what cheeks are cleared up perfect back's better it's getting they're still you know little ones I'm not but I think it's more it's more about the scraping I think you know I mean it feels good too it feels",
            "start": 3801.48
        },
        {
            "text": "Are cleared up perfectly, back's better. It's getting they're still you know little ones. I'm not but I think it's more it's more about the scrubbing. I think you know I mean it feels good too. It feels really good when you turn around and it hits the water hits it. Then I put the loofah back, rinse the loofah, put it back on there. Then back to the bar soap. Then you soap up your hand. Then you get in the shower, you get in there, you clean that bad boy out, wash that hand off. Then you clean the hand again. Then sniff it. Then you wash it off. No, no, no. I look at it. Me, I've got the shower speaker going. That one of the fans from Kinda Funny told me to get. I got the iPad kicking out my Spotify playlist. Yeah, whatever happens happens. There's some there's some Ghostbusters too on there. This Ghostbusters one. But you understand. Yeah, I understand. Uh, yeah. I mean, I once a day usually for me. Uh, sometimes too if I go do a physical activity that I feel like got me too sweaty it 'cause I'm with Colin also I don't",
            "start": 3839.12
        },
        {
            "text": "but you understand yeah I understand uh yeah I mean I I once a day usually for me uh sometimes too if I go do a physical activity that I feel like got me too sweaty it cuz I'm with Colin also I don't like to get in I don't like that feeling of getting in clean sheets and there's a a slight friction that shouldn't be there and you're like that film little sticky I need to get out of this and go get this stickiness done but I don't sweat that much um unless I'm doing hard work like building a studio what up uh you're Mecca um so normally one one day one once's for me in the morning is right now what I don't get are the people that shower at night and then go a full 24 hours after that thinking it's okay because you sweat at night you've already got you got eight hours of bacteria that's accumulating on your skin right then you get up in the morning your hair's all **** up so you got to put more stuff in it and then you go to work and I always notice that people and maybe it's just me",
            "start": 3874.68
        },
        {
            "text": "on your skin right then you get up in the morning your hair's all messed up so you got to put more stuff in it and then you go to work and I always notice that people and maybe it's just me but I don't think so I think it's them there's a there's a funk to that there's a smell of people you can tell didn't shower like if you go for night showers well you know what I mean if you go to the gym in the morning for instance you can always spot the dudes that didn't shower before they go to the gym and I hate that I can't stand people that think it's acceptable to just get up like I'm going to will work out anyway so why don't I go to a yoga class right now I have as an outsider to your gym world that sounds like that would be totally fine that's unacceptable because you've got all that sweat and nastiness on you from the night before and then not that much nastiness then when you go to sweat all of that all that stuff is Amplified and specifically in yoga classes if you go to a yoga class",
            "start": 3923.76
        },
        {
            "text": "Nastiness on you from the night before, and then not that much nastiness. Then when you go to sweat all of that stuff, it's amplified, specifically in yoga classes like if you go to a yoga class and you haven't showered that day, I think you should deserve to get thrown out because you will stink by the end of it, and everyone in a five-person radius of you will hate you. That's just the way it goes. So when you wake up in the morning, shower and get that ham smell off your skin. So Uncle Nick does ham smell? Yeah, cuz like a lot of people, it just smells like ham. People smell like ham; white people smell like ham. First off, ham is delicious. No, not when you're smelling it on an old you. You don't want some downward dog with a side of ham. You know I don't want to stare into a man's face and smell ham. Is what I'm trying to say. You know what I mean? It's my as an American living in this country that invented freedom, I did that. I don't think I should have to be...",
            "start": 3964.24
        },
        {
            "text": "and smell ham is what I'm trying to say, you know what I mean. It's my as an American living in this country that invented freedom; I did that. I don't want I I I don't think I should have to be subjugated and relegated theying their shower rights - that's just the way it goes. All of my friends do that, the night showers, and I've never understood it, and I've always been like I was the outcast, but I'm like weird; I'm not this is do it has a smell to it, and if you sweat when you sleep, that cakes onto your skin, and then it bakes absolutely - your body bakes it, you're getting basted like you smell like a baked ham. It's disgusting, honey, honey, honey, baked or just normal Honey Baked is fine; I hate Honey Baked Ham. I like the ham that's right there; I like the salt on it, like the salt-cured ham. I don't need that honey ****; I'm a ham fan in general. I get the smell of jambone - oh, jambon, Jamel, damn son, yeah, I I same ritual I've always had; I just get in there, um, I'm very",
            "start": 4005.2
        },
        {
            "text": "the salt cured ham I don't need that honey **** I'm a ham fan in general I get the smell um jambone oh jambon Jamel damn son yeah I I same ritual I've always had I just get in there um I'm very particular about the temperature like I like it to be pretty damn hot like if I want it to be so if you turn it just a little bit more it's scalding yeah so it's just like it needs that that perfect level that one spot on your ass like yeah you got to be careful not let it like touch your balls or into it yeah uh I like that and I like the the showerheads to be the ones that just kind of like destroy you like I like that like one scraping off yeah like just pounding against you please give s it that's all that I want is just pounding against me uh cuz like I don't like it when it's just that light little trickle like I feel like it's not getting anything done and I feel like it's just kind of relocating my dirt that's why hotels man I'm like God if they don't have the turning thing I'm",
            "start": 4050.4
        },
        {
            "text": "light little trickle like I feel like it's not getting anything done and I feel like it's just kind of relocating my dirt that's why hotels man I'm like God if they don't have the turning thing I'm **** Dum no I agree with you that I hate the low flow shower heads but I do love those rainfall shower heads like when you get into a nice hotel and they've got the thing over there and it just gives you like all R only it needs to be strong enough that's my thing if it's strong but my problem with that though is maybe I got some sensitive lips it always makes my lips feel weird because when the water's getting on it I'm just like that's that is weird very strange thing you just said I don't like it at all sorry I got to stop and we got to call attention to that the powerful shower head you don't mind hitting your lips but the R cuz it's when it's that little trickle tick trinkling on my lips and I'm not I'm not a fan of it okay it doesn't feel good it I mean it's one of those things",
            "start": 4102.04
        },
        {
            "text": "don't mind hitting your lips but the r cuz it's when it's that little trickle tickling on my lips and I'm not I'm not a fan of it okay it doesn't feel good it I mean it's one of those things that's like uh it's really no it's it's just really it makes me really uh it feels like I'm raw like the only way I can put it is like when you are just going way too hard in intercourse yeah and things are starting to feel real rough down there on your lips and it's a shower that's doing it your lips feel like a dry vagina yeah pretty much pretty no pretty much yeah so it's it's not but no not even not even dry it's just like overused right yeah a tired vagina like a hairy tired vagina yeah so it's pretty bad but then if I can get past that if the you know temperature is right and the the like the strength of it is right then I'm ready to go and I will get in totally get wet get all the nasty stuff out of my hair of which there's a lot then I will take the little like loofah thingy yeah actually",
            "start": 4135.88
        },
        {
            "text": "Strength of it is right, then I'm ready to go, and I will get in totally get wet, get all the nasty stuff out of my hair, of which there's a lot. Then I will take the little Loofah thingy. Yeah, actually first I do a rinse down, rinse out all the problem areas just to like start the process. Then I grab my body wash. I'm not a bar soap guy at all; bar soap kind of creeps me out because it's like just sitting there and just funk on it all the time. So the body wash, I'll hit the little pump, put on my hands, put on the little loofah thing. Loof up the armpits, loof up the... you know, same loof just straight up on it. Well, but I mean I'll loo the cheeks right. Okay, okay, I get in there with the hand; get in there with yeah, you got to get in there with you got to scrape out the peanut butter. Yeah, you gotta get that done. Damn, uh. So after that process is going on, I will move on to... then rinse again and clean up ending with the armpits because I feel like",
            "start": 4182.92
        },
        {
            "text": "you got to scrape out the peanut butter yeah you got get that done damn uh so after that process is going on I will move on to uh I then rinse again and clean ending with the armpits cuz I feel like they're the cleanest bit of all that's going on the dirty Parts yeah so then I'll clean my ears out that's real important um clear the face what's what's cleaning ears like I look like using youring kind no more I'm a qtip guy I like to use the Q-tip oh I I do that as well but not in the shower that's that's post shower yeah that's why I'm saying like my shower I don't I'm not doing much to my ears oh yeah I got to wash teeth got to wash I'm an ear washer I'm behind the ears sure got to wash te then then you brush the teeth oh I I you you shampoo your hair before the uh um before the ear cleaning okay yeah so that's what like what really cleans before I start touching my face so shampoo every 3 days condition um but then brush your teeth yeah I was with you it was VidCon 2012 uh yeah",
            "start": 4226.28
        },
        {
            "text": "okay yeah so that's what really cleans before I start touching my face so shampoo every 3 days condition um but then brush your teeth yeah I was with you it was VidCon 2012 uh yeah then I just let it all wash over me and then I just stand there for as long as humanly possible till it gets weird yeah I love I love I want to be in there until the hot water's gone or until someone's making me leave I have an odd pre-shower thing that I do well I'll start the shower while I'm still sitting on the John having just done whatever business needed to be done uh that day sometimes it's number one sometimes number two sometimes it is jerking it um but I like the sound of the shower it's very relaxing to me and I think it's cuz I was born in January and I feel like it was raining that day when I came into the world I was was like this is the world very relaxing whatever that sound is that that that that that that that that water hitting the the window outside of where I was born",
            "start": 4268.16
        },
        {
            "text": "day when I came into the world, I was like this is the world very relaxing. Whatever that sound is, that water hitting the window outside of where I was born must have just been instilled in me. Um, but I like that; I find it soothing actually. The real reason is because when I was a kid, I used to hate getting up for school, and so my brother and I - I don't think my brother liked getting up very much either - but he always had to get up first because he was the oldest one, and so I would wait till the very last minute. My mom would either yell at him or me to get in, and honestly, it was if he got in first, I would hear the water going, and I would know that I could sleep for another like 15 minutes 'cause my brother took fairly long showers. Um, now that came at a price because then I also liked taking really long showers; I like to just stand there and do nothing and just not be able to answer an email, but then my mom would yell at",
            "start": 4312.32
        },
        {
            "text": "that came, of course, at a price because then I also like taking really long showers I like to just stand there and do nothing and just not be able to answer an email but then my mom would yell at me and be like get out of the shower stop playing with yourself stop playing with little Nicki and get out of the shower you didn't have email when you were hanging out with your mom what when I was 15 yeah totally email it was 1995 it was AOL well.com you had to answer I didn't have any email any email I still don't answer email no we're well aware being your business partners final topic is mine and it comes from patreon.com kind of funny where Aiz gave us money to get his topic read and he says when is it okay to let go of friends or bad breakups between friends so when is it okay to let go of a bad friend I think is basically what he's saying when is it okay to end a friendship this is a very dark question it is",
            "start": 4355.44
        },
        {
            "text": "okay to let go of a bad friend I think is basically what he's saying when is it okay to end a friendship how do you know when it's time to end a friendship this is a very dark question it is you know cuz things can get pretty real with it yeah I I think in my experience you got to really give you don't have to but I think that you should give your best shot more than three strikes like I think it's like you really got to just keep trying and if they're your friend and if they're that close to you they're there for a reason and they've deserved that for whatever it is even if they were just family and given to you like that but you need to keep trying to fix the the issue at hand one day there will be a breaking point and you will clearly know that they're past the point of being helped they don't want to be helped and it is only going to make things worse for you the people you love and them sure that is the point where you can kind of give up on them and let them go I still don't",
            "start": 4400.28
        },
        {
            "text": "they don't want to be helped and it is only going to make things worse for you the people you love and them sure that is the point where you can kind of give up on them and let them go I still don't think you should push them away it's more about just letting them go the thing is like letting everybody letting the drift apart happen right where you're not trying to rein somebody in and saying wait something no no no we used to be closer and we should fix this or you just being like this isn't working out or whatever we're not on the same page because that happened to me in high school with a bunch of kids right where we were we had the same interest the same we were all into the same stuff right and then yeah we hit a and this happened in like u in junior high I guess too with my original core group of friends where they were like this and then they got super into music and I didn't and so like for a while tried to make it work and I was just like all right you know what I'm I'm",
            "start": 4446.36
        },
        {
            "text": "corter group of friends where they were like this and then they got super into music and I didn't and so like for a while tried to make it work and I was just like all right you know what I'm I'm going to just go find other people not not in a bad way not in a **** you this is over kind of way and the same thing with the high school friends where we were going going going and then we were on different tracks right where it's like they were getting interested in different things some of them into bad things or you know smoking or drugs or whatever that I didn't want any part of cool stuff the cool stuff they they were the cool kids I was the guy in The Undertaker tie uh but yeah everybody just separate I wore wrestling ties to high school and Superman ties because they that was the thing when you go to an oppressive Catholic school and they give you no way to express yourself in high school the only thing you can wear to express yourself is ties you would be like Greg Miller and wear",
            "start": 4485.76
        },
        {
            "text": "when you go to an oppressive Catholic school and they give you no way to express yourself in high school the only thing you can wear to express yourself is ties you would be like Greg Miller and wear whatever you want I don't know more ties or some crap I wore a Superman tie or a wrestling tie every day of high school didn't get laid that much believe it or not no no no yeah but we you know people separate and that's the thing and like there are times with like your other friends where like you know for us uh leaving IGN right and like leaving that when we were baked into people and I remember being like this is a family and da da da da and it wouldn't be the same way like when other people left IGN and we never saw them again no my left IG never see most of those people ever again cuz we weren't friends the way I thought we were friends when I was there or just lazily thought we were not that I you know was hung up on it or whatever but that we leave and you grow apart",
            "start": 4515.8
        },
        {
            "text": "cuz we weren't friends the way I thought we were friends when I was there or just lazily thought we were not that I you know was hung up on it or whatever but that we leave and you grow apart and everybody has different interests and it's not as easy to get together and go do things with them yeah it's it's really heartbreaking to think about like I I often you know right now uh I'm at an age where a lot of my friends are getting engaged in the conversation of um Bridal parties and dude parties whatever they're called groomsmen dud dud parties what they call um that's like surrounding me like everywhere I go this conversation's happening and it's like this same conversation dates back forever whether it's your Myspace top eight or your you're this or you're that who's the Inner Circle who's your top 10 who's you this who's you that and whether or not it's ranked just who are the people that are in that and it's kind of a lot to think about um conversation I had with Colin when I was",
            "start": 4551.84
        },
        {
            "text": "your top 10 who's you this who's you that and whether or not it's ranked just who are the people that are in that and it's kind of a lot to think about um conversation I had with Corey when I was 16 talking about the 10 people closest to me then who's going to be in your your groom dude party when you get married and it's like I know I can name every single person I named and they're not all here anymore most of them are like most of them are so right or die and I'm lucky enough that like the way that I've lived like my core group is my core group James K James Kevin all this stuff it's like we are we are who we are but there are a couple of those people that for whatever reason like just mhm got ejected out of the group like they just are so far and to look at them now it's like I can't believe I can't even imagine them being invited to the wedding sure you know sure sure sure and uh it's just that it hurts to think about but at the same time it's like that's kind of life yeah",
            "start": 4591.16
        },
        {
            "text": "can't believe I can't even imagine them being invited to the wedding sure you know sure sure sure and uh it's just that it hurts to think about but at the same time it's like that's kind of life yeah personal growth I don't the people that I grew apart from I don't miss in I don't miss period but it's also like I don't have ill will towards them it's just how it goes but I think it's uh even more difficult for me now where it's like I think recently there's been a couple situations where people that I'm really close to we just things happen and it's just instantly like all right well you are just gone you know yeah that's tough that's tough yeah I mean I feel like friends are the people that you actually get to pick right and that and that's a very important thing uh answering for me especially this topic is that you don't have to be friends with people you don't have to and and largely I think a lot of friendships are are circumstantial right like you're friends with",
            "start": 4634.88
        },
        {
            "text": "me especially this topic is that you don't have to be friends with people, you don't have to. And largely I think a lot of friendships are circumstantial right? Like you're friends with people I was friends with a lot of people in college that I don't really talk to that much anymore because we were in those moments in life together having those shared experiences together and then I moved away and they still live in Orange County or in Southern California and I came up here and I had I have a whole different life now. And when we talk, or when I when I'm able to catch up with these people yeah there are some old times we could talk about and yeah we're still you know human beings of roughly the age we're sharing some of those experiences but it's difficult more difficult to connect than it is to connect with you guys who share literally almost every waking second of my time with me. Um, but I've let a lot of people go and you just have to because you have to at a certain point.",
            "start": 4672.0
        },
        {
            "text": "connect than it is to connect with you guys who share literally almost every waking second of my time with me um but I've let a lot of people go and you just have to because you have to at a certain point kind of say is this worth the energy anymore to keep this kind of friendship up a perfect example of that is you know I used to be really a lot a lot closer I think with a lot more people at IG when I smoked because you would go out and and smoke together and you started to get to know people because that you're like oh I've never really had a really a need to talk to you because you work in like engineering or sales or something like that um let's be friends we're going to smoke we'll bum cigarettes off each other it'll be fun we'll have this the shared experience and then once a I moved away and B stopped smoking like I don't really need or have that that that need to interact with these people anymore and it's not like an nefarious like I'm cutting these people out of my life but",
            "start": 4708.4
        },
        {
            "text": "away and B stopped smoking, like I don't really need or have that, that, that need to interact with these people anymore, and it's not like an nefarious thing, like I'm cutting these people out of my life but it's just like we don't relate anymore on that level so either we're going to really try hard to relate on a different level or we're just going to call this what it was, you were my smoking buddy and now you know we'll see each other at parties and that'll be fine but I'm not going to go out of my way to call you. I like how you put it as \"we moved away\" and B, I stopped smoking because I would love it if we moved away and you hadn't stop smoking and they're just like you know what guys I'm going to check out for like an hour and a half go smoke with Jim from IGN, well no but like we still we still go to par like ComiCon party that right where like I I I used to smoke until I would go out and you would see the smokers and so I would be a lot closer with those people than I am",
            "start": 4746.48
        },
        {
            "text": "we still go to par like Comic-Con party that right where like I I I used to smoke until I would go out and you would see the smokers and so I would be a lot closer with those people than I than I am now because when we go to those parties I'm like oh I'm just going to see the kind of you know core group people that are just standing by the bar all the time because that's what I still like to do mhm so yeah for aiz when's it okay I think it's okay when you feel it yeah I I don't think I don't think you you know you'll know when it's okay to give up on someone or give up on a friendship which sounds terrible and for IU it sounds like is terrible for certain instances it definitely is and I I think that the most important part and this we've kind of just talk about the Friendship part not the breakup part but I think it's the same breakup is between friends I don't really I is he still talking about friends or you talking about breakups and then you try to be friends I don't know what's",
            "start": 4778.8
        },
        {
            "text": "beau part but I think it's the same breakup is between friends I don't really I is he still talking about friends or you talking about breakups and then you try to be friends I don't know what's saying I either way the advice stands where for me the only thing that I I have learned that I can commit to and I believe in wholeheartedly and I feel like the older I get the more I believe in it is to just be you as much as humanly possible and the people that are around you are going to support that or push that away and that's on you and them to figure out but trying to make things work is the is the worst just be the best you you can be and be the person that you want to be because then the people that you surround yourself with are the homies like they are the homies and if for some reason they need to leave they need to leave you know you can't live your life trying to please everybody you need to please as many people are as necessary and like that's that number changes for every",
            "start": 4816.08
        },
        {
            "text": "they need to leave they need to leave you know you can't live your life trying to please everybody you need to please as many people as necessary and like that's that number changes for every single person yeah again I think and that's very very important like again when it's your family there's a difference there in my opinion right your family is always your family you're kind of stuck with them forever you kind of deal with them for Better or For Worse but your friends there's there's a threshold right and I'm not talking about if you have a friend that's in need it's like crisis and you're like I don't want to be there for them that that just makes you a bad friend but your friends are supposed to be the people that enrich your life and your friends are supposed to be the people that that make you want to be a better person and and that you you're literally choosing to surround yourself with and so if you're not getting anything out of those relationships anymore there's no",
            "start": 4856.8
        },
        {
            "text": "that makes you want to be a better person and that you're literally choosing to surround yourself with, so if you're not getting anything out of those relationships anymore, there's no shame in just saying like this is not something I'm getting anything out of and this is a relationship that I'm choosing to be in, I'm not forced to be in it. It's indeed calling any peers of wisdom, not really, I mean I've been thinking like I don't think I've ever had a bad friend breakup before, the one thing that I'll say is that I've had a more transient life than I think a lot of people have and um when I was younger and so doing heroin under the bridge, that's exactly right but I you know I grew up on Long Island and then I moved to Maine for a little while and I had three years there and I had two years in New Hampshire and then I had four more years on Long Island then I had five years in Boston then I had almost 10 years here",
            "start": 4891.36
        },
        {
            "text": "Maine for a little while and I had three years there and I had two years in New Hampshire and then I had four more years on Long Island, then I had five years in Boston, then I had almost 10 years here. In all those places, I have people that I really love and appreciate. And even going back to my childhood a few weeks ago, this guy Lewis, who I used to play hockey with in Maine when I was in like the mid-90s, just friended me on Facebook and never see him again, but it's cool to know that he's like banging around still and like doing his thing and like playing. But he's not he's not a friend though; he was my buddy, man. Like he and I were really close for those three years, and then I left, you know? And I never saw him again. And like that's the way it goes. My friend Stephen - when I was in private school in New Hampshire - was like my buddy. Like I was so close to him, and we email back and forth, but I'll never see him.",
            "start": 4928.72
        },
        {
            "text": "the way it goes my friend stephen um that when i was in private school in new hampshire was like my buddy like he was so i was so close to him and we email back and forth but i'll never see him again you know like i've accepted i i look in on him in facebook he's mari he's got kids he's doing his thing and i'm like i remember playing basketball with him i remember like his dad like loved cars and they had like push button transmissions in those cars and i remember like learning how to use them and stuff like that with like and i had memories with with those people and and um the one thing that i've always regretted and i think that like is deep seated in me is that like i've never felt fully accepted at anywhere i've been because i've always had to leave so um i've always been eager to be accepted somewhere because you know i have my friends on long island and i have my friends from boston i have my friends here um but i always feel like kind of on the side of all those groups",
            "start": 4961.96
        },
        {
            "text": "to be accepted somewhere because you know I have my friends on Long Island and I have my friends from Boston, I have my friends here um but I always feel like kind of on the side of all those groups because like um my friend Doug's a good example um and he's from Maine and we went to college together and I was in his wedding party and we were good, we're close friends and I just kind of was in his group for a few years and then just left that group still exists right and I hear from them very often and you know I see them when I'm out there or whatever sometimes but they still exist without me you know yeah and then on Long Island it's like my friend Mike, you know my best friend from childhood Mike Pope, I was in his wedding just a little while ago and him and Cory and a few of the guys we grew up with like they're still a group you know like I'm just not there and I reinsert myself and we have a good time and then I leave and they're still a group you know and uh",
            "start": 4994.56
        },
        {
            "text": "of the guys we grew up with, like they're still a group you know, like I'm just not there and I reinsert myself and we have a good time and then I leave and they're still a group you know. And uh, the same way with Ramone and Chris Godfrey and all these guys that I really grew up with in college, that I really love and adore. I talked to them on Instagram or I talked to them on Facebook but they're still a group you know, and like I left. So I've always had a kind of profound sadness about that. I've never had a uh, like a breakup with a friend per se, I just like kind of had to leave and I kind of in a way... where I'm like, I really love, I really like, love all of these people. It's just that for different reasons it's just that I um you know, but have I ever had this thing where I'm like we're not friends anymore and that person was like really a friend of mine? I've never had that, like I've really never had that. There are people where I'm just like... a good example is my",
            "start": 5034.24
        },
        {
            "text": "where I'm like we're not friends anymore and that person was like really a friend of mine I've never had that like I've really never had that there are people where I'm just like a good example is my friend Eric uh who was another good friend of mine growing up on Long Island uh we would play D&D together and we'd play with G.I. Joes and go swimming and do all this kind of stuff we were always together biking around and for years and uh I hadn't seen him um since high school went we went all the way through high school together we kind of grew apart in high school we we talk and stuff but he was kind of doing his thing I was doing my thing and uh I was painting a house in 2005 on Long Island I worked for Postmates and he like happened to live near the house so he came over and we were talking and I had not seen him again or talked to him since then and then he reached out to me like late last year or whatever was like I'm in San Francisco for business you want to go get",
            "start": 5073.64
        },
        {
            "text": "we were talking and i had not seen him again or talked to him since then and then he reached out to me like late last year or whatever was like i'm in san francisco for business you want to go get dinner we just got dinner and we like yuck it up and had **** rically laughing and took pictures and and all that kind of stuff and then we went our separate ways and i may never see him you know like and it was good to reconnected him i was looking at his facebook recently got married and all that kind of stuff see his parents and i'm like whoa i love and i'm like it's kind of like in a way like social media kind of reminds me of how like sad i am of like losing some of these people that like you know if someone to the point of like wedding parties whatever someone was like are you and Eric like you're 12 or 14 it's like couldn't imagine your life without that person and then you're 31 you're like i haven't seen that i've seen that person once in 15 years it's just the way things go but i",
            "start": 5105.0
        },
        {
            "text": "you're 12 or 14 it's like couldn't imagine your life without that person and then you're 31 you're like I haven't seen that I've seen that person once in 15 years it's just the way things go but I think what the important thing is for the people outside of San Francisco because I'm I'm here and so I I'm able to keep my connection here although tenuously sometimes there are people that I can't believe I don't talk to anymore I don't talk to Mark Ryan anymore you know I don't talk like these people that I like love um is that I try to keep a touchstone in like every one of those places you know like Mike Pope like I'll always be boys with Ramone I'll always be boys and all that kind of stuff that's the best I can do to maintain yeah I don't think that's rare to you though that's the same way right where you know I don't pose my best friend right but I don't talk to he's the high school Chicago you know I guess grade school too like my lifelong Chicago friend I you know get to touch base",
            "start": 5138.52
        },
        {
            "text": "right where you know I don't pose my best friend right but I don't talk to he's the high school Chicago you know I guess grade school too like my lifelong Chicago friend I you know get to touch base with him once every six months we're not on phone call basis and the same thing with Hayes in MO at Missou or you know in Missouri I should say or whatever he's the college person like there's these very three distinct groups of friends in my life but it's what you always you know talk about where uh the first time I ever met Ramone that the fact that we immediately gelled right and that's the same thing and when Poe used to come down to visit me at Missou he gels with everybody when those people come out here they gel with everybody here like you have that same close-knit circuit even though it doesn't feel that way you still these groups yeah it's a it's just a Melancholy kind of feeling sometimes you have like melanin m of feel yeah I've always kind of regretted having a more transient",
            "start": 5172.16
        },
        {
            "text": "it doesn't feel that way you still these groups yeah it's a it's just a melancholy kind of feeling sometimes you have like melanin of feel yeah I've always kind of regretted having a more transient childhood based on circumstances cuz it's like I really wish that I um I really wish that I had that like full 13-year kindergarten to 12th grade experience with like one group of people but I just didn't the only the only saving grace was that I got to end with the the people I started with that was like basically it I I mean I had that to a degree like I from from like fourth grade on all the way through high school I had people that I I mean I was in the same town it's just we you still you know drift apart even in high school like the people that I think out of out of everyone I went from fourth grade fifth grade and sixth grade too I think one person managed to make it to high school with me that I was even like on friendly terms with yeah I was kindergarten through high school with",
            "start": 5207.28
        },
        {
            "text": "fourth grade, fifth grade, and sixth grade too I think one person managed to make it to high school with me that I was even on friendly terms with yeah I was kindergarten through high school with the group and I have more I have more I don't know me wrong I like my group of friends at Missoula and my group of friends back in Illinois right like in Illinois there's like three people keep in touch with Mou there's also a small select group but it's the same thing right where by the time you get out of there you figured out who you like enough to hang out with for real who is your friend and who is your acquaintance and who is just some person yes Francisco Public Schools were set up in such a way that if you didn't get into the high school I went to LOL which was like the only academic based uh thing everything else was just a lottery of where you lived uh if you didn't get in there which me and a lot of my close friends did like you were just",
            "start": 5248.2
        },
        {
            "text": "was like the only like academic based uh thing everything else was just like a lottery of where you lived uh if you didn't get in there which me and a lot of my close friends did like you were just put in a whole bunch of random schools and I went to a totally different Elementary School than anyone else I knew so everyone got split pretty much instantly but SF so small that like it didn't hold us back we just went to each other's dances you know what I mean it's like oh let's do winter ball Galileo let's do so wild place I didn't know anyone at other high schools there was there was a fierce rivalry between all the high schools in Riverside because you just didn't that's how it works your clicks I remember back you went to Polytechnic High School go **** yourself **** you Pulaski students no that was the same way with us where it was like we were so so in our own world that I remember what a big deal it was when a couple of the guys from our group of friends started dating girls from North Riverside",
            "start": 5285.96
        },
        {
            "text": "same way with us where it was like we were so so in our own world that I remember what a big deal it was when a couple of the guys from our group of friends started dating girls from We North I was like what there's a whole other group of girls what are you talking about I me that was just like dating it was like it would be like a Martian, it it was it was not acceptable yeah there was every once in a while a girl would date some dude in college and you were like oh my God why are you dating that old man super jealous that he got to have sex with her but um yeah no to the thought of like being outside of that that was just that was my my feeble High School brain could not comprehend that of course if you didn't know ladies and gentlemen this has been The GameOverGreggy Show each and every week four sometimes five best friends together on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com kindof funny where we post each and every",
            "start": 5325.6
        },
        {
            "text": "four sometimes five best friends together on this table each bring a random topic for discussion for your amusement if you like that head over to patreon.com kindafunny where we post each and every episode early if you toss us a few bucks plus there's exclusive goodies perks and a whole bunch of cool stuff if you have no bucks to toss no big deal head over to youtube.com/kindafunny where we post the entire show topic by topic day by day the following week until it all goes up is one big video In Mp3 until next time will Nick be in a Heather Grey shirt conversational probably have a conversational day it's been our pleasure to serve you greetings and salutations salutations I love you love and sex stuff this first ever episode of GameOverGreggy Show I'm one of your hosts Greg Miller alongside the producer whatat is this shirt it isn't grey it isn't black it isn't one of ours looks good there was a there was a point where this",
            "start": 5361.96
        },
        {
            "text": "over GameOverGreggy Show I'm one of your hosts Greg Miller alongside the producer whatat is this shirt it isn't gray it isn't black it isn't one of ours looks good there was a there was a point where this morning where I broke and I'm like I sorry hold on you're off check oh but you're ready for everything remember when you said ready Kevin you want poop again remember when you're like oh are we not doing the show no this this room was 100% functioning right why is your mic so high keev Colin was using it a real person was using it not an Oompa Loompa over there all right here we go",
            "start": 5402.88
        }
    ]
}