{
    "id": 366,
    "video_id": "quqk8wg85cY",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Surprise Guest! Step By Step's Christine Lakin - The GameOverGreggy Show Ep. 36 (Pt. 1)",
    "description": "Catch Christine Lakin as Jane in Season 2 of The Walking Dead: The Game and at http://www.twitter.com/yolakin.\n\nFull Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1407654002,
    "duration": 2647,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to the Game Over Greggy show. I am one of your hosts, Greg Miller, alongside the seducer/producer, Nick Scarpino. Hi everyone. Hey, how are you? I'm doing well, thank you. Yeah, you having fun? We'll see how the night goes. All right. Over there, the pure one, Tim Gettys. Let him host. This is the good one. I was telling him last week that this was going to be the good one. This is going to be the good one. Are you excited for what's happening? Very, very excited for Okay. Over here is the empty chair for K Morardi. He's coming as fast as he can. Then he is in an Uber cab trying to get here. He doesn't know. No, this is Christine, everybody. Hi. Her name is Christine Leaken. Hi, I'm Christine Leaken. You are currently famous. It sounded like an AA start. I have something to confess. It's been a rough. Uh, currently you star Jane in The Walking Dead from Telltale Games season 2. It's amazing. Everybody should be playing that. Uh, you're also on",
            "start": 1.1
        },
        {
            "text": "start. I have something to confess. It's been a rough. Uh, currently you star Jane in The Walking Dead from Telltale Games season 2. It's amazing. Everybody should be playing that. Uh, you're also on Family Guy. I am. Who are you there? Uh, I play the um I play the illustrious newscaster, Joyce Kenny. Right. Oh, that's fun. Now, here's the question for Nick and Tim. I gave you none of that information coming in. Has has it dawned on you who she is yet? We've gone through two voice acting roles. She's been in a number of films. Thank you. Sure. That doesn't help you actually. Doesn't help you at all at all. But it's fun to it's fun to watch you figure it out, right? See the confusion in their eyes. See, I have my my phone in my hand right now. For everyone, the enjoyment will have to be like watching their face light up. You probably know her from her seven years on the hit sitcom Step by Step when she was out. I never watched them. What? I'm stupid. And I only watched like three shows",
            "start": 37.12
        },
        {
            "text": "watching their face light up. You probably know her from her seven years on the hit sitcom Step by Step when she was out. I never watched them. What? I'm stupid. And I only watched like three shows and it's not Boy Beach World. I wasn't there. You know what I'm talking about. I do know what you're talking about. I was blown away that Al was coming to IGN today. Then Al's coming to my house. No, Nick knows. Nick and I are old. Tim's 24. Oh, you have to remember though I tried to I try to forget most of my childhood because I lived as a obese child when I was younger. So anything not like before 22 I just I choose not to remember in my life. Sorry. Now you can try to cover it up. If you remember two weeks ago on the Game Over Guggy Show, we talked about the hit sitcom step by step. Yes. And what was basically said is, \"Oh man, those girls got so hot when they got older.\" Yes. That's on footage. I showed her that clip. I saw it. This is awesome. I like this a lot. Um, which by the way,",
            "start": 81.12
        },
        {
            "text": "what was basically said is, \"Oh man, those girls got so hot when they got older.\" Yes. That's on footage. I showed her that clip. I saw it. This is awesome. I like this a lot. Um, which by the way, thank you. Oh god, it's hard being me. Um, no, thank you. Uh, but I do think it's quite funny that people when they I've seen things like this before and people are like, uh, oh yeah, do you remember the girls on that show? Yeah. And then the one got hot. The one you didn't expect to get hot got hot and I'm always like, thank you. No, you can. I have a look at that. They tight cast you in. You were the tomboy. You had the backwards hats. You came from the Patrick Duffy side of the relationship. That was the boy household. Yeah, it was the boy household. That's why I don't think anybody was expecting great things from the other side were the pretty princess girls. Right. Right. So, they were already starting at the top. Exactly. Exactly. I mean, there was nowhere to go. You know, you started",
            "start": 128.4
        },
        {
            "text": "great things from the other side were the pretty princess girls. Right. Right. So, they were already starting at the top. Exactly. Exactly. I mean, there was nowhere to go. You know, you started from the bottom. Now you're here. Now you're here. I don't know. I'm sorry if that's not a step up. I'm not sure. Getting here with us in the spare bedroom. Um, so I have a million questions about Step by Step. Okay, go for it. How did this begin for you? Like were you are was you were just you knew from an early age obviously you're going to be an actor you know I I was that kid that was doing like plays on the mantle of the uh fireplace like when I was 2 three years old familiar with that. Yeah. So uh I was putting on I don't know step by step but I'm familiar with mantle fireplace. Yeah. Fireplace mantle. So I was you know looking I was doing like um productions of Annie and I was like so yeah I think my parents always knew like that was going to be the case for me um or the curse for me.",
            "start": 170.24
        },
        {
            "text": "mantle. So I was you know looking I was doing like um productions of Annie and I was like so yeah I think my parents always knew like that was going to be the case for me um or the curse for me. No. Uh, we moved to Atlanta and I was doing like theater and then I sort of fell into doing random local commercials. Well, when you did this, but she How young were you when you started the show? Uh, yeah. It was 1991. So, if you want to do the math. Well, you don't have to. Yeah. She was young, man. You Oh my god, you were so young. Of course I I mean, that's the thing. That's the hard thing is because you're a fully grown, beautiful woman now. Oh, thank you. Yes. Yes. I was You were too old. Oh, you were two years old. That's You're the worst time. I'm the worst person, guys. So, you're in Atlanta? I'm in Atlanta. That's where you're from? Uh, we moved there when I was six. Okay. Just because or because of the acting? Uh, no. And my dad was just moving around. Yeah. And randomly, that's",
            "start": 206.88
        },
        {
            "text": "I'm in Atlanta. That's where you're from? Uh, we moved there when I was six. Okay. Just because or because of the acting? Uh, no. And my dad was just moving around. Yeah. And randomly, that's kind of where like the theater started to happen, the dance classes, and you know, so I was doing like local commercials and stuff. I was down in doing theater in like a random South Georgia. And an agent from LA was there with her family. Yeah. She came up to my mom and was like, you know, I think your daughter's really talented. I don't know if you're ever going to come to LA, but if you do, like, look me up. My mom was kind of like, thanks. We're not really that's not really the goal. We're happy in Atlanta, Georgia, the home of Coca-Cola. Yeah, we're we're good with that with that. So, uh about a year later, my mom took me out for like a motheraughter trip and she was kind of like, \"This might be fun. We'll do some auditions, you know, you know, whatever, write the trip off and uh and I did",
            "start": 246.96
        },
        {
            "text": "a year later, my mom took me out for like a motheraughter trip and she was kind of like, \"This might be fun. We'll do some auditions, you know, you know, whatever, write the trip off and uh and I did some I put together like a tape and, you know, had an agent I met and they were like, \"All right, if anything's right, we'll send you out for it.\" And like two months later, we got this call. They were looking for this kid. They couldn't find this role and they had seen my Dave and they wanted us to like fly ourselves out and my dad's like my dad I come home and I'm like 11 years old and my dad's like um he's like so he's like kiddo they want to fly you out or they want us to fly out for the thing and I remember being like that no that's the dumbest thing I've ever heard flying across the no I got things I got to I got to dissect a frog I'm taking care of a friend's dog I got a life like it was very funny but he was like you know very supportive of me and we came out and did this audition",
            "start": 280.56
        },
        {
            "text": "got things I got to I got to dissect a frog I'm taking care of a friend's dog I got a life like it was very funny but he was like you know very supportive of me and we came out and did this audition and it I got the job and it like went for a long time. So in the beginning one of those weird stories of course you understand obviously you've do you live in LA now? Yeah, currently. So you understand how much of a ridiculous story that is that you just told me? Oh absolutely. And there's probably a lot of actors that watch our show maybe one or two at least that are like it's Rosen Bomb. Rosen Bomb's the only one who I had to wait till I got Smallville, you know, but it's like it's different for every actor and it and that happens a lot throughout your career. You know what I'm saying? There are like waves of that kind of stuff where you're just like, \"Yeah, I just auditioned for this role and it turned out to be like one of the greatest things that ever happened to me or like, you know,",
            "start": 318.6
        },
        {
            "text": "are like waves of that kind of stuff where you're just like, \"Yeah, I just auditioned for this role and it turned out to be like one of the greatest things that ever happened to me or like, you know, I always wanted to play this and then I finally got to, you know, like Neil Patrick Harris, you've seen that happen for him like 15 times, you know, at this point, but then you have things like Ryan Reynolds. He's like on Two Guys, Two Two Guys, a girl, and a pizza.\" Excuse me. Bolt neck the movie. Thank you. We were in that together. And if you haven't seen it, check it out on Amazon, would you? That's what that's what launched both of your careers. I'll start shooting that right now. For him, me, I think it put me down. It was actually film. It was um That's insane, though, because it's it's very seldom that you get a show. And not only do you get a show, but you get a show that goes seven years. Yeah. Especially like nowadays. I mean, nothing goes seven years. No. Lost. Lost. Only",
            "start": 357.52
        },
        {
            "text": "it's very seldom that you get a show. And not only do you get a show, but you get a show that goes seven years. Yeah. Especially like nowadays. I mean, nothing goes seven years. No. Lost. Lost. Only what, five years? Yeah. Maybe not even six. Why am I looking at you? I don't know. I don't know anything, guys. Why do you have me here? You talk about YouTube. I'm trying. I try. He tells us YouTube videos we need to watch. Yeah, exactly. Twerking videos mostly. Um, like twerk videos. Oh my god, that's insane. So, my next question then, you go there. How long do you think it's going to last? Oh my god. Like, we're I'm there for a week and a half to do the pilot. I mean, and then when you do the pilot and you wait 3 months and like they pick up like a handful of of the shows. I mean, it's like slim pickings. I remember Stacy Keenan's mom was standing outside and she like looks at my mom and she's like, \"Don't get too attached. Most of these things don't get picked up.\" I just like walked",
            "start": 397.28
        },
        {
            "text": "slim pickings. I remember Stacy Keenan's mom was standing outside and she like looks at my mom and she's like, \"Don't get too attached. Most of these things don't get picked up.\" I just like walked inside. My mom was like, \"Oh god, what have we done? Back to Atlanta.\" But I I was like, of course, we had no expectation that. So when it happened, it was kind of like, \"Oh [ __ ] what are we going to what are we going to do? Where are we going to live?\" Yeah. And my parents like I have to say, I mean, my parents are just very I mean, unbelievably supportive of me and like I'm the only one. So, you know, they kind of like helped me like fulfill. So, did everybody move or did they move out with you? Mom moved out with me. We had an apartment there. I went to a a high school in Atlanta. I went back like once a month. You had to be the coolest kid. God, you were so cool. You would think. No. I mean, imagine being imagine being in seventh grade at the height of like TGIF. That's when most kids",
            "start": 435.2
        },
        {
            "text": "like once a month. You had to be the coolest kid. God, you were so cool. You would think. No. I mean, imagine being imagine being in seventh grade at the height of like TGIF. That's when most kids are really getting in the groove of watching it. Yes. But you were in You're me obviously, but Okay. Don't say it. How How young are you? I'm 31. Yeah. Okay. So, you were in what grade when you were watching? Fourth. Oh, Jesus. Third grade. If TGIF was such a staple of everything, I'll give you that. I'll give you whatever you want. Friday nights, sleepovers. Oh yeah, Friday nights what we did. Let's back. Oh my god. You know my life. Friday nights we would pick up. I lived your life. I was living that life. I know. Back up for a second and let's let's talk about the TGIF lineup. Okay. Can we can you bring us through what was on? Do you remember? Do you guys remember what it was? Full House, Family Matters, Step by Step, Perfect Strangers, and then at one point it was Boy Meets World. Boy",
            "start": 475.12
        },
        {
            "text": "can you bring us through what was on? Do you remember? Do you guys remember what it was? Full House, Family Matters, Step by Step, Perfect Strangers, and then at one point it was Boy Meets World. Boy Meets Worlds in there. There was a Going Places. There's another dream team of television, right? That's why everyone's lives are revolved around it. We'll see you next week. When they'd say goodbye to you on TGF, it was like and then there would be the things in between where like a family would be hosting the TJ, you know, be like, \"Hi, welcome back. We're just watching everyone's shows.\" Which when you think about this so weird like why are the Winslows watching us? Why are we watching the Winslows? Like what are we doing? When I was watching those shows when I was younger, much younger, um, so much I thought like that's we thought you all hung out together and you shot like I used to think and fantasize you guys shot on like the same lot where it was like the sets were like back to",
            "start": 515.24
        },
        {
            "text": "um, so much I thought like that's we thought you all hung out together and you shot like I used to think and fantasize you guys shot on like the same lot where it was like the sets were like back to back and you always saw each other. Shut up. You're blowing my mind right now. When I Google image search, there was a picture of you and Tena like just chilling out. Holy [ __ ] Okay, so now this makes sense to me. How is Tanga? Tim just got in the game right now. All right, listen. Listen. Um, so yeah, when we were like we met I don't know I I was like 15 and I think she was like 13, right? Um, so we would all like of course we all knew each other to a degree because well I didn't go to school out in LA. So on the weekends I'm literally like not that like I don't have any friends. You know what I'm saying? So my mom was always like let's get involved. Let's get involved. Let's do things here in LA La La Land. But this is my you need something to do. Let's get involved. So we did I did a",
            "start": 552.96
        },
        {
            "text": "I'm saying? So my mom was always like let's get involved. Let's get involved. Let's do things here in LA La La Land. But this is my you need something to do. Let's get involved. So we did I did a lot of charity work and it was amazing and awesome and I worked with you know four or five different charities and the other great thing about it was so did a lot of these other kids. So we all like met each other doing this stuff and that was just kind of like our social circle which is weird like Yeah. However, here we go. This is the real dirt. So at one point Andrew Keegan was on our show. Don't know if you remember which if you're if you're a girl you would totally remember him. Yeah magazine. Yeah. Okay. So he like played he played my boyfriend on the show and then I think at one point like he played someone on Boy Meets World anyway come to find over he was out on like every show in the '90s and apparently but like yeah we went out a couple times after the show and I remember being",
            "start": 594.16
        },
        {
            "text": "he played someone on Boy Meets World anyway come to find over he was out on like every show in the '90s and apparently but like yeah we went out a couple times after the show and I remember being like oh my god like I'm totally dating Andrew Keegan and then I find out like everyone else had dated Andrew Keegan, you know, but like Danielle and I like laugh about that now. were like, \"Remember remember the days when we would like fight over Andrew Keegan?\" Yeah. And then I saw her at this Christmas party and he walked in of all people. He walked in and I was like, so we got this like picture of He was always the douche though. He was always a douche. Oh yeah. And he's he's such a nice guy. Doesn't sound like it. Sounds like he broke your heart. Sounds like heart. And I'm not about that. Not about that one bit. So I'll ask the question that Tim's died to ask right now. Do you still hang out with Chapanga? Yeah, I just saw her recently. I love everything about this. This is good. And",
            "start": 637.04
        },
        {
            "text": "Not about that one bit. So I'll ask the question that Tim's died to ask right now. Do you still hang out with Chapanga? Yeah, I just saw her recently. I love everything about this. This is good. And she's on. So, and they're doing the show, right? Valentine's Girls World, right? Are they Are they going to do a step by step by step? Oh my god. You would be so good for that. See, that's the thing that everything '9s is looking for a Christine Lake and type to play herself. Wait, how do we start this right now? How do we get step by step by step? It's already on its way. I mean, that's what I'm saying. Everything making the Save by the Bell reunion movie. I mean, what about that? Everything is nostalgia right now. Bash fan. Thank you very much. Mark, they're not going to do that anytime soon. Yeah, but this is the unauthorized version. Yeah, I know. See, now is that the thing though? Like, did you talk about like stick with me? I'm going somewhere with this. This I do the walking",
            "start": 676.0
        },
        {
            "text": "soon. Yeah, but this is the unauthorized version. Yeah, I know. See, now is that the thing though? Like, did you talk about like stick with me? I'm going somewhere with this. This I do the walking questions a lot. Um, did everybody get along like in the Sabbath the bell thing? Like it's from Screech's point of view and they hate nobody likes Screech or wanted to hang out. Who had the Coke habit? That's what I That was well documented. Read about Hollywood. That was well documented on our own show. Yeah. You feel like No, you shouldn't. I always feel like a jerk, right? Yeah, that's true. Um, no, like everyone actually, I know it sounds really cliche, we actually all did kind of get along in a weird way. Like the girls definitely were they were, you know, they kind of stuck together in the beginning and then I was in this weird place where I wasn't like a like a teenager yet and the girls were older, but then I was like hanging out with like the boys, like the younger boys. Then there",
            "start": 715.76
        },
        {
            "text": "beginning and then I was in this weird place where I wasn't like a like a teenager yet and the girls were older, but then I was like hanging out with like the boys, like the younger boys. Then there was like Brandon Call in the middle who was just kind of like I don't know whether I'm cool yet or whether I'm like still a kid yet. So he would like beat us up and I was one of like the little kids in that scenario. That's sounds like fun. It's Yeah, it was kind of because he was actually kind of like we would mostly side with each other and beat them up. So, yeah, you learned how to do a lot of Street Fighter 2. I played a lot of Street Fighter 2 at the um Yeah. doughnut shop. So, that was, you know, the early part of my life. It was pretty rad. Yeah. Well, your life's pretty good now, too. Yeah. Lovely fiance. Thank you. Isn't that a lot? He's so cute. He's very nice. He's dressed well tonight. He is dressed up mostly for you. Oh, no. It worked. I know. He had a thing. He just, you",
            "start": 753.68
        },
        {
            "text": "Yeah. Lovely fiance. Thank you. Isn't that a lot? He's so cute. He's very nice. He's dressed well tonight. He is dressed up mostly for you. Oh, no. It worked. I know. He had a thing. He just, you know, I want to come see shot. You don't try. I have to. It's really fun. Okay. Anything else you want to ask me about that time? Everything. I mean, I mean like I have questions. I have questions ranging from like what was it like to work with St. Summer's Patch Duby? Exactly. I want to hear that. I want like another question is like at any point during the the entire seven-year run, did you guys ever play the theme from uh like come and knock on my door, come knock just to mess with her. Just to mess with her. I mean, yeah. You have to know something. Patrick Duffy is probably like the biggest jokester in Hollywood. He would constantly do like crazy stupid [ __ ] like I don't know if you remember on step by step but like I had forgotten this and I guess it's rerunning on the hub. I don't",
            "start": 787.6
        },
        {
            "text": "jokester in Hollywood. He would constantly do like crazy stupid [ __ ] like I don't know if you remember on step by step but like I had forgotten this and I guess it's rerunning on the hub. I don't get the hub. It'd be weird if I did. I'd probably watch it just cuz it would feel like I was watching an old weird home movie for a minute and then it would probably get old. But um but there were all these like bed scenes between them. Do you remember that? They'd be like in the bed and she'd be like making lists. But she's wearing like lingerie. This is like a Friday night. It set up a good home environment for what I imag. And he would bring just to like break the ice and be funny. He would bring like like an egg beater into the bed and like a wooden spoon like this weird [ __ ] She just be like, \"What is that?\" And then it would be like some crazy just cuz he's just a jokester. So yeah, he did a lot of that [ __ ] to her. That's good. And it was really nice. They had a really lovely",
            "start": 829.04
        },
        {
            "text": "be like, \"What is that?\" And then it would be like some crazy just cuz he's just a jokester. So yeah, he did a lot of that [ __ ] to her. That's good. And it was really nice. They had a really lovely relationship. Were they nice to you guys? Very. Yeah. Very. Was it like the total thing of like, you know, oh, they were like, \"Mar, get married.\" Would you tell us if they weren't? No. You'd probably know. I think I'm not quite a good career. I'm not that good an actress. Um Uh but uh no they were great like Suzanne is very much um very smart like very smart businesswoman and you couldn't like and also very like self-deprecating and also like very real you know and I think that's what always made her so appealing. She's just easy to get along with and she was also insanely good-looking. Yeah. And had a really good sense of humor about herself and that was it's very endearing. Yeah. And then like Patrick's just like he's he's very dad figure. Yeah. For sure. I've I mean, he's invited to",
            "start": 865.12
        },
        {
            "text": "And had a really good sense of humor about herself and that was it's very endearing. Yeah. And then like Patrick's just like he's he's very dad figure. Yeah. For sure. I've I mean, he's invited to my wedding. And then my mom made a joke. Goodness. My mom made a joke on Twitter and she was like, \"Does he want to pay for it, too?\" I wrote something on Twitter. I was like, he's like, \"Uh, I would love to walk you down the aisle, darling dear, but I will not be paying for your wedding, but I'll eat the cake. That's the most important thing.\" Yeah, he's great. Uh, Stacy Keenan is a lawyer now. Really? Yeah. Well, what? Couldn't you see that coming then? Yeah. Yeah, I can see that business sense. She had to look Yeah. ice and water in her veins, too. Oh, yes. There you go. Okay. She's not like that, but she's um very smart. Yeah. This is fascinating. Yes. So, like you're growing up enjoying TGIF, but being on TGF, right? Which brings us back to Were you the most popular girl in seventh",
            "start": 908.16
        },
        {
            "text": "that, but she's um very smart. Yeah. This is fascinating. Yes. So, like you're growing up enjoying TGIF, but being on TGF, right? Which brings us back to Were you the most popular girl in seventh grade? No. But did you didn't want to hang out with you? Yeah. Tell me how it's going to end. What's happening with Cody? Um, it was more like I mean, it's weird. Uh, it was cool because I was like away from Hollywood. And once the novelty of it wore off, then it was like people just didn't it it just sort of wore off and I was just this girl in school who had this like weird thing and everyone kind of was like, \"Oh yeah, she's a celebrity. Just don't worry about it.\" Which was actually really nice. Um, but in the beginning it was weird because I was new at the school and I also was a lot of like, \"So, um, how often do you go to California? Do you like California? Is Patrick Dy a real dad? How much money do you make?\" Like it was just it was these like crazy questions. I was like I don't",
            "start": 948.24
        },
        {
            "text": "like, \"So, um, how often do you go to California? Do you like California? Is Patrick Dy a real dad? How much money do you make?\" Like it was just it was these like crazy questions. I was like I don't know. Kind of like this show the last 20 minutes of your life. Yeah. Hey, it's Colin. This is Colin. Hola. How's it going? No, you have to slither. Oh, yeah. You're fine. You decided you have to slither. No, go. Go around. You're fine. Go around. Colin, this is Christine. Nice to meet you. How are you? Nice to meet you. Big fan. Spray it on us. were like, \"I'm sorry I'm late. It's fine. I take it personally.\" I had a Jesus. I just got caught up. Happens. Happens. If you you know, he kept me this secret from me. If you told me that, I just would have abandoned the meeting. I told you it was a big deal. You should have come. I know. I I had this thing. I got to fix this. I got I had this whole thing set up with uh with an old friend of ours today. So, uh I had to uh attend to that. Okay. Um",
            "start": 991.12
        },
        {
            "text": "deal. You should have come. I know. I I had this thing. I got to fix this. I got I had this whole thing set up with uh with an old friend of ours today. So, uh I had to uh attend to that. Okay. Um I'm going to go get a drink of water. You don't have time. No time. Okay. I'm sorry. Christine's only here for this topic. Okay. I'm so I'm so sorry. I can say a little I can say a little. No, you can't. You have a dinner reservation. I know, but we're good for a moment. Very important. This is so How did you How did So, how did this She's in The Walking Dead, the video game. Yeah, she's she's she's a voice act. She's on Family Guy as well. I am. Okay. She's in She She went on to be an important person. I I not really, but thank you for saying that. No, I'll keep saying it. Don't worry. That's cool. I had no idea. I had no idea that that you were in the So, The Walking Dead season 2 or Yeah. Yeah. Okay. I haven't played it yet. Yeah, exactly. We won't spoil anything for you. Okay. Well, call",
            "start": 1037.92
        },
        {
            "text": "I had no idea. I had no idea that that you were in the So, The Walking Dead season 2 or Yeah. Yeah. Okay. I haven't played it yet. Yeah, exactly. We won't spoil anything for you. Okay. Well, call me when you do. I wait till all the episodes come out and then I play. Yeah. Okay. Colin's very particular about his games. I see. And his TV though, so he knows the TGIF lineup. Well, yeah. He knows step by step. Well, you want to talk at all? Because a lot of people like to mention this and I think it's a fun fact. Real quick, I enjoy like, hey, you guys aren't asking the good questions. Here's one. Here's the answer to one. Way to steer the interview. It's perfect. Um, the uh the waves at the end. Yeah. Oh my god. The worst green screen of all time. So like that, right? Yeah. Do you know what it was covering? The parking lot. Oh, okay. Yeah, it's Magic Mountain. Yeah. Yeah, of course. That's fun fact. Fun fact, random fact 57. I wish we had two, three hours to talk about stuff. You missed",
            "start": 1071.2
        },
        {
            "text": "it was covering? The parking lot. Oh, okay. Yeah, it's Magic Mountain. Yeah. Yeah, of course. That's fun fact. Fun fact, random fact 57. I wish we had two, three hours to talk about stuff. You missed the We talked about Suzanne Summers and Patrick Duffy in bed together and all the crazy kinky stuff. I'm so sorry I missed it. Um, you can watch the episode. Step by Step was such a like a formidable important show in my life. Yeah. I mean, think about it. Like there was the like, you know, Al got a bra, Al stops her bra. Almost gets date raped. Um, damn. I don't remember that. Al does marijuana. Yeah. I had a lot of the very special episodes. Well, you were the one coming of age. The older girls were already of age. They were already. One was smart, one was dumb. I mean, up trajectory. Someone had to play with it between those lines. What's happening? Who knows what? Oh, man. But I was just going to say, who do you voice in in Family Guy? cuz I can I feel like I can I can hear I'm Choice",
            "start": 1109.68
        },
        {
            "text": "had to play with it between those lines. What's happening? Who knows what? Oh, man. But I was just going to say, who do you voice in in Family Guy? cuz I can I feel like I can I can hear I'm Choice Kenny. Yes. Okay. Newscaster. Yeah. I can I I was going to say I can hear like that's ringing like lots of bells for me. Yeah. Very cool. Some other sunundry random people, you know, when they need like those the cutaways that are like fat woman, slightly fatter woman, sheriff standard or you know annoying girl, very annoying girl. Do you So you've worked with Seth? Yes. Closely or? Yeah. Yeah. Yeah. So he's there. He's like, \"Get in here, woman, and do this voice for another woman cuz Family Guy has been going for so long that it's even show up to set like or to the recording booth anymore.\" I started there like 3 years ago, maybe four. I It started just me like filling in at table reads and he had seen This is one of those weird stories when I talk about waves someone's career. Yeah. So I",
            "start": 1157.28
        },
        {
            "text": "started there like 3 years ago, maybe four. I It started just me like filling in at table reads and he had seen This is one of those weird stories when I talk about waves someone's career. Yeah. So I was doing theater in Atlanta again. Always with this Atlanta connection. Uh sorry. I was doing theater in LA. I was doing it up at the Getty. Forget about Atlanta. Forget about Atlanta. Um, but again, like just, you know, doing it because I loved it. And my friend brought him. He used to like come into her bar all the time. And he saw the show and loved it. It's a really cool theater company in Los Angeles. We do a lot of like Shakespeare, popular music, nerdy theater stuff. And uh, anyway, he loved it and like randomly came up and was like, \"Hey, you know, if we ever sometimes we do table read, you should come sometime.\" And I was like, \"Yeah, great. How about tomorrow? Let's do this.\" Random. And then like it was months went by and then I got a random phone call that was like, \"Hey,",
            "start": 1201.12
        },
        {
            "text": "read, you should come sometime.\" And I was like, \"Yeah, great. How about tomorrow? Let's do this.\" Random. And then like it was months went by and then I got a random phone call that was like, \"Hey, this is the casting director, Family Guy. I know you don't know me. Is there any way you could come in like today in like half an hour and read through a script?\" And I was like literally driving on Wilshshire. I was like, \"Uh-huh.\" Yeah. I was like, \"Where is it?\" It's like the other way in Wilshire like [ __ ] back again. But yeah, but I mean it just started like that. And what I think I didn't realize it was sort of an informal audition. Yeah. Because they don't really do that. And I just got really lucky and I did a couple a couple things and I think I don't know he liked me and so they had this role and he called me up one day and he's like I got a question for you. I'm like yeah like in New York I'm like what? Um and he's like how do you feel about being the new newscaster? And I was",
            "start": 1242.56
        },
        {
            "text": "this role and he called me up one day and he's like I got a question for you. I'm like yeah like in New York I'm like what? Um and he's like how do you feel about being the new newscaster? And I was like I feel great about that. I don't know. I didn't know what it meant right yeah like one time. But yeah, then it just started and I every time they call me I'm like, \"Oh god, this could be the last time because I I'm just so grateful for the job quite frankly.\" And you had a dark outlook on it. No, I mean like I not that I just I'm just so grateful like it's tough. It's a tough gig. Being an actor is probably one of the hardest jobs. I just never take it for granted like how cool it is, you know? We're still making you get the the royalties from the Hub Network every so often, I'm sure. Oh yeah. I mean, you know, that might buy you a grape soda. Thank you for maybe a six-pack. Maybe a six-ack of grape soda. Maybe. Um, yeah. All right. So, I I got to I got I got I got to utilize this",
            "start": 1278.08
        },
        {
            "text": "Oh yeah. I mean, you know, that might buy you a grape soda. Thank you for maybe a six-pack. Maybe a six-ack of grape soda. Maybe. Um, yeah. All right. So, I I got to I got I got I got to utilize this time wisely. I'm so sorry that I was late again. It's it's it was Well, stop apologizing. I hate you. It's basically that. Okay. All right. Well, I don't know if I can live with that. Uh, did we touch on Cody? We have not. No. We've mentioned Cody in passing and joking senses, but never talked about that. No. Uh, there were some cocaine references made. I was just going to say that was Nick surprise. Let me bring you up. We don't actually know who made those references. We don't we don't have any factual evidence behind that. I'm just curious and I I I don't want to put you on the spot, but there was some serious stuff with Cody going. There was some serious stuff for a while. Yeah. And was that was that awkward for the for the cast on this show? Like Yeah. Like it was like totally Oh my",
            "start": 1318.8
        },
        {
            "text": "was some serious stuff with Cody going. There was some serious stuff for a while. Yeah. And was that was that awkward for the for the cast on this show? Like Yeah. Like it was like totally Oh my god. totally like I mean you know there was like a good amount of time it's what happened. So you and it was a good amount of time like he just didn't show up for work and there was definitely something going on and you know that's hard because you don't you're a kid too so nobody's really talking about it because it's also like let's not talk about the drugs in front of the children I mean but I was like 15 or 16 like I'm not stupid I can read the paper I can read the paper so this is how how little I know so he actually had a drug problem yes so my reference to that hard substance earlier in the show was incredibly insensitive Yeah, it was incredibly insightful. I think you just understood sets in the 90s. That's sets. That's I mean there's a lot of that going around LA. That's why we stay",
            "start": 1360.96
        },
        {
            "text": "show was incredibly insensitive Yeah, it was incredibly insightful. I think you just understood sets in the 90s. That's sets. That's I mean there's a lot of that going around LA. That's why we stay away from it, right, kids? Yeah. That's why we stay here in San Francisco in the bedroom making YouTube videos. God knows no one does drugs in San Francisco outside Lance Festival. Just don't do the drugs. They can kill you, you know. Yeah, dude. Yeah, exactly. You know, that's advice from Al you can take to the bank. Exactly. Yeah. So anyway, but yeah, there was some there was some stuff and I think there was some drugs and there was some like fighting with the wife. Yeah, I was going to say maybe a little bit of wife beating. There might have been some wife. I was going to say it so casually. Well, just just, you know, throwing it out. Patrick Duffy wouldn't stand for that [ __ ] No, definitely not. No, it was Yeah, it was Do we think I'm just going to go around the table real quick or",
            "start": 1403.92
        },
        {
            "text": "Well, just just, you know, throwing it out. Patrick Duffy wouldn't stand for that [ __ ] No, definitely not. No, it was Yeah, it was Do we think I'm just going to go around the table real quick or just whoever wants to say it first was the cooler dad, Patrick Duffy or Alan Thick? Cooler. I'm going with thick just because it's the only thing I know and I love him. Tim, I love you. I'm putting you on the spot. Unusually thick. Do you Are you watching this? No. Is that his show? Does he have a show called Unusually Thick? Yeah. It's on the TV Guide Network. That's so amazing. Really? Yeah. Guys, get to know the cable television. I can be I can be your in. I can be your in. Unusually thick. That's the name of it. Can I call you when I don't know what to watch? Can I just have you tell me what you're watching currently and then I we'll catch up with you. Call me sometime. I'll, you know, I'll give you a rundown of what's on Artivo. Okay. I like to face. A lot of it's bad and a lot of it's",
            "start": 1445.92
        },
        {
            "text": "you're watching currently and then I we'll catch up with you. Call me sometime. I'll, you know, I'll give you a rundown of what's on Artivo. Okay. I like to face. A lot of it's bad and a lot of it's good. Which where where it is really thick fall. Um in the bad but so good. Okay. Pile. Is his son on it a lot? Once or twice he has been. Yeah. Hey, somebody bought my album. Where does that ring? So, my wife just recently got into this show called The Real Housewives of Melbourne. Oh, yeah. Which is the Australian one. Yeah. I haven't seen that one yet. Yeah. I watch the Beverly Hills. I mean, I'm not going to lie. Do you have you ever bumped into any of those women? Oh yes. I saw Lisa Vanderpump at the Oh, she's so good looking. Sorry. I have a huge crush on her. Do you really? Because I hope I age that that perfectly. Oh my god, she's gorgeous. Flawless. She is gorgeous. I don't know what kind of shading is going on up in here, but it is intense. It looks good on camera. Needles and",
            "start": 1487.44
        },
        {
            "text": "hope I age that that perfectly. Oh my god, she's gorgeous. Flawless. She is gorgeous. I don't know what kind of shading is going on up in here, but it is intense. It looks good on camera. Needles and some lasers. It's not a big deal. Get a little bit little bit of work done here and there. Like what are you talking about? Colin Colin's like waiting his turn to just fire off rapid fire. Okay, Colin, go. Rapid fire questions. Go. I just I don't even know where to begin. Like, I don't know where to end. I don't know where we're going to be in the middle. You missed the story of how she basically backwardly stumbled into she was doing in Atlanta, Georgia theater, and then producers just came to see her and scooped her up and brought her home. It was the easiest thing on the planet for that for for the show for the show. There are actors starving on Sunset right now with signs that say, \"I will do VO for food.\" and she just just stumbled back just oh fell backward into it came up like a",
            "start": 1526.56
        },
        {
            "text": "for for the show for the show. There are actors starving on Sunset right now with signs that say, \"I will do VO for food.\" and she just just stumbled back just oh fell backward into it came up like a trust fall really it's really it's it's it's interesting that I don't know like can't even talk I don't know you speechless before this much cuz I love step by step don't you understand like I have like all these lore questions I want to ask questions is this official canon right now on the stepby-step timeline when she opened the hair salon yeah that was that yeah there was I don't know I don't know to begin. Uh I'm kind of curious though like is is was doing Step by Step kind of like in retrospect and still like like you were talking about being blessed to be able to work and do that kind of stuff. Like is it still like kind of like is it a highlight of your career or is it kind of like cuz it's it's like one of those you know it's a corny TJF sitcom like they all were but like I feel",
            "start": 1567.12
        },
        {
            "text": "of stuff. Like is it still like kind of like is it a highlight of your career or is it kind of like cuz it's it's like one of those you know it's a corny TJF sitcom like they all were but like I feel like it's it was like so important. It's iconic. It's a part of like c like pop culture which is definitely cool. And I think like I don't know like when I've seen it and I've watched a little bit of it there's part of me that doesn't cringe. I'm not like, \"Oh god, like that's crazy.\" It's still there's a place for it. And I think there's I think that about a lot of television. Like I grew up on TV. So there's a place for Growing Pains. Yes. And there's a place for Blossom in my heart. And there's a place for Doogie Hower. And there's a place for Wonder Year's Friends. And yeah, I have like And I could watch any episode of any time of the day and be like, \"Yes, I remember this one.\" When the When the show was on, did you watch yourself? Did you watch every episode? Um, I did in the",
            "start": 1612.4
        },
        {
            "text": "like And I could watch any episode of any time of the day and be like, \"Yes, I remember this one.\" When the When the show was on, did you watch yourself? Did you watch every episode? Um, I did in the beginning and then I kind of and then I kind of stopped. I would watch them eventually. It's really weird as an actor to watch yourself because there's a lot of judging that goes on and you have to be careful about that. Um, so how so? Um, because sometimes we're all like judgmental about whatever, right? You like see your picture and you're like, \"Oh my god, my hair looks horrible.\" Or like whatever. You have like a judgment about it sometimes. And when you watch it back sometimes like the judgment can cause you to change something that maybe is is a better choice, a better emotion. Does that make sense? No. No. Yeah. I'm Yeah. Because it looks a certain way. I see all the time when I take selfies, I'm like, \"No, that's rubbish. I can't I can't You can totally relate because of your",
            "start": 1648.04
        },
        {
            "text": "that make sense? No. No. Yeah. I'm Yeah. Because it looks a certain way. I see all the time when I take selfies, I'm like, \"No, that's rubbish. I can't I can't You can totally relate because of your selfie.\" Totally. No, but that's and that's that's a common thing, right? Like a lot a lot of people say a lot of actors say they won't go see their movies or watch the TV because it it's basically the equivalent to like reading the comments on a video like everything everything the whole game I don't think I've ever been so I'm not even lying. I don't think I've ever been so emotionally destroyed as when I read comments online about a like oh yeah the comments on this stuff I've done like and I I'm not used to that because I didn't grow up I didn't grow up like that. I didn't grow up with I grew up with like bop magazine. Nobody could write back like nobody could like write in and be like you [ __ ] tw or whatever they were going to say and I'm like holy [ __ ] or all the all the various",
            "start": 1691.52
        },
        {
            "text": "up with like bop magazine. Nobody could write back like nobody could like write in and be like you [ __ ] tw or whatever they were going to say and I'm like holy [ __ ] or all the all the various things they want to do around you or to you. That's always the worst. But that's not our audience. Our audience is going to leave awesome comments for you. Yeah. No. We have we have the best audience on the planet. It's true. It's a very true story. Yeah. They're positive. They're positive people. But uh to answer your question if I see Patrick Duffy um I do. and he and Stacy Keenan were in my web series, Love & Laken. If you haven't seen it, I think you would enjoy it specifically. I'm going to I'm going to look it up this evening. Love and Laken. I'm sure you can remember that. Do you want me to write it down? No, I'll I'll remember. No, he's got he's a steel trap. After him. Oh, no doubt about it. Uh just one more question. I don't want to waste too much of your time. I'm just curious if",
            "start": 1728.16
        },
        {
            "text": "to write it down? No, I'll I'll remember. No, he's got he's a steel trap. After him. Oh, no doubt about it. Uh just one more question. I don't want to waste too much of your time. I'm just curious if you had any input on your character because the character evolved in a very dramatic way I think we would say right from kind of a tomboy to like you know more of a you know like a girly girl like the sisters were. Uh was did you have any input in that into like your characters development at all? Were the writers basically just like here's the script and this is what you're going to do now? You know I think good writers and I think we had I think we had a lot of action really great writers. Um and I think what they do is they sort of get to know you and they write for you. They write for your voice eventually. And so a character can start out one way and of course it did. I was like the scrappy like tomboy like like this sarcastic joke here and there. And as I evolved as a person and",
            "start": 1770.48
        },
        {
            "text": "your voice eventually. And so a character can start out one way and of course it did. I was like the scrappy like tomboy like like this sarcastic joke here and there. And as I evolved as a person and they sort of got to know me and my sense of humor they just started to write for me and I kind of am I was kind of sarcastic and kind of like off the cuff a little bit and kind of like can you believe it you know and that I think um so yeah I guess so. But I guess it kind of goes hand in hand too you know. Um, it was a pretty warm and friendly environment. Like it was pretty like family when I imagined it in my in my mind's eye. Yeah. It was the best place on the planet. And it kind of it I have to say like I I have very I have very very fond memories. Like it was cereal for breakfast, lunch, and dinner. We had a woman who was Swedish and she would lay like she was like our denmother and she would lay out like you know she had like soups she would make for for lunch and like I love custom",
            "start": 1811.84
        },
        {
            "text": "and dinner. We had a woman who was Swedish and she would lay like she was like our denmother and she would lay out like you know she had like soups she would make for for lunch and like I love custom soup. I love custom soups. Yeah, it was really nice. Well, Christine Leaken, yeah, thank you so much for joining us. Thanks for having me, everyone. Pleasure. Watch step by step. Trying to blow your minds. Download I think you 120% succeeded. I need I need time. I need download The Walking Dead. Uh follow her on Twitter. It's been up the whole time for we sell it as an audio podcast, too. We get every There you go. You got it. Nailed it. Yo, Laken. That's how it came about. Okay, just explain it. It worked. No, it was good. Cool. Thanks. All right. Thank you so much. On to the next topic. Okay, Nick, it's time for your topic. But of course, we started the show in an interesting fashion. So, as a reminder, this is the Game Over Gregie show every week. Four, sometimes five best friends get",
            "start": 1850.32
        },
        {
            "text": "Nick, it's time for your topic. But of course, we started the show in an interesting fashion. So, as a reminder, this is the Game Over Gregie show every week. Four, sometimes five best friends get around this table. There's five tonight. There were. Now, now it's gone. There's only four. We scared off Christine. You had to go. I know. If you missed it, we had Christine from Stepbystep on. You need to watch the episode. Um, we gather on this table each bringing a random topic of discussion for your amusement. If you like that, you get the show as an MP3 every Friday at gameovergy.bandamp.com for $1. starts the entire show uncut for your amusement. If we aren't worth the dollar in audio form, we totally understand. Wait a couple days and then starting on the beginning of the week, Sunday this week, but usually Monday, whatever, depending on how many topics we have, you go to youtube.com/gameovergy and each topic is broken out one by one as a topic video for your amusement. Then Friday,",
            "start": 1891.28
        },
        {
            "text": "week, but usually Monday, whatever, depending on how many topics we have, you go to youtube.com/gameovergy and each topic is broken out one by one as a topic video for your amusement. Then Friday, the whole show goes up. But you don't even have to worry about the whole show cuz you'll go by the whole show on bandamp.com. You get it there. It's all there, Tim. You buy shirts like teamfat districts.com/gameovery. You know, we also have a sticker. We also have stickers and coffee mugs. Coffee mugs. Coffee mug. We'll get some soon. I'm going to get you guys I'm getting you guys coffee mugs. Good store. Four of them. You can drink bourbon in it like an old man would. Okay. I don't know why I looked at you. I don't even know what to say. I'm still I don't know. You're like right now. You're literally This is what Vclemp looks like. VMP. Yeah. Remember that? No. Is that too old for you? That's a Saturn lab. I got it though. Thanks, man. Also, I started streaming on Twitch.",
            "start": 1931.6
        },
        {
            "text": "now. You're literally This is what Vclemp looks like. VMP. Yeah. Remember that? No. Is that too old for you? That's a Saturn lab. I got it though. Thanks, man. Also, I started streaming on Twitch. Twitch.tv/gameover. TV/gameovery. You get my streams every Monday 9:00 p.m. Pacific Standard Time. If you don't want to do that, I post them on youtube.com/gameovery every Saturday. So, there you go. Many ways to watch this channel. I know. Whoa. You like that? Saturday content. We're grown up. Saturday. We're all grown up. Well, I just want to say real quick before we even get into any topics that what a weird world we live in where you meet these people that were like random icons in your life where whoever they are, you know, like o over time that we're in a blessed kind of situation, a position where we can meet just the it's not like, you know, you're meeting like just random people that meant something at different points in your life. That's why I'm reeling right now cuz I know",
            "start": 1966.32
        },
        {
            "text": "position where we can meet just the it's not like, you know, you're meeting like just random people that meant something at different points in your life. That's why I'm reeling right now cuz I know everything about Stepbystep. I know you do. You're the biggest Step-bystep fan I know. And we have to we have to get her back so we can just do nothing but step-by-step Q&A for three, four, five hours at least. Maybe just throughout the first season. There needs to be a good like day or two like a summit. Yeah. Yeah. But we should surprise her now by bringing someone else in from the TGIF. We should probably just go to her wedding and podcast from it. That'd be amazing. Like she's walking in the aisle right now, folks. No, we don't. I mean, we'll just bug Patrick Duffy the entire Hey, Patrick Duffy. Hey, Patrick Duffy. Do you think you can get Patrick Duffy in this room? I think I I think we could. Do you think you can get Suzanne Summers in this room? That's getting harder. Do you think",
            "start": 2008.08
        },
        {
            "text": "Duffy. Hey, Patrick Duffy. Do you think you can get Patrick Duffy in this room? I think I I think we could. Do you think you can get Suzanne Summers in this room? That's getting harder. Do you think you start a YouTube channel though, so we got in there. Dave Koulier. Dave Kier. Dave Koulier and I are like, \"Honey, I'll watch this show. I need to watch this to I can't It's hard to believe that you watch TGIF and Boy Meets World.\" You did watch Boy Meets World on TGF or catch later. That sounds way later. See, the problem with Step by Step was that it was, if I remember correctly, it was later in the lineup and so I don't think I ever really made it too much. It was 9:00. See, I was more full house and then I'd watch Family Matters and then by then it was like, this is what I was telling when she was like, \"Yeah, you know, pizza every Friday.\" Literally, that's what the Miller household did. We My parents picked up Danny's pizza on the way home and I we would sit in the kitchen, eat",
            "start": 2050.16
        },
        {
            "text": "when she was like, \"Yeah, you know, pizza every Friday.\" Literally, that's what the Miller household did. We My parents picked up Danny's pizza on the way home and I we would sit in the kitchen, eat it, and then watch TGIF. And I mean, we every [ __ ] show on TGF was TGIF was consumed in one block. You know what I mean? And even if there was ones I didn't like that much like Full House, I still watched it. The 9:30 slot was the weak slot because that was when all the shows that came and went network can handle. But that wasn't that perfect strangers. She was saying that was like Perfect Perfect Strangers were in there in the beginning. So the the classic the classic lineup included Full House at 8 and then Family Matters at 8:30. Um but Perfect Strangers was in there first because Family Matters was as we've talked about many times a spin-off of Perfect Strangers. So like when it first started it was like you know Full House and Perfect Strangers and all those kind of things. But the",
            "start": 2088.36
        },
        {
            "text": "Matters was as we've talked about many times a spin-off of Perfect Strangers. So like when it first started it was like you know Full House and Perfect Strangers and all those kind of things. But the the classic lineup to me is Full House at 8:00, Family Failing Matters at 8:30, Step by Step at 9:00. And then there was always some roving [ __ ] at 9:30, and then uh 2020 was on. Yeah. At 10. Damn. How do you How do you remember that? I mean, it was [ __ ] TGIF was my life. It's all we did. Yes. I remember drawing comics, my own comics, writing my own stories, and watching it. And then, but I don't remember when they were on. Like, I don't remember the time slots. Like, I used to I remember vividly watching, I think it was Friday nights. I couldn't be wrong. They moved it around a bunch. Like I would watch uh the X-Files and then Brisco County Jr. Right. Those were on like right and I was like this is awesome and then they can cancelled Brisco County Junior and I was like super pissed",
            "start": 2124.4
        },
        {
            "text": "I would watch uh the X-Files and then Brisco County Jr. Right. Those were on like right and I was like this is awesome and then they can cancelled Brisco County Junior and I was like super pissed about that. Then the XFiles like Tuesday like oh the show's on his way out. That's all I remember. I don't remember what night I TJ that makes that makes sense that that matters but then I because I've seen Stepbystep and Full House makes sense on I've seen those on syndication so much that I couldn't tell I couldn't I couldn't I can't even tell you what channel they're on. See me is it's like I feel like I missed a huge thing. I would have said NBC. Channel 7 New York. my channel. Full House isn't that big of a thing in those shows because I think now those are on Nick at Night and stuff. Growing pains that resonates with me because of Nick at Night, you know what I mean? So, I got Boy Meets World and a generation before, but I missed that the Full House generation because that was during",
            "start": 2159.76
        },
        {
            "text": "pains that resonates with me because of Nick at Night, you know what I mean? So, I got Boy Meets World and a generation before, but I missed that the Full House generation because that was during the the now Nick and Knight kids are watching that. Yeah. Yeah. The weird thing is is that first there's two things that are weird. The first thing that's weird about this, we haven't even started any tones. I like how this is like the postmorte on Christine Lean. We have I mean we have to have when we do the step-by-step summit, we have to have the the the post more. Is someone out there taking notes? Please take notes on these points. But the weird thing is that on like I feel old as [ __ ] because Full House is on Nick at night and I I watch it I'm like why is this on Nick at night? Like I remember Nick at Night when I was a kid being like Newart and and Yeah. I love Lucy and My Three Sons. Yeah. But then you think that Well, when I was watching New Hart in 1992 on Nick at Night, well,",
            "start": 2198.56
        },
        {
            "text": "remember Nick at Night when I was a kid being like Newart and and Yeah. I love Lucy and My Three Sons. Yeah. But then you think that Well, when I was watching New Hart in 1992 on Nick at Night, well, that that show was 12 years old at that time. So, it's like not that different, I guess, is what I'm saying. But like I just don't feel like Full House is Full House is good in that really bad way because we grew up with it, but it's not a classic. Like Nick and I used to have good shows on it like Happy Days and and All in the Family and the Jefferson. Those are classic. I know. Like, but there's no classics anymore. I'm watching this and it's like it's like [ __ ] Everybody loves Raymond and Full House or [ __ ] like that. It's like what is this? Oh, Nick. Sure. But there are still classics that are in syndication, right? Like we watch Seinfeld all the time. So, I would say that's a classic. That's like really when I But that's like that's it. That might be the last of it though. But",
            "start": 2235.76
        },
        {
            "text": "that are in syndication, right? Like we watch Seinfeld all the time. So, I would say that's a classic. That's like really when I But that's like that's it. That might be the last of it though. But Seinfeld's one of those things where like you you you watch it and no matter when it's on it gets you like maybe not for you Tim because I don't know if you were a big Seinfeld fan but like if you went through the Seinfeld generation the three days ago my wife was flipping around channels and Seinfeld was on. I was like and it just stopped. She just stopped flipping all of a sudden. I was like damn it got us because it was about getting a new apartment and we're all about getting a new apartment right now. It was a whole thing. Uh, but no, Greg, that was that was that was awesome and quite the surprise. Yeah, literally I was I was aruck for like five seconds where I don't know. I didn't watch step by step and you just kind of stared for a while because my thing was like unbelieving",
            "start": 2273.04
        },
        {
            "text": "the surprise. Yeah, literally I was I was aruck for like five seconds where I don't know. I didn't watch step by step and you just kind of stared for a while because my thing was like unbelieving unbelievable and then I was like I looked at I was like holy crap. I looked at the picture of her I was like my god. Yeah. A she looks nothing like the picture the first picture that comes up when she was like 11. Yeah. It's funny how the years change you. I literally I looked at her I was like there's no way you were this weird tomboy cuz she's gorgeous first of all. Um and second of all I was just like it it that that broke my sensors after this week that we've all had and it's been a very long week. That just po like something in my brain popped and I was like I literally just went off for about 5 seconds and Tim's like uh I saw you like got I went into panic mode panic mode. It was too much. It was too much. I don't know. Like like Tim was saying like he's never seen me broken like that",
            "start": 2307.12
        },
        {
            "text": "5 seconds and Tim's like uh I saw you like got I went into panic mode panic mode. It was too much. It was too much. I don't know. Like like Tim was saying like he's never seen me broken like that before. You're the look on your face and I wish we could have seen it cuz you were behind the camera. The look on your face was instant recognition. The happiness of a child mixed with utter regret for not having shown up 20 minutes early cuz we were I looked at the clock. You were you were like 20 minutes into it and she was kind enough to give us an extra 10 minutes which was awesome. But the look on your face was all those things. It's like when you take all the jelly belly beans and just cram them into your mouth. Like that's the sensation that is going through your brain right now. I'll take your word for it, I guess. You get the weird You get the weird one in the I feel so I'm glad I'm glad she was cool. Like I didn't I hope that the show went on without me. I I was great. I don't want",
            "start": 2346.96
        },
        {
            "text": "your word for it, I guess. You get the weird You get the weird one in the I feel so I'm glad I'm glad she was cool. Like I didn't I hope that the show went on without me. I I was great. I don't want to I didn't want to be rude to anyone to We talked a lot about step by step. So you It's there for you. I'll have to watch it and like we have we have to get her back, right? Because we have to do the Stepbystep Summit. And maybe we can get, you know, some other people. You know, I don't see why we can't have Patrick Duffy on the show. I'm fine to do a road tour to go to every member of Stepbystep's house. Go to YouTube Space LA and get them all to come to us. Can we do like you did on Up at Noon where with the Smallville cast where we have the pictures of step bystep board. Yeah. And we just cross them out as we go. Can we just make the TGIF board? Yeah, we should just do a TJ idea. That's going to be a huge board. That's going to be a wall. But let me let me pitch this idea. That's a",
            "start": 2388.0
        },
        {
            "text": "cross them out as we go. Can we just make the TGIF board? Yeah, we should just do a TJ idea. That's going to be a huge board. That's going to be a wall. But let me let me pitch this idea. That's a great idea. That's when it's going to get like right now we bring people to our house and record a show with them and everybody's been cool so far cuz they come in and we're normal. We have a dog and a girlfriend walking around. when we bring them in and their photos are panicked on the wall with big X's through them and and there's like strings connecting different characters to it. So, I'm going to put I'm going to throw this out at you. Mhm. Did you watch The Real World or Road Rules? Yes. Remember when they used to do the reunion show? Yeah. Do like bleachers of people that have the whole cast on there. What if we went on the road, all four of us, down to the YouTube creator space and invited all of them to show up at the same time? I love this. Can we just like Can we get No, we'll get",
            "start": 2420.08
        },
        {
            "text": "on there. What if we went on the road, all four of us, down to the YouTube creator space and invited all of them to show up at the same time? I love this. Can we just like Can we get No, we'll get like we'll get mics. It's not a big deal. We can rent mics. We can rent all this equipment. It might cost a little money. We'll figure out later. But and I even want to I want to recreate all this this majestic set that you see behind you that costs hundreds of thousands of are real brick walls. That's a real brick wall right there. That's real slate flown in from Nebraska. I don't know. I don't know where slate comes from, but I'm I'm into this. I'm I'm amped on this idea. All right, let's do it. Okay. I actually got excited when you started talking about it about like Colin doesn't get excited for anything and islanders. But I'll be honest with you, Colin, that to me will just be a practice for the full house reunion show that we do on the Game of Show. Oh my god. Can you imagine? Can you",
            "start": 2456.8
        },
        {
            "text": "for anything and islanders. But I'll be honest with you, Colin, that to me will just be a practice for the full house reunion show that we do on the Game of Show. Oh my god. Can you imagine? Can you imagine having John Stamos's beautiful face in this? We probably can't get Stamos, but we can get Lorie Laughlin. Oh, we can get the We can get Uncle Joey. Then I'm in Dave Koulier. We can get Dave Kier. We can get we can probably get Bob Saget cuz he's by all accounts pretty cool. So he might if we like approached him right like we came at him correct so to speak. You know what I mean? Like what up? What up? What up? He probably come Cameron might be a little hard to get back. Candace Cameron is so the funny story. Two funny stories. A Candace Cameron uh I'm in love with her. B uh uh not so much a story as a statement. That's a statement. She's married to I think uh Pavl Burer who is a famous a retired famous hockey player. He sounds like a hockey player. Yeah, he does. So Colin's gotten",
            "start": 2501.28
        },
        {
            "text": "a story as a statement. That's a statement. She's married to I think uh Pavl Burer who is a famous a retired famous hockey player. He sounds like a hockey player. Yeah, he does. So Colin's gotten in there. He can just talk hockey to her. He could. So you talk hockey to her and then she comes over on the show. How does this I'll be like I know I know Pavl Bur who's a great hockey player. I'll tweet that at her and then and she'll be like, \"Oh, that's great. Can I be on your podcast?\" And then we'll be like, \"Sure, come on over to the house.\" Boom. And you're going you're all we don't have to overthink it. All right. I'm excited about this. We'll call it the TGIF lineup times two or version two. I don't know which one's better. I like step by step by step. Step by step by step is awesome. We got to get that. I love the idea instead of having the pictures that are already here. What we should do is make a wall where we put the picture up. Oh, like right here on this wall. Yeah. Like when",
            "start": 2549.44
        },
        {
            "text": "got to get that. I love the idea instead of having the pictures that are already here. What we should do is make a wall where we put the picture up. Oh, like right here on this wall. Yeah. Like when we where like when they come when we get them, we put the picture up. We should actually just do that for all the guests we have. This is how lame we are. Normal shows would have like head shot printed out for them to sign that we would then frame and put on the back of the wall or somewhere like on the hallway or something like that. So all other guests that came in got super excited that they were like, \"Holy crap, I'm sitting where the Michael Rosenbomb sat like in the middle.\" Mhm. Did the dog fart. Yeah. During my speech, this was my This was my How to impress guests at our house. No, just it would. Yeah, that's awesome. We should hang them in all in Colin's bathroom. So they want to use the bathroom like, \"Oh, this is the bathroom. You should Tyler use the on the back of the door.\"",
            "start": 2585.76
        },
        {
            "text": "it would. Yeah, that's awesome. We should hang them in all in Colin's bathroom. So they want to use the bathroom like, \"Oh, this is the bathroom. You should Tyler use the on the back of the door.\" Like you slam it and there's just five 8 by10s like just on the back of the door. They all like jiggle together. That'd be amazing. [Music]",
            "start": 2622.56
        }
    ]
}