{
  "id": 2879,
  "video_id": "3gviBKm3kAU",
  "show_name": "Kinda Funny Games Daily",
  "hosts": ["Greg Miller", "Andrea Rene"],
  "title": "The Last of Us 2 Rumors, Destiny 2 DLC - Kinda Funny Games Daily 08.04.17",
  "description": "Is Ellie headed to Seattle? Is Andrea OK with Destiny 2 DLC being so important? Let's discuss!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
  "published_at": 1501880278,
  "duration": 3474,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Welcome to Kinda Funny Games Daily for Friday, August 4th, 2017. I'm one of your hosts, Greg Miller, alongside the busiest lady in the business, Andrea Rene. Hello, how are you? I am doing wonderfully. It's Friday, finally. This week has been long. We've seen a lot of each other this week, right? That's why it's been so long. No, no, it's been great having you around 'cause Danny O'Dwyer is a deadbeat. New coffee mug again, one of the other ones you've dropped off here. Yes, show it to me. What's it? It just says A for Andrea. For Andrea, I get it. Andy, you can use it sometimes if you want to. Oh wow, what a what a nice little nod to Andy Cortez over there. All what are you gonna play this weekend? Um, I'm going to play Prey this weekend. Okay. I'm going to probably play some more Fortnite. Um, I saw John start playing Patapon last night. Oh yeah, you did. So I'm going to try that out this weekend as well. Yeah, and did he have fun? Did he enjoy it? Was he did does he need help? Does he need coaching? I can come",
      "start": 1.06
    },
    {
      "text": "playing Patapon last night. Oh yeah, you did. So I'm going to try that out this weekend as well. Yeah, and did he have fun? Did he enjoy it? Was he did does he need help? Does he need coaching? I can come teach him. I heard him grumbling something about calibration. Oh, this is a weird one. This is what I've been talking about in the show because a few people have written in or not. I've got a tweet and I've got a question on the show about like, hey, I've had trouble. Yeah, there's lag on it and there wasn't for me. So my question for you would be, are you using a PlayStation 4 Pro and are you using a 4K TV? Not using a 4K TV. Yes, we have a PlayStation 4 Pro. Okay, interesting, interesting. 'Cause like, I don't get me wrong, that doesn't solve that. It was just when I are you saying that the other I haven't looked at the complaints that 4K and PS4 Pro are tend to be the ones that are having trouble. So I play other PS4. No, it's I don't know 'cause I played it on our PlayStation 4 Pro for the stream and that I believe",
      "start": 54.72
    },
    {
      "text": "the complaints that 4K and PS4 Pro are tend to be the ones that are having trouble. So I play other PS4. No, it's I don't know 'cause I played it on our PlayStation 4 Pro for the stream and that I believe that TV's 4K and it was fine. But then when I when I read the question, I was like, I didn't have any problems and at home I played on regular PS4. I didn't have any problems and it was just like the IGN Italia. Well, for the record, I don't want to say that he had problems 'cause I had my headphones on. All I heard was like, grumble, grumble, grumble, grumble. Maybe John's just bad at rhythm games. Now you think the guy who worked on the Harmonics team and shepherded many Rock Bands and Dance Centrals out the door? Problem. He left it behind. He hung it up. I'm going to let you picked that fight with him. Go ahead, John Drake, prove me wrong. All right, Platinum Patapon. So good at rhythm games, but you can't do this one. If you didn't know, ladies and gentlemen, this is Kinda Funny Games Daily each and",
      "start": 92.24
    },
    {
      "text": "him. Go ahead, John Drake, prove me wrong. All right, Platinum Patapon. So good at rhythm games, but you can't do this one. If you didn't know, ladies and gentlemen, this is Kinda Funny Games Daily each and every weekday here on a number of platforms. We run you through the video game news you need to know about, getting really in-depth and nerdy with the news, answering your questions, reading your new segments, and having a good old time with you. If you like that, you can watch us record it live at Twitch.tv/KindaFunnyGames. Of course, we don't interact with the chat because we're making a podcast. You need to keep us honest. You can go to kindafunny.com/yourewrong. Tell us what we screw up as we screw it up. At the end of the show, we go through all the notes we screwed up. Um, you can also, of course, get it later though, YouTube.com/KindaFunnyGames and podcast services around the globe. No matter where you get it, thank you for listening to the show, enjoying the show, watching the show. It would mean a lot",
      "start": 136.52
    },
    {
      "text": "though, YouTube.com/KindaFunnyGames and podcast services around the globe. No matter where you get it, thank you for listening to the show, enjoying the show, watching the show. It would mean a lot to me if you went to the other platforms, subscribed, left a review, did whatever you needed there. So close to a thousand reviews on iTunes. He said without having actually checked that number since Monday. Maybe we've passed it, who knows? Go, go, go. kindafunny.com/yourewrong. You can tell me how many iTunes reviews we have up right now. You know what I mean? Uh, piece of housekeeping news for you. Monday, right after Kinda Funny Games Daily, we are streaming Episode One of Batman: The Telltale Series Season 2 with Troy Baker, Anthony Carboni, and Ryan Gruber. That's Batman and The Joker right here on the show with us, uh, playing some Batman, making some choices, seeing what's up. I think I have to play on PC 'cause the PlayStation 4 won't I won't have a code yet, which is exciting because then I get to be really mean Batman because your save isn't going",
      "start": 174.92
    },
    {
      "text": "choices, seeing what's up. I think I have to play on PC 'cause the PlayStation 4 won't I won't have a code yet, which is exciting because then I get to be really mean Batman because your save isn't going to import, right? Exactly. And my save on PlayStation 4, I'm nice guy Batman. Well, not nice. I'm Batman. I'm the Batman that Batman should be, you know what I mean? But now I get to go be bloodthirsty Batman where I break people's arms and hit him with sticks and do all the mean things. See what that does. I think you're going to enjoy yourself. I will. I probably will. For now, let's begin the show with what for what is and forever will be. I looked over and saw Cool Greg prepping the sound machine. It threw me with what is and forever will be the Roper Report. Let's see. It's very faint. Time. I can't hear it. Time. It was time for some news. Andy, go do it. Go one more time. What is and forever will be the Roper Report. Time for some news on a Friday. There are, hold on, I kept adding stuff, four items on the Roper Report.",
      "start": 212.08
    },
    {
      "text": "it was time for some news. Andy, go do it. Go one more time. What is and forever will be the Roper Report. Time for some news on a Friday. There are, hold on, I kept adding stuff, four items on the Roper Report. Cool Greg, there's four items on the Roper Report. Oh, Bakers doesn't. Sorry. I got Cool, you're learning. This is the first day Cool's been, you know, driving the shows. This is the first day Kevin is not here at all to like poke him with a stick and make sure everything out. I understand there's a lot of moving parts over there. I hate having to do that when when Kevin's not here. So I'm glad Cool Greg's there. First story, I got a Destiny 2 dump for Andrea Rene. I saw this two nuggets at Destiny 2 information here. You first off, PC streaming going to be weird. If you want to stream the game to the old Twitch platform or some Mixer, you what can you you can use Mixer for PC games as well, right? I've never tried. Exactly. But now we're going to get 3,000 people writing in from Mixer. Yeah, you can use PC games. I",
      "start": 254.64
    },
    {
      "text": "platform or some Mixer. You what can you you can use Mixer for PC games as well, right? I've never tried. Exactly. But now we're going to get 3,000 people writing in from Mixer. Yeah, you can use PC games. I know. Uh, Bungie has put up this information about streaming Destiny 2 from a PC to help ensure that every player will have a fair shot at fun and glory in Destiny 2 on PC. We resist attempts by third party applications to insert code into the game client. This may result in incompatibility between Destiny 2 PC and the features of common third party applications. What this means, and there's a whole bunch of stuff, but I've popped out the big ones for you. The game capture mode of applications such as OBS and XSplit, arguably the two biggest streaming I don't think it's arguable. I think that's probably fact. Well, that's one of those I some somebody someone going to argue it. Game Live or something. OBS and XSplit is not supported. The following methods are supported for capturing video of Destiny 2 and on PC to",
      "start": 301.44
    },
    {
      "text": "that's one of those I some somebody someone going to argue it. Game Live or something. OBS and XSplit is not supported. The following methods are supported for capturing video of Destiny 2 and on PC to capture while playing an exclusive full full screen Hardware capture through methods such as Elgato, AverMedia, or a dedicated streaming PC is supported. Uh, Nvidia ShadowPlay and AMD ReLive are supported to capture while playing in window mood mode, including borderless full screen. OBS and XSplit screen capture mode is supported. OBS and XSplit window capture mode is supported. Now that's confusing to me, of course, because Kevin sets everything up and I play PC games. As somebody who sets this up for What's Good Games, this is not that shocking. A lot of PC games are the exact same way that this is not like like, oh my gosh, how how dare they? 'Cause it works with OBS and XSplit. It just doesn't work in the way that OBS and XSplit see it as its own thing. It doesn't see it pop up as Destiny 2. You have to window",
      "start": 345.72
    },
    {
      "text": "like, oh my gosh, how how dare they? 'Cause it works with OBS and XSplit. It just doesn't work in the way that OBS and XSplit see it as its own thing. It doesn't see it pop up as Destiny 2. You have to window it. Correct. Yeah, well, I mean, and OBS is what we use. We use OBS Studio. It's a it's finicky. It's great software. We love using it, but it's got some quirks every once in a while. And um, for us, when we are streaming a a PC game like this, we genuinely have multiple things open with OBS, like so we can monitor Twitch chat and things like that. We have other applications going. We rarely play in full screen anyway. We're always in windowed. I don't I don't know how other streamers out there prefer to do theirs, but that's how we do ours. I think when I when I initially saw, of course, 140 character version of this going around that it doesn't support OBS or XSplit, you're like, what the ****? And then to jump into, you're like, oh, it doesn't support it in quotes in the way that it doesn't see it as its own feed to",
      "start": 392.6
    },
    {
      "text": "going around that it doesn't support OBS or XSplit, you're like, what the ****? And then to jump into, you're like, oh, it doesn't support it in quotes in the way that it doesn't see it as its own feed to say Destiny 2. You can still window it and do it. It's just not that integrated function because they don't want to let some else come in and integrate their code. Yeah, well, I've been having problems with Skype being a thing that I have to use in Window mode too. So streaming anything's a nightmare. Yeah, streaming streaming is hard. You guys stream is out there to understand. Meanwhile, voice communications, uh, there's more stuff there too. Who's talking in visual notification features such as those provided by Discord or Mumble are not compatible with Destiny 2. Notification features may still be provided through third part through the third party application. Again, you can still use those things while you play Destiny 2. It's just not going to give you the visual that like some programs allow you",
      "start": 435.0
    },
    {
      "text": "through third part through the third party application. Again, you can still use those things while you play Destiny 2. It's just not going to give you the visual that like some programs allow you to use when they play their game and do these different things. Yeah, it's all it's all not a lot of nothing, but it's a Halo right now that I don't think's as severe as people are making it out to me. No, I I don't think there's a reason to make a fire over this. This is this is not that big of a deal. Yeah, but it's Destiny 2 news and we're excited because Destiny 2 is getting closer. Yeah, and it's the first time it's on PC. The beta is almost here. Don't play it on PC though. Come on now. You can't we can't full screen it, right? That's the big that's what Destin put out. Destin Legarie from IGN was like, I don't well, it was actually he was talking to TotalBiscuit who was like, TotalBiscuit's like, don't make people jump through hoops for this Destiny 2. Destin was like, I don't it's not that bad, you know what",
      "start": 471.08
    },
    {
      "text": "it was actually he was talking to TotalBiscuit who was like, TotalBiscuit's like, don't make people jump through hoops for this Destiny 2. Destin was like, I don't it's not that bad, you know what I mean? Like it really is not. To which my whole my only my only and I said I was like, I don't have a horse in this race at all 'cause I, you know, I don't know ****. I don't even know how to turn out to PC most of the time. But I thought like, isn't it just the disappointing factor of like, well, I want it in full screen because it's supposed to look so pretty. It's supposed to run so well. Here's the thing about that. Here we go. Lay it on me, Andrea Rene. When you're talking about graphical fidelity and streaming, so few people have access to the kinds of internet speeds that you need to get the full graphic experience from a stream anyway that I don't know why it would be such a big deal. The the vast majority of people who are streaming this game, the people who are on the receiving in aren't getting it in",
      "start": 509.84
    },
    {
      "text": "from a stream anyway that I don't know why it would be such a big deal. The the vast majority of people who are streaming this game, the people who are on the receiving in aren't getting it in 4K, sure, right? They're may be getting it in 1080p, but most people are watching it in 720p more than lik on their phone, on their iPad, you know, if they're watching it on their console or on their computer. Like, but even if you're watching it on a a wired internet connection, you're still probably not watching it in its full resolution anyway because you're streaming it. Sure. I think the important part is that you can play this game when you're by yourself full screen and get the the graphical fidelity. That's more important for the, you know, development team to focus on than how it's going to stream. But I get that streaming is a huge part of development development now and more and more studios are taking into account how is this game going to stream? We just talked about the yesterday, right? Friday the",
      "start": 546.52
    },
    {
      "text": "get that streaming is a huge part of development development now and more and more studios are taking into account how is this game going to stream? We just talked about the yesterday, right? Friday the 13th quote from Wes Keltner of like, that was the deal. Didn't matter. It was, is our game fun? Is it going to stream well? Right? And and Destiny has a very active and very large streaming community. And so I would like to hear from people out there if you are Destiny streamers or you consistently watch Destiny streamers, you know what resolutions you guys watch it in regularly, you know what resolutions important to you. You guys can write into us at KindaFunny.com/KFG. Let us know and we can, you know, hopefully talk about it next week. My thing about it is when I was making the case of it's beautiful, right? That isn't that why people are upset? It wasn't at all. I mean, it wasn't at all what other people are seeing on the other end of the stream. It was the streamer preference of I'm playing it on PC, but I",
      "start": 586.68
    },
    {
      "text": "that isn't that why people are upset? It wasn't at all. I mean, it wasn't at all what other people are seeing on the other end of the stream. It was the streamer preference of I'm playing it on PC, but I have to window it so it's not looking as good, right? That's the only thing I'd see from it. And then my question for you is somebody who is entrenched in the Destiny community, do you see Destiny PC being, and I don't want to say a big deal because I know how many people play PC games, but I feel like did Destiny 1 blow by a lot of people like, well, I only play on PC and I don't have any like I have no console. I don't want to jump into a console. I only like PC gaming. Um, I would say there's the audience out there who has been waiting for Destiny on PC is larger than you think it is. Um, I think there's a lot of people who are actually going and I've I've talked to several people who are switching platforms specifically to play on PC. You **** Excel dorks. You want to see what Clippy has to say about",
      "start": 626.0
    },
    {
      "text": "a lot of people who are actually going and I've I've talked to several people who are switching platforms specifically to play on PC. You **** Excel dorks. You want to see what Clippy has to say about playing Destiny 2. It I can't deny that when I looked at it's pretty the PS4 version, the PS4 Pro version of Destiny 2 and the PC version, there was no question the PC version looked better. But that's PC gaming in general. I don't think that's shocking to anybody. Watch mon falls out. Uh, in other Destiny 2 news, I'm going to jump over to GameSpot over there. They did the whole they listen in on the Activision's earning call. So they have some stuff from CEO Eric Hirshberg. Uh, basically the DLC plans for Destiny 2's sound pretty sick. Reading from GameSpot, Destiny 2 will be supported with multiple expansions after launch. While these have yet to be fully detailed, Hirshberg stressed that Destiny 2's expansion content is incredibly important. Quote, finally, and maybe most importantly, with a game like this, Destiny is",
      "start": 665.12
    },
    {
      "text": "after launch. While these have yet to be fully detailed, Hirshberg stressed that Destiny 2's expansion content is incredibly important. Quote, finally, and maybe most importantly, with a game like this, Destiny is so engaging that the follow-on content is almost as important as the as is almost as important, if not as important as the main game, Hirshberg said. Hirshberg has been uh open in admitting that Bungie did not release expansion content for Destiny 1 fast enough to meet demand for the sequel. Activision brought in studios like Vicarious Visions and High Moon Studios to work alongside Bungie. In Hirshberg's words, he said Activision is widening its stable of developers to keep up with the and for more content. I have a little bit of a issue with this. Why? You don't like these you don't like these other people coming in and muddling up the waters? No, I'm happy for other studios, especially since those two studios have made great games. So I'm happy for them to come in and work on content. My problem is that Destiny",
      "start": 713.48
    },
    {
      "text": "in and muddling up the waters. No, I'm happy for other studios, especially since those two studios have made great games. So I'm happy for them to come in and work on content. My problem is that Destiny Vanilla was severely lacking in content. And the fact that they're breaking out DLC and intentionally making these expansions really robust and not putting that content into the base game is my problem. Okay, I spent a lot of money on all of the Destiny expansions, buying multiple Destiny discs, getting the collector's edition. I probably spent at least $300 on Destiny. Nice. Over a couple of years. Yeah, that's a lot for a game, especially when you compare it to a game like GTA V. Was like, hey, for 60 bucks, you get it all. Yeah, you know. And so I'm frustrated that Activision is saying this headline on GameSpot says Destiny 2 DLC could be as important as the main game. Why is that a thing? Your DLC should never supersede your base game in my personal opinion. I think it's a nice compliment and I really enjoy",
      "start": 754.04
    },
    {
      "text": "says Destiny 2 DLC could be as important as the main game. Why is that a thing? Your DLC should never supersede your base game in my personal opinion. I think it's a nice compliment and I really enjoy it. And I actually thought the expansions were better than the the base game. And that that is a hard thing for me to square because if I'm paying $60 or more in some territories for a game and you're withholding giant chunks of the content out, that's not okay. Interesting. I am all for DLC. Add to the story. Maybe you need more time to work on stuff. When you're working on a sequel that was already pushed back a full year and you're telling me if that's going to be the excuse as to why it's DLC and not in the game, I'm going to have a hard time believing that. But like, I thought it was a good argument that you made about like, oh, well, it has to be DLC because they need more time to actually like make it functional. Sure, that makes sense. But for this case, is that the case? See, I like this one 'cause I",
      "start": 805.52
    },
    {
      "text": "that you made about like, oh, well, it has to be DLC because they need more time to actually like make it functional. Sure, that makes sense. But for this case, is that the case? See, I like this one 'cause I think it's an interesting model of all right, Bungie, you're making Destiny 2. Make your game do this different stuff. Y'all **** up how you did Activision expansions before. So we're getting these two other studios that we like and charging them with making expansion content that we can see in the first the first wave in six months, the next one six months after that is what and this is in my head. They they haven't announced scheduling or anything like that. That's the way I'm seeing it. I'm hoping that Destiny 2 when we get it, especially based on the Destiny 2 event, which was like, we heard you. There is more content in this. There is, but they haven't shown any of that content. I don't want to know. I just want to get and play. I don't care. Yeah, but I need I as I need something. I need ****. You do. You're",
      "start": 855.24
    },
    {
      "text": "content in this. There is, but they haven't shown any of that content. I don't want to know. I just want to get and play. I don't care. Yeah, but I need I as I need something. I need ****. You do. You're not going to play on day. Look, full stop. I'm buying everything like you all know that. Yeah, but I feel compelled to say that I'm kind of irritated by the fact that Activision is withholding DLC content because the base game in Destiny was not good enough. Sure, it got excellent, but it wasn't good enough. And from what I've seen from Destiny 2, it really feels like 1.5. And the fact that they're holding content for expansions makes me go, but are they holding it or working on it? That's the thing. I still working on this game for a couple of years at this point. Sure. But when did they bring in you think Vicarious Visions and High Moon Studios for this? I don't know. Should we ask them? We that'd be nice. Yeah, that'd be the easiest way. I'm giving benefit of the doubt that it was Destiny 2 or Bungie do this for Destiny 2. They",
      "start": 892.28
    },
    {
      "text": "and High Moon Studios for this. I don't know. Should we ask them? We that'd be nice. Yeah, that'd be the easiest way. I'm giving benefit of the doubt that it was Destiny 2 or Bungie do this for Destiny 2. They did. It gets pushed back a year. They're still working on it. They finally figure out their systems, how the characters play, work this way, what worlds they are doing. And then you talk to somebody else about like, cool, Vicarious Visions, High Moon Studios, what are your ideas for what you'd want to do? You talk to somebody from Bungie. You see how that hits with with the schedule and keep going that way. 'Cause I don't think there was ever going to be a time where cool, we want to put these things into Destiny 2 as the base game. Like we want you to have these missions from the get-go. But I say that hoping that it's not Destiny 1 where it is like, oh, this is it. I'm back on the **** moon. But trolling, great. Okay. Yeah, I I'm really deathly afraid that that's what it's going to be. And I'm in a position of privilege where I can afford to",
      "start": 942.44
    },
    {
      "text": "where it is like, oh, this is it. I'm back on the **** moon. But trolling, great. Okay. Yeah, I I'm really deathly afraid that that's what it's going to be. And I'm in a position of privilege where I can afford to buy all of the expansions and I can afford to wait. But for people out there that only can buy maybe a handful like two or three games a year or less, like, why should they have to be forced to buy all of these expansions to get the best experience? That's true. I mean, I and I'm usually the person who's like, but the devs need money too, right? Like I am that person on this show. But in this case, Activision, they're fine. They have enough money. They're good. They could put more in the base game and give it to players. Okay, we'll have to see. That's all I'm saying. We'll see in September how much content's in there. We'll go from there and see if we should be pissed or happy. Okay, I don't want to be pissed, Bungie. I really love your game. Well, you're going to buy it all anyway. You want to you're just going",
      "start": 979.88
    },
    {
      "text": "in there. We'll go from there and see if we should be pissed or happy. Okay, I don't want to be pissed, Bungie. I really love your game. Well, you're going to buy it all anyway. You want to you're just going to buy it all. He when you give the money. Uh, sticking with this Hirshberg fellow on the same Activision's earning call, GameSpot broke out another story about what Crash's success means. We talked about this yesterday, a Kinda Funny Games Daily where we were hypothesizing, but we had when while we were hypothesizing, the truth got published. So jumping in there to another quote, quote, we knew that there was a passionate audience out there for Crash. Full disclosure, myself among them. But we had no idea. It's hard to tell if if that that's a vocal minority or that's a real mass audience until you put something out there. Crash has surpassed all of our expectations by a pretty wide margin. So this is a strategy that clearly has our attention. And while there are no new announcements today, I think you I think",
      "start": 1024.84
    },
    {
      "text": "out there Crash has surpassed all of our expectations by a pretty wide margin so this is a strategy that clearly has our attention and while there are no new announcements today I think you I think you can be confident there will be more activity like this in the future with more great IP the the other opportunity Beyond remasters is to look at some of our classic IP and ask whether or not it can be reborn as on a new platform like what we're doing with Skylanders on mobile our IP library is an asset that when done right can be very powerful Spyro's coming huh it's confirmed the one thing that gets me excited is when Tim brings up Crash Team Racing because I love kart racers and it's a kart racer that passed me by that I never played and I know so many people love if they put that back out remastered I'll put up with Spyro being back cuz Spyro always sucked full stop he was a little purple **** Dragon we didn't need I was happy to see him banished to the land of Skylanders and then",
      "start": 1062.76
    },
    {
      "text": "remastered I'll put up with Spyro being back cuz Spyro always sucked full stop he was a little purple **** Dragon we didn't need I was happy to see him banished to the land of Skylanders and then over you know over overshadowed by all the Skylanders but if I got to put up with another goddamn Spyro game to get Crash Team Racing fine I have some news for you Greg oh God no you do not have to play Spyro if it comes out no one's going to force you to do it no it's not about playing it it's about seeing it it's about hearing about it all the time having this damn Dragon walking around no but he's so cute yeah here we go see it's already starting Jen's a big fan too I'm never going to get away from this thing just succumb it'll be okay number three The Last of Us two might be in Seattle at some point maybe during the game uh I got this from Kotaku but a redditor has a bunch of concept art comparing real Seattle parking meters parking signs and even the parking garage that's in concept",
      "start": 1105.0
    },
    {
      "text": "some point maybe during the game uh I got this from Kotaku but a redditor has a bunch of concept art comparing real Seattle parking meters parking signs and even the parking garage that's in concept art that Naughty Dog put out that make it all seem very much that yes this is set in Seattle uh which is fascinating I always like a good deep dive into concept art and Easter eggs and stuff to that effect but it's cool I doubt the whole game's in Seattle you know what I mean like the when we played Last of Us right it was a cross country journey so Last of Us two I would assume probably something similar of we're on the we're out there doing a whole bunch of different things but Zack W. Carpenter rode into KindaFunny.com/kfgd just like you can it says good day GNA according to Kotaku some people are predicting that The Last of Us two will visit Seattle my question for you is what other cities would you like Naughty Dog to have Ellie and Joel or Ghost Joel visit keep keep on Cluster Trucking party mode up at YouTube.com/KindaFunnyGames",
      "start": 1146.96
    },
    {
      "text": "people are predicting that The Last of Us two will visit Seattle my question for you is what other cities would you like Naughty Dog to have Ellie and Joel or Ghost Joel visit keep keep on Cluster Trucking party mode up at YouTube.com/KindaFunnyGames he says thanks Zack W. Carpenter do you care where The Last of Us goes nope yeah see that's the thing where it's like I when this pops I was like oh that's a cool and I'm like oh wait no The Last of Us one went through so many major cities and things and I just was fine with it I don't and it was like I don't even really remember I remember the Colorado one cuz they went to the a university there and went through like the medical department or whatever but it's just like whatever go wherever you want to go I don't care I remember before Fallout 4 was announced like in the years preceding that announcement there was all this speculation about it being at you know MIT and Boston and all that stuff and I was like cool awesome uh is there more to",
      "start": 1189.76
    },
    {
      "text": "was announced like in the years preceding that announcement there was all this speculation about it being at you know MIT and Boston and all that stuff and I was like cool awesome uh is there more to this conversation yeah I know right it's fun to figure out where stuff's going to be and you know especially when it's like I I always like love some good natured internet sleuthing going around and comparing these and like the stuff the guy put up on uh Reddit is actually really like damn like this is really good work here like the way they all cobbled it together to find the real parking garage it's clearly based on it was like good good on you guys you know what I mean yeah absolutely yeah I don't really care where it ends up I mean it's all like the thing is it'll be even further along in the decline of civilization I hope I guess we we go to more cities I like walking around a city I you know even uh Last of Us two was in Boston or whatever and even then it was like oh there's the",
      "start": 1229.32
    },
    {
      "text": "in the decline of civilization I hope I guess we we go to more cities I like walking around a city I you know even uh Last of Us two was in Boston or whatever and even then it was like oh there's the gold Dome of like city hall or whatever it was it's like I don't know Boston well enough for this to matter to me I mean if they went to Chicago that'd be cool Seattle's we've been doing enough for PAXes that I'd like especially after you know living in it in Infamous Second Son for so long it'd be cool to see something there but I should go back and play that game you should you should it was really good it was really good good Sucker Punch what are you doing yeah I know Sucker Punch what the **** is going on sh hey stop teasing us with it God that's we're talking about remasters by the way Infamous 1 and 2 come on put them out remastered trophy sets yeah come on do it do it what are you afraid of money PlayStation number four four we're going to burn through these if you find",
      "start": 1268.52
    },
    {
      "text": "way Infamous 1 and 2 come on put them out remastered trophy sets yeah come on do it do it what are you afraid of money PlayStation number four four we're going to burn through these if you find something interesting to talk about we can but I want to make sure I'm giving you the comprehensive news on Kinda Funny Games Daily the fiscal quarter of course ended June 30th uh that meant Square Enix and Sega popped up with more information from there I'm quoting from GameSpot again it's funny I usually vary it up a lot a lot of GameSpot in this one you know why and I have to give them props they have a very excellent news section yeah they do they're it's expansive it covers everything mhm uh so for Square Enix it was a period without any major new game releases although there were still some bright spots MMO net sales for the quarter were up or I'm sorry were 9.3 billion yen over 3 billion more than during last last quarter in the previous year this is of course because of Final Fantasy XIV",
      "start": 1305.8
    },
    {
      "text": "spots MMO net sales for the quarter were up or I'm sorry were 9.3 billion yen over 3 billion more than during last last quarter in the previous year this is of course because of Final Fantasy XIV: Stormblood expansion or at least in part two on the traditional package game size net sales were down due to the lack of new releases however Square Enix did see quote unquote strong download sales of its catalog titles specifically calling out Nier: Automata yeah uh this led to the company's console games generating more operating income the amount the company earns before deducting taxes or interest when compared to the same period a year ago meanwhile for Sega as recently as recent as revealed recently Sega stated that Persona 5 has shipped a combined 1.8 million units worldwide since the Japanese release last year and the April 2017 launch internationally a regional breakdown was not shared but the company said the RPG quote unquote performed well outside of Japan the performance of Sega's other",
      "start": 1347.36
    },
    {
      "text": "last year and the April 2017 launch internationally a regional breakdown was not shared but the company said the RPG quote unquote performed well outside of Japan the performance of Sega's other two major game releases during the quarter Dawn of War III and Endless Space were not specified once again Sega called out the success of Phantasy Star Online 2 which frustratingly remains unavailable in the west Sega noted that despite turning 5 years old in July it continues to perform strongly it also called attention to the launch of a large scale update Episode 5 from late last month as a sign of continued support there was however still no word regarding the international release of the online RPG sales for the quarter were 107. billion yen up 70.6 billion during the same quarter a year ago uh that increase can be attributed most entirely to the Pachinko business which saw sales jumped from 54.9 billion yen to 1. billion yen thanks to strong sales of Hokuto no Ken 7 Resurrection ****",
      "start": 1389.6
    },
    {
      "text": "ago uh that increase can be attributed most entirely to the Pachinko business which saw sales jumped from 54.9 billion yen to 1. billion yen thanks to strong sales of Hokuto no Ken 7 Resurrection **** nailed it crushed it so there you go Andrea got anything to say other than the fact that it's these online games that continue to push this games as services I think that's not surprising the buzzword of this week for us yeah exactly I mean they give players an opportunity to stay involved on an ongoing basis and also give those publishers money on an ongoing basis yeah what what what a strategy that who would thought that works right let me just keep you online all the time you just have to keep feeding us money it's interesting to me as we continue to talk about games as services and see then I guess that be a reflection or us be a reflection of the same business model right in the way that Kinda Funny can exist because of your support on Patreon because of you buying merch",
      "start": 1432.48
    },
    {
      "text": "see then I guess that be a reflection or us be a reflection of the same business model right in the way that Kinda Funny can exist because of your support on Patreon because of you buying merch because of you doing these things and we can be a admittedly small YouTube channel you know admittedly small pool of best friends compared to IGN compared to Philip DeFranco compared to other people in the space but the support we get from the audience keeps us going and we're we are successful and people see that and talk about it and do it in the same way I don't know many people playing Final Fantasy XIV right now online but I know they are there and I the few people I do know that are into it are super into it and buy a bunch of different things making it the same thing with Phantasy Star in Japan and all these different things where it's not this it's not a movement like Minecraft and it's not a movement even to PUBG level at least now in terms of buzz where nobody get away from it but",
      "start": 1479.44
    },
    {
      "text": "Japan and all these different things where it's not this it's not a movement like Minecraft and it's not a movement even to PUBG level at least now in terms of buzz where nobody get away from it but it's there and it keeps them going yeah absolutely it's pretty awesome Andrea yes if I didn't want to play these games as services and I wanted to play new stuff that came to them oh before you go to the next segment yesterday we didn't talk about a story that I think we should have talked about oh my we dropped the ball I mean we completely didn't cover the fact that the WNBA is now in the NBA Live 18 did we oh no we didn't this is kind of a big story that we just completely missed sure well it's well it's on the record that you and I both hate women yes I mean no wait what no no yeah that is huge you're right we missed that yesterday so um in case you miss the story as well um it was announced that NBA Live 18 will not only contain all the players you know and love and sometimes love to",
      "start": 1517.84
    },
    {
      "text": "huge you're right we missed that yesterday so um in case you miss the story as well um it was announced that NBA Live 18 will not only contain all the players you know and love and sometimes love to hate it also include a roster of professional athletes from the Women's National Basketball Association or the WNBA so this is story I'm reading from Eurogamer it is the first time in video game history to use WNBA players according to EA so in order to replicate uh these players you know they went up to um EA Tiburon just like the male players do and got their faces scanned and everything so these are actual players um and a statement from Sean O'Brien an executive uh producer on the series says we are extremely proud to partner with the WNBA and the Women's National Basketball Players Association the WNBA is home to some of the most incredible athletes on the planet and we've been working hard to integrate them into our game in an authentic and meaningful way we're delighted to",
      "start": 1562.16
    },
    {
      "text": "Association the WNBA is home to some of the most incredible athletes on the planet and we've been working hard to integrate them into our game in an authentic and meaningful way we're delighted to collaborate in history with EA as NBA Live becomes the first video game to feature the WNBA's full roster of teams and players says WNBA president Lisa Borders it's going to launch on September in September for PS4 Xbox One and a demo will be available on August 11th awesome yeah I thought this was a this was a great story because representation in games is a conversation that we're having more and more often and I think the more people that can be represented in games the better and there are so few sports where there are female professional leagues and the WNBA is an excellent example of a league that has a lot of um publicity is maybe the word I'm looking for outside of um just people who are fans of the sport people know what the WNBA exactly like if I said WNBA you wouldn't be confused",
      "start": 1605.4
    },
    {
      "text": "that has a lot of um publicity is maybe the word I'm looking for outside of um just people who are fans of the sport people know what the WNBA exactly like if I said WNBA you wouldn't be confused about what I was talking about exactly exactly exactly um and so these players I think deserve the recognition just alongside the male players and I think this is awesome and I'm really happy to see that EA Sports has done this it's an interesting thing to see EA in NBA Live beat uh 2K in NBA 2K to something cuz NBA 2K has of course run away with that market share right that game is so successful and we see it all the time on and it's and on downloads it's a juggernaut and that is the basketball game to the point that there was a time where EA was like nope we're just done making NBA games for a while canceled the Live once actually after we had review code at IGN and like you know we're not going to put it up well EA has shown that they're a company where diversity is important they",
      "start": 1653.48
    },
    {
      "text": "for a while canceled the Live once actually after we had review code at IGN and like you know we're not going to put it up well EA has shown that they're a company where diversity is important they routinely get awarded for um their company culture around diversity they're part of the Pride festival here in San Francisco every year um they obviously put women in FIFA and so they kind of have a precedence for doing this now so it's not surprising to me that 2K didn't get to it first because EA has already said like hey we want to do this sure um but I think it you know kind of says to 2K hey we did it why aren't you doing it and that's the big question right well the 2K, not 18, obviously would 19 I guess have that or how because I feel like they have been so great at dominating that landscape and really being there do they see this and what do they think and this always talk about where why competition in games matters like you know how like when Madden just became the NFL game you're",
      "start": 1699.04
    },
    {
      "text": "and really being there do they see this and what do they think and this always talk about where why competition in games matters like you know how like when Madden just became the NFL game you're just like well all right I guess whatever we get every year is what we get doesn't matter no more Sega's not pushing them the audience for sports games isn't so diverse and vast as far as like sheer numbers of people um that maybe it can support multiple games each sport I mean we have one or two for each sport generally but I can't imagine sports games becoming as plentiful as say shooters sure 100% right and that's just how I think when people start getting licenses and then of course have an engine that works and has been around for so long and gets that's always the thing Madden likes people like to get mad at so much **** right of like oh well it's just a roster update well it's like well no they actually put a lot of stuff in there's a lot of little changes like well and having to",
      "start": 1742.32
    },
    {
      "text": "like to get mad at so much **** right of like oh well it's just a roster update well it's like well no they actually put a lot of stuff in there's a lot of little changes like well and having to do the likenesses for all of those players and how the player rosters change so frequently that's a lot of work so now get back to good on EA for putting the WNBA in NBA agreed now let's check on check in on the official list of upcoming software across each and every platform is listed by the Kinda Funny Games Daily show hosts each and every weekday out today there's a trailer you want to talk about yes uh the trailer for Good Game launched technically launched yesterday right when we were doing the show so we didn't get into the show notes so Good Game is a YouTube Red original series executive produced by Dan Harmon of Community and Rick and Morty fame and it's also being produced by Michele Morrow and Jesse Cox who are well-known uh YouTube personalities um and it's a parody film",
      "start": 1786.12
    },
    {
      "text": "produced by Dan Harmon of Community and Rick and Morty fame and it's also being produced by Michele Morrow and Jesse Cox who are well-known uh YouTube personalities um and it's a parody film about esports and if you watch the trailer it looks a lot like Dodgeball but for esports okay at least that's the thing that I thought of when I watched it I was like this is like Dodgeball but it's up on YouTube you can go watch the trailer exactly do you know when it starts cuz it's a YouTube Red program right correct that's I should know the answer to that the trailer's up go watch the trailer and tell yeah it'll be great meanwhile on the game front Viewpoints is out on PC Mr. Shifty is on Xbox One Race Arcade is on Xbox One The Way is on Xbox One and Oh...Sir! The Insult Simulator is on Xbox One a game I downloaded forever ago because it sounds like a good party mode game but I've never turned it on so I know nothing about Oh...Sir! The Insult Simulator but it sounds like something to be cool I've",
      "start": 1830.28
    },
    {
      "text": "I downloaded forever ago because it sounds like a good party mode game but I've never turned it on so I know nothing about Oh...Sir! The Insult Simulator but it sounds like something to be cool I've got a lot of emails about it and I've also had the same thought yeah right but you haven't opened it either it's just sitting on too much stuff to do uh new dates for you Icy is coming to the PlayStation 4 August 8th I'm super excited to say say because I was a big fan of the first game Another Lost Phone: Laura's Story is coming to Steam uh the App Store Google Play The Fall did you ever play A Normal Lost Phone no really enjoyed it and it it was a mobile game that I play on my phone and it was the idea is that once you turn it on you're in this other person's phone and so phone is their phone and it's as if you found this phone so you have to like it's like a Gone Home or a narrative like that but there's no walking simulator to it like oh interesting you go through and you read the",
      "start": 1878.16
    },
    {
      "text": "phone and it's as if you found this phone so you have to like it's like a Gone Home or a narrative like that but there's no walking simulator to it like oh interesting you go through and you read the conversations you can and then like somebody will mention a password you you're snooping on this person well you found this phone don't you want to give it back to somebody you know what I mean and and also like the messages on A Normal Lost Phone that start are like it's from it's Dad hey just checking in hey haven't heard from you what is going on call us like you like something bad has happened I immediately want to know what's in the photos did you go to the photos yeah you go you go to the photos time Andrea it's a huge part of it you got to play it it's great so I'm excited for Laura's Story uh Another Lost Phone coming out this fall and then Hearthstone: Knights of the Frozen Throne comes August 10th and we got a question about that yesterday but the release date just got announced",
      "start": 1917.68
    },
    {
      "text": "uh Another Lost Phone coming out this fall and then Hearthstone: Knights of the Frozen Throne comes August 10th and we got a question about that yesterday but the release date just got announced there you go meanwhile on deals of the day we talked yesterday about I Am Setsuna getting a Switch discount TumbleSeed is also on sale it's down to $9.99 from its $4.99 price point you remember those guys talked about those developers talked about lamented and not in a bad way but we're lamenting like man we sure didn't sell enough copies of this game this is a harder thing that we mean to do so go into that go get that now though I have a new segment for you Andrea yes this was submitted of course on KindaFunny.com/kfgd it's called I'm Angry, Amiibo Angry MSU Hitman writes in with a novella so **** strap in everybody it's long you guys dear Greg Andrea and Tim I don't know why you think Tim would be sorry I'm behind on the show that makes sense and think you should know it's 2014-2015",
      "start": 1950.28
    },
    {
      "text": "**** strap in everybody it's long you guys dear Greg Andrea and Tim I don't know why you think Tim would be sorry I'm behind on the show that makes sense and think you should know it's 2014-2015 again in Amiibo land and if you don't pre-order them you're out of luck many outlets have touched on how Nintendo has not reprinted older Zelda line Amiibo but failed to mention that the three different store exclusive Links featuring older Zelda games released in June GS I'm games GameStop Best Buy in Amazon what a what store is Amazon maybe ah nice each had an exclusive Link from Twilight Princess Majora's Mask and Skyward Sword respectively what was what was it shut up there's a lot of words I'm trying to get through that were sold out at launch and Amazon had the G to not do pre-orders for their SS Link Amiibo I'm just going to read it as is from here on out Skyward Sword and only release it on launch day and only to Prime members it has not been restocked even once since the",
      "start": 1998.04
    },
    {
      "text": "for their SS Link Amiibo I'm just going to read it as is from here on out Skyward Sword and only release it on launch day and only to Prime members it has not been restocked even once since the launch the GS/BB Links got one short restock on their websites and the SS Link Amiibo goes for over $60 online now Amazon crapped the bed again two weeks ago by holding Female Corrin their player exclusive Smash Amiibo until release date but this time open for anyone which caused its page to crash Female Corrin was only available for around 10 minutes if you used one touch to complete your order even then many orders were sent the the regular male Corrin instead and no restocks again unlike GS and BB Female Corrin now sits at about $70 shipped online and the Samus Metroid Amiibo everyone was flipping out about last week pre-orders are sold out Nationwide yes even Amazon and GameStop location only got three each and I'm betting we will also see a Breath of the Wild like jump on the price of the",
      "start": 2046.68
    },
    {
      "text": "out about last week pre-orders are sold out Nationwide yes even Amazon and GameStop location only got three each and I'm betting we will also see a Breath of the Wild like jump on the price of the Samus ZSS Amiibo from the Smash line since they were also unlock free health tanks missile packs and Samus Returns on 3DS whom at Nintendo of Japan gets off on seeing all these non-Australian western stores about how short supply and demand Amiibo are in for some reason all the short supply slash high demand Amiibo in NA in Europe are generally plentiful in Australia they have been pulling these tactics since 1989 with Super Mario Bros. and Zelda on NES and whether they are legitimate reasons for their constant issues of supplying everything from hardware to games parenthesis 2013 was the year from hell a Nintendo supply of physical games to retail and parenthesis to Amiibo and back to hardware when will Western gamers say enough is enough and just drop Nintendo cold turkey sorry for the",
      "start": 2095.6
    },
    {
      "text": "year from Hell a Nintendo supply of physical games to retail and peripherals to Amiibo and back to Hardware when will Western Gamers say enough is enough and just drop Nintendo cold turkey sorry for the long message and I hope the paragraph showed up in this Google form MSU Hitman wow why is the why are you even caught off guard MSU Hitman you talk about it this is Nintendo's MO since 89 this is Nintendo as long as I've ever been cognizant enough to be a consumer that everything is short from the NES Classic to the SNES Classic to the Wii to the Wii U and that's why it's with with Switch it's like oh they're like well their components are actually harder to get and it's like you've been screaming wolf so long I can't tell if this is a true one or not so yeah the Amiibos here they're breaking your back they're doing this thing I don't know Nintendo's weird and they like having this conversation around them clearly that's got to be the case they like being in short supply they like",
      "start": 2149.12
    },
    {
      "text": "your back they're doing this thing I don't know Nintendo's weird and they like having this conversation around them clearly that's got to be the case they like being in short supply they like having everybody riled up they like seeing things being gouged it has to be that's the only thing they like being that conversation it's a frustrating conversation and I spoke to several people in the comments on you know this show on YouTube about this Amiibo situation this week I you know I said earlier in the week that it would be better for Nintendo to make the digital content that's locked to these Amiibos available as a digital download at some point if they want to create this exclusivity period at the beginning for like 30 days or whatever I get that a lot of companies do that but then make it available for this exact reason that not everybody's going to get one everybody who wants to play hard mode on Metroid is not going to be able to buy that Amiibo Fusion Mode which is it super hard",
      "start": 2201.24
    },
    {
      "text": "it available for this exact reason that not everybody's going to get one everybody who wants to play hard mode on Metroid is not going to be able to buy that Amiibo Fusion Mode which is it super hard mode excuse me just letting you know I apologize it's okay just I'm saving you the KindaFunny.com your thank you regardless it's a piece of content that's locked yeah and there are people that want that content that no matter what they do they're not going to be able to get their hands on this Amiibo and that's really frustrating for fans and Nintendo keeps doing it and the comment that I left at the end of the day was well if you guys want this to change me calling Nintendo out for it isn't going to make it change yeah I can call Nintendo out and say hey you should make everything available for digital download if you are convinced you need to charge for which they don't need to but they're going to or you have to guys you guys out there have to stop buying Nintendo in protest because",
      "start": 2246.36
    },
    {
      "text": "for digital download if you are convinced you need to charge for which they don't need to but they're going to or you have to guys you guys out there have to stop buying Nintendo in protest because that's the only way they're going to change is if they start losing money and that sucks cuz if you're a fan you want that content and the you don't want to have to boycott the stuff that you love and this is the problem is that it's impos what what we're talking about is impossible to happen cuz even if you got a large percentage of people to be like well I'm not going to buy Amiibos anymore there are so many more that will still buy this limited supply that they'll have them all and then Nintendo doesn't care if you put them on eBay and you're not getting $70 that's the problem is that resellers are really the ones who are screwing everybody it's people that come in intending to buy bulk amounts and then sell them for a premium price on a third party site that's the really unfortunate",
      "start": 2288.64
    },
    {
      "text": "are really the ones who are screwing everybody it's people that come in intending to buy bulk amounts and then sell them for a premium price on a third party site that's the really unfortunate part here and then we've seen some retailers taking specific um tactics to try to ward this off for example ThinkGeek recently with these new NES Classic bundles that we saw they limited it to one per person they're like you can only buy one so if you're a reseller you would have to make so many different accounts that they were hoping that it was discouraging to people so unless retailers start taking accounts to help offset the shortage problem to prevent resellers from gobbling up the market and then charging a premium price for it you know we are really kind of stuck here I don't know why Nintendo just isn't making more that's the easiest solution they like period they like conversation they like this conversation they make enough money apparently this what we're talking about with the",
      "start": 2325.36
    },
    {
      "text": "just isn't making more that's the easiest solution they like period they like conversation they like this conversation they make enough money apparently this what we're talking about with the SNES's right of just like the profit loss ratio there's they know the number where it's going to be it's profitable for them and and it's they're happy with that profit and they don't want to push it further cuz I guess then the profits would go down the risk goes up or there's something there's a slider they teach you in business school that I don't know about but that's what it's got to be and they like being the hard find thing they like being this it's so and it's not exclusive to Nintendo and it's not exclusive video games I think of Beanie Babies I think of Power Ranger figs I think of Teddy Ruxpin like this is a problem as old as any consumerism ever it's just the fact that whereas Teddy Ruxpin was a problem for one Christmas and proton packs for Kenner were Pro problem one Christmas",
      "start": 2373.92
    },
    {
      "text": "ruins like this is a problem as old as any consumerism ever it's just the fact that whereas Teddy Ruxpin was a problem for one Christmas and proton packs for Kenner were Pro problem one Christmas Nintendo likes being the problem every Christmas every Christmas they love being the ones that you just can't buy their **** and it's a big deal but it is that thing that then you have and I'm not this isn't me at all throwing stones but you have Dan Ryckert or you have Zigger from our community who are like take pride in the fact that they've assembled all their Amiibos and here's the photo of how I'm displaying all my Amiibos and there is that because you're talking about it from the DLC angle on just the Metroid stuff but clearly MSU Hitman is talking about Amiibos from the dawn of time till now like he's in it for EOS which is that got to catch them all scratch the itch thing and I it's fascinating to see Nintendo do this and play with it in the similar vein I want to we're to transition",
      "start": 2415.2
    },
    {
      "text": "like he's in it for EOS which is that got to catch them all scratch the itch thing and I it's fascinating to see Nintendo do this and play with it in the similar vein I want to we're to transition seamlessly into reader mail where you can be part of the show KindaFunny.com/kfgd where Ian and Idaho rode in and he said must be read in angry rant Greg Voice Greg why do you keep telling people to buy Switches and sell them on eBay as a person that sells on eBay a lot I want you to know that they are selling for about the same retails they are on eBay people that try this will lose money unless they wait till Christmas and gouge the community so please for the love of everything this holy stop love the show and keep up the good work P.S. Patapon is overrated winky face you're wrong Ian and Idaho as I talked about with Tim this week on this front I'm not I'm not saying buy if you I'm saying if you see Switch buy the Switch and sell it not to gouge someone on eBay to get it to someone in San",
      "start": 2455.44
    },
    {
      "text": "Francisco to in Chicago where they aren't that they have the chance to buy it as I said said on the show that same show with Tim I'm like if you want to go opposite go to the Kinda Funny Reddit and say hey I have a Switch who wants to buy it that's really complicated and you might get **** over and somebody DMs and takes your money but I'm saying there are people are friends who want Switches but they just they are not in their area and when you go to Amazon they're not on Amazon so when I see people walk through their Walmart in Timbuktu wherever and see seven on the Shelf I'm like buy them and put them on eBay I'm I I don't think you're going to buy them and put them on eBay and put yourself through college on that money or something of that effect but you're getting them out there",
      "start": 2499.24
    },
    {
      "text": "and put them on eBay I'm I I don't think you're going to buy them and put them on eBay and put yourself through college on that money or something of that effect but you're getting them out there and you might make enough to get some money off of it I think this is a good clarification you made because I as someone who sits next to you it did sound like you were like sell them on eBay make some money I hear you and that's not what I meant it to be the the example I gave with uh Tim when we were talking about it is that when PlayStation 4 came out I got dropped into they the Funcoland in town got less than they were supposed to so I got put in the second wave of pre-orders so I camped out admire bought a PS4 on launch day so then a two weeks later or whatever it was when I got my PS4 from Funcoland I I turned around and put on eBay I think and it or maybe it was it it was eBay or something local whatever but I sold it for like $20 $30 more than what it was it wasn't like there was a",
      "start": 2538.2
    },
    {
      "text": "from Funcoland I I turned around and put on eBay I think and it or maybe it was it it was eBay or something local whatever but I sold it for like $20 $30 more than what it was it wasn't like there was a bidding war and I you know retired off of it it was like there was somebody else who wanted this and I wanted to get it out to them and it granted that's a bit different cuz that PlayStation 4 was going to sell regardless but I'm and I'm that's the whole thing is I'm not saying go wait in a line at Walmart when they say they're going to have four but like for these people who are just sending me Twitter shots of like hey there's all these Switches here and then like do you want one I'm like no I don't want one like that's not the point like there's other people out there who want it just don't have it God damn it Nintendo make it easy final Nintendo question for now Allen Gamble writes in with a good pallet cleanser quick one favorite item in Mario Kart the star oh in new Mario Kart I do",
      "start": 2573.36
    },
    {
      "text": "have it God damn it Nintendo make it easy final Nintendo question for now Allen Gamble writes in with a good pallet cleanser quick one favorite item in Mario Kart the star oh in new Mario Kart I do like Bullet Bill yeah okay that's really fun yeah for me it's got to be Red Shell it's so versatile it is you know what I mean I get it cuz Green Shells I hate you get the Green Shell and I hold it behind me for defense of course but Red Shell I can hold behind me for defense somebody pulls ahe I got the chance to turn it around and throw it out there I like it it's simple it's beautiful it's what it's all about dear is 33 says hello Greg and Andrea with all the discussion of upcoming games this year I was wondering why I'm not hearing more about Hidden Agenda Until Dawn was my favorite game of 2015 this seems to be the follow-up it was poorly announced at E3 in a set for 2017 I was just wondering if you are excited or why there hasn't been much news or talk about it I feel like we got this",
      "start": 2607.4
    },
    {
      "text": "2015 this seems to be the follow-up it was poorly announced at E3 in a set for 2017 I was just wondering if you are excited or why there hasn't been much news or talk about it I feel like we got this exact same question immediately after E3 yeah well that what happened is right after E3 is to bring you up to speed on Hidden Agenda it was that it got announced during that pre-show for PlayStation's conference so we were talking over it we weren't paying attention and then a person wrote into one of the First episodes of Kinda Funny Games Daily and asked about Hidden Agenda and I had to go look it up and I was like holy **** this looks awesome yes they that was a they dropped the ball marketing I think I think a lot of people missed it there and I think that that was just the ship leaving the station on that one game not to mention that it was weird for them to be like hey Supermassive's got three games like but that's a lot of games how how do we focus on all this yeah it's tough because",
      "start": 2656.92
    },
    {
      "text": "the station on that one game not to mention that it was weird for them to be like hey Supermassive's got three games like but that's a lot of games how how do we focus on all this yeah it's tough because we haven't really seen I haven't gotten hands on with this game I haven't seen a gameplay demo of it it's tough to know if it's going to be something similar in length and scope as Until Dawn or if it's going to be a shorter experience it's shorter because it plays like a board game yeah and then and then you have the mobile component where people can jump into the game well that's the only component so it's one of the PlayLink games where it's being played on screen it the game's playing out and you all have your phones or whatever it's similar to that you where there are is no nobody's playing with a controller everybody has their phone oh I didn't know that there was no controller component right so the idea is that if so if you're at home and you haven't watched it go watch the YouTube",
      "start": 2693.12
    },
    {
      "text": "with a controller everybody has their phone oh I didn't know that there was no controller component right so the idea is that if so if you're at home and you haven't watched it go watch the YouTube videos of I'm super impressed with it I can't wait to do party modes with it but the idea is that yeah there's you're it looks like Until Dawn with the character but then choices pop up of you know talk to this guy or go that way or whatever and then on your phone you have to vote and whoever you know whoever the vote gets to they make that choice the thing is before you start the game you get cards that are called Hidden Agenda cards and they change every game obviously so you have an agenda you have a hidden agenda of trying to make it happen that this happens so you go through this detective mystery trying to make all this **** happen it seems super cool but it again it was poor it was just dropped there it was part of the PlayLink thing but That's You! so oh That's You! was like oh it's",
      "start": 2730.08
    },
    {
      "text": "mystery trying to make all this **** happen it seems super cool but it again it was poor it was just dropped there it was part of the PlayLink thing but That's You! so oh That's You! was like oh it's like Drawful it's like a Jackbox Party Game I got that it's easier at my head around whereas this one is more like it's more like Secret Hitler or the Batman card game where you all have like an agenda you're trying to make something happen but the other players don't know what that is seems super cool I didn't know like you say it's like it's set for 2017 I didn't know that I haven't seen any lists of it I haven't seen an official date for it that's a big problem why people aren't talking about it hopefully when they get that we'll get more I've talked to PlayStation about it when they came through and did the uh That's You! uh let's play with us for YouTube.com/KindaFunnyGames I was like by the way Hidden Agenda looks awesome I want that as soon as you can get it to me so hopefully",
      "start": 2765.6
    },
    {
      "text": "through and did the uh That's You! uh let's play with us for YouTube.com/KindaFunnyGames I was like by the way Hidden Agenda looks awesome I want that as soon as you can get it to me so hopefully one day we will I want to do h yeah one more yeah okay all right we're going to talk to Pickle Pickle Pickle rode in to KindaFunny.com/kfgd just like you can it says Dear Greg and Colin then parenthesis ha I'm so **** funny but seriously I do miss him hi Andrea I know it's your beautiful face there again today he says Pickle says Death Stranding Tech demo video are you **** kidding me with this **** why is it that every Kojima game always has to have these tiny little tidbit announcements that don't do anything the video is 15 seconds long why is this news do you guys feel the same way am I the odd man out and thinking this stuff is absolutely pointless thanks guy have a Fant guys have a fantabulous weekend catch a con Pickle did you see this today yeah so there's a reason we",
      "start": 2801.48
    },
    {
      "text": "way am I the odd man out and thinking this stuff is absolutely pointless thanks guy have a Fant guys have a fantabulous weekend catch a con Pickle did you see this today yeah so there's a reason we didn't put it in the news but there's one reason for this and it's because Kojima is an auteur yeah and auteur means ego and he wants everybody to know look at what my fancy thing can do this happened when do you remember P.T. and he said he was on the record in an interview saying we had to dumb down the graphical fidelity of P.T. so people wouldn't guess that it was a Kojima production he said that on the record I didn't see that like I believe it I didn't see it he's like well cuz everybody knows that if I'm making it it's going to look amazing so clearly we had to make it look crappier so people wouldn't guess that it was me and I was like did he really just say that I'm sure it was Lost in Translation right that's sure sure sure sure listen there's no doubt that he makes fantastic games like",
      "start": 2852.92
    },
    {
      "text": "guess that it was me and I was like did he really just say that I'm sure it was Lost in Translation right that's sure sure sure sure listen there's no doubt that he makes fantastic games like no one's disputing that this is what this is it's him being like hey I made something really **** cool you want to look at it here you go Little Slice yeah if you didn't see the video yeah it's a 15-second video showing how cool the fog is in in the new engine Decima Engine or whatever so it's like yeah just a landscape in the fog keep it's for his hardcore fans and I'm sure they ate it all up and that's great go for it it's I mean it's one of those we talk about a game exposing too much before release and this is them just stoking the fire with the littlest of information to keep you thinking about Death Stranding and talking about Death Stranding and talking about Kojima and bringing up all stuff the problem though is that this game probably isn't coming for at least another two years oh yeah I",
      "start": 2907.04
    },
    {
      "text": "Stranding and talking about Death Stranding and talking about Kojima and bringing up all stuff the problem though is that this game probably isn't coming for at least another two years oh yeah I am 100% with you yeah don't get me that's that was always the thing where Colin and I would say that of like this game is far away like no no way I'm like okay you know what I mean you talked to I did that two-hour interview with him and we were talking about there and it's very much like they are they felt like they had like the bones of the game and now they're putting things over it it's like okay that's still a ways away and like I want to go see it and play it and do all this different things but I even when Shawn Layden's like I've played it and it's spectacular I'm like I'm sure you've played in the world or what one of their maps or whatever and like moved around I don't think there's not a game yet you didn't like run a mission in in Phantom Pain Death Stranding to go see what's",
      "start": 2945.28
    },
    {
      "text": "in the world or what one of their maps or whatever and like moved around I don't think there's not a game yet you didn't like run a mission in in Phantom Pain Death Stranding to go see what's happening well and I'm sure Kojima and his team had to put together a pretty robust demo in order to convince PlayStation to fund it right so maybe that's that's what he is referring I mean even I don't even know if they had that the way they talk about it it definitely sounds like they here they were like here's our idea and here's like concept art and here's like the most basic of basic things you think that PlayStation funded it off concept art yes well I mean I'm sure they I you I don't think they had an extensive playable here's a vertical slice I think they probably had maybe wire mesh you know Maya stuff of people running around or whatever but I think it was all proof of concept and I think in PlayStation like here's the check you're Hideo Kojima yes well like we're not going to let",
      "start": 2977.44
    },
    {
      "text": "you know Maya stuff of people running around or whatever but I think it was all proof of concept and I think in PlayStation like here's the check you're Hideo Kojima yes well like we're not going to let anybody else I know I think you're giving I think you're the interviews when they talked to him were like why did you go there or why did you do this with PlayStation exclusive he's like w well they're not going to say on the record that like did well I mean Kojima would but yeah okay I don't I'm just saying I mean maybe I'm totally wrong maybe he had a great vertical slice maybe he this I think that I think the studio was under staffed at the time it didn't even exist yet right like Kojima Productions the new version new studio next time you see Kojima will you ask him I will yeah I'm again we'll look it up and we'll get to it cuz I remember there being a quote from him was being like yeah I've worked with them before and they trusted my vision and I I didn't have to show them anything I don't",
      "start": 3012.56
    },
    {
      "text": "it up and we'll get to it cuz I remember there being a quote from him was being like yeah I've worked with them before and they trusted my vision and I I didn't have to show them anything I don't know trust me I'm sure he could and he could have done that with anybody he could have totally walked into Xbox and been like this Val okay like what Gabe Newell been like take three decades and make whatever you want well I think the decision to work with him was a no-brainer but what I'm referring to is the amount of money that they're giving him so if he was like I want $150 million to make this Blockbuster game with these amazing actors with these over-the-top graphics I don't think Sony would just be like sure here you go here's a check that was my point okay well I'm just saying I don't think I think we're on the same page though I don't think there was this vertical slice that looked like Phantom Pain or something we're like oh okay I'm playing I be cool if there was can you imagine if",
      "start": 3049.08
    },
    {
      "text": "I think we're on the same page though I don't think there was this vertical slice that looked like Phantom Pain or something we're like oh okay I'm playing I be cool if there was can you imagine if they're like by the way it's 2019 **** everybody I like what oh my God K yeah they just had something ready to go like out the door **** amazing Andrea it's time to Squad Up let's do it this is where one of you writes into KindaFunny.com/kfgd giving me your username on whatever platform you're playing games on you tell me the game you need help with we read your name in the game here then the other best friends out there friend you you all go out and play you have a good time this is Luke Feltner he needs friends on PC he says specifically Steam and Discord his Steam username is L.U.K.E.F.E.L.T.N.E.R._111 his Discord is number sign 57 5 why does he need friends I need friends to play PlayerUnknown's Battlegrounds with I have about 170 hours in the",
      "start": 3087.72
    },
    {
      "text": "111 that's L.U.K.E.F.E.L.T.N.E.R._111 his Discord is number sign 57 5 why does he need friends I need friends to play PlayerUnknown's Battlegrounds with I have about 170 hours in the game but I have zero chicken dinners parenthesis that's what we losers call a win Greg I I've played the game I know what a winner winner chicken and even if I hadn't everybody's tweeting out their godd damn screenshots so everybody this weekend friend Luke again Steam username Luke Feltner 111 Discord 57 5 go play PlayerUnknown's Battlegrounds with him Andrea yes Greg what do we get wrong I'm going to look right now of course ladies and gentlemen if you're watching us record it live on Twitch.tv/KindaFunnyGames you can go to kindafunny.com/yourewrong tell us what we screw up as we screwed up and every episode we come back to keep the record clean no editorializing yes the first one says Andrea at the top of the show you said fry instead of Friday I did that intentionally it's fry um no",
      "start": 3128.04
    },
    {
      "text": "and every episode we come back to keep the record clean no editorializing yes the first one says Andrea at the top of the show you said fry instead of Friday I did that intentionally it's fry um no this is not a you're wrong as of today you have 100 reviews on iTunes congratulations y let's see if we can get to 3,000 by Monday morning oh my gosh you're so demanding hey you got to keep setting the the goal post congratulations thank you guys so much for supporting the show um Greg you're right yesterday someone tried to correct you for saying that Crash charted with only one day of NPD data for June that is incorrect the NPD doesn't track sales data starting on the 1st to the last day of the month but rather looks at the entire week for when those dates fall depending on what days of the week it falls on since June 30th fell on a Friday that Saturday July 1st was also included in the sales data June's period actually included May 8th to June 1st hence making Crash available for two",
      "start": 3181.56
    },
    {
      "text": "week it falls on since June 30th fell on a Friday that Saturday July 1st was also included in the sales data June's period actually included May 8th to June 1st hence making Crash available for two days therefore making Greg right for future reference here is a Google Doc from NeoGAF which lists past and future NPD sales periods thank you that helps out a lot cuz when I said it I remember it being I remember it from the month before when we talked about it and them saying it was two days and I was like but there's no 31st of you know whatever Thank you very much for vindicating me person who tried to correct me yesterday you now have to cut off your pinky and send it to me um so this is not a you're wrong but most of the major Destiny streamers stream out at 900p 60 frames per second or 720p 60 frames per second so not 4K okay but we don't know because Destiny hasn't been on PC yet we'll see what happens um Good Game has a release date of August 30th that of course being",
      "start": 3236.68
    },
    {
      "text": "or 720p 60 frames per second so not 4K okay but we don't know because Destiny hasn't been on PC yet we'll see what happens um Good Game has a release date of August 30th that of course being the YouTube Red series that we talk about the Esports trailer is for a show it isn't a film okay did I call it a film that's my bad it's YouTube Red it's content on YouTube Red yeah um this is another one it's not a movie it's a series all right we get it that's my bad Greg I'm gonna say you are wrong I have Patapon Remastered PS4 Pro 4K TV and have been having big time timing issues too I also live in the US and in Europe how's that make me wrong that was actually a suggestion I said people might be having problems with it about oh okay yeah I think that was just a confusion okay you can f*** right off sir you deserve those Patapon problems Hidden Agenda is up on the PSN Store for pre-orders but its messaging sucks on there as well because the trailer isn't even for the correct game oh",
      "start": 3275.76
    },
    {
      "text": "right off sir you deserve those Patapon problems Hidden Agenda is up on the PSN Store for pre-orders but its messaging sucks on there as well because the trailer isn't even for the correct game oh man God damn it PSN it's a that's YouTube trailer instead God damn it PSN that see is pretty good though still free maybe remember it was free for a long long time I don't know that's it okay okay uh one final segment this trophy can go f*** itself Ron Baron wrote in and said I know there was already of this trophy can go f*** itself segment this weekend but I need to spread the word on the most garbage trophy I've ever seen and was C and was clearly intended to be next to impossible to get the Platinum the game I'm referring to is The Elder Scrolls Online this is the first MMO I've gotten into besides Wizard101 when I was a kid and I was prepared to get the Platinum I knew it would be time consuming but I was ready until I saw that there's a trophy that requires to become emperor in PvP",
      "start": 3334.64
    },
    {
      "text": "besides Wizard101 when I was a kid and I was prepared to get the Platinum I knew it would be time consuming but I was ready until I saw that there's a trophy that requires to become emperor in PvP remember those reach the top 1% in leaderboard trophies on PS3 well this is even worse becoming Emperor requires you to be in the very best PvP player on the entire server this trophy is practically impossible when will developers learn it's a great question Ron they won't ever learn they're all monsters they should all listen to us because we tell them the truth but they don't want to hear it they just want to go out there and make fog engines ladies and gentlemen this has been Kinda Funny Games Daily for Friday, August 4th, 2017 thank you thank you for watching Remember Kinda Funny Games Daily is your every weekday video game news show we dive in get nerdy with it answer your questions give out names say f*** a lot it's great we have a great time Andrea thank you for being here",
      "start": 3376.08
    },
    {
      "text": "Daily is your every weekday video game news show we dive in get nerdy with it answer your questions give out names say f*** a lot it's great we have a great time Andrea thank you for being here thanks for having me it's been a it's been a great week it has been you're you're back Tuesday right Tuesday Wednesday Thursday next week great all right good so there you go Tim on Monday Danny on Friday and we will all make fun of Danny for never being here yes until next time it's been our pleasure to serve you",
      "start": 3416.16
    }
  ]
}
