{
    "id": 2936,
    "video_id": "76lPyKJaB6E",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino"
    ],
    "title": "Don’t Hate Taylor Swift - Kinda Funny Morning Show 8.25.17",
    "description": "Thanks to Uber for sponsoring this episode. Go to uber.com/drivenow to drive with Uber!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1503695690,
    "duration": 3431,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to the Kinda Funny Morning Show for Friday, August 25th, 2017. I'm one of your hosts, Greg Miller, alongside the producer slash seducer, Nick Scarpino. If you were watching this on YouTube earlier today, we apologize to you. Welcome back to Twitter. Supposed to do that. That's not possible. What they were doing, we're screaming to a dead place. I don't you joining us live right now on Twitch.tv/KindaFunnyGames. Thank you so much. We never switched the broadcast tools over from yesterday's live broadcast of the Kinda Funny Gamescast recording, right? We were going to just out into YouTube and YouTube's like, I don't have to do this. We all thought we were killing it. We were having a great chat. We had probably the best intro. I'm so sad that no one will ever see that intro to show, but that great. It was terrible. It was a B+. We talked about most of your shirt that I'm wearing, your shirt. We're talking about this shirt. He doesn't wear white shirts. Is it can't",
            "start": 1.18
        },
        {
            "text": "see that intro to show, but that great. It was terrible. It was a B+. We talked about most of your shirt that I'm wearing, your shirt. We're talking about this shirt. He doesn't wear white shirts. Is it can't have another black shirt? Here's what I will say, yeah, about this shirt. You should wear more white shirts. I like it. You look, you look, I don't know what you don't sell why, if I'm being honest. Yeah, shut it. So you never look bad. You've lost a lot of weight. Thank you. The Jack went off is going well. I don't like Yousef Maggid. I don't like Sean Pitts whenever they're doing and rubbing you down. It's working. You're definitely and this shirt shows the definition. I don't know, just a blob in this blackness. Well, here's what I'm up to. I don't know, they're rubbing me down per se. I don't know how I know that's not real. It's relaxation. Sean Pitts is posting on this IGN forums makes it sound like the rubbing you out. Is he doing that? Yeah, where there is their animations of us rubbing each other. No, no, no, it's",
            "start": 46.11
        },
        {
            "text": "not real. It's relaxation. Sean Pitts is posting on this IGN forums makes it sound like the rubbing you out. Is he doing that? Yeah, where there is their animations of us rubbing each other. No, no, no, it's all rock-a-lat. That's all in it. Oh, I understand. Yeah. Are you sure you're not the one who's writing about lid? You know, it's just Sean Pitts_Lover. What? I don't know, registered out there. Greg has to register this and we have to now write fanfiction for what may or may not be happening at night with me. We'll see about that. How you feel today? But I feel **** great. So goddamn ready for this weekend. I'm J when I say I'm ready for the weekend, I mean I can't wait to wake up and fly to Vegas and work the GameStop Xbox. I'm excited for this for a few reasons. One, we're gonna have I think we have a lot of fun on 100% as everyone knows. We'll be in Vegas at the GameStop Expo live. You guys can come see us there. If you can't make it out to Vegas, of course, we streaming on Twitch.tv/",
            "start": 87.72
        },
        {
            "text": "lot of fun on 100% as everyone knows. We'll be in Vegas at the GameStop Expo live. You guys can come see us there. If you can't make it out to Vegas, of course, we streaming on Twitch.tv/GameStop at 10:00 a.m. Pacific Time. So guys, come to check us out there. But I'm excited because the last time we were in Vegas, yeah, we had a great time at leisure of XSplit and you and I had a great date. We did. Is use it was a triple positive out of its Elgato unit. You mean we spent like 70 dollars on pizza? Yeah, and that was in Vegas terms for pieces of pizza. It was bad. We were already kind of done. This time we're gonna, here's my plan for us, right? You understand this. I do. I do. You know, I don't. We have a dinner planned on student. Yeah, after that dinner, hopefully doesn't go too late. Yeah, I feel like we should go back to the hotel room and get a pizza. Yeah, okay. Three-peat. We repeat what we did before, but instead of Terminator Genisys, we watch, we see if we can order the Floyd Mayweather and Conor",
            "start": 135.38
        },
        {
            "text": "we should go back to the hotel room and get a pizza. Yeah, okay. Three-peat. We repeat what we did before, but instead of Terminator Genisys, we watch, we see if we can order the Floyd Mayweather and Conor McGregor fight and drink. See, you like we should be honest. I'm saying we go from a dinner to eating more pizza. I'm not against it. There's a team fat move. I've done it before. I don't need to eat the pizza. I just like having the pizza there. I would say there's got to be somewhere in these casinos we can wander and watch this fight, right? You would think so. Now you also forgot the wild card, Luke Hayes in town. Luke, what was Luke Hayes? What am I for a second? I think he said Luke Cage and I was like, the guy that played Luke Cage. My adopted Missouri family, one of them is actually in town during all this **** fun. So Hobie and he wants to party. So I'm sure let's go party. I wanna, here's the thing. I went to the Kevin Coello bachelor party. You did. I got so **** up and I never actually gambled at the",
            "start": 174.77
        },
        {
            "text": "**** fun. So Hobie and he wants to party. So I'm sure let's go party. I wanna, here's the thing. I went to the Kevin Coello bachelor party. You did. I got so **** up and I never actually gambled at the blackjack table like I wanted to. So I'm taking the money I'd set aside there and been like, oh, I save that. I want to put that down when we get there Saturday night. Get some **** going. Fantastic. Let's get into this. Are you at all excited about the Mayweather fight? They have been hyping the **** out of this fight as much as humanly excited to hang out with you. I know you get excited. I get very like you and it's I I know we're not gonna go to it unless Money Mayweather is watching right now. Also, give us some row seats. You know what I'm saying? Come on, buddy. Hey, wait. Mayweather was a fan of the show and he wanted to give us tickets. Okay, he's he's Floyd Money Mayweather such a fan of this show. Yeah, was watching it on the YouTube. He was like, he never cooked off the game. Has that link live? Is he",
            "start": 212.72
        },
        {
            "text": "and he wanted to give us tickets. Okay, he's he's Floyd Money Mayweather such a fan of this show. Yeah, was watching it on the YouTube. He was like, he never cooked off the game. Has that link live? Is he really possible? Yeah, yeah, yeah, that would be amazing. This is the Kinda Funny Morning Show each and every week to here on Twitch.tv/KindaFunnyGames. We come to you with whatever the **** it is we want to talk about and you eat it up. Now I'm just out there like a bowl of **** rats. You **** a hawk, but you're a hawk with hands that's eat the rats with a spoon. So instead of talents, yeah, you have hands. Exactly. Well, its hands wouldn't allow for the spoon edge to come on. You could probably get a spoon in with a talent, dude. Get it into a tail. Yeah, but then to the mouth of the hawk. Yeah, oh yeah, that's like a T-Rex gonna get on the door. I'm expecting packages for his Kevin, sir. Is he? Yeah, Kevin's like a ghost that just permeates the building. I never know where he is or what he's doing.",
            "start": 248.37
        },
        {
            "text": "oh yeah, that's like a T-Rex gonna get on the door. I'm expecting packages for his Kevin, sir. Is he? Yeah, Kevin's like a ghost that just permeates the building. I never know where he is or what he's doing. Yeah, he went to ghost camp out over here like you did before and I was like, don't get it. No big deal. You can get on YouTube.com/KindaFunny or podcast services around the globe. No matter where you watch it, thank you for the support. Remember, there are multiple ways to support. This is the show that is the grease that keeps the wheels of Kinda Funny rolling over our enemies and covered in fresh blood enemies. See them driven before you hear the limitation of the demon. It'd be great if you followed us here on Twitch so you know when we go live. It'd be great if you subscribe to us here on Twitch. We read the tips as we go through. If you want to tip us here on Twitch, if you have Amazon Prime, you have Twitch Prime, you get a free subscription every 30 days. You have to give it away and we",
            "start": 296.52
        },
        {
            "text": "Twitch. We read the tips as we go through. If you want to tip us here on Twitch, if you have Amazon Prime, you have Twitch Prime, you get a free subscription every 30 days. You have to give it away and we would love to have it. Otherwise, Amazon just sits on your **** money doing weird things to it. Remember, we got Patreon, too. We do. We do. Ah, Greg, yeah, say for housekeeping. Do you want to talk about the biggest news story of today? Should we go into this first? I do want to go into this first. I do want to go into it right now. You, I came in this morning, oh, and you said, hey, look what she made me do. Did you hear the new Taylor Swift song? And you said, and I said, no, I didn't. You didn't even it was out, but and I knew I saw Joe. I followed Joseph Kahn who directs all of her music and he was mentioning, hey, I can't wait to show you guys the video for this song. So I knew there was a song eminent. Okay. And if you remember last week, she sent some weird GIF out shown her to it like deleted whatever and there",
            "start": 335.1
        },
        {
            "text": "I can't wait to show you guys the video for this song. So I knew there was a song eminent. Okay. And if you remember last week, she sent some weird GIF out shown her to it like deleted whatever and there was like a Serpent's tail or whatever. And I was like, okay, do we know the significance of that at all? Not to my knowledge yet. No, but I haven't. I, you know, I love the Taylor Swift music, right? I love the panache. Yeah, I'll go into the show. Yes. I'm not a big follower of her and like, I don't, I don't know. You weren't caught up in her and Tom Hiddleston when he was like, you were like, they're gonna make it or not. You see why is he wearing that shirt? I'm so weird as an ironic alors. And we really, really, no, no, no, not walking this morning. Yeah, and you say, have you heard it? But the way you said that makes me think, oh, so what I was trying to do is ask you, have you heard the song with no context? Cause you're Nick Scarpino's favorite thing to do is not look at the internet. He does not like to look at his",
            "start": 376.72
        },
        {
            "text": "me think, oh, so what I was trying to do is ask you, have you heard the song with no context? Cause you're Nick Scarpino's favorite thing to do is not look at the internet. He does not like to look at his Twitter and Instagram. He uses these platforms occasionally. Somehow goes out of you. I don't think he follows me. The thing is this, to me, the internet is better when it's a one-way street. You know what I mean? Okay. I think Twitter is a lot better when you just put stuff out there and you close it down. Exactly. So I understand you're talking about. Yeah, right. I know what you're doing. But last night, the Look What You Made Me Do drops, debut single for Reputation. Not only does it drop, it it drops with them redoing TaylorSwift.com. New merch is up. Information is up on how to get tickets to the thing. Yeah, I joined the list. They're gonna have like physical challenges or something so I can improve my spot in line. I'm all about it. I hope it's like, hey, you try to get as many retweets on this thing. I'm",
            "start": 415.84
        },
        {
            "text": "****. Here we go. Well, you know why not? But what happens is song drops as we're saying goodbye to Gens family at the airport. So I see I retweet it right away. I was I am one minute. I was on it. I did the retweet with little sirens and then proceeded to put the phone in my pocket. Drive us back down. Drop off the car. Get out of the car. Go eat pizza. Then looked at my phone again. Like, now I didn't have the right cushy months, Joey. I didn't want to be. I didn't have the plug for the car. I didn't want to be in the SFO. Do one of these walking around. I was like, I'm gonna, I'm gonna put this off for a second and savor the moment when it comes. However, when the moment had come, then if we're done eating the pizza, delicious pizza, by the way, cause our pizzeria over there, Gallagher. Yeah, great. Open up. Look at",
            "start": 461.11
        },
        {
            "text": "and savor the moment when it comes. However, when the moment had come, then if we're done eating the pizza, delicious pizza, by the way, cause our pizzeria over there, Gallagher. Yeah, great. Open up. Look at Twitter again and it is on fire. It is a dumpster fire of everyone mad. Everyone's like, it's terrible. It's a horrible song. We hate. How could she do us like that? And I was like, okay, interesting. All right. It's bad. It's gonna be bad. So on whatever. So then I, you know, let you know, yeah, love these kind of people. Yeah, **** yeah, you do. **** hate these human beings. Yeah, who walk around, listen to their music. Yeah, but it was night time and it's just me, a Jones Street. **** a once. This is once every four or five years. Something does happen. I gotta do this sometime. So I did it. We played it and it was like, all right, cool. And to finish and I was like, all right. So it she's like, I don't think it's terrible. I don't think sterile either. I don't know if it's like my favorite Taylor Swift single of all time or",
            "start": 503.12
        },
        {
            "text": "right, cool. And to finish and I was like, all right. So it she's like, I don't think it's terrible. I don't think sterile either. I don't know if it's like my favorite Taylor Swift single of all time or whatever. Yeah, here's here's what I what I I know will happen and I don't like it, right? Is that whenever an artist, the very popular artists like Taylor Swift or Justin Timberlake or any of these people that are out there that are like **** mega music stars, yeah, they drop something and they try to do something new. Everyone can't my **** **** hurts. Everyone always complaints, right? Why isn't it exactly like that one? That's the **** war. She had the **** marching band. That by the way, the first time I heard that song, I was like, this song is terrible, right? First time I heard Justin Timberlake, Steve Allen, I was like, what the ****? What is this? Why is this not a SexyBack guarantee though? Flash forward a year from now, all you **** gonna be all skating to this song because you're like,",
            "start": 551.48
        },
        {
            "text": "Steve Allen. I was like, what the ****? What is this? Why is this not a SexyBack guarantee though? Flash forward a year from now, all you **** gonna be all skating to this song because you're like, that's that shit's hot. I was there day one. I love that **** ****. I was like, Justin Timberlake, you are **** up. I don't know what this new album is. And then a year later, like, I can't wait to get you on the pro game, right? So all I'm saying is this, it's the job of the artist. Let's get her Big Daddy. It's good-looking. Oh, I like it's Big Daddy. Where'd you get Big Daddy from? I would even like Big Daddy. I thought he was just making a cool bisexuals. Maybe like trance. He's like Bowie transcends sexuality. I listen to in the Castro. So maybe they just they just sing it all out. My point is this, you know, it's the same with movies. Wherever wants exactly the same, but slightly different, right? You can't complain when you get the slightly different. This is what artists are supposed to do. They're supposed to",
            "start": 585.74
        },
        {
            "text": "the same with movies. Wherever wants exactly the same, but slightly different, right? You can't complain when you get the slightly different. This is what artists are supposed to do. They're supposed to evolve their craft. If they don't, then they it's either evolve or die, right? It is. You tell me I'm just putting out the same **** like Taylor Swift sound from 10 years ago is not the sound now, right? It's not the same something. No, never wrong. Yeah, sorry. The own thing that has to be busted up and I saw you look over and I was like, someone said something else. Quartet says he's pushing his flip-flop. Hey, I finished it last night. Yeah, put it down. I was like, all right, cool. And then didn't replay. We went home and watched Catching the Release. You're required viewing. We're gonna talk about here in a second. Ah, then this morning woke up and I was like, I don't really remember too much about it. You know what I mean? Came in today. Started working on Kinda Funny Games Daily. Put on Spotify. Look, oh, let's",
            "start": 628.47
        },
        {
            "text": "ah, then this morning woke up and I was like, I don't really remember too much about it. You know what I mean? Came in today. Started working on Kinda Funny Games Daily. Put on Spotify. Look, oh, let's play that again. And then proceeded to play at a million fast. I mean, this is Ellie. I'm sorry. I think it's a dope beat. It reminds me of JJ Fad's Supersonic. Of course, it's got the right side friend, right? So it's got its got that late 80s like skating rink sound to it. Yeah, yeah, Supersonic, right? Oh my god, this is **** cool. This is a cool song that I just want to like roll to like, sure. What? Why no? So what's everyone's big beef about it? It just sucks. It's terrible. **** six months, Mel. You all know **** and be like, I was there that day that **** drop and it was hot as ****. See my finger and here's my fingers. Of course, I've admitted many a time. Well, what do I have tasting, Joey? Video games in people wings. Pizza. I say, but I know I allow to you go over it every time I put up. It's an hour ago. You",
            "start": 672.84
        },
        {
            "text": "fingers. Of course, I've admitted many a time. Well, what do I have tasting, Joey? Video games in people wings. Pizza. I say, but I know I allow to you go over it every time I put up. It's an hour ago. You saw those already. But I'm like, thanks for listening to the nuanced argument I made and not just the **** headline, you **** sheep. Jesus. Anyways, I have no taste when it comes to music though or movies or anything like that. So my whole thing is like, every time like what when it was getting ready to drop, Jen's like, well, what do you want out of it? I go, I don't know. I'm just excited for the new music. I don't know what it's going to be. Cause I've been I've been in the car before when I was driving and like, We Are Never Ever Getting Back Together came on the radio for the first time, right? Turned on the radio. That's a really great song. Wonder who this ****. When Weezer finally dropped the Green Album, I went to the midnight launch of Tower Records and I ran into friends from junior high. I was in",
            "start": 718.32
        },
        {
            "text": "the radio. That's a really great song. Wonder who this ****. When Weezer finally dropped the Green Album, I went to the midnight launch of Tower Records and I ran into friends from junior high. I was in high school. Yeah, right on soccer than before. Now song. I one of them weed my waiting in line for like 15 minutes. It fine. He's like, so is this killing you right now? I'm like, what? Waiting for the elements. Like, no, listening to it right now. I was like, oh, this is like, they've been playing and it just didn't sound like people change and evolve ever. You know what I'm gonna get? They have to, right? And that's just that's just part of music. That's just part of the game. There are the classic bands like AC/DC where you're like, okay, you're gonna put out the same sort of sound. But even at AC/DC, like, you look at their first album, you look at they're like, the last I'm gonna put us why it's pretty different. Yeah, right? You got you have to have that for a pop star like Taylor Swift though. You really do have",
            "start": 756.22
        },
        {
            "text": "at their first album. You look at they're like, the last I'm gonna put us why it's pretty different. Yeah, right? You got you have to have that for a pop star like Taylor Swift though. You really do have to make sure you're staying relevant and relevant is whatever the ****. Sure, you got to push the envelope, right? So I don't know. I mean, I give her some credit. It's not I don't think it's my favorite song she's ever done. But I mean, I didn't really I'm stupid. Shaffer Reputation though. Yeah, I don't know. I'm gonna do what I say now. Marty said, yeah, Marty does the trivia Jackalopes every Thursday. You should go. Marty, it said on Twitter, he has contingency plans. Yeah, well, so walk me through what happened, Greg. Can we hear her? All right. Yeah, all right. So we and so I saw that it dropped. So I have not just yelled across the bar. There's single eye drop. So he were we in the middle of we're in the middle questions. Okay. So he like a rush through the second half of questions when you get to the and then we",
            "start": 793.24
        },
        {
            "text": "yelled across the bar, there's single eye drop. So he were we in the middle of we're in the middle questions. Okay. So he like a rush through the second half of questions when you get to the and then we listened to it. What was the bar's reaction most like? Yeah, I mean, I was only talking to like two groups of people. So I don't know that anybody else really realized that it was Taylor Swift or that it was a new song. Okay. I like that. We played with listen to it again like in between rounds and then we're like, okay, yeah, I do actually like this. Yeah, cool. Remember talking of like, I don't know. I don't feel like I have a super discerning taste when it comes to like music. But Mia is my son. Their Maximum Cortez in the chat. No, no, he said she should have released it out of nowhere and we'd probably like it more. But when you hype it like you're announcing the cure for cancer, expectations are high. Sounds true. Someone else but agency point two of their saying she doesn't bill herself and she didn't. We",
            "start": 848.62
        },
        {
            "text": "it more. But when you hype it like you're announcing the cure for cancer, expectations are high. Sounds true. Someone else but agency point two of their saying she doesn't bill herself and she didn't. We don't see her as an auteur, right? She's not like a Kanye or I'm sorry. **** Kanye West. No, no, I just gotta I said, what do you mean by? I'm like, what does that mean? I just mean like we she does not the expectation is not that she's well like we're holding her to the standard of it's going to be the second coming of Jesus every time she dropped something. She just makes fun music. Sure. Like that's what she was doing. I would say a good segment of her audience does think that it is the second coming. I mean, I'm one of them, right? When she **** dropped the the Red album, I was in New York seeing Grand Theft Auto or whatever. And I like out those like, guys, I'm getting it. Woke up early. Downloaded off iTunes. Walk around New York listening to it. That's a great album. That's really quiet. But I do love 1989",
            "start": 897.02
        },
        {
            "text": "auto or whatever. I like out those like, guys, I'm getting it. Woke up early. Downloaded off iTunes. Walk around New York listening to it. That's a great album. That's really quiet. But I do love 1989 a lot. Look, all I'm saying is this, you can love Taylor Swift, you can hate Taylor Swift, but she's no Katy Perry. So I'm just **** around today or somebody said yesterday. Yeah, it's a weird one too. They got beef, man. It's the East Coast/West Coast beef. And he said they're both on the West Coast. Yeah, and badly. It's gonna end badly for one of them. Probably not really. No, leanza to fight the catfight. Just both of them **** each other up like Floyd Mayweather and Conor McGregor. Just drops it. Um, yeah, I don't know. I mean, what do you do? I think it's good song. Give it another shot. Everyone relax. Let them come around their own. Let them all be **** coming back here a little bit talking about good like, yeah, yeah, figure that out. Us, I still feel, are you signed up to for the thing? No. Will you go to Taylor",
            "start": 938.66
        },
        {
            "text": "around their own. Let them all be **** coming back here a little bit talking about good like, yeah, yeah, figure that out. Us, I still feel, are you signed up to for the thing? No. Will you go to TaylorSwift.com? You can there's a thing for tickets and you click on it and it's like, hey, we don't want scalpers getting tickets. So you need to link your Ticketmaster account. We'll send you updates about when they're going live. And then there's going to be like a virally thing to it of like, you can do this to improve your spot in line. Yeah, okay, cool. I'm on it too. So I mean, we I'll be looking out for you. I just like last time. I'm gonna go. There's many thinking talking about Ayala tickets. Cause I know I'm not gonna have trouble filling those. You know, I'll take a ticket. No, you can't. I'd love to see T-Swift super tour with Katy Perry. No, not this time around. But one day they are gonna reconcile and put on it's gonna be amazing. Guy, Super Tour, right? They call it Super Tour. Yeah, yeah. Oh, Greg, next news",
            "start": 1003.44
        },
        {
            "text": "story. Okay. Oh, this actually happened yesterday, but there was a follow up today that I wanted to talk with you about. James Cameron, of course, had an interesting quote about Wonder Woman yesterday. Said all of a self-congratulatory back-patting Hollywood's been doing over Wonder Woman. It's been so misguided. He told the publication, she's an objectified icon and it's just male Hollywood doing the same old thing. I'm not saying I didn't like the movie, but to me, it's a step backward. He went on to say, Sarah Connor was not a beauty icon. Cameron says she was strong, she was troubled, she was a terrible mother and she earned it. The respect the audience through pure grit. This is another reduction of Wonder Woman's legacy and perhaps even misguided and deep understanding his own character. The the",
            "start": 1042.29
        },
        {
            "text": "and she earned it the respect the audience through pure grit. This is another reduction of Wonder Woman's legacy and perhaps even misguided and deep understanding his own character. The the authorities basically his point was, his point that he was I guess he was trying to make was that we were still objectifying this Wonder Woman and it's still it's misguided and it's a bad thing to put out there. And Patty Jenkins had something to say on that on Twitter. She were she came back with, \"If we might have to always be hard, tough, and troubled to be strong and we aren't free to be multi-dimensional or celebrate an icon of woman everywhere because it's because she has attractive and loving, then we haven't come very far, have we?\" What are your thoughts on this? Because I kind of I kind of see both sides. I understand what James Cameron's coming from, sure, and I think his comment was intended to be positive and intended to say, \"Look, like the character of Wonder Woman while still iconic is still\"",
            "start": 1084.77
        },
        {
            "text": "sides. I understand what James Cameron's coming from, sure, and I think his comment was intended to be positive and intended to say, \"Look, like the character of Wonder Woman while still iconic is still like I get it, right? She's still owned a short skirt. She still has to be Gal Gadot, the most beautiful woman on the planet. She still has to be this picture perfect, like this picture of perfection.\" So in that regard, I understand where he's coming from. Like Sarah Connor was a flawed character. People are flawed in real in reality, so why can't we relate to more characters? In the entirety of Patty Jenkins' response: \"Sure, James Cameron James Cameron's inability to understand what Wonder Woman is or stands for to women all over the world is unsurprising. As though he's a great filmmaker, he is not a woman. Strong women are great. His praise for my film Monster and our portrayal of a strong yet damaged woman was so appreciated. But if women have to always be hard, I'm sorry, I have to always be hard, tough in\"",
            "start": 1124.39
        },
        {
            "text": "women are great. His praise for my film Monster and our portrayal of a strong yet damaged woman was so appreciated. But if women have to always be hard, I'm sorry, I have to always be hard, tough in trouble to be strong, that we aren't free to be multi-dimensional or celebrate an icon of women everywhere because she is attractive and loving, then we haven't come far far, have we? Right. I believe women can and should be everything, all in all caps. They're just like male lead characters should be. There is no right or wrong kind of powerful woman. And the massive female audience who made the made the film a hit is Kim Shirley, oh sorry, and the massive female audience who made the film a hit is can surely choose and judge their own icons of progress.\" That's the thing. I feel like James Cameron's argument has been boiled down to headlines. Sure, he blasts this. He does this a lot because I saw a tweet about it where it was actually funny of like it was The Vulture headline. I like, you know, James Cameron",
            "start": 1166.15
        },
        {
            "text": "has been boiled down to headlines. Sure, he blasts this. He does this a lot because I saw a tweet about it where it was actually funny of like it was The Vulture headline. I like, you know, James Cameron, you know, says Wonder Woman isn't an icon, right? Or whatever it was. And then it was the guy's response was, \"Season title gets pitchfork and torch reads quote in context. Oh, I disagree with you, but I understand where you're not.\" And I that's the thing. It's very much, yeah, here's a great example is I feel especially what Patty's talking about in her response, right? Is that regardless of how we feel or how James feel, we're not in this. We were not in this center. Sure. Today on Kinda Funny Games Daily, an audience member wrote in and this was a spoiler for you of what's coming up about, \"Hey, how did disabled gamers do what they do? How are they able to hang here? Should the industry do more for them?\" This in the writer is not a disabled person, right? I kicked it over to Steven at AbleGamers. I'm like, \"Hey, can you give\"",
            "start": 1209.83
        },
        {
            "text": "what they do? How are they able to hang here? Should the industry do more for them?\" This in the writer is not a disabled person, right? I kicked it over to Steven at AbleGamers. I'm like, \"Hey, can you give me a response to this question?\" Because I'm not in those shoes, right? I could have sat in here, Tim, and I could have sat here and been like, \"Well, we know there's these charities and we know there's controllers.\" But button like that on that, we're not in it. And I think that's the point Patty's making here is, I don't be wrong, I'm Sarah Connor, sure, was a strong female character, whatever. She was also totally unhinged, not a great mother. Like he's saying like, I didn't leave Terminator like, \"Man, Sarah Connor's awesome.\" Like I don't and I don't think, well, I mean, more women she's like Sarah Connor because she's like got so many there's so much going on, right? Let's not awesome. Let's not forget though that I mean Sarah Connor is one example of that and obviously Tim was talking about Sarah Connor this",
            "start": 1256.24
        },
        {
            "text": "like got so many, there's so much going on, right? Let's not awesome. Let's not forget though that I mean Sarah Connor is one example of that and obviously Tim was talking about Sarah Connor. This was a bill because Terminator is back in theaters this week, of course. And so you want to go through his I his his, you know, movie filmology of characters he's made. Well, he also is responsible for helping Ripley be an amazing character as well. Sure. That I think is more of an interesting argument where you're saying like you look at Sigourney Weaver, she's not Gal Gadot. She is not this this stereotypical iconic beauty, beautiful one, but she is still very strong. Will be back then she was not in. Yeah, but but okay, so look look at the movie he made, right? Aliens. Yeah. What what is sexy about her in that movie, right? Like not the one where she's in the white tank top of the white painting. So that's the first one. Okay. I think she actually might have been that one. That one of this one is well interesting.",
            "start": 1296.45
        },
        {
            "text": "right? Like not the one where she's in the white tank top of the white painting. So that's the first one. Okay. I think she actually might have been that one. That one of this one is well interesting, but she's in a hospital bed. Okay. This look at this look at this picture we have right here of like the two therefore the difference between the two characters, right? Like right. I think they're dinners in pain. All I'm saying is I think there is some merit to his argument of him saying in in in context of the quote, this is male Hollywood's still there still has to be her in a tiny little skirt showing legs, being sexy, being objectified. And that's what that was what his point was. He was like, \"Yeah, but I think he's stretching. I think if they really want to objectify her, put her in the star spangled briefs, bring her call it bring her neckline down to show more cleavage similar to this that when Zack Snyder fucked it up with all the.\" I think he's just I understand the argument he's making. I just don't",
            "start": 1335.99
        },
        {
            "text": "bring her call it bring her neckline down to show more cleavage similar to this that when Zack Snyder fucked it up with all the. I think he's just I understand the argument he's making. I just don't necessarily agree with it. I do think that Wonder Woman was a strong female character. I do think the movie didn't I think the movie could have gone way further in objectifying her in making her sexy bubble. Ah, I understand that the care the costume is revealing, but they went out of their way to make it not other way. I should say they went with an interpretation of it that is more coverage than what it is, but it is also based on 75 years of history for a character and how far you deviate and what do you want to do with that ball a lot. But I do think that coming through there weren't the normal boob jokes and you know, like even like she always felt in control of all the situations with Chris Pine especially, you know, like even when they're on the boat talking about it, she's not like afraid to like",
            "start": 1372.59
        },
        {
            "text": "and you know, like even like she always felt in control of all the situations with Chris Pine especially, you know, like even when they're on the boat talking about it, she's not like afraid to like talk about pleasure and talk about this and like not be like she was never like the princess about and not the princess of them scared like this, right? It says, \"Oh, you don't mean like.\" I think there's more in common with Sarah Connor, Ripley, and Wonder Woman than then then this quote or headline, however you want to be sure. And that's the thing because I don't know. I think that and I think that's what Patty's speaking to why I agree with her more and the fact that it's it is a great thing to flip the script then and like I what what about male characters? What about male leads, right? And the fact that all these movies you watch where the guy is perfect or as a bumbling idiot and somehow it ends up it with the perfect life or something to that effect. Ryan Vestal, same argument, right? That's what she's making.",
            "start": 1411.05
        },
        {
            "text": "movies you watch where the guy is perfect or as a bumbling idiot and somehow it ends up it with the perfect life or something to that effect. Ryan Vestal, same argument, right? That's what she's making. Why don't we stalk? Why don't we man final one? We talked about male characters as well. I don't but that's taking it that's taking it to a different that to me is taking the conversation one step farther, right? But I mean, I don't know what would James Cameron have to say about that, right? Maybe he would have he'd go fuck underwater in a little submarine. He would go he would go down to the bottom. No, I mean, I think that argument the same argument can be made for men, right? Like I mean, why why is every superhero look like what happen look like Chris Hemsworth? Yeah, right? You tell you that it's it's it is that it is that same objectification that we're that that's being applied to women being applied here. And I think his point was that like, yeah, she's a strong character, but she still is on some level",
            "start": 1449.9
        },
        {
            "text": "that it is that same objectification that we're that that's being applied to women being applied here. And I think his point was that like, yeah, she's a strong character, but she still is on some level. There still are some things that are being objectified about her and his character and could we could push it farther, i.e., you know, you go back and you watch Terminator. There's nothing necessarily like there are actually are scenes where she is being like molested in it, right? And it's disgusting. It's horrible. And we see her as a strong character going forward. Yeah. So I just think this I don't know. I think it's I think it's fascinating. I do see both sides. I do tend to side with Patty Jenkins, by the way. Sure. I'm not saying that, but I think see both sigh. Do you think, you know, James Cameron's quote or talk about how great Sarah Connor is in Terminator? Okay, cool. Let's watch Terminator one when there's a prolonged sexy man. I'm seeing when the hammer hits tip the entire time and she literally is the",
            "start": 1489.2
        },
        {
            "text": "talk about how great Sarah Connor is in Terminator. Okay, cool. Let's watch Terminator one when there's a prolonged sexy man. I'm seeing when the hammer hits tip the entire time and she literally is the doe-eyed like, \"Oh, what's all robots and I'll recess the saver and uh blah.\" Now granted in this the arc that's going in, it's a fuck really. I'm not staying away from that at all. Then going into like that actually does Shelley into the badass fuck, but also totally fucked out Sarah Connor we get to written. Yeah, fair enough. Interesting story. Next story. Let's go into this real quick. We're getting a little long here. Netflix is prepared for a Death Note sequel. If you are Netflix of quarter Death Note, of course, coming out today. I believe it's available on streaming services that people are getting literally the first paragraph. We talked with that a lot of people. Yes, I guess is warning this contains minor spoilers, but Netflix's Death Note aims to, yeah, yeah, yeah, I'll paraphrase this. They talked it",
            "start": 1527.12
        },
        {
            "text": "the first paragraph. We talked with that a lot of people. Yes, I guess is warning this contains minor spoilers, but Netflix's Death Note aims to, yeah, yeah, yeah, I'll paraphrase this. They talked it to the person who directed it, Adam Wingard. He was like, \"Yeah, I would totally love to do one.\" He is his goal would be to do more than two or three movies for in the Netflix series because he wants to do the series justice. But he goes on to talk about how he was like, \"Look, the anime is amazing. The manga is amazing. I wanted to do a different interpretation on and this is my interpretation on it.\" So he's hoping people like it, but it would be interesting. It would be really cool if he will like this if they did three more movies about Death Note because I think they really could tell the story. I'm interested to watch this. People are criticizing the fuck out of it. We'll see what happens. Everything people are hating. I want to sweep especially little fucks like Tim Gettys. \"Oh, they're taking my Japanese cartoon.\"",
            "start": 1573.02
        },
        {
            "text": "this. People are criticizing the fuck out of it. We'll see what happens. Everything people are hating. I want to sweep especially little fucks like Tim Gettys. \"Oh, they're taking my Japanese cartoon and ruining it.\" I don't know what. Go check that story out if you want a little bit more insight on what could be potentially possible for Death Note. We'll see if it does well this weekend. I'm sure. Well, next news story. Are you to watch this weekend? Yeah, fuck yeah. Nice. I'll probably tonight. Wait, what are you know watching a this night or tonight? The Verge reports this is fascinating at the Alamo Drafthouse clown only screening of Stephen King's It. He'll you'll float. Oh, the Alamo Drafthouse in Austin, Texas, last in the news for taunting MRAs. What's an MRA? What does that stand for? With women only screenings of Wonder Woman is back with a new exclusive event. This one in September 9th screening of Andy Muschietti's new adaptation of Stephen King's horror novel It. And you can only attend if",
            "start": 1611.84
        },
        {
            "text": "screenings of Wonder Woman is back with a new exclusive event. This one in September 9th screening of Andy Muschietti's new adaptation of Stephen King's horror novel It. And you can only attend if you were a clown. Quote: \"For this special screening of It, all attendees should arrive dressed as a clown in order to attend. Please arrive early and join us at the Barrel of Fun beginning at 5:30 p.m. for an It pre-party where we all have face painters available for clown touch-ups, the photobooth, raffle, surprises, and other terrifying merriment. Please arrive in your own Pennywise best and be ready to float with us.\" Would you go see It? 1,000% with ad with San Francisco clowns. Yeah, fuck yeah. What are you looking over and it's sitting next to you? I keep thinking, \"Mom.\" I'm like very it's it's all tongue-in-cheek. It's adding MRAs, male rights activists. I would have jumped out jump to conclusions on that one. Fair enough. Ah, that's holding where they imply queer had the touch-ups and what I like you",
            "start": 1657.29
        },
        {
            "text": "it's adding MRAs, male rights activists. I would have jumped out jump to conclusions on that one. Fair enough. Ah, that's holding where they imply queer had the touch-ups and what I like you can go. They're not dressed as a clown. They're gonna paint you facing or go see the fuck movie. But I'm looking September 9th is one person in here. September 9th is the screening. That's a Saturday. You gonna turn me down? But sister's gonna arrive. Do it. Do it. If they did it like I would totally cool. Greg and I would you go get cool concerts? Cool. Greg is not dressing up like a piece. Just not anything. Yeah, I definitely would not sleep. Oh my God, that sounds terrible. We've been partying it up. They're doing it San Francisco Alamo Drafthouse. Do it. Do it. Yeah, yeah. Here's the what I'd also pitch. Yeah, me and cool Greg go as the clowns. Awesome. Get little Kevin Coelho. Put him in the little yellow rain slicker with a Red Bull. Now I know it. We get there. It's creepy. Everyone have a fun laugh about it if we have to",
            "start": 1704.63
        },
        {
            "text": "go as the clowns. Awesome. Get little Kevin Coelho. Put him in the little yellow rain slicker with a Red Bull. Now I know it. We get there. It's creepy. Everyone have a fun laugh about it if we have to paint his face real quick. We'll penis face room. Yeah, yeah, yeah. But I think the problem is left. Okay. Nose on them. That's fine. Look at those in whiskers. Next story. Not much of a story here. I just want to give a shout out to The Tick on Amazon Prime. You know, I watched four episodes of it, three episodes. It is he's good. It is not the cartoon. Okay. Okay. So this is the this is the what I have to rectify. Okay. But it's more Tick and it's a good what I feel like is a faithful update to what The Tick should be. And if you remember, they tried putting The Tick on TV long time ago with Patrick Warburton. And I didn't like that at all largely because the car it was the cartoon was too fresh coming into this. I actually I'm getting into it. I kind of like it. I'm much different. Is the same interpretation? So it's",
            "start": 1747.26
        },
        {
            "text": "like that at all largely because the car it was the cartoon was too fresh coming into this. I actually I'm getting into it. I kind of like it. I'm much different. Is the same interpretation? So it's it's from the it's from Barry Sonnenfeld who pro directed he did direct this. He produced Men in Black. Okay. So what kind of feels like that? Okay. It's got that weird style to it. It's very self-aware obviously because he's a superhero and he walks throughout it never changes. He just looks like that the entire time. Yeah, it's funny. It's got it doesn't have it doesn't capture what the original cartoon captured. Okay. Which was that grandiose like where this is such a ridiculously fun over-the-top commentary on superheroes. Sure. That and it's and it's you know, I think it's a little bit more grounded, but I'm getting into it. Okay. I like it. So if you're a fan of The Tick and you can bring yourself to watch this, I think you'd like it. I think you give it a shot. Let me know what you remember liking the cartoon.",
            "start": 1794.97
        },
        {
            "text": "into it. Okay. I like it. So if you're a fan of The Tick and you can bring yourself to watch this, I think you'd like it. I think you give it a shot. Let me know what you remember liking the cartoon. I watched that. What is not something I've been asking for or thinking about. So it's hard for me to get psyched. Is this Jenna watch? It's fuck weird. And here's the deal about Amazon Prime stuff. Yeah. And they do a pilot program. Yeah. So they made one episode of The Tick. Yeah. And I was like, \"Oh, there's a new Tick series.\" So I saw I started watching is like half. I got nothing else to watch. I like The Tick. Let's see. Let's see if this one can take all my fancy. No pun intended. And I watched it. You only know you did the nickel wink, but you're only looking at me. So I washed it. I was like, \"All this actually pretty cool.\" And I went to watch the second episode. Not there for a year. I think it was like six, eight months later. Finally this pops up. New suit, by the way. Totally different look. Well, not I got mine and",
            "start": 1843.54
        },
        {
            "text": "cool. And I went to watch the second episode. Not there for a year. I think it was like six, eight months later. Finally this pops up. New suit, by the way. Totally different look. Well, not I got mine. And then they can talk about it. Hilarious. This is so like the next day. It's no, it's the same episode. It like just picks up with you. They're in the apartment being attacked. It's like, \"Oh, no.\" It's like totally I've been sued. But hey, we're just like he's like, \"You different.\" That's it. That's all I got. I think Arthur is a great job. Of course, Arthur in the cartoon series is in front of the family. Rob Paulsen. Shout out to Rob. Hope he's doing better. I don't know. I like it. Again, The Tick cartoon was in my opinion the best cartoon ever made. Wow. Yeah, really? Yeah. Wow. Okay. Yeah. Better than Batman: The Animated Series. I mean, Batman: The Animated Series can get on its fucking knees when it Ticks in the room. If you know, you know. It's like I do. You're making their Tick is a beloved car. I fuck loved The Tick when it",
            "start": 1883.04
        },
        {
            "text": "I mean, Batman: The Animated Series can get on its fucking knees when it Ticks in the room. If you know, you know. It's like I do. You're making their Tick is a beloved car. I fuck loved The Tick when it came out that it was just a fuck. I'm like, \"I don't understand how this got made. It doesn't make any sense.\" Yeah. You knew when you were watching The Tick that you were watching something special that most of the world wasn't gonna get. And then I was gonna go away soon and sure it after the second season, right? But The Tick and for those that are diehard Tick fans, give this a shot. Let me know what you think. Okay. I'm interested to see. I'm liking it more than I thought I would. You go as far as to say this is required viewing for next week. Sure. Why not? Episodes 1 or. You think there's only five of us. So I think you got to get those old. All right, fine. Required viewing for next week. All five episodes. How long are the episodes in like 20 minutes? I think 20 minutes. So does it Tick? There you go.",
            "start": 1927.02
        },
        {
            "text": "of us. So I think you got to get those old. All right, fine. Required viewing for next week. All five episodes. How long are the episodes in like 20 minutes? I think 20 minutes. So does it Tick? There you go on Amazon. A member if you have Amazon Prime. You of Twitch. Brian, give us that sub. There you go. Nick. Yes, it's hard to talk about. Guys, believe it is time to her to talk about it. They're required to. Now I remember three weeks ago we debuted required viewing and said, \"Everybody watch Catch and Release.\" So many of you did. And then we did it and didn't get weird on the show together until the next last week. And we said this the day Friday the 25th, \"Everybody watch Catch and Release. We're going to talk about it.\" Now I sat on my couch last night. Yeah. And I was like, \"I know it.\" Someone someone would tweeted at us. They were like, \"Nick, you know, watch Catch and Release. You can do your homework.\" Well, yesterday show you said you would. Guys said, \"Absolutely bold claim.\" But then I sat down and I was like, \"I have\"",
            "start": 1970.37
        },
        {
            "text": "at us. They were like, \"Nick, you know, watch Catch and Release. You can do your homework.\" Well, yesterday show you said you would. Guys said, \"Absolutely bold claim.\" But then I sat down and I was like, \"I have nothing else to watch.\" And I'm pretty fascinated. So I cued it up. Started watching it. And then you shot across the bow. I was already there. I was like, \"Do your fucking homework.\" And I was actually 10 minutes ahead then you were in the film. So I started tweeting you. And then I was actually retreated like, \"Hey, dudes, apart where they made out yet?\" Just to fuck with you a little bit. Yeah. But I was so engrossed in the film. Oh my God. I didn't even want to spoil it for us. So you're given Catch and Release a thumbs up. I there's a few thing. I'm surprised at how entertained I was by this movie. Yeah. A couple things that that that I really like about it. Sure. I miss Kevin Smith. I miss Kevin Smith on screen acting. Just acting. Okay. He is so adorably fun to watch. Yeah. As the sidekicky kind of foil character. Yeah.",
            "start": 2012.3
        },
        {
            "text": "that that that I really like about it. Sure. I miss Kevin Smith. I miss Kevin Smith on screen acting. Just acting. Okay. He is so adorably fun to watch. Yeah. As the sidekicky kind of foil character. Yeah. That I was like, \"Fuck, man. I really forgot how fuck awesome Kevin Smith is.\" Right? Cause you like me. I think stuff lately, but I'm kinda like artsy fuck like yoga hose ears like brought Nazis and she like, \"Okay.\" I mean, there's got Jay and Silent Bob's coming back. Sure. Which is good. So that's gonna be great. So we've seen it. But I was like, \"Fuck, I love Kevin Smith.\" Beautifully shot movie. Makes me want to go to Boulder, Colorado and just fuck hang out on a stream. Yeah. And I looked up. I was like, \"And by about five minutes, sounds like what the fuck? This movie's fuck gorgeous.\" Looked up same guy that shot Field of Dreams and a bunch of other really amazing movies. Okay. And I'm like, \"Wow, they really pulled they pulled some fuck, but they paid this guy some some scrap for this.\" Yeah. Love Timothy.",
            "start": 2047.94
        },
        {
            "text": "that shot Field of Dreams and a bunch of other really amazing movies. Okay. And I'm like, \"Wow, they really pulled they pulled some fuck, but they paid this guy some some scrap for this.\" Yeah. Love Timothy Olyphant's hair at the beginning and then at the end. Okay. You notice that it gets its scummy at the beginning toward the end. Beautiful. And I'm a huge Timothy Olyphant fan. Sure. Haven't watched Justified on the effects. Yeah. You fucked up, son. You fucked up, son. So overall, I will say I enjoyed this movie a lot more than I thought. I was like, \"No, don't do that. Don't put the asterisks on it.\" Is it a dick? You enjoyed it more than you thought you would. Is it a movie you enjoyed period? Is it a movie you liked? Is the movie you recommend? Do you what this movie fits? You know how you don't have the three counties, three categories in categories. There's that just this movie's terribly made. It's so insufferable. You can't watch it in this category. You have movies like The Tailor of Panama or movies like the",
            "start": 2089.52
        },
        {
            "text": "three categories in categories there's that just this movie's terribly made it's insufferable you can't watch it in this category you have movies like The Tailor of Panama or movies like the original Avengers with Ralph Fiennes and Uma Thurman we're halfway figure like this doesn't make any sense what is going on right now that's a bad movie sure right then you've got Academy Award movie in a room with real art you've got the last many things you've got sure you've got movies that are legitimately right then there's this beautiful category in here where I like to live people because you have movies that are enjoyable and I thought I thought this movie was enjoyable that's gonna be my review okay you know what I'm enjoying this it's light-hearted nothing really bad happens except for like at the beginning the guy's dead I you know yeah you know really like even the third act turning point where it's like you know the part where everything's supposed to go to shit yeah it's just",
            "start": 2130.56
        },
        {
            "text": "like at the beginning the guy's dead I you know yeah you know really like even the third act turning point where it's like you know the part where everything's supposed to go to shit yeah it's just him standing out there with coffee she's like it was nothing really and he just gets heartbroken and you're like alright well that's easy to come back from you just apologized which spoilers at the end she just apologizes and they're good to go yeah so it's light-hearted you know there's lots of silly jokes I didn't particularly care for the character that was the shit length on the roommate yeah yeah that character I was like this is annoying but again that's what it's about it's definitely moving it's a sign of the times oh yeah 2000s is very present in that movie we pull up in Timothy Olyphant's shit like bear bell-bottom pants that he's wearing and the studded belt yeah and the hair with a really terrible shirts and the shit cargo pants yeah cool about that Jennifer Garner not my",
            "start": 2180.87
        },
        {
            "text": "shit like bear bell-bottom pants that he's wearing and the studded belt yeah and the hair with a really terrible shirts and the shit cargo pants yeah cool about that Jennifer Garner not my favorite part of them yeah not my favorite part of it I love Timothy Olyphant again Kevin Smith coming through the kid I thought was great Juliette Lewis always always a pleasure sure always a breath of fresh air coming in you know we loved her at Natural Born Killers who'd be pretty much the same movie really what is your take on Entourage they did this shit move yeah he did God did I know like a tad to the point that I was like I had a pretty one to go outside again or whatever and I like I've only gone through not even half of this movie yeah like I was at 55 minutes I think I said pretty much half whatever so we came back in and I let go for the door like I just fast forwarded I'm like get me you missed the nuance all the middle column Kevin Smith falls in love with a kid and then it",
            "start": 2217.8
        },
        {
            "text": "much half whatever so we came back in and I let go for the door like I just fast forwarded I'm like get me you missed the nuance all the middle column Kevin Smith falls in love with a kid and then it ends up winding up with Juliette Lewis not even get some efficient it makes life because then you didn't even get to the Catch and Release at no point do they actually release the fish she makes the comment shit terrible yeah yeah yeah it was just like it was a movie it was it was a multi-car accident but the cars were all plot lines of like it was just like this explosion I'm like all right cool her fiance is dead she's dealing with that right cheated on her we're gonna oh now the kid and the lover are in the movie the two friends want a shit but they're dealing with the debt and Kevin Smith's gonna kill himself Tim is the old fence the shit other people but he's also here but he's a good kid just like Jesus I couldn't even try oh then I guess so here's another car coming in the mom",
            "start": 2256.39
        },
        {
            "text": "gonna kill himself Tim is the old fence the shit other people but he's also here but he's a good kid just like Jesus I couldn't even try oh then I guess so here's another car coming in the mom wants the ring and she's a shit as I go yeah shit god but she how do you care about the guy who's dead so why would I care about the turmoil surrounding his death then it turns out he's a complete shit douchebag yeah he was a shit he loves shit and I'm watching this in and it was the same thing too here's what I always say ladies and gentlemen you know I talked about being positive being a positive person so I'm being very clear here that I don't it's not that I don't I'll put it out there and then talk about it as actors I don't enjoy Jennifer Garner and I don't enjoy Juliette Lewis sure and now Juliette Lewis of course playing the same character she the same character he played in shit I was right there till we start Old School and she plays at the same character she's played in",
            "start": 2305.11
        },
        {
            "text": "sure and now Juliette Lewis of course playing the same character she the same character he played in shit I was right there till we start Old School and she plays at the same character she's played in everything I'm just like it my actually good same character she we don't know the flighty ritual but she's gonna cheat but she didn't know but she's got a good heart but she's surrounded by bad stuff all right whatever I'm over that character I don't like seeing her and that portray that thing anymore and again I don't like their portrayals here this isn't me being like sure I shit hate this person they all seem like nice people Jennifer Garner same thing where I just like to say I didn't like 13 Going on 30 that much because I just don't connect with her her for some yeah I was never a huge Jennifer Garner fan obviously like everyone loved Alias that's where she got her start I never watched that series I just I just I never like she came into pop the pop culture and I was like okay",
            "start": 2346.33
        },
        {
            "text": "Jennifer Garner fan obviously like everyone loved Alias that's where she got her start I never watched that series I just I just I never like she came into pop the pop culture and I was like okay Jennifer Garner and then she married Ben Affleck I was like okay that was that was all right she's like she's like we're kind of everyone the rumor is she's responsible for Kevin Smith and Ben Affleck not being friends anymore and I'm like that's that makes me not like you but it's just a rumor exactly so my spirit that's off kind of camera session don't worry about that okay in the chat I like this one too Kyle Talked Record I need a Catch and Release is better than The Departed big score peanut-shaped eye truth phone time everybody let's pick it up The Departed is better than Catch and Release by far by far by far so many different reasons but I was surprised I think a large portion of why I liked it or whether I found it enjoyable it was because it was a sign of the times it",
            "start": 2384.97
        },
        {
            "text": "Release by far by far by far so many different reasons but I was surprised I think a large portion of why I liked it or whether I found it enjoyable it was because it was a sign of the times it brought me back to the early 2000s of watching him was sick yeah all of that bad shit just all of a bad fashion yeah I was like oh wow this is really like him it's like when I you know I graduated college 2000 I was what I was very present in in in the world during this time and I remember that table and I remember wearing those jeans they're like shit man this is that's maybe not sure for sure and I'm definitely an interesting part of it but it was just like it felt to me as I knock my glasses off that similar to how Tim was described Uncharted: The Lost Legacy as the middle part of an Uncharted game without the beginning of the end and I shouldn't I won't comment at the end when we get dropped into this world it felt like we were halfway through a season of television already yeah",
            "start": 2427.12
        },
        {
            "text": "Uncharted game without the beginning of the end and I shouldn't I won't comment at the end when we get dropped into this world it felt like we were halfway through a season of television already yeah what am I supposed to know all of you and care about you because I don't and you're not and that's something like Kevin Smith obviously we all love Kevin Smith so it's like right I have a they're like it's a very paint-by-numbers movie in terms of like oh yeah it's all telegraphed how this is gonna go down or whatever look this is a it's a light-hearted rom-com yeah right that's what this movie is yeah if you expect to get to be anything more than a light-hearted about it's 13 Going on 30 again you know like it it's all that it fits in that little fluffy area of movies where it's like nothing's coming out this weekend right Catch and Release right we'll see let's make a little bit of money so it's a quaint little rom-com okay quaint little rom-com okay right okay they didn't know here's my",
            "start": 2475.36
        },
        {
            "text": "coming out this weekend right Catch and Release right we'll see let's make a little bit of money so it's a quaint little rom-com okay quaint little rom-com okay right okay they didn't know here's my wasn't enough column for my team there was not a lot of comedy yet and they drastically underutilized the raw talent that is Timothy Olyphant Timothy Olyphant a star he is a national treasure and he's a badass go watch Justified and tell me anything other than that okay I won't accept it I won't accept it alright are we recommending people watch Catch and Release for me you are I'm now I'm not recommending people watch it I enjoyed it yeah don't spend your money on this movie okay this is terrible remember uh Freeman in the chat or you know you know Mark Freeman oh yeah he said he's watched it's like he loves this movie you watch it like a bajillion times I'm not saying I'm just saying I could understand it stance who you like and you want to get in it I can understand this being a guilty",
            "start": 2511.39
        },
        {
            "text": "like he loves this movie you watch it like a bajillion times I'm not saying I'm just saying I could understand it stance who you like and you want to get in it I can understand this being a guilty pleasure film for a lot of people out there well okay you want to read some tips sure go for remember ladies gentlemen you can tip us here and then we read your comment on the air that's basically the thing you click on it down there cool Greg goes on by one first tip of the day it wasn't The Girl Next Door comes from Mr. Yazman300 Guys Arias I tweeted you links explains why I'm leaving social media and Kinda Funny community I also posted on Discord for Kinda Funny Best Friends this is my last tip P.S. Netflix that sucks it's all rated Twilight I don't understand I missed everything you're talking about I'm sorry you're leaving Twitter you're leaving social media and the Kinda Funny community leaves talking about already okay I mean is it about just Kinda Funny or is it about like social",
            "start": 2555.94
        },
        {
            "text": "about I'm sorry you're leaving Twitter you're leaving social media and the Kinda Funny community leaves talking about already okay I mean is it about just Kinda Funny or is it about like social media in general social media in general alright cool so it's not something on us thing I do really appreciate the last words you want to say though Netflix that know sucks it's already Twilight which that's cool to me right we wish you the best good luck Aaron M94 gives a tip and says going to a strip club for the first time tomorrow for a bachelor party my wife is excited for me but I'm a little bit apprehensive and have any advice on how to make my time as enjoyable as possible it's awkward and weird don't worry about it go in with a group of people that you want to hang out with and have fun with those people so we did in Vegas yeah yeah we can be awkward weird look GamerBarboo I'm writing a game design document and was wondering if it's weird not to have any progression system just a",
            "start": 2599.38
        },
        {
            "text": "with those people so we did in Vegas yeah yeah we can be awkward weird look GamerBarboo I'm writing a game design document and was wondering if it's weird not to have any progression system just a game about beating a boss at the end of a stage P.S. The Departed is trash yeah I like how a lowercase The Departed yeah just to show us a little less respect yeah yeah ah no that's fine games can do whatever you wanted to be yeah you know no progressions fine just make sure you got some really cool shit happening nobody okay Oh Matty G gave a tip and said I'm with Kandy and E on this one Taylor Swift is a pop artist making pop music not sure I understand the hype I also remember when she was country ish well first off yeah I remember when she's country this high fell in love with it first I'll be shit kidding me I'm a girl then number one single started for the country right exactly yeah she's a little country girl uh number one and number two yeah she's pop music I don't I bet high",
            "start": 2641.06
        },
        {
            "text": "I'll be shit kidding me I'm a girl then number one single started for the country right exactly yeah she's a little country girl uh number one and number two yeah she's pop music I don't I bet high position means great pop music yes you're gonna say she's pop artist making pop music I'm not sure I understand the hype why the shit do people give a shit about Michael Jackson King of Pop how dare you King of Pop how dare you sir I'm sorry did he is or was he revolutionizing music he was him and Quincy Jones shit killer words he walked backwards I can't believe you said that after that whole shit Kanye thing like you're bold today I'm very bold cool Greg I'm not afraid to go out there and say Who I am in bear oh my point my point in saying that is that Kanye West tries to build himself as the alpha right he tries really a criminally insane person we went walk around the streets what I'm saying my point is like I don't think Taylor Swift until she was not out there going like",
            "start": 2685.34
        },
        {
            "text": "himself as the alpha right he tries really a criminally insane person we went walk around the streets what I'm saying my point is like I don't think Taylor Swift until she was not out there going like I'm the second coming of Christ she just thought she okay she's not criminally insane person so she's just making music yeah she's like I'm gonna make some shit music yeah you're gonna like my music that's all while I'm here what's your based on that criteria too Beatles overrated well we're British now why should drugs if you say anything about Led Zeppelin I will punch you in the face sir I don't know much about Led Zeppelin I really have enough to say stop listening to country they have at one arm drummer right is that right know that Lynyrd Skynyrd so I'm thinking I thought was Molly crevice Brittany attacks I'm turning 21 on Sunday what are some of the crews favorite drinks I should try I'm not a get drunk kind of person I'm just looking to try some good drinks",
            "start": 2727.7
        },
        {
            "text": "crew didn't Molly crevice Brittany attacks I'm turning 21 on Sunday what are some of the crews favorite drinks I should try I'm not a get drunk kind of person I'm just looking to try some good drinks love you all Evan Evan no matter what you drink and if you if you want to get drunk on a person you haven't been drinking for a while any of the drinks we recommend will not taste good too you know with the exception maybe like a Moscow Mule yeah get a Moscow Mule something that covers up I mean if you're gonna do like an Old Fashioned it's gonna taste like paint Finnerty I like apple juice and Hennessy okay god damn does that taste like apple juice yeah and it starts to make apple juice does not taste good anymore it starts tasting like Hennessy if you want like the day after and stuff you know going onward what when are we gonna get some apple juice and Hennessy up in here I have it all the time really can you make me one right now I'm gonna try it I'll give you some shit Hennessy an",
            "start": 2771.31
        },
        {
            "text": "going onward what when are we gonna get some apple juice and Hennessy up in here I have it all the time really can you make me one right now I'm gonna try it I'll give you some shit Hennessy an apple just go deep down this way rabbit hole I'm the final tip for this show remember I will read subs and tips well the will read subs when we finally finish this one will read subs and tips that come in during Kinda Funny Games Daily after this Justin Ryan Bear says Nick have you ever seen this clip of Gal Gadot checking out Chris Pine oh shit I have it cool Greg open it god damn that's sexy she's not checking him out yeah but she does nothing we were let go come on son I'm always sexy when somebody bites her lips whether your girl are gay no she here's what happened she looked at him and she was like god I'm so happy I'm Gal Gadot and just smiled that's it that's all that was a great point too I am guys we always do this shit and sometimes sure women are women or you know attracted",
            "start": 2814.66
        },
        {
            "text": "was like god I'm so happy I'm Gal Gadot and just smiled that's it that's all that was a great point too I am guys we always do this shit and sometimes sure women are women or you know attracted but most of that we look that was shit sexy I was sexy no one said it was a sex what the shit is he where what is that shirt he's wearing we talked about Chris Pine we're whatever you want we can no I'm me towing that shit sir it's not the 70s anymore get the burn that polyester shirt thank you very much you're staying at the Gal Gadot have somebody ever seen the one and I don't know if it's a hundred percent sure I saw it on Reddit though and it's titled and it looks like this is how it happens Nick but I'm not sure if this is really how it happened but it's Tom Hiddleston and Brie Larson on a red carpet you've seen this one know where she's in a very low-cut revealing dress and it looks like he looks over and looks at her breasts and then she looks up and makes eye contact with her and",
            "start": 2863.02
        },
        {
            "text": "a red carpet you've seen this one know where she's in a very low-cut revealing dress and it looks like he looks over and looks at her breasts and then she looks up and makes eye contact with her and then they both laugh that's what happened cuz that's like you'd be like we're out with any of our female friends you understand this is you look I'm shit awesome you look up you learn you look shit awesome you know you look awesome it's great yeah this ladies and gentlemen it's time for P.S. I Love This Best Friend XOXO remember you can go to KindaFunny.com/bestfriend you go there you recommend somebody tell us why they're doing something awesome in the community we read their name here everybody loves each other we build a great community that's very positive and amazing Chelsea Lewis wrote in and he's shouting out Kayleigh Boomer somebody I've never heard of just kidding I know her very well Kayleigh helped me through some really tough times when I went through a breakup and the",
            "start": 2902.07
        },
        {
            "text": "wrote in and he's shouting out Kayleigh Boomer somebody I've never heard of just kidding I know her very well Kayleigh helped me through some really tough times when I went through a breakup and or any ensuing upset and has been a constant person I can reach out to especially now that I've had a great relationship she's always there for me to laugh or cry or text at 4 a.m. shoutouts to you Kayleigh Boomer you're awesome that's what Kinda Funny Best Friends are all about thanks for being part of community all of you remember KindaFunny.com/bestfriend to recommend folks there you go Nick yes sir are you ready to give away video you are so ready remember ladies and gentlemen the each and every day here on Twitch.tv/KindaFunnyGames and pocket services are on the web and YouTube.com/KindaFunny we give away a game on this show you can win just by being in the Twitch chat like so many of you are",
            "start": 2940.17
        },
        {
            "text": "such Kinda Funny Games and pocket services are on the web and YouTube.com/KindaFunny we give away a game on this show you can win just by being in the Twitch chat like so many of you are or you can amplify your chances by subscribing to us on Twitch if you subscribe to us on Twitch you it's Kinda Funny logo next your name cool emotes private chat time with us you get to play multiplayer games with me like we're doing on Tuesday with Everybody's Golf we don't know how online works yet I'll get back then we're doing you to get the show ad free lets me bake him in like we're about to but you get the show when you do it without having to see the ad me start it you understand cool good i also remember if you have Amazon Prime you have Twitch Prime you get one free sub each and every month we'd love for you to give it to us it'd be awesome but if you have real money you just want to pay for this up that's great too you're also Patreon.com/KindaFunny or Patreon.com/",
            "start": 2987.06
        },
        {
            "text": "month we'd love for you to give it to us it'd be awesome but if you have real money you just want to pay for this up that's great too you're also Patreon.com/KindaFunny or Patreon.com/KindaFunnyGames and are there subscribe to us at the $5 level you are automatically entered to win every game we give away here i think i left that on the first part Twitch subs automatically entered to give every giveaway don't need to be here it's great you're doing a great job today thank you because i have a shit party in the next room what you're doing great job I know right hey shut the door Shelley are ya Jesus Christ shut the door distracting door shut the door it's so distracting the show's brought his luck by the Ultimate Side Hustle mmm is it me I'm ready to copy is it me or does it feel like summer is already over there's so much I still want to do I would like to eat a footlong I've never seen a footlong on it don't really know you have a footlong oh yeah yeah alright well",
            "start": 3023.24
        },
        {
            "text": "it feel like summer is already over there's so much I still want to do I would like to eat a footlong I've never seen a footlong on it don't really know you have a footlong oh yeah yeah alright well if there's something you want to accomplish and getting extra money can help you do it drive me with Uber's an easy way to earn extra cash when you want on your schedule that's why driving with Uber is the Ultimate Side Hustle and you can make every day payday thanks to Uber's Instant Pay you can cash out straight from the app up to 5 times a day make the most of your summer and earn extra cash when you want to help meet your goals like a footlong hot dog get your size sign up to drive with Uber today go to Uber.com/drivenow that's Uber.com/drivenow Uber.com/drivenow certain restrictions apply see site for details today we're giving away Friday the 13th on the PlayStation 4 and it's going to be Brock111 from Twitch ladies better enjoy it enjoy it I hope you get a",
            "start": 3072.4
        },
        {
            "text": "apply see site for details today we're giving away Friday the 13th on the PlayStation 4 and it's going to be Brock111 from Twitch ladies better enjoy it enjoy it I hope you get a footlong hot dog and play every amazing actually that's a good Friday night right there 13 of the gigantic shit hot dogs already three and fluid that is three of the random questions from the chat three of the sub only questions from the chat let's pop in Let's Him House says Joey needs ladies room we have the rest we have one bathroom this mean you're always in it you're always in it mate for 30 minutes at a time I was wanting to Pee Stream Ian says Nick Floppy Know what is required viewing for next week well clearly one of us wasn't paying attention earlier it's The Tick on Amazon Prime that is the required viewing for next week A Puffy Carry-On says well Kevin me filming Greg's cancer panel at PAX I feel like I'd be super good archive of it since it won't be streamed like Tim said under that is",
            "start": 3119.93
        },
        {
            "text": "Greg's News 400 Totalbiscuit the Greg is inspiration for anyone who knows him and what he's been through a great example of how to deal with cerebral illness no I'm the only one from Kinda Funny going up to old PAX West we've talked briefly about trying to figure out how to get a film I would like to I think it'll be something special but we're looking into it nothing to announce at this time but if you want to PAX West Sunday night 5 p.m. I'm doing a panel about my cancer 5 year anniversary you should come Drew Baca 1313 says Greg are you playing Everybody's Golf already I cannot comment on any rumors or speculation about what might be happening at the Indy Boy Freeman says Catch and Release is a great film don't listen to Nick and Greg I said it was fun I'm just saying you know I mean it's",
            "start": 3177.05
        },
        {
            "text": "rumors or speculation about what might be happening at the Indy Boy Freeman says Capture/Release is a great film don't listen to Nick and Greg I said it was fun I'm just saying you know I mean it's not great fun we're going into subscribers only what the **** is good some like put a clip here this is not a fun Club guys this is you making fun of a stripper street performer it's just that's rude will someone throw something at her no I think it's the stream performer singing about like I think I saw this I didn't watch it it was on Reddit I think where it's that she's like saying I'll suck at your dick for a cup of coffee or something like that something like that yeah whatever here totally the name yourselves Greg what's your new date for Persona 5 since August is almost over I believe my original I wanted no much in July so I don't know the date there is no date before the end of the year it's like you shove it in Cheeks_Juniors **** face that's it that's where we are",
            "start": 3216.1
        },
        {
            "text": "my original I wanted no much in July so I don't know the date there is no date before the end of the year it's like you shove it in Cheeks_Juniors **** face that's it that's where we are right now OhDeeDeeYou're10 says Nick I like death no but it's a lot different didn't love it I'm expecting it to be very different I'm not expecting it to be the serious you don't see the same thing over again artists to grow do you want to why if you want to watch if you want to you want the resources you'll read the manga if you want to watch them enjoy anime read the **** watch the anime this is a different interpretation it was a third **** time I don't understand what people have this little tiny Matrix says Greg is a cheater he's getting days of practice before the rest of us damn it Nick Floppy no stop him now as you may know let's say hypothetically I'd got a game code this morning I gotta work all **** day I gotta go to Vegas tomorrow and I'm not gonna pack a PS4 for one",
            "start": 3264.14
        },
        {
            "text": "it Nick Floppy no stop him now as you may know let's say hypothetically I'd got a game code this morning I gotta work all **** day I gotta go to Vegas tomorrow and I'm not gonna pack a PS4 for one night rip so don't worry about it all right not to mention we're talking Hot Shots Golf here every golf just plan on Vita get your practice in there all right hit the links you know I mean cool Greg yeah looking for one final one sit down this isn't a final one Sadam714 says Greg is not gonna finish Persona 5 I'm sorry I'm sorry you're **** a liar and you're wrong and I expect an apology on this show when I'd be pursue Dr. Perez says you should make the required viewing The Departed so Nick can flip-flop to the fact it's an awesome movie have you seen The Departed yeah we talked about this I've had a conversation with you about it who did me it what would you take on it I remember liking it but I don't remember anything other than Marky Mark killing the guy at the end ok ok but I",
            "start": 3301.16
        },
        {
            "text": "this I've had a conversation with you about it who did me it what would you take on it I remember liking it but I don't remember anything other than Marky Mark killing the guy at the end ok ok but I remember enjoying it at the time ok it's not I've never thought back yeah because it's not good okay ladies and gentlemen this has been the Kinda Funny Morning Show each and every week to hear on Twitch.tv/KindaFunnyGames we run you through the nerdy news you need to know about before jumping the chat dance your questions comments and concerns in between those two segments we give away a video game we have a lot of fun we answer your questions we argue about things because we're all friends you like it it'd be great if you subscribe to us here on Twitch if you have Amazon Prime you can do it for free with Twitch Prime if there every 30 days if you have real money you can just do that it's awesome - you can also go to Patreon.com/KindaFunny or Patreon.com/KindaFunny",
            "start": 3345.29
        },
        {
            "text": "can do it for free with Twitch Prime if there every 30 days if you have real money you can just do that it's awesome - you can also go to Patreon.com/KindaFunny and funny or Patreon.com/KindaFunnyGames support us there get hourly access to all the shows have a great time remember the Kinda Funny Morning Show goes up on podcast services around the globe and YouTube.com/KindaFunny every afternoon so you never have to miss a moment of Nick Raymond Nick Oh someone's the required who should be In Bruges with Colin Farrell that Lily was painfully it threw them something oh good till next time it's been our pleasure sir you",
            "start": 3383.3
        }
    ]
}