{
  "id": 2944,
  "video_id": "7GoPPJL_4V0",
  "show_name": "Kinda Funny Games Daily",
  "hosts": ["Greg Miller", "Danny O'Dwyer"],
  "title": "GTA Goes PUBG, RIP Miiverse - Kinda Funny Games Daily 08.29.17",
  "description": "Why didn't Danny and Greg see this coming?!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
  "published_at": 1504042975,
  "duration": 3602,
  "transcript_chunks": [
    {
      "text": "What's up everybody, welcome to Kinda Funny Games Daily for Tuesday, August 29th, 2017. I'm one of your hosts, Greg Miller, alongside me, Irish Cream. Oh yeah, Danny got the cream. Cat got the cream. I'm their only other phrase I can think of. Gothic, is that a phrase? That's an idiom, is it? Check out the cream. I'm not sure that one. The cat got the cream. I mean, you gotta get a cream. I mean, that's like milk and cream stuff. Yeah, kindafunny.com/yourewrong if you're watching live. I want to correct us if that's not a real turn of phrase. Sure it is. Amy Gillis is watching, she'll let us know. I'm sure Kat, it's not an Irish thing. You sure love cream. Regardless, yes, I'm aware that they love cream, but I mean, that's like giraffe got the tree. That I mean, that's a great idiom. Yeah, dammit. If you didn't know, ladies and gentlemen, this is Kinda Funny Games Daily each and every weekday on a variety of platforms. We run you through the nerdy video game news you need to know about. We give you",
      "start": 2.33
    },
    {
      "text": "You didn't know, ladies and gentlemen, this is Kinda Funny Games Daily each and every weekday on a variety of platforms. We run you through the nerdy video game news you need to know about. We give you perspective, we answer your questions, we read your bad PSN names, and we have a good time. If you like that, you can watch live as we record it on Twitch.tv/KindaFunnyGames. If you're watching there right now, remember we don't read the chat. We make a polished podcast. You can only contribute if you go to kindafunny.com/yourewrong. Tell us what we screw up as we screw it up. At the end of the show, we set the record straight. Also, remember if you're watching live, all tips donated today on our Twitch stream, we're doing Everybody's Golf after this, are going to the Red Cross for Harvey relief. So if you feel inclined to go ahead and do that, Nickleby in to read those before I start playing some golf. If you're watching later, hey, you get the show on YouTube.com/KindaFunny",
      "start": 52.65
    },
    {
      "text": "relief. So if you feel inclined to go ahead and do that, Nickleby in to read those before I start playing some golf. If you're watching later, hey, you get the show on YouTube.com/KindaFunnyGames or podcast services around the globe. Housekeeping for you: there's a new Party Mode up, it's Driveclub VR. It's over at Patreon.com/KindaFunnyGames. It's hilarious. I appreciate it. You need to stay all the way through the end, just like every Andy Cortez Let's Play. Tomorrow is the Nindies Showcase, Nintendo talking some Indies. It's gonna be 10:00 a.m. We will be streaming here on Twitch.tv/KindaFunnyGames. Come watch along with us. 10:00 a.m., me and Tim, see what these guys got up their sleeves. Maybe we're gonna talk about what I think is gonna happen there, 'cause I think somebody might have kind of let the cat out of the bag as we get lower, right? Get down in there in the real cab where it got the cream. **** shut up, Danny. Also, PAX is coming up. It's this weekend, Saturday, and five is",
      "start": 89.55
    },
    {
      "text": "a kind of let the cat out of the bag as we get lower, right? Get down in there in the real cab where it got the cream. **** shut up, Danny. Also, PAX is coming up. It's this weekend, Saturday, and five is the What's Good Games panel. And go check out Andrea, see what she's up to. Saturday 8:30 is my Batman Crowd Play. Sunday at noon, Danny's Witcher panel. Yeah, I'm see him Sunday at noon as well is I'm signing at the Rooster Teeth booth. So go to that, man. A long time, like two hours. So I'm pretty sure you can go see The Witcher panel and come back. We're witching for a good 90 minutes, maybe. Alright then. I do you like the wouldn't show that much? It's up to you. Who care? There's a documentary coming. You know, make a choice. Watch that. I'll sign other places. And then Sunday at 5:00 p.m. is my cancer panel. Come see me cry. For now, let's begin the show with what is and forever will be the Roper Report for some news. There are five items on the Roper Report dozen. Number one, Danny, we are stupid as hell. I know.",
      "start": 128.88
    },
    {
      "text": "come see me cry. For now, let's begin the show with what is and forever will be the Roper Report for some news. There are five items on the Roper Report dozen. Number one, Danny, we are stupid as hell. I know. Alright, for weeks and weeks is the beginning of this show. Yeah, we've been talking about PUBG, and which console game would be the first to rip this off? And we were like, \"Oh, it'll be Ubisoft. Oh, it'll be that. Maybe they'll put in The Division.\" Maybe it'll be hearing today, Grand Theft Auto Online's new update is live. It is the Smugglers Run update that we knew about, that we talked about on this show before. But it also introduces new Adversary Mode, Motor Wars, blending the adrenaline rush of Drop Zone with the claustrophobic tension of a match in of pendency. They've taken two things that they already have. Did this. They clearly made this. This is their idea. This brutal Adversary Mode is a deadly scavenger hunt where second place is not an option. Up to four teams parachute into a periodically",
      "start": 167.51
    },
    {
      "text": "have did this. They clearly made this. This is their idea. This brutal Adversary Mode is a deadly scavenger hunt where second place is not an option. Up to four teams parachute into a periodically shrinking kill box. True to the lethal assortment of guns, explosives, weaponized and weaponized vehicles. Box not a sorry. Exactly. Not alone on the same thing. Work together, find a vehicle, and fight opposing teams and the shrinking map to survive and win. To catch that base, to get that stake. We knew it was coming. We knew something's gonna do a book, man. I I never ever thought about Grand Theft Auto. What a perfect fit for it. Totally. Especially because over the past like two years, they have they've added in like loads of game modes that you wouldn't consider like traditional GTA Online modes. Like they've gone crazy. Like they basically just said whatever. They've opened up toy box and it's gone everywhere. And like the the stuff they added in with all the the crazy ramps and like all the different types of",
      "start": 217.49
    },
    {
      "text": "crazy. Like they basically just said whatever. They've opened up toy box and it's gone everywhere. And like the the stuff they added in with all the the crazy ramps and like all the different types of race you can combine so many different types of game modes to sort of make your own custom game modes now. And let alone all the the the sort of out of the metagame stuff that they've been adding in probably in the first year more so. Sure. So it it kind of made sense for whatever reason when they designed GTA Online, they designed it in a way that has allowed them to expanded way beyond what we thought that game was supposed to be. I'm sorry. Especially in the Heists, right? Exactly. It's really existing world and do missions that cool stuff from the single player. We're gonna do it in multiplayer. Yeah, especially because it's Rockstar, because they've we traditionally have always been so like hands on and tight with what they're doing with the games. Yeah, and the modding community has count on all the",
      "start": 266.36
    },
    {
      "text": "because it's Rockstar, because they've we traditionally have always been so like hands on and tight with what they're doing with the games. Yeah, and the modding community has count on all the fun stuff. They've actually sort of adopted a lot of the fun stuff in it. So yeah, I don't know. I blame Yves Guillemot for basically he's trying to point that flag over a wave of indie. We're gonna do a PUBG kind of, right? Yeah, but yeah, good fit. I mean, it's it's in a weird way. I feel like the thing that has that most people have a problem with with GTA is the the the shooting mechanics and the cover mechanics. And I don't people are either turned off or turned on to it. A lot of the game modes in GTA because they involve so many more other elements, they kind of get away with it. And I don't know if I'd be able to play this. I'll have to give it a go. But considering that like the reason why PlayerUnknown's Battlegrounds works is because the tightness of even for like a buggy-ish game, yeah, early access game, the",
      "start": 306.36
    },
    {
      "text": "to play this. I'll have to give it a go. But considering that like the reason why PlayerUnknown's Battlegrounds works is because the tightness of even for like a buggy-ish game, yeah, early access game, the tightness of the shooting is fairly pretty is pretty good. Sure. So it'll be in tune. We'll see. That's the thing for me, right? In a PlayerUnknown's Battlegrounds, I've played it and I enjoy it. I'm like, when comes Xbox, I'll be all over, right? Just 'cause I'm better with a controller, I feel. I don't know how to use PC gaming stuff. I'm stupid. I'm an idiot. Everybody hates a lot of buttons. I'm sorry though. Like that was the thing of like even we were playing it and we the Party Modes that are up right now for a PUBG, and when we just play around the office and we don't record it, it is that thing of I'm good at, you know, camping and hiding and getting down to the final ten. But then it is the thing where I just I don't have, you know, the acumen. I don't know where to shoot from out and right. You know, I don't",
      "start": 348.03
    },
    {
      "text": "at, you know, camping and hiding and getting down to the final ten. But then it is the thing where I just I don't have, you know, the acumen. I don't know where to shoot from out and right. You know, I don't know in distance. That's a game where it's like you have to put so many hours in to get the most miniscule amount of shooting in to understand how to shoot better, right? Whereas GTA, I've grown up with GTA. I do. I was good at GTA Online when we'd run around, do those things. So this is actually more appealing to me in the way of, oh, I know the mechanics of that world. I know how to play that. I want to jump in and try this. And that's gonna be the most interesting thing is the fact that, you know, I think before PUBG, and we were talking about all these Steam numbers all the time, we were always talking about it, man, GTA 5 is still on the NPD. It is still them. It's the best-selling game in Europe this year. You know, I mean, it's like, what the **** is going on? How is this still going on? How is it hanging on?",
      "start": 385.65
    },
    {
      "text": "it, man, GTA 5 is still on the NPD. It is still them. It's the best-selling game in Europe this year. You know, I mean, it's like, what the **** is going on? How is this still going on? How is it hanging on? We kept we asked recently on this show, you know, to ask you guys KindaFunny.com/kfgd to write in and tell us why you're still playing or why you just write it up. And so many people did. And this, I think honestly, is going to be a big boon to that of at least getting you back in if you if you write online and put it down. Oh, try this, 'cause it's kind of that. And then even for me, where I'm like, oh, I'm more comfortable in that. And I always seen people having a great time in GTA Online, and I've never really given it the time of day. You're right. We literally just came back from Tennessee where we shot a documentary about a GTA Online crew, Hillbilly Agenda, which will be coming out next couple of months. Unlike one of the things we were kept asking him was like, why this game? Why do it? Yeah, and",
      "start": 422.43
    },
    {
      "text": "shot a documentary about a GTA Online crew, Hillbilly Agenda, which will be coming out next couple of months. Unlike one of the things we were kept asking him was like, why this game? Why do it? Yeah, and they said the variety of stuff you can do in this game. Sure. Like if I want to shoot things, I'll go shoot things. If I want to race, I'll race. If I wanna hang out, but but if I wanna play a round of golf, they'll do that in GTA Online. Yeah, and this is just like another way of obviously keeping that crowd very entertained. Yeah, but this does have the other element of, okay, there's a lot of people to work on Grand Theft Auto 5. Yeah, GTA Online is free, right? It's right there, just sitting there. It's updating or it's not if you've got installed. But you can go play with everyone if you've already have it. They have that install base. So it'll be interesting to see if this does actually pull it more people. And to the point of the whole like like GTA is such a different game. Like the car physics and stuff in GTA are",
      "start": 458.7
    },
    {
      "text": "install base. So it'll be interesting to see if this does actually pull it more people. And to the point of the whole like like GTA is such a different game. Like the car physics and stuff in GTA are obviously a much higher fidelity in calabria and then OG. And also the weapons that he was in that game are ridiculous. Yeah, so I would be interested to see what it's like. I don't think it's gonna be the same slow-paced affair. It's gonna be more like, I mean, even the key are the industry management's basically non-existent. Share top shares, you're sure. You know, the key art they use, it looks more like Mad Max than it does right PUBG, because it's cars racing at each other and all the stuff hanging up that you're in in a team site. It sounds super fun. I'd love you a let's play it, but a Party Mode of it. Get in there and see. Um, as a big PUBG fan, are you offended? Not at all. I think this is always gonna happen. Imitation's best form of flattery. I think Brendan probably knew just gonna happen as well. And I",
      "start": 491.52
    },
    {
      "text": "in there and see. Um, as a big PUBG fan, are you offended? Not at all. I think this is always gonna happen. Imitation's best form of flattery. I think Brendan probably knew just gonna happen as well. And I feel like it's a different M crowd. Yeah, it's a different audience. Sure. Yeah, and I knew it was gonna happen eventually. And hey, why not let it be Rockstar who makes great **** and also supports their community? First of many. Yeah, exactly. I don't think this is it. This is the very first domino to topple. Critter number two: Rest in peace, Miiverse. The Wii U and 3DS online service is shutting down. This is via GameSpot. Nintendo has announced the social networking service will shut down across all platforms worldwide on November 7th at 10:00 p.m. Pacific Time. This will remove access to all Miiverse functionality, including messages and creating posts, as well as any in-game Miiverse related features. For a limited time, Nintendo will allow Miiverse users to download copies of their posts. The process in",
      "start": 532.09
    },
    {
      "text": "including messages and creating posts, as well as any in-game Miiverse related features. For a limited time, Nintendo will allow Miiverse users to download copies of their posts. The process in doing so is up online. GameSpot's article links to it. However, Shredburg wrote in the KindaFunny.com/KFGD, just like you can. It says, \"Hi Greg and Danny. Hey, sure. Thanks for listening to the show.\" When I tell you who's gonna be on next in the next show, Andrea is tomorrow. Nintendo announced on November 8th, he's foreign, the Miiverse will be shut down. While not dead yet, I wanted to give the Miiverse an official eulogy. Miiverse, what a train, yeah, what a train wreck, yet curiosity, curiously wonderful thing you were. For the most part, the Miiverse was full of young children posting some of the worst content you could even imagine. That being said, I have fond memories of Miiverse posting to the Pushmo Miiverse to get help with puzzles where I got stuck, getting the freshest memes in the Splatoon Inkling",
      "start": 577.0
    },
    {
      "text": "you could even imagine. That being said, I have fond memories of Miiverse posting to the Pushmo Miiverse to get help with puzzles where I got stuck, getting the freshest memes in the Splatoon Inkling. Kapil is getting spoilers, another questionable content on the Miiverse stage for Smash 4. Miiverse was also the easiest way to get a screenshot from your 3DS to online to post on Twitter, Reddit, etc. **** you, Nintendo. And of course, the crazy comments that would pop up in your game, like the classic post from Super Mario 3D World where someone posted, \"This game is fun. My mom and dad have been fighting a lot.\" The Miiverse posts that would show up in the WaraWara Plaza, that's the place with all the Miis on the homepage, the Wii U for you casuals. I did not realize that very much. I was like, I don't know. The WaraWara did actually convince me to buy a game or two. And for an for smaller games, game devs would use Miiverse to talk directly to the fans. The dev of the critically panned game, The Letter,",
      "start": 620.71
    },
    {
      "text": "know the WaraWara did actually convince me to buy a game or two. And for an for smaller games, game devs would use Miiverse to talk directly to the fans. The dev of the critically panned game, The Letter, is a good example. I can only imagine what he said to the crowd. Well, it was for the most part pretty bad. It had some shining moments and is unlike anything in any other gaming ecosystem. Steam does have the Game Hub, and that is somewhat similar to Miiverse in that it's centralized place for people to talk about that specific game. However, because there is nothing that shows up in the game, it's completely optional, and most gamers probably never look at it. While I'm sure many people would see this as a negative, Miiverse posts being shown in game for many of its first party games made the community feel more active than it would otherwise. Well, I'm not sure I'll miss the Miiverse. I will say that I'm a bit sad it's leaving. Hmm. I want I'm glad you wrote in, Shredburg, yeah, because when I put",
      "start": 666.37
    },
    {
      "text": "feel more active than it would otherwise. Well, I'm not sure I'll miss the Miiverse. I will say that I'm a bit sad it's leaving. Hmm. I want I'm glad you wrote in, Shredburg, yeah, because when I put this on here, I had jack **** to say about this. This is the thing I blew past all the time. I follow bad Miiverse posts on hilarious, but I was always like, whatever. Yeah, I feel like there's a lot of people like you, me, who dominantly interacted with it through just like internet meme nonsense and laughs. They're like all the **** that goes up there. And but like I did feel like every once in a while it connected into like the type of online social community that Nintendo would be really good at doing. And I failed at doing for a sec. Three consoles. Yes, exactly. Like that's kind of that type of like curated, zany, wacky, like nonlinear way of communicating where it's just kind of throwing message that into the ether and having them like what happens to them, right? That kind of work to a Nintendo. And it's",
      "start": 708.13
    },
    {
      "text": "zany, wacky, like nonlinear way of communicating where it's just kind of throwing message that into the ether and having them like what happens to them, right? That kind of work to a Nintendo. And it's kind of like I feel the same way about when PlayStation Home shut down. Whereas I felt like PlayStation Home, there was like a nugget of a good idea there, and there was a dedicated community to realizing it was all over. Yeah, and I'm you know, it ended up sort of descending into this crazy like it's like hyper capitalist weird my shirts. Here's Ghostbusters Firehouse, right? Yeah, but there was something there. And it's a shame when like an idea kind of reaches only a small percentage of what it could have been and then it ends up folding. Especially I'm disappointed to like probably guess the Smash 4 stage won't have that stuff in. Yeah, yeah, and this wouldn't be so much of a sting if they had a replacement or something else. Yeah, I mean, not to be a if anybody who cared about Miiverse, and I don't how",
      "start": 753.76
    },
    {
      "text": "won't have that stuff in. Yeah, yeah, and this wouldn't be so much of a sting if they had a replacement or something else. Yeah, I mean, not to be a if anybody who cared about Miiverse, and I don't how many people used Miiverse so much that they were like, this is the right way to do it, right? Maybe this is Nintendo being like, it's time to not grow up, but get a bit more in line with the times of how online gaming works and how what people want from Nintendo when it comes to online gaming, which is basically, can we connect? Can we play? That's a thing they don't even get. They don't even though Andrea would argue with me on this one. I don't think they get that much **** for they're totally weird app. And oh yeah, whatever. It's just like, this is stupid, and I'm not gonna use it, but I'm also not playing it. I mean, any friend codes, it's still things that are backwards about it that I don't care. And that's not what I think of when I think about playing something with my Nintendo system, right? And I mean, like,",
      "start": 795.91
    },
    {
      "text": "mean any friend codes. It's still things that are backwards about it that I don't care. And that's not what I think of when I think about playing something with my Nintendo system, right? And I mean, like, what online games are coming out for? I mean, like Rocket League is the first example of summer. I think it's going to suffer from it. Ambush. Yeah, it's it's just a shame. There was like, it was fun. Just Rocket League. Talk to me as the Rocket League expert. Like this PC Rocket League. And does even PlayStation 4 have in-game chatter? Is it using party chat and stuff like that? It has in games on the PC. I mean, I'd never use it because like the text chat's bad enough. Yeah, and but it does happen. That was the thing. Anytime I played on PS4, I never heard anyone talk to me, and I never want to talk to any. I just think about matchmaking with friends more so. Like, which I mean, probably a large percentage people just hit up randoms on us. But there will be some people who are one I like who want a buddy up. Yeah, I",
      "start": 837.13
    },
    {
      "text": "think about matchmaking with friends more so. Like, which I mean, probably a large percentage people just hit up randoms on us. But there will be some people who are one I like who want a buddy up. Yeah, I don't know. It's it's it gave us like PlayStation Home. It will be remembered for the infamous sort of high points. Yeah, as opposed to the sort of the general user who enjoyed it. I'm pretty sure didn't Shuhei get banned or he got like for saying something about PlayStation 4 on Miiverse or something? Great. Whatever. Rest in peace, Miiverse. Yes, PlayStation's having a TGS conference. Everybody sure is. A PlayStation press conference is happening in Japan on Tuesday, September 19th. That's 4:00 p.m. Japan Standard Time, 1:00 a.m. Pacific Time, 3:00 a.m. Eastern Time. So look forward to that. Obviously, I'm not gonna. Oh, see what happens in the morning. And briefly, I'm Kinda Funny. Now I'm gonna stay awake on that one. Exciting. I did like this. So many conferences. We had this conversation last week about what Sony's gonna",
      "start": 877.27
    },
    {
      "text": "what happens in the morning. And briefly, I'm Kinda Funny. Now I'm gonna stay awake on that one. Exciting. I did like this. So many conferences. We had this conversation last week about what Sony's gonna what they're gonna do at Paris. It'll be a Japan focus one. So maybe you'll see stuff that eventually. And they're kind of like the load-bearing wall of TGS at this stage. Like there's not much of a presence from any other hardware companies. TGS is definitely shrunk in the wake of Gamescom actually expanding as well as sure over the years. There's been weathering forever, right? So I don't I wouldn't expect big stuff here. But it kind of feels like it's really weird to say because it used to be like second E3. But it kind of feels like the Asian Paris Games Week almost at this stage. Sure. It's just like a smaller thing, a chance to talk to that audience about those games. So it'll be a lot of things I think you get announced there and probably a small percentile of them will actually make it over",
      "start": 925.0
    },
    {
      "text": "like a smaller thing, a chance to talk to that audience about those games. So it'll be a lot of things I think you get announced there and probably a small percentile of them will actually make it over here. One, yeah, Shenmue 3. Yeah, there'll be some Shenmue 3 news. Maybe new faces. Number four: The original Xbox One has been discontinued. I got a limited edition Xbox. So big. Mine's all I got Mizzou stickers all over. Oh, really? Yeah, because I bought one of those decal things from Toasty Stickers. I once cycled to the GameSpot office with it in my backpack. I was working on its Titanfall 2 comment, and I couldn't download it fast of a home. And boy, oh boy. First from IGN. IGN says the company ceased manufacturing the original Xbox One several months ago, but until now, the console was still available for purchase through Microsoft's online store. Right now, it's just refurbishing units up there. This is what tip-off at first. I didn't reach out for a statement, but didn't get one. But Glick cyl did though.",
      "start": 963.97
    },
    {
      "text": "purchase through Microsoft's online store. Right now, it's just refurbishing units up there. This is what tip-off at first. I didn't reach out for a statement, but didn't get one. But Glick cyl did though. Statement given a Glick cyl was, as is typical for the console industry, we stopped manufacturing the original Xbox One. We introduced to the Xbox One S. Oh, cool. Branka Shanta. Again, those scoops make sense. Whatever. Good good on you. Yeah, Xbox One is is such a sleeker, sexier unit. Let alone the fact that the Xbox One X is coming up now. I mean, the next thing, the least thing they need right now is to have the S, which is smaller, yeah, and then the X, which is more powerful. But then this other one, the judge's bucket, you're working son of a blight, which implies better. Yeah, of course. Exact in there. Oh God. Final story. Only connector for gosh mines. Evan under the couch. Final story. And this is the one calling back to that an Indies Showcase happening tomorrow, 10:00 a.m. here on Twitch.tv/KindaFunnyGames. Stardew",
      "start": 1010.77
    },
    {
      "text": "connector for gosh mines - Evan Under the Couch final story and this is the one calling back to that an Nindies showcase happening tomorrow 10 a.m. here on Twitch.tv/KindaFunnyGames. Stardew Valley is incredibly close to coming to the Nintendo Switch. The CEO and designer over at Chucklefish Limited, Chucklefish, and then his Twitter name is Tiyuri. I'm not sure what his full name is in there, but I didn't look it up because he was look at her in here. Maybe there's cat, maybe he has a catch and it's, you know, with the cats here for the cream. Yeah, cat always gets the cream is gonna be problem goes. Yeah, that's not. This is a tweet from the CEO: Stardew Valley Switch is coming along very well. The last known bugs have been fixed and we're submitting for testing this week. Woo! Which would indicate that that's pretty much the final hurdle, which for me would indicate that at the Nindies event tomorrow, hey, Stardew Valley is coming this day and they give you a date. I'm sure Nintendo's not",
      "start": 1056.16
    },
    {
      "text": "indicate that that's pretty much the final hurdle, which for me would indicate that at the Nindies event tomorrow, hey, Stardew Valley is coming this day and they give you a date. I'm sure Nintendo's not thrilled about that tweet. Right, here's my question for the Nindies event tomorrow: I'm now predicting for sure we get the Stardew Valley date. Hmm, do you think we get a date for Rocket League tomorrow? Rocket League came out of the blocks to Twitter yesterday saying, hey, first time you'll be able to play Switch Rocket League is at PAX this weekend. Oh, really? So that's also a game that's incredibly close. Maybe it's weird. I don't really consider it as an independent game of share, just one India Steve feels to me more like Stardew Valley, of course. Yeah, um, yeah, I mean, it'll be cool to get that. I'm sort of more interested, I mean, we know what's coming some stage in like November, right? Yeah, they said I think it was fall's was left at, but I mean, so like, well, I'm kind of more interested in, I'm more interested in",
      "start": 1097.32
    },
    {
      "text": "I mean, we know what's coming some stage in like November, right? Yeah, they said I think it was fall's was left at, but I mean, so like, well, I'm kind of more interested in, I'm more interested in this Nindies event than I have been in any Nindies event. Wow, okay. Because the Switch now, because like there's so many games coming out on us, which are like even the small ones I'm really enjoying. Even all the NeoGeo shit that's going up there, I'm like getting a bunch of it. Super Strikers and enjoying that stuff. And Kingdom Battle just got there. I'm like, I took a bunch of flights last weekend. I was just like dying to play more games. I've burned through Sonic. Sure. I just want to see what they have coming here for the next like, like five or six months. It's really weird because I feel like weirdly, and I, we talked about this two weeks ago, how the, there wasn't that many games coming out for the Switch, but we were hoping they would be good games. Yeah, it turns out as we costard the best Zelda in",
      "start": 1138.42
    },
    {
      "text": "and I, we talked about this two weeks ago, how the, there wasn't that many games coming out for the Switch, but we were hoping they would be good games. Yeah, it turns out as we costard the best Zelda in forever. And Kingdom Battle seems to be reviewing really well. You just started it. Yeah, it's just, I've literally paid like five. I've been playing. You enjoy it. Tim loves it. Like Kevin loves it too. We're probably gonna get a really good Mario at the end of the year, hopefully. And in between all that, we've gotten all these like amazing other games. I mean, their Arms and Splatoon serve them really well. Yeah, of course, they're hard as well. So like any, they just can't go wrong. Feels like get more on the other big star. He's a great fish. Stardew's, we're all gonna be great. Rocket League's gonna be really exciting. But I'm super excited for our boy, which I had seen forever ago and had we had him on like, I think our first GDC stream back in 2015, right? And it was like, man, this game is great. And then it took",
      "start": 1174.0
    },
    {
      "text": "but I'm super excited for our boy, which I had seen forever ago and had we had him on like, I think our first GDC stream back in 2015, right? And it was like, man, this game is great. And then it took forever and then it finally made its way out, but it made it to PC. And I like, man, why should they send me a PC code? I'm like, I love you guys, but I'll wait for it to get somewhere. In the last year, I might have more recent things is super good too. But you're right, it probably fit that to me. That gives a game that fits better on, well, yeah, now that I just have it on the go, able to mess around and play with it. I'm all-in, son. Yeah, Stardew is that one for me as well. I can't play it on PC. Just doesn't feel like it feels like a Nintendo game. Oh, yeah, I started it really briefly on PlayStation, basically harbors because Joey Noel, Kinda Funny Community Manager, obsessed with it. All right, like hundreds of hours into. Yeah, I started on PlayStation 4 and then got distracted and I never went back to it. I feel like",
      "start": 1210.36
    },
    {
      "text": "because Joey Noel, Kinda Funny Community Manager, obsessed with it. All right, like hundreds of hours into. Yeah, I started on PlayStation 4 and then got distracted and I never went back to it. I feel like I didn't give it a real shot, but I don't know if it's actually for me. I don't know. I needed to look into it. Danny, yes, sir. That would look into what came out today. Where would I go? The official list of upcoming software across each and every platform as listed by the Kinda Funny Games Daily show hosts each and every weekday. I did, but it's not as good as Kevin's. Kevin got the same one as me in San Francisco Special, but his, he let it grow at more. Oh, yeah, thank you. Yeah, thank you. Like everything's happening over there. Tons of shit games are out today. Yeah, Mario + Rabbids Kingdom Battle is out on Switch. Everybody who plays it likes it. Absolver is out on Xbox One, PS4, and PC. Hold on one second. Wait, I'm very confused by this. What's wrong? Are the next game that's coming up? Okay, well, you can",
      "start": 1246.93
    },
    {
      "text": "on Switch. Everybody who plays it likes it. Absolver is out on Xbox One, PS4, and PC. Hold on one second. Wait, I'm very confused by this. What's wrong? Are the next game that's coming up? Okay, well, you can look up and see if I'm wrong, but I, while that happens, something else wants. Oh, no, actually, I said maybe it isn't. Hold on. That's bizarre. Gonna keep licking my fingers here. I think you got the sticky fingers. Mm-hmm. It's not like there's like 50 more to talk about here. No, it's fine. Well, a lot of people have been writing in asking, oh, man, Absolver's out. What do you have to say about Absolver? And no, no, you're playing Absolver. Are you playing Absolver? I know it's like, I'm guys, should Absolver. I don't know him. Absolver's on Xbox One, PS4, and PC. Ark: Survival Evolved is finally out of, yes, it's out of beta, limited access, whatever shit they're called. So, and I was like, huh, Xbox One, PC, Mac, and Linux. Abduction is on PlayStation 4. Pillars of Eternity: Complete Edition is on Xbox One, PS4.",
      "start": 1294.93
    },
    {
      "text": "it's out of beta, limited access, whatever shit they're called. So, and I was like, huh, Xbox One, PC, Mac, and Linux. Abduction is on PlayStation 4. Pillars of Eternity: Complete Edition is on Xbox One, PS4. Redout is on Xbox One, PS4. Sonic, maybe it comes to PC. Ooh, ReCore: Definitive Edition comes to Xbox One. Warriors All-Stars comes to PlayStation 4 and PC. Wind **** jammers, what up, Dave laying, comes to PS4 and Vita today. Yakuza Kiwami comes to PlayStation 4. Dead Alliance comes to Xbox One and PlayStation 4. XCOM 2: War of the Chosen comes to Xbox One. Ridiculous Kingdom Battle comes as that's a free pack, I think, for bonus about game. Oh, really? Yeah, I don't think it's DLC or it really, 'cause they talked to me at, they did a three PlayStation about, unless there's a different XCOM expansion, anything coming out. When I talked, when we're talking about XCOM there, and I was like, oh, what do you think about it? Kingdom Battle stuff. Do we not have a date at E3 for Kingdom Battle? That might make sense. I",
      "start": 1333.93
    },
    {
      "text": "coming out. When I talked, when we're talking about XCOM there, and I was like, oh, what do you think about it? Kingdom Battle stuff. Do we not have a date at E3 for Kingdom Battle? That might make sense. I take it back. It's a $40 expansion box. Okay, cool. I thought, because I thought it was a full thing. I'm not sure if one of those games wasn't dated at E3, right? Because he was like, ah, it was Jake Solomon's like, oh, you know, well, imitations are great forms flattery. Yeah, that's cool. They're doing this. I'm not mad about, but I'm wondering when whoever it got the second date. Yeah, I was a Human Fall Flat. Fishing Planet is on PS4 there. I think Fishing Planet's one with the shit awesome trailer too. Oh, my God. Yeah, I tried Killing Floor 2 comes Xbox One. Grim Legends 2: Song of the Dark Swan on PlayStation 4. The Metronomicon: Slay the Dance Floor comes to PlayStation for a lost Kinda Funny Let's Play we did where they came in and we played it and it was the dance pad because it's like, it's an RPG, yes, but you're",
      "start": 1380.46
    },
    {
      "text": "Slay the Dance Floor comes to PlayStation for a lost Kinda Funny Let's Play we did where they came in and we played it and it was the dance pad because it's like, it's an RPG, yes, but you're where you're casting based on doing the dance pad. We had Tim playing it. It was a really funny one, but it just got screwed up. So shout out to them. Give him a shot. Resident Evil Revelations comes Xbox One, PlayStation 4. Rock of Ages 2: Bigger & Boulder totally snuck up on me. It comes to Xbox One and PS4. Danny, are you Rock of Ages fan? I played a bit of the first one. I don't even remember what it was. I saw today. Mitch was free or like a boulder. People have played it the way into it. How old is this game? This isn't ages. Rock of Ages might have been like four years ago. Okay, okay. Yeah, I once snuck by me, but I saw Mitch excited about it today and it was like, it is a very like fun style to it. Yeah, the first one came out and no, that's the movie. Keep going. Well, I saw mid-2011 Mitch tweeted about all these great",
      "start": 1419.19
    },
    {
      "text": "Mitch excited about it today and it was like, it is a very like fun style to it. Yeah, the first one came out and no, that's the movie. Keep going. Well, I saw mid-2011 Mitch tweeted about all these great games coming out today, you know what I mean? And then he's also Rock of Ages 2. And when he said that, I thought he meant the musical movie was coming. Tech, they're making a Mamma Mia 2. Why not just get in there, you know what I mean? Right now, I would say my trophy slash PlayStation side is tingling. Okay, Sneaky Bears comes to PlayStation VR. Can you find me a Sneaky Bears trailer? I don't know what the shit that is, Danny, but that sounds like either easy trophies or there's a wacky good time. Oh, my God. I thought the thumbnail for this video makes it look like a Five Nights at Freddy's clone. And I'll tell you that much. And it's a Sneaky Bears. All right, I hate this. No, no, no, this is scary. This is definitely a horror. There's a horn. Yeah, no, okay, that's gay. We're gonna get back on to Spark comes the",
      "start": 1461.18
    },
    {
      "text": "I'll tell you that much. And it's a Sneaky Bears. All right, I hate this. No, no, no, this is scary. This is definitely a horror. There's a horn. Yeah, no, okay, that's gay. We're gonna get back on to Spark comes the PlayStation VR. Still Time comes the PlayStation 4 and Vita. Surf World Series comes to PlayStation 4. Warriors All-Stars comes to PlayStation 4. Man, they weren't trying on that title. White Day. Oh, it's such a bad time. You said it twice on this list. Really? Warriors All-Stars there twice. Well, you know what I do? I mean, I've, so I've complimented them before. I just copy a Kato whose list they sum it all up so well, but I don't fact-check. I don't think. I mean, come on. The Hangout things do. White Day: A Labyrinth Named School comes the PlayStation 4. Getting added to Xbox One backwards compatibility: The Walking Dead: Season 1, The Walking Dead: Season 2, The Walking Dead: Michonne's, all the Telltale ones there except 400 Days. Knack 2 as a demo up on PSN. What a greatest game of all time. Gonna save your lives.",
      "start": 1506.75
    },
    {
      "text": "The Walking Dead: Season 1, The Walking Dead: Season 2, The Walking Dead: Michonne's, all the Telltale ones there except 400 Days. Knack 2 as a demo up on PSN. What a greatest game of all time. Gonna save your lives, Lord, and save your neck. Ys VIII has a demo up on PSN. Friday the 13th patches up having smaller Maps and getting rid of the team killing. And I think having this Spring Break, you have to buy him, but DLC costumes, brother. And then finally, here we go, ladies and gentlemen, it's happened. Everybody's Golf is out on the PlayStation. It's golf, but finally for everybody. We're here. We're doing it. We're streaming right after this for four fuck hours playing. Yes, I holds. Is that that's gonna be a lot of? I'm gonna be a lot of holes. No, no, no. I am. I'll read the question. All right. Slickerass, PSN and Twitter said like Licorice with an S. Thank you, goddess Licorice, comes in to KindaFunny.com/KFGDD and says, Greg, as a long time Everybody's Golf fan, got the Vita plat. Fuck that trophy, by the",
      "start": 1551.63
    },
    {
      "text": "Twitter said like Licorice with an S. Thank you, goddess Licorice, comes in to KindaFunny.com/KFGDD and says, Greg, as a long time Everybody's Golf fan, got the Vita plat. Fuck that trophy, by the way. Five fuck years. The day we have been waiting for has finally arrived. That son of a fuck pre or is pre-ordered, pre-downloaded and waiting to go. But help, I'm having a moment of doubt. What if it's just the PS3 game with some broken online mini-games? What if the beautiful three button button press swing has been replaced by some crazy punk-ass analog shit? What if super backspin has been replaced by some more realistic garbage? Who the fuck am I kidding? I'm still gonna plow a bunch of time into this game. See on the fairway, Michael. #driveforshowputtfordough. Sure. All right. Everybody's Golf is fuck amazing. Those that those those problems that none of that happens. No, he's always just worryin'. He doesn't matter. He's leading to being a fan. I'm such a huge Hot Shots Golf fan like",
      "start": 1598.52
    },
    {
      "text": "Golf is fuck amazing. Those that those those problems that none of that happens. No, he's always just worryin'. He doesn't matter. He's leading to being a fan. I'm such a huge Hot Shots Golf fan like I thought I found that series with Open Tee 1 on PSP. Reviewed Open Tee 2 playing on PS3. Played it on a Vita when it came out. Right, this is literally, I'm gonna talk about it in the Gamescast and I'm sure even more depth. But I was, when I started this up, I told, I told Andy yesterday, because it's one of those Andy's obsessed with an A. So is Joey. Like it's spreading around the office that we're all getting way too into this. And when I booted it up, when we got the code and played for the first 30 minutes, there was a point where I put down headphones and went to get water and I teared up. Like it's legitimately everything I've wanted out of this series. Like they're singing them one Open Tee, Open Tee to happen 'cause they're pretty much the same game. Like such a big part of its customizing, getting items, doing these",
      "start": 1644.78
    },
    {
      "text": "everything I've wanted out of this series. Like they're singing them one Open Tee, Open Tee to happen 'cause they're pretty much the same game. Like such a big part of its customizing, getting items, doing these different things. It was like, oh, this is cool. I can't wait to see what hat PS3 came and it didn't really have that, right? And then Vita had none of that. It was just like change like all it all furs outfit. Not like this is moving so far away from because the core of the golf gameplay is so good as it is, right? To jump into this and start creating a character and creating somebody new on my Twitter, Twitter.com/GameOverGreggy. Or just seen her in a second. That looks so much like yours and Andy's are spot-on. And that was the thing where I did it and I was like, oh, fuck, Shuhei is not in this game. They just made in like, you know, expecting him to be like one of the golfers that was gonna be there. I was like, no, their character creator's just so because it's got that great thing that um,",
      "start": 1686.37
    },
    {
      "text": "this game they just made in like, you know, expecting him to be like one of the golfers that was gonna be there. I was like, no, their character creator's just so because it's got that great thing that um, Miis have in that like the Xbox Avatars have. Yeah, where it's like, hey, here are all these options and they're limited enough that everybody looks like a cartoon version of themselves. And it's not like, oh, this, well, that's wrong or that's everything. And I built this Greg that looks just like me. And I was like, fuck, this is awesome. And I was, I've just been, I brought them, I was in Vegas for 31 hours and I brought the PlayStation 4 for the four hours I knew I'd have of downtime, you know? And Andy was play until 2:00 a.m. And I, you know, we're knowing our girlfriend or his girlfriend, my wife for this week, right? All we want to do is play this fuck game. The gameplay is tight. It's awesome. You're to see here on Twitch in a little bit. You can check out the archives if you're listening or watching",
      "start": 1720.93
    },
    {
      "text": "week, right? All we want to do is play this fuck game. The gameplay is tight. It's awesome. You're to see here on Twitch in a little bit. You can check out the archives if you're listening or watching later. But what's the asking price? I think it's 40 bucks, right? I think it's one of the, give me a check that dummy check on that. But I'm pretty sure it's one of the cheaper ones. But I'm excited. I'll talk even more about this 'cause I'll have even more to say when we get to Gamescast this week. For now though, new dates. Ooh, Super Beat Sports is coming to Switch from Harmonix. This is coming in the third quarter of 2017 on the eShop. IGN describes it, Super Beat Sports is a sports game with a musical twist. According to the developer, the game is based on the Apple TV game Beat Sports and includes console exclusive content features. So it's a Harmonix weird sports game with music. All right, sounds great. Fire Emblem Warriors is coming to Switch on October 20th. Voltron VR Chronicles comes to PlayStation VR.",
      "start": 1760.92
    },
    {
      "text": "content features. So it's a Harmonix weird sports game with music. All right, sounds great. Fire Emblem Warriors is coming to Switch on October 20th. Voltron VR Chronicles comes to PlayStation VR September 26th. And that's not some weird title thing. That's a real Voltron game with the fuck Voltron robot and all that jazz. Good, good for you. The Inpatient. This is a Supermassive VR game, of course, the Until Dawn guys. This is the prequel home to life. This is coming out in November 21st. And then Bravo Team in the same vein coming to PlayStation. Oh, these are both PlayStation VR games. Bravo Team coming out December 5th. That answers my PSVR question from last week. They go three more games coming up. And The Inpatient was one I'm super stoked about because that looks like, hey, we're making you as horror game. It's gonna be creepy as shit. I'm just more, I mean, I understand it doesn't matter, but I just like me. And that seems like it would've been a great October game, right? You know, I understand",
      "start": 1797.55
    },
    {
      "text": "horror game. It's gonna be creepy as shit. I'm just more, I mean, I understand it doesn't matter, but I just like me. And that seems like it would've been a great October game, right? You know, I understand you need more time and whatever. But like, Inpatient, what? And it's also, it's, I think Until Dawn did the exact same thing. We run Until Dawn missed Halloween, if I'm correct. And it didn't matter for that one. So won't matter here because people love playing horror all the time. Yeah, especially a really big fan. So yeah, for sure. Until this great. 40 bucks. 40 bucks. Nailed it. Whoa. No, I mean, cool Greg. Cool Greg knows I was talking about over there. Let's jump into reader mail. This is where you write into KindaFunny.com/KFGDD. You ask us questions. Give us your cut questions, comments. You can pat people in the back as some of you have. Hmm. Yes, there you go. Here, here's what I was looking for earlier. Benjamin wrote in and he says, hello, Greg and rotating co-hosting. As you know, Absolver comes out",
      "start": 1838.17
    },
    {
      "text": "in the back as some of you have. Hmm. Yes, there you go. Here, here's what I was looking for earlier. Benjamin wrote in and he says, hello, Greg and rotating co-hosting. As you know, Absolver comes out today. I've been reading comments and reviews that say this game is full of great ideas, but doesn't quite capitalize on its potential. So this is, you see, you already see how this question got in, right? Yeah, because it's not about what do you think of Absolver. It's about, hey, let's get, let's take them step back and talk about the industry with this and the general discussion around Lost Legacy. I am beginning to wonder if we are holding these kind of games to an unrealistic standard. When indie games first started to become popular, there was an understanding that these are smaller, simpler experiences. Do you think we as a community are expecting these types of games to reach the level of other AAA games? At GDC, I was talking to a bunch of indies, which generally seems to be what happens there.",
      "start": 1877.76
    },
    {
      "text": "do you think we as a community are expecting these types of games to reach the level of other AAA games? At GDC, I was talking to a bunch of indies, which generally seems to be what happens there. A lot of indies got together and they hang out there and learn from each other, talk to each other. First year, it's like the one time of year they can only afford to go to probably two things a year. They always make sure to go to GDC. And one of the things that it was like across the board, people kept talking about it was just how many indie games are coming out. Yeah, the fact that in previous years, people would use and they were trying to enter the industry with some sort of portfolio post leader. They've gone to college and honest or they've worked on their own stuff and they put it up. And what people are doing now is they're leaving college and immediately starting studios with her college friend. Sure. And then trying to release a game. And if it works, then wonderful. And if it doesn't, then",
      "start": 1915.35
    },
    {
      "text": "people are doing now is they're leaving college and immediately starting studios with her college friend. Sure. And then trying to release a game. And if it works, then wonderful. And if it doesn't, then that's their portfolio. Yeah. So what's happened is that the amount of indie games that are coming out has like something like this, five times as much as it was about four years ago. And which also means that the ceiling or the like watermark for quality has also risen with it. Yeah. So there's more. But like when you think of like, take Jonathan Blow for instance, like The Witness, right? Yeah. Braid. Yeah. In the space of like four or five years, we've gone from, you go back and play Braid, it feels like it was made in Game Maker. Like it's a wonderful game. I totally. But like, it feels like that's the curve of what we have with. Yeah. And I, we've got The Witness, which is dislike. Yeah. The first person crazy, you know, thing. So that's kind of where we're asked with a lot of these games where were before you could",
      "start": 1955.46
    },
    {
      "text": "what we have with. Yeah. And I, we've got The Witness, which is dislike. Yeah. The first person crazy, you know, thing. So that's kind of where we're asked with a lot of these games where were before you could, you know, if Night in the Woods had come out four years ago, probably would have won like, it would have been Game of the Year contender. Yes. Like it's that size. It catches you off-guard, right? Whereas now we have this sort of expectation of quality. And then also there's so many games coming out that for the ones to really like, for the cream of the crop, a few will know, here we go, to rise to the top. Yeah. Never you say it, cat gets the cream. Yeah. And it needs to be way better than you need to be four years ago. I'm just, that's so I, I don't necessarily think we are holding them to a higher expectation. It's just that there are so many of them and they've gotten better that we, I hate this question, this line of questioning. And I'm not, not, I don't hate you, Benjamin, because it kind of",
      "start": 1997.73
    },
    {
      "text": "expectation. It's just that there are so many of them and they've gotten better that we, I hate this question, this line of questioning. And I'm not, not, I don't hate you, Benjamin, because it kind of came out yesterday too at the end of the show. We did an Uncharted: Lost Legacy spoiler light cast that piggybacked off this question where a listener, Odin, was like, here's what the reasons I liked it too, which I then responded like, I don't agree with you on this. And I don't think this Absolver. And then on the Unread, a person posted and was like, hey, Greg seemed like he was being hostile and had an attitude was coming at this person. And I feel like this is in the same vein of that of like, no, it's just we're criticizing. This is criticism, right? I, you want, I mean, we all have different opinions about games. And that's why, you know, Benjamin's isn't wrong if he thinks they're being held to substandard. But for me, the playing field is so level now where it's like, now we're finally starting to see double",
      "start": 2038.14
    },
    {
      "text": "and that's why you know Benjamin's isn't wrong if he thinks they're being held to substandard but for me the playing field is so level now where it's like now we're finally starting to see Double-A games start popping back up yeah but forever indie has been it's been indie and Triple-A and Indie's expanded so wide that indie can mean that it's going to be a varying credit it's gonna be the most simple experience in the world or it's going to try to be this complicated it's gonna give Triple-A a run for its money yeah and so that when you get in here like are we holding them to an unrealistic standard no cuz that is the standard the standard is all over the place if anything I would say with all due respect to Benjamin, Benjamin's holding indie to a lesser standard right saying that oh well you're that he's very much talking how I feel like we talked about downloadable games at IGN in 2008 it's quite good for a downloadable I think your graphics are great for a downloadable game",
      "start": 2078.64
    },
    {
      "text": "oh well you're that he's very much talking how I feel like we talked about downloadable games at IGN in 2008 it's quite good for a downloadable I think your graphics are great for a downloadable game downloadable game of the year cuz it was like clearly these are in this bucket and the real games are in this bucket but right now if everybody's out there playing on the same field then like I think in the same breath you can sit there and have that happen and everybody can go you know dream dad and the daddy daddy dating simulator whatever right is still competing with every other game for your attention for your mind share for quality standards all right but of course there is this different sliding scale when it brings up Uncharted: Lost Legacy I do think you know that's an interesting one as well in terms of like what standard do you hold that too because it is that thing where and no I and I know I'm not gonna be the horse stuff talks so much about this Naughty Dog marketed as hey",
      "start": 2117.64
    },
    {
      "text": "as well in terms of like what standard do you hold that too because it is that thing where and no I and I know I'm not gonna be the horse stuff talks so much about this Naughty Dog marketed as hey this is a forty dollar full-fledged Uncharted and then when we got it and I don't think it was a full-fledged Uncharted it was a great game and I enjoyed myself quite a bit gonna go back and platinum it that's great but then when I'm like well it doesn't hold up too well of course not it's not a full-fledged Uncharted but I'm very well that's not what we can't pick and choose the argument based on who we are you know where we're at or what side of the fence were on like it's a game and it's gonna be compared to other Uncharted yeah indie games like Absolver are gonna come out and be compared to other indie games that have come out and been awesome right again I have a spoke I haven't played an Absolver it's a fighting game right I have no real interest in it from what I've seen from it or",
      "start": 2156.64
    },
    {
      "text": "other indie games that have come out and been awesome right again I have a spoke I haven't played an Absolver it's a fighting game right I have no real interest in it from what I've seen from it or heard about it but it's gonna come out and be compared to every other game in that genre of that caliber of that ilk yeah this is how it is like that expectation is like such a personal thing and it's like so uh so much of talk about beating a dead horse like I said every time it's so much of why you people get disappointed are happy but games outside of just their inherent quality I don't it's difficult to subjectively talk about that but like if you talk about like you know there's two parts of this one is that the indie sort of space is now it's totally muddled we're like let's take today for instance we're talking about how Grand Theft Auto Online is copying a game that was made in South Korea and Ireland yes like like that's the world we live in No Man's Sky was the biggest ticket for",
      "start": 2192.64
    },
    {
      "text": "for instance we're talking about how Grand Theft Auto Online is copying a game that was made in South Korea and Ireland yes like like that's the world we live in No Man's Sky was the biggest ticket for for Sony last year for a long time right that was made by like a tiny team and we saw our expectation management basically for them right so that's a massive part of it but like if you take a game like like for instance like Uncharted is a very less version of the problem that Fallout 4 had for instance were Fallout 4 by any like way of raising it it's a quality came oh yeah it's a good game it's technically impressive it has shooting it is you know quests are well-written and all this sort of stuff but you we don't look at games in bubbles like that we look at it as players of New Vegas and as players of Fallout 3 and players we should go back players of The Witcher exactly or players of Fallout 1 and Fallout 2 yeah so like everyone's expectations based on something different forever is",
      "start": 2229.42
    },
    {
      "text": "and as players of Fallout 3 and players we should go back players of The Witcher exactly or players of Fallout 1 and Fallout 2 yeah so like everyone's expectations based on something different forever is huge a large part of the people who played it were probably too young when Fallout: New Vegas and Fallout 3 came out share so to them it was like the second coming of Christ right it was like oh my god it's a first-person gamer can do all this sort of stuff so expectation is so so important when it comes to this and Uncharted: The Lost Legacy is a prime example of that because Naughty Dog make arguably some of the best games ever over the past ten years they've been on a roll with Uncharted 2, 3, 4 or The Last of Us yeah insane right even their expansion packs Left Behind again expectations they totally submitted it and this time with the marketing the switch from DLC to a real game all that sort of stuff they were coming in the opposite way where it's certainly they were like trying to pitch it",
      "start": 2272.44
    },
    {
      "text": "submitted it and this time with the marketing the switch from DLC to a real game all that sort of stuff they were coming in the opposite way where it's certainly they were like trying to pitch it higher than where people were and it landed modeled for everyone some people were like oh we expected you know maybe it was like Uncharted 4.5 or I heard that yeah so that's that seems to be what happened there and what I the question seems to be sort of like criticizing the criticism yeah which is like again it's okay for people to like things more or less than you understand if you understand why they did then it makes it okay which is why I think it's important in criticism to like sell your argument I think you've done really good job of selling your argument of why I understand why you were down on a little bit yeah right it makes sense to me so I'm in the same way that I can see that if somebody had low expectations for that game it would make sense to me as well so if we were just a little",
      "start": 2313.5
    },
    {
      "text": "on a little bit yeah right it makes sense to me so I'm in the same way that I can see that if somebody had low expectations for that game it would make sense to me as well so if we were just a little bit less defensive and reactive to things and more sort of like and that's the thing I mean all across the board right I'm just like I'm so sick of posting something online that I enjoy on Twitter oh yeah why are you **** go away all right I'm just sharing I'm just and like then the counter well don't you wanna have a conversation and it's like yeah I do but in 140 characters you just coming back and saying this sucks isn't us having a conversation this is a conversation Benjamin's doing a great job here right KindaFunny.com/kfgd just like you can but yeah I love talking about all this stuff but it's like yeah when it is like you'd like it hurt yes ready go on our subreddit all right this guy's like Greg's being really hostile I was like like I felt like I felt like when you",
      "start": 2356.44
    },
    {
      "text": "this stuff but it's like yeah when it is like you'd like it hurt yes ready go on our subreddit all right this guy's like Greg's being really hostile I was like like I felt like I felt like when you write into the show I don't I'm the way I think about it is I'm not sitting you're like oh well thank you so much for patronage and shake your hand like I'm talking to you like I talked to you view the microphone yeah so when you lay out an argument three parts I'm like why don't agree at that argument because X Y Z but maybe I came off too flippin yesterday I'm getting the weeds on that one but it was like **** like I want to be able talking if we're gonna in this space where we're criticizing things together and talking about stuff and what I love obviously Oh what was me this Uncharted game's not as great as the **** it was great game guys shut up I'm sorry Greg. Chuck writes in to KindaFunny.com/kfgd and says yeah if Assassin's Creed Origins isn't the bounce back title that",
      "start": 2399.49
    },
    {
      "text": "not as great as the **** it was great guys shut up I'm sorry Greg. Chuck writes in to KindaFunny.com/kfgd and says yeah if Assassin's Creed Origins isn't the bounce back title that you've you saw clearly hopes it is is there a chance it goes the way of Mass Effect? Ubisoft's biggest problem in Assassin's Creed is that they've made them annual that they made them annual like even that the problem for that series is that even if they make they have to make an astonishingly good Assassin's Creed game yeah to get over the hurdle that they've created for themselves by making it an annual release they've basically like and what's the world like people are exhausted in that I mean that was the most interesting part is that X years ago I forgot what it was now you know Ubisoft's like we're gonna keep making Assassin's Creed annualized until you guys stop buying them right and then a few years later it they were like you know what we're taking a year off yeah and now they're coming back with",
      "start": 2433.42
    },
    {
      "text": "keep making Assassin's Creed annualized until you guys stop buying them right and then a few years later it they were like you know what we're taking a year off yeah and now they're coming back with Origins and as an Assassin's Creed fan myself I'm like yeah alright cool I'm ready to jump back in but my problem is I'm just ready to jump back game cuz it's Assassin's Creed nothing I've seen her plate have I been like oh **** right it's not like when I played Black Flag and I was like what the **** this is and you know this is very clearly that and when I so that's the thing for me is it's on my list of **** to play this fall but it definitely is on that second third string tier games to play where I'm gonna get it and it's not like **** here we go open as soon as I get it poppin in let's go so it's gonna be all I'm gonna get to want to get to it and I think that's gonna hurt it and that is an interesting question of then if this comes back and isn't the be-all Assassin's Creed is",
      "start": 2481.9
    },
    {
      "text": "let's go so it's gonna be all I'm gonna get to want to get to it and I think that's gonna hurt it and that is an interesting question of then if this comes back and isn't the be-all Assassin's Creed is back what does everybody think about it does it because again well you're talking about annualized, annualizing it right is the fact that now that they took their you know they braked and now they're getting back on the highway I would imagine the next two Assassin's Creed games are in production somewhere right now Ubisoft's all over the place and so if this one comes out and we are all like now we didn't need your back just yet what are you **** do with those games and what happens and how do you go yeah it's a strange sort of commercial reality to be stuck in because Call of Duty's in the same thing right where those games are still making money hand over fist regard okay the real reason Call of Duty's making money is because of all the in-game stuff that they're selling and from",
      "start": 2520.42
    },
    {
      "text": "the same thing right where those games are still making money hand over fist regard okay the real reason Call of Duty's making money is because of all the in-game stuff that they're selling and from multiplayer, but like the games are still selling enough that it makes sense for them to they have so much resources behind us that like it's not just a case where you can just stop making that game if the margins drop like they're still doing well enough but also you need to like shift a massive production engine onto something else or yeah so it makes sense for them to keep doing it I'm taking your awful hopefully you know I'd say it's probably good for the team as well and good for the audience as well and but Black Flag is a really good example of that game probably would have had way more of an effect it's one it's like a sleeper hit like Far Cry 3 is where people who played it like super into it a lot of people actually skipped it because it came off the back of a bunch of tired ass",
      "start": 2553.99
    },
    {
      "text": "of an effect it's one it's like a sleeper hit like Far Cry 3 is where people who played it like super into it a lot of people actually skipped it because it came off the back of a bunch of tired ass Assassin's Creed games and it was also right at the breaking consoles you get it either version or whatever yeah people are like oh well what is this - I mean now they're going to make it their own like ship online ship multiplayer game Skull and Bones go get them maybe out sir maybe I'm gonna eventually playing but it's like The Division holy **** this is great alright but like the whole thing when they did I was a car Oh like this isn't no just give me a pirate game just be a pirate and have give me a story outside of the Templars and the Assassins and all this **** and I'm just I'm a pirate and we're running around doing it's super hard like I'm finding it very difficult for me to accurately judge the success of Ubisoft titles because they're two for two and multiplayer games yeah",
      "start": 2591.88
    },
    {
      "text": "and we're running around doing it's super hard like I'm finding it very difficult for me to accurately judge the success of Ubisoft titles because they're two for two and multiplayer games yeah Siege is doing really well I know For Honor had all that weird crap around the the throne room recently and but that's doing really well too of course Ghost Recon sold last year no did great like it is that thing that they have a method and they have a thing so it is that all right step back and let you see you how it's gonna go now let's see but you're right everything I've seen about Assassin's Creed Origins has been and they just released a trailer last week with the pretty weird music they had a god they Run the Jewels the Queen god I feel terrible Michelle Branch it's not Leonard Cohen no it's not that's Lynyrd Skynyrd no it's the **** dude with a gravelly voice kind of like you're wrong Jesus I'm so sorry okay um yeah like I haven't seen any here is in way in which the gameplay is different",
      "start": 2629.62
    },
    {
      "text": "that's Lynyrd Skynyrd no it's the **** dude with a gravelly voice kind of like you're wrong Jesus I'm so sorry okay um yeah like I haven't seen any here is in way in which the gameplay is different it's it's all based on we're in Egypt which is like great well we've had that trick you were in London you were in Paris yeah we need you know and that's what's scary yeah well I played at E3 and I was like yes pretty and yeah it feels like Assassin's Creed and I didn't fall to my death and I enjoyed you know but it was there like I don't know if I'm in the mood for this like E3 like Assassin's Creed so on that level I'm excited for it but I'm not excited like I have to stop what I'm doing when I try that game and when you again expectation with an Assassin's Creed game yeah you know you're in for like 40 hours yeah so it's not like another game where you can just pick it up and give it a go like you're either in or you're you're not and I feel like that's the hurdle that they have to get",
      "start": 2668.95
    },
    {
      "text": "for like 40 hours yeah so it's not like another game where you can just pick it up and give it a go like you're either in or you're you're not and I feel like that's the hurdle that they have to get over every time which Call of Duty doesn't because Call of Duty's like okay I'll play the multiplayer and I'll get the the crash bang Transformers box-office sort of experience it's like and that feels difference to an Assassin's Creed where it's like you know you're dedicating this cent you know especially if you don't play games all that much you dedicate like a month of your time or whatever to this one game over another one for the same dollar match so yeah it's gonna be interesting to see what I like I might just add to what people think like our Assassin's Creed fans I don't know if we consider myself an Assassin's Creed fan anymore like different Brotherhood are fantastic right them even in Revelations is wonderful Assassin's Creed III mm-hmm alright we're getting into the weeds here but I yeah it'll",
      "start": 2710.92
    },
    {
      "text": "consider myself an Assassin's Creed fan anymore like different Brotherhood are fantastic right them even in Revelations is wonderful Assassin's Creed III mm-hmm alright we're getting into the weeds here but I yeah it'll be yeah I'm I'm sure Ubisoft have metrics and all that sort of stuff and but we'll see cuz their open-world stuff you know Watch Dogs 2 as fun as it was didn't really like the world on fire either I don't think Watch Dogs 2 is awesome I think a game but it's like they have a problem with their world building where they they make they they make games they make worlds that are clearly video game world yeah in and everyone else's gone past - and they I mean GTA, Rockstar always were pastors but like when you go and play a game like The Witcher and then you go play with game like Watch Dogs 2 it's like you'd like you designing like points of interest and stuff like you guys aren't doing that you're designing quests into like a into like a like a map and I think a lot of people that doesn't like",
      "start": 2751.78
    },
    {
      "text": "you'd like you designing like points of interest and stuff like you guys aren't doing that you're designing quests into like a into like a like a map and I think a lot of people that doesn't like there's a lot of people who that does not grab so I'm hoping that's with this one they might I don't know change it up a bit they make amazing games and we hold them to a high expectation yeah and I think no matter what it'll probably be a pretty good game Ubisoft make wonderful games last thing is I think the game will be great I just think it's the fact that it's alarming that I can't tell you who the main character of Assassin's Creed Origins is right he's just some guy right because that was the thing of like Ezio was awesome right that was the lesson learned from Assassin's Creed 1, Altaïr oh don't do this what was his name he was the guy that like we didn't nobody really liked you know Altaïr so we moved to Ezio then we had an Ezio trilogy or whatever I'm killing myself that I kind of know I",
      "start": 2792.5
    },
    {
      "text": "don't do this what was his name he was the guy that like we didn't nobody really liked you know Altaïr so we moved to Ezio then we had an Ezio trilogy or whatever I'm killing myself that I kind of know I hated a month ago I don't want to look at anything I'm looking at a PSP Go game I playing it it's pretty good I'm looking at it oh yeah I got what is it Altaïr **** yes damn it anyways he was great and then from there and then even Kenway all right no Edward Kenway it wasn't and check that one Black Flag's character's name was Edward Kenway and he was a fun guy I know you liked him you got behind him there was an Irish guy one of them the one that sold the least in the spin-off Black Flag one remember that one what was that call again Black Flag no no there was a spinoff oh the one that has stayed on current generations instead of next generations whatever so there was Origins and then there was anyway Edward Kenway. Edward Kenway and then every like that in every hated Origins but they",
      "start": 2833.39
    },
    {
      "text": "stayed on current generations instead of next generations whatever so there was Origins and then there was anyway Edward Kenway. Edward Kenway and then every like that in every hated Origins but they liked the current gen will heard the current PS3, 360 but nobody played it cuz it wasn't next-gen there's been a lot of games Assassin's Creed there was Altaïr's Chronicles there was Bloodlines, Discovery, Brotherhood, Revelations, Assassin's Creed III, Liberation, Black Flag, Freedom Cry, Rogue, Identity, Chronicles which was China, India, Russia, Syndicate and Origins flood of Assassin's Creed that series started 10 years ago god bless Ubisoft let's see what happens he's coming for you Bart, aka BetaHaus writes in and says hello Greg and Danny now really question rather I'm riding a little reacts to yesterday's discussion of Mario + Rabbids Kingdom Battle I am someone that has never played an XCOM game or at least I don't think I have so watching Greg and Kevin play the game let left",
      "start": 2879.05
    },
    {
      "text": "discussion of Mario + Rabbids Kingdom Battle I am someone that has never played an XCOM game or at least I don't think I have so watching Greg and Kevin play the game let left me confused and wondering what was happening this took me down a deep dark hole of YouTube clips and the specific game next thing you know I'm picking up a Switch and my first game is Mario + Rabbids Wow yes and all due respect to the amazing game that has held the Breath of the Wild this game scratches an itch I didn't know I even had I would just like to take a moment to give props to Nintendo for their move to put this game out there they are giving me a game I didn't know I wanted but now I have to now I have to have keep up the wonderful work really loving Kinda Funny Games Daily and all the amazing content Kinda Funny have been putting out since the relaunch have a great day Bart I like when people write in to praise people yeah these guys out there making these games they're busting",
      "start": 2925.6
    },
    {
      "text": "amazing content Kinda Funny have been putting out since the relaunch have a great day Bart I like when people write in to praise people yeah these guys out there making these games they're busting their butts yeah it's good to see that I feel like that there are very few genres in games that have as much of a barrier as the turn-based strategy genre if you've never played a turn-based strategy game it's chess like it's you're just playing a different there's make wrong moves no you take your time you place people and that's it and then each one's like there's a lot of them are more complicated than others the Masters of Orion 2 and you know you can get into you're sort of even XCOM to a certain degree people find very difficult oh yeah this I think is probably gonna be a pretty good Mario + Rabbids it's like I I played a lot XCOM right on the consoles and through preview events everything else and then first midboss on that I tried two or three times in the play and game you just",
      "start": 2965.05
    },
    {
      "text": "Mario + Rabbids it's like I I played a lot XCOM right on the consoles and through preview events everything else and then first midboss on that I tried two or three times in the play and game you just right can ate my lunch and I'm like all right you know what turn it off I'm gonna think I'll come back to this and that's like the way of those genres yes that like Blood Bowl and even Civ, like Civilization is a difficult game for a lot of people yeah yeah so I feel like I hope this will be really cool discs are people into that genre yeah I feel like XCOM did as well yeah oh yeah right I thought the original ones when they do exactly the Xbox 360, PS3, PC, Xbox on that was definitely one where that was my first XCOM oh **** I really like this this is a lot of fun and they did the great job of streamlining that experience without taking away what was great about the old you for the fans yes yeah back in the 90s a final question comes from Eric. Eric writes in and says South Park: The",
      "start": 3006.99
    },
    {
      "text": "Fractured But Whole was apparently rated by the ESRB according to some reports yesterday and I want to know do you think this means it is a lot to come out this year I was in the camp of Greg and many others that since we have have yet to really hear anything about this game it meant a sure delay October is loaded month and it really just feels like something perfect for the spring thanks for the ear noise I'm sorry and have a conversational day Eric I continue to be shocked and worried that I'm gonna eat my words that South Park: The Fractured But Whole will come out this year yeah I was so even when they announced today to my okay we'll see about that it's been pushed three times now I think I think so and then the last one I mean the said last South Park from Ubisoft got",
      "start": 3046.38
    },
    {
      "text": "Yeah, I was so even when they announced today to me, okay, we'll see about that. It's been pushed three times now, I think. I think so. And then the last one, I mean, they said last South Park from Ubisoft got pushed a ton, right? And was in it, went, it was a whole THQ business to where I went from, you know, you got bought in the fire sale. I was just like, same thing's gonna happen here. Metacritic perfectionist, this isn't gonna hit. Totally not in that a bad way. The game's gonna be like, this is another one where it's like, if it comes out this year, this is the, I know Tim's always like, oh, that's my year, Crash Bandicoot. This is my **** year, Patapon, a new Everybody's Golf, **** South Park sequel of the South Park that is all comic book based. Like, are you **** kidding me? I love South Park and I hate like fantasy, right? But it was for playing the original one, run, you're not doing that. But now to have them make a Marvel movie and DC movie judgment called, **** hell yeah. Do you think it feels better in Q1?",
      "start": 3087.33
    },
    {
      "text": "Right, but it was for playing the original one, run, you're not doing that. But now to have them make a Marvel movie and DC movie judgment called, **** hell yeah. Do you think it feels better in Q1 of next year though? The first one came out in March, did it? Yeah, okay. Because I see that was it. I remember the first one, I think, was gonna come out in December and they got pushed really late. Yeah, I think so, probably. But it's also that the spring's always overloaded too. It's just that, yeah, poison, do you want to be the one? This could be the fall outlier of like, sure, Assassin's Creed, Destiny, a Call of Duty, like the Battlefront. There's gonna be all these games, you know, are going to sell well in a probably a very specific gamer. But here again, is this South Park RPG, this sequel, put on a pedestal, whereas I think it's more in the vein of next year, hey, here's God of War and here South Park. Like those are more apples apples, which I know sounds weird, 'cause obviously God of War is gonna sell, but",
      "start": 3127.5
    },
    {
      "text": "Whereas I think it's more in the vein of next year, hey, here's God of War and here South Park. Like those are more apples apples, which I know sounds weird, 'cause obviously God of War is gonna sell, but God of War is going to get that critical acclaim and people are gonna be high on podcast. I couldn't stop playing and I did all this stuff. In the same vein, South Park was when me and McCaffrey and Brian were talking nonstop about South Park. The, you know, first one was The Stick of Truth. Thank you very much. Yeah, I think the original date for this one, I remember putting together some sort of video one sage. I think it was going to come at late December of last year. No, because I think it wasn't going to make the game of year. I think that maybe that was one of the original dates at having. Okay, if I'm remembering correctly, it all blurs. I kind of feel like it would feel better in in Q4 or in Q1 than later this year. The one thing I'll say is that if there was ever a game that was going to go for",
      "start": 3170.45
    },
    {
      "text": "Remembering correctly, it all blurs. I kind of feel like it would feel better in in Q4 or in Q1 than later this year. The one thing I'll say is that if there was ever a game that was going to go for as early as possible in the ESRB rating, it would be South Park, just because of the nature of the content that's in that game that wants to have an idea of where abouts are landing in terms of writing and probably more than most, right? Because there's a lot of content in there and also the content will be questionable of some description, right? So they're gonna want to make sure they don't get a rating, of course. Maybe that's a part of it as well. I don't know. We'll see. I hope it comes out. That would definitely like you talked about a game that would put Assassin's Creed or anything else that I like want to try on the back burner. That'd be it. Here's a question. Yeah, it's not coming in Switch, is it? No, come on, dude. Come on. I gotta do it. They got to do everything on Switch, but you see no trophies.",
      "start": 3204.83
    },
    {
      "text": "Want to try on the back burner. That'd be it. Here's a question. Yeah, it's not coming in Switch, is it? No, come on, dude. Come on. I gotta do it. They got to do everything on Switch, but you see no trophies. Danny, it's time to squad up. This is where one of you writes in to KindaFunny.com/KFGD. Give me your name, your username, your platform, and the game you need help in and why. I read here, best friends hit you up. Everybody has fun. RockonHowLib1996 writes in. He needs help on PlayStation for his PSN is RockonHowLib1996. This is a different kind of squad up. I was wondering if there's a Destiny 2 Kinda Funny Best Friends clan. I checked out the forum and nothing concrete comes up and searching Bungie's website doesn't show anything. I wanted to join a clan so me and some best friends can play Destiny 2 together. And since clans are better integrated this time around with the advantages of joining clans like rewards for completing stuff as a clan and clan banners and such, I",
      "start": 3243.56
    },
    {
      "text": "Can play Destiny 2 together. And since clans are better integrated this time around with the advantages of joining clans like rewards for completing stuff as a clan and clan banners and such, I thought it would be great if there is one. Please shoot me a message on PSN if there isn't. Should we create one to raid and explore together? I saw some kind of buzz about this on the subreddit for Kinda Funny. Alright, I am challenging everyone to figure it out and do one. I don't want **** 15 Kinda Funny ones. I want to join one and just have it be the one. So I need the forums and the the Reddit and the Facebook uniting your trilogy here. Discord, you're in there somewhere too. I don't know your platform exactly and figure out how we get one, just a funny Destiny 2 clan together so we can all join and have a good time. Danny, yes sir. What do we get wrong? Then we got a couple. Remember if you're watching the show live on Twitch, you can go to kindafunny.com/yourewrong. Tell us what we",
      "start": 3295.89
    },
    {
      "text": "And have a good time. Danny, yes sir. What do we get wrong? Then we got a couple. Remember if you're watching the show live on Twitch, you can go to kindafunny.com/yourewrong. Tell us what we screwed up. Alright, Capitalist Pig. First of all, XCOM 2: War of the Chosen only comes in on PC today. The Kotaku article was wrong. It's a in Kotaku. Xbox One, PS4, September 1st. They here and much I like to go. Absolver also not on Xbox One and PS4 and PC only. Xbox tomorrow. I guess are fact checking these Kotaku kids. We also have editorializing happening there. Titanfall 2. Greg, the Friday the 13th update brought bug fixes and small maps, but not any of the new DLC like the Spring Break costumes. Somebody told me those are coming soon. Okay, my apologies. Until Dolan actually came in August, the end of August. Not really. Yeah, we forgot a game. We forgot this two little gem on the PlayStation Vita called Licky the Lucky Lizard Lives Again. I heard until I heard it. I think it's from the people who made",
      "start": 3336.42
    },
    {
      "text": "August. Not really. Yeah, we forgot a game. We forgot this two little gem on the PlayStation Vita called Licky the Lucky Lizard Lives Again. I heard until I heard it. I think it's from the people who made that Tug game nobody liked. Okay. Oh, Tony the Tiger. No, no. Tugs Again His Tail, Tug His Tail. That's what he's tugging. Alright. Came in a crop. Assassin's Creed's trailer was by Leonard Cohen. So I was right actually. It was that icon. Yeah, you want a talker. Uh-huh. And I think that's it, buddy. Oh, very important one from Spasm Gasm. Adult cats are generally lactose intolerant. Doesn't stop him licking that cream though. Photo segment. Everybody's Golf is awesome. Sean Patrick wrote into KindaFunny.com/kfgd and says, Greg, not so much a question, but more of an excellent. We state meant Everybody's Golf is **** awesome. Like you said on Instagram, it's everything we've wanted in a Hot Shots golf game for years. The open-world, razor-sharp controls and pure fun with the gameplay all adds up to one",
      "start": 3385.86
    },
    {
      "text": "Is **** awesome. Like you said on Instagram, it's everything we've wanted in a Hot Shots golf game for years. The open-world, razor-sharp controls and pure fun with the gameplay all adds up to one fantastic gaming experience. So where's the love for the major review slash outlets? I'd love to spend my day on the links. However, eighth-grade English won't teach itself. Loved all of you as always. Sean Patrick. Was there early copies of attempt at people? There were. But I, so this is something interesting. The other day on Twitter, a best friend hit me up and it was just at GameOverGreggy. He explained at Dan Stapleton why Hot Shots matters. And I was like, what? And I clicked in and it was Dan at IGN. Somebody asked him like, hey, when's the Hot Shots review going or Everybody's Golf would be going up? And he's like, we're not doing one, right? He's like, I know. I'm not saying the game's bad. It's just that nobody this through many tweets",
      "start": 3442.83
    },
    {
      "text": "He's like, we're not doing one, right? He's like, I know. I'm not saying the game's bad. It's just that nobody this through many tweets, obviously, is just like nobody really cared when we put it up, right? And this kid, this guy was writing me like, I know you got a kid with some otherwise, Greg. And I'm like, no. Like that's what's awesome about right now is the fact that, hey, guess what? Like the smallest game will get covered by somebody, a smaller site that has a passion for it and has a history in it. Stuff. I totally get why and Everybody's Golf might not make sense for IGN review. Any reveal, any organization has to pick their battles. And you may remember 0 minutes ago the amount of games we listed all exactly releases. And then imagine that for the next month. Yeah, people already have games and there's a reason you're not coming to us for Absolver news, right? Because it's like we haven't. You got to play your passions and do what",
      "start": 3481.44
    },
    {
      "text": "That for the next month. Yeah, people already have games and there's a reason you're not coming to us for Absolver news, right? Because it's like we haven't. You got to play your passions and do what your audience wants. Our audience is a PlayStation based audience. They love this stuff. That's why we're about to stream Everybody's Golf for four hours playing with Twitch subs. But I won't bend your ear about it, YouTube and podcast kids instead. Well, thank you all for listening. The Kinda Funny Games Daily. Remember each and every weekday on a variety of platforms, we run you through the video game news you need to know about. You need to be part of the show by going to KindaFunny.com/KFGD. Leave questions for tomorrow based on the biggest news of the day. And remember, it'll be Andrea on the show with me. Golf now. I'm back Thursday. Danny's back Thursday. If you don't get that out there to Pax. C's Kinda Patreon's are happening. If you tipped it in to the the Twitch, we do give it to the hurricane",
      "start": 3518.25
    },
    {
      "text": "With me. Golf now. I'm back Thursday. Danny's back Thursday. If you don't get that out there to Pax. C's Kinda Patreon's are happening. If you tipped it in to the the Twitch, we do give it to the hurricane folks. Oh yeah, that's the big stuff. I'm gonna go get into my golf gear. Until next time, ladies and gentlemen, it's been our pleasure to serve you.",
      "start": 3551.46
    }
  ]
}
